//3.2.5
&НаКлиенте
Процедура ЗагрузитьОстатки(Команда)
	
	Если ЗначениеЗаполнено(Склад) И ЗначениеЗаполнено(ЯчейкаПриемник) Тогда
		ЗагрузитьОстаткиНаСервере(Склад, ЯчейкаПриемник);
	Иначе
		ПоказатьПредупреждение(,"Не выбран  склад или ячейка приемник!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОстаткиНаСервере(Склад, ЯчейкаПриемник)
	
	ТаблицаОстатковСклада = ПолучитьОстаткиПоВыбранномуСкладу(Склад);
	
	СоздатьОперациюПоЯчейкамДляРазмещенияОстатковНаЯчейку(ЯчейкаПриемник, ТаблицаОстатковСклада);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстаткиПоВыбранномуСкладу(Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстатки.Серия КАК Серия,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	ТаблицаТоваровНаОстатках = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТоваровНаОстатках;
	
КонецФункции

&НаСервере
Процедура СоздатьОперациюПоЯчейкамДляРазмещенияОстатковНаЯчейку(ЯчейкаПриемник, ТаблицаОстатковСклада)
	
	ДокОбъект = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
	ДокОбъект.Дата = ТекущаяДатаСеанса();
	ДокОбъект.Готов = Истина;
	ДокОбъект.ВремяНачалаОперации = ТекущаяДатаСеанса();
	
	Для каждого СтрокаИсточник Из ТаблицаОстатковСклада Цикл
		
		СтрокаПриемник = ДокОбъект.Товары.Добавить();
		СтрокаПриемник.Товар = СтрокаИсточник.Номенклатура;
		СтрокаПриемник.ЯчейкаПриемник = ЯчейкаПриемник;
		СтрокаПриемник.Качество = Перечисления.вмс_КачествоТовара.Новый;
		ЗаполнитьЗначенияСвойств(СтрокаПриемник,СтрокаИсточник);
		
	КонецЦикла;
	
	ДокОбъект.Комментарий = "" + ЯчейкаПриемник + " - загрузка остатков по складу на ячейку. Создан автоматически. Отвественный: " + Пользователи.АвторизованныйПользователь();
	
	ДокОбъект.ВремяОкончанияОперации = ТекущаяДатаСеанса();
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Сообщить("Создан документ - " + ДокОбъект.Ссылка);
	
КонецПроцедуры

//3.2.5

