#Область ПрограммныйИнтерфейс

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция МассивВСтроку(Массив, Разделитель=", ") Экспорт
	
	Строка = "";
	
	Если Массив.Количество() > 0 Тогда
		Для Каждого Элемент Из Массив Цикл
			Строка = Строка + Разделитель + Элемент;
		КонецЦикла;
		
		Строка = Прав(Строка, СтрДлина(Строка)-СтрДлина(Разделитель));
	КонецЕсли;
	
	Возврат Строка;
				
КонецФункции

Функция СтрокуВМассив(знач Строка, Разделитель=",", УбратьЛишниеПробелы=Истина, ДобавлятьПустуюСтроку=Ложь) Экспорт
	
	Массив = Новый Массив;
	
	Если УбратьЛишниеПробелы Тогда
		Строка = СокрЛП(Строка);
	КонецЕсли;
	
	ДлинаСтроки = СтрДлина(Строка);
	ДлинаРазделителя = СтрДлина(Разделитель);
	
	Если ДлинаСтроки = 0 Тогда
		Если ДобавлятьПустуюСтроку Тогда
			Массив.Добавить("");
		КонецЕсли; 
		
		Возврат Массив;
	КонецЕсли; 
	
	Пока ДлинаСтроки > 0 Цикл
		Позиция = Найти(Строка, Разделитель);
		Если Позиция = 0 Тогда
			Слово = Строка;
			ДлинаСтроки = 0;
		Иначе
			Слово = Лев(Строка, Позиция-1);
			ДлинаСтроки = ДлинаСтроки - (Позиция+ДлинаРазделителя-1);
			Строка = Прав(Строка, ДлинаСтроки);
		КонецЕсли;
		
		Если УбратьЛишниеПробелы Тогда
			Слово = СокрЛП(Слово);
		КонецЕсли;
		
		Массив.Добавить(Слово);
	КонецЦикла; 
	
	Возврат Массив;
	
КонецФункции

Функция СтрокуВМассивПосимвольно(Строка) Экспорт
	МассивСимволов = Новый Массив;
	ДлинаСтроки = СтрДлина(Строка);
	Для НомерСимвола=1 По ДлинаСтроки Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		МассивСимволов.Добавить(Символ);
	КонецЦикла;
	Возврат МассивСимволов;
КонецФункции

Функция МассивСНеопределено(знач Строка, Разделитель=",", УбратьЛишниеПробелы=Истина, ДобавлятьПустуюСтроку=Ложь) Экспорт
	Результат = СтрокуВМассив(Строка, Разделитель, УбратьЛишниеПробелы, ДобавлятьПустуюСтроку); 
	
	Для Индекс = 0 По Результат.Количество()-1 Цикл
		Результат[Индекс] = СокрЛП(Результат[Индекс]);
		Если Результат[Индекс] = "Неопределено" Тогда
			Результат[Индекс] = Неопределено;		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ДобавитьЗначенияВСтроку(Строка, Значения, Разделитель=", ") Экспорт
	
	МассивЗначений = ЗначениеВМассив(Значения, , Ложь, Ложь);

	Если ТипЗнч(Строка) <> Тип("Строка") Тогда
		Строка = "";
	КонецЕсли;
	
	ПустаяСтрока = ПустаяСтрока(Строка);
	
	Для Каждого Значение Из МассивЗначений Цикл
		
		Если ПустаяСтрока Тогда
			ПустаяСтрока = Ложь;
		Иначе
			Строка = Строка + Разделитель;
		КонецЕсли;
		
		Строка = Строка + Значение;
		
	КонецЦикла;
	
КонецФункции

Функция ВрезатьСтроку(Текст, СтрокаВставки, знач Позиция, ПозицияДоСтрока, ПозицияПослеСтрока) Экспорт
	
	Если ТипЗнч(Позиция) <> Тип("Число") Тогда
		Позиция = СтрНайти(Текст, Позиция);
	КонецЕсли;

	Если Позиция = 0 Тогда
		Возврат Текст;
	КонецЕсли;
	
	ТекстЛев = Лев(Текст, Позиция-1);
	ТекстПрав = Сред(Текст, Позиция);
	
	ПозицияДо = СтрНайти(ТекстЛев, ПозицияДоСтрока, НаправлениеПоиска.СКонца);
	ТекстЛев = Лев(ТекстЛев, ПозицияДо-1+СтрДлина(ПозицияДоСтрока));
	
	ПозицияПосле = СтрНайти(ТекстПрав, ПозицияПослеСтрока);
	ТекстПрав = Сред(ТекстПрав, ПозицияПосле);
	
	Возврат ТекстЛев + СтрокаВставки + ТекстПрав;
	
КонецФункции

Функция ВычленитьСтроку(Текст, ТекстВнутри, ТекстГраницаСлева, ТекстГраницаСправа) Экспорт
	
	Позиция = СтрНайти(Текст, ТекстВнутри);

	Если Позиция = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЛев = Лев(Текст, Позиция-1);
	
	ПозицияЛев = СтрНайти(ТекстЛев, ТекстГраницаСлева, НаправлениеПоиска.СКонца);
	Если ПозицияЛев = 0 Тогда
		Возврат "";
	КонецЕсли;
	ПозицияЛев = ПозицияЛев + СтрДлина(ТекстГраницаСлева);
	
	НачалоТекстаПрав = Позиция + СтрДлина(ТекстВнутри);
	ТекстПрав = Сред(Текст, НачалоТекстаПрав);
	ПозицияПрав = СтрНайти(ТекстПрав, ТекстГраницаСправа);
	Если ПозицияПрав = 0 Тогда
		Возврат "";
	КонецЕсли;
	ПозицияПрав = НачалоТекстаПрав-1 + ПозицияПрав-1;
	
	Строка = Сред(Текст, ПозицияЛев, ПозицияПрав-ПозицияЛев+1);
	
	Возврат Строка;
	
КонецФункции

Функция ЗакодироватьСтрокуВМассивКодов(Строка) Экспорт
	МассивКодов = Новый Массив;
	ДлинаСтроки = СтрДлина(Строка);
	Для НомерСимвола=1 По ДлинаСтроки Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		МассивКодов.Добавить(КодСимвола(Символ));
	КонецЦикла;
	Возврат МассивКодов;
КонецФункции

Функция ПолучитьСтрокуИзМассиваКодов(МассивКодов) Экспорт
	Строка = "";
	Для Каждого КодСимвола Из МассивКодов Цикл
		Строка = Строка + Символ(КодСимвола);
	КонецЦикла;
	Возврат Строка;
КонецФункции

Функция ЗаменитьЗначенияОбъекта(Объект, Что, Чем) Экспорт
	
	МассивСсылок = РазложитьСтруктуруДанныхВМассивСсылокНаЗначения(Объект);
	КоличествоЗамен = 0;
	
	Для Каждого Ссылка Из МассивСсылок Цикл
		
		Если Ссылка.Значение=Что Тогда
			Ссылка.Коллекция[Ссылка.ИмяПоля] = Чем;
			КоличествоЗамен = КоличествоЗамен + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КоличествоЗамен;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция СкопироватьКоллекцию(Коллекция, Строки=Неопределено) Экспорт
	
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Если ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда
			Возврат СкопироватьТаблицуЗначений(Коллекция, Строки);
		КонецЕсли;
	#КонецЕсли
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		Возврат СкопироватьКвазиТаблицуЗначений(Коллекция, Строки);
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьЭлементыКоллекции(Коллекция) Экспорт
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		Возврат Коллекция.Строки;
	КонецЕсли;
	
	Если ТипЗнч(Коллекция) = Тип("Строка") Тогда
		Возврат СтрокуВМассив(Коллекция);
	КонецЕсли;
	
	Возврат Коллекция;
	
КонецФункции

Функция ПолучитьКолонкиКоллекции(знач Коллекция, ИсключитьКолонки=Неопределено) Экспорт
	
	МассивКолонок = Неопределено;
	
	Если ТипЗнч(Коллекция)=Тип("Массив") И Коллекция.Количество() > 0 Тогда
		Элемент = Коллекция[0];
		Если ТипЗнч(Элемент)=ТипСтрокаТаблицыЗначений() Тогда
			Коллекция = Элемент.Владелец();
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоТаблицаЗначений(Коллекция) Тогда
		МассивКолонок = ВыгрузитьЗначенияКолонокКоллекции(Коллекция.Колонки, "Имя");
	ИначеЕсли ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		МассивКолонок = ВыгрузитьЗначенияКолонокКоллекции(Коллекция.Колонки, "Ключ");
	КонецЕсли;
	
	Если МассивКолонок <> Неопределено Тогда
		Если ИсключитьКолонки <> Неопределено Тогда
			ВычестьМассив(МассивКолонок, ИсключитьКолонки);
		КонецЕсли;
		Возврат МассивКолонок;
	КонецЕсли;
	
КонецФункции

Функция НоваяКоллекцияЗначений(Колонки=Неопределено, Тип=Неопределено) Экспорт
	
	Если Тип=Неопределено Тогда
		#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
			ИмяТипа = "ТаблицаЗначений";
		#Иначе
			ИмяТипа = "КвазиТаблицаЗначений";
		#КонецЕсли
	Иначе
		
		ИмяТипа = Строка(Тип);
		ИмяТипа = СтрЗаменить(ИмяТипа, " ", "");
		
	КонецЕсли;
	
	ИмяТипа = нрег(ИмяТипа);
	
	Если ИмяТипа="таблицазначений" Тогда
		
		Коллекция = НоваяТаблицаЗначений(Колонки);
		
	Иначе
		
		Коллекция = НоваяКвазиТаблицаЗначений(Колонки);
		
	КонецЕсли;
	
	Возврат Коллекция;
	
КонецФункции

Функция НовыйЭлементКоллекции(Коллекция) Экспорт
	
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Если ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда
			Возврат Коллекция.Добавить();
		КонецЕсли;
#КонецЕсли
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		Возврат ДобавитьСтрокуКвазиТаблицыЗначений(Коллекция);
	КонецЕсли;
	
КонецФункции

Функция ЗагрузитьКоллекциюЗначенийИзТабличногоДокумента(ТабличныйДокумент, ТипКоллекции=Неопределено, НомерПервойСтроки=1) Экспорт
	
	НомерСтроки = НомерПервойСтроки;
	НомерКолонки = 1;
	Колонки = Новый Массив;
	Для НомерКолонки=1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ИмяКолонки = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Текст;
		Если Не ЗначениеЗаполнено(ИмяКолонки) Тогда
			Прервать;
		КонецЕсли;
		Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
	
	Таблица = НоваяКоллекцияЗначений(Колонки, ТипКоллекции);
	Для НомерСтроки=НомерСтроки+1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		СтрокаТаблицы = НовыйЭлементКоллекции(Таблица);
		Для НомерКолонки=1 По Колонки.Количество() Цикл
			Значение = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Текст;
			ИмяКолонки = Колонки[НомерКолонки-1];
			СтрокаТаблицы[ИмяКолонки] = Значение;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ЗагрузитьКоллекциюЗначенийИзМассиваСтруктур(МассивСтруктур, ТипКоллекции=Неопределено, знач Колонки=Неопределено) Экспорт
	
	Если Колонки=Неопределено Тогда
		Если МассивСтруктур.Количество() > 0 Тогда
			ЭлементМассива = МассивСтруктур[0];
			Колонки = Новый Массив;
			Для Каждого КлючЗначение Из ЭлементМассива Цикл
				Колонки.Добавить(КлючЗначение.Ключ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Коллекция = НоваяКоллекцияЗначений(Колонки, ТипКоллекции);
	
	Для Каждого ЭлементМассива Из МассивСтруктур Цикл
		ДобавитьЭлементКоллекции(Коллекция, ЭлементМассива);
	КонецЦикла;
	
	Возврат Коллекция;
	
КонецФункции

Функция УстановитьЭлементыКоллекции(Коллекция, Элементы) Экспорт
	
	УдалитьЭлементыКоллекции(Коллекция);
	
	Возврат ДобавитьЭлементыКоллекции(Коллекция, Элементы);
	
КонецФункции

Функция ДобавитьЭлементыКоллекции(Коллекция, Элементы) Экспорт

	МассивЭлементов = ПолучитьЭлементыКоллекции(Элементы);
	
	Если ТипЗнч(Коллекция) = Тип("Массив") Тогда
		
		Для Каждого Элемент Из МассивЭлементов Цикл
			Коллекция.Добавить(Элемент);
		КонецЦикла;
		
	ИначеЕсли ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		
		ДобавитьСтрокиКвазиТаблицыЗначений(Коллекция, МассивЭлементов);
		
	ИначеЕсли ТипЗнч(Коллекция) = Тип("Структура") ИЛИ ТипЗнч(Коллекция) = Тип("Соответствие") Тогда
		
		Если ТипЗнч(МассивЭлементов) = Тип("Структура") ИЛИ ТипЗнч(МассивЭлементов) = Тип("Соответствие") Тогда
			
			Для Каждого Элемент Из МассивЭлементов Цикл
				
				Коллекция.Вставить(Элемент.Ключ, Элемент.Значение);
				
			КонецЦикла; 
			
		КонецЕсли;
		
	ИначеЕсли МассивЭлементов <> Неопределено Тогда
		
		Для Каждого Элемент Из МассивЭлементов Цикл
			НовыйЭлемент = Коллекция.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элемент);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Коллекция;
	
КонецФункции

Функция ДобавитьЭлементКоллекции(Коллекция, ДанныеЭлемента=Неопределено) Экспорт
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		
		НовыйЭлемент = ДобавитьСтрокуКвазиТаблицыЗначений(Коллекция, ДанныеЭлемента);
		
	Иначе
		
		НовыйЭлемент = Коллекция.Добавить();
		Если ДанныеЭлемента <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ДанныеЭлемента);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция ДобавитьКолонкуКоллекции(Коллекция, Имя, Тип=Неопределено, Заголовок="", Ширина=0) Экспорт
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		
		Колонка = ДобавитьКолонкуКвазиТаблицыЗначений(Коллекция, Имя, Тип);
		
	Иначе
		
		Колонка = Коллекция.Колонки.Добавить(Имя, Тип, Заголовок, Ширина);
		
	КонецЕсли;
	
	Возврат Колонка;
	
КонецФункции

Функция ИнвертироватьЗначенияКоллекции(Коллекция, КолонкиКоллекции=Неопределено) Экспорт

	Если КолонкиКоллекции <> Неопределено Тогда
		МассивКолонокКоллекции = ЗначениеВМассив(КолонкиКоллекции);
	КонецЕсли;
	
	ЭлементыКоллекции = ПолучитьЭлементыКоллекции(Коллекция);
	
	Если КолонкиКоллекции <> Неопределено Тогда
		Для Каждого ЭлементКоллекции Из ЭлементыКоллекции Цикл
			Для Каждого Колонка Из МассивКолонокКоллекции Цикл
				ЭлементКоллекции[Колонка] = -ЭлементКоллекции[Колонка];
			КонецЦикла;
		КонецЦикла;
	Иначе
		Для Индекс=0 По ЭлементыКоллекции.ВГраница() Цикл
			ЭлементыКоллекции[Индекс] = -ЭлементыКоллекции[Индекс];
		КонецЦикла;
	КонецЕсли;

КонецФункции

Функция ПолучитьИтогКоллекции(Коллекция, ПолеИтога) Экспорт
	
	Возврат ПолучитьИтогиКоллекции(Коллекция, ПолеИтога)[ПолеИтога];
	
КонецФункции

Функция ПолучитьИтогиКоллекции(Коллекция, ПоляИтогов) Экспорт
	
	ПоляИтоговМассив = ЗначениеВМассив(ПоляИтогов);
	Итоги = Новый Структура;
	Для Каждого ПолеИтога Из ПоляИтоговМассив Цикл
		Итоги.Вставить(ПолеИтога, 0);
	КонецЦикла;
	
	ТипЧисло = Тип("Число");
	
	Для Каждого Элемент Из ПолучитьЭлементыКоллекции(Коллекция) Цикл
		Для Каждого ПолеИтога Из ПоляИтоговМассив Цикл
			Значение = Элемент[ПолеИтога];
			Если ТипЗнч(Значение) = ТипЧисло Тогда
				Итоги[ПолеИтога] = Итоги[ПолеИтога] + Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Итоги;
	
КонецФункции

Функция ОчиститьЭлементыКоллекции(Коллекция) Экспорт
	
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Если ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда
			Коллекция.Очистить();
		КонецЕсли;
	#КонецЕсли
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		УдалитьСтрокиКвазиТаблицыЗначений(Коллекция);
	КонецЕсли; 
	
КонецФункции

// Возвращает таблицу, в которой указаны прямые и косвенные (через другие элементы) связи элементов из таблицы иерархии элементов (элемент-родитель) с только непосредственными связями
//
// Параметры:
//  - ТаблицаЭлементов - Таблица элементов с колонками типа "Элемент", "Родитель элемента"
//  - КолонкаЭлемента - Строка, Имя колонки элемента
//  - КолонкаРодителяЭлемента - Строка, Имя колонки родителя элемента
//
// Возвращаемое значение:
//  - ТаблицаЗначений - Таблица всех связей элементов
//
Функция ПостроитьТаблицуБлизостиЭлементов(ТаблицаЭлементов, КолонкаРодителяЭлемента, КолонкаЭлемента) Экспорт
	
	ТаблицаБлизостиЭлементов = СкопироватьКоллекцию(ТаблицаЭлементов);
	
	ОтборПоРодителю = Новый Структура;
	ОтборПоРодителю.Вставить(КолонкаРодителяЭлемента);
	
	//ОтборПоСвязи = Новый Структура;
	//ОтборПоСвязи.Вставить(КолонкаРодителяЭлемента);
	//ОтборПоСвязи.Вставить(КолонкаЭлемента);
	
	// добавим транзитивные связи элементов через другие элементы
	Для Каждого СтрокаРодителя Из ПолучитьЭлементыКоллекции(ТаблицаБлизостиЭлементов) Цикл
		ОтборПоРодителю[КолонкаРодителяЭлемента] = СтрокаРодителя[КолонкаЭлемента];
		СтрокиТранзита = НайтиЭлементыКоллекции(ТаблицаБлизостиЭлементов, ОтборПоРодителю);
		Для Каждого СтрокаТранзита Из СтрокиТранзита Цикл
			//ОтборПоСвязи[КолонкаРодителяЭлемента] = СтрокаРодителя[КолонкаРодителяЭлемента];
			//ОтборПоСвязи[КолонкаЭлемента] = СтрокаТранзита[КолонкаЭлемента];
			//Если НайтиЭлементКоллекции(ТаблицаБлизостиЭлементов, ОтборПоСвязи)=Неопределено Тогда
				СтрокаТранзитнойСвязи = ДобавитьЭлементКоллекции(ТаблицаБлизостиЭлементов);
				ЗаполнитьЗначенияСвойств(СтрокаТранзитнойСвязи, СтрокаТранзита);
				СтрокаТранзитнойСвязи[КолонкаЭлемента] = СтрокаТранзита[КолонкаЭлемента];
				СтрокаТранзитнойСвязи[КолонкаРодителяЭлемента] = СтрокаРодителя[КолонкаРодителяЭлемента];
				ИндексироватьКоллекцию(ТаблицаБлизостиЭлементов, СтрокаТранзитнойСвязи);
			//КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаБлизостиЭлементов;
	
КонецФункции

// Параметры
//	СписокКолонок - список имен добавляемых колонок
//	Источник - свойства колонок (ТаблицаЗначений, КолонкиТаблицыЗначений, Строка, Массив)
Функция ДополнитьКолонкиТаблицыЗначений(Таблица, знач СписокКолонок=Неопределено, знач Источник=Неопределено) Экспорт
	
	Если Не ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если ТипЗнч(Источник) = Тип("ТаблицаЗначений") Тогда
		Источник = Источник.Колонки;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("КоллекцияКолонокТаблицыЗначений") Тогда
		Если СписокКолонок = Неопределено Тогда
			СписокКолонок = ВыгрузитьЗначенияКолонкиКоллекции(Источник, "Имя");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник)=Тип("Строка") Тогда
		СписокКолонок = СтрокуВМассив(Источник);
		Источник = Неопределено;
	ИначеЕсли ТипЗнч(Источник)=Тип("Массив") Тогда
		СписокКолонок = Источник;
		Источник = Неопределено;
	Иначе
		Источник = Неопределено;
	КонецЕсли;
	
	МассивКолонок = ЗначениеВМассив(СписокКолонок);
	Для Каждого ИмяКолонки Из МассивКолонок Цикл
		Если Таблица.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
			Если Источник <> Неопределено Тогда
				КолонкаИсточника = Источник.Найти(ИмяКолонки);
				Если КолонкаИсточника <> Неопределено Тогда
					ТипЗначения = КолонкаИсточника.ТипЗначения;
					Заголовок = КолонкаИсточника.Заголовок;
					Ширина = КолонкаИсточника.Ширина;
				Иначе
					ТипЗначения = Неопределено;
					Заголовок = Неопределено;
					Ширина = Неопределено;
				КонецЕсли; 
			КонецЕсли; 
			НоваяКолонка = Таблица.Колонки.Добавить(ИмяКолонки, ТипЗначения, Заголовок, Ширина);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЭтоЦифра(Символ) Экспорт
	
	Возврат Найти(Символ, "1234567890") <> Неопределено;
	
КонецФункции

Функция СтрокуВМассивСепарироватьЦифры(Строка) Экспорт
	
	МассивЭлементов = Новый Массив;
	СимволЦифровой = Ложь;
	Элемент = "";
	Для НомерСимвола=1 По СтрДлина(Строка) Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		ПредыдущийСимволЦифровой = СимволЦифровой;
		СимволЦифровой = вмс_РаботаСКоллекциямиПовтИсп.ЭтоЦифровойСимвол(Символ);
		Если СимволЦифровой <> ПредыдущийСимволЦифровой Тогда
			Если Элемент <> "" Тогда
				МассивЭлементов.Добавить(Элемент);
				Элемент = "";
			КонецЕсли;
		КонецЕсли;
		Элемент = Элемент + Символ;
	КонецЦикла;
	
	Если Элемент <> "" Тогда
		МассивЭлементов.Добавить(Элемент);
	КонецЕсли;
	
	Возврат МассивЭлементов;
	
КонецФункции

Функция ДобавитьЛидирующиеНулиЧиселВСтроке(Строка, КоличествоРазрядов) Экспорт
	
	МассивЭлементов = СтрокуВМассивСепарироватьЦифры(Строка);

	НоваяСтрока = "";
	ФорматнаяСтрока = "ЧЦ=" + Формат(КоличествоРазрядов, "ЧГ=0") + "; ЧН=; ЧВН=; ЧГ=0";
	Для Каждого Элемент Из МассивЭлементов Цикл
		Символ = Лев(Элемент, 1);
		Если вмс_РаботаСКоллекциямиПовтИсп.ЭтоЦифровойСимвол(Символ) Тогда
			Элемент = Формат(Число(Элемент), ФорматнаяСтрока);
		КонецЕсли;
		НоваяСтрока = НоваяСтрока + Элемент;
	КонецЦикла;
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция ПолучитьСинонимИзИмени(Имя) Экспорт

	Слова = Новый Массив;
	
	ДлинаИмени = СтрДлина(Имя);
	ВР0 = Неопределено;
	ВР1 = Неопределено;
	Ч0 = Неопределено;
	Ч1 = Неопределено;
	НачалоСлова = 1;
	Для НомерСимвола=1 По ДлинаИмени Цикл
		Символ = Сред(Имя, НомерСимвола, 1);
		ВР1 = ВРег(Символ) = Символ И НРег(Символ) <> Символ;
		Ч1 = ЭтоЦифра(Символ);
		Если ВР1 = Истина И ВР0 = Ложь ИЛИ Ч1 = Истина И Ч0 = Ложь ИЛИ Ч1 = Ложь И Ч0 = Истина Тогда
			Если НачалоСлова < НомерСимвола Тогда
				Слово = Сред(Имя, НачалоСлова, НомерСимвола-НачалоСлова);
				Слова.Добавить(НРег(Слово));
				НачалоСлова = НомерСимвола;
			КонецЕсли;
		КонецЕсли;
		ВР0 = ВР1;
		Ч0 = Ч1;
	КонецЦикла;
	
	Если НачалоСлова < НомерСимвола Тогда
		Слово = Сред(Имя, НачалоСлова, НомерСимвола-НачалоСлова);
		Слова.Добавить(НРег(Слово));
	КонецЕсли;
	
	Синоним = МассивВСтроку(Слова, " ");
	Синоним = ВРег(Лев(Синоним, 1)) + Прав(Синоним, СтрДлина(Синоним)-1);
	Возврат Синоним;
	
КонецФункции

Функция ПолучитьСочетанияЭлементов(Данные) Экспорт
	
	МассивСочетаний = Новый Массив;

	МассивДвумерный = Новый Массив;
	ТипЗначения = ТипЗнч(Данные);
	ТипМассив = Тип("Массив");
	ТипСтруктура = Тип("Структура");
	Если ТипЗначения = ТипМассив Тогда
		Для Каждого Элемент Из Данные Цикл
			ЗначенияЭлемента = ЗначениеВМассив(Элемент, , Ложь);
			МассивДвумерный.Добавить(ЗначенияЭлемента);
		КонецЦикла;
	ИначеЕсли ТипЗначения = ТипСтруктура Тогда
		ИменаПолей = Новый Массив;
		Для Каждого Элемент Из Данные Цикл
			ИменаПолей.Добавить(Элемент.Ключ);
			ЗначенияЭлемента = ЗначениеВМассив(Элемент.Значение, , Ложь);
			МассивДвумерный.Добавить(ЗначенияЭлемента);
		КонецЦикла;
	Иначе
		Возврат МассивСочетаний;
	КонецЕсли;
	
	МассивИндексный = Новый Массив;
	Для НомерМассива=0 По МассивДвумерный.ВГраница() Цикл
		МассивИндексный.Добавить(0);
	КонецЦикла;
	
	Пока Истина Цикл
		
		Если ТипЗначения = ТипМассив Тогда
			Сочетание = Новый Массив;
			Для НомерИндекса=0 По МассивИндексный.ВГраница() Цикл
				Значение = МассивДвумерный[НомерИндекса][МассивИндексный[НомерИндекса]];
				Сочетание.Добавить(Значение);
			КонецЦикла;
		Иначе
			Сочетание = Новый Структура;
			Для НомерИндекса=0 По МассивИндексный.ВГраница() Цикл
				Значение = МассивДвумерный[НомерИндекса][МассивИндексный[НомерИндекса]];
				ИмяПоля = ИменаПолей[НомерИндекса];
				Сочетание.Вставить(ИмяПоля, Значение);
			КонецЦикла;
		КонецЕсли;
		МассивСочетаний.Добавить(Сочетание);

		Для НомерИндекса=0 По МассивИндексный.ВГраница() Цикл
			Если МассивИндексный[НомерИндекса] = МассивДвумерный[НомерИндекса].ВГраница() Тогда
				МассивИндексный[НомерИндекса] = 0;
			Иначе
				МассивИндексный[НомерИндекса] = МассивИндексный[НомерИндекса] + 1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НомерИндекса > МассивИндексный.ВГраница() Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивСочетаний;
	
КонецФункции

Функция НоваяТаблицаЗначений(знач СписокКолонок=Неопределено, знач Источник=Неопределено) Экспорт
	
	Таблица = Новый("ТаблицаЗначений");
	ДополнитьКолонкиТаблицыЗначений(Таблица, СписокКолонок, Источник);
	Возврат Таблица;
	
КонецФункции

Функция УпорядочитьСтрокиТаблицыЗначенийПоМассиву(Таблица, МассивСтрок)
	
	ИндексСтроки = 0;
	Для Каждого Строка Из МассивСтрок Цикл
		
		ТекущийИндексСтроки = Таблица.Индекс(Строка);
		Если ТекущийИндексСтроки=-1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИндексСтроки <> ТекущийИндексСтроки Тогда
			Таблица.Сдвинуть(ТекущийИндексСтроки, ИндексСтроки-ТекущийИндексСтроки);
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
Функция ЗначениеВТаблицуЗначений(знач Значение, ПолеПоУмолчанию="Объект") Экспорт

	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("ТаблицаЗначений") Тогда
		
		// ужо таблица и есть
		ТаблицаЗначений = Значение;
		
	ИначеЕсли ЭтоКвазиТаблицаЗначений(Значение) Тогда
		
		ТаблицаЗначений = ВыгрузитьКвазиТаблицуЗначенийВИстиннуюТаблицуЗначений(Значение);
		
	Иначе
		
		Если ТипЗначения <> Тип("Массив") Тогда
		
			ЭлементДанных = Значение;
			Значение = Новый Массив;
			Значение.Добавить(ЭлементДанных);
			
		КонецЕсли;
		
		МассивЭлементов = Новый Массив;
		Колонки = Новый Массив;
		
		Для Каждого Элемент Из Значение Цикл
			
			Если ТипЗнч(Элемент) = Тип("Структура") Тогда
				ЭлементСтруктура = Элемент;
			Иначе
				ЭлементСтруктура = Новый Структура(ПолеПоУмолчанию, Элемент);
			КонецЕсли;
			
			МассивЭлементов.Добавить(ЭлементСтруктура);
			
			Для Каждого Поле Из ЭлементСтруктура Цикл
				Если Колонки.Найти(Поле.Ключ) = Неопределено Тогда
					Колонки.Добавить(Поле.Ключ);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		ТаблицаЗначений = Новый ТаблицаЗначений;
		Для Каждого Колонка Из Колонки Цикл
			ТаблицаЗначений.Колонки.Добавить(Колонка);
		КонецЦикла;
		
		Значение = Неопределено;
		Для Каждого ЭлементСтруктура Из МассивЭлементов Цикл
			СтрокаТаблицыЗначений = ТаблицаЗначений.Добавить();
			Для Каждого Колонка Из Колонки Цикл
				Если Не ЭлементСтруктура.Свойство(Колонка, Значение) Тогда
					Значение = Null;
				КонецЕсли;
				СтрокаТаблицыЗначений[Колонка] = Значение;
			КонецЦикла;
		КонецЦикла;
			
	КонецЕсли;
	
	Возврат ТаблицаЗначений;

КонецФункции
#КонецЕсли

Функция СтрокуТаблицыЗначенийВСтруктуру(Строка) Экспорт
	
	Структура = Новый Структура;
	Таблица = Строка.Владелец();
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		ИмяЯчейки = Колонка.Имя;
		Структура.Вставить(ИмяЯчейки, Строка[ИмяЯчейки]);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

Функция ВыгрузитьКоллекциюВМассивСтруктур(Коллекция) Экспорт
	
	ПоляСтроки = МассивВСтроку(ПолучитьКолонкиКоллекции(Коллекция));
	
	МассивСтруктур = Новый Массив;
	Для Каждого СтрокаКоллекции Из ПолучитьЭлементыКоллекции(Коллекция) Цикл
		Структура = Новый Структура(ПоляСтроки);
		ЗаполнитьЗначенияСвойств(Структура, СтрокаКоллекции);
		МассивСтруктур.Добавить(Структура);
	КонецЦикла;
	
	Возврат МассивСтруктур;
	
КонецФункции

Функция ДобавитьСтрокуТЗ(ТЗ, Поле1, Поле2=Неопределено, Поле3=Неопределено, Поле4=Неопределено, Поле5=Неопределено) Экспорт
	
	Количество = ТЗ.Колонки.Количество();
	Стр = ТЗ.Добавить();
	Если Количество > 0 Тогда
		Стр.Установить(0, Поле1);
		Если Количество > 1 Тогда
			Стр.Установить(1, Поле2);
			Если Количество > 2 Тогда
				Стр.Установить(2, Поле3);
				Если Количество > 3 Тогда
					Стр.Установить(3, Поле4);
					Если Количество > 4 Тогда
						Стр.Установить(4, Поле5);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Стр;
	
КонецФункции

Функция СортироватьКоллекцию(Коллекция, СтрокаСортировки=Неопределено, знач НачальныйИндекс=Неопределено, знач КонечныйИндекс=Неопределено) Экспорт
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		
		Возврат СортироватьКвазиТаблицуЗначений(Коллекция, СтрокаСортировки);
		
	КонецЕсли;
	
	Если Не (СтрокаСортировки <> Неопределено И ЗначениеЗаполнено(СтрокаСортировки)) Тогда
		Возврат СортироватьКоллекциюОбщ(Коллекция, , НачальныйИндекс, КонечныйИндекс);
	КонецЕсли;
	
	// получить поля сортировки из строки сортировки
	ПоляСортировки = ЗначениеВМассив(СтрокаСортировки);
	ПоляСортировки2 = Новый Массив;
	Для Каждого ПолеСортировкиСтрока Из ПоляСортировки Цикл
		ПолеСортировкиМассив = СтрокуВМассив(ПолеСортировкиСтрока, " ");
		ПолеСортировки = Новый Структура;
		ПолеСортировки.Вставить("Имя", ПолеСортировкиМассив[0]);
		ПолеСортировки.Вставить("ПоВозрастанию", Истина);
		Если ПолеСортировкиМассив.Количество() > 1 Тогда
			Если НРег(ПолеСортировкиМассив[1]) = "убыв" Тогда
				ПолеСортировки.ПоВозрастанию = Ложь;
			КонецЕсли;
		КонецЕсли;
		ПоляСортировки2.Добавить(ПолеСортировки);
	КонецЦикла;
	ПоляСортировки = ПоляСортировки2;
	
	///////////////////////////////////////////////
	Если НачальныйИндекс = Неопределено Тогда
		НачальныйИндекс = 0;
	КонецЕсли;
	
	Если КонечныйИндекс = Неопределено Тогда
		КонечныйИндекс = Коллекция.Количество()-1;
	КонецЕсли;
	
	ДиапазоныСортировки = Новый Массив;
	ДиапазоныСортировки.Добавить(Новый Структура("НачальныйИндекс, КонечныйИндекс", НачальныйИндекс, КонечныйИндекс));
	
	Для Каждого ПолеСортировки Из ПоляСортировки Цикл
		
		ИмяПоля = ПолеСортировки.Имя;
		ДиапазоныСортировки2 = Новый Массив;
		
		Для Каждого ДиапазонСортировки Из ДиапазоныСортировки Цикл
			
			СортироватьКоллекциюОбщ(Коллекция, ИмяПоля, ДиапазонСортировки.НачальныйИндекс, ДиапазонСортировки.КонечныйИндекс, ПолеСортировки.ПоВозрастанию);
			
			Если ДиапазонСортировки.КонечныйИндекс > ДиапазонСортировки.НачальныйИндекс Тогда
				Индекс = ДиапазонСортировки.НачальныйИндекс;
				Значение0 = Коллекция[Индекс][ИмяПоля];
				Индекс0 = Индекс;
				Для Индекс=Индекс+1 По ДиапазонСортировки.КонечныйИндекс Цикл
					Значение = Коллекция[Индекс][ИмяПоля];
					Если Значение <> Значение0 Тогда
						Если Индекс - Индекс0 > 1 Тогда
							ДиапазоныСортировки2.Добавить(Новый Структура("НачальныйИндекс, КонечныйИндекс", Индекс0, Индекс-1));
						КонецЕсли; 
						Значение0 = Значение;
						Индекс0 = Индекс;
					КонецЕсли; 
				КонецЦикла;
				
				Если Индекс - Индекс0 > 1 Тогда
					ДиапазоныСортировки2.Добавить(Новый Структура("НачальныйИндекс, КонечныйИндекс", Индекс0, Индекс-1));
				КонецЕсли; 
			КонецЕсли;
			
			ДиапазоныСортировки = ДиапазоныСортировки2;
			
		КонецЦикла; 
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция СортироватьКоллекциюОбщ(знач Коллекция, ИмяПоля=Неопределено, знач НачальныйИндекс=Неопределено, знач КонечныйИндекс=Неопределено, ПоВозрастанию=Истина)
	
	Возврат СортироватьКоллекциюСпискомЗначений(Коллекция, ИмяПоля, НачальныйИндекс, КонечныйИндекс, ПоВозрастанию);
	
КонецФункции

Функция СортироватьКоллекциюСпискомЗначений(знач Коллекция, ИмяПоля=Неопределено, знач НачальныйИндекс=Неопределено, знач КонечныйИндекс=Неопределено, ПоВозрастанию=Истина) Экспорт
	
	Если НачальныйИндекс = Неопределено Тогда
		НачальныйИндекс = 0;
	КонецЕсли; 
	
	Если КонечныйИндекс = Неопределено Тогда
		КонечныйИндекс = Коллекция.Количество()-1;
	КонецЕсли; 
	
	КоличествоЭлементов = КонечныйИндекс - НачальныйИндекс + 1;
	Если КоличествоЭлементов < 2 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТипКоллекции = ТипЗнч(Коллекция);
	
	ПолеЗадано = ИмяПоля <> Неопределено И ЗначениеЗаполнено(ИмяПоля);
	
	Индекс = НачальныйИндекс;
	СписокСортировки = Новый СписокЗначений;
	МассивЭлементов = Новый Массив;
	
	Если ПолеЗадано И НачальныйИндекс = 0 И КоличествоЭлементов = Коллекция.Количество() Тогда
		// самая частая ситуация
		Для Каждого Элемент Из Коллекция Цикл
			ЗначениеЭлемента = Элемент[ИмяПоля];
			СписокСортировки.Добавить(ЗначениеЭлемента, Индекс);
			МассивЭлементов.Добавить(Элемент);
			Индекс = Индекс + 1;
		КонецЦикла;
	Иначе
		Для НомерЭлемента=1 По КоличествоЭлементов Цикл
			Элемент = Коллекция[Индекс];
			ЗначениеЭлемента = ?(ПолеЗадано, Элемент[ИмяПоля], Элемент);
			СписокСортировки.Добавить(ЗначениеЭлемента, Индекс);
			МассивЭлементов.Добавить(Элемент);
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЕсли;
	
	СписокСортировки.СортироватьПоЗначению(?(ПоВозрастанию=Истина, НаправлениеСортировки.Возр, НаправлениеСортировки.Убыв));
	
	//Постобработка
	// по отсортированному списку упорядочим исходную коллекцию
	Если ТипКоллекции = Тип("Массив") Тогда
		НовыйИндекс = НачальныйИндекс;
		Для Каждого ЭлементСписка Из СписокСортировки Цикл
			Индекс = Число(ЭлементСписка.Представление) - НачальныйИндекс;
			Коллекция[НовыйИндекс] = МассивЭлементов[Индекс];
			НовыйИндекс = НовыйИндекс + 1;
		КонецЦикла;
	Иначе
		НовыйИндекс = НачальныйИндекс;
		Для Каждого ЭлементСписка Из СписокСортировки Цикл
			Индекс = Число(ЭлементСписка.Представление) - НачальныйИндекс;
			Элемент = МассивЭлементов[Индекс];
			ТекущийИндекс = Коллекция.Индекс(Элемент);
			Если ТекущийИндекс <> НовыйИндекс Тогда
				Коллекция.Сдвинуть(ТекущийИндекс, НовыйИндекс-ТекущийИндекс);
			КонецЕсли;
			НовыйИндекс = НовыйИндекс + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////////////////////////////////
//
//				Массивы+
//

#Область Массивы
Функция НовыйМассив(Значение1=null, Значение2=null, Значение3=null, Значение4=null, Значение5=null) Экспорт
	
	НовыйМассив = Новый Массив;
	Если Значение1 <> null Тогда
		НовыйМассив.Добавить(Значение1);
		Если Значение2 <> null Тогда
			НовыйМассив.Добавить(Значение2);
			Если Значение3 <> null Тогда
				НовыйМассив.Добавить(Значение3);
				Если Значение4 <> null Тогда
					НовыйМассив.Добавить(Значение4);
					Если Значение5 <> null Тогда
						НовыйМассив.Добавить(Значение5);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат НовыйМассив;
	
КонецФункции

Функция НовыйДиапазон(Начало, Конец) Экспорт
	
	Диапазон = Новый Массив;
	
	Если Начало > Конец Тогда
		Для Номер=0 По Начало-Конец Цикл
			Диапазон.Добавить(Начало-Номер);
		КонецЦикла;
	Иначе
		Для Номер=0 По Конец-Начало Цикл
			Диапазон.Добавить(Начало+Номер);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Диапазон;
	
КонецФункции

Функция СортироватьМассив(Массив, НачальныйИндекс=Неопределено, КонечныйИндекс=Неопределено, ПоВозрастанию=Истина) Экспорт
	
	Возврат СортироватьКоллекциюОбщ(Массив, , НачальныйИндекс, КонечныйИндекс, ПоВозрастанию);
	
КонецФункции

Функция СортироватьМассивБинарно(Массив, РасширенныйРезультат=Неопределено) Экспорт
	
	МассивСортированный = Новый Массив;
	ДвиженияЗначений = ДобавитьЗначенияВОтсортированныйМассив(МассивСортированный, Массив);
	
	ИндексыЗначений = Новый Массив;
	Для НомерЭлемента=0 По Массив.Количество()-1 Цикл
		ИндексыЗначений.Вставить(ДвиженияЗначений[НомерЭлемента], НомерЭлемента);
	КонецЦикла;
	
	РасширенныйРезультат = Новый Структура;
	РасширенныйРезультат.Вставить("МассивСортированный", МассивСортированный);
	РасширенныйРезультат.Вставить("ДвиженияЗначений", ДвиженияЗначений);
	РасширенныйРезультат.Вставить("ИндексыЗначений", ИндексыЗначений);
	
	Возврат МассивСортированный;
	
КонецФункции

Функция ДобавитьЗначенияВОтсортированныйМассив(Массив, Значения) Экспорт
	
	ДвиженияЗначений = Новый Массив;
	КоличествоЗначений = Значения.Количество();
	
	НомерЗначения = 0;
	
	Если Массив.Количество()=0 Тогда
		Номер = 0;
		Массив.Вставить(Номер, Значения[НомерЗначения]);
		ДвиженияЗначений.Добавить(Номер);
		НомерЗначения = НомерЗначения + 1;
	КонецЕсли;
	
	Пока НомерЗначения < КоличествоЗначений Цикл
		Значение = Значения[НомерЗначения];
		Начало = 0;
		Конец = Массив.Количество()-1;
		Пока Истина Цикл
			Номер = Цел((Начало+Конец)/2);
			ЗначениеВМассиве = Массив[Номер];
			Если Значение < ЗначениеВМассиве Тогда
				Если Номер=Начало Тогда
					Прервать;
				КонецЕсли;
				Конец = Номер-1;
			ИначеЕсли Значение > ЗначениеВМассиве Тогда
				Если Номер=Конец Тогда
					Номер = Номер + 1;
					Прервать;
				КонецЕсли;
				Начало = Номер+1;
			Иначе
				Номер = Номер + 1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Массив.Вставить(Номер, Значение);
		ДвиженияЗначений.Добавить(Номер);
		НомерЗначения = НомерЗначения + 1;
	КонецЦикла;
	
	Возврат ДвиженияЗначений;
	
КонецФункции

Функция ПеремешатьМассив(Массив) Экспорт
	
	ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел;
	
	ПоследнийНомер = Массив.Количество()-1;
	Для Номер=0 По ПоследнийНомер Цикл
		
		ВыбранныйНомер = ГенераторСлучайныхЧисел.СлучайноеЧисло(Номер, ПоследнийНомер);
		
		Если Номер <> ВыбранныйНомер Тогда
			 Элемент = Массив[Номер];
			 Массив[Номер] = Массив[ВыбранныйНомер];
			 Массив[ВыбранныйНомер] = Элемент;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Помещает значение в массив. Если значение уже в массиве - вернет тот же массив
//
// Параметры:
//  Значение				ЛюбоеЗначение - 	 - если передать массив - то вернется он же или его копия. Если строка, то массив значений в строке через разделитель
//  Разделитель				Строка - 	 - Разделитель значений (для строки)
//  НовыйМассив				Булево - 	 - Истина - копирует массив, Ложь - возвращает переданный
//  УбратьЛишниеПробелы		Булево - 	 - Убирает пробелы (для строки)
//  ДобавлятьПустуюСтроку	Булево - 	 - Если есть пустая строка - добавить в массив (для строки)
// 
// Возвращаемое значение:
//   - Массив
//
Функция ЗначениеВМассив(Значение, Разделитель=",", НовыйМассив=Истина, УбратьЛишниеПробелы=Истина, ДобавлятьПустуюСтроку=Ложь) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Если НовыйМассив Тогда
			Возврат СкопироватьМассив(Значение);
		Иначе
			Возврат Значение;
		КонецЕсли;
	ИначеЕсли ЭтоТаблица(Значение) Тогда
		Если НовыйМассив Тогда
			Возврат ВыгрузитьЭлементыКоллекцииВМассив(Значение)
		Иначе
			Возврат ПолучитьЭлементыКоллекции(Значение);
		КонецЕсли;
	КонецЕсли;
		
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат СтрокуВМассив(Значение, Разделитель, УбратьЛишниеПробелы, ДобавлятьПустуюСтроку);
	КонецЕсли;
	
	НовыйМассив = Новый Массив;
	НовыйМассив.Добавить(Значение);
	Возврат НовыйМассив;
	
КонецФункции

Функция СкопироватьМассив(Массив) Экспорт
	
	НовыйМассив = Новый Массив;
	ДобавитьЭлементыКоллекции(НовыйМассив, Массив);
	Возврат НовыйМассив;
	
КонецФункции

Функция ВычестьМассив(Массив, ЗначениеВычитатель) Экспорт
	Удалено = 0;
	МассивВычитатель = ЗначениеВМассив(ЗначениеВычитатель, , Ложь);
	Для Каждого Элемент Из МассивВычитатель Цикл
		Индекс = Массив.Найти(Элемент);
		Если Индекс <> Неопределено Тогда
			Массив.Удалить(Индекс);
			Удалено = Удалено + 1;
		КонецЕсли; 
	КонецЦикла;
	Возврат Удалено;
КонецФункции

Функция ВычитаниеМассивов(Массив, МассивВычитатель) Экспорт
	НовыйМассив = СкопироватьМассив(Массив);
	ВычестьМассив(НовыйМассив, МассивВычитатель);
	Возврат НовыйМассив;
КонецФункции

Функция СложениеМассивов(Массив1, Массив2) Экспорт
	НовыйМассив = Новый Массив;
	ДобавитьЭлементыКоллекции(НовыйМассив, Массив1);
	ДобавитьЭлементыКоллекции(НовыйМассив, Массив2);
	Возврат НовыйМассив;
КонецФункции

Функция ПересечениеМассивов(знач Массив1, знач Массив2, СохранятьПорядок=Ложь) Экспорт
	
	НовыйМассив = Новый Массив;
	
	/////////////////////////////////////
	// Допустимы массивы в виде строк (будут преобразованы в массив)
	
	Массив1 = ЗначениеВМассив(Массив1, , Ложь);
	Массив2 = ЗначениеВМассив(Массив2, , Ложь);
	/////////////////////////////////////
	
	Если Не СохранятьПорядок И Массив1.Количество() > Массив2.Количество() Тогда
		ВремМассив = Массив1;
		Массив1 = Массив2;
		Массив2 = ВремМассив;
	КонецЕсли; 
	
	Для Каждого Элм1 Из Массив1 Цикл
		Если Массив2.Найти(Элм1) <> Неопределено Тогда
			НовыйМассив.Добавить(Элм1);
		КонецЕсли; 
	КонецЦикла;
	
	Возврат НовыйМассив;
	
КонецФункции

Функция РазвернутьЭлементыМассива(Массив, знач НачальныйИндекс=Неопределено, знач КонечныйИндекс=Неопределено) Экспорт
	
	Если НачальныйИндекс = Неопределено Тогда
		НачальныйИндекс = 0;
	КонецЕсли; 
	
	Если КонечныйИндекс = Неопределено Тогда
		КонечныйИндекс = Массив.Количество()-1;
	КонецЕсли; 
	
	КоличествоЭлементов = КонечныйИндекс - НачальныйИндекс + 1;
	
	Серединка = Цел(КоличествоЭлементов / 2) - 1 + НачальныйИндекс;
	ОбратныйИндекс = КонечныйИндекс;
	Для Индекс=НачальныйИндекс По Серединка Цикл
		Элм = Массив[Индекс];
		Массив[Индекс] = Массив[ОбратныйИндекс];
		Массив[ОбратныйИндекс] = Элм;
		ОбратныйИндекс = ОбратныйИндекс - 1;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция УдалитьДублиВМассиве(Массив, ВОбратномПорядке=Ложь) Экспорт
	
	Найдено = Новый Соответствие;
	
	Если ВОбратномПорядке Тогда
		Индекс = Массив.Количество();
		Пока Индекс > 0 Цикл
			Индекс = Индекс - 1;
			Значение = Массив[Индекс];
			Если Найдено[Значение] = Неопределено Тогда
				Найдено[Значение] = Истина;
			Иначе
				Массив.Удалить(Индекс);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Индекс = 0;
		Количество = Массив.Количество();
		Пока Индекс < Количество Цикл
			Значение = Массив[Индекс];
			Если Найдено[Значение] = Неопределено Тогда
				Найдено[Значение] = Истина;
				Индекс = Индекс + 1;
			Иначе
				Массив.Удалить(Индекс);
				Количество = Количество - 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция ПересчитатьНомераЭлементовПриУдалении(знач НомераЭлементов, знач НомераУдаляемыхЭлементов) Экспорт
	
	РасширенныйРезультатСортировки = Неопределено;
	НомераЭлементов = СортироватьМассивБинарно(НомераЭлементов, РасширенныйРезультатСортировки);
	ИндексыНомеров = РасширенныйРезультатСортировки.ИндексыЗначений;
	
	НомераУдаляемыхЭлементов = СортироватьМассивБинарно(НомераУдаляемыхЭлементов);
	
	НомерЭлементаВСписке = НомераЭлементов.Количество()-1;
	НомерУдаляемогоЭлементаВСписке = НомераУдаляемыхЭлементов.Количество()-1;

	Индексы_и_НомераЭлементов = Новый Массив;
	
	Если НомерЭлементаВСписке >= 0 И НомерУдаляемогоЭлементаВСписке >= 0 Тогда

		НомерЭлемента = НомераЭлементов[НомерЭлементаВСписке];
		НомерУдаляемогоЭлемента = НомераУдаляемыхЭлементов[НомерУдаляемогоЭлементаВСписке];

		Пока Истина Цикл
			
			Если НомерУдаляемогоЭлемента >= НомерЭлемента Тогда
				
				Если НомерУдаляемогоЭлемента=НомерЭлемента Тогда
					Если НомерЭлементаВСписке=0 Тогда
						Прервать;
					КонецЕсли;
					
					НомерЭлементаВСписке = НомерЭлементаВСписке - 1;
					НомерЭлемента = НомераЭлементов[НомерЭлементаВСписке];
				КонецЕсли;

				Если НомерУдаляемогоЭлементаВСписке=0 Тогда
					Прервать;
				КонецЕсли;

				НомерУдаляемогоЭлементаВСписке = НомерУдаляемогоЭлементаВСписке - 1;
				НомерУдаляемогоЭлемента = НомераУдаляемыхЭлементов[НомерУдаляемогоЭлементаВСписке];

			Иначе
				
				НовыйНомерЭлемента = НомерЭлемента - НомерУдаляемогоЭлементаВСписке - 1;
				
				Индекс_и_НомерЭлемента = Новый Массив;
				Индекс_и_НомерЭлемента.Добавить(ИндексыНомеров[НомерЭлементаВСписке]);
				Индекс_и_НомерЭлемента.Добавить(НовыйНомерЭлемента);
				Индексы_и_НомераЭлементов.Добавить(Индекс_и_НомерЭлемента);
				
				Если НомерЭлементаВСписке=0 Тогда
					Прервать;
				КонецЕсли;
				
				НомерЭлементаВСписке = НомерЭлементаВСписке - 1;
				НомерЭлемента = НомераЭлементов[НомерЭлементаВСписке];
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Индексы_и_НомераЭлементов;
	
КонецФункции
#КонецОбласти

//
//				Массивы-
//
///////////////////////////////////////////////////////////////////

Функция НайтиИндексыЭлементовКоллекции(Коллекция, Отбор, НачальныйИндекс=0, ОстановитьсяПослеПервого=Ложь) Экспорт
	НайденныеЭлементы = Новый Массив;
	ПоляЭлемента = СкопироватьСтруктуру(Отбор);
	Индекс = 0;
	Для Каждого Элм Из Коллекция Цикл
		Если Индекс >= НачальныйИндекс Тогда
			ЗаполнитьЗначенияСвойств(ПоляЭлемента, Элм);
			Если СравнитьСтруктуры(ПоляЭлемента, Отбор) Тогда
				НайденныеЭлементы.Добавить(Индекс);
				Если ОстановитьсяПослеПервого Тогда
					Прервать;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли; 
		Индекс = Индекс + 1;
	КонецЦикла; 
	Возврат НайденныеЭлементы;
КонецФункции

Функция МассивИндексовВМассивЭлементов(Коллекция, МассивИндексов) Экспорт
	МассивЭлементов = Новый Массив;
	Для каждого Индекс Из МассивИндексов Цикл
		Элм = Коллекция[Индекс];
		МассивЭлементов.Добавить(Элм);
	КонецЦикла;
	Возврат МассивЭлементов;
КонецФункции

Функция ПроверитьЕстьИндексКоллекции(Коллекция, СтрокаИндекса) Экспорт

	Если ЭтоТаблицаЗначений(Коллекция) Тогда
		
		Для Каждого Индекс Из Коллекция.Индексы Цикл
			Если Строка(Индекс) = СтрокаИндекса Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		
		Возврат Коллекция.МенеджерИндексирования.СистемыИндексирования[СтрокаИндекса] <> Неопределено;
		
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция ДобавитьИндексКоллекции(Коллекция, СтрокаИндекса) Экспорт
	
	Если ЭтоТаблицаЗначений(Коллекция) Тогда

		Коллекция.Индексы.Добавить(СтрокаИндекса);
		
	ИначеЕсли ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		
		ДобавитьИндексыКвазиТаблицыЗначений(Коллекция, СтрокаИндекса);
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ИндексироватьКоллекцию(Коллекция, знач Строки=Неопределено) Экспорт
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		
		Если Строки = Неопределено Тогда
			Строки = Коллекция.Строки;
		КонецЕсли;

		Если Строки = Коллекция.Строки Тогда
			// Переиндексируем все строки
			// делаем ускоренную очистку индекса
			МенеджерИндексирования_ОчиститьИндексы(Коллекция.МенеджерИндексирования);
		КонецЕсли;
		
		МенеджерИндексирования_ИндексироватьКоллекцию(Коллекция.МенеджерИндексирования, Строки);
		
	КонецЕсли;
	
КонецФункции

Функция НайтиЭлементыКоллекции(Коллекция, Отбор, НачальныйИндекс=0, ОстановитьсяПослеПервого=Ложь) Экспорт
	
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Если ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда
			Если Отбор.Количество() > 0 Тогда
				НайденныеСтроки = Коллекция.НайтиСтроки(Отбор);
			Иначе
				НайденныеСтроки = ВыгрузитьЭлементыКоллекцииВМассив(Коллекция);
			КонецЕсли;
			Возврат НайденныеСтроки;
		КонецЕсли; 
	#КонецЕсли
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		Возврат НайтиСтрокиКвазиТаблицыЗначений(Коллекция, Отбор);
	КонецЕсли; 
	
	//////////////////////////////////////////////////////////////
	// универсальный алгоритм
	НайденныеЭлементы = Новый Массив;
	ПоляЭлемента = СкопироватьСтруктуру(Отбор);
	Индекс = 0;
	Для Каждого Элм Из Коллекция Цикл
		Если Индекс >= НачальныйИндекс Тогда
			ЗаполнитьЗначенияСвойств(ПоляЭлемента, Элм);
			Если СравнитьСтруктуры(ПоляЭлемента, Отбор) Тогда
				НайденныеЭлементы.Добавить(Элм);
				Если ОстановитьсяПослеПервого Тогда
					Прервать;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли; 
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат НайденныеЭлементы;
	
КонецФункции

Функция НайтиЭлементКоллекции(Коллекция, Отбор, НачальныйИндекс=0) Экспорт
	НайденныеЭлементы = НайтиЭлементыКоллекции(Коллекция, Отбор, НачальныйИндекс, Истина);
	Если НайденныеЭлементы.Количество() > 0 Тогда
		Элемент = НайденныеЭлементы[0];
		Возврат Элемент;
	КонецЕсли; 
КонецФункции

// Находит элементы коллекции по указанным параметрам
//
// Параметры:
//  - ОтборИлиЗначение - Структура, Массив, Произвольный - структура с полями отбора, массив элементов или один элемент
//  - ПолеИмени - Строка, Неопределено - в какой колонке искать переданные значения
//  - Коллекция - Массив, ТаблицаЗначений - коллекция, в которой производится поиск элементов
//  - ПоляПоискаПоЗначению - Строка, Массив, Неопределено - имена полей, по которым выполняется поиск значения, 
//                                                          если элемент не найден напрямую
//  - ДополнительныйРезультат - Структура - содержит массивы непринадлежащих коллекции и ненайденных по имени элементов 
//                                          (структура заполняется внутри)
//
// Возвращаемое значение:
//  - Массив - массив найденных элементов коллекции
//
Функция ОтобратьЭлементыКоллекции(Коллекция, знач ОтборИлиЗначение, ПолеИмени=Неопределено, ПоляПоискаПоЗначению=Неопределено, ДополнительныйРезультат=Неопределено) Экспорт
	
	ДополнительныйРезультат = Новый Структура;
	ДополнительныйРезультат.Вставить("НепринадлежащиеКоллекции", Новый Массив);
	ДополнительныйРезультат.Вставить("НенайденныеПоИмени", Новый Массив);
	
	Если ОтборИлиЗначение=Неопределено Тогда
		// Вернем все элементы
		Возврат ВыгрузитьЭлементыКоллекцииВМассив(Коллекция);
	КонецЕсли;
	
	ТипОтбора = ТипЗнч(ОтборИлиЗначение);
	
	Если ТипОтбора=Тип("Структура") Тогда
		
		// Поищем по полям структуры отбора
		Возврат НайтиЭлементыКоллекции(Коллекция, ОтборИлиЗначение);
		
	КонецЕсли;
	
	НайденныеЭлементы = Новый Массив;
	Если ТипОтбора=Тип("Строка") Тогда
		Отбор = СтрокуВМассив(ОтборИлиЗначение);
	ИначеЕсли ТипОтбора <> Тип("Массив") Тогда
		ЭлементОтбора = ОтборИлиЗначение;
		Отбор = Новый Массив;
		Отбор.Добавить(ЭлементОтбора);
	Иначе
		Отбор = ОтборИлиЗначение;
	КонецЕсли;
	
	ЭлементыКоллекции = ПолучитьЭлементыКоллекции(Коллекция);
	
	ТипКоллекции = 0;
	Если ТипЗнч(ЭлементыКоллекции)=Тип("Массив") Тогда
		ТипКоллекции = 1;
	Иначе
		#Если Сервер Тогда
			Если ТипЗнч(ЭлементыКоллекции)=Тип("ТаблицаЗначений") Тогда
				ТипКоллекции = 2;
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	
	Если ПоляПоискаПоЗначению=Неопределено Тогда
		ПоляПоискаПоЗначению = ПолеИмени;
	КонецЕсли;
	
	Если ПоляПоискаПоЗначению=Неопределено Тогда
		ПоляПоискаПоЗначениюМассив = Новый Массив;
	Иначе
		ПоляПоискаПоЗначениюМассив = ЗначениеВМассив(ПоляПоискаПоЗначению, , Ложь);
	КонецЕсли;
	
	ПоискПоИмени = ПоляПоискаПоЗначениюМассив.Найти(ПолеИмени) <> Неопределено;
	
	Для Каждого Элемент Из Отбор Цикл
		
		Если ТипКоллекции=1 Тогда
			Если ЭлементыКоллекции.Найти(Элемент) <> Неопределено Тогда
				НайденныеЭлементы.Добавить(Элемент);
				Продолжить;
			КонецЕсли;
		ИначеЕсли ТипКоллекции=2 Тогда
			Если ТипЗнч(Элемент)=Тип("СтрокаТаблицыЗначений") И ЭлементыКоллекции=Элемент.Владелец() И ЭлементыКоллекции.Индекс(Элемент) <> -1 Тогда
				НайденныеЭлементы.Добавить(Элемент);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ПоляПоискаПоЗначениюМассив.Количество() > 0 Тогда
			НайденныеЭлементыПоИмени = Новый Массив;
			Для Каждого ПолеПоиска Из ПоляПоискаПоЗначениюМассив Цикл
				ОтборПоЗначению = Новый Структура(ПолеПоиска, Элемент);
				НайденныеЭлементыПоИмени = НайтиЭлементыКоллекции(Коллекция, ОтборПоЗначению);
				Если НайденныеЭлементыПоИмени.Количество() > 0 Тогда
					ДобавитьЭлементыКоллекции(НайденныеЭлементы, НайденныеЭлементыПоИмени);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НайденныеЭлементыПоИмени.Количество()=0 Тогда
				Если ПоискПоИмени И ТипЗнч(Элемент)=Тип("Строка") Тогда
					ДополнительныйРезультат.НенайденныеПоИмени.Добавить(Элемент);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НайденныеЭлементы;
	
КонецФункции

Функция УдалитьЭлементыКоллекцииПоИндексам(Коллекция, МассивИндексов, ОтсортироватьИндексы=Истина) Экспорт
	Если ОтсортироватьИндексы Тогда
		СортироватьМассив(МассивИндексов, , , Ложь);
	КонецЕсли; 
	
	Для Каждого Индекс Из МассивИндексов Цикл
		Коллекция.Удалить(Индекс);
	КонецЦикла; 
КонецФункции

Функция УдалениеЭлементовКоллекции(Коллекция, Элементы) Экспорт
	
	Возврат УдалитьЭлементыКоллекции(СкопироватьОбъект(Коллекция), Элементы);
	
КонецФункции

Функция УдалитьЭлементыКоллекции(Коллекция, Элементы=Неопределено) Экспорт
	
	Если ЭтоТаблицаЗначений(Коллекция) И ТипЗнч(Элементы)=Тип("Структура") Тогда
		МассивЭлементов = Коллекция.НайтиСтроки(Элементы);
	Иначе
		Если Элементы <> Неопределено Тогда
			МассивЭлементов = ЗначениеВМассив(Элементы, , Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Коллекция)=Тип("Массив") Тогда
		
		Если Элементы=Неопределено Тогда
			Коллекция.Очистить();
		Иначе
			Для Каждого Элемент Из МассивЭлементов Цикл
				Индекс = Коллекция.Найти(Элемент);
				Если Индекс <> Неопределено Тогда
					Коллекция.Удалить(Индекс);
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		
		УдалитьСтрокиКвазиТаблицыЗначений(Коллекция, Элементы);
		
	ИначеЕсли ТипЗнч(Коллекция)=Тип("ДанныеФормыДерево") Тогда

		Если Элементы=Неопределено Тогда
			Коллекция.ПолучитьЭлементы().Очистить();
		Иначе
			Для Каждого Элемент Из МассивЭлементов Цикл
				РодительЭлемента = Элемент.ПолучитьРодителя();
				Если РодительЭлемента=Неопределено Тогда
					РодительЭлемента = Коллекция;
				КонецЕсли;
				РодительЭлемента.ПолучитьЭлементы().Удалить(Элемент);
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		Если Элементы=Неопределено Тогда
			Коллекция.Очистить();
		Иначе
			Для Каждого Элемент Из МассивЭлементов Цикл
				Коллекция.Удалить(Элемент);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Коллекция;
	
КонецФункции

Функция ВыгрузитьЗначенияКолонкиКоллекции(Коллекция, ИмяКолонки) Экспорт
	Значения = Новый Массив;
	Для Каждого Элемент Из ПолучитьЭлементыКоллекции(Коллекция) Цикл
		Значения.Добавить(Элемент[ИмяКолонки]);
	КонецЦикла;
	Возврат Значения;
КонецФункции

Функция ВыгрузитьЗначенияКолонокКоллекции(Коллекция, Колонки=Неопределено) Экспорт
	
	Значения = Новый Массив;
	
	Если Колонки = Неопределено Тогда
		МассивКолонок = ПолучитьКолонкиКоллекции(Коллекция);
		Если МассивКолонок = Неопределено Тогда
			Возврат Значения;
		КонецЕсли;
	Иначе
		МассивКолонок = ЗначениеВМассив(Колонки);
	КонецЕсли;
	
	Для Индекс=0 По МассивКолонок.ВГраница() Цикл
		МассивКолонок[Индекс] = СтрокуВМассив(МассивКолонок[Индекс], ".");
	КонецЦикла;
	
	ЭлементыКоллекции = ПолучитьЭлементыКоллекции(Коллекция);

	Для Каждого Элемент Из ЭлементыКоллекции Цикл
		Для Каждого Колонка Из МассивКолонок Цикл
			Если Колонка.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Значение = Элемент;
			Ошибка = Ложь;
			Для Каждого ЭлмКолонки Из Колонка Цикл
				Попытка
					Значение = Значение[ЭлмКолонки];
				Исключение
					Ошибка = Истина;
					Прервать;
				КонецПопытки;
			КонецЦикла;
			
			Если Не Ошибка Тогда
				Значения.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Значения;

КонецФункции

Функция УпорядочитьЭлементыКоллекцииЗначенийПоМассиву(Коллекция, МассивЭлементов) Экспорт
	
	Если ЭтоТаблицаЗначений(Коллекция) Тогда
		УпорядочитьСтрокиТаблицыЗначенийПоМассиву(Коллекция, МассивЭлементов);
	ИначеЕсли ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		УпорядочитьСтрокиКвазиТаблицыЗначенийПоМассиву(Коллекция, МассивЭлементов);
	КонецЕсли;
	
КонецФункции

Функция ЭтоТаблицаЗначений(Объект) Экспорт
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Возврат ТипЗнч(Объект) = Тип("ТаблицаЗначений");
	#Иначе
		Возврат Ложь;
	#КонецЕсли
КонецФункции

Функция ЭтоТипТаблицаЗначений(Тип) Экспорт
	Возврат Тип = ТипТаблицаЗначений();
КонецФункции

Функция ТипТаблицаЗначений() Экспорт
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Возврат Тип("ТаблицаЗначений");
	#КонецЕсли
КонецФункции

Функция ТипСтрокаТаблицыЗначений() Экспорт
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Возврат Тип("СтрокаТаблицыЗначений");
	#КонецЕсли
КонецФункции

Функция ЭтоТаблица(Объект) Экспорт
	
	Если ЭтоКвазиТаблицаЗначений(Объект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЭтоТаблицаЗначений(Объект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ДоступенОбходКоллекции(Коллекция) Экспорт
	
	Попытка
		Для Каждого Элемент Из Коллекция Цикл
			Прервать;
		КонецЦикла;
		Возврат Истина;
	Исключение
	    Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ВыгрузитьЭлементыКоллекцииВМассив(Коллекция, УровеньВложенности=0) Экспорт
	
	МассивЭлементов = Новый Массив;
	
	Для Каждого Элемент Из ПолучитьЭлементыКоллекции(Коллекция) Цикл
		Если УровеньВложенности > 0 Тогда
			ДобавитьЭлементыКоллекции(МассивЭлементов, ВыгрузитьЭлементыКоллекцииВМассив(Элемент, УровеньВложенности-1));
		Иначе
			МассивЭлементов.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЭлементов;
	
КонецФункции

Функция ЗагрузитьЭлементыВКоллекцию(Коллекция, Элементы) Экспорт
	ПоследнийИндекс = Мин(Коллекция.Количество(), Элементы.Количество()) - 1;
	Для Индекс=0 По ПоследнийИндекс Цикл
		ЗаполнитьЗначенияСвойств(Коллекция[Индекс], Элементы[Индекс]);
	КонецЦикла;
КонецФункции

Функция УдалитьПустыеСтрокиКоллекции(Коллекция, Поля=Неопределено) Экспорт
	
	МассивПолей = Неопределено;
	Если Поля = Неопределено Тогда
		#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
			Если ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда
				МассивПолей = ВыгрузитьЗначенияКолонкиКоллекции(Коллекция, "Имя");
			КонецЕсли;
		#КонецЕсли
	Иначе
		МассивПолей = ЗначениеВМассив(Поля);
	КонецЕсли;
	
	УдаляемыеЭлементы = Новый Массив;
	
	НетПолей = МассивПолей = Неопределено;
	
	МассивЭлементовДляУдаления = Новый Массив;
	Для Каждого Элемент Из ПолучитьЭлементыКоллекции(Коллекция) Цикл
		Если НетПолей Тогда
			Заполнено = Элемент <> Неопределено И ЗначениеЗаполнено(Элемент);
		Иначе
			Заполнено = Ложь;
			Для Каждого Поле Из МассивПолей Цикл
				Значение = Элемент[Поле];
				Если Значение <> Неопределено И ЗначениеЗаполнено(Значение) Тогда
					Заполнено = Истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		
		Если Не Заполнено Тогда
			УдаляемыеЭлементы.Добавить(Элемент);
		КонецЕсли;
		
	КонецЦикла;
	
	УдалитьЭлементыКоллекции(Коллекция, УдаляемыеЭлементы);
	
КонецФункции

Функция УдалитьНеположительныеСтрокиКоллекции(Коллекция, Поля=Неопределено) Экспорт
	
	МассивПолей = Неопределено;
	Если Поля = Неопределено Тогда
		#Если Сервер Тогда
			Если ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда
				МассивПолей = ВыгрузитьЗначенияКолонкиКоллекции(Коллекция.Колонки, "Имя");
			КонецЕсли;
		#КонецЕсли
	Иначе
		МассивПолей = ЗначениеВМассив(Поля);
	КонецЕсли;
	
	НетПолей = МассивПолей = Неопределено;
	
	МассивЭлементовДляУдаления = Новый Массив;
	ИндексЭлемента = Коллекция.Количество()-1;
	Для НомерЭлемента=1 По Коллекция.Количество() Цикл
		Элемент = Коллекция[ИндексЭлемента];
		Если НетПолей Тогда
			Положительный = Элемент <> Неопределено И Элемент > 0;
		Иначе
			Положительный = Ложь;
			Для Каждого Поле Из МассивПолей Цикл
				Значение = Элемент[Поле];
				Если Значение <> Неопределено И Значение > 0 Тогда
					Положительный = Истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		
		Если Не Положительный Тогда
			Коллекция.Удалить(ИндексЭлемента);
		КонецЕсли;
		
		ИндексЭлемента = ИндексЭлемента - 1;
	КонецЦикла;
	
КонецФункции

Функция СоединитьТаблицы(Таблица1, Таблица2, КолонкиСоединения, КолонкиЗаполнения, знач Левое=Истина, знач Правое=Истина) Экспорт
	
	Поиск = Новый Структура(КолонкиСоединения);
	
	Если Не Левое И Правое Тогда
		Левое = Истина;
		Правое = Ложь;
		ТаблицаВрем = Таблица1;
		Таблица1 = Таблица2;
		Таблица2 = Таблица1;
	КонецЕсли;
	
	ДополнитьКолонкиКоллекции(Таблица1, КолонкиЗаполнения);
	ИсходнаяТаблица1 = СкопироватьКоллекцию(Таблица1);
	ОчиститьЭлементыКоллекции(Таблица1);
	
	Внутреннее = Не Левое И Не Правое;
	ВсеНайденныеСтрокиТаблицы2 = Новый Соответствие;
	СтрокиИсходнойТаблицы1 = ПолучитьЭлементыКоллекции(ИсходнаяТаблица1);
	Для Каждого ИсходнаяСтрокаТаблицы1 Из СтрокиИсходнойТаблицы1 Цикл
		ЗаполнитьЗначенияСвойств(Поиск, ИсходнаяСтрокаТаблицы1);
		НайденныеСтрокиТаблицы2 = НайтиЭлементыКоллекции(Таблица2, Поиск);
		Если НайденныеСтрокиТаблицы2.Количество() > 0 Тогда
			Для Каждого СтрокаТаблицы2 Из НайденныеСтрокиТаблицы2 Цикл
				СтрокаТаблицы1 = НовыйЭлементКоллекции(Таблица1);
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы1, ИсходнаяСтрокаТаблицы1);
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы1, СтрокаТаблицы2, КолонкиЗаполнения);
				ВсеНайденныеСтрокиТаблицы2[СтрокаТаблицы2] = Истина;
			КонецЦикла;
		Иначе
			Если Не Внутреннее Тогда
				СтрокаТаблицы1 = НовыйЭлементКоллекции(Таблица1);
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы1, ИсходнаяСтрокаТаблицы1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	Если Правое Тогда
		СтрокиТаблицы2 = ПолучитьЭлементыКоллекции(Таблица2); 
		Для Каждого СтрокаТаблицы2 Из СтрокиТаблицы2 Цикл
			Если Не ВсеНайденныеСтрокиТаблицы2[СтрокаТаблицы2] = Истина Тогда
				СтрокаТаблицы1 = НовыйЭлементКоллекции(Таблица1);
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы1, СтрокаТаблицы2, КолонкиСоединения);
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы1, СтрокаТаблицы2, КолонкиЗаполнения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Таблица1;
	
КонецФункции

Функция СравнитьСтруктуры(Структура1, Структура2) Экспорт
	
	Перем Значение2;
	
	Для Каждого Элм1 Из Структура1 Цикл
		Если Не Структура2.Свойство(Элм1.Ключ, Значение2) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Значение1 = Элм1.Значение;
		Если Значение1 <> Значение2 Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла;
	
	Для Каждого Элм2 Из Структура2 Цикл
		Если Не Структура1.Свойство(Элм2.Ключ) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Получает новую ссылку на новую структуру
//
// Параметры:
//   Структура - Структура - исходная структура.
//
// Возвращаемое значение:
//   Структура - новая структура с данными аналогичными исходной структуре.
//
Функция СкопироватьСтруктуру(Структура) Экспорт
	
	Возврат СкопироватьПоляСтруктуры(Структура, Новый Структура);
	
КонецФункции

// Сохраняет исходную ссылку на структуру.
//
// Параметры:
//   СтруктураИсточник - Структура - структура, из которой копируются поля.
//   СтруктураПриемник - Структура - структура, в которую копируются поля.
//
// Возвращаемое значение:
//   СтруктураПриемник - Cтруктура - приёмник, содеражщий данные аналогичные СтруктураИсточник.
//
Функция СкопироватьПоляСтруктуры(СтруктураИсточник, СтруктураПриемник) Экспорт
	
	Если СтруктураИсточник=СтруктураПриемник Тогда
		Возврат СтруктураПриемник;
	КонецЕсли;
	
	СтруктураПриемник.Очистить();
	
	Для Каждого Элм Из СтруктураИсточник Цикл
		СтруктураПриемник.Вставить(Элм.Ключ, Элм.Значение);
	КонецЦикла;
	
	Возврат СтруктураПриемник;
	
КонецФункции

Функция ПолучитьЗначениеПоляСтруктуры(Структура, ИмяПоля) Экспорт
	
	Перем ЗначениеПоля;
	
	Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство(ИмяПоля, ЗначениеПоля) Тогда
		
		Возврат ЗначениеПоля;
		
	КонецЕсли;
	
КонецФункции

Функция СкопироватьОбъект(знач Объект, Рекурсивно=Ложь, знач МаксимальныйУровень=-1) Экспорт
	
	ПервыйОбъект = Объект;
	
	ТипМассив = Тип("Массив");
	ТипСтруктура = Тип("Структура");
	ТипСоответствие = Тип("Соответствие");
	ТипСписокЗначений = Тип("СписокЗначений");
	ТипТаблицаЗначений = ТипТаблицаЗначений();
	ТипСтрокаТаблицыЗначений = ТипСтрокаТаблицыЗначений();
	
	КопииОбъектов = Новый Соответствие;
	
	КопируемыеОбъекты = Новый Массив;
	
	ОбходОбъектов = Новый Массив;
	ОбходОбъектов.Добавить(ПервыйОбъект);
	
	Уровень = 0;
	Если НЕ Рекурсивно Тогда
		МаксимальныйУровень = 0;
	КонецЕсли;
	
	// Создадим пустые копии объектов и элементов так, как перед тем как заполнять элементы объектов элементы надо также скопировать
	Пока ОбходОбъектов.Количество() > 0 Цикл
		
		ОбходЭлементовОбъектов = Новый Массив;
		Для Каждого Объект Из ОбходОбъектов Цикл
			
			Если Объект=Неопределено ИЛИ КопииОбъектов[Объект] <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТипОбъекта = ТипЗнч(Объект);
			Если ТипОбъекта=ТипМассив Тогда
				КопииОбъектов[Объект] = Новый Массив;
				Для Каждого ЭлементОбъекта Из Объект Цикл
					ОбходЭлементовОбъектов.Добавить(ЭлементОбъекта);
				КонецЦикла;
				КопируемыеОбъекты.Добавить(Объект);
			ИначеЕсли ТипОбъекта=ТипСтруктура Тогда
				КопииОбъектов[Объект] = Новый Структура;
				Для Каждого ЭлементОбъекта Из Объект Цикл
					ОбходЭлементовОбъектов.Добавить(ЭлементОбъекта.Значение);
				КонецЦикла;
				КопируемыеОбъекты.Добавить(Объект);
			ИначеЕсли ТипОбъекта=ТипСоответствие Тогда
				КопииОбъектов[Объект] = Новый Соответствие;
				Для Каждого ЭлементОбъекта Из Объект Цикл
					ОбходЭлементовОбъектов.Добавить(ЭлементОбъекта.Ключ);
					ОбходЭлементовОбъектов.Добавить(ЭлементОбъекта.Значение);
				КонецЦикла;
				КопируемыеОбъекты.Добавить(Объект);
			ИначеЕсли ТипОбъекта=ТипСписокЗначений Тогда
				КопииОбъектов[Объект] = Новый СписокЗначений;
				Для Каждого ЭлементОбъекта Из Объект Цикл
					ОбходЭлементовОбъектов.Добавить(ЭлементОбъекта.Значение);
				КонецЦикла;
				КопируемыеОбъекты.Добавить(Объект);
			ИначеЕсли ТипОбъекта=ТипТаблицаЗначений ИЛИ ТипОбъекта=ТипСтрокаТаблицыЗначений Тогда
				Если ТипОбъекта=ТипСтрокаТаблицыЗначений Тогда
					// копируем таблицу целиком
					Объект = Объект.Владелец();
				КонецЕсли;
				
				КопияТаблицы = Объект.СкопироватьКолонки();
				КопииОбъектов[Объект] = КопияТаблицы;
				
				Для Каждого ЭлементОбъекта Из Объект Цикл
					КопииОбъектов[ЭлементОбъекта] = КопияТаблицы.Добавить();
					Для Каждого ЗначениеЯчейки Из ЭлементОбъекта Цикл
						ОбходЭлементовОбъектов.Добавить(ЗначениеЯчейки);
					КонецЦикла;
				КонецЦикла;
				
				КопируемыеОбъекты.Добавить(Объект);
			Иначе
				КопииОбъектов[Объект] = Объект;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Уровень=МаксимальныйУровень Тогда
			// Достигнут максимальный уровень копирования
			// далее элементы объектов не копируются, в копии объектов будут вставлены первоначальные элементы
			Для Каждого Объект Из ОбходЭлементовОбъектов Цикл
				Если КопииОбъектов[Объект]=Неопределено Тогда
					КопииОбъектов[Объект] = Объект;
				КонецЕсли;
			КонецЦикла;
			Прервать;
		КонецЕсли;
		
		ОбходОбъектов = ОбходЭлементовОбъектов;
		
		Уровень = Уровень + 1;
		
	КонецЦикла;
	
	// Заполним элементы копий объектов после того, как их элементы также были скопированы
	Для Каждого Объект Из КопируемыеОбъекты Цикл
		
		КопияОбъекта = КопииОбъектов[Объект];
		
		ТипОбъекта = ТипЗнч(Объект);
		
		Если ТипОбъекта=ТипМассив Тогда
			Для Каждого ЭлементОбъекта Из Объект Цикл
				КопияЭлемента = КопииОбъектов[ЭлементОбъекта];
				КопияОбъекта.Добавить(КопияЭлемента);
			КонецЦикла;
		ИначеЕсли ТипОбъекта=ТипСтруктура Тогда
			Для Каждого ЭлементОбъекта Из Объект Цикл
				КопияЭлемента = КопииОбъектов[ЭлементОбъекта.Значение];
				КопияОбъекта.Вставить(ЭлементОбъекта.Ключ, КопияЭлемента);
			КонецЦикла;
		ИначеЕсли ТипОбъекта=ТипСоответствие Тогда
			Для Каждого ЭлементОбъекта Из Объект Цикл
				КопияКлюча = КопииОбъектов[ЭлементОбъекта.Ключ];
				КопияЗначения = КопииОбъектов[ЭлементОбъекта.Значение];
				КопияОбъекта.Вставить(КопияКлюча, КопияЗначения);
			КонецЦикла;
		ИначеЕсли ТипОбъекта=ТипСписокЗначений Тогда
			Для Каждого ЭлементОбъекта Из Объект Цикл
				КопияЭлементаОбъекта = КопияОбъекта.Добавить();
				ЗаполнитьЗначенияСвойств(КопияЭлементаОбъекта, ЭлементОбъекта);
				КопияЗначения = КопииОбъектов[ЭлементОбъекта.Значение];
				КопияЭлементаОбъекта.Значение = КопияЗначения;
			КонецЦикла;
		ИначеЕсли ТипОбъекта=ТипТаблицаЗначений Тогда
			Для Каждого ЭлементОбъекта Из Объект Цикл
				КопияЭлемента = КопииОбъектов[ЭлементОбъекта];
				ИндексЯчейки = 0;
				Для Каждого ЗначениеЯчейки Из ЭлементОбъекта Цикл
					КопияЭлемента[ИндексЯчейки] = КопииОбъектов[ЗначениеЯчейки];
					ИндексЯчейки = ИндексЯчейки + 1;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	КопияОбъекта = КопииОбъектов[ПервыйОбъект];
	
	Возврат КопияОбъекта;
	
КонецФункции

Функция СкопироватьОбъектСтар(Объект, Рекурсивно=Ложь, МаксимальныйУровень=-1) Экспорт
	
	Если Рекурсивно Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("СоответствиеОбъектов", Новый Соответствие);
		ДополнительныеПараметры.Вставить("МаксимальныйУровень", МаксимальныйУровень);
		ДополнительныеПараметры.Вставить("Уровень", 0);
	Иначе
		ДополнительныеПараметры = Неопределено;
	КонецЕсли;
	
	Возврат СкопироватьОбъектВнутр(Объект, Рекурсивно, ДополнительныеПараметры);
	
КонецФункции

Функция СкопироватьОбъектВнутр(Объект, Рекурсивно, ДополнительныеПараметры)

	Если Рекурсивно Тогда
		
		Если ДополнительныеПараметры.Уровень = ДополнительныеПараметры.МаксимальныйУровень Тогда
			Возврат Объект;
		КонецЕсли;
		
		Если Объект = Неопределено Тогда
			Возврат Объект;
		КонецЕсли;
		
		НовыйОбъект = ДополнительныеПараметры.СоответствиеОбъектов[Объект];
		Если НовыйОбъект <> Неопределено Тогда
			Возврат НовыйОбъект;
		КонецЕсли;
		
		ДополнительныеПараметры.Уровень = ДополнительныеПараметры.Уровень + 1;
		
	КонецЕсли;
	
	ТипОбъекта = ТипЗнч(Объект);
	ТипТаблицаЗначений = ТипТаблицаЗначений();
	ТипСтрокаТаблицыЗначений = ТипСтрокаТаблицыЗначений();
	
	Если ТипОбъекта = Тип("Структура") ИЛИ ТипОбъекта = Тип("Соответствие") Тогда
		
		Если ТипОбъекта = Тип("Структура") Тогда
			НовыйОбъект = Новый Структура;
		Иначе
			НовыйОбъект = Новый Соответствие;
		КонецЕсли; 
		
		Если Рекурсивно Тогда
			СоответствиеОбъектов = ДополнительныеПараметры.СоответствиеОбъектов;
			СоответствиеОбъектов[Объект] = НовыйОбъект;
			Для Каждого КлючЗначение Из Объект Цикл
				НовыйОбъект.Вставить(СкопироватьОбъектВнутр(КлючЗначение.Ключ, Рекурсивно, ДополнительныеПараметры), СкопироватьОбъектВнутр(КлючЗначение.Значение, Рекурсивно, ДополнительныеПараметры));
			КонецЦикла;
		Иначе
			Для Каждого КлючЗначение Из Объект Цикл
				НовыйОбъект.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("Массив") Тогда

		НовыйОбъект = Новый Массив;
		
		Если Рекурсивно Тогда
			СоответствиеОбъектов = ДополнительныеПараметры.СоответствиеОбъектов;
			СоответствиеОбъектов[Объект] = НовыйОбъект;
			Для Каждого Элемент Из Объект Цикл
				НовыйОбъект.Добавить(СкопироватьОбъектВнутр(Элемент, Рекурсивно, ДополнительныеПараметры));
			КонецЦикла;
		Иначе
			Для Каждого Элемент Из Объект Цикл
				НовыйОбъект.Добавить(Элемент);
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = ТипСтрокаТаблицыЗначений Тогда
		
		Если Рекурсивно Тогда
			ТаблицаЗначений = Объект.Владелец();
			КопияТаблицыЗначений = СкопироватьОбъектВнутр(ТаблицаЗначений, Рекурсивно, ДополнительныеПараметры);

			ИндекЭлемента = ТаблицаЗначений.Индекс(Объект);
			НовыйОбъект = КопияТаблицыЗначений[ИндекЭлемента];

			СоответствиеОбъектов = ДополнительныеПараметры.СоответствиеОбъектов;
			СоответствиеОбъектов[Объект] = НовыйОбъект;
		Иначе
			НовыйОбъект = Объект;
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = ТипТаблицаЗначений Тогда
		
		Если Рекурсивно Тогда
			НовыйОбъект = Объект.Скопировать();

			СоответствиеОбъектов = ДополнительныеПараметры.СоответствиеОбъектов;
			СоответствиеОбъектов[Объект] = НовыйОбъект;
		Иначе
			НовыйОбъект = Объект;
		КонецЕсли;
		
	Иначе
		
		НовыйОбъект = Объект;
		
	КонецЕсли;
	
	Возврат НовыйОбъект;
	
КонецФункции

Функция ОбщаяЧастьСтрокЛев(Строка1, Строка2) Экспорт
	
	Длина = Мин(СтрДлина(Строка1), СтрДлина(Строка2));
	
	ОбщаяЧасть = "";
	Для Номер=1 По Длина Цикл
		с1 = Сред(Строка1, Номер, 1);
		с2 = Сред(Строка2, Номер, 1);
		Если с1 <> с2 Тогда
			Прервать;
		КонецЕсли;
		
		ОбщаяЧасть = ОбщаяЧасть + с1;
	КонецЦикла;
	
	Возврат ОбщаяЧасть;
	
КонецФункции

Функция МассивОбъектовВМассивТипов(МассивОбъектов) Экспорт
	МассивТипов = Новый Массив;
	Для Каждого Объект Из МассивОбъектов Цикл
		ТипОбъекта = ТипЗнч(Объект);
		Если МассивТипов.Найти(ТипОбъекта) = Неопределено Тогда
			МассивТипов.Добавить(ТипОбъекта);
		КонецЕсли; 
	КонецЦикла;
	Возврат МассивТипов;
КонецФункции

Функция ПолучитьПолеСоответствия(Соответствие, Ключ, ЗначениеПоУмолчанию) Экспорт
	Значение = Соответствие[Ключ];
	Если Значение = Неопределено Тогда
		Если ТипЗнч(ЗначениеПоУмолчанию) = Тип("Тип") Тогда
			Значение = Новый(ЗначениеПоУмолчанию);
		Иначе
			Значение = ЗначениеПоУмолчанию;
		КонецЕсли;
		Соответствие[Ключ] = Значение;
	КонецЕсли;
	Возврат Значение;
КонецФункции

Функция РазложитьСтрокуНаПрефиксИЧисловойСуффикс(Строка, Префикс="", Суффикс="") Экспорт
	
	ДлинаСтроки = СтрДлина(Строка);
	НомерСимвола = ДлинаСтроки;
	Пока НомерСимвола > 0 Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		Если Найти("1234567890", Символ) = 0 Тогда
			Прервать;
		КонецЕсли;
		
		НомерСимвола = НомерСимвола - 1;
	КонецЦикла;
	
	Префикс = Лев(Строка, НомерСимвола);
	Суффикс = Прав(Строка, ДлинаСтроки-НомерСимвола);
	
КонецФункции

// Функция - Получить имя программной переменной
// Получает имя, отвечающее правилам написания имени программной переменной (имя не должно содержать пробелов и
// начинаться с цифры)
//
// Параметры:
//  Строка - Строка - произвольная строка.
// 
// Возвращаемое значение:
//  Строка - имя программной переменной 
//
Функция ПолучитьИмяПрограммнойПеременнойИзСтроки(знач Строка) Экспорт
	
	// Удалим лишние пробелы
	Строка = СокрЛП(Строка);
	Если Строка = "" Тогда
		Возврат "_";
	КонецЕсли;
	
	Строка = УдалитьМножественныеПробелы(Строка);
	
	Если вмс_РаботаСКоллекциямиПовтИсп.ЭтоЦифровойСимвол(Лев(Строка, 1)) Тогда
		Строка = "_" + Строка;
	КонецЕсли;
	
	// Разобьем на слова
	МассивПодстрок = СтрокуВМассив(Строка, " ");
	Строка = "";
	Для Каждого Подстрока Из МассивПодстрок Цикл
		Подстрока = УдалитьНедопустимыеСимволыДляИмениПрограммнойПеременной(Подстрока);
		Строка = Строка + ВРег(Лев(Подстрока, 1)) + Сред(Подстрока, 2);
	КонецЦикла;
	
	Возврат Строка;
	
КонецФункции

Функция ПроверитьИмяПрограммнойПеременной(Имя) Экспорт
	
	КорректноеИмя = ПолучитьИмяПрограммнойПеременнойИзСтроки(Имя);
	
	Возврат НРег(КорректноеИмя) = НРег(Имя);
	
КонецФункции

Функция УдалитьМножественныеПробелы(знач Строка) Экспорт
	
	Пока Истина Цикл
		ДлинаДо = СтрДлина(Строка);
		Строка = СтрЗаменить(Строка, "  ", " ");
		Если ДлинаДо = СтрДлина(Строка) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Строка;
	
КонецФункции

Функция УдалитьНедопустимыеСимволыДляИмениПрограммнойПеременной(Строка) Экспорт
	
	МассивДопустимыхСимволов = вмс_РаботаСКоллекциямиПовтИсп.ПолучитьМассивДопустимыхСимволовИмениПрограммнойПеременной();
	
	НоваяСтрока = "";
	Для НомерСимвола=1 По СтрДлина(Строка) Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		Если МассивДопустимыхСимволов.Найти(Символ) <> Неопределено Тогда
			НоваяСтрока = НоваяСтрока + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция ДобавитьОтступСтрок(МультиСтрока, знач СимволыОтступа=Неопределено) Экспорт
	
	Если СимволыОтступа = Неопределено Тогда
		СимволыОтступа = Символы.Таб;
	КонецЕсли;
	
	МассивСтрок = ЗначениеВМассив(МультиСтрока, Символы.ПС, Ложь, Ложь);
	МассивСтрокСОтступами = Новый Массив;
	Для Каждого Строка Из МассивСтрок Цикл
		МассивСтрокСОтступами.Добавить(СимволыОтступа + Строка);
	КонецЦикла;
	МультиСтрокаСОтступами = МассивВСтроку(МассивСтрокСОтступами, Символы.ПС);
	
	Возврат МультиСтрокаСОтступами;
	
КонецФункции

// Ссылка на значение это коллекция + имя поля в коллекции
// С помощью нее можно получать и устанавливать значения
//
// Параметры:
//  Данные - Структура, Соответствие, Массив, ТаблицаЗначений - исходные данные,
//           для которых требуется получить ссылки на вложенные значения.
//  ДополнительныеПараметры - Структура, Неопределено - параметры разложения
//                            и контейнер дополнительного результата.
//
// Возвращаемое значение:
//  Массив - массив ссылок на значения.
//
Функция РазложитьСтруктуруДанныхВМассивСсылокНаЗначения(Данные, ДополнительныеПараметры=Неопределено) Экспорт
	
	Перем Удостоверение;
	
	ПоляСсылкиНаЗначение = ПоляСсылкиНаЗначение();
	
	Контейнер = Новый Массив;
	Контейнер.Добавить(Данные);
	СсылкаНаЗначение = Новый Структура(ПоляСсылкиНаЗначение, Контейнер, 0, Данные);
	
	СсылкиНаЗначения = Новый Массив;
	СсылкиНаЗначения.Добавить(СсылкаНаЗначение);
	
	УдалитьСсылкиНаЗначения = Новый Массив;
	УдалитьСсылкиНаЗначения.Добавить(0);
	
	ТипСтруктура = Тип("Структура");
	ТипСоответствие = Тип("Соответствие");
	ТипМассив = Тип("Массив");
	ТипУсловноеОформлениеКомпоновкиДанных = Тип("УсловноеОформлениеКомпоновкиДанных");
	ТипЭлементОтбораКомпоновкиДанных = Тип("ЭлементОтбораКомпоновкиДанных");
	#Если Сервер Тогда
		ТипТаблицаЗначений = Тип("ТаблицаЗначений");
	#КонецЕсли
	
	УдостоверениеКЗ = ПолучитьУдостоверениеКвазиСсылки();
	
	НеРазлагатьТаблицы = ПолучитьЗначениеПоляСтруктуры(ДополнительныеПараметры, "НеРазлагатьТаблицы") = Истина;
	НеРазлагатьКвазиСсылки = ПолучитьЗначениеПоляСтруктуры(ДополнительныеПараметры, "НеРазлагатьКвазиСсылки");
	Если НеРазлагатьКвазиСсылки = Неопределено Тогда
		НеРазлагатьКвазиСсылки = Истина;
	Иначе
		НеРазлагатьКвазиСсылки = НеРазлагатьКвазиСсылки = Истина;
	КонецЕсли;
	
	МассивСсылокНаКвазиСсылки = Новый Массив;
	МассивСсылокНаКвазиТаблицы = Новый Массив;
	МассивСсылокНаТаблицы = Новый Массив;
	МассивЗаменКлючейСоответствий = Новый Массив;
	
	ОбработанныеЭлементы = Новый Соответствие;
	
	Для Каждого ОбходСсылкиНаЗначение Из СсылкиНаЗначения Цикл
		
		ЭлементКоллекции = ОбходСсылкиНаЗначение.Значение;
		
		ТипЭлемента = ТипЗнч(ЭлементКоллекции);
		
		Если ТипЭлемента = ТипСтруктура ИЛИ ТипЭлемента = ТипСоответствие Тогда
			
			Если ТипЭлемента = ТипСтруктура Тогда
				
				Если ЭлементКоллекции.Свойство("Удостоверение", Удостоверение) И Удостоверение = УдостоверениеКЗ Тогда
					
					МассивСсылокНаКвазиСсылки.Добавить(ОбходСсылкиНаЗначение);
					
					Если НеРазлагатьКвазиСсылки Тогда
						Продолжить;
					КонецЕсли;
					
				ИначеЕсли ЭтоКвазиТаблицаЗначений(ЭлементКоллекции) Тогда
					
					МассивСсылокНаКвазиТаблицы.Добавить(ОбходСсылкиНаЗначение);
					
					Если НеРазлагатьТаблицы Тогда
						Продолжить;
					КонецЕсли;
					
					Если ОбработанныеЭлементы[ЭлементКоллекции] = Истина Тогда
						Продолжить;
					КонецЕсли;
					ОбработанныеЭлементы[ЭлементКоллекции] = Истина;
					
					Для Каждого СтрокаТаблицы Из ЭлементКоллекции.Строки Цикл
						ОбработанныеЭлементы[СтрокаТаблицы] = Истина;
						Для Каждого Колонка Из ЭлементКоллекции.Колонки Цикл
							ИмяКолонки = Колонка.Ключ;
							СсылкаНаЗначение = Новый Структура(ПоляСсылкиНаЗначение, СтрокаТаблицы, ИмяКолонки, СтрокаТаблицы[ИмяКолонки]);
							СсылкиНаЗначения.Добавить(СсылкаНаЗначение);
						КонецЦикла;
					КонецЦикла;
					
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ОбработанныеЭлементы[ЭлементКоллекции] = Истина Тогда
				Продолжить;
			КонецЕсли;
			ОбработанныеЭлементы[ЭлементКоллекции] = Истина;
			
			Для Каждого ПодЭлемент Из ЭлементКоллекции Цикл
				СсылкаНаЗначение = Новый Структура(ПоляСсылкиНаЗначение, ЭлементКоллекции, ПодЭлемент.Ключ, ПодЭлемент.Значение);
				СсылкиНаЗначения.Добавить(СсылкаНаЗначение);
			КонецЦикла;
			
			Если ТипЭлемента = ТипСоответствие Тогда
				// добавить также обработку ключей
				Для Каждого ПодЭлемент Из ЭлементКоллекции Цикл
					Ключ = ПодЭлемент.Ключ;
					ЗаменаКлючаСоответствия = Новый Структура("Соответствие, Ключ, НовыйКлюч", ЭлементКоллекции, Ключ, Ключ);
					МассивЗаменКлючейСоответствий.Добавить(ЗаменаКлючаСоответствия);
					
					СсылкаНаЗначение = Новый Структура(ПоляСсылкиНаЗначение, ЗаменаКлючаСоответствия, "НовыйКлюч", Ключ);
					СсылкиНаЗначения.Добавить(СсылкаНаЗначение);
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли ТипЭлемента = ТипМассив Тогда
			
			Если ОбработанныеЭлементы[ЭлементКоллекции] = Истина Тогда
				Продолжить;
			КонецЕсли;
			ОбработанныеЭлементы[ЭлементКоллекции] = Истина;
			
			ИндексПодЭлемента = 0;
			Для Каждого ПодЭлемент Из ЭлементКоллекции Цикл
				СсылкаНаЗначение = Новый Структура(ПоляСсылкиНаЗначение, ЭлементКоллекции, ИндексПодЭлемента, ПодЭлемент);
				СсылкиНаЗначения.Добавить(СсылкаНаЗначение);
				ИндексПодЭлемента = ИндексПодЭлемента + 1;
			КонецЦикла;
			
		ИначеЕсли ТипЭлемента = ТипЭлементОтбораКомпоновкиДанных Тогда
			
			Если ОбработанныеЭлементы[ЭлементКоллекции] = Истина Тогда
				Продолжить;
			КонецЕсли;
			ОбработанныеЭлементы[ЭлементКоллекции] = Истина;
			
			ИмяКолонки = "ПравоеЗначение";
			Значение = ЭлементКоллекции[ИмяКолонки];
			СсылкаНаЗначение = Новый Структура(ПоляСсылкиНаЗначение, ЭлементКоллекции, ИмяКолонки, Значение);
			СсылкиНаЗначения.Добавить(СсылкаНаЗначение);
			
		ИначеЕсли ТипЭлемента = ТипУсловноеОформлениеКомпоновкиДанных Тогда
			
			Если ОбработанныеЭлементы[ЭлементКоллекции] = Истина Тогда
				Продолжить;
			КонецЕсли;
			ОбработанныеЭлементы[ЭлементКоллекции] = Истина;
			
			Для Каждого ЭлементОформления Из ЭлементКоллекции.Элементы Цикл
				Для Каждого ЭлементОтбораКомпоновкиДанных Из ЭлементОформления.Отбор.Элементы Цикл
					СсылкаНаЗначение = Новый Структура(ПоляСсылкиНаЗначение, , , ЭлементОтбораКомпоновкиДанных);
					СсылкиНаЗначения.Добавить(СсылкаНаЗначение);
					УдалитьСсылкиНаЗначения.Добавить(СсылкиНаЗначения.ВГраница());
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
		#Если Сервер Тогда
			Если ТипЭлемента = ТипТаблицаЗначений Тогда
				
				МассивСсылокНаТаблицы.Добавить(ОбходСсылкиНаЗначение);
				
				Если НеРазлагатьТаблицы Тогда
					Продолжить;
				КонецЕсли;
				
				Если ОбработанныеЭлементы[ЭлементКоллекции] = Истина Тогда
					Продолжить;
				КонецЕсли;
				ОбработанныеЭлементы[ЭлементКоллекции] = Истина;
				
				ИндексПоследнейКолонки = ЭлементКоллекции.Колонки.Количество()-1;
				Для Каждого СтрокаТаблицы Из ЭлементКоллекции Цикл
					ОбработанныеЭлементы[СтрокаТаблицы] = Истина;
					Для ИндексКолонки=0 По ИндексПоследнейКолонки Цикл
						СсылкаНаЗначение = Новый Структура(ПоляСсылкиНаЗначение, СтрокаТаблицы, ИндексКолонки, СтрокаТаблицы[ИндексКолонки]);
						СсылкиНаЗначения.Добавить(СсылкаНаЗначение);
					КонецЦикла;
				КонецЦикла;
				
				Продолжить;
				
			КонецЕсли;
		#КонецЕсли
		
	КонецЦикла;
	
	//очистка
	Индекс = УдалитьСсылкиНаЗначения.Количество();
	Пока Индекс > 0 Цикл
		Индекс = Индекс - 1;
		ИндексСсылки = УдалитьСсылкиНаЗначения[Индекс];
		СсылкиНаЗначения.Удалить(ИндексСсылки);
	КонецЦикла;
	
	// дополнительный результат
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ДополнительныеПараметры.Вставить("МассивСсылокНаКвазиСсылки", МассивСсылокНаКвазиСсылки);
		ДополнительныеПараметры.Вставить("МассивСсылокНаКвазиТаблицы", МассивСсылокНаКвазиТаблицы);
		ДополнительныеПараметры.Вставить("МассивСсылокНаТаблицы", МассивСсылокНаТаблицы);
		ДополнительныеПараметры.Вставить("МассивЗаменКлючейСоответствий", МассивЗаменКлючейСоответствий);
	КонецЕсли;
	
	// основной результат
	Возврат СсылкиНаЗначения;
	
КонецФункции

Функция ЗаменитьКлючиСоответствий(ЗаменыКлючейСоответствий) Экспорт
	
	МассивЗаменКлючейСоответствий = ЗначениеВМассив(ЗаменыКлючейСоответствий, , Ложь);
	
	Для Каждого ЗаменаКлючаСоответствия Из МассивЗаменКлючейСоответствий Цикл
		Соответствие = ЗаменаКлючаСоответствия.Соответствие;
		ДанныеКлюча = Соответствие[ЗаменаКлючаСоответствия.Ключ];
		Соответствие.Удалить(ЗаменаКлючаСоответствия.Ключ);
		Соответствие.Вставить(ЗаменаКлючаСоответствия.НовыйКлюч, ДанныеКлюча);
	КонецЦикла;
	
КонецФункции

Функция НоваяСсылкаНаЗначение(Коллекция=Неопределено, ИмяПоля=Неопределено, Значение=Неопределено) Экспорт
	
	Возврат Новый Структура(ПоляСсылкиНаЗначение(), Коллекция, ИмяПоля, Значение);
	
КонецФункции

Функция УстановитьЗначениеПоСсылкеНаЗначение(СсылкаНаЗначение, Значение) Экспорт
	СсылкаНаЗначение.Значение = Значение;
	СсылкаНаЗначение.Коллекция[СсылкаНаЗначение.ИмяПоля] = Значение;
КонецФункции

Функция ПолучитьЗначениеПоСсылкеНаЗначение(СсылкаНаЗначение) Экспорт
	
	Возврат СсылкаНаЗначение.Коллекция[СсылкаНаЗначение.ИмяПоля];
	
КонецФункции

Функция ПоляСсылкиНаЗначение()
	
	Возврат "Коллекция, ИмяПоля, Значение";
	
КонецФункции

Функция ЭтоСсылкаНаЗначение(Объект) Экспорт
	
	Возврат ТипЗнч(Объект)=Тип("Структура") И Объект.Свойство("Коллекция") И Объект.Свойство("ИмяПоля");
	
КонецФункции

Функция ПолучитьУдостоверениеКвазиСсылки()
	
	Возврат вмс_Обмен_с_КИС_КлиентСервер.ПолучитьУдостоверениеКвазиСсылки();
	
КонецФункции

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
Функция ПреобразоватьТаблицыЗначенийВКвазиТаблицыЗначенийВДанных(Данные) Экспорт
	
	Если ТипЗнч(Данные) = Тип("ТаблицаЗначений") Тогда
		МассивЗначений = Новый Массив;
		МассивЗначений.Добавить(Данные);
		МассивСсылокНаЗначения = РазложитьСтруктуруДанныхВМассивСсылокНаЗначения(МассивЗначений);
	Иначе
		МассивСсылокНаЗначения = РазложитьСтруктуруДанныхВМассивСсылокНаЗначения(Данные);
	КонецЕсли;
	
	МассивСсылокНаТаблицыЗначений = Новый Массив;
	Для Каждого СсылкаНаЗначение Из МассивСсылокНаЗначения Цикл
		Если ТипЗнч(СсылкаНаЗначение.Значение) = Тип("ТаблицаЗначений") Тогда
			МассивСсылокНаТаблицыЗначений.Добавить(СсылкаНаЗначение);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСсылокНаТаблицыЗначений.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли; 
	
	РазтипизироватьКолонкиТаблицЗначенийВМассивеСсылокНаЗначения(МассивСсылокНаТаблицыЗначений);
	РазвернутьЭлементыМассива(МассивСсылокНаТаблицыЗначений); //сначала преобразуем вложенные таблицы, иначе ссылки на значения станут невалидными
	
	Для Каждого СсылкаНаТаблицуЗначений Из МассивСсылокНаТаблицыЗначений Цикл
		КвазиТаблицаЗначений = НоваяКвазиТаблицаЗначений(СсылкаНаТаблицуЗначений.Значение);
		УстановитьЗначениеПоСсылкеНаЗначение(СсылкаНаТаблицуЗначений, КвазиТаблицаЗначений);
	КонецЦикла;
	
	Если ТипЗнч(Данные) = Тип("ТаблицаЗначений") Тогда
		Данные = МассивЗначений[0];
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьКолонкиТаблицЗначенийВМассивеСсылокНаЗначения(МассивСсылокНаЗначения) Экспорт
	
	СписокТаблиц = Новый Соответствие;
	
	Для Каждого СсылкаНаЗначение Из МассивСсылокНаЗначения Цикл
		Если ТипЗнч(СсылкаНаЗначение.Коллекция) = Тип("СтрокаТаблицыЗначений") Тогда
			Таблица = СсылкаНаЗначение.Коллекция.Владелец();
			КолонкаТаблицы = Таблица.Колонки[СсылкаНаЗначение.ИмяПоля];
			
			КолонкиТаблицы = СписокТаблиц[Таблица];
			Если КолонкиТаблицы = Неопределено Тогда
				КолонкиТаблицы = Новый Соответствие;
				СписокТаблиц[Таблица] = КолонкиТаблицы;
			КонецЕсли;
			
			КолонкиТаблицы[СсылкаНаЗначение.ИмяПоля] = КолонкаТаблицы;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокТаблиц;
	
КонецФункции


Функция РазтипизироватьКолонкиТаблицЗначений(СписокТаблиц) Экспорт
	
	Для Каждого ЭлементКолонкиТаблицы Из СписокТаблиц Цикл
		Таблица = ЭлементКолонкиТаблицы.Ключ;
		КолонкиТаблицы = ЭлементКолонкиТаблицы.Значение;
		Для Каждого ЭлементКолонкаТаблицы Из КолонкиТаблицы Цикл
			ИмяКолонки = ЭлементКолонкаТаблицы.Ключ;
			ИзменитьТипКолонкиТаблицыЗначений(Таблица, ИмяКолонки, Неопределено);
		КонецЦикла;
	КонецЦикла;
	
КонецФункции

Функция ТипизироватьТаблицуЗначений(Таблица, Колонки=Неопределено) Экспорт
	
	Если Колонки = Неопределено Тогда
		МассивКолонок = ПолучитьКолонкиКоллекции(Таблица);
	Иначе
		МассивКолонок = ЗначениеВМассив(Колонки);
	КонецЕсли;
	
	ТипНеопределено = Тип("Неопределено");
	ТипNull = Тип("Null");
	ТипСтрока = Тип("Строка");
	ТипПоУмолчанию = ТипСтрока;
	
	Для Каждого ИмяКолонки Из МассивКолонок Цикл
		
		Колонка = Таблица.Колонки[ИмяКолонки];
		ТипыКолонки = Колонка.ТипЗначения.Типы();
		Если ТипыКолонки.Количество() > 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипыКолонки.Количество() = 1 Тогда
			Если ТипыКолонки[0] <> ТипNull Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ЕстьТипНеопределено = Ложь;
		ЗарегистрированныеТипы = Новый Соответствие;
		ТипыКолонки = Новый Массив;
		ЗначенияКолонки = Новый Массив;
		МаксимальнаяДлинаСтроки = 0;
		
		// проанализируем значения колонки
		Для Каждого Строка Из Таблица Цикл
			Значение = Строка[ИмяКолонки];
			ТипЗначения = ТипЗнч(Значение);
			Если ТипЗначения = ТипНеопределено Тогда
				ЕстьТипНеопределено = Истина;
			ИначеЕсли ЗарегистрированныеТипы[ТипЗначения] <> Истина Тогда
				ЗарегистрированныеТипы[ТипЗначения] = Истина;
				ТипыКолонки.Добавить(ТипЗначения);
			КонецЕсли;
			
			Если ТипЗначения=ТипСтрока Тогда
				ДлинаСтроки = СтрДлина(Значение) + 1;
				Если МаксимальнаяДлинаСтроки < ДлинаСтроки Тогда
					МаксимальнаяДлинаСтроки = ДлинаСтроки;
				КонецЕсли;
			КонецЕсли;
			ЗначенияКолонки.Добавить(Значение);
		КонецЦикла;
		
		Если ТипыКолонки.Количество()=0 Тогда
			// нету ни одного типа, добавим "Строку" по умолчанию
			ТипыКолонки.Добавить(ТипПоУмолчанию);
			
			Если ЕстьТипНеопределено Тогда
				// Чтобы в колонке можно было хранить "Неопределено" требуется составной тип (минимум из 2-х типов)
				// так что добавим еще "Null"
				ТипыКолонки.Добавить(ТипNull);
			КонецЕсли;
			МаксимальнаяДлинаСтроки = 1;
		ИначеЕсли ТипыКолонки.Количество()=1 Тогда
			Если ТипыКолонки[0]=ТипNull Тогда
				// Тип не может состоять только из "Null",
				// запрос не хавает такое
				// добавим еще "Строку"
				ТипыКолонки.Добавить(ТипПоУмолчанию);
			ИначеЕсли ЕстьТипНеопределено Тогда
				// Чтобы в колонке можно было хранить "Неопределено" требуется составной тип (минимум из 2-х типов)
				ТипыКолонки.Добавить(ТипNull);
			КонецЕсли;
		КонецЕсли;
		
		НовыйТипЗначенияКолонки = Новый ОписаниеТипов(ТипыКолонки, , Новый КвалификаторыСтроки(МаксимальнаяДлинаСтроки));
		ИндексКолонки = Таблица.Колонки.Индекс(Колонка);
		Заголовок = Колонка.Заголовок;
		Если Таблица.Колонки.Количество()=1 Тогда
			// Если колонка одна, то при ее удалении удалятся также и строки таблицы
			// поэтому сначала добавим новую колонку
			НовоеИмяСтаройКолонки = ИмяКолонки + "_";
			Колонка.Имя = НовоеИмяСтаройКолонки;
			Таблица.Колонки.Вставить(ИндексКолонки, ИмяКолонки, НовыйТипЗначенияКолонки, Заголовок);
			Таблица.Колонки.Удалить(НовоеИмяСтаройКолонки);
		Иначе
			Таблица.Колонки.Удалить(ИмяКолонки);
			Таблица.Колонки.Вставить(ИндексКолонки, ИмяКолонки, НовыйТипЗначенияКолонки, Заголовок);
		КонецЕсли;
		
		Таблица.ЗагрузитьКолонку(ЗначенияКолонки, ИмяКолонки);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция РазтипизироватьТаблицуЗначений(Таблица, Колонки=Неопределено) Экспорт
	
	Если Колонки = Неопределено Тогда
		МассивКолонок = ПолучитьКолонкиКоллекции(Таблица);
	Иначе
		МассивКолонок = ЗначениеВМассив(Колонки);
	КонецЕсли;
	
	Результат = Ложь;
	Колонки = Таблица.Колонки;
	Для Каждого Имя Из МассивКолонок Цикл
		Колонка = Колонки[Имя];
		Если Колонка.ТипЗначения.Типы().Количество() = 0 Тогда
			// уже разтипизирована
			Продолжить;
		КонецЕсли;
		
		Имя = Колонка.Имя;
		Индекс = Колонки.Индекс(Колонка);
		Значения = Таблица.ВыгрузитьКолонку(Имя);
		Заголовок = Колонка.Заголовок;
		
		Если Колонки.Количество() = 1 Тогда
			// Сначала добавим новую, потом старую удалим
			// иначе удалятся строки таблицы
			НовоеИмяСтаройКолонки = Имя + "_";
			Колонка.Имя = НовоеИмяСтаройКолонки;
			Колонки.Вставить(Индекс, Имя, , Заголовок);
			Колонки.Удалить(НовоеИмяСтаройКолонки);
		Иначе
			Колонки.Удалить(Имя);
			Колонки.Вставить(Индекс, Имя, , Заголовок);
		КонецЕсли;
		
		Таблица.ЗагрузитьКолонку(Значения, Имя);
		Результат = Истина;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Функция РазтипизироватьКолонкиТаблицЗначенийВМассивеСсылокНаЗначения(МассивСсылокНаЗначения) Экспорт
	
	Возврат РазтипизироватьКолонкиТаблицЗначений(ПолучитьКолонкиТаблицЗначенийВМассивеСсылокНаЗначения(МассивСсылокНаЗначения));
	
КонецФункции

Функция МассивОбъектовВМассивИменТипов(МассивОбъектов) Экспорт
	Индекс = Новый Соответствие;
	МассивИменТипов = Новый Массив;
	Для Каждого Объект Из МассивОбъектов Цикл
		ТипОбъекта = ТипЗнч(Объект);
		Если Индекс[ТипОбъекта] = Неопределено Тогда
			Индекс[ТипОбъекта] = Истина;
			МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипОбъекта);
			Если МетаданныеОбъекта <> Неопределено Тогда
				МассивИменТипов.Добавить(МетаданныеОбъекта.ПолноеИмя());
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	Возврат МассивИменТипов;
КонецФункции

Процедура ДобавитьКолонкиВТаблицуЗначенийПоСсылке(ОпрошенныеТипы, Ссылка, ТаблицаДокументов) Экспорт
	
	ОпрошенныеТипы.Добавить(ТипЗнч(Ссылка));
	пМетаданные = Ссылка.Метаданные();
	
	Если пМетаданные.Реквизиты.Найти("Склад") <> Неопределено
		И ТаблицаДокументов.Колонки.Найти("Склад") = Неопределено Тогда
		ТаблицаДокументов.Колонки.Добавить("Склад");
	КонецЕсли;
	
	Если пМетаданные.Реквизиты.Найти("Дата") <> Неопределено 
		И ТаблицаДокументов.Колонки.Найти("Дата") = Неопределено Тогда
		ТаблицаДокументов.Колонки.Добавить("Дата");
	КонецЕсли;
	
	Если пМетаданные.Реквизиты.Найти("Номер") <> Неопределено 
		И ТаблицаДокументов.Колонки.Найти("Номер") = Неопределено Тогда
		ТаблицаДокументов.Колонки.Добавить("Номер");
	КонецЕсли;  
	
	Если пМетаданные.Реквизиты.Найти("Контрагент") <> Неопределено 
		И ТаблицаДокументов.Колонки.Найти("Контрагент") = Неопределено Тогда
		ТаблицаДокументов.Колонки.Добавить("Контрагент");
	КонецЕсли;
	
	Если пМетаданные.Реквизиты.Найти("Комментарий") <> Неопределено
		И ТаблицаДокументов.Колонки.Найти("Комментарий") = Неопределено Тогда
		ТаблицаДокументов.Колонки.Добавить("Комментарий");
	КонецЕсли;   
	
	//ИмяТабличнойЧасти = вмс_АдаптацияКонфигураций.ПолучитьИмяТабличнойЧасти();
	// ТУ_Мовчан 12.12.23 ++
	ИменаТабличныхЧастей = вмс_АдаптацияКонфигураций.ПолучитьИмяТабличнойЧасти();
	Если Тип("Массив") = ТипЗнч(ИменаТабличныхЧастей) Тогда 
		Для каждого ИмяТабличнойЧасти Из ИменаТабличныхЧастей Цикл
			ЕстьТабличнаяЧасть = пМетаданные.ТабличныеЧасти.Найти(ИмяТабличнойЧасти) <> Неопределено;
			Прервать;
		КонецЦикла;
	Иначе  
		ЕстьТабличнаяЧасть = пМетаданные.ТабличныеЧасти.Найти(ИменаТабличныхЧастей) <> Неопределено;	
	КонецЕсли;
	Если ЕстьТабличнаяЧасть Тогда	
		// ТУ_Мовчан 12.12.23 --
		//Если пМетаданные.ТабличныеЧасти.Найти(ИмяТабличнойЧасти) <> Неопределено Тогда
		
		Если ТаблицаДокументов.Колонки.Найти("КоличествоСтрок") = Неопределено Тогда
			ТаблицаДокументов.Колонки.Добавить("КоличествоСтрок");
		КонецЕсли;
		
		Если ТаблицаДокументов.Колонки.Найти("Количество") = Неопределено Тогда
			ТаблицаДокументов.Колонки.Добавить("Количество");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли

&НаКлиенте
Функция ВосстановитьКвазиТаблицыЗначенийВДанных(Данные) Экспорт
	
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить(Данные);
	МассивСсылокНаЗначения = РазложитьСтруктуруДанныхВМассивСсылокНаЗначения(МассивЗначений, Истина);
	
	Для Каждого СсылкаНаЗначение Из МассивСсылокНаЗначения Цикл
		Если ЭтоКвазиТаблицаЗначений(СсылкаНаЗначение.Значение) Тогда
			ВосстановитьКвазиТаблицуЗначений(СсылкаНаЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПреобразоватьКоллекциюВСоответствие(Коллекция, КолонкаКлюча, КолонкаЗначения) Экспорт
	
	Соответствие = Новый Соответствие;
	
	Для Каждого ЭлементКоллекции Из Коллекция Цикл
		Соответствие[ЭлементКоллекции[КолонкаКлюча]] = ЭлементКоллекции[КолонкаЗначения];
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПреобразоватьМассивВСоответствие(Массив, Значение=Истина) Экспорт
	
	Соответствие = Новый Соответствие;
	
	Для Каждого ЭлементКоллекции Из Массив Цикл
		Соответствие[ЭлементКоллекции] = Значение;
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ЗаменитьЗначенияВМассивеСсылокНаЗначения(МассивСсылокНаЗначения, НовыеЗначения) Экспорт
	
	Для Каждого СсылкаНаЗначение Из МассивСсылокНаЗначения Цикл
		СсылкаНаЗначение.Значение = НовыеЗначения[СсылкаНаЗначение.Значение];
		СсылкаНаЗначение.Коллекция[СсылкаНаЗначение.ИмяПоля] = СсылкаНаЗначение.Значение;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьИмяНовогоЭлементаКоллекции(ЖелаемоеИмя, Коллекция, Реквизит="Имя") Экспорт
	
	Отбор = Новый Структура(Реквизит);
	СвободноеИмя = ЖелаемоеИмя;
	
	Если Реквизит="Имя" Тогда
		ТипыСМетодомНайти = Новый Массив;
		ТипыСМетодомНайти.Добавить(Тип("ВсеЭлементыФормы"));
		ТипыСМетодомНайти.Добавить(Тип("КомандыФормы"));
		#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
			ТипыСМетодомНайти.Добавить(Тип("КоллекцияКолонокТаблицыЗначений"));
		#КонецЕсли
		ИспользоватьМетодНайти = ТипыСМетодомНайти.Найти(ТипЗнч(Коллекция)) <> Неопределено;
	Иначе
		ИспользоватьМетодНайти = Ложь;
	КонецЕсли;
	
	Номер = 1;
	Пока Истина Цикл
		Если ИспользоватьМетодНайти Тогда
			Элемент = Коллекция.Найти(СвободноеИмя);
		Иначе
			Отбор[Реквизит] = СвободноеИмя;
			Элемент = НайтиЭлементКоллекции(Коллекция, Отбор);
		КонецЕсли;
		
		Если Элемент = Неопределено Тогда
			Возврат СвободноеИмя;
		КонецЕсли;
		
		Номер = Номер + 1;
		НомерСтрокой = Формат(Номер, "ЧГ=0");
		СвободноеИмя = ЖелаемоеИмя + НомерСтрокой;
	КонецЦикла; 
	
КонецФункции

Функция РаспределитьРесурсыКоллекции(Коллекция, КоллекцияРесурсов, КолонкаПоказатель, КолонкаРесурс, знач ПоляПоиска, знач ПоляЗаполнения=Неопределено) Экспорт
	
	Если ТипЗнч(ПоляПоиска) = Тип("Строка") Тогда
		ПоляПоискаМассив = ЗначениеВМассив(ПоляПоиска, , Ложь);
	ИначеЕсли ТипЗнч(ПоляПоиска) = Тип("Массив") Тогда
		ПоляПоискаМассив = ПоляПоиска;
		ПоляПоиска = МассивВСтроку(ПоляПоискаМассив);
	Иначе
		ПоляПоискаМассив = Новый Массив;
		ПоляПоиска = "";
	КонецЕсли;

	Если ТипЗнч(ПоляЗаполнения) = Тип("Строка") Тогда
		ПоляЗаполненияМассив = ЗначениеВМассив(ПоляЗаполнения, , Ложь);
	ИначеЕсли ТипЗнч(ПоляЗаполнения) = Тип("Массив") Тогда
		ПоляЗаполненияМассив = ПоляЗаполнения;
		ПоляЗаполнения = МассивВСтроку(ПоляЗаполненияМассив);
	Иначе
		ПоляЗаполненияМассив = Новый Массив;
		ПоляЗаполнения = "";
	КонецЕсли;
	
	КолонкиМассив = ПолучитьКолонкиКоллекции(Коллекция);
	ДобавитьЭлементыКоллекции(КолонкиМассив, ПоляЗаполнения);
	УдалитьДублиВМассиве(КолонкиМассив);
	Если ЭтоТаблицаЗначений(Коллекция) Тогда
		КоллекцияРезультат = НоваяТаблицаЗначений(КолонкиМассив, Коллекция);
	Иначе
		КоллекцияРезультат = НоваяКвазиТаблицаЗначений(КолонкиМассив);
	КонецЕсли;

	Элементы = ПолучитьЭлементыКоллекции(Коллекция);
	
	ОтборРесурсов = Новый Структура(ПоляПоиска);
	СтруктураЗаполнения = Новый Структура(ПоляЗаполнения);
	СтруктураЗаполнения.Вставить(КолонкаПоказатель);
	
	Для Каждого Элемент Из Элементы Цикл
		
		КоличествоТребуемое = Элемент[КолонкаПоказатель];
		Если КоличествоТребуемое > 0 Тогда
			ЗаполнитьЗначенияСвойств(ОтборРесурсов, Элемент, ПоляПоиска);
			ЭлементыРесурсов = НайтиЭлементыКоллекции(КоллекцияРесурсов, ОтборРесурсов);
			Для Каждого ЭлементРесурса Из ЭлементыРесурсов Цикл
				КоличествоРесурс = ЭлементРесурса[КолонкаРесурс];
				КоличествоЗабрать = Макс(Мин(КоличествоРесурс, КоличествоТребуемое), 0);
				Если КоличествоЗабрать = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НовыйЭлемент = НовыйЭлементКоллекции(КоллекцияРезультат);
				ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элемент);
				ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, ЭлементРесурса, ПоляЗаполнения);
				СтруктураЗаполнения[КолонкаПоказатель] = КоличествоЗабрать;
				СтруктураЗаполнения[КолонкаРесурс] = КоличествоЗабрать;
				ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтруктураЗаполнения);
				
				КоличествоТребуемое = КоличествоТребуемое - КоличествоЗабрать;
				ЭлементРесурса[КолонкаРесурс] = ЭлементРесурса[КолонкаРесурс] - КоличествоЗабрать;
			КонецЦикла;
			
			Если КоличествоТребуемое > 0 Тогда
				НовыйЭлемент = НовыйЭлементКоллекции(КоллекцияРезультат);
				ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элемент);
				НовыйЭлемент[КолонкаПоказатель] = КоличествоТребуемое;
			КонецЕсли; 
		Иначе
			НовыйЭлемент = НовыйЭлементКоллекции(КоллекцияРезультат);
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элемент);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КоллекцияРезультат;
	
КонецФункции

Функция ПреобразоватьИерархическуюКоллекциюВПлоскую(Коллекция, ПолеИерархии, МаксУровень=-1) Экспорт

	ПлоскаяКоллекция = Новый Массив;

	ДобавленныеЭлементы = Новый Соответствие;
	ЭлементыДляОбхода = Новый Массив;
	
	Для Каждого Элемент Из Коллекция Цикл
		ПлоскаяКоллекция.Добавить(Элемент);
		ЭлементыДляОбхода.Добавить(Элемент);
		ДобавленныеЭлементы[Элемент] = Истина;
	КонецЦикла;
	
	Уровень = 0;
	Пока ЭлементыДляОбхода.Количество() > 0 Цикл
		ЭлементыДляОбхода2 = Новый Массив;
		Для Каждого Элемент Из ЭлементыДляОбхода Цикл
			СтруктураЗаполнения = Новый Структура(ПолеИерархии);
			ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Элемент);
			ПодчиненнаяКоллекция = СтруктураЗаполнения[ПолеИерархии];
			Если ПодчиненнаяКоллекция <> Неопределено Тогда
				Для Каждого ПодЭлемент Из ПодчиненнаяКоллекция Цикл
					Если ДобавленныеЭлементы[ПодЭлемент] = Истина Тогда
						ТочкаОстановы = 0;
					Иначе
						ПлоскаяКоллекция.Добавить(ПодЭлемент);
						ЭлементыДляОбхода2.Добавить(ПодЭлемент);
						ДобавленныеЭлементы[ПодЭлемент] = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если Уровень = МаксУровень Тогда
			Прервать;
		КонецЕсли;
		
		Уровень = Уровень + 1;
		
		ЭлементыДляОбхода = ЭлементыДляОбхода2;
	КонецЦикла;
	
	Возврат ПлоскаяКоллекция;

КонецФункции

Функция СделатьСлепокДанных0(Данные, Описание) Экспорт

	ОписаниеСоответствие = Новый Соответствие;
	
	ОписаниеПолейМассив = Новый Массив;
	ОписаниеМассив = СтрокуВМассив(Описание, Символы.ПС);
	Для Каждого ОписаниеСтрока Из ОписаниеМассив Цикл
		ПозицияВТексте = СтрНайти(ОписаниеСтрока, ",");
		ИмяПоля = СтрЗаменить(Лев(ОписаниеСтрока, ПозицияВТексте-1), " ", "");
		ИмяПоляМассив = МассивВСтроку(ИмяПоля, ".");
		ОписаниеПоля = СтрЗаменить(Прав(ОписаниеСтрока, СтрДлина(ОписаниеСтрока)-ПозицияВТексте), " ", "");
		Если ОписаниеПоля = "[]" Тогда
			ЗначениеПоля = Новый Массив;
		Иначе
			Если Лев(ОписаниеПоля, 1) = "(" Тогда
				ОписаниеПоля = Сред(ОписаниеПоля, 2);
			КонецЕсли;

			Если Прав(ОписаниеПоля, 1) = ")" Тогда
				ОписаниеПоля = Лев(ОписаниеПоля, СтрДлина(ОписаниеПоля)-1);
			КонецЕсли;
			
			ЗначениеПоля = Новый Структура(ОписаниеПоля);
		КонецЕсли;
		
		ОписаниеПоляСтруктура = Новый Структура;
		ОписаниеПоляСтруктура.Вставить("ЗначениеПоля", ЗначениеПоля);
		ОписаниеПоляСтруктура.Вставить("ИмяПоляМассив", ИмяПоляМассив);
		ОписаниеПоляСтруктура.Вставить("ИмяПоля", ИмяПоля);
		ОписаниеПоляСтруктура.Вставить("Уровень", ИмяПоляМассив.Количество());
		ОписаниеСоответствие[ИмяПоля] = ОписаниеПоляСтруктура;
		
		ОписаниеПолейМассив.Добавить(ОписаниеПоляСтруктура);
	КонецЦикла;
	
	СортироватьКоллекцию(ОписаниеПолейМассив, "Уровень");
	
	Слепок = Новый Структура;
	
	Для Каждого ОписаниеПоляСтруктура Из ОписаниеПолейМассив Цикл
		ИмяРодителя = "";
		Родитель = Слепок;
		РодительДанные = Данные;
		Для Каждого ЧастьИмени Из ОписаниеПоляСтруктура.ИмяПоляМассив Цикл
			ИмяРодителя = ИмяРодителя + ЧастьИмени;
			ОписаниеПоляСтруктураРодитель = ОписаниеСоответствие[ИмяРодителя];
			Если ОписаниеПоляСтруктураРодитель = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
			
			Родитель = Родитель[ИмяРодителя];
			РодительДанные = РодительДанные[ИмяРодителя];
		КонецЦикла;
	КонецЦикла;
	
КонецФункции

Функция СделатьСлепокДанных(Данные, знач ОписаниеДанных) Экспорт

	Если ТипЗнч(ОписаниеДанных) = Тип("Строка") Тогда
		ОписаниеДанных = ТекстовыйПарсер_РазпарситьСтроку(НовыйТекстовыйПарсер(), ОписаниеДанных);
	КонецЕсли;
	
	Слепок = Новый Структура;
	
	СоответствиеСлепокОписание = Новый Соответствие;
	СоответствиеСлепокОписание[Слепок] = ОписаниеДанных;

	СоответствиеСлепокДанные = Новый Соответствие;
	СоответствиеСлепокДанные[Слепок] = Данные;
	
	ДополнительныеПараметры = Новый Соответствие;
	
	ОбходЭлементов = Новый Массив;
	ОбходЭлементов.Добавить(Слепок);
	
	ТипСтруктура = Тип("Структура");
	ТипМассив = Тип("Массив");
	
	Для Каждого ЭлементСлепка Из ОбходЭлементов Цикл
		ЭлементОписания = СоответствиеСлепокОписание[ЭлементСлепка];
		ЭлементДанных = СоответствиеСлепокДанные[ЭлементСлепка];
		
		ТипЭлемента = ТипЗнч(ЭлементОписания);
		
		Если ТипЭлемента = ТипСтруктура Тогда
			
			ПараметрыЭлемента = ДополнительныеПараметры[ЭлементОписания];
			Если ПараметрыЭлемента = Неопределено Тогда
				ПоляМассив = ВыгрузитьЗначенияКолонкиКоллекции(ЭлементОписания, "Ключ");
				ПоляСтрока = МассивВСтроку(ПоляМассив);
				
				ПараметрыЭлемента = Новый Структура;
				ПараметрыЭлемента.Вставить("ПоляСтрока", ПоляСтрока);
				
				ДополнительныеПараметры[ЭлементОписания] = ПараметрыЭлемента;
			КонецЕсли;
			
			ПоляЭлементаДанных = Новый Структура(ПараметрыЭлемента.ПоляСтрока);
			ЗаполнитьЗначенияСвойств(ПоляЭлементаДанных, ЭлементДанных);
			
			Для Каждого КлючИЗначения Из ЭлементОписания Цикл
				ИмяПоля = КлючИЗначения.Ключ;
				ЗначениеПоля = КлючИЗначения.Значение;
				ПодЭлементДанных = ПоляЭлементаДанных[ИмяПоля];
				
				ТипЗначения = ТипЗнч(ЗначениеПоля);
				Если ТипЗначения = ТипСтруктура ИЛИ ТипЗначения = ТипМассив Тогда
					Если ПодЭлементДанных <> Неопределено Тогда
						НовоеЗначение = Новый(ТипЗначения);
						СоответствиеСлепокОписание[НовоеЗначение] = ЗначениеПоля;
						СоответствиеСлепокДанные[НовоеЗначение] = ПодЭлементДанных;
						ОбходЭлементов.Добавить(НовоеЗначение);
					Иначе
						НовоеЗначение = Неопределено;
					КонецЕсли;
					ЭлементСлепка.Вставить(ИмяПоля, НовоеЗначение);
				Иначе
					ЭлементСлепка.Вставить(ИмяПоля, ПодЭлементДанных);
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ТипЭлемента = ТипМассив Тогда
			
			Если ЭлементОписания.Количество() = 0 Тогда
				ТипЭлементаМассива = Неопределено;
			Иначе
				ОписаниеЭлементаМассива = ЭлементОписания[0];
				ТипЭлементаМассива = ТипЗнч(ОписаниеЭлементаМассива);
			КонецЕсли;
		
			Если ТипЭлементаМассива = ТипСтруктура ИЛИ ТипЭлементаМассива = ТипМассив Тогда
				
				Для Каждого ПодЭлементДанных Из ЭлементДанных Цикл
					ПодЭлементСлепка = Новый(ТипЭлементаМассива);
					ЭлементСлепка.Добавить(ПодЭлементСлепка);
					СоответствиеСлепокОписание[ПодЭлементСлепка] = ОписаниеЭлементаМассива;
					СоответствиеСлепокДанные[ПодЭлементСлепка] = ПодЭлементДанных;
					ОбходЭлементов.Добавить(ПодЭлементСлепка);
				КонецЦикла;
				
			Иначе
				
				Для Каждого ПодЭлементДанных Из ЭлементДанных Цикл
					ЭлементСлепка.Добавить(ПодЭлементДанных);
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Слепок;
	
КонецФункции

Функция НовоеПеречисление(Элементы, Тип="Число") Экспорт
	
	МассивЭлементов = ЗначениеВМассив(Элементы, , Ложь);
	
	Перечисление = Новый Структура;
	
	Если Тип = "Число" Тогда
		Для НомерЭлемента=1 По МассивЭлементов.Количество() Цикл
			Перечисление.Вставить(МассивЭлементов[НомерЭлемента-1], НомерЭлемента);
		КонецЦикла;
	Иначе
		Для Каждого Имя Из МассивЭлементов Цикл
			Перечисление.Вставить(Имя, Имя);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Перечисление;
	
КонецФункции

///////////////////////////////////////////////////////////////////
//
//				Деревья+
//

Функция ПолучитьПодчиненныеЭлементыКоллекции(Коллекция, МаксимальныйУровеньВложенности=0) Экспорт
	
	Элементы = Новый Массив;
	
	Если ТипЗнч(Коллекция)=Тип("Массив") Тогда
		Для Каждого Элемент Из Коллекция Цикл
			Элементы.Добавить(Элемент);
		КонецЦикла;
	Иначе
		Элементы.Добавить(Коллекция);
	КонецЕсли;
	
	// понадобится при удалении корней
	КоличествоКорней = Элементы.Количество();

	НомерЭлемента = 0;
	КоличествоЭлементов = Элементы.Количество();
	Уровень = 0;
	Пока НомерЭлемента < КоличествоЭлементов Цикл

		Пока НомерЭлемента < КоличествоЭлементов Цикл
			
			Элемент = Элементы[НомерЭлемента];
			
			ИмяТипа = Строка(ТипЗнч(Элемент));
			
			Если ИмяТипа="ДеревоЗначений" ИЛИ ИмяТипа="СтрокаДереваЗначений" Тогда
				ПодчиненныеЭлементыКоллекции = Элемент.Строки;
			ИначеЕсли ИмяТипа="ДанныеФормыДерево" ИЛИ ИмяТипа="ДанныеФормыЭлементДерева" Тогда
				ПодчиненныеЭлементыКоллекции = Элемент.ПолучитьЭлементы();
			Иначе
				ПодчиненныеЭлементыКоллекции = Новый Массив;
			КонецЕсли;
			
			Для Каждого ПодчиненныйЭлемент Из ПодчиненныеЭлементыКоллекции Цикл
				Элементы.Добавить(ПодчиненныйЭлемент);
			КонецЦикла;
			
			НомерЭлемента = НомерЭлемента + 1;

		КонецЦикла;
		
		Уровень = Уровень + 1;
		
		Если Уровень=МаксимальныйУровеньВложенности Тогда
			Прервать;
		КонецЕсли;
		
		КоличествоЭлементов = Элементы.Количество();
		
	КонецЦикла;

	Для НомерЭлемента=0 По КоличествоКорней-1 Цикл
		ОбратныйНомер = КоличествоКорней-1-НомерЭлемента;
		Элементы.Удалить(ОбратныйНомер);
	КонецЦикла;

	Возврат Элементы;
	
КонецФункции

Функция НайтиЭлементДерева(Коллекция, Отбор) Экспорт
	
	НайденныеЭлементы = НайтиЭлементыДерева(Коллекция, Отбор, Истина);
	
	Если НайденныеЭлементы.Количество() > 0 Тогда
		
		Возврат НайденныеЭлементы[0];
		
	КонецЕсли;
	
КонецФункции

Функция НайтиЭлементыДерева(Коллекция, Отбор, ОстановитьсяПослеПервого=Ложь) Экспорт

	Возврат НайтиЭлементыКоллекции(ПолучитьПодчиненныеЭлементыКоллекции(Коллекция), Отбор, , ОстановитьсяПослеПервого);

КонецФункции

Функция ПолучитьРодителяЭлементаКоллекции(Элемент, Коллекция=Неопределено) Экспорт

	ИмяТипа = Строка(ТипЗнч(Элемент));
	
	Если ИмяТипа="СтрокаДереваЗначений" Тогда
		Родитель = Элемент.Родитель;
	ИначеЕсли ИмяТипа="ДанныеФормыЭлементДерева" Тогда
		Родитель = Элемент.ПолучитьРодителя();
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	Если Родитель=Неопределено Тогда
		Родитель = Коллекция;
	КонецЕсли;
	
	Возврат Родитель;
	
КонецФункции

//
//				Деревья-
//
///////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////
//
//				Текстовый парсер+
//

Функция НовыйТекстовыйПарсер() Экспорт

	ЛогическиеБлоки = Новый Соответствие;
	
	Парсер = Новый Структура;
	Парсер.Вставить("ЛогическиеБлоки", ЛогическиеБлоки);
	Парсер.Вставить("РазделительПолей", ",");
	Парсер.Вставить("РазделительЗначения", ":");
	
	ТекстовыйПарсер_ДобавитьЛогическийБлок(Парсер, "(", ")", Тип("Структура"));
	ТекстовыйПарсер_ДобавитьЛогическийБлок(Парсер, "[", "]", Тип("Массив"));
	
	Возврат Парсер;
	
КонецФункции

Функция ТекстовыйПарсер_ДобавитьЛогическийБлок(Парсер, Начало, Конец, Тип=Неопределено) Экспорт
	
	ЛогическийБлок = Новый Структура("Начало, Конец, Тип", Начало, Конец, Тип);
	Если ЛогическийБлок.Тип = Неопределено Тогда
		ЛогическийБлок.Тип = Тип("Структура");
	КонецЕсли;
	Парсер.ЛогическиеБлоки[Начало] = ЛогическийБлок;
	
КонецФункции

Функция ТекстовыйПарсер_РазпарситьСтроку(знач Парсер=Неопределено, Строка) Экспорт
	
	Если Парсер = Неопределено Тогда
		Парсер = НовыйТекстовыйПарсер();
	КонецЕсли;
	
	////////////////////////////////////////////////
	Кавычка = """";
	СпецСимволы = Новый Соответствие;
	Для Каждого ЭлмЛогическийБлок Из Парсер.ЛогическиеБлоки Цикл
		СпецСимволы[ЭлмЛогическийБлок.Ключ] = Истина;
	КонецЦикла;
	СпецСимволы[Парсер.РазделительЗначения] = Истина;
	СпецСимволы[Парсер.РазделительПолей] = Истина;
	СпецСимволы[Кавычка] = Истина;
	СпецСимволы["%"] = Истина;
	
	ПустыеСимволы = Новый Соответствие;
	ПустыеСимволы[" "] = Истина;
	ПустыеСимволы[Символы.ПС] = Истина;
	ПустыеСимволы[Символы.Таб] = Истина;
	
	ТипСтруктура = Тип("Структура");
	ТипСоответствие = Тип("Соответствие");
	ТипМассив = Тип("Массив");
	
	////////////////////////////////////////////////
	НомерСимвола = 1;
	ДлинаСтроки = СтрДлина(Строка);
	СтекЭлементов = Новый Массив;
	ДанныеПоУмолчанию = Новый Структура;
	ДанныеПоУмолчанию.Вставить("Коллекция", Новый Структура);
	ДанныеПоУмолчанию.Вставить("Поле", "");
	ДанныеПоУмолчанию.Вставить("Значение");
	ДанныеПоУмолчанию.Вставить("Слово", "");
	ДанныеПоУмолчанию.Вставить("ЗакодированноеСлово", "");
	ДанныеПоУмолчанию.Вставить("ЛогическийБлок", Неопределено);
	ДанныеПоУмолчанию.Вставить("КонецЛогическогоБлока", Неопределено);
	ДанныеПоУмолчанию.Вставить("ТипЛогическогоБлока", ТипСтруктура);
	ДанныеПоУмолчанию.Вставить("ЧтениеСлова", Ложь);
	ДанныеПоУмолчанию.Вставить("КодирующийСимвол", "");
	ДанныеПоУмолчанию.Вставить("ПрочитатьСимволыКодированногоСлова", 0);
	ДанныеПоУмолчанию.Вставить("ЧтениеЗначения", Ложь);
	ДанныеПоУмолчанию.Вставить("ЗначениеВКавычках", Неопределено);
	
	ТекущиеДанные = СкопироватьОбъект(ДанныеПоУмолчанию);
	
	Пока НомерСимвола <= ДлинаСтроки Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		ЭтоПустойСимвол = ПустыеСимволы[Символ] = Истина;
		Если Не ЭтоПустойСимвол Тогда
			Прервать;
		КонецЕсли;
		НомерСимвола = НомерСимвола + 1;
	КонецЦикла;
	
	Символ = Сред(Строка, НомерСимвола, 1);
	ЛогическийБлок = Парсер.ЛогическиеБлоки[Символ];
	Если ЛогическийБлок = Неопределено Тогда
		// по умолчанию результат - структура
		НоваяКоллекция = Новый Структура;
		ТекущиеДанные.Значение = НоваяКоллекция;
		СтекЭлементов.Добавить(ТекущиеДанные);
		
		ТекущиеДанные = СкопироватьОбъект(ДанныеПоУмолчанию);
		ТекущиеДанные.Коллекция = НоваяКоллекция;
		ТекущиеДанные.КонецЛогическогоБлока = "";
		ТекущиеДанные.ТипЛогическогоБлока = ТипСтруктура;
	КонецЕсли;
	
	Пока НомерСимвола <= ДлинаСтроки+1 Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		
		ЭтоПустойСимвол = ПустыеСимволы[Символ] = Истина;
		ЭтоКонец = Символ = "";
		
		ЭтоКонецЛогическогоБлока = Символ = ТекущиеДанные.КонецЛогическогоБлока;
		ЭтоСпецСимвол = СпецСимволы[Символ] = Истина ИЛИ ЭтоКонецЛогическогоБлока ИЛИ ЭтоПустойСимвол ИЛИ ЭтоКонец;
		
		ЗаписатьЗначение = Ложь;
		ПоднятьсяПоСтеку = Ложь;
		
		/////////////////////////////////////////////////////////////////////////////////////////////////////////////
		Если ТекущиеДанные.ЧтениеСлова Тогда
			
			Если ТекущиеДанные.ПрочитатьСимволыКодированногоСлова > 0 Тогда
				
				ТекущиеДанные.ПрочитатьСимволыКодированногоСлова = ТекущиеДанные.ПрочитатьСимволыКодированногоСлова - 1;
				ТекущиеДанные.ЗакодированноеСлово = ТекущиеДанные.ЗакодированноеСлово + Символ;
				
				Если ТекущиеДанные.КодирующийСимвол = Кавычка Тогда
					
					Если ТекущиеДанные.ЗакодированноеСлово = Кавычка Тогда
						ТекущиеДанные.Слово = ТекущиеДанные.Слово + ТекущиеДанные.ЗакодированноеСлово;
						НомерСимвола = НомерСимвола + 1;
						Продолжить;
					Иначе
						ТекущиеДанные.ЧтениеСлова = Ложь;
					КонецЕсли;
					
				Иначе
					
					Если ТекущиеДанные.ЗакодированноеСлово = "r" Тогда
						ТекущиеДанные.ПрочитатьСимволыКодированногоСлова = 1;
					КонецЕсли;
					НомерСимвола = НомерСимвола + 1;
					
					Если ТекущиеДанные.ПрочитатьСимволыКодированногоСлова = 0 Тогда
						// закончить чтение закодированного слова
						Если ТекущиеДанные.ЗакодированноеСлово = "r1" ИЛИ ТекущиеДанные.ЗакодированноеСлово = "r2" Тогда
							// Рекурсия ссылок
							Уровень = СтекЭлементов.ВГраница() - ?(ТекущиеДанные.ЗакодированноеСлово = "r1", 0, 1);
							ТекущиеДанные.Значение = СтекЭлементов[Уровень].Коллекция;
							ТекущиеДанные.ЧтениеСлова = Ложь;
						Иначе
							ТекущиеДанные.Слово = ТекущиеДанные.Слово + ТекущиеДанные.ЗакодированноеСлово;
						КонецЕсли;
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли;
				
			ИначеЕсли ТекущиеДанные.ЗначениеВКавычках Тогда
				
				Если Символ = Кавычка Тогда
					ТекущиеДанные.ПрочитатьСимволыКодированногоСлова = 1;
					ТекущиеДанные.ЗакодированноеСлово = "";
					ТекущиеДанные.КодирующийСимвол = Символ;
					НомерСимвола = НомерСимвола + 1;
					Продолжить;
				КонецЕсли;
				
				ТекущиеДанные.Слово = ТекущиеДанные.Слово + Символ;
				
			Иначе
				
				Если ЭтоПустойСимвол Тогда
					НомерСимвола = НомерСимвола + 1;
					Продолжить;
				КонецЕсли;
				
				Если ЭтоСпецСимвол Тогда
					Если Символ = Кавычка Тогда
						ТекущиеДанные.ЗначениеВКавычках = Истина;
					ИначеЕсли Символ = "%" Тогда
						ТекущиеДанные.ПрочитатьСимволыКодированногоСлова = 1;
						ТекущиеДанные.ЗакодированноеСлово = "";
						ТекущиеДанные.КодирующийСимвол = Символ;
					Иначе
						ТекущиеДанные.ЧтениеСлова = Ложь;
					КонецЕсли;
				Иначе
					ТекущиеДанные.Слово = ТекущиеДанные.Слово + Символ;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТекущиеДанные.ЧтениеСлова Тогда
				
				НомерСимвола = НомерСимвола + 1;
				
			Иначе
				
				// закончить чтение слова
				Если ТекущиеДанные.ЧтениеЗначения Тогда
					ТекущиеДанные.ЧтениеЗначения = Ложь;
					ТекущиеДанные.Значение = ТекущиеДанные.Слово;
				Иначе
					ТекущиеДанные.Поле = ТекущиеДанные.Слово;
					Если Символ = Парсер.РазделительЗначения Тогда
						ТекущиеДанные.ЧтениеЗначения = Истина;
						НомерСимвола = НомерСимвола + 1;
					Иначе
						// значение не указано, записать пустое значение
						ТекущиеДанные.Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если ЭтоПустойСимвол Тогда
				НомерСимвола = НомерСимвола + 1;
				Продолжить;
			КонецЕсли;
			
			Если Символ = Кавычка ИЛИ Символ = "%" ИЛИ Не ЭтоСпецСимвол Тогда
				ТекущиеДанные.Слово = "";
				ТекущиеДанные.ЗначениеВКавычках = Ложь;
				ТекущиеДанные.ЗакодированноеСлово = "";
				ТекущиеДанные.ПрочитатьСимволыКодированногоСлова = 0;
				ТекущиеДанные.ЧтениеСлова = Истина;
				
				Если ТекущиеДанные.ТипЛогическогоБлока = Тип("Массив") Тогда
					ТекущиеДанные.ЧтениеЗначения = Истина;
				КонецЕсли;
				
				Продолжить;
			КонецЕсли;
			
			/////////////////////////////////////////////////////////////////////////////////////////////////////////////
			ЛогическийБлок = Парсер.ЛогическиеБлоки[Символ];
			Если ЛогическийБлок <> Неопределено Тогда
				
				НоваяКоллекция = Новый(ЛогическийБлок.Тип);
				ТекущиеДанные.Значение = НоваяКоллекция;
				СтекЭлементов.Добавить(ТекущиеДанные);
				
				ТекущиеДанные = СкопироватьОбъект(ДанныеПоУмолчанию);
				ТекущиеДанные.Коллекция = НоваяКоллекция;
				ТекущиеДанные.ЛогическийБлок = ЛогическийБлок;
				ТекущиеДанные.КонецЛогическогоБлока = ЛогическийБлок.Конец;
				ТекущиеДанные.ТипЛогическогоБлока = ЛогическийБлок.Тип;
				
			ИначеЕсли Символ = Парсер.РазделительПолей Тогда
				
				ЗаписатьЗначение = Истина;
				
			ИначеЕсли ЭтоКонецЛогическогоБлока Тогда
				
				ЗаписатьЗначение = Истина;
				ПоднятьсяПоСтеку = Истина;
				
			КонецЕсли;
			
			НомерСимвола = НомерСимвола + 1;
			
		КонецЕсли;
		
		Если ЗаписатьЗначение Тогда
			Если ТекущиеДанные.ТипЛогическогоБлока = ТипСтруктура ИЛИ ТекущиеДанные.ТипЛогическогоБлока = ТипСоответствие Тогда
				Если ТекущиеДанные.Поле <> "" Тогда
					ТекущиеДанные.Коллекция.Вставить(ТекущиеДанные.Поле, ТекущиеДанные.Значение);
				КонецЕсли;
			ИначеЕсли ТекущиеДанные.ТипЛогическогоБлока = ТипМассив Тогда
				ТекущиеДанные.Коллекция.Добавить(ТекущиеДанные.Значение);
			КонецЕсли;
			ТекущиеДанные.Поле = "";
			ТекущиеДанные.Значение = "";
		КонецЕсли;
		
		Если ПоднятьсяПоСтеку Тогда
			ТекущиеДанные = СтекЭлементов[СтекЭлементов.ВГраница()];
			СтекЭлементов.Удалить(СтекЭлементов.ВГраница());
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекущиеДанные.Значение;
	
КонецФункции

Функция ТекстовыйПарсер_ПолучитьСтруктуруШаблона(СтрокаШаблона) Экспорт
	
	ДлинаСтроки = СтрДлина(СтрокаШаблона);
	НомерСимвола = 1;
	КодирующийСимвол = "\";
	Звездочка = "*";
	НачалоПараметра = "[";
	КонецПараметра = "]";
	КонецШаблона = "";
	
	
	СтруктураШаблона = Новый Массив;
	ЭлементШаблонаПоУмолчанию = Новый Структура;
	ЭлементШаблонаПоУмолчанию.Вставить("Значение", "");
	ЭлементШаблонаПоУмолчанию.Вставить("Тип", 0);
	
	ЭлементШаблона = СкопироватьОбъект(ЭлементШаблонаПоУмолчанию);
	Состояние = 0;
	
	Пока НомерСимвола <= ДлинаСтроки+1 Цикл
		
		Символ = Сред(СтрокаШаблона, НомерСимвола, 1);
		
		Если Состояние = 0 Тогда
			
			Если Символ = НачалоПараметра Тогда
				Состояние = 1;
			ИначеЕсли Символ = Звездочка Тогда
				Состояние = 2;
			ИначеЕсли Символ = КодирующийСимвол Тогда
				Состояние = 3;
			ИначеЕсли Символ = КонецШаблона Тогда
				Состояние = 4;
			КонецЕсли;
			
			Если Состояние = 0 Тогда
				ЭлементШаблона.Значение = ЭлементШаблона.Значение + Символ;
			Иначе
				Если Состояние <> 3 И ЭлементШаблона.Значение <> "" Тогда
					ЭлементШаблона.Тип = 0;
					СтруктураШаблона.Добавить(ЭлементШаблона);
					ЭлементШаблона = СкопироватьОбъект(ЭлементШаблонаПоУмолчанию);
				КонецЕсли;
				
				Если Состояние = 2 Тогда
					ЭлементШаблона.Тип = 2;
					СтруктураШаблона.Добавить(ЭлементШаблона);
					ЭлементШаблона = СкопироватьОбъект(ЭлементШаблонаПоУмолчанию);
					Состояние = 0;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Состояние = 1 Тогда
			
			//параметр
			Если Символ = КонецПараметра Тогда
				ЭлементШаблона.Тип = 1;
				СтруктураШаблона.Добавить(ЭлементШаблона);
				ЭлементШаблона = СкопироватьОбъект(ЭлементШаблонаПоУмолчанию);
				Состояние = 0;
			Иначе
				ЭлементШаблона.Значение = ЭлементШаблона.Значение + Символ;
			КонецЕсли;
			
		ИначеЕсли Состояние = 3 Тогда
			
			// закодированный символ
			ЭлементШаблона.Значение = ЭлементШаблона.Значение + Символ;
			
			Состояние = 0;
			
		КонецЕсли;
		
		НомерСимвола = НомерСимвола + 1;
		
	КонецЦикла;
	
	Возврат СтруктураШаблона;
	
КонецФункции

Функция ТекстовыйПарсер_ПолучитьПараметрыИзСтроки(Шаблон, знач Строка) Экспорт

	Если ТипЗнч(Шаблон) = Тип("Строка") Тогда
		СтруктураШаблона = ТекстовыйПарсер_ПолучитьСтруктуруШаблона(Шаблон);
	Иначе
		СтруктураШаблона = Шаблон;
	КонецЕсли;
	
	Параметры = Новый Структура;
	
	ЭлементШаблона = Неопределено;
	ЗначениеЭлемента = "";
	ТипЭлемента = 0;
	ЭтоПараметр = Ложь;
	НомерЭлемента = 0;
	КоличествоЭлементовШаблона = СтруктураШаблона.Количество();
	
	Пока НомерЭлемента < КоличествоЭлементовШаблона Цикл
		
		ЭлементШаблона0 = ЭлементШаблона;
		ТипЭлемента0 = ТипЭлемента;
		ЭтоПараметр0 = ЭтоПараметр;
		ЗначениеЭлемента0 = ЗначениеЭлемента;
		ЭлементШаблона = СтруктураШаблона[НомерЭлемента];
		ТипЭлемента = ЭлементШаблона.Тип;
		ЭтоПараметр = ТипЭлемента <> 0;
		ЗначениеЭлемента = ЭлементШаблона.Значение;
		
		Если ЭтоПараметр Тогда

			Если ЭтоПараметр0 Тогда
				Возврат Неопределено;
			КонецЕсли;
			
			Если ТипЭлемента = 1 И НомерЭлемента = КоличествоЭлементовШаблона-1 Тогда
				ИмяПараметра = ЗначениеЭлемента;
				ЗначениеПараметра = Строка;
				Параметры.Вставить(ИмяПараметра, ЗначениеПараметра);
			КонецЕсли;
				
		Иначе
			
			ДлинаЭлемента = СтрДлина(ЗначениеЭлемента);
			
			Если ЭтоПараметр0 Тогда
				
				Позиция = СтрНайти(Строка, ЗначениеЭлемента);
				Если Позиция = 0 Тогда
					Возврат Неопределено;
				КонецЕсли;
				
				Если ТипЭлемента0 = 1 Тогда
					ИмяПараметра = ЗначениеЭлемента0;
					ЗначениеПараметра = Лев(Строка, Позиция-1);
					Параметры.Вставить(ИмяПараметра, ЗначениеПараметра);
				КонецЕсли;
				
			Иначе
				
				Позиция = 1;
				Если Не Лев(Строка, ДлинаЭлемента) = ЗначениеЭлемента Тогда
					Возврат Неопределено;
				КонецЕсли;
				
			КонецЕсли;

			Строка = Сред(Строка, Позиция+ДлинаЭлемента);
			
		КонецЕсли;
		
		НомерЭлемента = НомерЭлемента + 1;
		
	КонецЦикла;
	
	Возврат Параметры;
	
КонецФункции

Функция ТекстовыйПарсер_ПодставитьПараметрыВСтроку(Строка, Параметры) Экспорт
	
	СтрокаСПараметрами = Строка;
	
	Для Каждого Параметр Из Параметры Цикл
		СтрокаСПараметрами = СтрЗаменить(СтрокаСПараметрами, "[" + Параметр.Ключ + "]", Параметр.Значение);
	КонецЦикла;
	
	Возврат СтрокаСПараметрами;
	
КонецФункции

//
//				Текстовый парсер-
//
///////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////
//
//				Индексирование коллекций+
//

Функция НовыйЭлементИндексаСИ()
	ЭлементИндекса = Новый Структура;
	ЭлементИндекса.Вставить("Номер", 0);
	ЭлементИндекса.Вставить("Уровень", 0);
	ЭлементИндекса.Вставить("СодержитДанные", Ложь);
	ЭлементИндекса.Вставить("НомерРодителя");
	ЭлементИндекса.Вставить("Ключ");
	ЭлементИндекса.Вставить("Индексы", Новый Соответствие);
	ЭлементИндекса.Вставить("ИндексДляНеопределено");
	ЭлементИндекса.Вставить("МассивИндексов", Новый Массив);
	Возврат ЭлементИндекса;
КонецФункции

Функция ДобавитьЭлементИндексаСИ(СИ, Родитель=Неопределено, Ключ=Неопределено) Экспорт
	ЭлементИндекса = НовыйЭлементИндексаСИ();
	ЭлементИндекса.Номер = СИ.ТекущийНомерЭлементаИндекса;
	ЭлементИндекса.Ключ = Ключ;
	Если Родитель <> Неопределено Тогда
		ЭлементИндекса.Уровень = Родитель.Уровень + 1;
		ЭлементИндекса.НомерРодителя = Родитель.Номер;
		Если Ключ = Неопределено Тогда
			Родитель.ИндексДляНеопределено = ЭлементИндекса;
		Иначе
			Родитель.Индексы[Ключ] = ЭлементИндекса;
		КонецЕсли;
		Родитель.МассивИндексов.Добавить(ЭлементИндекса);
		ЭлементИндекса.СодержитДанные = СИ.Глубина = ЭлементИндекса.Уровень;
	КонецЕсли;
	СИ.ИндексыНомеров[ЭлементИндекса.Номер] = ЭлементИндекса;
	СИ.ТекущийНомерЭлементаИндекса = СИ.ТекущийНомерЭлементаИндекса + 1;
	Возврат ЭлементИндекса;
КонецФункции

Функция НоваяСистемаИндексированияКоллекций(КоллекцияСтрок=Неопределено, знач ПоляИндексирования=Неопределено) Экспорт
	
	СИ = Новый Структура;
	СИ.Вставить("ПоляИндексирования", "");
	СИ.Вставить("ПоляИндексированияМассив", Новый Массив);
	СИ.Вставить("Глубина", 0);
	СИ.Вставить("ТекущийНомерЭлементаИндекса", 0);
	СИ.Вставить("ИндексыСтрок", Новый Соответствие);
	СИ.Вставить("ИндексыНомеров", Новый Соответствие);
	СИ.Вставить("СтруктураИндексов", ДобавитьЭлементИндексаСИ(СИ));
	
	Если ПоляИндексирования <> Неопределено Тогда
		ПоляИндексированияМассив = ЗначениеВМассив(ПоляИндексирования);
		ПоляИндексирования = МассивВСтроку(ПоляИндексированияМассив);
		
		СИ.ПоляИндексирования = ПоляИндексирования;
		СИ.ПоляИндексированияМассив = ПоляИндексированияМассив;
		СИ.Глубина = ПоляИндексированияМассив.Количество();
	КонецЕсли;
	
	Если КоллекцияСтрок <> Неопределено Тогда
		ИндексироватьЭлементыКоллекции(СИ, КоллекцияСтрок);
	КонецЕсли; 
	
	Возврат СИ;
	
КонецФункции

Функция ОчиститьЭлементИндекса(СИ, ЭлементИндекса=Неопределено) Экспорт
	
	Если ЭлементИндекса = Неопределено Тогда
		// очистить всю систему
		ОчиститьСистемуИндексирования(СИ);
		Возврат Истина;
	КонецЕсли;
	
	ИндексыНомеров = СИ.ИндексыНомеров;
	ИндексыСтрок = СИ.ИндексыСтрок;
	
	МассивИндексов = Новый Массив;
	МассивИндексов.Добавить(ЭлементИндекса);
	
	Для Каждого ТекущийЭлементИндекса Из МассивИндексов Цикл
		Если ТекущийЭлементИндекса.СодержитДанные Тогда
			МассивДанных = ТекущийЭлементИндекса.МассивИндексов;
			Для Каждого СтрокаДанных Из МассивДанных Цикл
				ИндексыСтрок.Удалить(СтрокаДанных);
			КонецЦикла; 
		Иначе
			ДобавитьЭлементыКоллекции(МассивИндексов, ТекущийЭлементИндекса.МассивИндексов);
		КонецЕсли;
		
		ТекущийЭлементИндекса.Индексы.Очистить();
		ТекущийЭлементИндекса.МассивИндексов.Очистить();
		ИндексыНомеров.Удалить(ТекущийЭлементИндекса.Номер);
	КонецЦикла;
	
	// восстановим номер элемента
	ИндексыНомеров[ЭлементИндекса.Номер] = ЭлементИндекса;
	
	Возврат Истина;
	
КонецФункции

Функция ОчиститьИндексыКоллекции(СИ, СтрокиКоллекции) Экспорт
	
	МассивСтрокКоллекции = ЗначениеВМассив(СтрокиКоллекции, , Ложь);
	ИндексыНомеров = СИ.ИндексыНомеров;
	ИндексыСтрок = СИ.ИндексыСтрок;
	
	Для Каждого Строка Из МассивСтрокКоллекции Цикл
		ЭлементИндексаСтроки = ИндексыСтрок[Строка];
		Если ЭлементИндексаСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексыСтрок.Удалить(Строка);
		ЭлементИндексаСтроки.МассивИндексов.Удалить(ЭлементИндексаСтроки.МассивИндексов.Найти(Строка));
		ЭлементИндексаСтроки.Индексы.Удалить(Строка);
		
		ЭлементИндекса = ЭлементИндексаСтроки;
		Пока Истина Цикл
			Если ЭлементИндекса.Индексы.Количество() > 0 Тогда
				Прервать;
			КонецЕсли;
			
			ЭлементРодителяИндекса = ИндексыНомеров[ЭлементИндекса.НомерРодителя];
			Если ЭлементРодителяИндекса = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			ЭлементРодителяИндекса.МассивИндексов.Удалить(ЭлементРодителяИндекса.МассивИндексов.Найти(ЭлементИндекса));
			Если ЭлементИндекса.Ключ = Неопределено Тогда
				ЭлементРодителяИндекса.ИндексДляНеопределено = Неопределено;
			Иначе
				ЭлементРодителяИндекса.Индексы.Удалить(ЭлементИндекса.Ключ);
			КонецЕсли;
			ИндексыНомеров.Удалить(ЭлементИндекса.Номер);
			
			ЭлементИндекса = ЭлементРодителяИндекса;
		КонецЦикла; 
	КонецЦикла; 
	
КонецФункции

Функция ОчиститьСистемуИндексирования(СИ) Экспорт
	СИ.ИндексыСтрок.Очистить();
	СИ.ИндексыНомеров.Очистить();
	СИ.ИндексыНомеров[СИ.СтруктураИндексов.Номер] = СИ.СтруктураИндексов;
	СИ.СтруктураИндексов.МассивИндексов.Очистить();
	СИ.СтруктураИндексов.Индексы.Очистить();
	СИ.СтруктураИндексов.ИндексДляНеопределено = Неопределено;
	СИ.ТекущийНомерЭлементаИндекса = СИ.СтруктураИндексов.Номер + 1;
КонецФункции

Функция ИндексироватьЭлементыКоллекции(СИ, СтрокиКоллекции) Экспорт
	
	МассивСтрокКоллекции = ЗначениеВМассив(СтрокиКоллекции, , Ложь);
	ПоляИндексированияМассив = СИ.ПоляИндексированияМассив;
	СтруктураИндексов = СИ.СтруктураИндексов;
	ИндексыСтрок = СИ.ИндексыСтрок;
	
	ОчиститьИндексыКоллекции(СИ, МассивСтрокКоллекции);
	
	МаксИндексСтроки = МассивСтрокКоллекции.ВГраница();
	МаксИндексПоля = ПоляИндексированияМассив.ВГраница();
	Для ИндексСтроки=0 По МаксИндексСтроки Цикл
		Строка = МассивСтрокКоллекции[ИндексСтроки];
		Дерево = СтруктураИндексов;
		Для ИндексПоля=0 По МаксИндексПоля Цикл
			ЗначениеПоля = Строка[ПоляИндексированияМассив[ИндексПоля]];
			ПодДерево = Дерево.Индексы[ЗначениеПоля];
			Если ПодДерево = Неопределено Тогда
				Если ЗначениеПоля = Неопределено И Дерево.ИндексДляНеопределено <> Неопределено Тогда
					ПодДерево = Дерево.ИндексДляНеопределено;
				Иначе
					ПодДерево = ДобавитьЭлементИндексаСИ(СИ, Дерево, ЗначениеПоля);
				КонецЕсли; 
			КонецЕсли;
			Дерево = ПодДерево;
		КонецЦикла;
		Дерево.МассивИндексов.Добавить(Строка);
		Дерево.Индексы[Строка] = Строка;
		ИндексыСтрок[Строка] = Дерево;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьЭлементИндекса(ЭлементИндексаРодитель, ЗначениеПоля) Экспорт
	
	Если ЗначениеПоля = Неопределено Тогда
		ПодДерево = ЭлементИндексаРодитель.ИндексДляНеопределено;
	Иначе
		ПодДерево = ЭлементИндексаРодитель.Индексы[ЗначениеПоля];
	КонецЕсли;
	
	Возврат ПодДерево;
	
КонецФункции

Функция НайтиЭлементыИндекса(СИ, СтруктураОтбора, НачальныйИндекс=Неопределено) Экспорт
	
	Если НачальныйИндекс = Неопределено Тогда
		Дерево = СИ.СтруктураИндексов;
	Иначе
		Дерево = НачальныйИндекс;
	КонецЕсли; 
	
	ИндексПоля = Дерево.Уровень;
	
	ПоляИндексированияМассив = СИ.ПоляИндексированияМассив;
	
	НайденныеИндексы = Новый Массив;
	НайденныеИндексы.Добавить(Дерево);
	
	Пока ИндексПоля < ПоляИндексированияМассив.Количество() Цикл
		
		ПолеИндексирования = ПоляИндексированияМассив[ИндексПоля];
		НайденныеИндексы2 = Новый Массив;
		
		Если СтруктураОтбора.Свойство(ПолеИндексирования) Тогда
			ЗначениеПоля = СтруктураОтбора[ПолеИндексирования];
			Если ЗначениеПоля = Неопределено Тогда
				Для Каждого НайденныйИндекс Из НайденныеИндексы Цикл
					Если НайденныйИндекс.ИндексДляНеопределено <> Неопределено Тогда
						НайденныеИндексы2.Добавить(НайденныйИндекс.ИндексДляНеопределено);
					КонецЕсли; 
				КонецЦикла;
			Иначе
				Для Каждого НайденныйИндекс Из НайденныеИндексы Цикл
					ПодДерево = НайденныйИндекс.Индексы[ЗначениеПоля];
					Если ПодДерево <> Неопределено Тогда
						НайденныеИндексы2.Добавить(ПодДерево);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Для Каждого НайденныйИндекс Из НайденныеИндексы Цикл
				ДобавитьЭлементыКоллекции(НайденныеИндексы2, НайденныйИндекс.МассивИндексов);
			КонецЦикла;
		КонецЕсли;
			
		НайденныеИндексы = НайденныеИндексы2;
		Если НайденныеИндексы.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ИндексПоля = ИндексПоля + 1;
		
	КонецЦикла;
	
	Возврат НайденныеИндексы;
	
КонецФункции

Функция НайтиЭлементИндекса(СИ, СтруктураОтбора, НачальныйИндекс=Неопределено) Экспорт
	
	НайденныеИндексы = НайтиЭлементыИндекса(СИ, СтруктураОтбора, НачальныйИндекс);
	Если НайденныеИндексы.Количество() > 0 Тогда
		Возврат НайденныеИндексы[0];
	КонецЕсли;
	
КонецФункции

Функция НайтиКлючиЭлементаИндекса(СИ, СтруктураОтбора) Экспорт
	
	МассивКлючей = Новый Массив;
	
	Дерево = НайтиЭлементИндекса(СИ, СтруктураОтбора);
	Если Дерево <> Неопределено Тогда
		Для Каждого ЭлементИндекса Из Дерево.Индексы Цикл
			МассивКлючей.Добавить(ЭлементИндекса.Значение.Ключ);
		КонецЦикла;
		
		Если Дерево.ИндексДляНеопределено <> Неопределено Тогда
			МассивКлючей.Добавить(Дерево.ИндексДляНеопределено.Ключ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МассивКлючей;
	
КонецФункции

Функция НайтиСтрокиКоллекцииВИндексе(СИ, СтруктураОтбора, СтруктураОтбораБезИндекса=Неопределено) Экспорт
	
	СтруктураИндексов = СИ.СтруктураИндексов;
	ПоляИндексированияМассив = СИ.ПоляИндексированияМассив;
	
	МассивДеревьев = Новый Массив;
	МассивДеревьев.Добавить(СтруктураИндексов);
	
	СтруктураОтбораБезИндекса = СкопироватьСтруктуру(СтруктураОтбора);
	Для Каждого ПолеИндексирования Из ПоляИндексированияМассив Цикл
		НайденныеДеревья = Новый Массив;
		Если СтруктураОтбора.Свойство(ПолеИндексирования) Тогда
			СтруктураОтбораБезИндекса.Удалить(ПолеИндексирования);
			ЗначениеПоля = СтруктураОтбора[ПолеИндексирования];
			Для Каждого Дерево Из МассивДеревьев Цикл
				Если ЗначениеПоля = Неопределено Тогда
					ПодДерево = Дерево.ИндексДляНеопределено;
				Иначе
					ПодДерево = Дерево.Индексы[ЗначениеПоля];
				КонецЕсли;
				
				Если ПодДерево <> Неопределено Тогда
					НайденныеДеревья.Добавить(ПодДерево);
				КонецЕсли; 
			КонецЦикла;
		Иначе
			Для Каждого Дерево Из МассивДеревьев Цикл
				Для Каждого ЭлементПодДерева Из Дерево.Индексы Цикл;
					ПодДерево = ЭлементПодДерева.Значение;
					НайденныеДеревья.Добавить(ПодДерево);
				КонецЦикла;
				
				Если Дерево.ИндексДляНеопределено <> Неопределено Тогда
					НайденныеДеревья.Добавить(Дерево.ИндексДляНеопределено);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
		МассивДеревьев = НайденныеДеревья;
	КонецЦикла;
	
	НайденныеСтроки = Новый Массив;
	Для Каждого Дерево Из МассивДеревьев Цикл
		Для Каждого ЭлементСтроки Из Дерево.Индексы Цикл
			Строка = ЭлементСтроки.Значение;
			НайденныеСтроки.Добавить(Строка);
		КонецЦикла;
	КонецЦикла;
	
	Возврат НайденныеСтроки;
	
КонецФункции

Функция ПроверитьСсылочнуюЦелостностьСистемыИндексирования(СИ) Экспорт
	
	Если СИ.ИндексыНомеров[СИ.СтруктураИндексов.Номер] <> СИ.СтруктураИндексов Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////////////////////////////////
Функция НовыйМенеджерИндексирования()
	МенеджерИндексирования = Новый Структура;
	МенеджерИндексирования.Вставить("СистемыИндексирования", Новый Соответствие);
	Возврат МенеджерИндексирования;
КонецФункции

Функция МенеджерИндексирования_ДобавитьИндексКоллекции(Менеджер, Коллекция, ПоляИндексирования) Экспорт

	СИ = Менеджер.СистемыИндексирования[ПоляИндексирования];

	Если СИ=Неопределено Тогда
		СИ = НоваяСистемаИндексированияКоллекций(Коллекция, ПоляИндексирования);
		Менеджер.СистемыИндексирования[СИ.ПоляИндексирования] = СИ;
	КонецЕсли;
	
	Возврат СИ;
	
КонецФункции

Функция МенеджерИндексирования_ПодобратьИндекс(Менеджер, знач ПоляИндексирования) Экспорт
	
	Если Менеджер.СистемыИндексирования.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Если ТипЗнч(ПоляИндексирования)=Тип("Структура") Тогда
		СтруктураОтбора = ПоляИндексирования;
		ПоляИндексирования = "";
		РазделительСтроки = ", ";
		Для Каждого ПолеСтруктуры Из СтруктураОтбора Цикл
			ПоляИндексирования = ПоляИндексирования + ПолеСтруктуры.Ключ + РазделительСтроки;
		КонецЦикла;
		
		Если ПоляИндексирования="" Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ПоляИндексирования = Лев(ПоляИндексирования, СтрДлина(ПоляИндексирования)-СтрДлина(РазделительСтроки));
		СИ = Менеджер.СистемыИндексирования[ПоляИндексирования];
		Если СИ <> Неопределено Тогда
			Возврат СИ;
		КонецЕсли;

		ПоляИндексированияМассив = ВыгрузитьЗначенияКолонкиКоллекции(СтруктураОтбора, "Ключ");
	Иначе
		ПоляИндексированияМассив = ЗначениеВМассив(ПоляИндексирования);
		Если ПоляИндексированияМассив.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ПоляИндексирования = МассивВСтроку(ПоляИндексированияМассив);
		СИ = Менеджер.СистемыИндексирования[ПоляИндексирования];
		Если СИ <> Неопределено Тогда
			Возврат СИ;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ЭлементСИ Из Менеджер.СистемыИндексирования Цикл
		СИ = ЭлементСИ.Значение;
		Если СИ.ПоляИндексированияМассив[0] = ПоляИндексированияМассив[0] Тогда
			Возврат СИ;
		КонецЕсли; 
	КонецЦикла; 
	
	Для Каждого ЭлементСИ Из Менеджер.СистемыИндексирования Цикл
		СИ = ЭлементСИ.Значение;
		Если СИ.ПоляИндексированияМассив.Найти(ПоляИндексированияМассив[0]) <> Неопределено Тогда
			Возврат СИ;
		КонецЕсли; 
	КонецЦикла;
	
КонецФункции

Функция МенеджерИндексирования_ИндексироватьКоллекцию(Менеджер, Коллекция)
	Для Каждого ЭлементСИ Из Менеджер.СистемыИндексирования Цикл
		СИ = ЭлементСИ.Значение;
		ИндексироватьЭлементыКоллекции(СИ, Коллекция);
	КонецЦикла;
КонецФункции

Функция МенеджерИндексирования_ОчиститьИндексы(Менеджер)
	Для Каждого ЭлементСИ Из Менеджер.СистемыИндексирования Цикл
		СИ = ЭлементСИ.Значение;
		ОчиститьСистемуИндексирования(СИ);
	КонецЦикла;
КонецФункции

Функция МенеджерИндексирования_ОчиститьИндексыСтрок(Менеджер, Строки)
	Для Каждого ЭлементСИ Из Менеджер.СистемыИндексирования Цикл
		СИ = ЭлементСИ.Значение;
		ОчиститьИндексыКоллекции(СИ, Строки);
	КонецЦикла;
КонецФункции

Функция МенеджерИндексирования_ПроверитьСсылочнуюЦелостность(Менеджер)
	
	Для Каждого ЭлементСИ Из Менеджер.СистемыИндексирования Цикл
		СИ = ЭлементСИ.Значение;
		Если Не ПроверитьСсылочнуюЦелостностьСистемыИндексирования(СИ) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

//
//				Индексирование коллекций-
//
///////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////
//
//				Квази таблица значений+
//

Функция ВерсияКвазиТаблицы()
	Возврат 5;
КонецФункции

Функция НоваяКвазиТаблицаЗначений(Источник=Неопределено) Экспорт
	
	МенеджерИндексирования = НовыйМенеджерИндексирования();
	
	НумерацияСтрок = Новый Структура;
	НумерацияСтрок.Вставить("ТекущийНомер", 1);
	НумерацияСтрок.Вставить("НомераИСтроки", Новый Соответствие);
	
	КакБыТаблица = Новый Структура;
	КакБыТаблица.Вставить("Колонки", Новый Структура);
	КакБыТаблица.Вставить("Строки", Новый Массив);
	КакБыТаблица.Вставить("НумерацияСтрок", НумерацияСтрок);
	КакБыТаблица.Вставить("МенеджерИндексирования", МенеджерИндексирования);
	КакБыТаблица.Вставить("Удостоверение", "Йа квази таблицо");
	КакБыТаблица.Вставить("Версия", ВерсияКвазиТаблицы());
	КакБыТаблица.Вставить("ДопускатьНарушениеСсылочнойЦелостности", Ложь);
	
	СписокКолонок = Неопределено;
	Строки = Неопределено;
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Если ТипЗнч(Источник) = Тип("ТаблицаЗначений") Тогда
			СписокКолонок = ВыгрузитьЗначенияКолонкиКоллекции(Источник.Колонки, "Имя");
			Строки = Источник;
		КонецЕсли;
	#КонецЕсли
	
	Если СписокКолонок = Неопределено Тогда
		СписокКолонок = Источник;
	КонецЕсли;
	
	Если СписокКолонок <> Неопределено Тогда
		ДобавитьКолонкиКвазиТаблицыЗначений(КакБыТаблица, СписокКолонок);
	КонецЕсли;
	
	Если Строки <> Неопределено Тогда
		ДобавитьСтрокиКвазиТаблицыЗначений(КакБыТаблица, Строки);
	КонецЕсли;
	
	Возврат КакБыТаблица;
	
КонецФункции

Функция ЭтоКвазиТаблицаЗначений(Таблица) Экспорт
	
	Если ТипЗнч(Таблица) = Тип("Структура") И
			Таблица.Свойство("Удостоверение") И Таблица.Удостоверение = "Йа квази таблицо" И
				Таблица.Свойство("Версия") И Таблица.Версия = ВерсияКвазиТаблицы() Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции

Функция ДобавитьИндексыКвазиТаблицыЗначений(Таблица, Индексы) Экспорт
	МенеджерИндексирования_ДобавитьИндексКоллекции(Таблица.МенеджерИндексирования, Таблица.Строки, Индексы);
КонецФункции

Функция ИндексироватьСтрокиКвазиТаблицы(Таблица, Строки) Экспорт
	
	МенеджерИндексирования_ИндексироватьКоллекцию(Таблица.МенеджерИндексирования, Строки);
	
	Возврат Истина;
	
КонецФункции

Функция ИндексироватьКвазиТаблицу(Таблица) Экспорт
	
	МенеджерИндексирования_ОчиститьИндексы(Таблица.МенеджерИндексирования);
	МенеджерИндексирования_ИндексироватьКоллекцию(Таблица.МенеджерИндексирования, Таблица.Строки)
	
КонецФункции

Функция НайтиСтрокиКвазиТаблицыЗначенийПоИндексу(Таблица, Отбор, ОтборБезИндекса, Упорядочить) Экспорт
	
	СистемаИндексирования = МенеджерИндексирования_ПодобратьИндекс(Таблица.МенеджерИндексирования, Отбор);
	Если СистемаИндексирования = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Если СистемаИндексирования.ПоляИндексированияМассив.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не Таблица.ДопускатьНарушениеСсылочнойЦелостности Тогда
		Если Таблица.Строки.Количество() > 0 Тогда
			ПерваяСтрока = Таблица.Строки[0];
			Если СистемаИндексирования.ИндексыСтрок[ПерваяСтрока] = Неопределено Тогда
				// Нарушена ссылочная целостность индекса
				// искать перебором строк
				Возврат Неопределено;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 

	НайденныеСтроки = НайтиСтрокиКоллекцииВИндексе(СистемаИндексирования, Отбор, ОтборБезИндекса);
	
	Если НайденныеСтроки.Количество() > 1 Тогда
		Если Не Упорядочить Тогда
			Возврат НайденныеСтроки;
		КонецЕсли; 
		
		// восстановить порядок строк так, как порядок в индексе не поддерживается
		НомераИСтроки = Таблица.НумерацияСтрок.НомераИСтроки;
		НомерСтроки = НомераИСтроки[НайденныеСтроки[0]];
		Если НомерСтроки = Неопределено Тогда
			// Нарушена ссылочная целостность таблицы, упорядочить не получится
			// при работе с найденными строками надо учитывать, что это не ссылки на строки, а копии строк
			// для чтения информации это может быть приемлемо, но для изменения недопустимо
			Возврат НайденныеСтроки;
		КонецЕсли;
		
		НомераСтрок = Новый Массив;
		НомераСтрок.Добавить(НомерСтроки);
		Для Индекс=1 По НайденныеСтроки.ВГраница() Цикл
			НомераСтрок.Добавить(НомераИСтроки[НайденныеСтроки[Индекс]]);
		КонецЦикла;
		СортироватьМассив(НомераСтрок);
		
		НайденныеСтроки.Очистить();
		Для Каждого НомерСтроки Из НомераСтрок Цикл
			НайденныеСтроки.Добавить(НомераИСтроки[НомерСтроки]);
		КонецЦикла;
	КонецЕсли;
	
	Возврат НайденныеСтроки;

КонецФункции

Функция БинарнаяСортировка(знач Элементы, Поле=Неопределено) Экспорт
	
	КоличествоЭлементов = Элементы.Количество();
	
	Шаг = 1;
	
	Пока Шаг < КоличествоЭлементов Цикл
		
		ОтсортированныеЭлементы = Новый Массив;

		ЛевыйИндекс = 0;

		ПравыйИндекс = Шаг;
		
		Пока ЛевыйИндекс < КоличествоЭлементов Цикл
			
			КонецЛевогоИнтервала = ЛевыйИндекс + Шаг-1;
			Если КонецЛевогоИнтервала > КоличествоЭлементов-1 Тогда
				КонецЛевогоИнтервала = КоличествоЭлементов-1;
			КонецЕсли;
			
			КонецПравогоИнтервала = ПравыйИндекс + Шаг-1;
			Если КонецПравогоИнтервала > КоличествоЭлементов-1 Тогда
				КонецПравогоИнтервала = КоличествоЭлементов-1;
			КонецЕсли;
			
			Если Поле=Неопределено Тогда
				Если ЛевыйИндекс <= КонецЛевогоИнтервала И ПравыйИндекс <= КонецПравогоИнтервала Тогда
					ЛевыйЭлемент = Элементы[ЛевыйИндекс];
					ПравыйЭлемент = Элементы[ПравыйИндекс];
					Пока Истина Цикл
						Если ПравыйЭлемент < ЛевыйЭлемент Тогда
							ОтсортированныеЭлементы.Добавить(ПравыйЭлемент);
							ПравыйИндекс = ПравыйИндекс + 1;
							Если ПравыйИндекс > КонецПравогоИнтервала Тогда
								Прервать;
							КонецЕсли;
							ПравыйЭлемент = Элементы[ПравыйИндекс];
						Иначе
							ОтсортированныеЭлементы.Добавить(ЛевыйЭлемент);
							ЛевыйИндекс = ЛевыйИндекс + 1;
							Если ЛевыйИндекс > КонецЛевогоИнтервала Тогда
								Прервать;
							КонецЕсли;
							ЛевыйЭлемент = Элементы[ЛевыйИндекс];
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			Иначе
				Пока ЛевыйИндекс <= КонецЛевогоИнтервала И ПравыйИндекс <= КонецПравогоИнтервала Цикл
					ЛевыйЭлемент = Элементы[ЛевыйИндекс];
					ПравыйЭлемент = Элементы[ПравыйИндекс];
					
					Если ПравыйЭлемент[Поле] < ЛевыйЭлемент[Поле] Тогда
						ОтсортированныеЭлементы.Добавить(ПравыйЭлемент);
						ПравыйИндекс = ПравыйИндекс + 1;
					Иначе
						ОтсортированныеЭлементы.Добавить(ЛевыйЭлемент);
						ЛевыйИндекс = ЛевыйИндекс + 1;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Пока ЛевыйИндекс <= КонецЛевогоИнтервала Цикл
				ОтсортированныеЭлементы.Добавить(Элементы[ЛевыйИндекс]);
				ЛевыйИндекс = ЛевыйИндекс + 1;
			КонецЦикла;
			ЛевыйИндекс = ЛевыйИндекс + Шаг;
				
			Пока ПравыйИндекс <= КонецПравогоИнтервала Цикл
				ОтсортированныеЭлементы.Добавить(Элементы[ПравыйИндекс]);
				ПравыйИндекс = ПравыйИндекс + 1;
			КонецЦикла;
			ПравыйИндекс = ПравыйИндекс + Шаг;
			
		КонецЦикла;
		
		Шаг = Шаг * 2;
		
		Элементы = ОтсортированныеЭлементы;
		
	КонецЦикла;
	
	Возврат Элементы;
	
КонецФункции

Функция НоваяКолонкаКвазиТаблицыЗначений() Экспорт
	КакБыКолонкаКакБыТаблицы = Новый Структура;
	КакБыКолонкаКакБыТаблицы.Вставить("Имя", "");
	КакБыКолонкаКакБыТаблицы.Вставить("ТипЗначения");
	Возврат КакБыКолонкаКакБыТаблицы;
КонецФункции

Функция НоваяСтрокаКвазиТаблицыЗначений(Колонки) Экспорт
	НоваяСтрока = Новый Структура;
	Для Каждого ЭлмКолонка Из Колонки Цикл
		Колонка = ЭлмКолонка.Значение;
		Значение = ?(Колонка.ТипЗначения=Неопределено, Неопределено, Колонка.ТипЗначения.ПривестиЗначение());
		НоваяСтрока.Вставить(Колонка.Имя, Значение);
	КонецЦикла; 
	Возврат НоваяСтрока;
КонецФункции

Функция СкопироватьКвазиТаблицуЗначений(Таблица, Строки=Неопределено, Колонки=Неопределено) Экспорт
	
	НоваяТаблица = НоваяКвазиТаблицаЗначений();
	
	Если Строки <> Неопределено Тогда
		Если ТипЗнч(Строки) = Тип("Структура") Тогда
			// отбор строк
			МассивСтрок = НайтиСтрокиКвазиТаблицыЗначений(Таблица, Строки);
		Иначе
			МассивСтрок = Строки;
		КонецЕсли;
	Иначе
		МассивСтрок = Таблица.Строки;
	КонецЕсли;
	
	Если Колонки <> Неопределено Тогда
		МассивИменКолонок = СтрокуВМассив(Колонки);
		Для Каждого ЭлмКолонка Из Таблица.Колонки Цикл
			Колонка = ЭлмКолонка.Значение;
			Если МассивИменКолонок.Найти(Колонка.Имя) <> Неопределено Тогда
				ДобавитьКолонкуКвазиТаблицыЗначений(НоваяТаблица, Колонка.Имя, Колонка.ТипЗначения);
			КонецЕсли; 
		КонецЦикла; 
	Иначе
		Для Каждого ЭлмКолонка Из Таблица.Колонки Цикл
			Колонка = ЭлмКолонка.Значение;
			ДобавитьКолонкуКвазиТаблицыЗначений(НоваяТаблица, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла; 
	КонецЕсли;
	
	Для Каждого ЭлмСистемыИндексирования Из Таблица.МенеджерИндексирования.СистемыИндексирования Цикл
		ДобавитьИндексыКвазиТаблицыЗначений(НоваяТаблица, ЭлмСистемыИндексирования.Ключ);
	КонецЦикла; 
	
	ДобавитьСтрокиКвазиТаблицыЗначений(НоваяТаблица, МассивСтрок);
	
	Возврат НоваяТаблица;
	
КонецФункции

Функция ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, ИмяКолонки, ТипЗначенияКолонки=Неопределено) Экспорт
	НоваяКолонка = НоваяКолонкаКвазиТаблицыЗначений();
	НоваяКолонка.Имя = ИмяКолонки;
	НоваяКолонка.ТипЗначения = ТипЗначенияКолонки;
	Таблица.Колонки.Вставить(ИмяКолонки, НоваяКолонка);
	Для Каждого Строка Из Таблица.Строки Цикл
		Строка.Вставить(ИмяКолонки);
	КонецЦикла;
	Возврат НоваяКолонка;
КонецФункции

Функция ДобавитьКолонкиКвазиТаблицыЗначений(Таблица, СписокКолонок) Экспорт
	Если СписокКолонок <> Неопределено И ЗначениеЗаполнено(СписокКолонок) Тогда
		МассивКолонок = ЗначениеВМассив(СписокКолонок, , Ложь);
		Для Каждого ИмяКолонки Из МассивКолонок Цикл
			ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, ИмяКолонки);
		КонецЦикла; 
	КонецЕсли; 
КонецФункции

Функция ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, ЗначенияКолонок=Неопределено) Экспорт
	
	НоваяСтрока = НоваяСтрокаКвазиТаблицыЗначений(Таблица.Колонки);
	Таблица.Строки.Добавить(НоваяСтрока);

	Если ЗначенияКолонок <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗначенияКолонок);
		ИндексироватьСтрокиКвазиТаблицы(Таблица, НоваяСтрока);
	КонецЕсли;
	
	НумерацияСтрок = Таблица.НумерацияСтрок;
	НомерСтроки = НумерацияСтрок.ТекущийНомер;
	НумерацияСтрок.ТекущийНомер = НомерСтроки + 1;
	НумерацияСтрок.НомераИСтроки[НомерСтроки] = НоваяСтрока;
	НумерацияСтрок.НомераИСтроки[НоваяСтрока] = НомерСтроки;
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция СдвинутьСтрокуКвазиТаблицыЗначений(Таблица, знач Строка, знач НовыйНомер) Экспорт
	
	Если ТипЗнч(Строка)=Тип("Число") Тогда
		ТекущийНомер = Строка;
		Строка = Таблица.НумерацияСтрок.НомераИСтроки[ТекущийНомер];
		Если Строка=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
	Иначе
		ТекущийНомер = Таблица.НумерацияСтрок.НомераИСтроки[Строка];
		Если ТекущийНомер=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	Если НовыйНомер < 1 Тогда
		НовыйНомер = 1;
	КонецЕсли;
	
	Если НовыйНомер > Таблица.Строки.Количество()+1 Тогда
		НовыйНомер = Таблица.Строки.Количество()+1;
	КонецЕсли;
	
	Если ТекущийНомер=НовыйНомер Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Таблица.Строки.Вставить(НовыйНомер-1, Строка);
	
	Если НовыйНомер < ТекущийНомер Тогда
		// так исходная строка сдвинулась вперед после вставки
		ТекущийНомер = ТекущийНомер + 1;
	КонецЕсли; 
	Таблица.Строки.Удалить(ТекущийНомер-1);
	
	ПеренумероватьСтрокиКвазиТаблицыЗначений(Таблица);
	
	Возврат Истина;
	
КонецФункции

Функция УпорядочитьСтрокиКвазиТаблицыЗначенийПоМассиву(Таблица, МассивСтрок)
	
	НомераИСтроки = Таблица.НумерацияСтрок.НомераИСтроки;
	Строки = Таблица.Строки;
	НомерСтроки = 1;
	Для Каждого Строка Из МассивСтрок Цикл
		ТекущийНомер = НомераИСтроки[Строка];
		Если ТекущийНомер=Неопределено Тогда
			// не принадлежит коллекции
			Продолжить;
		КонецЕсли;
		
		Если НомерСтроки=ТекущийНомер Тогда
			// уже упорядочена
			НомерСтроки = НомерСтроки + 1;
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока = НомераИСтроки[НомерСтроки];
		НомераИСтроки[ТекущийНомер] = ТекущаяСтрока;
		НомераИСтроки[ТекущаяСтрока] = ТекущийНомер;
		Строки[ТекущийНомер-1] = ТекущаяСтрока;
		
		НомераИСтроки[НомерСтроки] = Строка;
		НомераИСтроки[Строка] = НомерСтроки;
		Строки[НомерСтроки-1] = Строка;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ДобавитьСтрокиКвазиТаблицыЗначений(Таблица, Коллекция) Экспорт
	
	НовыеСтроки = Новый Массив;
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		МассивСтрок = Коллекция.Строки;
	Иначе
		МассивСтрок = Коллекция;
	КонецЕсли; 
	
	Для Каждого Строка Из МассивСтрок Цикл
		НоваяСтрока = ДобавитьСтрокуКвазиТаблицыЗначений(Таблица);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НовыеСтроки.Добавить(НоваяСтрока);
	КонецЦикла; 
	
	ИндексироватьСтрокиКвазиТаблицы(Таблица, НовыеСтроки);
	
КонецФункции

Функция НайтиСтрокиКвазиТаблицыЗначений(Таблица, Отбор, Упорядочить=Истина) Экспорт
	
	ОтборБезИндекса = Неопределено;
	НайденныеСтроки = НайтиСтрокиКвазиТаблицыЗначенийПоИндексу(Таблица, Отбор, ОтборБезИндекса, Упорядочить);
	Если НайденныеСтроки = Неопределено Тогда
		НайденныеСтроки = Таблица.Строки;
		ОтборБезИндекса = Отбор;
	Иначе
		Если ОтборБезИндекса.Количество() = 0 Тогда
			Возврат НайденныеСтроки;
		КонецЕсли; 
	КонецЕсли; 
	
	НайденныеСтроки = НайтиЭлементыКоллекции(НайденныеСтроки, ОтборБезИндекса);
	Возврат НайденныеСтроки;
	
КонецФункции

Функция НайтиСтрокуКвазиТаблицыЗначений(Таблица, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	НайденныеСтроки = НайтиСтрокиКвазиТаблицыЗначений(Таблица, Новый Структура(ИмяРеквизита, ЗначениеРеквизита));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0];
	КонецЕсли;
КонецФункции

Функция ОчиститьИндексыСтрокКвазиТаблицы(Таблица, Строки)
	
	МенеджерИндексирования_ОчиститьИндексыСтрок(Таблица.МенеджерИндексирования, Строки);
	
КонецФункции

Функция УдалитьНумерациюСтрокКвазиТаблицыЗначений(Таблица, Строки)
	НомераИСтроки = Таблица.НумерацияСтрок.НомераИСтроки;
	Для каждого Строка Из Строки Цикл
		НомерСтроки = НомераИСтроки[Строка];
		НомераИСтроки.Удалить(Строка);
		НомераИСтроки.Удалить(НомерСтроки);
	КонецЦикла;
КонецФункции

Функция УдалитьСтрокиКвазиТаблицыЗначений(Таблица, знач Строки=Неопределено) Экспорт
	Если Строки = Неопределено Тогда
		Строки = Таблица.Строки;
	Иначе
		Строки = ЗначениеВМассив(Строки);
	КонецЕсли; 
	ОчиститьИндексыСтрокКвазиТаблицы(Таблица, Строки);
	Если Таблица.Строки=Строки Тогда
		Таблица.Строки.Очистить();
		Таблица.НумерацияСтрок.НомераИСтроки.Очистить();
		Таблица.НумерацияСтрок.ТекущийНомер = 1;
	Иначе
		УдалитьЭлементыКоллекции(Таблица.Строки, Строки);
		УдалитьНумерациюСтрокКвазиТаблицыЗначений(Таблица, Строки);
	КонецЕсли; 
КонецФункции

Функция НомерЭлементаКвазиТаблицыЗначений(Таблица, Элемент) Экспорт
	
	Возврат Таблица.НумерацияСтрок.НомераИСтроки[Элемент];
	
КонецФункции

Функция АгрегироватьЗначенияПолейГруппировкиСумма(СтрокаИтогов, СтрокиЗначений, МассивПолей)
	
	Для Каждого Поле Из МассивПолей Цикл
		Сумма = 0;
		Значение = СтрокаИтогов[Поле];
		Если ТипЗнч(Значение) = Тип("Число") Тогда
			Сумма = Сумма + СтрокаИтогов[Поле];
		КонецЕсли;
		Для Каждого СтрокаЗначения Из СтрокиЗначений Цикл
			Значение = СтрокаЗначения[Поле];
			Если ТипЗнч(Значение) = Тип("Число") Тогда
				Сумма = Сумма + СтрокаЗначения[Поле];
			КонецЕсли; 
		КонецЦикла; 
		СтрокаИтогов[Поле] = Сумма;
	КонецЦикла;
	
КонецФункции

Функция АгрегироватьЗначенияПолейГруппировкиСписокЗначений(СтрокаИтогов, СтрокиЗначений, МассивПолей)
	
	Для Каждого Поле Из МассивПолей Цикл
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.Добавить(СтрокаИтогов[Поле]);
		Для Каждого СтрокаЗначения Из СтрокиЗначений Цикл
			СписокЗначений.Добавить(СтрокаЗначения[Поле]);
		КонецЦикла; 
		СтрокаИтогов[Поле] = СписокЗначений;
	КонецЦикла;
	
КонецФункции

Функция АгрегироватьЗначенияПолейГруппировкиМассив(СтрокаИтогов, СтрокиЗначений, МассивПолей)
	
	Для Каждого Поле Из МассивПолей Цикл
		Массив = Новый Массив;
		Массив.Добавить(СтрокаИтогов[Поле]);
		Для Каждого СтрокаЗначения Из СтрокиЗначений Цикл
			Массив.Добавить(СтрокаЗначения[Поле]);
		КонецЦикла; 
		СтрокаИтогов[Поле] = Массив;
	КонецЦикла;
	
КонецФункции

Функция АгрегироватьЗначенияПолейГруппировкиСтрока(СтрокаИтогов, СтрокиЗначений, МассивПолей)
	
	Для Каждого Поле Из МассивПолей Цикл
		Массив = Новый Массив;
		Массив.Добавить(СтрокаИтогов[Поле]);
		Для Каждого СтрокаЗначения Из СтрокиЗначений Цикл
			Массив.Добавить(СтрокаЗначения[Поле]);
		КонецЦикла; 
		СтрокаИтогов[Поле] = МассивВСтроку(Массив);
	КонецЦикла;
	
КонецФункции

Функция СвернутьКоллекциюЗначений(знач Коллекция, знач ПоляГруппировки=Неопределено, знач ПоляСуммы=Неопределено, АгрегатнаяФункция=Неопределено) Экспорт
	
	Если ПоляСуммы = Неопределено Тогда
		МассивПолейСуммы = Новый Массив;
	Иначе
		МассивПолейСуммы = ЗначениеВМассив(ПоляСуммы);
	КонецЕсли; 
	
	ЭтоКвазиТаблицаЗначений = ЭтоКвазиТаблицаЗначений(Коллекция);

	Если ПоляГруппировки = Неопределено Тогда
		Если ЭтоКвазиТаблицаЗначений Тогда
			МассивКолонок = ВыгрузитьЗначенияКолонкиКоллекции(Коллекция.Колонки, "Значение");
			МассивПолейГруппировки = ВыгрузитьЗначенияКолонкиКоллекции(МассивКолонок, "Имя");
		ИначеЕсли ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда 
			МассивПолейГруппировки = ВыгрузитьЗначенияКолонкиКоллекции(Коллекция.Колонки, "Имя");
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		МассивПолейГруппировки = ЗначениеВМассив(ПоляГруппировки);
	КонецЕсли;
	
	Если ЭтоКвазиТаблицаЗначений Тогда
		Строки = Коллекция.Строки;
	Иначе
		Строки = Коллекция;
	КонецЕсли; 
	
	ВычестьМассив(МассивПолейГруппировки, МассивПолейСуммы);
	
	ПоляГруппировки = МассивВСтроку(МассивПолейГруппировки);
	Отбор = Новый Структура(ПоляГруппировки);
	Индекс = 0;
	Для Каждого Строка Из Строки Цикл
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		Если ЭтоКвазиТаблицаЗначений Тогда
			НайденныеСтроки = НайтиСтрокиКвазиТаблицыЗначений(Коллекция, Отбор, Ложь);
		Иначе
			НайденныеСтроки = НайтиЭлементыКоллекции(Строки, Отбор);
		КонецЕсли;
		
		ИндексСтроки = НайденныеСтроки.Найти(Строка);
		Если ИндексСтроки <> Неопределено Тогда
			НайденныеСтроки.Удалить(ИндексСтроки);
		КонецЕсли;
		
		Если МассивПолейСуммы.Количество() > 0 Тогда
			Если АгрегатнаяФункция = "СписокЗначений" Тогда
				АгрегироватьЗначенияПолейГруппировкиСписокЗначений(Строка, НайденныеСтроки, МассивПолейСуммы);
			ИначеЕсли АгрегатнаяФункция = "Массив" Тогда
				АгрегироватьЗначенияПолейГруппировкиМассив(Строка, НайденныеСтроки, МассивПолейСуммы);
			ИначеЕсли АгрегатнаяФункция = "Строка" Тогда
				АгрегироватьЗначенияПолейГруппировкиСтрока(Строка, НайденныеСтроки, МассивПолейСуммы);
			Иначе
				АгрегироватьЗначенияПолейГруппировкиСумма(Строка, НайденныеСтроки, МассивПолейСуммы);
			КонецЕсли; 
		КонецЕсли;
		
		Если ЭтоКвазиТаблицаЗначений Тогда
			УдалитьСтрокиКвазиТаблицыЗначений(Коллекция, НайденныеСтроки);
		Иначе
			УдалитьЭлементыКоллекции(Строки, НайденныеСтроки);
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция СвернутьТаблицуЗначений(Коллекция, знач ПоляГруппировки=Неопределено, знач ПоляСуммы=Неопределено) Экспорт

	Если ПоляСуммы = Неопределено Тогда
		МассивПолейСуммы = Новый Массив;
	Иначе
		МассивПолейСуммы = ЗначениеВМассив(ПоляСуммы);
	КонецЕсли; 
	
	Если ПоляГруппировки = Неопределено Тогда
		МассивПолейГруппировки = ВыгрузитьЗначенияКолонкиКоллекции(Коллекция.Колонки, "Имя");
	Иначе
		МассивПолейГруппировки = ЗначениеВМассив(ПоляГруппировки);
	КонецЕсли;
	
	ВычестьМассив(МассивПолейГруппировки, МассивПолейСуммы);
	
	ПоляГруппировки = МассивВСтроку(МассивПолейГруппировки);
	ПоляСуммы = МассивВСтроку(МассивПолейСуммы);
	Коллекция.Свернуть(ПоляГруппировки, ПоляСуммы);

КонецФункции

Функция ЗаполнитьЗначенияКоллекции(Коллекция, Значение, Поля=Неопределено) Экспорт
	
	ЭтоКвазиТаблицаЗначений = ЭтоКвазиТаблицаЗначений(Коллекция);
	Если ЭтоКвазиТаблицаЗначений Тогда
		МассивСтрок = Коллекция.Строки;
	Иначе
		МассивСтрок = Коллекция;
	КонецЕсли;
	
	Если Поля <> Неопределено Тогда
		ПоляМассив = ЗначениеВМассив(Поля, , Ложь);
	Иначе
		Если ЭтоКвазиТаблицаЗначений Тогда
			ПоляМассив = ВыгрузитьЗначенияКолонкиКоллекции(Коллекция.Колонки, "Имя");
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураЗначений = Новый Структура;
	Для Каждого Поле Из ПоляМассив Цикл
		СтруктураЗначений.Вставить(Поле, Значение);
	КонецЦикла;
	
	Для Каждого Строка Из МассивСтрок Цикл
		ЗаполнитьЗначенияСвойств(Строка, СтруктураЗначений);
	КонецЦикла;
	
	Если ЭтоКвазиТаблицаЗначений Тогда
		ИндексироватьКвазиТаблицу(Коллекция);
	КонецЕсли;
	
КонецФункции

Функция УдалитьКолонкуКвазиТаблицы(Таблица, ИмяКолонки) Экспорт
	
	Таблица.Колонки.Удалить(ИмяКолонки);
	Для Каждого Строка Из Таблица.Строки Цикл
		Строка.Удалить(ИмяКолонки);
	КонецЦикла;
	
	СистемыИндексирования = Таблица.МенеджерИндексирования.СистемыИндексирования;
	МассивИндексов = ВыгрузитьЗначенияКолонокКоллекции(СистемыИндексирования, "Значение");
	Для Каждого Индекс Из МассивИндексов Цикл
		НомерПоля = Индекс.ПоляИндексированияМассив.Найти(ИмяКолонки);
		Если НомерПоля <> Неопределено Тогда
			СистемыИндексирования.Удалить(Индекс.ПоляИндексирования);
			ОчиститьСистемуИндексирования(Индекс);
			Если Индекс.ПоляИндексированияМассив.Количество() > 1 Тогда
				Индекс.ПоляИндексированияМассив.Удалить(НомерПоля);
				Индекс.ПоляИндексирования = МассивВСтроку(Индекс.ПоляИндексированияМассив);
				ИндексироватьЭлементыКоллекции(Индекс, Таблица.Строки);
				СистемыИндексирования[Индекс.ПоляИндексирования] = Индекс;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецФункции

Функция ПереименоватьКолонкуКвазиТаблицыЗначений(Таблица, ИмяКолонки, НовоеИмяКолонки) Экспорт
	
	Если ИмяКолонки=НовоеИмяКолонки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОписаниеКолонки = Таблица.Колонки[ИмяКолонки];
	ОписаниеКолонки.Имя = НовоеИмяКолонки;
	Таблица.Колонки.Вставить(НовоеИмяКолонки, ОписаниеКолонки);
	Таблица.Колонки.Удалить(ИмяКолонки);
	Для Каждого Строка Из Таблица.Строки Цикл
		Строка.Вставить(НовоеИмяКолонки, Строка[ИмяКолонки]);
		Строка.Удалить(ИмяКолонки);
	КонецЦикла;
	
	МассивИндексов = ВыгрузитьЗначенияКолонокКоллекции(Таблица.МенеджерИндексирования.СистемыИндексирования, "Значение");
	Для Каждого Индекс Из МассивИндексов Цикл
		НомерПоля = Индекс.ПоляИндексированияМассив.Найти(ИмяКолонки);
		Если НомерПоля <> Неопределено Тогда
			Таблица.МенеджерИндексирования.СистемыИндексирования.Удалить(Индекс.ПоляИндексирования);
			Индекс.ПоляИндексированияМассив[НомерПоля] = НовоеИмяКолонки;
			Индекс.ПоляИндексирования = МассивВСтроку(Индекс.ПоляИндексированияМассив);
			Таблица.МенеджерИндексирования.СистемыИндексирования[Индекс.ПоляИндексирования] = Индекс;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ДополнитьКолонкиКвазиТаблицыЗначений(Таблица, СписокКолонок) Экспорт
	Если СписокКолонок <> Неопределено И ЗначениеЗаполнено(СписокКолонок) Тогда
		МассивКолонок = ЗначениеВМассив(СписокКолонок, , Ложь);
		Для Каждого ИмяКолонки Из МассивКолонок Цикл
			Если Не Таблица.Колонки.Свойство(ИмяКолонки) Тогда
				ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, ИмяКолонки);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 
КонецФункции

Функция СвернутьКвазиТаблицуЗначений(Таблица, знач ПоляГруппировки=Неопределено, знач ПоляСуммы=Неопределено, АгрегатнаяФункция=Неопределено) Экспорт 
	
	//Тест = Ложь; 
	//Вариант1 = Ложь;
	//Если Тест = Истина Тогда 
	//	
	//	Если Вариант1 Тогда 
	//		//Скорость Серегиных таблиц 
	//		д1 = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//		СвернутьКоллекциюЗначений(Таблица, ПоляГруппировки, ПоляСуммы, АгрегатнаяФункция);
	//		д2 = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//		разница1 = д2 - д1;
	//		
	//	Иначе
	//		д11 = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//		РаботаСКоллекциямиВызовСервера.СвернутьКвазиТаблицуКакОбычнуюТаблицу(Таблица, ПоляГруппировки, ПоляСуммы, АгрегатнаяФункция);
	//		д22 = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//		разница2 = д22 - д11; 
	//	КонецЕсли;
	//	
	//	//Скорость при приведении к обычной ТЗ 
	//	
	//Иначе
		Возврат СвернутьКоллекциюЗначений(Таблица, ПоляГруппировки, ПоляСуммы, АгрегатнаяФункция);				
	//КонецЕсли;
	
КонецФункции

Функция ПеренумероватьСтрокиКвазиТаблицыЗначений(Таблица)
	
	НомераИСтроки = Таблица.НумерацияСтрок.НомераИСтроки;
	НомераИСтроки.Очистить();
	
	НомерСтроки = 1;
	Для Каждого Строка Из Таблица.Строки Цикл
		НомераИСтроки[Строка] = НомерСтроки;
		НомераИСтроки[НомерСтроки] = Строка;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Таблица.НумерацияСтрок.ТекущийНомер = НомерСтроки;
	
КонецФункции

Функция СортироватьКвазиТаблицуЗначений(Таблица, СтрокаСортировки) Экспорт
	
	Если Не ЗначениеЗаполнено(СтрокаСортировки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СортироватьКоллекцию(Таблица.Строки, СтрокаСортировки);
	ПеренумероватьСтрокиКвазиТаблицыЗначений(Таблица);
	Возврат Истина;
	
КонецФункции

Функция ВосстановитьКвазиТаблицуЗначений(Таблица) Экспорт
	Если Таблица.Строки.Количество() > 0 Тогда
		Если Таблица.НумерацияСтрок.НомераИСтроки[Таблица.Строки[0]] = Неопределено Тогда
			ПеренумероватьСтрокиКвазиТаблицыЗначений(Таблица);
		КонецЕсли;
	КонецЕсли;
	
	Если Не МенеджерИндексирования_ПроверитьСсылочнуюЦелостность(Таблица.МенеджерИндексирования) Тогда
		ИндексироватьКвазиТаблицу(Таблица);
	КонецЕсли;
КонецФункции

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
///////////////////////////////////////////////////////////////////////////////////
Функция ВыгрузитьКвазиТаблицуЗначенийВИстиннуюТаблицуЗначений(КвазиТаблица) Экспорт
	Таблица = Новый ТаблицаЗначений;
	Для Каждого ЭлмКакБыКолонки Из КвазиТаблица.Колонки Цикл
		КакБыКолонка = ЭлмКакБыКолонки.Значение;
		Таблица.Колонки.Добавить(КакБыКолонка.Имя, КакБыКолонка.ТипЗначения);
	КонецЦикла;
	
	Для Каждого СтрокаКакБыТаблицы Из КвазиТаблица.Строки Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКакБыТаблицы);
	КонецЦикла;
	
	Возврат Таблица;
КонецФункции

Функция ЗагрузитьКвазиТаблицуЗначенийИзТаблицыЗначений(Таблица) Экспорт
	КвазиТаблица = НоваяКвазиТаблицаЗначений();
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		ДобавитьКолонкуКвазиТаблицыЗначений(КвазиТаблица, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла; 
	
	Для Каждого Строка Из Таблица Цикл
		СтрокаКакБыТаблицы = ДобавитьСтрокуКвазиТаблицыЗначений(КвазиТаблица);
		ЗаполнитьЗначенияСвойств(СтрокаКакБыТаблицы, Строка);
	КонецЦикла;
	
	Возврат КвазиТаблица;
КонецФункции

Функция ИзменитьТипКолонкиТаблицыЗначений(Таблица, ИмяКолонки, ТипЗначения=Неопределено) Экспорт
	
	Колонка = Таблица.Колонки[ИмяКолонки];
	
	Если ТипЗначения=Неопределено И Колонка.ТипЗначения.Типы().Количество() = 0 Тогда
		// уже разтипизирована
		Возврат Истина;
	КонецЕсли;
	
	СвойстваКолонки = Новый Структура("Имя, Ширина, Заголовок");
	ЗаполнитьЗначенияСвойств(СвойстваКолонки, Колонка);
	СвойстваКолонки.Вставить("Индекс", Таблица.Колонки.Индекс(Колонка));
	СвойстваКолонки.Вставить("Значения", Таблица.ВыгрузитьКолонку(СвойстваКолонки.Имя));
	
	ВременноеИмяКолонки = ПолучитьИмяНовогоЭлементаКоллекции("Колонка", Таблица.Колонки, "Имя");
	НоваяКолонка = Таблица.Колонки.Вставить(СвойстваКолонки.Индекс, ВременноеИмяКолонки, ТипЗначения, СвойстваКолонки.Заголовок, СвойстваКолонки.Ширина);
	Таблица.Колонки.Удалить(Колонка);
	НоваяКолонка.Имя = СвойстваКолонки.Имя;
	Таблица.ЗагрузитьКолонку(СвойстваКолонки.Значения, СвойстваКолонки.Имя);
	Возврат Истина;
	
КонецФункции

Функция СкопироватьТаблицуЗначений(ТаблицаИсточник, знач Строки=Неопределено, Разтипизировать=Ложь) Экспорт
	
	Если Разтипизировать Тогда
		
		Таблица = Новый ТаблицаЗначений;
		Для Каждого Колонка Из ТаблицаИсточник.Колонки Цикл
			Таблица.Колонки.Добавить(Колонка.Имя, , Колонка.Заголовок, Колонка.Ширина);
		КонецЦикла;
		
		Если Строки = Неопределено Тогда
			Строки = ТаблицаИсточник;
		КонецЕсли;
		
		Для Каждого Строка Из ТаблицаИсточник Цикл
			НоваяСтрока = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;
		
	Иначе
		
		// используем стандартный метод
		Таблица = ТаблицаИсточник.Скопировать(Строки);
		
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции
#КонецЕсли

//
//				Квази таблица значений-
//
///////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
///////////////////////////////////////////////////////////////////////////////////
Функция ДобавитьРеквизитФормы(Форма, МассивНовыхРеквизитов, ИмяРеквизита, Путь=Неопределено, Тип=Неопределено) Экспорт
	РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов(Тип), Путь);
	МассивНовыхРеквизитов.Добавить(РеквизитФормы);
	Возврат РеквизитФормы;
КонецФункции

Функция ДобавитьТаблицуФормы(Форма, МассивНовыхРеквизитов, ИмяТаблицы, ИменаКолонок) Экспорт
	МассивКолонок = ЗначениеВМассив(ИменаКолонок);
	ДобавитьРеквизитФормы(Форма, МассивНовыхРеквизитов, ИмяТаблицы, , "ТаблицаЗначений");
	Для Каждого ИмяКолонки Из МассивКолонок Цикл
		ДобавитьРеквизитФормы(Форма, МассивНовыхРеквизитов, ИмяКолонки, ИмяТаблицы);
	КонецЦикла; 
КонецФункции
#КонецЕсли

Функция ПронумероватьКоллекцию(Коллекция, ПоляГруппы, ПоляНомеров) Экспорт
	
	Если Коллекция.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли; 
	
	ПоляГруппыМассив = ЗначениеВМассив(ПоляГруппы);
	ПоляНомеровМассив = СтрокуВМассив(ПоляНомеров);
	Если ПоляГруппыМассив.Количество() <> ПоляНомеровМассив.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КоличествоПолей = ПоляГруппыМассив.Количество();
	
	Строка = Коллекция[0];
	ТекущаяГруппировка = Новый Структура;
	НомераГруппировок = Новый Структура;
	Для Каждого ПолеГруппы Из ПоляГруппыМассив Цикл
		ТекущаяГруппировка.Вставить(ПолеГруппы, Строка[ПолеГруппы]);
		НомераГруппировок.Вставить(ПолеГруппы, 1);
	КонецЦикла;
	
	Для Каждого Строка Из Коллекция Цикл
		
		Для НомерПоля=1 По КоличествоПолей Цикл
			ПолеГруппы = ПоляГруппыМассив[НомерПоля-1];
			Значение = Строка[ПолеГруппы];
			Если Значение <> ТекущаяГруппировка[ПолеГруппы] Тогда
				ТекущаяГруппировка[ПолеГруппы] = Значение;
				НомераГруппировок[ПолеГруппы] = НомераГруппировок[ПолеГруппы] + 1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для НомерПоля=НомерПоля+1 По КоличествоПолей Цикл
			ПолеГруппы = ПоляГруппыМассив[НомерПоля-1];
			НомераГруппировок[ПолеГруппы] = 1;
			ТекущаяГруппировка[ПолеГруппы] = Строка[ПолеГруппы];
		КонецЦикла;
		
		Для НомерПоля=1 По КоличествоПолей Цикл
			ПолеГруппы = ПоляГруппыМассив[НомерПоля-1];
			ПолеНомера = ПоляНомеровМассив[НомерПоля-1];
			Строка[ПолеНомера] = НомераГруппировок[ПолеГруппы]
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ДополнитьКолонкиКоллекции(Коллекция, СписокКолонок) Экспорт
	
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Если ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда
			Возврат ДополнитьКолонкиТаблицыЗначений(Коллекция, СписокКолонок);
		КонецЕсли;
#КонецЕсли
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		Возврат ДополнитьКолонкиКвазиТаблицыЗначений(Коллекция, СписокКолонок);
	КонецЕсли;
	
КонецФункции

Функция ПереименоватьКолонкуКоллекцииЗначений(Коллекция, ИмяКолонки, НовоеИмяКолонки) Экспорт
	
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Если ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда
			Коллекция.Колонки[ИмяКолонки].Имя = НовоеИмяКолонки;
			Возврат Истина;
		КонецЕсли;
	#КонецЕсли
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		Возврат ПереименоватьКолонкуКвазиТаблицыЗначений(Коллекция, ИмяКолонки, НовоеИмяКолонки);
	КонецЕсли;
	
КонецФункции

Функция СдвинутьЭлементКоллекции(Коллекция, знач Элемент, НовыйНомер) Экспорт
	
	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		
		СдвинутьСтрокуКвазиТаблицыЗначений(Коллекция, Элемент, НовыйНомер);
		
	Иначе
		
		Если ТипЗнч(Элемент)=Тип("Число") Тогда
			ТекущийИндекс = Элемент - 1;
		Иначе
			ТекущийИндекс = Коллекция.Индекс(Элемент);
		КонецЕсли;
		ТекущийНомер = ТекущийИндекс + 1;
		Если ТекущийНомер <> НовыйНомер Тогда
			Смещение = НовыйНомер - ТекущийНомер;
			Если НовыйНомер > ТекущийНомер Тогда
				Смещение = Смещение - 1;
			КонецЕсли;
			Коллекция.Сдвинуть(ТекущийИндекс, Смещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция СдвинутьЭлементыКоллекции(Коллекция, знач Элементы, НовыйНомер) Экспорт
	
	Для Каждого Элемент Из Элементы Цикл
		СдвинутьЭлементКоллекции(Коллекция, Элемент, НовыйНомер);
	КонецЦикла;

КонецФункции

Функция НомерЭлементаКоллекции(Коллекция, Элемент) Экспорт

	Если ЭтоКвазиТаблицаЗначений(Коллекция) Тогда
		
		НомерЭлемента = Коллекция.НумерацияСтрок.НомераИСтроки[Элемент];
		
	Иначе
		
		НомерЭлемента = Коллекция.Индекс(Элемент) + 1;
		
	КонецЕсли;
	
	Возврат НомерЭлемента;
	
КонецФункции

#КонецОбласти

Функция РазложитьЧислоНаРазряды(Число, Основание=10, КоличествоРазрядов=0) Экспорт
	
	Если Основание <= 1 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Разряды = Новый Массив;
	
	Остаток = Число;
	
	Пока Остаток > 0 Цикл
		
		Остаток2 = Цел(Остаток / Основание);
		Разряд = Остаток - Остаток2*Основание;
		Разряды.Добавить(Разряд);
		Остаток = Остаток2;
		
	КонецЦикла;
	
	Пока Разряды.Количество() < КоличествоРазрядов Цикл
		Разряды.Добавить(0);
	КонецЦикла;
	
	Возврат Разряды;
	
КонецФункции