#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СтандартнаяСхема() Экспорт
	
	Возврат Схема("СтандартнаяСхема");
	
КонецФункции

Функция Схема(ИмяСхемы) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_Звуки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_Звуки КАК вмс_Звуки
	|ГДЕ
	|	вмс_Звуки.ЭтоГруппа
	|	И вмс_Звуки.Схема
	|	И НЕ вмс_Звуки.ПометкаУдаления
	|	И вмс_Звуки.Имя = &ИмяСхемы";
	
	Запрос.УстановитьПараметр("ИмяСхемы", ИмяСхемы);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаЗапроса.Следующий();
		Возврат ВыборкаЗапроса.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ПолноеИмя(Звук) Экспорт
	
	Перем ОбщегоНазначенияВызовСервера, ОбщегоНазначенияСервер, РК;
	
	ОбщегоНазначенияВызовСервера = вмс_ОбщегоНазначенияВызовСервера;
	ОбщегоНазначенияСервер = вмс_ОбщегоНазначенияСервер;
	РК = вмс_РаботаСКоллекциями;
	
	ЭтоСсылка = ОбщегоНазначенияВызовСервера.ЭтоСсылкаОбъектаИБ(Звук);
	Ссылка = ?(ЭтоСсылка, Звук, Звук.Родитель);
	
	Родители = ОбщегоНазначенияСервер.ПолучитьТаблицуБлизостиЭлементов(Ссылка).ВыгрузитьКолонку("Предок");
	РК.УдалитьПустыеСтрокиКоллекции(Родители);
	ТаблицаРеквизитовРодителей = ОбщегоНазначенияСервер.ПолучитьРеквизитыОбъектов(Родители, "Ссылка, Имя");
	
	ПолноеИмя = "";
	ПоискПоСсылке = Новый Структура("Ссылка");
	Для Каждого Родитель Из Родители Цикл
		ПоискПоСсылке.Ссылка = Родитель;
		РеквизитыРодителяМассив = ТаблицаРеквизитовРодителей.НайтиСтроки(ПоискПоСсылке);
		РеквизитыРодителя = РеквизитыРодителяМассив[0];
		
		ПолноеИмя = РеквизитыРодителя.Имя + "\" + ПолноеИмя;
	КонецЦикла;
	
	Если ЭтоСсылка Тогда
		Если ЗначениеЗаполнено(ПолноеИмя) Тогда
			ПолноеИмя = Лев(ПолноеИмя, СтрДлина(ПолноеИмя)-1);
		КонецЕсли;
	Иначе
		ПолноеИмя = ПолноеИмя + Звук.Имя;
	КонецЕсли;
	
	Возврат ПолноеИмя;
	
КонецФункции

#КонецЕсли
