#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьТовар(Команда) 
	
	Если ПроверитьЗаполнение() Тогда
		Если НаименованиеУжеЕсть() Тогда
			ПоказатьПредупреждение(,"Номенклатура с таким наименованием уже существует!");
		Иначе
			СоздатьКарточкуТовара();	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКарточкуТовара() 
	ТоварВСтруктуру = Новый Структура("Организация,Контрагент, Товар, Артикул, Штрихкод", Параметры.Организация, Параметры.Контрагент, СокрЛП(НаименованиеТовара), СокрЛП(АртикулТовара), Штрихкод);
	ДанныеТовара = ВМС_ЛичныйКабинетПоклажедателяВызовСервер.СоздатьТоварПоклажедателя(ТоварВСтруктуру);   
	Если ДанныеТовара = Неопределено Тогда		
		ПоказатьПредупреждение(, "Товар не создан,обратитесь к компании оказывающей услуги!");
	Иначе
		Закрыть(ДанныеТовара);
	КонецЕсли;  
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция НаименованиеУжеЕсть()
	
	УстановитьПривилегированныйРежим(Истина);
	
	НайденныеТовары = Справочники.Номенклатура.НайтиПоНаименованию(Строка(Параметры.Контрагент) +"_" +СокрЛП(НаименованиеТовара));
	Если ЗначениеЗаполнено(НайденныеТовары) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти





