Функция НовыеПараметрыОтбора() Экспорт
	
	ПараметрыОтбора = Новый Структура;  
	ПараметрыОтбора.Вставить("Процесс"); 
	ПараметрыОтбора.Вставить("Распоряжение");
	ПараметрыОтбора.Вставить("Операция");   
	ПараметрыОтбора.Вставить("Автор");
	ПараметрыОтбора.Вставить("Склад");
	ПараметрыОтбора.Вставить("ЗонаПолучатель");
	ПараметрыОтбора.Вставить("ЗонаОтправитель");
	ПараметрыОтбора.Вставить("ТипыЯчеекОтбора", ТипыЯчеекДляОтбора());
	ПараметрыОтбора.Вставить("ТаблицаОтбора");
		
	Возврат ПараметрыОтбора;
	
КонецФункции  

Функция ТипыЯчеекДляОтбора() Экспорт
	
	ТипыЯчеекОтбора = Новый Массив;
	ТипыЯчеекОтбора.Добавить(Перечисления.вмс_ТипыЯчеек.Хранение);
	ТипыЯчеекОтбора.Добавить(Перечисления.вмс_ТипыЯчеек.ЗонаОтбора);
	ТипыЯчеекОтбора.Добавить(Перечисления.вмс_ТипыЯчеек.ЗонаПриемки); 
	
	Возврат ТипыЯчеекОтбора;
	
КонецФункции
