#Область КлиентскийAPI
Функция ВыполнитьДействие(знач Действие) Экспорт

	НачалоДействия(Действие);
	
	Если ОбработатьСлужебноеДействие(Действие) Тогда
		// особое действие
	Иначе
		ВыполнитьДействиеПереопределяемый(Действие);
	КонецЕсли;

	Возврат КонецДействия(Действие);
	
КонецФункции
#КонецОбласти

Функция ОбработатьСлужебноеДействие(Действие)
	
	Код = Действие.Код;
	
	Если Код="СоздатьОбработку" Тогда

		ДействиеСоздатьОбработку(Действие);
		
	ИначеЕсли Код="ПриЗасыпанииКлиентскогоПриложения" Тогда
		
		ДействиеПриЗасыпанииКлиентскогоПриложения(Действие);
		
	ИначеЕсли Код="ПриПробужденииКлиентскогоПриложения" Тогда
		
		ДействиеПриПробужденииКлиентскогоПриложения(Действие);
		
	ИначеЕсли Код="ПотерятьКэш" Тогда
		
		ПотерятьКэш();
		Действие.Закончить = Ложь;
		
	ИначеЕсли Код="ОбновитьПовторноИспользуемыеЗначения" Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
		Действие.Закончить = Ложь;
		
	ИначеЕсли Код="ПередатьДанныеСеанса" Тогда
		
		ДействиеПередатьДанныеСеанса(Действие);
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ДействиеПриЗасыпанииКлиентскогоПриложения(Действие)
	
	РК = вмс_РаботаСКоллекциями;
	
	ПараметрыОбработок = ПараметрыОбработок();

	КонтекстСобытия = Новый Структура;
	КонтекстСобытия.Вставить("Сеанс", ПараметрыОбработок.ПредыдущийСеанс);
	вмс_Журналирование.Записать("Сон", КонтекстСобытия);

	Сеанс = РК.СкопироватьОбъект(ПараметрыОбработок.Сеанс);
	
	Возврат УстановитьРезультатДействия(Действие, Сеанс);
	
КонецФункции

Функция ДействиеПриПробужденииКлиентскогоПриложения(Действие)
	
	ПараметрыОбработок = ПараметрыОбработок();

	КонтекстСобытия = Новый Структура;
	КонтекстСобытия.Вставить("Сеанс", ПараметрыОбработок.ПредыдущийСеанс);
	вмс_Журналирование.Записать("Пробуждение", КонтекстСобытия);

КонецФункции

Функция ПотерятьКэш() Экспорт
	ОбновитьПовторноИспользуемыеЗначения();
	ПоместитьВоВременноеХранилище(Неопределено, ПараметрыСеанса.вмс_АдресХранилищаПараметровПриложения);
	СостоянияОбработок = ПолучитьИзВременногоХранилища(ПараметрыСеанса.вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок);
	ХЗСостоянияОбработок = Новый ХранилищеЗначения(СостоянияОбработок);
	СостоянияОбработок = ХЗСостоянияОбработок.Получить();
	ПоместитьВоВременноеХранилище(СостоянияОбработок, ПараметрыСеанса.вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок);
КонецФункции

Функция НачалоДействия(Действие)
	
	Действие = Действие(Действие); //дополнит служебные поля в действии прилетевшего с клиента

	СостоянияОбработок = СостоянияОбработок();
	ПараметрыОбработок = ПараметрыОбработок();
	
	УдалитьНеИнициализированныеОбработки(ПараметрыОбработок, СостоянияОбработок);
	
	ПредыдущийСеанс = Действие.Сеанс;
	ПараметрыОбработок.Сеанс.НомерСоединения = ПолучитьТекущийСеансИнформационнойБазы().НомерСоединения;
	
	ПараметрыОбработок.РезультатДействия = РезультатДействия();
	
	ПроверитьВосстановитьСоединение(ПредыдущийСеанс, Действие.ИдентификаторОбработки, ПараметрыОбработок, СостоянияОбработок);
	
	ЗаполнитьЗначенияСвойств(ПараметрыОбработок.ПредыдущийСеанс, ПредыдущийСеанс); // данные сеанса, сохраненные на мобильном клиенте
	ЗаполнитьЗначенияСвойств(СостоянияОбработок.Сеанс, ПараметрыОбработок.Сеанс);
	СостоянияОбработок.НомерВызова = СостоянияОбработок.НомерВызова + 1;
	Если СостоянияОбработок.ВзаимодействиеНачато=Истина Тогда
		// взаимодействие не было завершено в прошлый раз
		// произошла критическая ошибка или сеанс неожидано закрылся
		СостоянияОбработок.ОшибкаВзаимодействия = Истина;
		ИдентификаторОбработкиОшибкиВзаимодействия = СостоянияОбработок.ИдентификаторОбработкиВзаимодействия;
	КонецЕсли;
	
	// начинаем начинать
	СостоянияОбработок.ВзаимодействиеНачато = Истина;
	СостоянияОбработок.ИдентификаторОбработкиВзаимодействия = Действие.ИдентификаторОбработки;
	ПоместитьВоВременноеХранилище(СостоянияОбработок, ПараметрыСеанса.вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок);

	ПараметрыОбработок.НомерВызова = СостоянияОбработок.НомерВызова; //будем сверять, если соединение попадет в другой рабочий процесс на сервере
	
	ЗаполнитьЗначенияСвойств(ПараметрыОбработок.РезультатДействия.Сеанс, ПараметрыОбработок.Сеанс);
	
	Если СостоянияОбработок.ОшибкаВзаимодействия Тогда
		ОбработатьОшибкуВзаимодействия(ИдентификаторОбработкиОшибкиВзаимодействия);
	КонецЕсли;
	
КонецФункции

Функция ОбработатьОшибкуВзаимодействия(ИдентификаторОбработки)
	
	Если ЗначениеЗаполнено(ИдентификаторОбработки) Тогда
		ВыполнитьДействиеПереопределяемый(Действие("ОбработатьОшибкуВзаимодействия", , ИдентификаторОбработки));
	КонецЕсли;
	
КонецФункции

Функция ПроверитьВосстановитьСоединение(ПредыдущийСеанс, ИдентификаторОбработки, ПараметрыОбработок, СостоянияОбработок)

	РК = вмс_РаботаСКоллекциями;

	ПервыйВызов = ПараметрыОбработок.НомерВызова=0 И НЕ ЗначениеЗаполнено(ИдентификаторОбработки) И ПредыдущийСеанс.НомерСеанса=Неопределено;

	Если ПараметрыОбработок.НомерВызова <> СостоянияОбработок.НомерВызова И СостоянияОбработок.НомерВызова <> 0 Тогда
		
		// слетел кэш данных обработок, переинициализируем обработки
		КонтекстЗаписиЖурнала = Новый Структура;
		КонтекстЗаписиЖурнала.Вставить("НомерСоединения1", СостоянияОбработок.Сеанс.НомерСоединения);
		КонтекстЗаписиЖурнала.Вставить("НомерСоединения2", ПараметрыОбработок.Сеанс.НомерСоединения);
		КонтекстЗаписиЖурнала.Вставить("НомерВызова1", СостоянияОбработок.НомерВызова);
		КонтекстЗаписиЖурнала.Вставить("НомерВызова2", ПараметрыОбработок.НомерВызова);
		вмс_Журналирование.Записать("Восстановление кэша данных серверных обработок из временного хранилища", КонтекстЗаписиЖурнала);

		ПараметрыОбработок = НовыеПараметрыОбработок();
		вмс_ОбщегоНазначенияКлиентСервер.УстановитьПараметрПриложения("ПараметрыОбработок", ПараметрыОбработок);

		ВосстановитьСостоянияОбработок(ПараметрыОбработок, СостоянияОбработок);
		
	ИначеЕсли ПараметрыОбработок.НомерВызова=0 И НЕ ПервыйВызов Тогда
		
		// закрылся сеанс
		Если ПредыдущийСеанс.НомерСеанса <> Неопределено Тогда
			// восстановим состояния обработок из регистра БД по номеру сеанса
			СостоянияОбработокИзИБ = СостоянияОбработокИзИБ(ПредыдущийСеанс);
			Если СостоянияОбработокИзИБ <> Неопределено Тогда

				ИдентификаторыОбработокМассив = СостоянияОбработокИзИБ.ТаблицаОбработок.ВыгрузитьКолонку("Идентификатор");
				ИдентификаторыОбработок = РК.МассивВСтроку(ИдентификаторыОбработокМассив);
				
				КонтекстЗаписиЖурнала = Новый Структура;
				КонтекстЗаписиЖурнала.Вставить("ПредыдущийСеанс", ПредыдущийСеанс);
				КонтекстЗаписиЖурнала.Вставить("Сеанс", ПараметрыОбработок.Сеанс);
				КонтекстЗаписиЖурнала.Вставить("ИдентификаторыОбработок", ИдентификаторыОбработок);
				вмс_Журналирование.Записать("Восстановление кэша данных серверных обработок из базы данных", КонтекстЗаписиЖурнала, "Инфо 1");
				
				ВосстановитьСостоянияОбработокИзИБ(ПредыдущийСеанс);
				СостоянияОбработок = СостоянияОбработок();
				ПараметрыОбработок = ПараметрыОбработок();
				
				ИдентификаторыОбработокМассив = СостоянияОбработок.ТаблицаОбработок.ВыгрузитьКолонку("Идентификатор");
				ИдентификаторыОбработок = РК.МассивВСтроку(ИдентификаторыОбработокМассив);
				ДанныеДляОтладки = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПриложения()["ДанныеДляОтладки"];

				КонтекстЗаписиЖурнала.Вставить("ИдентификаторыОбработок", ИдентификаторыОбработок);
				КонтекстЗаписиЖурнала.Вставить("КэшПотерян", ДанныеДляОтладки.ПотерялиКэш);
				вмс_Журналирование.Записать("Восстановление кэша данных серверных обработок из базы данных", КонтекстЗаписиЖурнала, "Инфо 2");
				
			ИначеЕсли ЗначениеЗаполнено(ИдентификаторОбработки) Тогда
				
				Ошибка = "Не найдены данные состояний сервер управляемых обработок";

				КонтекстЗаписиЖурнала = Новый Структура;
				КонтекстЗаписиЖурнала.Вставить("ПредыдущийСеанс", ПредыдущийСеанс);
				вмс_Журналирование.Записать(Ошибка, КонтекстЗаписиЖурнала, "Ошибка 1");

				ВызватьИсключение Ошибка;
				
			КонецЕсли;
		Иначе
			вмс_Журналирование.Ошибка("Не удалось восстановить кэш данных серверных обработок.
										|Мобильное приложение не обновлено.");
			// ждем получение ошибки
		КонецЕсли;

	КонецЕсли;
	
КонецФункции

Функция КонецДействия(Действие)

	ПараметрыОбработок = ПараметрыОбработок();
	
	Если НЕ Действие.Закончить Тогда
		ПараметрыОбработок.РезультатДействия.Результат = Действие.Результат;
		Возврат ПараметрыОбработок.РезультатДействия;
	КонецЕсли;
	
	СостоянияОбработок = СостоянияОбработок();
	
	ТаблицаПараметровОбработок = ПараметрыОбработок.ТаблицаОбработок;
	ТаблицаСостоянийОбработок = СостоянияОбработок.ТаблицаОбработок;
	КоличествоОбработок = ТаблицаСостоянийОбработок.Количество();
	Если КоличествоОбработок <> ТаблицаПараметровОбработок.Количество() Тогда
		ВызватьИсключение "Не восстановлены параметры обработок";
	КонецЕсли;
	
	Для НомерОбработки=0 По КоличествоОбработок-1 Цикл
		
		ЭлементТаблицыПараметровОбработок = ТаблицаПараметровОбработок[НомерОбработки];
		ЭлементТаблицыСостоянийОбработок = ТаблицаСостоянийОбработок[НомерОбработки];
		
		Если ЭлементТаблицыПараметровОбработок.Идентификатор <> ЭлементТаблицыСостоянийОбработок.Идентификатор Тогда
			ВызватьИсключение "Не восстановлены параметры обработок";
		КонецЕсли;
		
		ПараметрыОбработки = ТаблицаПараметровОбработок[НомерОбработки].ПараметрыОбработки;
		СостояниеОбработки = ПараметрыОбработки.СостояниеОбработки;
		ВыполнитьДействиеПереопределяемый(Действие("СохранитьСостояниеОбработки", , , ПараметрыОбработки));
		ВыполнитьДействиеПереопределяемый(Действие("ОбновитьСостояниеКлиента", , , ПараметрыОбработки));
		
		// синхронизируем состояние в параметрах обработки и в хранилище состояний
		ЭлементТаблицыСостоянийОбработок.СостояниеОбработки = СостояниеОбработки;
	КонецЦикла;
	
	УронитьСистему = Ложь;
	Если УронитьСистему Тогда
		вмс_ОбщегоНазначенияВызовСервера.УронитьСистему();
	КонецЕсли;
	
	// кончаем взаимодействовать
	СостоянияОбработок.ВзаимодействиеНачато = Ложь;
	СостоянияОбработок.ОшибкаВзаимодействия = Ложь;
	ПоместитьВоВременноеХранилище(СостоянияОбработок, ПараметрыСеанса.вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок);
	
	Если КоличествоОбработок > 0 Тогда
		СохранитьСостоянияОбработокВИБ(ПараметрыОбработок, СостоянияОбработок);
	КонецЕсли;
	
	ПараметрыОбработок.РезультатДействия.Результат = Действие.Результат;
	Возврат ПараметрыОбработок.РезультатДействия;
	
КонецФункции

Функция СохранитьСостоянияОбработокВИБ(ПараметрыОбработок, СостоянияОбработок)

	Запись = РегистрыСведений.вмс_ДанныеСеансов.СоздатьМенеджерЗаписи();
	Запись.Заполнить(Неопределено);
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыОбработок.Сеанс, "НомерСеанса, НачалоСеанса");
	Запись.ИмяДанных = "СостоянияСерверУправляемыхОбработок";
	Запись.Данные = Новый ХранилищеЗначения(СостоянияОбработок);
	Запись.Записать();
	
	ПредыдущийСеанс = ПараметрыОбработок.ПредыдущийСеанс;
	Сеанс = ПараметрыОбработок.Сеанс;
	Если ПредыдущийСеанс.НомерСеанса <> Неопределено Тогда
		Если НЕ (ПредыдущийСеанс.НомерСеанса=Сеанс.НомерСеанса И ПредыдущийСеанс.НачалоСеанса=Сеанс.НачалоСеанса) Тогда
			// удалим данные предыдущего сеанса после того, как успешно сохранились данные текущего сеанса
			Запись = РегистрыСведений.вмс_ДанныеСеансов.СоздатьМенеджерЗаписи();
			Запись.Заполнить(Неопределено);
			ЗаполнитьЗначенияСвойств(Запись, ПредыдущийСеанс, "НомерСеанса, НачалоСеанса");
			Запись.ИмяДанных = "СостоянияСерверУправляемыхОбработок";
			Запись.Удалить();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ВосстановитьСостоянияОбработокИзИБ(Сеанс)
	
	СостоянияОбработок = СостоянияОбработокИзИБ(Сеанс);

	ПоместитьВоВременноеХранилище(СостоянияОбработок, ПараметрыСеанса.вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок);

	ПараметрыОбработок = НовыеПараметрыОбработок();
	вмс_ОбщегоНазначенияКлиентСервер.УстановитьПараметрПриложения("ПараметрыОбработок", ПараметрыОбработок);

	ПараметрыОбработок.НомерВызова = СостоянияОбработок.НомерВызова;
	
	ВосстановитьСостоянияОбработок(ПараметрыОбработок, СостоянияОбработок);
	
КонецФункции

Функция СостоянияОбработокИзИБ(Сеанс)
	
	Запись = РегистрыСведений.вмс_ДанныеСеансов.СоздатьМенеджерЗаписи();
	Запись.Заполнить(Неопределено);
	ЗаполнитьЗначенияСвойств(Запись, Сеанс);
	Запись.ИмяДанных = "СостоянияСерверУправляемыхОбработок";
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		СостоянияОбработок = Запись.Данные.Получить();
	КонецЕсли;
	
	Возврат СостоянияОбработок;
	
КонецФункции

Функция ВосстановитьСостоянияОбработок(ПараметрыОбработок, СостоянияОбработок)

	ПараметрыОбработок.ТаблицаОбработок.Очистить();
	
	Для Каждого ЭлементТаблицыСостоянийОбработок Из СостоянияОбработок.ТаблицаОбработок Цикл
		СостояниеОбработки = ЭлементТаблицыСостоянийОбработок.СостояниеОбработки;
		
		ИдентификаторОбработки = СостояниеОбработки.Идентификатор;
		ПутьКДаннымОсновногоМодуля = СостояниеОбработки.ПутьКДаннымОсновногоМодуля;
		
		ПараметрыОбработки = НовыеПараметрыОбработки();
		ПараметрыОбработки.Идентификатор = ИдентификаторОбработки;
		ПараметрыОбработки.ИдентификаторРодителя = СостояниеОбработки.ИдентификаторРодителя;
		ПараметрыОбработки.ОписаниеОповещенияПриЗакрытии = СостояниеОбработки.ОписаниеОповещенияПриЗакрытии;
		
		ЭлементТаблицыПараметровОбработок = ПараметрыОбработок.ТаблицаОбработок.Добавить();
		ЭлементТаблицыПараметровОбработок.Идентификатор = ИдентификаторОбработки;
		ЭлементТаблицыПараметровОбработок.ПараметрыОбработки = ПараметрыОбработки;
		
		ПараметрыОбработки.СтандартныйМодуль = ДобавитьМодульОбработки(ПараметрыОбработки, "Обработка.вмс_СерверУправляемыйМодульСтандартный", , "Стандартный");
		ДобавитьМодульОбработки(ПараметрыОбработки, ПутьКДаннымОсновногоМодуля, , "Основной", 0);
		
		ПереинициализироватьОбработку(ПараметрыОбработки, СостояниеОбработки.ПараметрыИнициализации);
		ВосстановитьОбработку(ПараметрыОбработки, СостояниеОбработки);
	КонецЦикла;
	
КонецФункции

Функция УдалитьНеИнициализированныеОбработки(ПараметрыОбработок, СостоянияОбработок)

	ЭлементыТаблицыСостоянийОбработок = СостоянияОбработок.ТаблицаОбработок.НайтиСтроки(Новый Структура("Инициализирована", Ложь));
	Если ЭлементыТаблицыСостоянийОбработок.Количество()=0 Тогда
		// все в порядке
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ЭлементТаблицыСостоянийОбработок Из ЭлементыТаблицыСостоянийОбработок Цикл
		ЭлементТаблицыПараметровОбработокМассив = ПараметрыОбработок.ТаблицаОбработок.НайтиСтроки(Новый Структура("Идентификатор", ЭлементТаблицыСостоянийОбработок.Идентификатор));
		Для Каждого ЭлементТаблицыПараметровОбработок Из ЭлементТаблицыПараметровОбработокМассив Цикл
			ПараметрыОбработок.ТаблицаОбработок.Удалить(ЭлементТаблицыПараметровОбработок);
		КонецЦикла;
		СостоянияОбработок.ТаблицаОбработок.Удалить(ЭлементТаблицыСостоянийОбработок);
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

Функция ПереинициализироватьОбработку(ПараметрыОбработки, ПараметрыИнициализации)

	РК = вмс_РаботаСКоллекциями;
	
	ПараметрыИнициализации.Вставить("ВосстановлениеКэша", Истина);
	ПараметрыОбработки.СостояниеОбработки.ПараметрыИнициализации = ПараметрыИнициализации;
	Действие = Действие("Инициализировать", ПараметрыИнициализации, ПараметрыОбработки.Идентификатор, ПараметрыОбработки);
	ВыполнитьДействиеПереопределяемый(Действие);

КонецФункции

Функция ВосстановитьОбработку(ПараметрыОбработки, СостояниеОбработки)
	
	СостоянияМодулей = СостояниеОбработки.СостоянияМодулей;
	Для Каждого ЭлементМодуляОбработки Из ПараметрыОбработки.МодулиОбработки Цикл
		ПараметрыМодуля = ЭлементМодуляОбработки.ПараметрыМодуля;
		ЭлементСостояниеМодуляМассив = СостоянияМодулей.НайтиСтроки(Новый Структура("ИмяМодуля", ЭлементМодуляОбработки.ИмяМодуля));
		ЭлементСостояниеМодуля = ЭлементСостояниеМодуляМассив[0]; //должен существовать
		СостояниеМодуля = ЭлементСостояниеМодуля.СостояниеМодуля;
		
		ПараметрыМодуля.СостояниеМодуля = СостояниеМодуля;
		ПараметрыМодуля.Данные = СостояниеМодуля.Данные;
	КонецЦикла;
	
	ПараметрыОбработки.СостояниеОбработки = СостояниеОбработки;
	ПараметрыОбработки.Данные = СостояниеОбработки.Данные;

	Для Каждого ЭлементМодуляОбработки Из ПараметрыОбработки.МодулиОбработки Цикл
		ИнициализироватьПеременныеМодуляОбработки(ЭлементМодуляОбработки, ПараметрыОбработки);
	КонецЦикла;

	Действие = Действие("ВосстановитьСостояниеОбработки", , ПараметрыОбработки.Идентификатор, ПараметрыОбработки);
	ВыполнитьДействиеПереопределяемый(Действие);
	
КонецФункции

Функция СоздатьОбработку(ПутьКДаннымОсновногоМодуля, ПараметрыИнициализации=Неопределено, ИдентификаторОбработкиРодителя=0, ОписаниеОповещенияПриЗакрытии=Неопределено) Экспорт

	Возврат ДействиеСоздатьОбработку(Действие("СоздатьОбработку", Новый Структура("ПутьКДаннымОсновногоМодуля, ПараметрыИнициализации, Родитель, ОписаниеОповещенияПриЗакрытии", ПутьКДаннымОсновногоМодуля, ПараметрыИнициализации, ИдентификаторОбработкиРодителя, ОписаниеОповещенияПриЗакрытии)));
	
КонецФункции

Функция УдалитьОбработку(ИдентификаторОбработки) Экспорт

	Отбор = Новый Структура("Идентификатор", ИдентификаторОбработки);

	ПараметрыОбработок = ПараметрыОбработок();
	ЭлементыТаблицыОбработок = ПараметрыОбработок.ТаблицаОбработок.НайтиСтроки(Отбор);
	Для Каждого ЭлементТаблицыОбработок Из ЭлементыТаблицыОбработок Цикл
		ПараметрыОбработок.ТаблицаОбработок.Удалить(ЭлементТаблицыОбработок);
	КонецЦикла;

	СостоянияОбработок = СостоянияОбработок();
	ЭлементыТаблицыОбработок = СостоянияОбработок.ТаблицаОбработок.НайтиСтроки(Отбор);
	Для Каждого ЭлементТаблицыОбработок Из ЭлементыТаблицыОбработок Цикл
		СостоянияОбработок.ТаблицаОбработок.Удалить(ЭлементТаблицыОбработок);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(СостоянияОбработок, ПараметрыСеанса.вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок);
	
	Если СостоянияОбработок.ТаблицаОбработок.Количество()=0 Тогда
		ОчиститьДанныеСеанса();
	КонецЕсли;
	
КонецФункции

Функция ОчиститьДанныеСеанса()
	
	ПараметрыОбработок = ПараметрыОбработок();
	
	Запись = РегистрыСведений.вмс_ДанныеСеансов.СоздатьМенеджерЗаписи();
	Запись.ИмяДанных = "СостоянияСерверУправляемыхОбработок";
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыОбработок.ПредыдущийСеанс);
	Запись.Удалить();
	
	Запись = РегистрыСведений.вмс_ДанныеСеансов.СоздатьМенеджерЗаписи();
	Запись.ИмяДанных = "СостоянияСерверУправляемыхОбработок";
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыОбработок.Сеанс);
	Запись.Удалить();
	
	ПараметрыОбработок.НомерВызова = 0;
	
	СостоянияОбработок = НовыеСостоянияОбработок();
	ПоместитьВоВременноеХранилище(СостоянияОбработок, ПараметрыСеанса.вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок);
	
КонецФункции

Функция ДействиеСоздатьОбработку(Действие)
	
	ПараметрыДействия = Действие.Параметры;
	ПутьКДаннымОсновногоМодуля = ПараметрыДействия.ПутьКДаннымОсновногоМодуля;

	ИдентификаторРодителя 			= ?(ПараметрыДействия.Свойство("Родитель"),							ПараметрыДействия.Родитель,							0);
	ОписаниеОповещенияПриЗакрытии	= ?(ПараметрыДействия.Свойство("ОписаниеОповещенияПриЗакрытии"),	ПараметрыДействия.ОписаниеОповещенияПриЗакрытии,	Неопределено);
	
	СостоянияОбработок = СостоянияОбработок();
	ПараметрыОбработок = ПараметрыОбработок();
	ИдентификаторНовойОбработки = СостоянияОбработок.ИдентификаторНовойОбработки;

	ПараметрыОбработки = НовыеПараметрыОбработки();
	ПараметрыОбработки.Идентификатор = ИдентификаторНовойОбработки;
	ПараметрыОбработки.ИдентификаторРодителя = ИдентификаторРодителя;
	ПараметрыОбработки.ОписаниеОповещенияПриЗакрытии = ОписаниеОповещенияПриЗакрытии;

	СостояниеОбработки = ПараметрыОбработки.СостояниеОбработки;
	СостояниеОбработки.Идентификатор = ИдентификаторНовойОбработки;
	СостояниеОбработки.ИдентификаторРодителя = ИдентификаторРодителя;
	СостояниеОбработки.ОписаниеОповещенияПриЗакрытии = ОписаниеОповещенияПриЗакрытии;
	СостояниеОбработки.ПутьКДаннымОсновногоМодуля = ПутьКДаннымОсновногоМодуля;
	СостояниеОбработки.ПараметрыИнициализации = ПараметрыИнициализацииОбработки(ПараметрыДействия);

	ПараметрыОбработки.СтандартныйМодуль = ДобавитьМодульОбработки(ПараметрыОбработки, "Обработка.вмс_СерверУправляемыйМодульСтандартный", , "Стандартный");
	ДобавитьМодульОбработки(ПараметрыОбработки, ПутьКДаннымОсновногоМодуля, , "Основной", 0);

	ЭлементТаблицыСостоянийОбработок = СостоянияОбработок.ТаблицаОбработок.Добавить();
	ЭлементТаблицыСостоянийОбработок.Идентификатор = ИдентификаторНовойОбработки;
	ЭлементТаблицыСостоянийОбработок.Инициализирована = СостояниеОбработки.Инициализирована;
	ЭлементТаблицыСостоянийОбработок.СостояниеОбработки = СостояниеОбработки;
	СостоянияОбработок.ИдентификаторНовойОбработки = ИдентификаторНовойОбработки + 1;
	ПоместитьВоВременноеХранилище(СостоянияОбработок, ПараметрыСеанса.вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок);

	ЭлементТаблицыОбработок = ПараметрыОбработок.ТаблицаОбработок.Добавить();
	ЭлементТаблицыОбработок.Идентификатор = ИдентификаторНовойОбработки;
	ЭлементТаблицыОбработок.ПараметрыОбработки = ПараметрыОбработки;
	
	ВыполнитьДействиеПереопределяемый(Действие("СозданиеОбработки", СостояниеОбработки.ПараметрыИнициализации, , ПараметрыОбработки));
	Если ОшибкаДействия() Тогда
		Возврат УстановитьРезультатДействия(Действие, Неопределено);
	КонецЕсли;

	ВыполнитьДействиеПереопределяемый(Действие("Инициализировать", СостояниеОбработки.ПараметрыИнициализации, , ПараметрыОбработки));
	Если ОшибкаДействия() Тогда
		ПараметрыОбработки.Отказ = Истина;
	КонецЕсли;
	
	Если ПараметрыОбработки.Отказ Тогда
		УдалитьОбработку(ИдентификаторНовойОбработки);
		Возврат УстановитьРезультатДействия(Действие, Неопределено);
	КонецЕсли;
	
	СостояниеОбработки.Инициализирована = Истина;
	ЭлементТаблицыСостоянийОбработок.Инициализирована = СостояниеОбработки.Инициализирована;
	ПоместитьВоВременноеХранилище(СостоянияОбработок, ПараметрыСеанса.вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок);
	
	РегистрацияНовойОбработки = Новый Структура("Идентификатор, Родитель", ИдентификаторНовойОбработки, ИдентификаторРодителя);
	ПараметрыОбработок.РезультатДействия.РегистрацияНовыхОбработок.Добавить(РегистрацияНовойОбработки);
	
	ВыполнитьДействиеПереопределяемый(Действие("НачалоОбработки", , , ПараметрыОбработки));
	
	вмс_Журналирование.Записать("Начало новой сервер управляемой обработки, идентификатор: " + ИдентификаторНовойОбработки, СостояниеОбработки.ПараметрыИнициализации);
	
	Возврат УстановитьРезультатДействия(Действие, ИдентификаторНовойОбработки);
	
КонецФункции

Функция ПараметрыИнициализацииОбработки(ПараметрыДействия)

	РК = вмс_РаботаСКоллекциями;
	
	ПараметрыИнициализации = Неопределено;
	ПараметрыДействия.Свойство("ПараметрыИнициализации", ПараметрыИнициализации);
	Если ТипЗнч(ПараметрыИнициализации)=Тип("Структура") Тогда
		ПараметрыИнициализации = РК.СкопироватьОбъект(ПараметрыИнициализации);
	Иначе
		ПараметрыИнициализации = Новый Структура;
	КонецЕсли;

	Если НЕ ПараметрыИнициализации.Свойство("ЭтоАндроидОС") Тогда
		ПараметрыИнициализации.Вставить("ЭтоАндроидОС", Истина);
	КонецЕсли;
	
	Если НЕ ПараметрыИнициализации.Свойство("ВерсияМобильногоКлиента") Тогда
		ПараметрыИнициализации.Вставить("ВерсияМобильногоКлиента", "");
	КонецЕсли;
	
	Если ПараметрыДействия.Свойство("Родитель") Тогда
		ИдентификаторРодителя = ПараметрыДействия.Родитель;
	Иначе
		ИдентификаторРодителя = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторРодителя) Тогда
		ПараметрыРодителя = ПараметрыОбработки(ИдентификаторРодителя);
		ПараметрыИнициализацииРодителя = ПараметрыРодителя.СостояниеОбработки.ПараметрыИнициализации;
		
		Если ПараметрыИнициализацииРодителя.Свойство("ЭтоАндроидОС") Тогда
			ПараметрыИнициализации.Вставить("ЭтоАндроидОС", ПараметрыИнициализацииРодителя.ЭтоАндроидОС);
		КонецЕсли;

		Если ПараметрыИнициализацииРодителя.Свойство("ВерсияМобильногоКлиента") Тогда
			ПараметрыИнициализации.Вставить("ВерсияМобильногоКлиента", ПараметрыИнициализацииРодителя.ВерсияМобильногоКлиента);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыИнициализации;
	
КонецФункции

Функция ПараметрыОбработок() Экспорт
	
	ПараметрыОбработок = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрПриложения("ПараметрыОбработок");
	
	Если ПараметрыОбработок=Неопределено Тогда
		ПараметрыОбработок = НовыеПараметрыОбработок();
		вмс_ОбщегоНазначенияКлиентСервер.УстановитьПараметрПриложения("ПараметрыОбработок", ПараметрыОбработок);
	КонецЕсли;
	
	Возврат ПараметрыОбработок;
	
КонецФункции

Функция НовыеПараметрыОбработок()
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаОбработок = РК.НоваяТаблицаЗначений("Идентификатор, ПараметрыОбработки");
	
	ПредыдущийСеанс = Новый Структура("НомерСеанса, НачалоСеанса, НомерСоединения");
	Сеанс = Новый Структура("НомерСеанса, НачалоСеанса, НомерСоединения");
	ЗаполнитьЗначенияСвойств(Сеанс, ПолучитьТекущийСеансИнформационнойБазы());
	
	ПараметрыОбработок = Новый Структура;
	ПараметрыОбработок.Вставить("ПредыдущийСеанс", ПредыдущийСеанс);
	ПараметрыОбработок.Вставить("Сеанс", Сеанс);
	ПараметрыОбработок.Вставить("НомерВызова", 0);
	ПараметрыОбработок.Вставить("РезультатДействия", РезультатДействия());
	ПараметрыОбработок.Вставить("ТаблицаОбработок", ТаблицаОбработок);
	
	Возврат ПараметрыОбработок;
	
КонецФункции

Функция ПараметрыОбработки(ИдентификаторОбработки) Экспорт
	
	ПараметрыОбработок = ПараметрыОбработок();
	
	ЭлементТаблицыОбработокМассив = ПараметрыОбработок.ТаблицаОбработок.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторОбработки));
	
	Если ЭлементТаблицыОбработокМассив.Количество() > 0 Тогда
		ЭлементТаблицыОбработок = ЭлементТаблицыОбработокМассив[0];
		ПараметрыОбработки = ЭлементТаблицыОбработок.ПараметрыОбработки;
	Иначе
		СостояниеОбработки = СостояниеОбработки(ИдентификаторОбработки); //Проверим существование обработки в хранилище
		Если СостояниеОбработки=Неопределено Тогда
			Ошибка = "Неизвестный идентификатор обработки: (" + ИдентификаторОбработки + ")";
			
			ДанныеДляОтладки = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПриложения()["ДанныеДляОтладки"];
			Если ДанныеДляОтладки.ПотерялиКэш Тогда
				Ошибка = Ошибка + ", потеряли кэш данных по причине " + ДанныеДляОтладки.ПричинаПотериКэша;
			КонецЕсли;
			ВызватьИсключение Ошибка;
		КонецЕсли;
		
		// так как в хранилище обработка существует, значит слетел кэш обработки
		ПараметрыОбработки = НовыеПараметрыОбработки();
		ЭлементТаблицыОбработок = ПараметрыОбработок.ТаблицаОбработок.Добавить();
		ЭлементТаблицыОбработок.Идентификатор = ИдентификаторОбработки;
		ЭлементТаблицыОбработок.ПараметрыОбработки = ПараметрыОбработки;
	КонецЕсли;
	
	Возврат ПараметрыОбработки;
	
КонецФункции

Функция НовыеПараметрыОбработки() Экспорт
	
	МодулиОбработки = Новый ТаблицаЗначений;
	МодулиОбработки.Колонки.Добавить("Модуль");
	МодулиОбработки.Колонки.Добавить("ИмяМодуля");
	МодулиОбработки.Колонки.Добавить("ПараметрыМодуля");
	
	Данные = Новый Структура;
	
	СостояниеОбработки = НовоеСостояниеОбработки();
	СостояниеОбработки.Данные = Данные; //чтобы данные также сохранялись в хранилище на случай очистки кэша
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("Идентификатор");
	ПараметрыОбработки.Вставить("ИдентификаторРодителя");
	ПараметрыОбработки.Вставить("ОписаниеОповещенияПриЗакрытии");
	ПараметрыОбработки.Вставить("СтандартныйМодуль");
	ПараметрыОбработки.Вставить("МодулиОбработки", МодулиОбработки);
	ПараметрыОбработки.Вставить("Данные", Данные);
	ПараметрыОбработки.Вставить("ФормаОткрыта", Ложь);
	ПараметрыОбработки.Вставить("Отказ", Ложь);
	ПараметрыОбработки.Вставить("СостояниеОбработки", СостояниеОбработки);
	
	Возврат ПараметрыОбработки;
	
КонецФункции

Функция НовыеПараметрыМодуля() Экспорт
	
	ДанныеМодуля = Новый Структура;
	
	СостояниеМодуля = НовоеСостояниеМодуля();
	СостояниеМодуля.Данные = ДанныеМодуля;
	
	ПараметрыМодуля = Новый Структура;
	ПараметрыМодуля.Вставить("ИмяМодуля");
	ПараметрыМодуля.Вставить("Данные", ДанныеМодуля);
	ПараметрыМодуля.Вставить("СостояниеМодуля", СостояниеМодуля);
	
	Возврат ПараметрыМодуля;
	
КонецФункции

Функция СостоянияОбработок() Экспорт
	
	СостоянияОбработок = ПолучитьИзВременногоХранилища(ПараметрыСеанса.вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок);
	
	Если СостоянияОбработок=Неопределено Тогда
		СостоянияОбработок = НовыеСостоянияОбработок();
		ПоместитьВоВременноеХранилище(СостоянияОбработок, ПараметрыСеанса.вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок);
	КонецЕсли;
	
	Возврат СостоянияОбработок;
	
КонецФункции

Функция НовыеСостоянияОбработок()
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаОбработок = РК.НоваяТаблицаЗначений("Идентификатор, Инициализирована, СостояниеОбработки");
	ТаблицаОбработок.Индексы.Добавить("Идентификатор");
	ТаблицаОбработок.Индексы.Добавить("Инициализирована");
	
	Сеанс = Новый Структура("НомерСеанса, НачалоСеанса, НомерСоединения");
	СостоянияОбработок = Новый Структура;
	СостоянияОбработок.Вставить("Сеанс", Сеанс);
	СостоянияОбработок.Вставить("НомерВызова", 0);
	СостоянияОбработок.Вставить("ВзаимодействиеНачато", Ложь);
	СостоянияОбработок.Вставить("ОшибкаВзаимодействия", Ложь);
	СостоянияОбработок.Вставить("ИдентификаторОбработкиВзаимодействия", 0);
	СостоянияОбработок.Вставить("ИдентификаторНовойОбработки", 1);
	СостоянияОбработок.Вставить("ТаблицаОбработок", ТаблицаОбработок);
	
	Возврат СостоянияОбработок;
	
КонецФункции

Функция СостояниеОбработки(ИдентификаторОбработки) Экспорт
	
	СостоянияОбработок = СостоянияОбработок();
	
	ЭлементТаблицыСостоянийОбработокМассив = СостоянияОбработок.ТаблицаОбработок.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторОбработки));
	
	Если ЭлементТаблицыСостоянийОбработокМассив.Количество()=0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СостояниеОбработки = ЭлементТаблицыСостоянийОбработокМассив[0].СостояниеОбработки;
	
	Возврат СостояниеОбработки;
	
КонецФункции

Функция НовоеСостояниеОбработки()
	
	ПараметрыПриложения = вмс_ОбщегоНазначенияКлиентСервер.НовыеПараметрыПриложения();
	
	СостоянияМодулей = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("ИмяМодуля, СостояниеМодуля");
	
	СостояниеОбработки = Новый Структура;
	
	// для повторной инициализации, если слетит кэш
	СостояниеОбработки.Вставить("ПутьКДаннымОсновногоМодуля");
	СостояниеОбработки.Вставить("ПараметрыИнициализации");
	СостояниеОбработки.Вставить("Идентификатор");
	СостояниеОбработки.Вставить("ИдентификаторРодителя");
	СостояниеОбработки.Вставить("ОписаниеОповещенияПриЗакрытии");
	
	СостояниеОбработки.Вставить("Данные", Новый Структура);
	СостояниеОбработки.Вставить("Инициализирована", Ложь);
	СостояниеОбработки.Вставить("ДанныеДляОтладки", ПараметрыПриложения["ДанныеДляОтладки"]);
	
	СостояниеОбработки.Вставить("СостоянияМодулей", СостоянияМодулей);
	
	Возврат СостояниеОбработки;
	
КонецФункции


Функция ВыполнитьДействиеПереопределяемый(Действие) Экспорт
	
	Если Действие.ПараметрыОбработки <> Неопределено Тогда
		ПараметрыОбработки = Действие.ПараметрыОбработки;
	Иначе
		ПараметрыОбработки = ПараметрыОбработки(Действие.ИдентификаторОбработки);
	КонецЕсли;
	
	МодулиОбработкиПосле = Новый Массив;
	
	Для Каждого ЭлементМодуляОбработки Из ПараметрыОбработки.МодулиОбработки Цикл
		
		МодульОбработки = ЭлементМодуляОбработки.Модуль;
		
		Действие.ОбработкаПосле = Ложь;
		МодульОбработки.ВыполнитьДействие(Действие);
		
		Если Действие.Обработано Тогда
			
			Прервать;
			
		КонецЕсли;
		
		Если Действие.ОбрабатыватьПосле Тогда
			
			МодулиОбработкиПосле.Вставить(0, МодульОбработки);
			Действие.ОбрабатыватьПосле = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого МодульОбработки Из МодулиОбработкиПосле Цикл

		Действие.ОбработкаПосле = Истина;
		МодульОбработки.ВыполнитьДействие(Действие);
		
	КонецЦикла;
		
	Возврат Действие.Результат;
	
КонецФункции

Функция ДействиеСтрессТест()
	
	ПараметрыОбработок1 = ПараметрыОбработок();

	СсылкаНаДокумент = Документы.РеализацияТоваровУслуг.НайтиПоНомеру("ТД00-000001", '20250101');
	Документ = СсылкаНаДокумент.ПолучитьОбъект();
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
	ПараметрыОбработок2 = ПараметрыОбработок();
	
КонецФункции

// Подкладывает дополнительный модуль под текущий для подключения действий нереализованных в текущем модуле
Функция ДобавитьМодульОбработки(ПараметрыОбработки, ПутьКДаннымМодуля, ПараметрыИнициализацииМодуля=Неопределено, знач ИмяМодуля=Неопределено, Индекс=Неопределено) Экспорт
	
	Модуль = вмс_ОбщегоНазначенияСервер.СоздатьОбъектОбработки(ПутьКДаннымМодуля);

	Если ИмяМодуля=Неопределено Тогда
		ИмяМодуля = Модуль.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	МодулиОбработки = ПараметрыОбработки.МодулиОбработки;
	Если МодулиОбработки.НайтиСтроки(Новый Структура("ИмяМодуля", ИмяМодуля)).Количество() > 0 Тогда
		ВызватьИсключение "Неверное имя модуля (" + ИмяМодуля + ")! Модуль с таким именем уже существует!";
	КонецЕсли;
	
	Если Индекс <> Неопределено Тогда
		ЭлементМодуляОбработки = МодулиОбработки.Вставить(Индекс);
	Иначе
		Если МодулиОбработки.Количество()=0 Тогда
			ЭлементМодуляОбработки = МодулиОбработки.Вставить(0);
		Иначе
			ЭлементМодуляОбработки = МодулиОбработки.Вставить(1);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыМодуля = НовыеПараметрыМодуля();
	ПараметрыМодуля.ИмяМодуля = ИмяМодуля;
	СостояниеМодуля = ПараметрыМодуля.СостояниеМодуля;
	СостояниеМодуля.ИмяМодуля = ИмяМодуля;
	
	ЭлементМодуляОбработки.Модуль = Модуль;
	ЭлементМодуляОбработки.ИмяМодуля = ИмяМодуля;
	ЭлементМодуляОбработки.ПараметрыМодуля = ПараметрыМодуля;
	
	ЭлементСостоянияМодуля = ПараметрыОбработки.СостояниеОбработки.СостоянияМодулей.Добавить();
	ЭлементСостоянияМодуля.ИмяМодуля = ИмяМодуля;
	ЭлементСостоянияМодуля.СостояниеМодуля = СостояниеМодуля;
	
	////
	ИнициализироватьПеременныеМодуляОбработки(ЭлементМодуляОбработки, ПараметрыОбработки);
	ИнициализироватьМодульОбработки(ЭлементМодуляОбработки, ПараметрыОбработки, ПараметрыИнициализацииМодуля);
	
	Возврат Модуль;
	
КонецФункции

Функция ЗаменитьМодульОбработки(ПараметрыОбработки, МодульДляЗамены, ПутьКДаннымНовогоМодуля, ПараметрыИнициализацииМодуля=Неопределено) Экспорт
	
	МодулиОбработки = ПараметрыОбработки.МодулиОбработки;

	Если ТипЗнч(МодульДляЗамены)=Тип("Строка") Тогда
		ИмяМодуля = МодульДляЗамены;
		ЭлементМодуляОбработкиМассив = МодулиОбработки.НайтиСтроки(Новый Структура("ИмяМодуля", ИмяМодуля));
		Если ЭлементМодуляОбработкиМассив.Количество()=0 Тогда
			ВызватьИсключение "Неверное имя модуля (" + ИмяМодуля + ")! Модуль с таким именем не существует!";
		КонецЕсли;
	Иначе
		ЭлементМодуляОбработкиМассив = МодулиОбработки.НайтиСтроки(Новый Структура("Модуль", МодульДляЗамены));
		Если ЭлементМодуляОбработкиМассив.Количество()=0 Тогда
			ВызватьИсключение "Неверный модуль обработки!";
		КонецЕсли;
	КонецЕсли;
	
	ЭлементМодуляОбработки = ЭлементМодуляОбработкиМассив[0];
	
	НовыйМодуль = вмс_ОбщегоНазначенияСервер.СоздатьОбъектОбработки(ПутьКДаннымНовогоМодуля);
	
	ЭлементМодуляОбработки.Модуль = НовыйМодуль;

	////
	ИнициализироватьПеременныеМодуляОбработки(ЭлементМодуляОбработки, ПараметрыОбработки);
	ИнициализироватьМодульОбработки(ЭлементМодуляОбработки, ПараметрыОбработки, ПараметрыИнициализацииМодуля);
	
	Возврат НовыйМодуль;
	
КонецФункции

Функция УдалитьМодульОбработки(ПараметрыОбработки, Модуль) Экспорт
	
	МодулиОбработки = ПараметрыОбработки.МодулиОбработки;

	Если ТипЗнч(Модуль)=Тип("Строка") Тогда
		ИмяМодуля = Модуль;
		ЭлементМодуляОбработкиМассив = МодулиОбработки.НайтиСтроки(Новый Структура("ИмяМодуля", ИмяМодуля));
		Если ЭлементМодуляОбработкиМассив.Количество()=0 Тогда
			ВызватьИсключение "Неверное имя модуля (" + ИмяМодуля + ")! Модуль с таким именем не существует!";
		КонецЕсли;
	Иначе
		ЭлементМодуляОбработкиМассив = МодулиОбработки.НайтиСтроки(Новый Структура("Модуль", Модуль));
		Если ЭлементМодуляОбработкиМассив.Количество()=0 Тогда
			ВызватьИсключение "Неверный модуль обработки!";
		КонецЕсли;
	КонецЕсли;
	
	ЭлементМодуляОбработки = ЭлементМодуляОбработкиМассив[0];
	ИмяМодуля = ЭлементМодуляОбработки.ИмяМодуля;
	МодулиОбработки.Удалить(ЭлементМодуляОбработки);
	
	СостоянияМодулей = ПараметрыОбработки.СостояниеОбработки.СостоянияМодулей;
	СостояниеМодуляМассив = СостоянияМодулей.НайтиСтроки(Новый Структура("ИмяМодуля", ИмяМодуля));
	СостоянияМодулей.Удалить(СостояниеМодуляМассив[0]);
	
КонецФункции

Функция ИнициализироватьПеременныеМодуляОбработки(ЭлементМодуляОбработки, ПараметрыОбработки)
	
	Модуль = ЭлементМодуляОбработки.Модуль;
	ПараметрыМодуля = ЭлементМодуляОбработки.ПараметрыМодуля;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ПараметрыОбработки", ПараметрыОбработки);
	Параметры.Вставить("ДанныеОбработки", ПараметрыОбработки.Данные);
	Параметры.Вставить("СостояниеОбработки", ПараметрыОбработки.СостояниеОбработки);
	Параметры.Вставить("ПараметрыМодуля", ПараметрыМодуля);
	Параметры.Вставить("ДанныеМодуля", ПараметрыМодуля.Данные);
	Параметры.Вставить("СостояниеМодуля", ПараметрыМодуля.СостояниеМодуля);
	Параметры.Вставить("СтандартныйМодуль", ПараметрыОбработки.СтандартныйМодуль);
	
	// Заполним свойства, в расчете на то, что у модуля есть одноименные реквизиты
	// в таком случае программный код для инициализации не потребуется
	ЗаполнитьЗначенияСвойств(Модуль, Параметры);
	
	// ну а если нет, то пущай кодом инициализируются
	Действие = Действие("ИнициализироватьПеременныеМодуляОбработки", Параметры, ПараметрыОбработки.Идентификатор, ПараметрыОбработки);
	Модуль.ВыполнитьДействие(Действие);
	
	Возврат Действие.Результат;
	
КонецФункции

Функция ИнициализироватьМодульОбработки(ЭлементМодуляОбработки, ПараметрыОбработки, ПараметрыИнициализацииМодуля)
	
	Модуль = ЭлементМодуляОбработки.Модуль;
	Действие = Действие("ИнициализироватьМодульОбработки", ПараметрыИнициализацииМодуля, ПараметрыОбработки.Идентификатор, ПараметрыОбработки);
	Модуль.ВыполнитьДействие(Действие);
	
	Возврат Действие.Результат;
	
КонецФункции

Функция НовоеСостояниеМодуля()
	
	СостояниеМодуля = Новый Структура;
	СостояниеМодуля.Вставить("ИмяМодуля");
	СостояниеМодуля.Вставить("Данные", Новый Структура);
	
	Возврат СостояниеМодуля;
	
КонецФункции

Функция ПолучитьМодульОбработки(ПараметрыОбработки, ИмяМодуля) Экспорт
	
	ЭлементМодуляМассив = ПараметрыОбработки.МодулиОбработки.НайтиСтроки(Новый Структура("ИмяМодуля", ИмяМодуля));
	
	Если ЭлементМодуляМассив.Количество() > 0 Тогда
		
		Возврат ЭлементМодуляМассив[0].Модуль;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИмяМодуляОбработки(ПараметрыОбработки, Модуль) Экспорт

	ЭлементМодуляМассив = ПараметрыОбработки.МодулиОбработки.НайтиСтроки(Новый Структура("Модуль", Модуль));
	
	Если ЭлементМодуляМассив.Количество() > 0 Тогда
		
		Возврат ЭлементМодуляМассив[0].ИмяМодуля;
		
	КонецЕсли;
	
КонецФункции

Функция ЭтоСлужебныйМодуль(знач Модуль) Экспорт
	
	Если ТипЗнч(Модуль)=Тип("Строка") Тогда
		ИмяМодуля = Модуль;
		Модуль = Обработки[ИмяМодуля].Создать();
	КонецЕсли;
	
	Попытка
		Результат = Модуль.ВыполнитьДействие(Действие("ПроверитьЭтоСлужебныйМодуль"));
	Исключение
	КонецПопытки;
	
	Возврат Результат=Истина;
	
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, ПараметрыОбработки, Модуль, ДополнительныеПараметры=Неопределено, ИмяПроцедурыОбработкиОшибки=Неопределено, МодульОбработкиОшибки=Неопределено) Экспорт
	
	Если ПараметрыОбработки.Идентификатор <> Неопределено Тогда
		ИмяМодуля = ПолучитьИмяМодуляОбработки(ПараметрыОбработки, Модуль);
	Иначе
		ИмяМодуля = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьИмяМенеджераОбъектаПоИмениТипа(вмс_ОбщегоНазначенияКлиентСервер.ПолучитьИмяОбъекта(Модуль));
	КонецЕсли;
	
	ОО = вмс_ОбщегоНазначенияКлиентСервер.НовыйОписаниеОповещения(ИмяПроцедуры, Неопределено, ДополнительныеПараметры, ИмяПроцедурыОбработкиОшибки, МодульОбработкиОшибки);
	ОО.Вставить("ИдентификаторОбработки", ПараметрыОбработки.Идентификатор);
	ОО.Вставить("ИмяМодуля", ИмяМодуля); //объект не получится сохранить в хранилище, сохраним имя объекта
	ОО.Вставить("ЭтоПередаточныйОбработчикОповещения", Ложь);
	Возврат ОО;
	
КонецФункции

Функция ВыполнитьОбработкуОповещенияПереопределенный(знач ОписаниеОповещения, Результат=Неопределено) Экспорт
	
	ОписаниеОповещения = вмс_РаботаСКоллекциями.СкопироватьСтруктуру(ОписаниеОповещения);
	
	Если ОписаниеОповещения.ИдентификаторОбработки <> Неопределено Тогда
		ПараметрыОбработки = ПараметрыОбработки(ОписаниеОповещения.ИдентификаторОбработки);
		ОписаниеОповещения.Модуль = ПолучитьМодульОбработки(ПараметрыОбработки, ОписаниеОповещения.ИмяМодуля);
	Иначе
		ОписаниеОповещения.Модуль = Вычислить(ОписаниеОповещения.ИмяМодуля);
	КонецЕсли;
	
	вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьОбработкуОповещенияПереопределенный(ОписаниеОповещения, Результат);
	
КонецФункции

Функция ДействиеПередатьДанныеСеанса(Действие)
	
	ПараметрыОбработок = ПараметрыОбработок();
	
	ПараметрыОбработки = ПараметрыОбработки(Действие.ИдентификаторОбработки);
	ДанныеСеанса = вмс_ОбщегоНазначенияВызовСервера.ПолучитьДанныеСеанса();
	
	ДобавитьДействиеНаКлиенте(ПараметрыОбработки, "ПолучитьДанныеСеанса", ДанныеСеанса);
	
КонецФункции

Функция ЗавершитьРаботуОбработки(ПараметрыОбработки, Результат=Неопределено) Экспорт
	
	ПараметрыЗавершения = Новый Структура;
	ПараметрыЗавершения.Вставить("Отказ", Ложь);
	ПараметрыЗавершения.Вставить("Результат", Результат);
	ВыполнитьДействиеПереопределяемый(Действие("ПриЗавершенииРаботы", ПараметрыЗавершения, , ПараметрыОбработки));
	
	Если ПараметрыЗавершения.Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыОбработки.ФормаОткрыта Тогда
		ПараметрыОбработки.ФормаОткрыта = Ложь;
		ДобавитьДействиеНаКлиенте(ПараметрыОбработки, "Закрыть");
	КонецЕсли;

	Если ПараметрыОбработки.ОписаниеОповещенияПриЗакрытии <> Неопределено Тогда
		СостояниеВызываемойОбработки = СостояниеОбработки(ПараметрыОбработки.ОписаниеОповещенияПриЗакрытии.ИдентификаторОбработки);
		Если СостояниеВызываемойОбработки <> Неопределено Тогда
			ВыполнитьОбработкуОповещенияПереопределенный(ПараметрыОбработки.ОписаниеОповещенияПриЗакрытии, ПараметрыЗавершения.Результат);
		КонецЕсли;
	КонецЕсли;
	
	УдалитьОбработку(ПараметрыОбработки.Идентификатор);
	
КонецФункции

Функция ДобавитьДействиеНаКлиенте(ПараметрыОбработки, КодДействия, знач ПараметрыДействия=Неопределено) Экспорт
	
	ДействияНаКлиенте().Добавить(Действие(КодДействия, ПараметрыДействия, ПараметрыОбработки.Идентификатор));
	
КонецФункции

Функция ДействияНаКлиенте() Экспорт
	
	Возврат ПараметрыОбработок().РезультатДействия.ДействияНаКлиенте;
	
КонецФункции

Функция ДобавитьОшибкуДействия(ОписаниеОшибки) Экспорт
	
	РезультатДействия = ПараметрыОбработок().РезультатДействия;
	
	РезультатДействия.Ошибка = Истина;
	РезультатДействия.ОписанияОшибок.Добавить(ОписаниеОшибки);
	
КонецФункции

Функция ОшибкаДействия() Экспорт
	
	Возврат ПараметрыОбработок().РезультатДействия.Ошибка;
	
КонецФункции

Функция Действие(Источник, знач ПараметрыДействия=Неопределено, знач ИдентификаторОбработки=Неопределено, знач ПараметрыОбработки=Неопределено, МодульВызова=Неопределено) Экспорт
	
	Если ПараметрыОбработки <> Неопределено Тогда
		ИдентификаторОбработки = ПараметрыОбработки.Идентификатор;
	КонецЕсли;
	
	Сеанс = Новый Структура("НомерСеанса, НачалоСеанса");
	Если ТипЗнч(Источник)=Тип("Строка") Тогда
		Код = Источник;
	ИначеЕсли ТипЗнч(Источник)=Тип("Структура") Тогда
		Код = Источник.Код;
		Если ПараметрыДействия=Неопределено Тогда
			ПараметрыДействия = Источник.Параметры;
		КонецЕсли;
		
		Если ИдентификаторОбработки=Неопределено Тогда
			ИдентификаторОбработки = Источник.ИдентификаторОбработки;
		КонецЕсли;
		
		Если Источник.Свойство("Сеанс") Тогда
			ЗаполнитьЗначенияСвойств(Сеанс, Источник.Сеанс);
		КонецЕсли;
	КонецЕсли;
	
	Действие = Новый Структура;
	Действие.Вставить("Сеанс", Сеанс);
	Действие.Вставить("ИдентификаторОбработки", ИдентификаторОбработки);
	Действие.Вставить("ПараметрыОбработки", ПараметрыОбработки); //явная передача параметров обработки на случай если обработка еще не добавлена в пул обработок
	Действие.Вставить("Код", Код);
	Действие.Вставить("Параметры", ПараметрыДействия);
	Действие.Вставить("СтандартнаяОбработка", Истина);
	Действие.Вставить("ОбрабатыватьПосле", Ложь);
	Действие.Вставить("ОбработкаПосле", Ложь);
	Действие.Вставить("Обработано", Ложь);
	Действие.Вставить("Закончить", Истина);
	Действие.Вставить("МодульВызова", МодульВызова);
	Действие.Вставить("Результат");
	
	Возврат Действие;
	
КонецФункции

Функция УстановитьРезультатДействия(Действие, Результат=Неопределено) Экспорт
	
	Действие.Результат = Результат;
	Действие.Обработано = Истина;
	
	Возврат Действие.Результат;
	
КонецФункции

Функция ДействиеВыполняетсяПосле(Действие) Экспорт

	Если НЕ Действие.ОбработкаПосле Тогда
		Действие.ОбрабатыватьПосле = Истина;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция РезультатДействия(Результат=Неопределено) Экспорт
	
	Сеанс = Новый Структура("НомерСеанса, НачалоСеанса");
	
	РезультатДействия = Новый Структура;
	РезультатДействия.Вставить("Сеанс", Сеанс);
	РезультатДействия.Вставить("Результат", Результат);
	РезультатДействия.Вставить("РегистрацияНовыхОбработок", Новый Массив);
	РезультатДействия.Вставить("ДействияНаКлиенте", Новый Массив);
	РезультатДействия.Вставить("Ошибка", Ложь);
	РезультатДействия.Вставить("ОписанияОшибок", Новый Массив);
	
	Возврат РезультатДействия;
	
КонецФункции
