
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИмяЯчейки	= Параметры.ИмяЯчейки;
	Склад		= Параметры.Склад;
	ЭтаФорма.Заголовок = ИмяЯчейки;
	ЗаполнитьТаблицуОстаткиНаЯчейке();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуОстаткиНаЯчейке()
	Запрос = Новый Запрос;
	
	//Установка значений параметров  
	//ТУ_Прошин_13.01.26    
	//здесь склад нужен, поэтому достаю из ячейки
	Запрос.УстановитьПараметр("Склад", Склад);  	
	Запрос.УстановитьПараметр("ИмяЯчейки", ИмяЯчейки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия КАК Серия,
	|	вмс_ОперацияПоЯчейкамОстатки.Контейнер КАК Контейнер,
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток КАК Остаток,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка.Объем КАК ЯчейкаОбъем,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЧислитель КАК ТоварОбъемЧислитель,
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток * вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЧислитель КАК ОбъемНаЯчейке
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
	|			,
	|			Ячейка.Наименование = &ИмяЯчейки
	|				И Ячейка.Владелец = &Склад) КАК вмс_ОперацияПоЯчейкамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.Ячейка КАК Ячейка,
	|	ВТ_Остатки.Товар КАК Товар,
	|	ВТ_Остатки.Характеристика КАК Характеристика,
	|	ВТ_Остатки.Серия КАК Серия,
	|	ВТ_Остатки.Контейнер КАК Контейнер,
	|	СУММА(ЕСТЬNULL(ВТ_Остатки.ОбъемНаЯчейке, 0)) КАК ОбъемНаЯчейке,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_Остатки.ЯчейкаОбъем, 0)) КАК ЯчейкаОбъем
	|ПОМЕСТИТЬ ВТ_Сгруппированные
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.Ячейка,
	|	ВТ_Остатки.Товар,
	|	ВТ_Остатки.Характеристика,
	|	ВТ_Остатки.Серия,
	|	ВТ_Остатки.Контейнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сгруппированные.Ячейка КАК Ячейка,
	|	ВТ_Сгруппированные.Товар КАК Товар,
	|	ВТ_Сгруппированные.Характеристика КАК Характеристика,
	|	ВТ_Сгруппированные.Серия КАК Серия,
	|	ВТ_Сгруппированные.Контейнер КАК Контейнер,
	|	ВЫБОР
	|		КОГДА ВТ_Сгруппированные.ЯчейкаОбъем = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_Сгруппированные.ОбъемНаЯчейке * 100 / ВТ_Сгруппированные.ЯчейкаОбъем
	|	КОНЕЦ КАК ДоляВПроцентах
	|ПОМЕСТИТЬ ВТ_ПроцентЗаполнености
	|ИЗ
	|	ВТ_Сгруппированные КАК ВТ_Сгруппированные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.Товар КАК Товар,
	|	ВТ_Остатки.Характеристика КАК Характеристика,
	|	ВТ_Остатки.Серия КАК Серия,
	|	ВТ_Остатки.Контейнер КАК Контейнер,
	|	ВТ_Остатки.Остаток КАК Остаток,
	|	ВТ_ПроцентЗаполнености.ДоляВПроцентах КАК ДоляВПроцентах
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПроцентЗаполнености КАК ВТ_ПроцентЗаполнености
	|		ПО ВТ_Остатки.Ячейка = ВТ_ПроцентЗаполнености.Ячейка
	|			И ВТ_Остатки.Товар = ВТ_ПроцентЗаполнености.Товар
	|			И ВТ_Остатки.Характеристика = ВТ_ПроцентЗаполнености.Характеристика
	|			И ВТ_Остатки.Серия = ВТ_ПроцентЗаполнености.Серия
	|			И ВТ_Остатки.Контейнер = ВТ_ПроцентЗаполнености.Контейнер";
	
	Результат = Запрос.Выполнить();
	
	ОстаткиНаЯчейке.Загрузить(Результат.Выгрузить());
КонецПроцедуры

