#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ИмяДляПоиска = "" Тогда 
		ИмяДляПоиска = вмс_РаботаСКоллекциями.ПолучитьИмяПрограммнойПеременнойИзСтроки(Наименование);
	КонецЕсли;
	
	Если ПоРаспоряжению Тогда
		//Если Не СписокРаспоряженийЗаполнен() Тогда  
		// ТУ_Прошин_15.09.25+ 
		// в новой архитектуре это уже не нужно как понял, а булево откатывает
		//Если Распоряжения.Количество() = 0 Тогда
		//	ПоРаспоряжению = Ложь;
		//КонецЕсли; 
		// ТУ_Прошин_15.09.25-
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(Ссылка) И ПоРаспоряжению И ХранилищеСхемыКомпоновкиДанных.Получить() = Неопределено Тогда 
	//	СхемаКомпоновкиДанных = ПолучитьСхемуКомпоновкиДанныхПоУмолчанию();
	//	ХранилищеСхемыКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
	//КонецЕсли;
		
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	//Если ПредопределенныеДанные и Не ОбменДанными.Загрузка Тогда
	//    Отказ = Истина; 
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Нельзя удалять эти данные";
	//	Сообщение.Сообщить();
	//КонецЕсли;
КонецПроцедуры  
    
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(КлассОперации) Тогда
		КлассОперации = "Обработка.вмс_СерверУправляемыйМодульОперацияПоЯчейкамУниверсальная";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяФормы) Тогда
		ИмяФормы = "ФормаОперацииПоЗаданиюКладовщику";
	КонецЕсли;
	
КонецПроцедуры

#Область СКДДокументы
	
///////////////////////////СКД ДОКУМЕНТЫ + ///////////////////////////////////////     
//
//
//

Функция ПолучитьСКДДокументы(ПустойЗапрос) Экспорт
	СхемаКомпоновкиДанных = ПолучитьМакет("СКДСпискаДокументов"); 
	
	НаборДанныхЗапросСхемыКомпоновкиДанных = СхемаКомпоновкиДанных.НаборыДанных.Получить(0);
	
	Если ПустойЗапрос Тогда
		НаборДанныхЗапросСхемыКомпоновкиДанных.Запрос = ПолучитьПустойЗапросПоДокументам();
	Иначе
		
		Попытка
			// См. секцию "СКД ДОКУМЕНТЫ УНИКАЛЬНЫЕ ЗАПРОСЫ" здесь же
			Если СтрНайти(Наименование, "(Поступление)") <> 0 Тогда
				ТипОперации = "Поступление";
			ИначеЕсли СтрНайти(Наименование, "(Выбытие)") <> 0 Тогда
				ТипОперации = "Выбытие";
			Иначе
				ТипОперации = "";
			КонецЕсли;
			
			УникальныйЗапрос = ПолучитьУникальныйЗапросДокументы(ТипОперации);
			ТекстЗапроса = УникальныйЗапрос; 
			
		Исключение
			ИсходныйЗапрос = НаборДанныхЗапросСхемыКомпоновкиДанных.Запрос;
			ТекстЗапроса = ПолучитьБазовыйЗапросПоОснованиюДокументам(ИсходныйЗапрос);
		КонецПопытки;
		
		НаборДанныхЗапросСхемыКомпоновкиДанных.Запрос = ТекстЗапроса;
		
	КонецЕсли;
	
	//НастройкиСКД = СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки;
	//ПредставлениеОтбора = "Операция";
	//ОтборПоОперации = НастройкиСКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборПоОперации.Представление = ПредставлениеОтбора;
	//ОтборПоОперации.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Операция");
	//ОтборПоОперации.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборПоОперации.ПравоеЗначение = Ссылка;
	//ОтборПоОперации.Использование = Истина;
	//
	СхемаКомпоновкиДанных.Параметры.Операция.Значение = Ссылка;
	
	//КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	//КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	//КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки);
	//НастройкиКомпоновки = КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();
	//
	//ПараметрСКДОперация = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("Операция");
	//Если ПараметрСКДОперация <> Неопределено Тогда
	//	ПараметрСКДОперация.Значение = Ссылка;
	//	ПараметрСКДОперация.Использование = Истина; 
	//Иначе
	//	НовыйПараметр = НастройкиКомпоновки.ПараметрыДанных.Элементы.Добавить();
	//	НовыйПараметр.Параметр = Новый ПараметрКомпоновкиДанных("Операция"); 
	//	НовыйПараметр.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	//	НовыйПараметр.Значение = Ссылка;
	//	НовыйПараметр.Использование = Истина;
	//КонецЕсли;
	
	МассивТипов = Новый Массив;
	ПолноеИмяТипа = СтрЗаменить(ЗаданиеКладовщикуРаспоряжение, ".", "Ссылка.");
	МассивТипов.Добавить(Тип(ПолноеИмяТипа));
	
	ПолеНабораДанныхСхемыКомпоновкиДанных = НаборДанныхЗапросСхемыКомпоновкиДанных.Поля.Найти("Ссылка");
	ПолеНабораДанныхСхемыКомпоновкиДанных.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

Функция ПолучитьБазовыйЗапросПоОснованиюДокументам(ИсходныйЗапрос)
	
	ПозицияВТексте = СтрНайти(ИсходныйЗапрос, Символы.ПС + ";");
	Если ПозицияВТексте = 0 Тогда
		ПозицияВТексте = СтрНайти(ИсходныйЗапрос, ";");
	КонецЕсли;
	
	Если ПозицияВТексте > 0 Тогда
		ПозицияВТексте = ПозицияВТексте - 1;
	Иначе
		ПозицияВТексте = СтрДлина(ИсходныйЗапрос);
	КонецЕсли;
	
	ЛеваяЧастьЗапроса = Лев(ИсходныйЗапрос, ПозицияВТексте);
	ПраваяЧастьЗапроса = Сред(ИсходныйЗапрос, ПозицияВТексте+1);
		
	ИменаСкладаЗапрос = вмс_АдаптацияКонфигураций.ПолучитьИмяСкладаЗапрос();
	
	Реквизиты = Метаданные.НайтиПоПолномуИмени(ЗаданиеКладовщикуРаспоряжение).Реквизиты; 
	
	СкладВЗапросе = Неопределено;
	
	Для Каждого ИмяСклада Из ИменаСкладаЗапрос Цикл
		Если Реквизиты.Найти(ИмяСклада) <> Неопределено Тогда
			СкладВЗапросе = "ТаблицаДокументов." + ИмяСклада;
			Прервать; //Нужен первый найденный, приоритет важен
		КонецЕсли;
	КонецЦикла;
	
	Если СкладВЗапросе = Неопределено Тогда  
		Если Реквизиты.Найти("СкладОтправитель") <> Неопределено И Реквизиты.Найти("СкладПолучатель") <> Неопределено Тогда
			СкладВЗапросе =
			"ВЫБОР
			|	КОГДА (&ОперацияИмяДляПоиска = ""Приемка"" ИЛИ &ОперацияИмяДляПоиска = ""Размещение"" ИЛИ &ОперацияИмяДляПоиска = ""ПриемкаВЯчейки"")
			|		ТОГДА ТаблицаДокументов.СкладПолучатель
			|		ИНАЧЕ ТаблицаДокументов.СкладОтправитель
			|	КОНЕЦ";
		Иначе   
			СкладВЗапросе = "Неопределено";
		КонецЕсли;
	КонецЕсли;
	
	ЛеваяЧастьЗапроса = СтрЗаменить(ЛеваяЧастьЗапроса, "ТаблицаДокументов.Склад", СкладВЗапросе);
			
	Возврат ЛеваяЧастьЗапроса + ПраваяЧастьЗапроса; 

КонецФункции

Функция ПолучитьБазовыйЗапросПоДокументам(ИсходныйЗапрос) Экспорт
	ПозицияВТексте = СтрНайти(ИсходныйЗапрос, Символы.ПС + ";");
	Если ПозицияВТексте = 0 Тогда
		ПозицияВТексте = СтрНайти(ИсходныйЗапрос, ";");
	КонецЕсли;
	
	Если ПозицияВТексте > 0 Тогда
		ПозицияВТексте = ПозицияВТексте - 1;
	Иначе
		ПозицияВТексте = СтрДлина(ИсходныйЗапрос);
	КонецЕсли;
	
	ЛеваяЧастьЗапроса = Лев(ИсходныйЗапрос, ПозицияВТексте);
	ПраваяЧастьЗапроса = Сред(ИсходныйЗапрос, ПозицияВТексте+1);
		
	ИменаСкладаЗапрос = вмс_АдаптацияКонфигураций.ПолучитьИмяСкладаЗапрос();
	
	Реквизиты = Метаданные.НайтиПоПолномуИмени(ЗаданиеКладовщикуРаспоряжение).Реквизиты; 
	
	СкладВЗапросе = Неопределено;
	
	Для Каждого ИмяСклада Из ИменаСкладаЗапрос Цикл
		Если Реквизиты.Найти(ИмяСклада) <> Неопределено Тогда
			СкладВЗапросе = "ТаблицаДокументов." + ИмяСклада;
			Прервать; //Нужен первый найденный, приоритет важен
		КонецЕсли;
	КонецЦикла;
	
	Если СкладВЗапросе = Неопределено Тогда  
		Если Реквизиты.Найти("СкладОтправитель") <> Неопределено И Реквизиты.Найти("СкладПолучатель") <> Неопределено Тогда
			СкладВЗапросе =
			"ВЫБОР
			|	КОГДА (&ОперацияИмяДляПоиска = ""Приемка"" ИЛИ &ОперацияИмяДляПоиска = ""Размещение"" ИЛИ &ОперацияИмяДляПоиска = ""ПриемкаВЯчейки"")
			|		ТОГДА ТаблицаДокументов.СкладПолучатель
			|		ИНАЧЕ ТаблицаДокументов.СкладОтправитель
			|	КОНЕЦ";
		Иначе   
			СкладВЗапросе = "Неопределено";
		КонецЕсли;           
	КонецЕсли;
	
	ЛеваяЧастьЗапроса = СтрЗаменить(ЛеваяЧастьЗапроса, "ТаблицаДокументов.Склад", СкладВЗапросе);
			
	Возврат ЛеваяЧастьЗапроса + ПраваяЧастьЗапроса; 
	
КонецФункции

Функция ПолучитьУникальныйЗапросДокументы(ТипОперации)
	// См. секцию "СКД ТОВАРЫ УНИКАЛЬНЫЕ ЗАПРОСЫ" здесь же
	ПрефиксФункции = вмс_АдаптацияКонфигураций.ПрефиксФункции();
	НазваниеДокумента = СтрЗаменить(ЗаданиеКладовщикуРаспоряжение, "Документ.", ""); 
	Возврат Вычислить("УникальныйЗапросДокументы" + ПрефиксФункции + НазваниеДокумента + ТипОперации + "()");
КонецФункции

Функция ПолучитьПустойЗапросПоДокументам() Экспорт   
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Неопределено КАК Ссылка,
	|	Неопределено КАК Номер,
	|	Неопределено КАК Дата,
	|	Неопределено КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов";
	Возврат ТекстЗапроса; 
КонецФункции

//
//
//
///////////////////////////СКД ДОКУМЕНТЫ - ///////////////////////////////////////

#КонецОбласти

#Область СКДДокументыУникальныеЗапросы

///////////////////////////СКД ДОКУМЕНТЫ УНИКАЛЬНЫЕ ЗАПРОСЫ + ////////////////////     
//
//
//              
 
Функция УникальныйЗапросДокументыУНФ_ПеремещениеЗапасовПоступление()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиницаПолучатель КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ПеремещениеЗапасов КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ 
	|	И ТаблицаДокументов.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО (ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ)";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУНФ_ПеремещениеЗапасовВыбытие()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиница КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ПеремещениеЗапасов КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО (ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ)";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУНФ_ЗаказПокупателяПоступление()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиницаРезерв КАК Склад,
	|	СУММА(ЕСТЬNULL(ЗаказПокупателяМатериалыЗаказчика.Количество, 0)) КАК Количество
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.МатериалыЗаказчика КАК ЗаказПокупателяМатериалыЗаказчика
	|		ПО (ЗаказПокупателяМатериалыЗаказчика.Ссылка = ТаблицаДокументов.Ссылка)
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|	И ТаблицаДокументов.СтруктурнаяЕдиницаРезерв <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	И ТаблицаДокументов.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументов.Ссылка,
	|	ТаблицаДокументов.Номер,
	|	ТаблицаДокументов.Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиницаРезерв
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|ГДЕ
	|	ТаблицаДокументов.Количество > 0";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУНФ_ЗаказПокупателяВыбытие()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиницаРезерв КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|	И ТаблицаДокументов.СтруктурнаяЕдиницаРезерв <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) 
	|	И ТаблицаДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУНФ_ЗаказПоставщикуПоступление()
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиницаРезерв КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|	И ТаблицаДокументов.СтруктурнаяЕдиницаРезерв <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ";	   
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУНФ_ЗаказПоставщикуВыбытие()
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиницаРезерв КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|	И ТаблицаДокументов.СтруктурнаяЕдиницаРезерв <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	И ТаблицаДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПоставщику.ЗаказНаПереработку)
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ";	   
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_ЗаявкаНаВозвратТоваровОтКлиентаВыбытие()
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	СУММА(ЕСТЬNULL(ЗаявкаНаВозвратТоваровОтКлиентаЗаменяющиеТовары.Количество, 0)) КАК Количество
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаявкаНаВозвратТоваровОтКлиентаЗаменяющиеТовары
	|		ПО (ЗаявкаНаВозвратТоваровОтКлиентаЗаменяющиеТовары.Ссылка = ТаблицаДокументов.Ссылка)
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументов.Ссылка,
	|	ТаблицаДокументов.Номер,
	|	ТаблицаДокументов.Дата,
	|	ТаблицаДокументов.Склад
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|ГДЕ
	|	ТаблицаДокументов.Количество > 0";	
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_АктОРасхожденияхПослеПриемкиПоступление()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу > 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТоваров.Ссылка ЕСТЬ NULL";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_АктОРасхожденияхПослеПриемкиВыбытие()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу < 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТоваров.Ссылка ЕСТЬ NULL";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_АктОРасхожденияхПослеПеремещенияПоступление()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу > 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПеремещения КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТоваров.Ссылка ЕСТЬ NULL";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_АктОРасхожденияхПослеПеремещенияВыбытие()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу < 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПеремещения КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТоваров.Ссылка ЕСТЬ NULL";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_АктОРасхожденияхПослеОтгрузкиПоступление()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеОтгрузки.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу > 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.АктОРасхожденияхПослеОтгрузки КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТоваров.Ссылка ЕСТЬ NULL";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_АктОРасхожденияхПослеОтгрузкиВыбытие()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеОтгрузки.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу < 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.АктОРасхожденияхПослеОтгрузки КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТоваров.Ссылка ЕСТЬ NULL";
	Возврат Текст;
КонецФункции

//
//
//
///////////////////////////СКД ДОКУМЕНТЫ УНИКАЛЬНЫЕ ЗАПРОСЫ - ///////////////////////////////////////   

#КонецОбласти
#Область ВспомогательныеФункции
	
///////////////////////////ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ + ////////////////////     
//
//
// 

Функция ПолучитьПервуюЧастьЗапросаТовары(ПсевдонимТаблицы, ИмяТаблицы, ДобавитьПсевдонимПоля, СтандартныеРеквизиты, РеквизитыСПсевдонимами)    
	Текст = "ВЫБРАТЬ";
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + "." + Реквизит;
		Если ДобавитьПсевдонимПоля Тогда
			Текст = Текст + " КАК " + Реквизит + ",";
		Иначе
			Текст = Текст + ",";
		КонецЕсли;
	КонецЦикла;  
	
	Если РеквизитыСПсевдонимами <> Неопределено Тогда
		Для Каждого Реквизит Из РеквизитыСПсевдонимами Цикл
			Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + "." + Реквизит.Значение;
			Если ДобавитьПсевдонимПоля Тогда
				Текст = Текст + " КАК " + Реквизит.Ключ + ",";
			Иначе
				Текст = Текст + ",";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Текст = Лев(Текст, СтрДлина(Текст) - 1); //Убрать запятую
	
	Если ДобавитьПсевдонимПоля Тогда
		Текст = Текст + Символы.ПС + "ПОМЕСТИТЬ " + ПсевдонимТаблицы;
	КонецЕсли;
	
	Текст = Текст + Символы.ПС + "ИЗ";
	Текст = Текст + Символы.ПС + Символы.Таб + ИмяТаблицы + " КАК " + ПсевдонимТаблицы;   
	
	Возврат Текст;
КонецФункции	

Функция ПолучитьВторуюЧастьЗапросаТовары(ПсевдонимТаблицы, СтандартныеРеквизиты, РеквизитыСПсевдонимами, Условия)    
	Текст = "ВЫБРАТЬ";
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		Если Реквизит = "Количество" Тогда
			Текст = Текст + Символы.ПС + Символы.Таб + "СУММА(" + ПсевдонимТаблицы + ".Количество)"; 
		Иначе
			Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + "." + Реквизит;  
		КонецЕсли; 
		
		Если Реквизит = "Номенклатура" Тогда
			Текст = Текст + " КАК Товар,";
		Иначе
			Текст = Текст + " КАК " + Реквизит + ",";
		КонецЕсли;
	КонецЦикла;
	
	Если РеквизитыСПсевдонимами <> Неопределено Тогда
		Для Каждого Реквизит Из РеквизитыСПсевдонимами Цикл
			Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + "." + Реквизит.Значение;
			Текст = Текст + " КАК " + Реквизит.Ключ + ",";
		КонецЦикла;
	КонецЕсли;
		
	Текст = Лев(Текст, СтрДлина(Текст) - 1); //Убрать запятую
	
	Текст = Текст + Символы.ПС + "ИЗ";
	Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + " КАК " + ПсевдонимТаблицы;   
	
	Если Условия <> Неопределено Тогда                                                                                                                     
		Текст = Текст + Символы.ПС + "ГДЕ"; 
		Текст = Текст + Символы.ПС + Условия;
	КонецЕсли;  
	
	Текст = Текст + Символы.ПС + "СГРУППИРОВАТЬ ПО"; 
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		Если Реквизит <> "Количество" Тогда
			Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + "." + Реквизит + ",";
		КонецЕсли;
	КонецЦикла;
	
	Если РеквизитыСПсевдонимами <> Неопределено Тогда
		Для Каждого Реквизит Из РеквизитыСПсевдонимами Цикл
			Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + "." + Реквизит.Значение + ",";
		КонецЦикла;
	КонецЕсли;
	
	Текст = Лев(Текст, СтрДлина(Текст) - 1); //Убрать запятую
	
	Возврат Текст;
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
КонецПроцедуры



#КонецОбласти

#Иначе

#КонецЕсли