// Инициализирует структуру для возвращения на форму после сканирования
// 
//	Поля структуры:
//	Штрихкод - Строка
//	Количество - Число
//	Вес - Число
//	Ссылка - ЛюбаяСсылка
//	Представление - Строка
//	Распознан - Булево
//
// Возвращаемое значение:
//   Структура
//
Функция ИнициализироватьСтруктуруДанныхШтрихкода() Экспорт

	Данные = Новый Структура;
	Данные.Вставить("Штрихкод", "");
	Данные.Вставить("Префикс", "");
	Данные.Вставить("Код", "");
	Данные.Вставить("Тип");
	Данные.Вставить("Ссылка");
	Данные.Вставить("Распознан", Ложь);
	
	Возврат Данные;

КонецФункции
