
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Если ЭтоНовый() Тогда
			//сгенерировать уникальный номер в основной базе при загрузке из мобильной базы
			УстановитьНовыйНомер();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)  
			
	КомплектыДокумента = Комплекты.Выгрузить();  
	КомплектыДокумента.Колонки["ХарактеристикаТовара"].Имя = "Характеристика";
	КомплектующиеДокумента = Комплектующие.Выгрузить();
	КомплектующиеДокумента.Колонки["ИдентификаторСтрокиКомплекта"].Имя = "ИдентификаторСтроки";
	КомплектующиеДокумента.Колонки["Количество"].Имя = "КоличествоФакт"; 
	
	СводнаяТаблица = вмс_РаботаСКоллекциями.СоединитьТаблицы(КомплектыДокумента, КомплектующиеДокумента, "ИдентификаторСтроки", "Комплектующая, ХарактеристикаКомплектующей, КоличествоФакт", , Ложь);
	
	Движения.вмс_ПотребностьКомплектующих.Записывать = Истина;
	Для Каждого Строка Из СводнаяТаблица Цикл 
		
		Движение = Движения.вмс_ПотребностьКомплектующих.Добавить();		
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		ЗаполнитьЗначенияСвойств(Движение, Строка);  
		Движение.ДокументПотребности = ДокументОснование;		
		Движение.Период = Дата;
		Движение.Потребность = Строка.КоличествоФакт;
		
	КонецЦикла;  
	
	Движения.вмс_ПотребностьКомплектов.Записывать = Истина; 	
	Для каждого Строка Из Комплекты Цикл 
		
		Движение = Движения.вмс_ПотребностьКомплектов.Добавить();  
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ДокументПотребности = ДокументОснование;
		Движение.Комплект = Строка.Товар;
		Движение.Характеристика = Строка.ХарактеристикаТовара;
		Движение.Потребность = Строка.Количество;
		
	КонецЦикла; 
	
КонецПроцедуры
