
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсточникДанных = Параметры.ПолеИсточник;
	Поле = Параметры.ПолеПриемник;
		
	ЗаполнитьСтруктуруДокумента(Параметры.Источник, СтруктураИсточника, Элементы.СтруктураИсточникаИмяОбъекта);
	ЗаполнитьСтруктуруДокумента(Параметры.Приемник, СтруктураПриемника, Элементы.СтруктураПриемникаИмяОбъекта);  
	
	
	Выражение = Параметры.СохраненноеВыражение;	
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	Закрыть(Выражение);
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	ПроверитьНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьНаСервере()
	
	МетаданныеИсточника =  Метаданные.НайтиПоПолномуИмени(Параметры.Источник.ТипДокумента); 
	
	Если  МетаданныеИсточника <> Неопределено Тогда
		
		Источник= Документы[Метаданные.НайтиПоПолномуИмени(Параметры.Источник.ТипДокумента).Имя].СоздатьДокумент(); 
		Источник.Заполнить(Неопределено);  
		
		Если Параметры.Источник.ИмяТабличнойЧасти <> "" Тогда   
			
			Если Параметры.Источник.ИмяТабличнойЧасти  <> "ТоварТСД" Тогда
			
				ТеущаяСтрокаИсточника = Источник[Параметры.Источник.ИмяТабличнойЧасти ].Добавить();	
				
			Иначе
				
				Отбор = Новый Структура("ДокументОснование, ВидОперации", Неопределено, Неопределено);  
				ПустаяТаблицаИсточника = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру(Отбор);
				
				ТеущаяСтрокаИсточника = ПустаяТаблицаИсточника.Добавить();	
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;  
	
	
	МетаданныеПриемника =   Метаданные.НайтиПоПолномуИмени(Параметры.Приемник.ТипДокумента); 
	
	Если  МетаданныеПриемника <> Неопределено Тогда
		
		Приемник =  Документы[Метаданные.НайтиПоПолномуИмени(Параметры.Приемник.ТипДокумента).Имя].СоздатьДокумент();
		Приемник.Заполнить(Неопределено);  
		
		Если Параметры.Приемник.ИмяТабличнойЧасти <> "" Тогда
			
			ТеущаяСтрокаПриемника = Приемник[Параметры.Приемник.ИмяТабличнойЧасти ].Добавить();
			
		КонецЕсли;
		
	КонецЕсли;  
	
	Попытка
		
		Выполнить(Выражение); 
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Результат: %1 " + Символы.ПС + "Выражение выполнилось без ошибок",Вычислить(Поле)));   
		
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры      

&НаСервере
Процедура ЗаполнитьСтруктуруДокумента(Параметр, ДреровоЗначений, ЭлементФормыИмяКолонки)
	
	СтрокиДерева = ДреровоЗначений.ПолучитьЭлементы(); 
	
	ЭлементФормыИмяКолонки.Заголовок = Параметр.ТипДокумента;
	
	Шапка = СтрокиДерева.Добавить();  
	
	Если ДреровоЗначений = СтруктураИсточника Тогда
		Шапка.ИмяОбъекта = "Источник";   
	Иначе
		Шапка.ИмяОбъекта = "Приемник"; 
	КонецЕсли;
	
	РеквизитыШапки = Шапка.ПолучитьЭлементы();
	
	Для каждого  Реквизит Из Параметр.РеквизитыШапки  Цикл
	
		НоваяСтрока = РеквизитыШапки.Добавить();
		НоваяСтрока.ИмяОбъекта = Реквизит.Имя;
	
	КонецЦикла;     
	
	Если Параметр.КлолнкиТабличнойЧасти.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Таблица = СтрокиДерева.Добавить();	            
	
	Если ДреровоЗначений = СтруктураИсточника Тогда
		Таблица.ИмяОбъекта = "ТеущаяСтрокаИсточника";   
	Иначе
		Таблица.ИмяОбъекта= "ТеущаяСтрокаПриемника"; 
	КонецЕсли;
	
	КолонкиТаблицы = Таблица.ПолучитьЭлементы();
	
	Для каждого  Реквизит Из Параметр.КлолнкиТабличнойЧасти  Цикл
	
		НоваяСтрока = КолонкиТаблицы.Добавить();
		НоваяСтрока.ИмяОбъекта = Реквизит.Имя;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураИсточника1НачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ИмяРеквизита = ЭтотОбъект[Элемент.Имя].НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение); 
	РодительРеквизита = ИмяРеквизита.ПолучитьРодителя();
	
	ПутьРеквизита = ?(РодительРеквизита = Неопределено, "",  (РодительРеквизита.ИмяОбъекта + ".")) + ИмяРеквизита.ИмяОбъекта; 
	
	ПараметрыПеретаскивания.Значение = ПутьРеквизита;  
	
КонецПроцедуры

