
Процедура ОбработкаОтветаНаВопросОтменаОперации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.ФормаКлиент;
	Если Не Форма.Открыта() Тогда
		Возврат;
	КонецЕсли; 
	
	Объект = ДополнительныеПараметры.Объект;
	вмс_ОбщегоНазначенияКлиент.УстановитьПометкуУдаленияОбъекта(Объект);
	Попытка
		Форма.Прочитать();
	Исключение
		
	КонецПопытки;
	Форма.Закрыть();
	
КонецПроцедуры

Функция УстановитьПометкуГотовДокумента(Объект) Экспорт
	вмс_ОперацииПоЯчейкамВызовСервера.УстановитьПометкуГотовДокумента(Объект.Ссылка);
	Если ТипЗнч(Объект) = Тип("Структура") Тогда
		// квази объект
		Объект.Вставить("Готов", Истина);
	КонецЕсли; 
КонецФункции
