
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	НаборДополнительныхРеквизитов = Справочники.вмс_НаборыДополнительныхРеквизитов.НайтиНаборПоВладельцу(ТекущийОбъект.Ссылка);
	ТаблицаДополнительныхРеквизитов.Загрузить(ПолучитьСписокРеквизитовНабора(НаборДополнительныхРеквизитов));
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокРеквизитовНабора(Набор)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_НаборыДополнительныхРеквизитовДополнительныеРеквизиты.Свойство КАК Реквизит
	|ИЗ
	|	Справочник.вмс_НаборыДополнительныхРеквизитов.ДополнительныеРеквизиты КАК вмс_НаборыДополнительныхРеквизитовДополнительныеРеквизиты
	|ГДЕ
	|	вмс_НаборыДополнительныхРеквизитовДополнительныеРеквизиты.Ссылка = &Набор
	|
	|УПОРЯДОЧИТЬ ПО
	|	вмс_НаборыДополнительныхРеквизитовДополнительныеРеквизиты.НомерСтроки";
	Запрос.УстановитьПараметр("Набор", Набор);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРеквизитов = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаРеквизитов;
	
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если НаборДополнительныхРеквизитов = Неопределено Тогда
		Если ТаблицаДополнительныхРеквизитов.Количество() > 0 Тогда
			НаборДополнительныхРеквизитов = НовыйНаборДополнительныхРеквизитов(ТекущийОбъект, ТаблицаДополнительныхРеквизитов);
		КонецЕсли;
	Иначе
		НаборОбъект = НаборДополнительныхРеквизитов.ПолучитьОбъект();
		ЗаполнитьНаборДополнительныхРеквизитов(НаборОбъект, ТекущийОбъект, ТаблицаДополнительныхРеквизитов);
		НаборОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НовыйНаборДополнительныхРеквизитов(Владелец, ТаблицаДополнительныхРеквизитов)

	НаборОбъект = Справочники.вмс_НаборыДополнительныхРеквизитов.СоздатьЭлемент();
	НаборОбъект.Заполнить(Неопределено);
	СтрокаВладельца = НаборОбъект.Владельцы.Добавить();
	СтрокаВладельца.Владелец = Владелец.Ссылка;
	
	ЗаполнитьНаборДополнительныхРеквизитов(НаборОбъект, Владелец, ТаблицаДополнительныхРеквизитов);
	
	НаборОбъект.Записать();

КонецФункции

&НаСервере
Функция ЗаполнитьНаборДополнительныхРеквизитов(НаборОбъект, Владелец, ТаблицаДополнительныхРеквизитов)
	
	МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Владелец));
	НаборОбъект.Наименование = МетаданныеОбъекта.Синоним + " """ + Владелец.Наименование + """";
	НаборОбъект.ДополнительныеРеквизиты.Очистить();
	Для Каждого СтрокаДополнительногоРеквизита Из ТаблицаДополнительныхРеквизитов Цикл
		СтрокаДополнительногоРеквизитаНабора = НаборОбъект.ДополнительныеРеквизиты.Добавить();
		СтрокаДополнительногоРеквизитаНабора.Свойство = СтрокаДополнительногоРеквизита.Реквизит;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаДополнительныхРеквизитовПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
