Функция ПолучитьДанныеИзБД(Запрос, ДополнительныеПараметры=Неопределено) Экспорт
	
	Перем РК, ОЯ, ПУ;
	
	РК = вмс_РаботаСКоллекциями;
	ОЯ = вмс_ОперацииПоЯчейкамСервер;
	ПУ = вмс_ПартионныйУчетСервер;
	
	Если ТипЗнч(ДополнительныеПараметры)=Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ДокументОперации") Тогда
			ДокументОперации = ДополнительныеПараметры.ДокументОперации;
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("Дата") Тогда
			Дата = ДополнительныеПараметры.Дата;
		КонецЕсли;
	КонецЕсли;
	
	Если РК.ЭтоКвазиТаблицаЗначений(Запрос.ТаблицаЗапросаОстатковТоваровВЯчейках) Тогда
		Запрос.ТаблицаЗапросаОстатковТоваровВЯчейках = РК.ВыгрузитьКвазиТаблицуЗначенийВИстиннуюТаблицуЗначений(Запрос.ТаблицаЗапросаОстатковТоваровВЯчейках);
		РК.ТипизироватьТаблицуЗначений(Запрос.ТаблицаЗапросаОстатковТоваровВЯчейках);

		Запрос.ТаблицаЗапросаОстатковКонтейнеровВЯчейках = РК.ВыгрузитьКвазиТаблицуЗначенийВИстиннуюТаблицуЗначений(Запрос.ТаблицаЗапросаОстатковКонтейнеровВЯчейках);
		РК.ТипизироватьТаблицуЗначений(Запрос.ТаблицаЗапросаОстатковКонтейнеровВЯчейках);

		Запрос.ТаблицаЗапросаОстатковТоваровВКонтейнерах = РК.ВыгрузитьКвазиТаблицуЗначенийВИстиннуюТаблицуЗначений(Запрос.ТаблицаЗапросаОстатковТоваровВКонтейнерах);
		РК.ТипизироватьТаблицуЗначений(Запрос.ТаблицаЗапросаОстатковТоваровВКонтейнерах);

		Запрос.ТаблицаЗапросаМестоположенийКонтейнеров = РК.ВыгрузитьКвазиТаблицуЗначенийВИстиннуюТаблицуЗначений(Запрос.ТаблицаЗапросаМестоположенийКонтейнеров);
		РК.ТипизироватьТаблицуЗначений(Запрос.ТаблицаЗапросаМестоположенийКонтейнеров);
	КонецЕсли;

	МассивКонтейнеров = Новый Массив;
	РК.ДобавитьЭлементыКоллекции(МассивКонтейнеров, РК.ВыгрузитьЗначенияКолонкиКоллекции(Запрос.ТаблицаЗапросаМестоположенийКонтейнеров, "Контейнер"));
	РК.ДобавитьЭлементыКоллекции(МассивКонтейнеров, РК.ВыгрузитьЗначенияКолонкиКоллекции(Запрос.ТаблицаЗапросаОстатковКонтейнеровВЯчейках, "Контейнер"));
	ДополнительныеПараметрыПолученияМестоположенийКонтейнеров = Новый Структура;
	ДополнительныеПараметрыПолученияМестоположенийКонтейнеров.Вставить("ИсключитьРегистраторы", ДокументОперации);
	ДополнительныеПараметрыПолученияМестоположенийКонтейнеров.Вставить("Дата", Дата);
	ТаблицаМестоположенийКонтейнеров = ПУ.ПолучитьМестоположенияКонтейнеров(МассивКонтейнеров, ДополнительныеПараметрыПолученияМестоположенийКонтейнеров);

	ТаблицаЗапросаОстатковТоваровВЯчейках = Запрос.ТаблицаЗапросаОстатковТоваровВЯчейках.Скопировать();
	РК.ДобавитьЭлементыКоллекции(ТаблицаЗапросаОстатковТоваровВЯчейках, Запрос.ТаблицаЗапросаОстатковКонтейнеровВЯчейках);
	ТаблицаОстатковТоваровВЯчейках = ПолучитьТаблицуОстатковВЯчейках(ТаблицаЗапросаОстатковТоваровВЯчейках, ДополнительныеПараметры);
	
	ТаблицаОстатковТоваровВКонтейнерах = ПолучитьТаблицуОстатковВКонтейнерах(Запрос.ТаблицаЗапросаОстатковТоваровВКонтейнерах, ДополнительныеПараметры);
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаОстатковТоваровВЯчейках", ТаблицаОстатковТоваровВЯчейках);
	Результат.Вставить("ТаблицаМестоположенийКонтейнеров", ТаблицаМестоположенийКонтейнеров);
	Результат.Вставить("ТаблицаОстатковТоваровВКонтейнерах", ТаблицаОстатковТоваровВКонтейнерах);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуОстатковВЯчейках(ОбщаяТаблицаЗапроса, ДополнительныеПараметры)
	
	РК = вмс_РаботаСКоллекциями;
	ОЯ = вмс_ОперацииПоЯчейкамСервер;

	ПараметрыПолученияОстатков = Новый Структура;
	ПараметрыПолученияОстатков.Вставить("ИспользуемыеПоля", "Контейнер");
	Если ТипЗнч(ДополнительныеПараметры)=Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ДокументОперации") Тогда
			ПараметрыПолученияОстатков.Вставить("ТекущиеДокументы", ДополнительныеПараметры.ДокументОперации);
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("Дата") Тогда
			ПараметрыПолученияОстатков.Вставить("Дата", ДополнительныеПараметры.Дата);
		КонецЕсли;
	КонецЕсли;

	ТаблицыЗапроса = ПолучитьТаблицыЗапросаОстатковБезПустыхКолонок(ОбщаяТаблицаЗапроса, "Товар, Ячейка, Контейнер");
	
	ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля();
	РК.ВычестьМассив(ТоварныеПоляМассив, "Упаковка");

	СписокКолонокМассив = Новый Массив;
	РК.ДобавитьЭлементыКоллекции(СписокКолонокМассив, ТоварныеПоляМассив);
	РК.ДобавитьЭлементыКоллекции(СписокКолонокМассив, "Ячейка, Контейнер, Количество");

	ОбщаяТаблицаОстатковТоваровВЯчейках = РК.НоваяТаблицаЗначений(СписокКолонокМассив);
	Для Каждого ТаблицаЗапроса Из ТаблицыЗапроса Цикл
		Если ТаблицаЗапроса.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыПолученияОстатков.Вставить("Товары", ТаблицаЗапроса);
		ТаблицаОстатковТоваровВЯчейках = ОЯ.ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ПараметрыПолученияОстатков);
		РК.ДобавитьЭлементыКоллекции(ОбщаяТаблицаОстатковТоваровВЯчейках, ТаблицаОстатковТоваровВЯчейках);
	КонецЦикла;
	
	Возврат ОбщаяТаблицаОстатковТоваровВЯчейках;
	
КонецФункции

Функция ПолучитьТаблицуОстатковВКонтейнерах(ОбщаяТаблицаЗапроса, ДополнительныеПараметры)

	РК = вмс_РаботаСКоллекциями;
	ПУ = вмс_ПартионныйУчетСервер;

	Контейнеры = РК.ВыгрузитьЗначенияКолонкиКоллекции(ОбщаяТаблицаЗапроса, "Контейнер");
	
	ДополнительныеПараметрыПолученияСостава = Новый Структура;
	Если ТипЗнч(ДополнительныеПараметры)=Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ДокументОперации") Тогда
			ДополнительныеПараметрыПолученияСостава.Вставить("ТекущиеДокументы", ДополнительныеПараметры.ДокументОперации);
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("Дата") Тогда
			ДополнительныеПараметрыПолученияСостава.Вставить("Дата", ДополнительныеПараметры.Дата);
		КонецЕсли;
	КонецЕсли;
	
	ОбщаяТаблицаОстатковТоваровВКонтейнерах = ПУ.ПолучитьТаблицуСоставаПоКонтейнерам(Контейнеры, ДополнительныеПараметрыПолученияСостава);
	
	Если РК.ЭтоТаблицаЗначений(ОбщаяТаблицаОстатковТоваровВКонтейнерах) ИЛИ РК.ЭтоКвазиТаблицаЗначений(ОбщаяТаблицаОстатковТоваровВКонтейнерах) Тогда
		ОбщаяТаблицаОстатковТоваровВКонтейнерах.Колонки.КоличествоОстаток.Имя = "Количество";
		Возврат ОбщаяТаблицаОстатковТоваровВКонтейнерах;
	КонецЕсли;
	
	// ОЯ = вмс_ОперацииПоЯчейкамСервер;

	//Если ТипЗнч(ДополнительныеПараметры)=Тип("Структура") Тогда
	//	Если ДополнительныеПараметры.Свойство("ДокументОперации") Тогда
	//		ДокументОперации = ДополнительныеПараметры.ДокументОперации;
	//	КонецЕсли;
	//КонецЕсли;

	//ТаблицыЗапроса = ПолучитьТаблицыЗапросаОстатковБезПустыхКолонок(ОбщаяТаблицаЗапроса, "Товар, Контейнер");

	//ПараметрыПолученияОстатков = Новый Структура;
	//ПараметрыПолученияОстатков.Вставить("ИспользуемыеПоля", "Контейнер");
	//ПараметрыПолученияОстатков.Вставить("ТекущиеДокументы", ДокументОперации);
	//
	//ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля();
	//РК.ВычестьМассив(ТоварныеПоляМассив, "Упаковка");

	//СписокКолонокМассив = Новый Массив;
	//РК.ДобавитьЭлементыКоллекции(СписокКолонокМассив, ТоварныеПоляМассив);
	//РК.ДобавитьЭлементыКоллекции(СписокКолонокМассив, "Контейнер, Количество");

	//ОбщаяТаблицаОстатковТоваровВЯчейках = РК.НоваяТаблицаЗначений(СписокКолонокМассив);
	//Для Каждого ТаблицаЗапроса Из ТаблицыЗапроса Цикл
	//	Если ТаблицаЗапроса.Количество()=0 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	ПараметрыПолученияОстатков.Вставить("Товары", ТаблицаЗапроса);
	//	ТаблицаОстатковТоваровВЯчейках = ОЯ.ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ПараметрыПолученияОстатков);
	//	РК.ДобавитьЭлементыКоллекции(ОбщаяТаблицаОстатковТоваровВЯчейках, ТаблицаОстатковТоваровВЯчейках);
	//КонецЦикла;
	//
	//Возврат ОбщаяТаблицаОстатковТоваровВЯчейках;
	
КонецФункции

Функция ПолучитьТаблицыЗапросаОстатковБезПустыхКолонок(ОбщаяТаблицаЗапроса, ПоляСПустымиЗначениями)

	РК = вмс_РаботаСКоллекциями;
	
	ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля();
	РК.ВычестьМассив(ТоварныеПоляМассив, "Упаковка");

	ПустойТовар = вмс_ОбщегоНазначенияВызовСервера.ПолучитьПустуюСсылкуНаТовар();
	ПустаяЯчейка = ПредопределенноеЗначение("Справочник.вмс_МестаХранения.ПустаяСсылка");
	ПустойКонтейнер = ПредопределенноеЗначение("Справочник.вмс_Контейнеры.ПустаяСсылка");

	ПустыеЗначенияПолей = Новый Соответствие;
	ПустыеЗначенияПолей["Ячейка"] = ПустаяЯчейка;
	ПустыеЗначенияПолей["Товар"] = ПустойТовар;
	ПустыеЗначенияПолей["Контейнер"] = Неопределено;
	
	ПоляСПустымиЗначениямиМассив = РК.ЗначениеВМассив(ПоляСПустымиЗначениями, , Ложь);
	
	КоличествоПолейСПустымиЗначениями = ПоляСПустымиЗначениямиМассив.Количество();
	КоличествоКомбинаций = pow(2, КоличествоПолейСПустымиЗначениями)-1;
	
	ТаблицыЗапроса = Новый Массив;
	Для НомерКомбинации=0 По КоличествоКомбинаций-1 Цикл
		СписокКолонокМассив = Новый Массив;
		Разряды = РК.РазложитьЧислоНаРазряды(НомерКомбинации, 2, КоличествоПолейСПустымиЗначениями);
		Для НомерПоля=0 По КоличествоПолейСПустымиЗначениями-1 Цикл
			Если Разряды[НомерПоля]=0 Тогда
				Поле = ПоляСПустымиЗначениямиМассив[НомерПоля];
				Если Поле="Товар" Тогда
					// добавим товар со всеми товарными полями
					РК.ДобавитьЭлементыКоллекции(СписокКолонокМассив, ТоварныеПоляМассив);
				Иначе
					СписокКолонокМассив.Добавить(Поле);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		СписокКолонок = РК.МассивВСтроку(СписокКолонокМассив);
		ТаблицаЗапроса = ОбщаяТаблицаЗапроса.СкопироватьКолонки(СписокКолонок);
		ТаблицыЗапроса.Добавить(ТаблицаЗапроса);
	КонецЦикла;
	
	Для Каждого СтрокаЗапроса Из ОбщаяТаблицаЗапроса Цикл
		
		НомерКомбинации = 0;
		МножительРазряда = 1;
		Для НомерПоля=0 По КоличествоПолейСПустымиЗначениями-1 Цикл
			Поле = ПоляСПустымиЗначениямиМассив[НомерПоля];
			Если СтрокаЗапроса[Поле]=ПустыеЗначенияПолей[Поле] Тогда
				НомерКомбинации = НомерКомбинации + МножительРазряда;
			КонецЕсли;
			МножительРазряда = МножительРазряда * 2;
		КонецЦикла;
		
		Если НомерКомбинации > КоличествоКомбинаций-1 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаЗапроса = ТаблицыЗапроса[НомерКомбинации].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаЗапроса, СтрокаЗапроса);
		
	КонецЦикла;
	
	Возврат ТаблицыЗапроса;
	
КонецФункции
