
Функция ВывестиКоманды(Форма, Команды) Экспорт
	
	Для Каждого Команда Из Команды Цикл
		
		Панель = Форма.Элементы.Найти(Команда.Подменю);
		Если Панель = Неопределено Тогда
			Панель = Форма.КоманднаяПанель;
		КонецЕсли;

		Если Команда.Вид="Подменю" Тогда
			Подменю = Форма.Элементы.Добавить(Команда.ИмяВФорме, Тип("ГруппаФормы"), Панель);
			Подменю.Заголовок = Команда.Представление;
			Если Команда.Картинка <> Неопределено Тогда
				Подменю.Картинка = Команда.Картинка;
				Если Команда.Представление <> "" Тогда
					Подменю.Отображение = ОтображениеКнопки.КартинкаИТекст;
				Иначе
					Подменю.Отображение = ОтображениеКнопки.Картинка;
				КонецЕсли;
			КонецЕсли;
		Иначе
			НоваяКоманда = Форма.Команды.Добавить(Команда.ИмяВФорме);
			НоваяКоманда.Действие = "Подключаемый_ВыполнитьКоманду";
			Если Команда.Представление <> "" Тогда
				НоваяКоманда.Заголовок = Команда.Представление;
			КонецЕсли;
			
			НоваяКнопка = Форма.Элементы.Добавить(Команда.ИмяВФорме, Тип("КнопкаФормы"), Панель);
			Если Команда.Картинка <> Неопределено Тогда
				НоваяКнопка.Картинка = Команда.Картинка;
				Если Команда.Представление <> "" Тогда
					НоваяКнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
				Иначе
					НоваяКнопка.Отображение = ОтображениеКнопки.Картинка;
				КонецЕсли;
			КонецЕсли;
			НоваяКнопка.ИмяКоманды = НоваяКоманда.Имя;
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Истина;
	
КонецФункции
