&НаСервере
Перем Переменные Экспорт;

&НаКлиенте
Перем Переменные Экспорт;

//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

&НаКлиентеНаСервереБезКонтекста
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьОбщиеМодули()
	
	ОбщиеМодули = Новый Соответствие;
	
	ИменаМодулей = Новый Массив;
	ИменаМодулей.Добавить("РаботаСКоллекциями");
	ИменаМодулей.Добавить("РаботаСФормамиКлиентСервер");
	ИменаМодулей.Добавить("РаботаСФормамиСервер");
	ИменаМодулей.Добавить("РаботаСXMLКлиентСервер");
	ИменаМодулей.Добавить("РаботаСXMLСервер");
	
	Для Каждого ИмяМодуля Из ИменаМодулей Цикл
		ОбщиеМодули[ИмяМодуля] = глОбщийМодуль(ИмяМодуля);
	КонецЦикла;
	
	Возврат ОбщиеМодули;
	
КонецФункции

&НаКлиенте
Функция Инициализация() Экспорт
	
	ОбщиеМодули = ПолучитьОбщиеМодули();
	
	Переменные.Вставить("ДополнительныеСвойстваКоманд", Новый Соответствие);
	Переменные.Вставить("ДополнительныеСвойстваФормы", Новый Соответствие);
	Переменные.Вставить("ДополнительныеСвойстваЭлементов", Новый Соответствие);
	Переменные.Вставить("ОбщиеМодули", ОбщиеМодули);
	Переменные.Вставить("ПроцессорКода", вмс_ВыполнениеПрограммногоКода.ГлобальныйПроцессорКода());
	
КонецФункции

&НаКлиенте
Функция ЗагрузитьИзОписанияФормы(знач ОписаниеФормы) Экспорт
	
	Перем РК, РаботаСXMLКлиентСервер;
	
	Инициализация();
	
	РК = Переменные.ОбщиеМодули["РаботаСКоллекциями"];
	РаботаСXMLКлиентСервер = Переменные.ОбщиеМодули["РаботаСXMLКлиентСервер"];
	
	Если ТипЗнч(ОписаниеФормы)=Тип("Строка") Тогда
		ТекстОписанияФормы = ОписаниеФормы;
		ОписаниеФормы = РаботаСXMLКлиентСервер.ПрочитатьТекстXMLУлучшенная(ТекстОписанияФормы);
	Иначе
		ТекстОписанияФормы = РаботаСXMLКлиентСервер.XMLСтрокаИзЗначенияУлучшенная(ОписаниеФормы);
	КонецЕсли;
	
	ЗагрузитьДополнительныеСвойстваЭлементов(ОписаниеФормы);
	
	ЗагрузитьИзОписанияФормыНаСервере(ТекстОписанияФормы);

	ВызовОбработчикаСобытияЭлемента(ЭтаФорма, "ПриСозданииНаСервере", Ложь, Истина);
	
КонецФункции

&НаКлиенте
Функция ЗагрузитьДополнительныеСвойстваЭлементов(ОписаниеФормы)
	
	РК = Переменные.ОбщиеМодули["РаботаСКоллекциями"];
	
	МассивОписанийЭлементов = РК.СкопироватьОбъект(ОписаниеФормы.Элементы);
	МассивОписанийЭлементов.Добавить(ОписаниеФормы);
	Для Каждого ОписаниеЭлемента Из МассивОписанийЭлементов Цикл
		СобытияЭлемента = Новый Соответствие;
		Для Каждого СобытиеЭлемента Из ОписаниеЭлемента.События Цикл
			Если ЗначениеЗаполнено(СобытиеЭлемента.Значение) Тогда
				СобытияЭлемента[СобытиеЭлемента.Ключ] = ВРЕГ(СобытиеЭлемента.Значение);
			КонецЕсли;
		КонецЦикла;
		
		ДополнительныеСвойстваЭлемента = Новый Соответствие;
		ДополнительныеСвойстваЭлемента["События"] = СобытияЭлемента;
		Если ОписаниеЭлемента=ОписаниеФормы Тогда
			Переменные.ДополнительныеСвойстваФормы = ДополнительныеСвойстваЭлемента;
		Иначе
			Переменные.ДополнительныеСвойстваЭлементов[ОписаниеЭлемента.ИмяЭлемента] = ДополнительныеСвойстваЭлемента;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОписаниеКоманды Из ОписаниеФормы.Команды Цикл
		ОписаниеСобытийКоманды = Новый Соответствие;
		ОписаниеСобытийКоманды["ОбработкаДействияКоманды"] = ВРЕГ(ОписаниеКоманды.Действие);
		
		ДополнительныеСвойстваКоманды = Новый Соответствие;
		ДополнительныеСвойстваКоманды["События"] = ОписаниеСобытийКоманды;
		Переменные.ДополнительныеСвойстваКоманд[ОписаниеКоманды.Имя] = ДополнительныеСвойстваКоманды;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ЗагрузитьИзОписанияФормыНаСервере(ТекстОписанияФормы)

	Перем РаботаСXMLКлиентСервер;
	
	РаботаСXMLКлиентСервер = глОбщийМодуль("РаботаСXMLКлиентСервер");
	ОписаниеФормы = РаботаСXMLКлиентСервер.ПрочитатьТекстXMLУлучшенная(ТекстОписанияФормы);
	
	вмс_КонструкторФормСервер.СоздатьЭлементыФормы(ЭтаФорма, ОписаниеФормы);
	
	ЭтаФорма.АвтоЗаголовок = Ложь; //не нужон
	
	Для Каждого СобытиеФормы Из ОписаниеФормы.События Цикл
		ИмяСобытия = СобытиеФормы.Ключ;
		ИмяОбработчика = ИмяСобытия;
		Попытка
			ЭтаФорма.УстановитьДействие(ИмяСобытия, ИмяОбработчика);
		Исключение
			ТочкаОстановы = 0;
		КонецПопытки;
	КонецЦикла;

	Для Каждого ОписаниеЭлемента Из ОписаниеФормы.Элементы Цикл
		ЭлементФормы = Элементы.Найти(ОписаниеЭлемента.ИмяЭлемента);
		Для Каждого СобытиеЭлемента Из ОписаниеЭлемента.События Цикл
			ИмяСобытия = СобытиеЭлемента.Ключ;
			ИмяОбработчика = "ОбработчикСобытияЭлемента_" + ИмяСобытия;
			Попытка
				ЭлементФормы.УстановитьДействие(ИмяСобытия, ИмяОбработчика);
			Исключение
				ТочкаОстановы = 0;
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;

	Для Каждого ОписаниеКоманды Из ОписаниеФормы.Команды Цикл
		КомандаФормы = Команды.Найти(ОписаниеКоманды.Имя);
		КомандаФормы.Действие = "ОбработкаДействияКоманды";
	КонецЦикла;

КонецФункции

&НаКлиенте
Функция УстановитьЗначениеДополнительногоСвойстваЭлемента(Элемент, ИмяСвойства, ЗначениеСвойства)
	
	ПолучитьДополнительныеСвойстваЭлемента(Элемент)[ИмяСвойства] = ЗначениеСвойства;

КонецФункции

&НаКлиенте
Функция ПолучитьЗначениеДополнительногоСвойстваЭлемента(Элемент, ИмяСвойства)
	
	Возврат ПолучитьДополнительныеСвойстваЭлемента(Элемент)[ИмяСвойства];
	
КонецФункции

&НаКлиенте
Функция ПолучитьДополнительныеСвойстваЭлемента(Элемент)

	Если ТипЗнч(Элемент) = Тип("Строка") Тогда
		ИмяЭлемента = Элемент;
		ДополнительныеСвойства = Переменные.ДополнительныеСвойстваЭлементов;
	Иначе
		Если Элемент = ЭтаФорма Тогда
			Возврат Переменные.ДополнительныеСвойстваФормы;
		КонецЕсли;
		
		ИмяЭлемента = Элемент.Имя;
		Если ТипЗнч(Элемент) = Тип("КомандаФормы") Тогда
			ДополнительныеСвойства = Переменные.ДополнительныеСвойстваКоманд;
		Иначе
			ДополнительныеСвойства = Переменные.ДополнительныеСвойстваЭлементов;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойстваЭлемента = ДополнительныеСвойства[ИмяЭлемента];
	Если ДополнительныеСвойстваЭлемента = Неопределено Тогда
		ДополнительныеСвойстваЭлемента = Новый Соответствие;
		ДополнительныеСвойства[ИмяЭлемента] = ДополнительныеСвойстваЭлемента;
	КонецЕсли;
	
	Возврат ДополнительныеСвойстваЭлемента;
	
КонецФункции

&НаСервере
Функция ПолучитьДополнительныеСвойстваЭлементаНаСервере(Элемент)

	Если Элемент = ЭтаФорма Тогда
		Возврат ЭтаФорма.ДанныеДляРаботыНаСервере.ДополнительныеСвойстваФормы;
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ОбработатьСозданиеНовыхКоманд()

	НовыеКоманды = Переменные.ДанныеДляРаботыНаСервере.НовыеКоманды;
	Если НовыеКоманды.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ИмяКоманды Из НовыеКоманды Цикл
		
		Команда = Команды[ИмяКоманды];
		
		СобытияКоманды = Новый Соответствие;
		СобытияКоманды["ОбработкаДействияКоманды"] = Команда.Действие;

		ДополнительныеСвойстваКоманды = Новый Соответствие;
		ДополнительныеСвойстваКоманды["События"] = СобытияКоманды;
		
		Переменные.ДополнительныеСвойстваКоманд[Команда.Имя] = ДополнительныеСвойстваКоманды;
		
	КонецЦикла;
	
	ОбработатьСозданиеНовыхКомандНаСервере(НовыеКоманды);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОбработатьСозданиеНовыхКомандНаСервере(НовыеКоманды)
	
	Для Каждого ИмяКоманды Из НовыеКоманды Цикл
		
		Команда = Команды[ИмяКоманды];
		Команда.Действие = "ОбработкаДействияКоманды";
		
	КонецЦикла;
	
КонецФункции

//***********************************************************************************************************
// { Обработчики событий+

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВызовОбработчикаСобытияЭлемента(ЭтаФорма, "ПриОткрытии", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="Кто здесь?" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Я здесь, " + ИмяФормы);
	КонецЕсли;
	
	ВызовОбработчикаСобытияЭлемента(ЭтаФорма, "ОбработкаОповещения", ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ВызовОбработчикаСобытияЭлемента(ЭтаФорма, "ПередЗакрытием", Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ВызовОбработчикаСобытияЭлемента(ЭтаФорма, "ПриЗакрытии", ЗавершениеРаботы);
	Переменные.КлассноеРасширение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДействияКоманды(Команда)
	
	ВызовОбработчикаСобытияЭлемента(Команда, "ОбработкаДействияКоманды", Команда);
	
КонецПроцедуры

// ТУ_Васильев 20.05.25 ++
&НаКлиенте
Процедура ОбработчикСобытияЭлемента_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВызовОбработчикаСобытияЭлемента(Элемент, "Выбор", Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработчикСобытияЭлемента_ПриИзменении(Элемент)

	ВызовОбработчикаСобытияЭлемента(Элемент, "ПриИзменении", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСобытияЭлемента_ПриСменеСтраницы(Элемент, ТекущаяСтраница)

	ВызовОбработчикаСобытияЭлемента(Элемент, "ПриСменеСтраницы", Элемент, ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСобытияЭлемента_ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	ВызовОбработчикаСобытияЭлемента(Элемент, "ОбработкаНавигационнойСсылки", Элемент, НавигационнаяСсылка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Функция ВызовОбработчикаСобытияЭлемента(Элемент, ИмяСобытия, Параметр1="ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162", Параметр2="ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162", Параметр3="ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162", Параметр4="ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162")
	
	ОбработчикСобытия = ПолучитьОбработчикСобытияЭлемента(Элемент, ИмяСобытия);
	Если ОбработчикСобытия=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = вмс_ВыполнениеПрограммногоКода.ВызовПодпрограммы(ЭтаФорма, , ОбработчикСобытия, Переменные.ПроцессорКода, Параметр1, Параметр2, Параметр3, Параметр4);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОбработчикСобытияЭлемента(Элемент, ИмяСобытия)

	Перем ДополнительныеСвойстваЭлемента;
	
	ДополнительныеСвойстваЭлемента = ПолучитьДополнительныеСвойстваЭлемента(Элемент);
	
	СвойстваСобытий = ДополнительныеСвойстваЭлемента["События"];
	Если СвойстваСобытий = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СвойстваСобытий[ИмяСобытия];
	
КонецФункции

&НаКлиенте
Функция ОбработчикОповещенияСОднимПараметром(ДополнительныеПараметрыСОО) Экспорт
	
	вмс_ВыполнениеПрограммногоКода.ВызовПодпрограммы(ДополнительныеПараметрыСОО.Модуль, ДополнительныеПараметрыСОО.ИмяКласса, ДополнительныеПараметрыСОО.ИмяОбработчика,  ДополнительныеПараметрыСОО.ПроцессорКода, ДополнительныеПараметрыСОО.ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Функция ОбработчикОповещенияСДвумяПараметрами(Результат, ДополнительныеПараметрыСОО) Экспорт

	вмс_ВыполнениеПрограммногоКода.ВызовПодпрограммы(ДополнительныеПараметрыСОО.Модуль, ДополнительныеПараметрыСОО.ИмяКласса, ДополнительныеПараметрыСОО.ИмяОбработчика,  ДополнительныеПараметрыСОО.ПроцессорКода, Результат, ДополнительныеПараметрыСОО.ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Функция ПодключитьОбработчикОжиданияПереопределенная(ИмяПроцедуры, Интервал, Однократно=Ложь)
	
	вмс_ВыполнениеПрограммногоКода.ПроцессорКода_ПодключитьОбработчикОжидания(Переменные.ПроцессорКода, ИмяПроцедуры, Интервал, Однократно);
	ОбработчикОжидания();
	
КонецФункции

&НаКлиенте
Функция ОтключитьОбработчикОжиданияПереопределенная(ИмяПроцедуры)
	
	вмс_ВыполнениеПрограммногоКода.ПроцессорКода_ОтключитьОбработчикОжидания(Переменные.ПроцессорКода, ИмяПроцедуры);
	
КонецФункции

&НаКлиенте
Функция ОбработчикОжидания()
	
	ПроцессорКода = Переменные.ПроцессорКода;
	
	ОтработанныеОбработчикиОжидания = вмс_ВыполнениеПрограммногоКода.ПроцессорКода_ОбработкаОжидания(ПроцессорКода);
	
	Для Каждого ОтработанныйОбработчикОжидания Из ОтработанныеОбработчикиОжидания Цикл
		
		//ВызовПодпрограммыНаКлиенте(ОтработанныйОбработчикОжидания.ИмяПроцедуры);
		
	КонецЦикла;
	
	ПодключитьОбработчикОжидания("ОбработчикОжидания", 0.1, Истина);
	
КонецФункции

// { Обработчики событий-
//***********************************************************************************************************

#Область УниверсальныеСлужебныеФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, Неопределено);
	
КонецПроцедуры

// Для того, чтобы получить серверную форму, например, для добавления новых элементов формы
&НаСервере
Функция СлужебнаяФункцияВызовСервера(знач ПрограммныйКод, знач ДополнительныеПараметры=Неопределено) Экспорт
	
	Перем ОбщегоНазначенияВызовСервера;
	
	ОбщегоНазначенияВызовСервера = глОбщийМодуль("ОбщегоНазначенияВызовСервера");
	
	Возврат ОбщегоНазначенияВызовСервера.СлужебнаяФункцияВызовСервераНаФорме(ЭтаФорма, ПрограммныйКод, ДополнительныеПараметры);
	
КонецФункции

#КонецОбласти

#Область Инициализация

Переменные = Новый Структура;
Переменные.Вставить("КлассноеРасширение");

#КонецОбласти 
