
Функция НовыйИндекс() Экспорт
	
	Индекс = Новый Структура;
	Индекс.Вставить("ИндексыПоКлючу", Новый Соответствие);
	Индекс.Вставить("ИндексДляНеопределено", Неопределено);
	Индекс.Вставить("Данные", Новый Массив);
	Индекс.Вставить("ДополнительныеДанные", Новый Структура);
	
	Возврат Индекс;
	
КонецФункции

Функция ВекторизироватьТаблицу(Коллекция, ВекторныеПоляКоллекции) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ВекторныеПоляКоллекцииМассив = РК.ЗначениеВМассив(ВекторныеПоляКоллекции, , Ложь);
	
	ВекторизированныеДанные = Новый Массив;
	
	ЭлементыКоллекции = РК.ПолучитьЭлементыКоллекции(Коллекция);
	
	Для Каждого ЭлементДанных Из ЭлементыКоллекции Цикл
		Вектор = Новый Массив;
		Для Каждого ПолеКоллекции Из ВекторныеПоляКоллекцииМассив Цикл
			Вектор.Добавить(ЭлементДанных[ПолеКоллекции]);
		КонецЦикла;
		ЭлементВекторизированныхДанных = Новый Структура("Вектор, ЭлементДанных", Вектор, ЭлементДанных);
		ВекторизированныеДанные.Добавить(ЭлементВекторизированныхДанных);
	КонецЦикла;
	
	Возврат ВекторизированныеДанные;
	
КонецФункции

Функция НовыйВектор(Данные, ВекторныеПоляДанныхМассив) Экспорт
	
	Вектор = Новый Массив;
	
	Для Каждого Поле Из ВекторныеПоляДанныхМассив Цикл
		
		Вектор.Добавить(Данные[Поле]);
		
	КонецЦикла;
	
	Возврат Вектор;

КонецФункции

Функция ВставитьЭлементДанныхВИндекс(НачальныйИндекс, Вектор, ЭлементДанных, РежимВставки=Неопределено) Экспорт
	
	ВекторизированныеДанные = Новый Массив;
	ВекторизированныеДанные.Добавить(Новый Структура("Вектор, ЭлементДанных", Вектор, ЭлементДанных));
	ВставитьДанныеВИндекс(НачальныйИндекс, ВекторизированныеДанные, РежимВставки);
	
КонецФункции

Функция ВставитьДанныеВИндекс(НачальныйИндекс, ВекторизированныеДанные, РежимВставки=Неопределено) Экспорт
	
	Для Каждого ЭлементВекторизированныхДанных Из ВекторизированныеДанные Цикл
		
		Индекс = НачальныйИндекс;
		Для Каждого КоординатаВектора Из ЭлементВекторизированныхДанных.Вектор Цикл
			
			СледующийИндекс = Индекс.ИндексыПоКлючу[КоординатаВектора];

			Если СледующийИндекс <> Неопределено Тогда
				Индекс = СледующийИндекс;
				Продолжить;
			КонецЕсли;
			
			Если КоординатаВектора=Неопределено И Индекс.ИндексДляНеопределено <> Неопределено Тогда
				Индекс = Индекс.ИндексДляНеопределено;
				Продолжить;
			КонецЕсли;

			СледующийИндекс = Новый Структура;
			СледующийИндекс.Вставить("ИндексыПоКлючу", Новый Соответствие);
			СледующийИндекс.Вставить("ИндексДляНеопределено", Неопределено);
			СледующийИндекс.Вставить("Данные", Новый Массив);
			СледующийИндекс.Вставить("ДополнительныеДанные", Новый Структура);
			
			Если КоординатаВектора=Неопределено Тогда
				Индекс.ИндексДляНеопределено = СледующийИндекс;
			Иначе
				Индекс.ИндексыПоКлючу[КоординатаВектора] = СледующийИндекс;
			КонецЕсли;
			
			Индекс = СледующийИндекс;
			
		КонецЦикла;
		
		Если РежимВставки="Замещать" Тогда
			Индекс.Данные.Очистить();
		ИначеЕсли РежимВставки="ТолькоНовые" Тогда
			Если Индекс.Данные.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
		ИначеЕсли РежимВставки="Очищать" Тогда
			Индекс.Данные.Очистить();
			Продолжить;
		КонецЕсли;
		
		Индекс.Данные.Добавить(ЭлементВекторизированныхДанных.ЭлементДанных);
		
	КонецЦикла;
	
КонецФункции

Функция НайтиИндекс(НачальныйИндекс, Вектор) Экспорт
	
	Индекс = НачальныйИндекс;
	
	Данные = Новый Массив;
	
	Для Каждого КоординатаВектора Из Вектор Цикл
		
		Если Индекс=Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если КоординатаВектора=Неопределено Тогда
			Индекс = Индекс.ИндексДляНеопределено;
		Иначе
			Индекс = Индекс.ИндексыПоКлючу[КоординатаВектора];
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Индекс;

КонецФункции

Функция ПолучитьДанныеИндекса(НачальныйИндекс, СПодчиненными=Истина) Экспорт
	
	Данные = Новый Массив;

	Если СПодчиненными Тогда
		ОбходИндексов = Новый Массив;
		ОбходИндексов.Добавить(НачальныйИндекс);
		
		Для Каждого Индекс Из ОбходИндексов Цикл
			
			Для Каждого ЭлементДанных Из Индекс.Данные Цикл
				Данные.Добавить(ЭлементДанных);
			КонецЦикла;
			
			Для Каждого ПодчиненныйИндекс Из Индекс.ИндексыПоКлючу Цикл
				ОбходИндексов.Добавить(ПодчиненныйИндекс.Значение);
			КонецЦикла;
			
			Если Индекс.ИндексДляНеопределено <> Неопределено Тогда
				ОбходИндексов.Добавить(Индекс.ИндексДляНеопределено);
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		Для Каждого ЭлементДанных Из НачальныйИндекс.Данные Цикл
			Данные.Добавить(ЭлементДанных);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции
