
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	УстановитьЗаголовокФормы();
	УстановитьВидимость();
	
КонецПроцедуры

// #КонецОбласти


// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	Закрыть(ПорядокОбработки);
	
КонецПроцедуры

// #КонецОбласти


// #Область ПроверкаЗаполнения

&НаКлиенте
Функция ПроверитьЗаполнениеПолей()
	
	ОчиститьСообщения();
	
	Возврат ПроверитьЗаполнениеПолейНаСервере();
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеПолейНаСервере()
	
	ЕстьОшибки = Не ПроверитьЗаполнение();
	
	ЭтапыМаркировки = МодульОбъекта().Перечисление_ЭтапыМаркировки();
	Если Этап = ЭтапыМаркировки.НаполнениеДокументаКодами Тогда
		ПроверитьЗаполнениеПолейЭтапаНаполнениеДокументаКодами(ЕстьОшибки);
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеПолейЭтапаНаполнениеДокументаКодами(ЕстьОшибки)
	
	Если (ПодобратьСоСвободногоОстатка
		Или Заказать)
		И Не НаполнитьКодами Тогда
		
		ТекстОшибки = НСтр("ru = '""Необходимо указать этап ""Наполнить документ кодами""""'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "НаполнитьКодами");
		ЕстьОшибки = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти


// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	Этап = Параметры.Этап;
	ПорядокОбработки = Параметры.ПорядокОбработки;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПорядокОбработки);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПорядокОбработки.СпособыВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Заголовок = МодульОбъекта().ПараметрыВСтроку(НСтр("ru = 'Порядок обработки: %1'"), Этап);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	ЭтапыМаркировки = МодульОбъекта().Перечисление_ЭтапыМаркировки();
	Если Этап = ЭтапыМаркировки.Нанесение Тогда
		Элемент = Элементы.ГруппаНанесение;
	ИначеЕсли Этап = ЭтапыМаркировки.ВводВОборот Тогда
		Элемент = Элементы.ГруппаВводВОборот;
	ИначеЕсли Этап = ЭтапыМаркировки.НаполнениеДокументаКодами Тогда
		Элемент = Элементы.ГруппаНаполнениеДокументаКодами;
	ИначеЕсли Этап = ЭтапыМаркировки.ЗавершениеРаботы Тогда
		Элемент = Элементы.ГруппаЗавершениеРаботы;
	Иначе
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(НСтр("ru = 'Неизвестный этап маркировки: %1'"), Этап);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Элемент.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать()
	
	СпособыВыполнения = МодульКлиента().СпособыВыполненияЭтапаМаркировки(Этап);
	ЗаполнитьЗначенияСвойств(СпособыВыполнения, ЭтаФорма);
	
	ПорядокОбработки.Вставить("СпособыВыполнения", СпособыВыполнения);
	ЗаполнитьЗначенияСвойств(ПорядокОбработки, ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти
