&НаКлиенте
Перем Контекст;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Контекст = Новый Структура;
	Контекст.Вставить("ТекстПредупреждения", "");
	
	УникальныйИдентификаторСтрока = Строка(УникальныйИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.Имя = вмс_РаботаСКоллекциями.ПолучитьИмяПрограммнойПеременнойИзСтроки(Объект.Наименование);
КонецПроцедуры

&НаКлиенте
Процедура УникальныйИдентификаторПриИзменении(Элемент)
	
	Попытка
		НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор(УникальныйИдентификаторСтрока);
	Исключение
		ПоказатьПредупреждениеПриИзмененииИдентификатора("Это фуфло, а не идентификатор!");
		Возврат;
	КонецПопытки;
	
	Если НовыйУникальныйИдентификатор = УникальныйИдентификатор() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьСуществованиеЭлементаНаСервере(НовыйУникальныйИдентификатор) Тогда
		ПоказатьПредупреждениеПриИзмененииИдентификатора("Элемент с таким идентификатором уже существует. Придумай другой!");
		Возврат;
	КонецЕсли;

	СменитьОбъект(НовыйУникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСуществованиеЭлементаНаСервере(Идентификатор)
	
	Ссылка = Справочники.вмс_НастройкиПрограммы.ПолучитьСсылку(Идентификатор);
	
	Возврат Ссылка.ПолучитьОбъект() <> Неопределено;
	
КонецФункции

&НаКлиенте
Функция УникальныйИдентификатор()
	
	Возврат Объект.Ссылка.УникальныйИдентификатор();
	
КонецФункции

&НаКлиенте
Функция ПоказатьПредупреждениеПриИзмененииИдентификатора(Текст)
	
	ЭтотОбъект.ТолькоПросмотр = Истина;
	
	Контекст.ТекстПредупреждения = Текст;
	
	ПодключитьОбработчикОжидания("ПоказатьПредупреждениеПриИзмененииИдентификатораОбработчикОжидания", 0.1, Истина);
	
КонецФункции

&НаКлиенте
Функция ПоказатьПредупреждениеПриИзмененииИдентификатораОбработчикОжидания()
	
	ПоказатьПредупреждение(Новый ОписаниеОповещения("ПоказатьПредупреждениеПриИзмененииИдентификатораОбработчикЗакрытия", ЭтотОбъект), Контекст.ТекстПредупреждения);
	
КонецФункции

&НаКлиенте
Функция ПоказатьПредупреждениеПриИзмененииИдентификатораОбработчикЗакрытия(ДополнительныеПараметры) Экспорт
	
	ЭтотОбъект.ТолькоПросмотр = Ложь;

	УникальныйИдентификаторСтрока = Строка(УникальныйИдентификатор());
	
КонецФункции

&НаСервере
Функция СменитьОбъект(УникальныйИдентификатор)
	
	Перем ТекущийЭлемент;
	
	ТекущийЭлемент = РеквизитФормыВЗначение("Объект");
	СтараяСсылка = ТекущийЭлемент.Ссылка;
	НоваяСсылка = Справочники.вмс_НастройкиПрограммы.ПолучитьСсылку(УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(СтараяСсылка) Тогда
		НовыйЭлемент = ТекущийЭлемент.Скопировать();
		НовыйЭлемент.УстановитьСсылкуНового(НоваяСсылка);
		НовыйЭлемент.Записать();
		ЗначениеВРеквизитФормы(НовыйЭлемент, "Объект");
		ТекущийЭлемент = СтараяСсылка.ПолучитьОбъект();
		ТекущийЭлемент.Удалить();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ЭтоНовый() Тогда
		НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор(УникальныйИдентификаторСтрока);
		НоваяСсылка = Справочники.вмс_НастройкиПрограммы.ПолучитьСсылку(НовыйУникальныйИдентификатор);
		ТекущийОбъект.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УникальныйИдентификаторСтрока = Строка(УникальныйИдентификатор());
КонецПроцедуры

