
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Если ЭтоНовый() Тогда
			//сгенерировать уникальный номер в основной базе при загрузке из мобильной базы
			УстановитьНовыйНомер();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)  
	
	//Создадим потребность по комплектам
	Движения.вмс_ПотребностьКомплектов.Записывать = Истина; 
	
	ТаблицаКомплектов = Комплекты.Выгрузить(,"Товар, Характеристика, Количество");
	ТаблицаКомплектов.Свернуть("Товар, Характеристика, Количество");
	
	Для каждого Строка Из ТаблицаКомплектов Цикл 
		
		Движение = Движения.вмс_ПотребностьКомплектов.Добавить();  
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ДокументПотребности = ДокументОснование;
		Движение.Комплект = Строка.Товар;
		Движение.Характеристика = Строка.Характеристика;
		Движение.Потребность = Строка.Количество;
		
	КонецЦикла;
	//Создадим потребность по комплектам              
		
	//Создадим потребность по комплектам
	Движения.вмс_ПотребностьКомплектующих.Записывать = Истина; 	
	Для каждого Строка Из Комплекты Цикл 
		
		Движение = Движения.вмс_ПотребностьКомплектующих.Добавить();  
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ДокументПотребности = ДокументОснование;
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.Потребность = Строка.КоличествоКомплектующих;
		
	КонецЦикла;
	//Создадим потребность по комплектам 
	
КонецПроцедуры
