
Функция КоэффициентНерабочегоВремениСОписанием(Контрагент, ГруппаУслуг) Экспорт
	
	ПустойКонтрагент = Справочники.Контрагенты.ПустаяСсылка();  
	ПустаяГруппаУслуг = Справочники.вмс_УслугиОтветственногоХранения.ПустаяСсылка();
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ                                            
	|	КоэффициентыНерабочегоВремени.Клиент КАК Клиент,
	|	КоэффициентыНерабочегоВремени.ГруппаУслуг КАК ГруппаУслуг,
	|	КоэффициентыНерабочегоВремени.Коэффициент КАК Коэффициент
	|ИЗ
	|	РегистрСведений.КоэффициентыНерабочегоВремени КАК КоэффициентыНерабочегоВремени
	|ГДЕ
	|	КоэффициентыНерабочегоВремени.Клиент = &Контрагент
	|	И КоэффициентыНерабочегоВремени.ГруппаУслуг = &ГруппаУслуг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КоэффициентыНерабочегоВремени.Клиент,
	|	КоэффициентыНерабочегоВремени.ГруппаУслуг,
	|	КоэффициентыНерабочегоВремени.Коэффициент
	|ИЗ
	|	РегистрСведений.КоэффициентыНерабочегоВремени КАК КоэффициентыНерабочегоВремени
	|ГДЕ
	|	КоэффициентыНерабочегоВремени.Клиент = &ПустойКонтрагент
	|	И КоэффициентыНерабочегоВремени.ГруппаУслуг = &ПустаяГруппаУслуг";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);  
	Запрос.УстановитьПараметр("ГруппаУслуг", ГруппаУслуг);   
	Запрос.УстановитьПараметр("ПустойКонтрагент", ПустойКонтрагент);  
	Запрос.УстановитьПараметр("ПустаяГруппаУслуг", ПустаяГруппаУслуг); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если Выборка.Клиент = ПустойКонтрагент И Выборка.ГруппаУслуг = ПустаяГруппаУслуг Тогда 
			Описание = "Документ введен в нерабочее время, коэффициент для контрагента и группы услуг не найден, установлен коэффициент цены по умолчанию = " + Строка(Выборка.Коэффициент);
			Коэффициент = Выборка.Коэффициент;
		Иначе
			Описание = "Документ введен в нерабочее время, установлен коэффициент цены для контрагента = " + Строка(Выборка.Коэффициент);
			Коэффициент = Выборка.Коэффициент; 
		КонецЕсли;
	Иначе
		Описание = "Документ введен в нерабочее время, коэффициент для контрагента и группы услуг не найден, коэффициент цены по умолчанию не задан, коэффициент не применяется (=1)";
		Коэффициент = 1;
	КонецЕсли;   
	
	Результат.Вставить("Описание", Описание);
	Результат.Вставить("Коэффициент", Коэффициент);
	Возврат Результат;
	
КонецФункции
