
&НаКлиенте
Перем УИ_ГЕНЕРАЦИЯ_КэшОбщихМодулей;
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтрокаРоли=Параметры.Роль;
	Если СтрокаРоли<>Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтрокаРоли);
	Иначе
		БезРоли=Истина;
		ТипОстатка="Нет";
		ТипБухгалтерскогоОстатка="Нет";
		НомерПериода=1;
	КонецЕсли;
	
	Элементы.ИзмерениеРодитель.СписокВыбора.Очистить();
	Для Каждого Поле Из Параметры.МассивПолейНабора Цикл
		Элементы.ИзмерениеРодитель.СписокВыбора.Добавить(Поле);
	КонецЦикла;
	
	Заголовок="Роль - "+Параметры.ПутьКДанным;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры
&НаКлиенте
Процедура УстановитьДоступность()
	Элементы.ГруппаПараметрыПериода.Доступность=Период;
	Элементы.ИзмерениеРодитель.Доступность=Измерение;
	Элементы.ВыражениеВидаСчета.Доступность=Счет;
	Элементы.ГруппаПараметрыОстатков.Доступность=Остаток;
КонецПроцедуры

&НаКлиенте
Процедура БезРолиПриИзменении(Элемент)
	Если Не БезРоли Тогда
		БезРоли=Истина;
		Возврат;
	КонецЕсли;
	Период=Ложь;
	Измерение=Ложь;
	Счет=Ложь;
	Остаток=Ложь;

	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Если Не Период Тогда
		Период=Истина;
		Возврат;
	КонецЕсли;
	БезРоли=Ложь;
	Измерение=Ложь;
	Счет=Ложь;
	Остаток=Ложь;

	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИзмерениеПриИзменении(Элемент)
	Если Не Измерение Тогда
		Измерение=Истина;
		Возврат;
	КонецЕсли;
	БезРоли=Ложь;
	Период=Ложь;
	Счет=Ложь;
	Остаток=Ложь;

	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	Если Не Счет Тогда
		Счет=Истина;
		Возврат;
	КонецЕсли;
	БезРоли=Ложь;
	Период=Ложь;
	Измерение=Ложь;
	Остаток=Ложь;

	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПриИзменении(Элемент)
	Если Не Остаток Тогда
		Остаток=Истина;
		Возврат;
	КонецЕсли;
	БезРоли=Ложь;
	Период=Ложь;
	Измерение=Ложь;
	Счет=Ложь;

	УстановитьДоступность();
КонецПроцедуры
&НаКлиенте
Процедура Применить(Команда)
	Роль=Новый Структура;
	Роль.Вставить("ВыражениеВидаСчета", ВыражениеВидаСчета);
	Роль.Вставить("ГруппаОстатка", ГруппаОстатка);
	Роль.Вставить("ИгнорироватьЗначенияNULL", ИгнорироватьЗначенияNULL);
	Роль.Вставить("Измерение", Измерение);
	Роль.Вставить("Период", Период);
	Роль.Вставить("НомерПериода", НомерПериода);
	Роль.Вставить("Обязательное", Обязательное);
	Роль.Вставить("Остаток", Остаток);
	Роль.Вставить("ПолеСчета", ПолеСчета);
	Роль.Вставить("РодительскоеИзмерение", РодительскоеИзмерение);
	Роль.Вставить("Счет", Счет);
	Роль.Вставить("ТипБухгалтерскогоОстатка", ТипБухгалтерскогоОстатка);
	Роль.Вставить("ТипОстатка", ТипОстатка);
	Роль.Вставить("ПериодДополнительный", ПериодДополнительный);
	
	Закрыть(Роль);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УИ_ГЕНЕРАЦИЯ_ОбщийМодульПоИмени(ИмяМодуля, УИ_ГЕНЕРАЦИЯ_КэшОбщихМодулей=Неопределено, Форма = Неопределено)
	
	
	Если УИ_ГЕНЕРАЦИЯ_КэшОбщихМодулей=Неопределено Тогда
		УИ_ГЕНЕРАЦИЯ_КэшОбщихМодулей=Новый Соответствие;
	КонецЕсли;
	
	
	#Если Клиент Тогда
		Если УИ_ГЕНЕРАЦИЯ_КэшОбщихМодулей[НРег(ИмяМодуля)]<>Неопределено Тогда
			Возврат УИ_ГЕНЕРАЦИЯ_КэшОбщихМодулей[НРег(ИмяМодуля)];
		КонецЕсли;
	#КонецЕсли
	
	#Если ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение  Тогда 
		Если УИ_ГЕНЕРАЦИЯ_ЭтоФайловаяБаза() Тогда
			ОбщийМодуль=ВнешниеОбработки.Создать(ИмяМодуля);
		Иначе
			ОбщийМодуль=ПолучитьФорму("ВнешняяОбработка."+ИмяМодуля+".Форма",,,Ложь);
		КонецЕсли;
		УИ_ГЕНЕРАЦИЯ_КэшОбщихМодулей.Вставить(НРег(ИмяМодуля),ОбщийМодуль);
	#ИначеЕсли Клиент Тогда
		
		ОбщийМодуль=ПолучитьФорму("ВнешняяОбработка."+ИмяМодуля+".Форма",,,Ложь);
		УИ_ГЕНЕРАЦИЯ_КэшОбщихМодулей.Вставить(НРег(ИмяМодуля),ОбщийМодуль);
	#Иначе
		ОбщийМодуль=ВнешниеОбработки.Создать(ИмяМодуля);
	#КонецЕсли
	
	Возврат ОбщийМодуль;
КонецФункции

&НаСервереБезКонтекста
Функция УИ_ГЕНЕРАЦИЯ_УИ_БиблиотекаКартинок()
	АдресБиблиотеки=УИ_ГЕНЕРАЦИЯ_ОбщийМодульПоИмени("УИ_ОбщегоНазначения").ХранилищеНастроекДанныхФормЗагрузить(УИ_ГЕНЕРАЦИЯ_ОбщийМодульПоИмени("УИ_ОбщегоНазначенияКлиентСервер").КлючОбъектаВХранилищеНастроек(), "АдресЛокальнойБиблиотекиКартинок", , ,
		ИмяПользователя());

	Возврат ПолучитьИзВременногоХранилища(АдресБиблиотеки);
КонецФункции

// Возвращает флаг того, что работа происходит в файловой базе
&НаКлиентеНаСервереБезКонтекста
Функция УИ_ГЕНЕРАЦИЯ_ЭтоФайловаяБаза() Экспорт
	Возврат Найти(СтрокаСоединенияИнформационнойБазы(), "File=") > 0;
КонецФункции
&НаКлиентеНаСервереБезКонтекста
Функция _НаправленияПоискаСтрНайти()
	Возврат Новый Структура("СНачала,СКонца","СНачала","СКонца");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _СтрНачинаетсяС(Строка, СтрокаПоиска) Экспорт
	Возврат Найти(Строка, СтрокаПоиска) = 1;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _СтрЗаканчиваетсяНа(Строка, СтрокаПоиска) Экспорт
	Возврат Прав(Строка, СтрДлина(СтрокаПоиска)) = СтрокаПоиска;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _СтрРазделить(знач Строка, Разделитель, ВключатьПустые = Истина) Экспорт
	Результат = Новый Массив;
	
	Если Строка = "" Тогда 
		Если ВключатьПустые Тогда
			Результат.Добавить(Строка);
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если ВключатьПустые ИЛИ НЕ Подстрока = "" Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если ВключатьПустые ИЛИ НЕ Строка = "" Тогда
		Результат.Добавить(Строка);
	КонецЕсли;
		
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _СтрСоединить(Строки, знач Разделитель = Неопределено) Экспорт
	Результат = "";
	
	Если Разделитель = Неопределено Тогда
		Разделитель = "";
	КонецЕсли;
	
	Если Строки.Количество() Тогда
		Результат = Строки[0];
	КонецЕсли;
	
	Для сч = 1 По Строки.ВГраница() Цикл
		Результат = Результат + Разделитель + Строки[сч];
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _СтрНайти(Строка, ПодстрокаПоиска, _НаправлениеПоиска = Неопределено, НачальнаяПозиция = Неопределено, НомерВхождения = 1) Экспорт
	// НаправлениеПоиска: СКонца,СНачала. По умолчанию: СНачала
	
	Если Строка = "" И ПодстрокаПоиска = "" Тогда
		// чтобы отрабатывало как в платформе
		Если _НаправлениеПоиска = "СКонца" Тогда
			Если НомерВхождения = 1 Тогда
				Возврат 1;
			Иначе
				Возврат 0;
			КонецЕсли;
		Иначе
			Возврат мин(НомерВхождения, ?(НачальнаяПозиция=Неопределено, 1, НачальнаяПозиция));
		КонецЕсли;
	КонецЕсли;
	
	Если НачальнаяПозиция = Неопределено Тогда
		Если _НаправлениеПоиска = "СКонца" Тогда
			лНачальнаяПозиция = СтрДлина(Строка);
		Иначе
			лНачальнаяПозиция = 1;
		КонецЕсли;
	Иначе
		лНачальнаяПозиция = НачальнаяПозиция;
	КонецЕсли;
	
	Если _НаправлениеПоиска = "СКонца" Тогда
		лСтрока = "";
		Для сч = 1 По СтрДлина(Строка) Цикл
			лСтрока = Сред(Строка, сч, 1) + лСтрока;
		КонецЦикла;
		лПодстрокаПоиска = "";
		Для сч = 1 По СтрДлина(ПодстрокаПоиска) Цикл
			лПодстрокаПоиска = Сред(ПодстрокаПоиска, сч, 1) + лПодстрокаПоиска;
		КонецЦикла;
		лНачальнаяПозиция = макс(1, СтрДлина(Строка)-лНачальнаяПозиция-СтрДлина(ПодстрокаПоиска)+2);
	Иначе
		лСтрока = Строка;
		лПодстрокаПоиска = ПодстрокаПоиска;
		лНачальнаяПозиция = лНачальнаяПозиция;
	КонецЕсли;
	
	лНомерВхождения = 0;
	Результат = Найти(Сред(лСтрока, лНачальнаяПозиция), лПодстрокаПоиска);
	Пока Результат Цикл
		лНачальнаяПозиция = Результат + лНачальнаяПозиция + СтрДлина(ПодстрокаПоиска)-1;
		лНомерВхождения = лНомерВхождения + 1;
		Если лНомерВхождения = НомерВхождения Тогда
			Прервать;
		КонецЕсли;
		Результат = Найти(Сред(лСтрока, лНачальнаяПозиция), лПодстрокаПоиска);
	КонецЦикла;
	
	Если лНомерВхождения = НомерВхождения Тогда
		Результат = лНачальнаяПозиция - СтрДлина(ПодстрокаПоиска);
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Если _НаправлениеПоиска = "СКонца" И Результат<>0 Тогда
		Результат = СтрДлина(Строка) - Результат - СтрДлина(ПодстрокаПоиска) + 2;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _СтрШаблон(Шаблон, Параметр1=Неопределено, Параметр2=Неопределено, Параметр3=Неопределено,Параметр4=Неопределено,Параметр5=Неопределено,Параметр6=Неопределено,Параметр7=Неопределено,Параметр8=Неопределено,Параметр9=Неопределено,Параметр10=Неопределено) Экспорт
	Результат = Шаблон;
	
	Для сч = -10 По -1 Цикл
		Параметр = Вычислить("Параметр" + (-сч));
		Если Параметр = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Найти(Результат, "%("+(-сч)+")") = 0 И Найти(Результат, "%"+(-сч))=0 Тогда
			ВызватьИсключение "Слишком много фактических параметров";
		КонецЕсли;
		Результат = СтрЗаменить(Результат, "%("+ (-сч) + ")", Параметр);
		Результат = СтрЗаменить(Результат, "%"+ (-сч), Параметр);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции


&НаКлиенте
Функция УИ_ГЕНЕРАЦИЯ_УИ_ПараметрыПриложения()
	Окна=ПолучитьОкна();
	
	Для Каждого ТекОкно Из Окна Цикл
		Для Каждого Форма Из ТекОкно.Содержимое Цикл
			Если ТипЗнч(Форма)<>УИ_ГЕНЕРАЦИЯ_ОбщийМодульПоИмени("УИ_ОбщегоНазначенияКлиентСервер", УИ_ГЕНЕРАЦИЯ_КэшОбщихМодулей, ЭтаФорма).ТипУправляемойФормы() Тогда
				Продолжить;
			КонецЕсли;
			
			Если Форма.ИмяФормы="ВнешняяОбработка.УИ_ПортативныеУниверсальныеИнструменты.Форма.Форма" Тогда
				Возврат Форма.УИ_ПараметрыПриложения_Портативные;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Новый Соответствие;
	
КонецФункции



