&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	  
	УстановитьОтборДинамическогоСписка(Склады,"Ссылка." + вмс_АдаптацияКонфигураций.ПолучитьИмяПараметраТипСклада(),вмс_АдаптацияКонфигураций.ПолучитьТипСкладаОптовый());
	
	АдаптироватьЗапросДинамическогоСписка(Элементы.Склады);
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Если Параметры.МножественныйВыбор <> Неопределено Тогда
		Элементы.Список.МножественныйВыбор = Параметры.МножественныйВыбор; 
	Иначе Элементы.Список.МножественныйВыбор = Ложь;	
	КонецЕсли;
	Если Параметры.РежимВыбора И Не ЗначениеЗаполнено(Параметры.КлючПользовательскихНастроек) Тогда
		Параметры.КлючПользовательскихНастроек = "РежимВыбора";
		Список.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	КонецЕсли; 
	//Плугина 21.09 +
	Если Параметры.ОтображениеТаблицы <> Неопределено Тогда
        Элементы.Список.Отображение = Параметры.ОтображениеТаблицы;
	КонецЕсли;    
	//Плугина 21.09 - 
	
	//ТУ_Кошелев 14.09.23 ++
	УстановитьНастройкиВидимостиЭлементов();
	//ТУ_Кошелев 14.09.23 --
КонецПроцедуры  

//ТУ_Кошелев 14.09.23 ++
&НаСервере
Функция УстановитьНастройкиВидимостиЭлементов()  
	
	ИспользоватьПомещения = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ИспользоватьПомещения", ЛОЖЬ); 	
	Элементы.СсылкаПомещение.Видимость = ИспользоватьПомещения;
		
КонецФункции
//ТУ_Кошелев 14.09.23 --

&НаСервере
Процедура УстановитьОтборДинамическогоСписка(ДинамическийСписок, ИмяПоля, Значение, Использование = Истина)
	
	ЭлементыОтбора = ДинамическийСписок.Отбор.Элементы;
	
	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	НайденныйЭлемент = Неопределено;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Поле Тогда
			НайденныйЭлемент = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НайденныйЭлемент = Неопределено Тогда
		ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Поле;
	КонецЕсли;
	
	ЭлементОтбора.Использование = Использование;
	ЭлементОтбора.ПравоеЗначение = Значение;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;


КонецПроцедуры

&НаСервере
Функция АдаптироватьЗапросДинамическогоСписка(Список)
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	""<Без отбора>"" КАК Ссылка,
		|	ИСТИНА КАК ПустоеЗначение,
		|	ЛОЖЬ КАК ПометкаУдаления,
		|	0 КАК Порядок
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СправочникСклады.Ссылка,
		|	ЛОЖЬ,
		|	СправочникСклады.ПометкаУдаления,
		|	1
		|ИЗ
		|	&ИмяСправочникаСклады КАК СправочникСклады";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ИмяСправочникаСклады","Справочник." + вмс_АдаптацияКонфигураций.ПолучитьИмяСправочникаСклады());
	
	СвойстваСписка.ТекстЗапроса                 = ТекстЗапроса;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Список, СвойстваСписка);
	

КонецФункции // АдаптироватьЗапросДинамическогоСписка()

&НаСервере
Функция ПолучитьМассивСкладов()  
	
	МассивСкладов = Новый Массив;
	ИмяСправочника = вмс_АдаптацияКонфигураций.ПолучитьИмяСправочникаСклады();
	Иерархический = Метаданные.Справочники[ИмяСправочника].Иерархический;
	
	Выборка = Справочники[ИмяСправочника].Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если Иерархический И Выборка.ЭтоГруппа Тогда
			Продолжить;	
		КонецЕсли;
		МассивСкладов.Добавить(Выборка.Ссылка);		
	КонецЦикла;
		
	Возврат МассивСкладов;
	
КонецФункции

//======================================================================================================================

&НаКлиенте
Процедура СкладыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Склады.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		УстановитьОтборПоСкладам(ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры   


//======================================================================================================================

&НаСервере
Процедура УстановитьОтборПоСкладам(Склад)
	
	ИспользоватьОтбор = ТипЗнч(Склад) <> Тип("Строка");
	
	Если ИспользоватьОтбор Тогда
		СписокСкладов = вмс_РаботаСКоллекциями.ЗначениеВМассив(Склад);
	Иначе
		СписокСкладов = ПолучитьМассивСкладов();
	КонецЕсли;
	
	УстановитьОтборДинамическогоСписка(Список, "Владелец", СписокСкладов, Истина);

	
КонецПроцедуры
