Функция ВыполнитьМетодPOST(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	// Подкрепим параметры приложения указателем в таблице адресов временного хранилища
	// так как кэш модуля повторного использования не надежен, может слететь во время вызова сервера
	вмс_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПриложения();
	
	СтрокаBase64 = Запрос.ПолучитьТелоКакСтроку();
	ВходящееСообщение = вмс_Обмен_с_КИС_Сервер.РаспаковатьВходящиеДанные(СтрокаBase64);
	ОписаниеМетода = ВходящееСообщение.Данные;
	
	ДанныеВыполнения = Новый Структура("РезультатВыполненияМетода, ИнформацияОбОшибке");
	Если ОписаниеМетода.ИмяОбработчика="ВыполнитьПакетМетодов" ИЛИ ОписаниеМетода.ИмяОбработчика="вмс_ОбщегоНазначенияВызовСервера.ВыполнитьПакетМетодов" Тогда
		
		// рефакторинг для уменьшения стека вызова функции
		ПакетМетодов = ОписаниеМетода.Параметры[0];
		ВыполнятьВПопытке = ?(ОписаниеМетода.Параметры.Количество() > 1, ОписаниеМетода.Параметры[1], Истина);
		ОстанавливатьсяПоОшибке = ?(ОписаниеМетода.Параметры.Количество() > 2, ОписаниеМетода.Параметры[2], Ложь);
		
		Если ОписаниеМетода.ПредОбработка <> Неопределено Тогда
			Выполнить(ОписаниеМетода.ПредОбработка + "(ОписаниеМетода)");
		КонецЕсли;
		
		Результат = вмс_ОбщегоНазначенияВызовСервера.ВыполнитьПакетМетодов(ПакетМетодов, ВыполнятьВПопытке, ОстанавливатьсяПоОшибке);

		Если ОписаниеМетода.ПостОбработка <> Неопределено Тогда
			ДанныеВыполненияВнутр = Новый Структура;
			ДанныеВыполненияВнутр.Вставить("Результат", Результат);
			ДанныеВыполненияВнутр.Вставить("ОписаниеМетода", ОписаниеМетода);
			Выполнить(ОписаниеМетода.ПостОбработка + "(ДанныеВыполненияВнутр)");
			Результат = ДанныеВыполненияВнутр.Результат;
		КонецЕсли;
		
		ДанныеВыполнения.РезультатВыполненияМетода = Результат;
		
	Иначе
		
		ДанныеВыполнения.РезультатВыполненияМетода = вмс_ОбщегоНазначенияВызовСервера.ВыполнитьМетод(ОписаниеМетода, Истина, ДанныеВыполнения.ИнформацияОбОшибке);
		
	КонецЕсли;
		
	Для каждого ВыполненныйМетод Из ДанныеВыполнения.РезультатВыполненияМетода Цикл
		
		Если ВыполненныйМетод.Имя = "вмс_СерверУправляемыеОбработки.ВыполнитьДействие" Тогда	
			Продолжить;
		КонецЕсли;
		
		ТекстСообщения = "";
		
		Если ВыполненныйМетод.Ошибка Тогда
			ТекстСообщения = ТекстСообщения + "Информация об ошибке: " + ВыполненныйМетод.ИнформацияОбОшибке + Символы.ПС;
			вмс_Журналирование.Записать(ТекстСообщения, ВыполненныйМетод.Имя, "Ошибка");
		Иначе
			ТекстСообщения = ТекстСообщения + "Результат: " + ВыполненныйМетод.Результат + Символы.ПС;
			ТекстСообщения = ТекстСообщения + "Заполнен: " + ЗначениеЗаполнено(ВыполненныйМетод.Результат);
			вмс_Журналирование.Записать(ТекстСообщения, ВыполненныйМетод.Имя, "Отладка");
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаBase64 = вмс_Обмен_с_КИС_Сервер.УпаковатьИсходящиеДанные(ДанныеВыполнения, ВходящееСообщение.ТипДанных);
	
	Результат = СтрокаBase64;
	
	Ответ.УстановитьТелоИзСтроки(Результат, КодировкаТекста.UTF8);	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	
	// Закэшируем параметры приложения в модуле повторного использования значений, если кэш модуля слетел
	вмс_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПриложения();
	
	// Удалим указатель на параметры приложения из таблицы адресов временного хранилища,
	// чтобы избежать сериализации при сбросе кэша данных во временный файл,
	// так как это каким-то образом приводит к завершению сеанса
	// возможно из-за несериализуемых данных в параметрах приложения.
	// Для диагностических целей оставим заместителя параметров приложения в хранилище
	// Параметры останутся в кэше общего модуля, при следующем вызове сервиса получим их оттуда
	// и поместим в хранилище
	Заместитель = вмс_ОбщегоНазначенияКлиентСервер.ДержательМестаДляПараметровПриложения();
	ПоместитьВоВременноеХранилище(Заместитель, ПараметрыСеанса.вмс_АдресХранилищаПараметровПриложения);
	
	Возврат Ответ;
	
КонецФункции

Функция TestGet(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("HTTP WMS Service is working!");
	Возврат Ответ;
КонецФункции
