
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимСканера = МодульОбъекта().СвойствоСтруктуры(Параметры, "РежимСканера");
	ДляУдаления = МодульОбъекта().СвойствоСтруктуры(Параметры, "ДляУдаления");
	
	ЗаполнитьТабличныйДокумент();
	ЗаполнитьСписокЭквивалентовРазделителяGS1();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементы();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьКоды(Команда)
	
	МассивРазделителей = СписокЭквивалентовРазделителяGS1.ВыгрузитьЗначения();
	МассивРазделителей.Добавить(МодульКлиента().ЭквивалентРазделителяGS1());
	МодульКлиента().СвернутьМассивЛок(МассивРазделителей);
	
	АдресТаблицыКодов = МодульКлиента().КодыДокументов_ПодготовитьТаблицуКодовДляЗагрузки(
	КодыМаркировки(), ЗагружатьПолныеКоды, МассивРазделителей);
	
	Результат = Новый Структура;
	Результат.Вставить("АдресТаблицыКодов", АдресТаблицыКодов);
	Результат.Вставить("УдалитьСтарыеКоды", УдалитьСтарыеКоды);
	Результат.Вставить("ЗагружатьПолныеКоды", ЗагружатьПолныеКоды);
	Результат.Вставить("РежимСканера", РежимСканера);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Функция КодыМаркировки()
	
	Если РежимСканера Тогда
		Результат = МодульКлиента().РазделитьСтроку(ТекстСКодами, Символы.ПС);
	Иначе
		Результат = КодыМаркировкиИзТабличногоДокумента();
	КонецЕсли;
	
	УдалитьПустые = Истина;
	ЗаменитьНаЭквивалентРазделительGS1(Результат);
	МодульКлиента().СвернутьМассивЛок(Результат, УдалитьПустые);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокЭквивалентовРазделителяGS1Нажатие(Элемент)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("СписокЭквивалентовРазделителяGS1ПослеРедактирования", ЭтаФорма);
	
	КонтекстФормы = МодульКлиента().Новый_ПараметрыФормыРедактированияСписка();
	
	КонтекстФормы.РазрешитьРедактирование = Истина;
	КонтекстФормы.Заголовок               = НСтр("ru = 'Эквиваленты разделителя GS1'");
	КонтекстФормы.Список                  = СписокЭквивалентовРазделителяGS1;
	КонтекстФормы.ТипЗначений             = Тип("Строка");
	
	МодульКлиента().ОткрытьФормуПросмотраСписка(ЭтаФорма, КонтекстФормы, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭквивалентовРазделителяGS1ПослеРедактирования(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивЭквивалентовGS1 = Результат.ВыгрузитьЗначения();
	МодульКлиента().ЭквивалентыРазделителяGS1_Записать(МассивЭквивалентовGS1);
	СписокЭквивалентовРазделителяGS1.ЗагрузитьЗначения(МассивЭквивалентовGS1);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриАктивизации(Элемент)
	
	Если Элемент.ТекущаяОбласть <> Неопределено Тогда
		Элементы.ТабличныйДокумент.Редактирование = (Элемент.ТекущаяОбласть.Имя <> "R1C1");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьПолныеКодыПриИзменении(Элемент)
	
	УстановитьПодсказку();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПодсказку()
	
	Если ЗагружатьПолныеКоды Тогда
		Элементы.ВариантыПодсказок.ТекущаяСтраница = Элементы.СКриптохвостами;
	Иначе
		Элементы.ВариантыПодсказок.ТекущаяСтраница = Элементы.БезКриптохвостов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементы()
	
	Если РежимСканера Тогда
		Элементы.ГруппаСпособыЗагрузки.ТекущаяСтраница = Элементы.СтраницаТекст;
		ТекущийЭлемент = Элементы.ТекстСКодами;
	Иначе
		Элементы.ГруппаСпособыЗагрузки.ТекущаяСтраница = Элементы.СтраницаТабличныйДокумент;
		Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(ПерваяСтрокаСКодом(), КолонкаКодаМаркировки());
		ТекущийЭлемент = Элементы.ТабличныйДокумент;
	КонецЕсли;
	
	Если ДляУдаления Тогда
		Элементы.Подсказка.Видимость = Ложь;
		Элементы.ГруппаПолныеКоды.Видимость = Ложь;
		Элементы.УдалитьСтарыеКоды.Видимость = Ложь;
		Элементы.Кнопка_ЗагрузитьКоды.Заголовок = "Удалить";
	Иначе
		УстановитьПодсказку();
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокумент()
	
	ТабличныйДокумент.Очистить();
	
	СтрокаШапки = 1;
	КолонкаШапки = 1;
	
	Шапка = ТабличныйДокумент.ПолучитьОбласть(СтрокаШапки, КолонкаШапки);
	ТекущаяОбласть = Шапка.Область();
	ТекущаяОбласть.ШиринаКолонки = 48;
	ТекущаяОбласть.Текст = НСтр("ru = 'Код маркировки'");
	ТекущаяОбласть.ЦветФона = WebЦвета.СветлоЖелтыйЗолотистый;
	ТекущаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	
	ТабличныйДокумент.Вывести(Шапка);
	ТабличныйДокумент.ФиксацияСверху = СтрокаШапки;
	
КонецПроцедуры

&НаКлиенте
Функция КодыМаркировкиИзТабличногоДокумента()
	
	КолонкаКода = 1;
	
	Результат = Новый Массив;
	Для Сч = ПерваяСтрокаСКодом() По ТабличныйДокумент.ВысотаТаблицы Цикл
		Результат.Добавить(СокрЛП(ТабличныйДокумент.Область(Сч, КолонкаКода).Текст));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокЭквивалентовРазделителяGS1()
	
	СписокЭквивалентовРазделителяGS1.ЗагрузитьЗначения(МодульОбъекта().ЭквивалентыРазделителяGS1());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьНаЭквивалентРазделительGS1(КодыМаркировки)
	
	РазделительGS1 = МодульКлиента().РазделительGS1();
	Эквивалент = МодульКлиента().ЭквивалентРазделителяGS1();
	
	Для Сч = 0 По КодыМаркировки.ВГраница() Цикл
		КодМаркировки = КодыМаркировки[Сч];
		Для каждого ДопЭквивалент Из СписокЭквивалентовРазделителяGS1 Цикл
			КодМаркировки = СтрЗаменить(КодМаркировки, ДопЭквивалент, Эквивалент);
		КонецЦикла;
		КодыМаркировки[Сч] = СтрЗаменить(КодМаркировки, РазделительGS1, Эквивалент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция КолонкаКодаМаркировки()
	
	Возврат 1;
	
КонецФункции

&НаКлиенте
Функция ПерваяСтрокаСКодом()
	
	Возврат 2;
	
КонецФункции

// #КонецОбласти
