
// #Область ПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентУправляемоеПриложение Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Признак "Клиент (управляемое приложение)" и инструкция препроцессора установлены
// для поддержки толстого клиента в управляемом приложении в режиме клиент-сервер
// Смотрите п.2 в статье ИТС https://its.1c.ru/db/v8std#content:680:hdoc

// Возвращает версию модуля маркировки
// 
// Возвращаемое значение:
//  Строка
//
Функция ВерсияМодуля() Экспорт
	
	ОтключитьИнициализацию = Истина;
	Возврат МодульМаркировки(ОтключитьИнициализацию).ВерсияОбработки();
	
КонецФункции

// Создает объект обработки Контур.Маркировка
//
// Параметры:
//  ОтключитьИнициализацию - Булево - (необязательный) Истина, если инициализацию модуля выполнять не нужно;
//  ИдентификаторСеанса - УникальныйИдентификатор - (необязательный) идентификатор сеанса маркировки;
// 
// Возвращаемое значение:
//  ОбработкаОбъект - модуль маркировки
//
Функция МодульМаркировки(ОтключитьИнициализацию = Ложь, Знач ИдентификаторСеанса = Неопределено) Экспорт
	
	Если ИдентификаторСеанса = Неопределено Тогда
		ИдентификаторСеанса = ОбщегоНазначенияКонтурМаркировка.ПрочитатьПараметрСессииМаркировки("ИдентификаторСеанса");
		Если Не ЗначениеЗаполнено(ИдентификаторСеанса) И Не ОтключитьИнициализацию Тогда
			ИдентификаторСеанса = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЕсли;
	
	КлючКэш = Строка(ИдентификаторСеанса);
	КэшОбработки = ВзаимодействиеКонтурМаркировкаПовтИсп.МодульМаркировки(КлючКэш);
	
	Если КэшОбработки.ОбъектОбработки = Неопределено Тогда
		
		НомерЭкземпляра = ОбщегоНазначенияКонтурМаркировка.ПрочитатьПараметрСессииМаркировки("НомерЭкземпляраМодуля", 0);
		КлючКэш = Строка(ИдентификаторСеанса) + "_" + НомерЭкземпляра;
		КэшОбработки = ВзаимодействиеКонтурМаркировкаПовтИсп.МодульМаркировки(КлючКэш);
		
		Если КэшОбработки.ОбъектОбработки = Неопределено Тогда
			НомерЭкземпляра = НомерЭкземпляра + 1;
			КлючКэш = Строка(ИдентификаторСеанса) + "_" + НомерЭкземпляра;
			КэшОбработки = ВзаимодействиеКонтурМаркировкаПовтИсп.МодульМаркировки(КлючКэш);
			ОбщегоНазначенияКонтурМаркировка.ПоместитьПараметрСессииМаркировки("НомерЭкземпляраМодуля", НомерЭкземпляра);
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = КэшОбработки.ОбъектОбработки;
	
	Если Не ОтключитьИнициализацию
		И Не Результат.МодульИнициализирован(ИдентификаторСеанса) Тогда
		Результат.Инициализировать(ИдентификаторСеанса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // ПрограммныйИнтерфейс

// #Область СлужебныйПрограммныйИнтерфейс

// Выполняет команду обработки без использования БСП, используется для вызова в фоновом задании
//
// Параметры:
//  ПараметрыКоманды - Структура - обязательно содержит:
//   * ИдентификаторКоманды - идентификатор команды;
//  ОписаниеОбработки - Структура - (необязательный) содержит:
//   * ПутьКФайлу - Строка - путь к файлу обработки;
//   * ИмяОбработки - Строка - имя, с которым нужно подключить обработку;
//   * ДвоичныеДанные - ДвоичныеДанные - двоичные данные обработки;
//   * ПутьКФайлуМодуля - Строка - (необязательный) путь к файлу модуля маркировки;
//  АдресРезультата - Строка - (необязательный) адрес из временного хранилища,
//                                              куда нужно поместить результат;
//
Процедура ВыполнитьЗадание(ПараметрыКоманды, ОписаниеОбработки = Неопределено, АдресРезультата = "") Экспорт
	
	Модуль = ОбщегоНазначенияКонтурМаркировка.СоздатьОбработкуМаркировкиПоОписанию(ОписаниеОбработки);
	
	Если Не ПараметрыКоманды.Свойство("РезультатВыполнения") Тогда
		ПараметрыКоманды.Вставить("РезультатВыполнения", Новый Структура);
	КонецЕсли;
	
	Модуль.ВыполнитьКоманду(ПараметрыКоманды.ИдентификаторКоманды, ПараметрыКоманды);
	
	Если ЗначениеЗаполнено(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(ПараметрыКоманды.РезультатВыполнения, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

// Вызывает в ПМ событие ВыполнитьРегламентныеДействия, используется в регламентном задании
//
// Параметры:
//  ДопПараметры - Структура - (необязательный) будут переданы в ПМ;
//  ОписаниеОбработки - Структура - (необязательный) содержит:
//   * ПутьКФайлу - Строка - путь к файлу обработки;
//   * ИмяОбработки - Строка - имя, с которым нужно подключить обработку;
//   * ДвоичныеДанные - ДвоичныеДанные - двоичные данные обработки;
//   * ПутьКФайлуМодуля - Строка - (необязательный) путь к файлу модуля маркировки;
//
Процедура ВыполнитьРегламентныеДействия(ДопПараметры = Неопределено, ОписаниеОбработки = Неопределено) Экспорт
	
	Модуль = ОбщегоНазначенияКонтурМаркировка.СоздатьОбработкуМаркировкиПоОписанию(ОписаниеОбработки);
	ИдентификаторКоманды = Модуль.Перечисление_КомандыОбработки().ВыполнитьРегламентныеДействия;
	
	Модуль.ВыполнитьКоманду(ИдентификаторКоманды, ДопПараметры);
	
КонецПроцедуры

// Возвращает полный путь к форме модуля маркировки
//
// Параметры:
// 
// Возвращаемое значение:
//  Строка - полный путь к форме
//
Функция ПутьКФормеМодуля() Экспорт
	
	ОтключитьИнициализацию = Истина; // Инициализация будет выполнена при открытии формы модуля
	
	Возврат МодульМаркировки(ОтключитьИнициализацию).ПутьКФормеМодуля();
	
КонецФункции

// Возвращает полный путь к основной форме модуля маркировки
//
// Параметры:
// 
// Возвращаемое значение:
//  Строка - полный путь к форме
//
Функция ПутьКОсновнойФормеМодуля() Экспорт
	
	ОтключитьИнициализацию = Истина; // Инициализация будет выполнена при открытии формы модуля
	
	Возврат МодульМаркировки(ОтключитьИнициализацию).ПутьКОсновнойФормеМодуля();
	
КонецФункции

// Возвращает параметры для открытия формы модуля клиента
//
// Параметры:
//  ОтключитьИнициализацию - Булево - (необязательный) Истина, если инициализацию модуля выполнять не нужно;
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ИдентификаторСеанса - УникальныйИдентификатор - идентификатор сеанса;
//   * ПутьКФормеМодуляКлиента - Строка - путь к форме модуля клиента;
//
Функция ПараметрыСозданияМодуляКлиента(ОтключитьИнициализацию = Ложь) Экспорт
	
	Возврат МодульМаркировки(ОтключитьИнициализацию).ПараметрыСозданияМодуляКлиента();
	
КонецФункции

// #КонецОбласти // СлужебныйПрограммныйИнтерфейс

// #Область УстаревшиеМетоды

// Устарела. Следует использовать МодульМаркировки()
//
Функция МодульКонтурМаркировка(ОтключитьИнициализацию = Ложь) Экспорт
	
	Возврат МодульМаркировки(ОтключитьИнициализацию);
	
КонецФункции

// Устарела. Следует использовать ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент()
//
Функция ПутьКФормеМодуляКлиента() Экспорт
	
	Возврат ПараметрыСозданияМодуляКлиента().ПутьКФормеМодуляКлиента;
	
КонецФункции

// Устарела. Не поддерживается
//
Функция НайтиКодыУпаковок(КодыМаркировки) Экспорт
	
	Возврат МодульМаркировки().НайтиКодыУпаковок(КодыМаркировки);
	
КонецФункции

// Устарела. Не поддерживается
//
Функция КодыУпаковокПоДокументу(Документ1С) Экспорт
	
	Результат = МодульМаркировки().КодыУпаковокПоДокументу(Документ1С);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ТаблицаКодовДокумента()
//
// Для совместимости с ВСО 1.1.17 и ПМ до версии 2.16 (включительно)
// Получает описание всех кодов маркировки по документу 1С
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ЗаменитьGS - Булево - Истина, если необходимо заменить разделитель GS1 на его эквивалент \u001d
// 
// Возвращаемое значение:
//  Массив - содержит структуры см. функцию ОписаниеНовогоКодаМаркировки();
//
Функция ОписанияКодовДокумента(Документ1С, ЗаменитьGS = Ложь) Экспорт
	
	Результат = МодульМаркировки().ОписанияКодовДокумента(Документ1С, ЗаменитьGS);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ТаблицаНовыхКодов()
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * GTIN - Строка - (необязательный) код товара;
//   * СерийныйНомер - Строка - (необязательный) серийный номер товара;
//   * НормализованныйКодМаркировки - Строка - нормализованный код маркировки;
//   * КодМаркировки - Строка - код маркировки или агрегата;
//   * КодУпаковки   - СправочникСсылка.КонтурМаркировка_КодыУпаковок - (необязательный) код упаковки;
//   * ТипУпаковки   - ПеречислениеСсылка.КонтурМаркировка_ТипыУпаковок - (необязательный) тип упаковки;
//   * ВидУпаковки   - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - (необязательный) вид упаковки;
//   * ТипШтрихкода  - ПеречислениеСсылка.КонтурМаркировка_ТипыШтрихкодов - (необязательный) тип штрихкода;
//   * ВидПродукции  - ПеречислениеСсылка.КонтурМаркировка_ВидыПродукции - вид продукции;
//   * КлючСтрокиТоваров - Строка - ключ строки товаров документа 1С;
//   * ВложенныеКоды - Массив - содержит структуры, см. функцию ОписаниеКодаМаркировки();
//   * ДанныеСервиса - Структура - дополнительные данные из сервиса;
//   * ОписаниеОшибки - Строка - описание ошибки при действиях с кодом;
//   * АналитикаНоменклатуры - Структура - содержит:
//      ** Номенклатура   - СправочникСсылка - номенклатура 1С;
//      ** Характеристика - СправочникСсылка - характеристика номенклатуры;
//      ** Упаковка       - СправочникСсылка - упаковка;
//      ** Серия          - СправочникСсылка - серия;
//   * ДопСведения - Структура - содержит:
//      ** ПолныйКод        - Строка - код маркировки с криптохвостом
//      ** СрокГодности     - Дата   - дата окончания срока годности;
//      ** ИдентификаторВСД - Строка - идентификатор ВСД;
//      ** Объем            - Число  - объем;
//
Функция ОписаниеКодаМаркировки(КодМаркировки = Неопределено, ВидПродукции = Неопределено) Экспорт
	
	Возврат МодульМаркировки().ОписаниеКодаМаркировки(КодМаркировки, ВидПродукции);
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().НайтиДокументУчетаПоДокументу1С()
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//
Функция ДокументУчета_Найти(Документ1С) Экспорт
	
	Возврат НайтиДокументУчетаПоДокументу1С(Документ1С);
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().СоздатьДокументУчетаПоДокументу1С()
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  НачатьРаботуСДокументом - Булево - если Истина, то с созданным документом учета сразу начинается работа;
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//
Функция ДокументУчета_Создать(Документ1С, НачатьРаботуСДокументом = Ложь) Экспорт
	
	Возврат СоздатьДокументУчетаПоДокументу1С(Документ1С, НачатьРаботуСДокументом);
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ВыполнитьОбменПоОрганизации()
//
// Выполняет обмен с сервисом Контур.Маркировка по указанной организации
//
// Параметры:
//  Организация - СправочникСсылка.КонтурМаркировка_Организации - организация;
//  ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - (необязательный) документ учета;
//
Процедура ВыполнитьОбменПоОрганизации(Организация, ДокументУчета = Неопределено) Экспорт
	
	МодульМаркировки().ВыполнитьОбменПоОрганизации(Организация, ДокументУчета);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().ВыполнитьОбменПоВсемОрганизациям()
//
// Выполняет обмен с сервисом Контур.Маркировка по всем организациям
//
Процедура ВыполнитьОбменПоВсемОрганизациям() Экспорт
	
	МодульМаркировки().ВыполнитьОбменПоВсемОрганизациям();
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().НайтиДокументУчетаПоДокументу1С()
//
// Находит документ учета в маркировке по документу 1С
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//
Функция НайтиДокументУчетаПоДокументу1С(Документ1С) Экспорт
	
	Возврат МодульМаркировки().НайтиДокументУчетаПоДокументу1С(Документ1С);
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().СоздатьДокументУчетаПоДокументу1С()
//
// Создает документ учета в маркировке по данным документа 1С
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  НачатьРаботу - Булево - Истина, если нужно начать работу с документом;
//  ЗагрузитьКоды - Булево - Ложь, если нужно отключить загрузку кодов через ПМ;
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета;
//
Функция СоздатьДокументУчетаПоДокументу1С(Документ1С, НачатьРаботу = Ложь, ЗагрузитьКоды = Истина) Экспорт
	
	Возврат МодульМаркировки().СоздатьДокументУчетаПоДокументу1С(Документ1С, НачатьРаботу, ЗагрузитьКоды);
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ПодобратьКодыИзСвободногоОстаткаВДокумент()
//
// Подбирает коды со свободного остатка в документ учета, связанный с документом 1С
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//
Процедура ПодобратьКодыИзСвободногоОстаткаВДокумент(Документ1С) Экспорт
	
	МодульМаркировки().ПодобратьКодыИзСвободногоОстаткаВДокумент(Документ1С);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().РазвернутаяТаблицаУпаковок()
//
// Возвращает таблицу упаковок и кодов маркировки с номенклатурой
// (характеристикой, серией), которая в них входит
//
// Параметры:
//  ВладельцыКодов   - Массив, ДокументСсылка - документы-владельцы штрихкодов;
//  ОшибкиЗаполнения - Массив - исходящий параметр, ошибки выполнения функции, содержит структуры с полями:
//   * ТекстОшибки        - Строка           - описание ошибки;
//   * ВладелецКодов      - ДокументСсылка   - документ-владелец штрихкодов, в котором возникла ошибка;
//   * ДокументМаркировки - СправочникСсылка - документ Контур.Маркировки, с которым связан документ-владелец;
//  ПроверитьЗавершениеРаботыСКодами - Булево - Истина, если нужно проверить, что работа с кодами завершена;
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица упаковок с товарными данными:
//   * Ссылка            - ДокументСсылка - документ-владелец штрихкода;
//   * Штрихкод          - СправочникСсылка.КонтурМаркировка_КодыУпаковок - ссылка на код упаковки;
//   * Номенклатура      - СправочникСсылка - содержимое;
//   * Характеристика    - СправочникСсылка - содержимое;
//   * Серия             - СправочникСсылка - содержимое;
//   * ЗначениеШтрихкода - Строка - код маркировки для заполнения документа ЭДО;
//   * Мультитоварная    - Булево - признак мультитоварной упаковки;
//   * ВидПродукции      - Перечислениессылка.КонтурМаркировка_ВидыПродукции - вид продукции кода маркировки;
//   * ВидУпаковки       - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки кода маркировки;
//
Функция РазвернутаяТаблицаУпаковок(ВладельцыКодов, ОшибкиЗаполнения = Неопределено
	, ПроверитьЗавершениеРаботыСКодами = Истина) Экспорт
	
	Результат = МодульМаркировки().РазвернутаяТаблицаУпаковок(ВладельцыКодов
	, ОшибкиЗаполнения, ПроверитьЗавершениеРаботыСКодами);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ЗаполнитьСведенияОМаркировке()
//
// Заполняет в таблице товаров сведения о маркировке для отправки через ЭДО
//
// Параметры:
//  ТоварыДокументов - ТаблицаЗначений - содержит строки товаров документов, по которым нужно заполнить таблицу;
//   * Номенклатура        - СправочникСсылка - номенклатура;
//   * Характеристика      - СправочникСсылка - характеристика;
//   * Серия               - СправочникСсылка - серия;
//   * Количество          - Число - количество в строке (ограничивает привязанные строки маркировки).
//   * КодТоварнойГруппы   - Число - код товарной группы в УПД;
//   * ПервичныйДокумент   - ДокументСсылка - первичный документ (накладная);
//   * СведенияОМаркировке - ТаблицаЗначений - (необязательный) таблица для заполнения, содержит колонки:
//     * ЗначениеШтрихкода - Строка - код маркировки товара или логистической упаковки;
//     * ВидУпаковки       - ПеречислениеСсылка.КонтурМаркировка_ВидыУпаковок - вид упаковки товара;
//     * GTIN              - Строка - GTIN товара в объемно-сортовом учете;
//     * Количество        - Число  - количество упаковок товара в объемно-сортовом учете;
//     * НомерПартии       - Строка - номер партии товара в объемно-сортовом учете;
//  ОшибкиЗаполнения - Массив - исходящий параметр, ошибки выполнения функции, содержит структуры с полями:
//   * ТекстОшибки        - Строка           - описание ошибки;
//   * ВладелецКодов      - ДокументСсылка   - документ-владелец штрихкодов, в котором возникла ошибка;
//   * ДокументМаркировки - СправочникСсылка - документ Контур.Маркировки, с которым связан документ-владелец;
//  ПроверитьЗавершениеРаботы - Булево - Истина, если нужно проверить, что работа с кодами завершена;
//
Процедура ЗаполнитьСведенияОМаркировке(ТоварыДокументов, ОшибкиЗаполнения = Неопределено
	, ПроверитьЗавершениеРаботыСКодами = Истина) Экспорт
	
	МодульМаркировки().ЗаполнитьСведенияОМаркировке(ТоварыДокументов, ОшибкиЗаполнения, ПроверитьЗавершениеРаботыСКодами);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().КодыДокументаИзСверкиНаПриемке()
//
// Возвращает коды из электронного документа, на основании которого создана сверка на приемке
//
// Параметры:
//  ОрганизацияПолучатель - СправочникСсылка - организация получатель электронного документа;
//  ИННОтправителя        - Строка - ИНН отправителя электронного документа;
//  НомерДокумента        - Строка - номер электронного документа;
//  ДатаДокумента         - Дата   - дата электронного документа (с точностью до дня);
//  ОписаниеОшибки        - Строка - исходящий параметр, содержит ошибку возникшую при выполнении функции;
// 
// Возвращаемое значение:
//  Массив - содержит структуры с полями:
//   * НомерСтроки        - Число  - номер строки в табличной части электронного документа;
//   * НаименованиеТовара - Строка - наименование товара;
//   * КодыМаркировки     - Массив - содержит структуры с полями:
//      ** КодМаркировки          - Строка - значение штрихкода;
//      ** ВложенныеКоды          - Массив - содержит аналогичные структуры с вложенными кодами;
//      ** Отсканирован           - Булево, Неопределено - Истина, если код был отсканирован;
//      ** ВведенВОборот          - Булево, Неопределено - Истина, если код введен в оборот
//                                                         Неопределено, если проверка не выполнялась;
//      ** ПринадлежитОтправителю - Булево, Неопределено - Истина, если код принадлежит отправителю
//                                                         Неопределено, если проверка не выполнялась;
//
Функция КодыДокументаИзСверкиНаПриемке(ОрганизацияПолучатель, ИННОтправителя, НомерДокумента, ДатаДокумента
	, ОписаниеОшибки = Неопределено) Экспорт
	
	Результат = МодульМаркировки().КодыДокументаИзСверкиНаПриемке(ОрганизацияПолучатель
	, ИННОтправителя, НомерДокумента, ДатаДокумента, ОписаниеОшибки);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ОбновитьСтатусыКодовДокумента()
//
// Получает статусы кодов маркировки по документу 1С из сервиса Контур.Маркировка
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
// 
// Возвращаемое значение:
//  Булево - Истина, если обновился статус хотя-бы у одного кода
//
Функция ОбновитьСтатусыКодовДокумента(Документ1С) Экспорт
	
	Результат = МодульМаркировки().ОбновитьСтатусыКодовДокумента(Документ1С);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().СоздатьОперациюПоДокументу()
//
// Создает операцию указанного типа, заполняет ее данными документа 1С и записывает в базу
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ТипОперации - Строка - тип операции, см. Перечисление_ТипыОпераций();
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_Операции - созданная операция;
//
Функция СоздатьОперациюПоДокументу(Документ1С, ТипОперации) Экспорт
	
	Результат = МодульМаркировки().СоздатьОперациюПоДокументу(Документ1С, ТипОперации);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().УдалитьОперацииПоДокументу()
//
// Удаляет все операции указанного типа по документу 1С
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ТипОпераций - Строка - тип удаляемых операций, см. Перечисление_ТипыОпераций();
//
Процедура УдалитьОперацииПоДокументу(Документ1С, ТипОпераций) Экспорт
	
	МодульМаркировки().УдалитьОперацииПоДокументу(Документ1С, ТипОпераций);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().УдалитьОперации()
//
// Удаляет операции маркировки из справочника
//
// Параметры:
//  МассивОпераций - Массив из СправочникСсылка.КонтурМаркировка_Операции
//
Процедура УдалитьОперации(МассивОпераций) Экспорт
	
	МодульМаркировки().УдалитьОперации(МассивОпераций);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().ПерезаполнитьОперацию()
//
// Перезаполняет операцию маркировки
//
// Параметры:
//  Операция - СправочникСсылка.КонтурМаркировка_Операции - операция
//
Процедура ПерезаполнитьОперацию(Операция) Экспорт
	
	МодульМаркировки().ПерезаполнитьОперацию(Операция);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().СтатусОперацииПоДокументу()
//
// Возвращает статус первой незавершенной операции или статус последней если все операции завершены
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ТипОперации - Строка - см. Перечисление_ТипыОпераций();
//
// Возвращаемое значение:
//  Строка - статус операции;
//
Функция СтатусОперацииПоДокументу(Документ1С, ТипОперации) Экспорт
	
	Результат = МодульМаркировки().СтатусОперацииПоДокументу(Документ1С, ТипОперации);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ОсновнойСтатусОперации()
//
// Возвращает основной статус операции
//
// Параметры:
//  Операция - СправочникСсылка.КонтурМаркировка_Операции - операция;
// 
// Возвращаемое значение:
//  Строка - см. Перечисление_СтатусыОпераций()
//
Функция ОсновнойСтатусОперации(Операция) Экспорт
	
	Результат = МодульМаркировки().ОсновнойСтатусОперации(Операция);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ОперацииПоДокументу()
//
// Возвращает массив операций указанного типа по документу
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ТипОпераций - Строка - см. Перечисление_ТипыОпераций();
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.КонтурМаркировка_Операции - операции;
//
Функция ОперацииПоДокументу(Документ1С, ТипОпераций) Экспорт
	
	Результат = МодульМаркировки().ОперацииПоДокументу(Документ1С, ТипОпераций);
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ДобавитьОперациюВОчередьОбмена()
//
// Добавляет операцию в регистр сведений очередь обмена
//
// Параметры:
//  Операция - СправочникСсылка.КонтурМаркировка_Операции - операция;
//
Процедура ДобавитьОперациюВОчередьОбмена(Операция) Экспорт
	
	МодульМаркировки().ДобавитьОперациюВОчередьОбмена(Операция);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().КодыМаркировкиДляНанесенияПоДокументу()
//
// Получает коды маркировки для печати этикеток по документу
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
// 
// Возвращаемое значение:
//  Массив из Строка - коды маркировки с криптохвостами
//
Функция КодыМаркировкиДляНанесенияПоДокументу(Документ1С) Экспорт
	
	Результат = МодульМаркировки().КодыМаркировкиДляНанесенияПоДокументу(Документ1С);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().МожноСформироватьОтчетОНанесенииПоДокументу()
//
// Проверяет наличие полных кодов, статуса кодов "Выпущен" и статуса пула кодов "Сгенерирован"
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
// 
// Возвращаемое значение:
//  Булево - Истина, когда по документу 1С можно сформировать отчет о нанесении
//
Функция МожноСформироватьОтчетОНанесенииПоДокументу(Документ1С) Экспорт
	
	Результат = МодульМаркировки().МожноСформироватьОтчетОНанесенииПоДокументу(Документ1С);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ОтметитьНапечатанныеКодыПоДокументу()
//
// Устанавливает дату печати кодов и основной статус операций печати по документу
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
//
Процедура ОтметитьНапечатанныеКодыПоДокументу(Документ1С) Экспорт
	
	МодульМаркировки().ОтметитьНапечатанныеКодыПоДокументу(Документ1С);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().СформироватьЭтикетки()
//
// Формирует этикетки по указанным шаблонам
//
// Параметры:
//  КодыМаркировки - Массив, Строка - нормализованные коды маркировки;
//  ШаблоныЭтикеток - Структура - содержит свойства:
//   * ШаблонТоварнойЭтикетки - СправочникСсылка.КонтурМаркировка_ШаблоныЭтикеток - шаблон этикетки для индивидуальной упаковки;
//   * ШаблонТранспортнойЭтикетки - СправочникСсылка.КонтурМаркировка_ШаблоныЭтикеток - шаблон этикетки для транспортной упаковки;
//   * ШаблонГрупповойЭтикетки - СправочникСсылка.КонтурМаркировка_ШаблоныЭтикеток - шаблон этикетки для групповой упаковки;
//  Документ1С - ДокументСсылка - (необязательный) документ 1С связанный с кодами;
//  ПечататьВложенныеКоды - Булево - (необязательный) Ложь, если этикетки для вложенных кодов печатать не нужно;
//  ДопПараметрыПечати - Структура - (необязательный) содержит свойства:
//   * ДопПараметрПечати1 - Произвольный - дополнительный параметр этикетки №1;
//   * ДопПараметрПечати2 - Произвольный - дополнительный параметр этикетки №2;
//   * ДопПараметрПечати3 - Произвольный - дополнительный параметр этикетки №3;
// 
// Возвращаемое значение:
//  ТабличныйДокумент - содержит сформированные этикетки
//
Функция СформироватьЭтикетки(КодыМаркировки
	, ШаблоныЭтикеток
	, Документ1С = Неопределено
	, ПечататьВложенныеКоды = Истина
	, ДопПараметрыПечати = Неопределено) Экспорт
	
	Результат = МодульМаркировки().СформироватьЭтикетки(КодыМаркировки
	, ШаблоныЭтикеток
	, Документ1С
	, ПечататьВложенныеКоды
	, ДопПараметрыПечати);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ЗаписатьДопСведенияКодов()
//
// Записывает дополнительные сведения кодов упаковок
//
// Параметры:
//  ОписанияИлиТаблицаКодов - Массив, Структура, Таблица значений - см. функцию ОписаниеКодаМаркировки() или ТаблицаНовыхКодов();
//
Процедура ЗаписатьДопСведенияКодов(ОписанияИлиТаблицаКодов) Экспорт
	
	МодульМаркировки().ЗаписатьДопСведенияКодов(ОписанияИлиТаблицаКодов);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().ДобавитьОбъемВПолныйКод()
//
// Добавляет в полный код информацию по объему: ПолныйКод + РазделительGS + 3103 + 6 символов объема в кг
//
// Параметры:
//  ОписанияИлиТаблицаКодов - Массив, Структура, Таблица значений - см. функцию ОписаниеКодаМаркировки() или ТаблицаНовыхКодов();
//  ЗаменитьGS - Булево - Истина, если необходимо заменить разделитель GS1 на его эквивалент \u001d;
//
Процедура ДобавитьОбъемВПолныйКод(ОписанияИлиТаблицаКодов, ЗаменитьGS = Ложь) Экспорт
	
	МодульМаркировки().ДобавитьОбъемВПолныйКод(ОписанияИлиТаблицаКодов, ЗаменитьGS);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().ДобавитьОбъемВПолныйКод()
//
// Генерирует нужное количество новых штрихкодов для агрегатов
//
// Параметры:
//  ВидАгрегата - СправочникСсылка.КонтурМаркировка_ВидыАгрегатов - вид агрегата;
//  Количество - Число - (необязательный) количество кодов, которые нужно сгенерировать;
// 
// Возвращаемое значение:
//  Массив - содержит строки с новыми кодами
//
Функция СформироватьНовыеКодыАгрегатов(ВидАгрегата, Количество = 1) Экспорт
	
	Возврат МодульМаркировки().СформироватьНовыеКодыАгрегатов(ВидАгрегата, Количество);
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ЗавершитьРаботуСДокументом()
//
// Завершает работу с документом.
// У связанного с документом 1С документа учета устанавливает следующие значения:
//  ДокументУчета.Статусы.ОсновнойСтатус = Завершен
//  ДокументУчета.Статусы.ТребуемоеДействие = РаботаЗавершена
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С
//
Процедура ЗавершитьРаботуСДокументом(Документ1С) Экспорт
	
	МодульМаркировки().ЗавершитьРаботуСДокументом(Документ1С);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().НайтиТоварПоGTIN()
//
// Находит товар маркировки по GTIN
//
// Параметры:
//  GTIN - Строка - GTIN, по которому нужно найти товар маркировки;
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурМаркировка_Товары - товары маркировки;
//  Неопределено - если найти товар не удалось;
//
Функция НайтиТоварПоGTIN(GTIN) Экспорт
	
	Возврат МодульМаркировки().НайтиТоварПоGTIN(GTIN);
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().РаспознатьКоды()
//
// Нормализует коды маркировки и создает карточки товаров если их нет
//
// Параметры:
//  ОписанияИлиТаблицаКодов - Массив, Таблица значений - содержит структуры см. функцию ОписаниеКодаМаркировки()
//                            или строки см. функцию ТаблицаНовыхКодов(), в которых поле КодМаркировки должно быть заполнено
//  Организация - СправочникСсылка.КонтурМаркировка_Организации - организация;
// 
// Возвращаемое значение:
//  Булево - Ложь, если при распознавании кодов возникли ошибки,
//           детали указаны в поле ОписаниеОшибки
//
Функция РаспознатьКоды(ОписанияИлиТаблицаКодов, Организация) Экспорт
	
	Возврат МодульМаркировки().РаспознатьКоды(ОписанияИлиТаблицаКодов, Организация);
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ДобавитьКодыВДокумент()
//
// Добавляет коды в документ
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С, в который нужно добавить коды;
//  ОписанияИлиТаблицаКодов - Массив, Структура, Таблица значений - см. функцию ОписаниеКодаМаркировки() или ТаблицаНовыхКодов();
//  УдалитьСтарыеКоды - Булево - Истина, если из документа нужно удалить старые коды;
//  ЗаполнитьТоварыДокумента - Булево - Истина, если товары документа нужно перезаполнить номенклатурой кодов;
//
Процедура ДобавитьКодыВДокумент(Документ1С, ОписанияИлиТаблицаКодов, УдалитьСтарыеКоды = Ложь, ЗаполнитьТоварыДокумента = Ложь) Экспорт
	
	МодульМаркировки().ДобавитьКодыВДокумент(Документ1С, ОписанияИлиТаблицаКодов, УдалитьСтарыеКоды, ЗаполнитьТоварыДокумента);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().ТаблицаНовыхКодов()
//
// Контракт таблицы кодов маркировки для добавления в документ
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//   * КодАгрегата - Строка - (необязательный) код родительской упаковки;
//   * КодМаркировки - Строка - код маркировки или агрегата;
//   * ИсходныйКодМаркировки - Строка - (необязательный) код маркировки до нормализации;
//   * СерийныйНомер - Строка - (необязательный) серийный номер товара;
//   * ОписаниеОшибки - Строка - (необязательный) описание ошибки при действиях с кодом;
//   * КлючКода - УникальныйИдентификатор - (необязательный) ключ кода маркировки;
//   * КлючАгрегата - УникальныйИдентификатор - (необязательный) ключ кода агрегата;
//   * КлючСтрокиДокумента - УникальныйИдентификатор - (необязательный) ключ строки документа учета;
//   * КлючСтрокиОперации - УникальныйИдентификатор - (необязательный) ключ строки документа операции;
//   * КодРазобран - Булево - Истина, если код успешно нормализован;
//   * ДляВнутреннегоУчета - Булево - признак использования кода только для внутреннего учета;
//   * ОбщийТипУпаковки - ПеречислениеСсылка.КонтурМаркировка_ОбщиеТипыУпаковок - (необязательный) общий тип упаковки;
//   * ТипУпаковки   - ПеречислениеСсылка.КонтурМаркировка_ТипыУпаковок - (необязательный) тип упаковки;
//   * ТипШтрихкода  - ПеречислениеСсылка.КонтурМаркировка_ТипыШтрихкодов - (необязательный) тип штрихкода;
//   * ВидПродукции  - ПеречислениеСсылка.КонтурМаркировка_ВидыПродукции - (необязательный) вид продукции;
//   * КлючНоменклатуры1С - КонтурМаркировка_КлючиНоменклатуры1С - (необязательный) ключ номенклатуры 1С;
//   * Товар - СправочникСсылка.КонтурМаркировка_Товары - (необязательный) товар маркировки;
//   * GTIN - Строка - (необязательный) код товара;
//   * ПолныйКод - Строка - (необязательный) код маркировки с криптохвостом;
//   * ДатаСрокаГодности - Дата - (необязательный) дата окончания срока годности;
//   * ДатаПроизводства - Дата - (необязательный) дата производства;
//   * Объем - Число - (необязательный) объем или вес;
//   * ИдентификаторВСД - Строка - (необязательный) идентификатор ВСД;
//   * КодТНВЭД - Строка - (необязательный) код ТНВЭД;
//   * Производитель - СправочникСсылка.КонтурМаркировка_Контрагенты - (необязательный) производитель;
//   * ПроизводительИНН - Строка - ИНН (необязательный) производителя;
//   * ПроизводительНаименование - Строка - (необязательный) наименование производителя;
//   * Владелец - СправочникСсылка.КонтурМаркировка_Контрагенты - (необязательный) владелец;
//   * ВладелецИНН - Строка - (необязательный) ИНН владельца;
//   * ВладелецНаименование - Строка - (необязательный) наименование владельца;
//   * Номенклатура - СправочникСсылка - (необязательный) номенклатура 1С;
//   * Характеристика - СправочникСсылка - (необязательный) характеристика номенклатуры;
//   * Упаковка - СправочникСсылка - (необязательный) упаковка;
//   * Серия - СправочникСсылка - (необязательный) серия;
//
Функция ТаблицаНовыхКодов() Экспорт
	
	Возврат МодульМаркировки().ТаблицаНовыхКодов();
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ТаблицаКодовДокумента()
//
// Получает таблицу кодов маркировки по документу 1С
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ЗаменитьGS - Булево - Истина, если необходимо заменить разделитель GS1 на его эквивалент \u001d
// 
// Возвращаемое значение:
//  Таблица значений - см. ТаблицаНовыхКодов()
//
Функция ТаблицаКодовДокумента(Документ1С, ЗаменитьGS = Ложь) Экспорт
	
	Результат = МодульМаркировки().ТаблицаКодовДокумента(Документ1С, ЗаменитьGS);
	
	Возврат Результат;
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().ПМ_ОбработатьСобытие()
//
// Вызывает обработку события подключаемого модуля
//
// Параметры:
//  ИмяСобытия - Строка - имя события подключаемого модуля;
//  ПараметрыСобытия - Структура - параметры события;
//  СтандартнаяОбработка - Булево - признак стандартной обработки события;
//
Процедура ПМ_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка = Истина) Экспорт
	
	МодульМаркировки().ПМ_ОбработатьСобытие(ИмяСобытия, ПараметрыСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировки().Перечисление_ТипыОпераций()
//
Функция Перечисление_ТипыОпераций() Экспорт
	
	Возврат МодульМаркировки().Перечисление_ТипыОпераций();
	
КонецФункции

// Устарела. Следует использовать МодульМаркировки().Перечисление_СтатусыОпераций()
//
Функция Перечисление_СтатусыОпераций() Экспорт
	
	Возврат МодульМаркировки().Перечисление_СтатусыОпераций();
	
КонецФункции

// #КонецОбласти

#КонецЕсли
