
&НаКлиенте
Процедура НоменклатураСОстаткамиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	МассивСтрок = Элементы.НоменклатураСОстатками.ВыделенныеСтроки;
	
	МассивДанных = Новый Массив;
	
	Для каждого Товар Из МассивСтрок Цикл
		СтрукТовар = Новый Структура;
		СтрукТовар.Вставить("Ссылка", Товар.Ссылка);
		ВНаличииОстаток = ОстатокТовараНаСкладеПоСсылке(Товар.Ссылка);
		СтрукТовар.Вставить("ВНаличииОстаток", ВНаличииОстаток);
		МассивДанных.Добавить(СтрукТовар);
	КонецЦикла; 
	
	Для каждого ВыбСтрока Из МассивДанных Цикл
		ВыбНом = ВыбраннаяНоменклатура.Добавить();
		ВыбНом.Номенклатура =  ВыбСтрока.Ссылка;
		ВыбНом.Количество =  ВыбСтрока.ВНаличииОстаток;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ОстатокТовараНаСкладеПоСсылке(Ссылка)
	                                       
	Запрос = Новый Запрос;   
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатПартииТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	уатПартииТоваровНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.уатПартииТоваровНаСкладах.Остатки КАК уатПартииТоваровНаСкладахОстатки
	|ГДЕ
	|	уатПартииТоваровНаСкладахОстатки.Склад = &Склад
	|	И уатПартииТоваровНаСкладахОстатки.Номенклатура = &Номенклатура";	
	
	Запрос.УстановитьПараметр("Номенклатура", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.КоличествоОстаток;
	
КонецФункции

&НаКлиенте
Процедура ЗакончитьПодбор(Команда)
	МассивТоваров = Новый Массив;
	Для каждого Товар Из ВыбраннаяНоменклатура Цикл
		нСтрукт = Новый Структура;
		нСтрукт.Вставить("Номенклатура", Товар.Номенклатура);
		нСтрукт.Вставить("Количество", Товар.Количество);
		МассивТоваров.Добавить(нСтрукт);
	КонецЦикла; 
	
	Оповестить("ОбработкаОповещенияНаСервере",МассивТоваров,ЭтаФорма);
	ЭтаФорма.Закрыть();
КонецПроцедуры


