Процедура СвойстваЭлементов_Перетаскивание(Форма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, ИдентификаторСтрокиНазначения, Поле) Экспорт

	СвойстваЭлементов = Форма.НастройкаПолей_СвойстваЭлементов;
	
	СтандартнаяОбработка = Ложь;
	СтрокаНазначения = СвойстваЭлементов.НайтиПоИдентификатору(ИдентификаторСтрокиНазначения);
	Если НЕ (СтрокаНазначения.ТипЭлементаНастройки="Поле" ИЛИ СтрокаНазначения.ТипЭлементаНастройки="Страница") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаНазначения.ТипЭлементаНастройки="Поле" Тогда
		СтрокаРодитель = СтрокаНазначения.ПолучитьРодителя();
		Индекс = СтрокаРодитель.ПолучитьЭлементы().Индекс(СтрокаНазначения);
	Иначе
		СтрокаРодитель = СтрокаНазначения;
		Индекс = СтрокаРодитель.ПолучитьЭлементы().Количество();
	КонецЕсли;
	
	СтрокиДляУдаления = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ПараметрыПеретаскивания.Значение Цикл
		Строка = СвойстваЭлементов.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если Строка.ТипЭлементаНастройки <> "Поле" Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиДляУдаления.Добавить(Строка);
		
		НоваяСтрока = СтрокаРодитель.ПолучитьЭлементы().Вставить(Индекс);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Страница = СтрокаРодитель.Страница;
		Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Если СтрокиДляУдаления.Количество() > 0 Тогда
		Для Каждого Строка Из СтрокиДляУдаления Цикл
			Строка.ПолучитьРодителя().ПолучитьЭлементы().Удалить(Строка);
		КонецЦикла;
		
		СвойстваЭлементов_ПриИзменении(Форма);
	КонецЕсли;
	
КонецПроцедуры

Функция НастройкаПолей_Команда(Форма, Команда) Экспорт
	
	ИмяКоманды = Команда.Имя;
	
	Если ИмяКоманды="НастройкаПолей_СвойстваЭлементов_ДобавитьСтраницу" Тогда
		СвойстваЭлементов_ДобавитьСтраницуНаФорме(Форма);
	КонецЕсли;
	
КонецФункции

Функция СвойстваЭлементов_ДобавитьСтраницуНаФорме(Форма)
	
	КорневыеЭлементы = Форма.НастройкаПолей_СвойстваЭлементов.ПолучитьЭлементы();
	Если КорневыеЭлементы.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭлементФормы = КорневыеЭлементы[0];
	
	ЭлементСтраницы = ЭлементФормы.ПолучитьЭлементы().Добавить();
	ЭлементСтраницы.ТипЭлементаНастройки = "Страница";
	ЭлементСтраницы.Имя = "Страница";

	ПриИзмененииЭлементаНастройки(Форма, ЭлементСтраницы);
	
	Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущаяСтрока = ЭлементСтраницы.ПолучитьИдентификатор();
	
	СвойстваЭлементов_ПриИзменении(Форма);

КонецФункции

Функция ПриИзмененииЭлементаНастройки(Форма, ЭлементНастройки) Экспорт

	УстановитьКартинкуНастройкиЭлементаНаФорме(Форма, ЭлементНастройки);
	
	Если ЭлементНастройки.ТипЭлементаНастройки="Страница" Тогда
		УдалитьПрефиксСтраницыОперацииНаФорме(Форма, ЭлементНастройки);
		УстановитьСвойствоСтраницаДляЭлементаСтраница(Форма, ЭлементНастройки);
	КонецЕсли;
	
КонецФункции

Процедура СвойстваЭлементов_ПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр) Экспорт
	
#Если Клиент Тогда
	Отказ = Истина;
	ЭлементРодительИдентификатор = Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущаяСтрока;
	Если ЭлементРодительИдентификатор=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементРодитель = Форма.НастройкаПолей_СвойстваЭлементов.НайтиПоИдентификатору(ЭлементРодительИдентификатор);
	Если ЭлементРодитель.ТипЭлементаНастройки="Поле" Тогда
		ЭлементСосед = ЭлементРодитель;
		ЭлементРодитель = ЭлементСосед.ПолучитьРодителя();
		ЭлементыСоседи = ЭлементРодитель.ПолучитьЭлементы();
		Индекс = ЭлементыСоседи.Индекс(ЭлементСосед);
	Иначе
		ЭлементыСоседи = ЭлементРодитель.ПолучитьЭлементы();
		Индекс = ЭлементыСоседи.Количество();
	КонецЕсли;
	
	Если ЭлементРодитель.ТипЭлементаНастройки <> "Страница" Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКДанным = "";
	Если Копирование Тогда
		Если ЭлементСосед <> Неопределено Тогда
			ПутьКДанным = ЭлементСосед.ПутьКДаннымЗаполнения;
		КонецЕсли;
	КонецЕсли;

	СКДРеквизитовЗадания = вмс_НастройкиПолейЗаданияВызовСервера.СКДРеквизитовЗадания(Форма.НастройкаПолей_Контекст);
	ФормаВыбораРеквизитаОбъекта = ОткрытьФорму("ОбщаяФорма.вмс_ФормаВыбораРеквизитаОбъекта", Новый Структура("Объект, ПутьКДанным", СКДРеквизитовЗадания, ПутьКДанным), Форма);
	ФормаВыбораРеквизитаОбъекта.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбработчикВыбораПоля", вмс_НастройкиПолейЗадания, Новый Структура("Форма, НастройкаПоля, Родитель, Сосед", Форма, Неопределено, ЭлементРодитель, ЭлементСосед));
#КонецЕсли

КонецПроцедуры

Процедура СвойстваЭлементов_Имя_НачалоВыбора(Форма, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
#Если Клиент Тогда
	НастройкаЭлементаИдентификатор = Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущаяСтрока;
	Если НастройкаЭлементаИдентификатор=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаЭлемента = Форма.НастройкаПолей_СвойстваЭлементов.НайтиПоИдентификатору(НастройкаЭлементаИдентификатор);
	ПутьКДанным = НастройкаЭлемента.ПутьКДаннымЗаполнения;
	
	СКДРеквизитовЗадания = вмс_НастройкиПолейЗаданияВызовСервера.СКДРеквизитовЗадания(Форма.НастройкаПолей_Контекст);
	ФормаВыбораРеквизитаОбъекта = ОткрытьФорму("ОбщаяФорма.вмс_ФормаВыбораРеквизитаОбъекта", Новый Структура("Объект, ПутьКДанным", СКДРеквизитовЗадания, ПутьКДанным), Форма);
	ФормаВыбораРеквизитаОбъекта.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбработчикВыбораПоля", вмс_НастройкиПолейЗадания, Новый Структура("Форма, НастройкаПоля, Родитель, Сосед", Форма, НастройкаЭлемента));
#КонецЕсли

КонецПроцедуры

Процедура ОбработчикВыбораПоля(ПолеСКД, ДополнительныеПараметры) Экспорт

	Если ПолеСКД=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	Форма.Модифицированность = Истина;
	
	НастройкаПоля = ДополнительныеПараметры.НастройкаПоля;
	Если НастройкаПоля = Неопределено Тогда
		РодительНастройкиПоля = ДополнительныеПараметры.Родитель;
		СоседиНастройкиПоля = РодительНастройкиПоля.ПолучитьЭлементы();
		Если ДополнительныеПараметры.Сосед = Неопределено Тогда
			Индекс = СоседиНастройкиПоля.Количество();
		Иначе
			Индекс = СоседиНастройкиПоля.Индекс(ДополнительныеПараметры.Сосед);
		КонецЕсли;
		
		НастройкаПоля = СоседиНастройкиПоля.Вставить(Индекс);
		ЗаполнитьЗначенияСвойств(НастройкаПоля, РодительНастройкиПоля, , "Имя");
		НастройкаПоля.Вывод = Истина;
		НастройкаПоля.ТипЭлементаНастройки = "Поле";
		НастройкаПоля.ПоложениеЗаголовка = "Авто";
		
		Новая = Истина;
	Иначе
		Новая = Ложь;
	КонецЕсли;
	
	ПутьКДанным = Строка(ПолеСКД.Поле);
	ПутьКДаннымМассив = вмс_РаботаСКоллекциями.ЗначениеВМассив(ПутьКДанным, ".", Ложь);
	
	НастройкаПоля.Имя = ПутьКДаннымМассив[ПутьКДаннымМассив.ВГраница()];
	НастройкаПоля.Синоним = НастройкаПоля.Имя;
	НастройкаПоля.ПутьКДаннымЗаполнения = ПутьКДанным;
	
	ЗначенияСвойствПоляПоУмолчанию = вмс_НастройкиПолейЗаданияВызовСервера.ПолучитьЗначенияСвойствПоляОперацииПоУмолчанию(Форма.НастройкаПолей_Контекст, НастройкаПоля.Имя);
	ЗначенияСвойствПоляПоУмолчанию.Удалить("Страница");
	ЗначенияСвойствПоляПоУмолчанию.Удалить("Вывод");
	ЗаполнитьЗначенияСвойств(НастройкаПоля, ЗначенияСвойствПоляПоУмолчанию);
	
	ПриИзмененииЭлементаНастройки(Форма, НастройкаПоля);
	
	Если Новая Тогда
		Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущаяСтрока = НастройкаПоля.ПолучитьИдентификатор();
	Иначе
		СвойстваЭлемента_ПриАктивизацииСтрокиНаФорме(Форма);
	КонецЕсли;
	
	СвойстваЭлементов_ПриИзменении(Форма);
	
КонецПроцедуры

Функция СвойстваЭлементов_Имя_ПриИзменении(Форма) Экспорт
	
	СвойстваЭлементаИдентификатор = Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущаяСтрока;
	СвойстваЭлемента = Форма.НастройкаПолей_СвойстваЭлементов.НайтиПоИдентификатору(СвойстваЭлементаИдентификатор);
	ПриИзмененииЭлементаНастройки(Форма, СвойстваЭлемента);
	
КонецФункции

Функция СвойстваЭлементов_Ввод_ПриИзменении(Форма) Экспорт
	
	СвойстваЭлементаИдентификатор = Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущаяСтрока;
	СвойстваЭлемента = Форма.НастройкаПолей_СвойстваЭлементов.НайтиПоИдентификатору(СвойстваЭлементаИдентификатор);

	СвойстваЭлемента.ОбязательныйВвод = Истина;
	СвойстваЭлемента.ОбязательноеЗаполнение = Истина;
	
КонецФункции

Процедура СвойстваЭлемента_ПриАктивизацииСтрокиНаФорме(Форма) Экспорт

	РК = вмс_РаботаСКоллекциями;
	
	СвойстваЭлементаИдентификатор = Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущаяСтрока;

	Форма.НастройкаПолей_ДополнительныеСвойстваЭлемента.Очистить();

	Если СвойстваЭлементаИдентификатор=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваЭлемента = Форма.НастройкаПолей_СвойстваЭлементов.НайтиПоИдентификатору(СвойстваЭлементаИдентификатор);

	ОписаниеДополнительныхСвойствЭлемента = вмс_НастройкиПолейЗаданияВызовСервера.ОписаниеДополнительныхСвойствЭлементаНастройки(Форма.НастройкаПолей_Контекст, СвойстваЭлемента.ТипЭлементаНастройки);
	
	Для Каждого ОписаниеСвойства Из ОписаниеДополнительныхСвойствЭлемента Цикл
		ДополнительнаяНастройкаЭлемента = Форма.НастройкаПолей_ДополнительныеСвойстваЭлемента.Добавить();
		ДополнительнаяНастройкаЭлемента.Свойство = ОписаниеСвойства.ИмяСвойства;
		ДополнительнаяНастройкаЭлемента.Значение = СвойстваЭлемента[ОписаниеСвойства.ИмяСвойства];
	КонецЦикла;
	
КонецПроцедуры

Функция СвойстваЭлементов_ПриИзменении(Форма) Экспорт
	
	ПараметрыОповщения = Новый Структура("СтандартнаяОбработка", Истина);
	
	#Если Клиент Тогда
	Оповестить("НастройкаПолей_ПриИзменении", ПараметрыОповщения, Форма);
	#КонецЕсли
	
	Если ПараметрыОповщения.СтандартнаяОбработка Тогда
		УстановитьПризнакНесохраненныхИзмененийНастройкиПолей(Форма, Истина);
	КонецЕсли;
	
КонецФункции

Функция ДополнительныеСвойстваЭлемента_ПриАктивизацииСтрокиНаФорме(Форма) Экспорт
	
	ДополнительныеСвойстваЭлементаИдентификатор = Форма.Элементы.НастройкаПолей_ДополнительныеСвойстваЭлемента.ТекущаяСтрока;
	Если ДополнительныеСвойстваЭлементаИдентификатор=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СвойстваЭлементаИдентификатор = Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущаяСтрока;
	Если СвойстваЭлементаИдентификатор=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РК = вмс_РаботаСКоллекциями;
	
	СвойстваЭлемента = Форма.НастройкаПолей_СвойстваЭлементов.НайтиПоИдентификатору(СвойстваЭлементаИдентификатор);
	ДополнительныеСвойстваЭлемента = Форма.НастройкаПолей_ДополнительныеСвойстваЭлемента.НайтиПоИдентификатору(ДополнительныеСвойстваЭлементаИдентификатор);
	
	ОписаниеДополнительногоСвойстваЭлементаНастройки = вмс_НастройкиПолейЗаданияВызовСервера.ОписаниеДополнительногоСвойстваЭлементаНастройки(Форма.НастройкаПолей_Контекст, СвойстваЭлемента.ТипЭлементаНастройки, ДополнительныеСвойстваЭлемента.Свойство);
	Если ОписаниеДополнительногоСвойстваЭлементаНастройки=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПолеВводаЗначения = Форма.Элементы.НастройкаПолей_ДополнительныеСвойстваЭлемента_Значение;
	
	ПолеВводаЗначения.ОграничениеТипа = ОписаниеДополнительногоСвойстваЭлементаНастройки.ТипСвойства;

	Если ОписаниеДополнительногоСвойстваЭлементаНастройки.СписокВыбора <> Неопределено Тогда
		СписокВыбораМассив = РК.ЗначениеВМассив(ОписаниеДополнительногоСвойстваЭлементаНастройки.СписокВыбора);
		ПолеВводаЗначения.РежимВыбораИзСписка = Истина;
		ПолеВводаЗначения.КнопкаВыпадающегоСписка = Истина;
		ПолеВводаЗначения.СписокВыбора.ЗагрузитьЗначения(СписокВыбораМассив);
	Иначе
		ПолеВводаЗначения.РежимВыбораИзСписка = Ложь;
		ПолеВводаЗначения.КнопкаВыпадающегоСписка = Ложь;
		ПолеВводаЗначения.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецФункции

Функция ДополнительныеСвойстваЭлемента_Значение_ПриИзмененииНаФорме(Форма) Экспорт
	
	СвойстваЭлементаИдентификатор = Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущаяСтрока;
	ДополнительноеСвойствоЭлементаИдентификатор = Форма.Элементы.НастройкаПолей_ДополнительныеСвойстваЭлемента.ТекущаяСтрока;
	
	СвойстваЭлемента = Форма.НастройкаПолей_СвойстваЭлементов.НайтиПоИдентификатору(СвойстваЭлементаИдентификатор);
	ДополнительноеСвойствоЭлемента = Форма.НастройкаПолей_ДополнительныеСвойстваЭлемента.НайтиПоИдентификатору(ДополнительноеСвойствоЭлементаИдентификатор);
	
	СвойстваЭлемента[ДополнительноеСвойствоЭлемента.Свойство] = ДополнительноеСвойствоЭлемента.Значение;
	УстановитьКартинкуНастройкиЭлементаНаФорме(Форма, СвойстваЭлемента);  
	
КонецФункции

Функция ДополнительныеСвойстваЭлемента_ПриИзменении(Форма) Экспорт
	
	СвойстваЭлементов_ПриИзменении(Форма);
	
КонецФункции

Функция УстановитьКартинкуНастройкиЭлементаНаФорме(Форма, НастройкаЭлемента) Экспорт
	
	Если НастройкаЭлемента.ТипЭлементаНастройки="Страница" Тогда
		НастройкаЭлемента.КартинкаЭлемента = БиблиотекаКартинок.вмс_Папка;
	ИначеЕсли НастройкаЭлемента.ТипЭлементаНастройки="Поле" Тогда
		НастройкаЭлемента.КартинкаЭлемента = ?(НастройкаЭлемента.Ресурс, БиблиотекаКартинок.вмс_Ресурс, БиблиотекаКартинок.вмс_Реквизит);
	КонецЕсли;
	
КонецФункции

Функция УдалитьПрефиксСтраницыОперацииНаФорме(Форма, НастройкаСтраницы) Экспорт

	ПрефиксСтраницОперации = ПолучитьСвойствоКонтекстаФормы(Форма, "ПрефиксСтраницОперации");
	
	Имя = НастройкаСтраницы.Имя;
	Если СтрНайти(нрег(Имя), нрег(ПрефиксСтраницОперации))=1 Тогда
		НастройкаСтраницы.Имя = Прав(Имя, СтрДлина(Имя)-СтрДлина(ПрефиксСтраницОперации));
	КонецЕсли;
	
	Возврат НастройкаСтраницы.Имя;
	
КонецФункции

Функция УстановитьСвойствоСтраницаДляЭлементаСтраница(Форма, ЭлементСтраницы)
	
	Страница = ПолучитьСвойствоКонтекстаФормы(Форма, "ПрефиксСтраницОперации") + ЭлементСтраницы.Имя;
	
	Для Каждого ЭлементПоля Из вмс_РаботаСКоллекциями.ПолучитьПодчиненныеЭлементыКоллекции(ЭлементСтраницы) Цикл
		ЭлементПоля.Страница = Страница;
	КонецЦикла;
	
	ЭлементСтраницы.Страница = Страница;
	
КонецФункции

Функция УстановитьПризнакНесохраненныхИзмененийНастройкиПолей(Форма, Признак) Экспорт
	
	Форма.Модифицированность = Истина;
	УстановитьСвойствоКонтекстаФормы(Форма, "ПризнакНесохраненныхИзмененийНастройкиПолей", Признак);
	
КонецФункции

Функция ПолучитьСвойствоКонтекстаФормы(Форма, ИмяСвойства) Экспорт
	
	Возврат вмс_НастройкиПолейЗаданияВызовСервера.ПолучитьСвойствоКонтекстаФормы(Форма.НастройкаПолей_Контекст, ИмяСвойства);
	
КонецФункции

Функция УстановитьСвойствоКонтекстаФормы(Форма, ИмяСвойства, Значение) Экспорт

	Возврат вмс_НастройкиПолейЗаданияВызовСервера.УстановитьСвойствоКонтекстаФормы(Форма.НастройкаПолей_Контекст, ИмяСвойства, Значение);
	
КонецФункции

Функция СтруктураНастройкиПолейИзДанныхФормы(Форма) Экспорт
	
	СтруктураНастройкиПолей = вмс_НастройкиПолейЗаданияВызовСервера.СтруктураНастройкиПолейПоУмолчанию();
	
	ОТСтрока = Новый ОписаниеТипов("Строка");
	
	ОбходЭлементов = Новый Массив;
	Для Каждого Элемент Из Форма.НастройкаПолей_СвойстваЭлементов.ПолучитьЭлементы() Цикл
		ОбходЭлементов.Добавить(Элемент);
	КонецЦикла;
	
	ОбщиеНастройки = Неопределено;
	НастройкиСтраниц = Новый Массив;
	НастройкиПолей = Новый Массив;
	Для Каждого Элемент Из ОбходЭлементов Цикл
		Если Элемент.ТипЭлементаНастройки="Форма" Тогда
			ОбщиеНастройки = Элемент;
		ИначеЕсли Элемент.ТипЭлементаНастройки="Страница" Тогда
			НастройкиСтраниц.Добавить(Элемент);
		ИначеЕсли Элемент.ТипЭлементаНастройки="Поле" Тогда
			НастройкиПолей.Добавить(Элемент);
		КонецЕсли;
		
		Для Каждого СубЭлемент Из Элемент.ПолучитьЭлементы() Цикл
			ОбходЭлементов.Добавить(СубЭлемент);
		КонецЦикла;
	КонецЦикла;
	
	СтруктураНастройкиПолей.НастройкаСтраниц.Очистить();
	Для Каждого Элемент Из НастройкиСтраниц Цикл
		НастройкаСтраницы = СтруктураНастройкиПолей.НастройкаСтраниц.Добавить();
		ЗаполнитьЗначенияСвойств(НастройкаСтраницы, Элемент);
		НастройкаСтраницы.Имя = Элемент.Страница;
	КонецЦикла;
	
	УдалитьНеиспользуемыеСборщикиДанных(СтруктураНастройкиПолей);
	
	Если ОбщиеНастройки <> Неопределено Тогда
		МетаданныеОбщихСвойствНастройкиПолей = ПолучитьСвойствоКонтекстаФормы(Форма, "МетаданныеНастройкиПолей.Реквизиты");

		Для Каждого ЭлементМетаданныеОбщегоСвойстваНастройкиПолей Из МетаданныеОбщихСвойствНастройкиПолей Цикл
			ИмяСвойства = ЭлементМетаданныеОбщегоСвойстваНастройкиПолей.Ключ;
			СтруктураНастройкиПолей[ИмяСвойства] = ОбщиеНастройки[ИмяСвойства];
		КонецЦикла;
	КонецЕсли;
	
	МетаданныеСвойствЭлементовНастройки = ПолучитьСвойствоКонтекстаФормы(Форма, "МетаданныеНастройкиПолей.ТабличныеЧасти.НастройкаПолей.Реквизиты");
	
	СтруктураНастройкиПолей.НастройкаПолей.Очистить();
	Для Каждого Элемент Из НастройкиПолей Цикл
		НастройкаПоля = СтруктураНастройкиПолей.НастройкаПолей.Добавить();
		Для Каждого ЭлементМетаданныеСвойстваЭлементаНастройки Из МетаданныеСвойствЭлементовНастройки Цикл
			ИмяСвойства = ЭлементМетаданныеСвойстваЭлементаНастройки.Ключ;
			НастройкаПоля[ИмяСвойства] = Элемент[ИмяСвойства];
		КонецЦикла;
		НастройкаПоля.ПорядокВвода = СтруктураНастройкиПолей.НастройкаПолей.Количество();
	КонецЦикла;
	
	Возврат СтруктураНастройкиПолей;
	
КонецФункции

Функция УдалитьНеиспользуемыеСборщикиДанных(СтруктураНастройкиПолей)
	УдалитьСборщикиДанных = Новый Массив;
	Для Каждого СборщикДанных Из СтруктураНастройкиПолей.СборщикиДанных Цикл
		Если СтруктураНастройкиПолей.НастройкаСтраниц.НайтиСтроки(Новый Структура("СборщикДанных", СборщикДанных.Имя)).Количество()=0 Тогда
			УдалитьСборщикиДанных.Добавить(СборщикДанных);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СборщикДанных Из УдалитьСборщикиДанных Цикл
		СтруктураНастройкиПолей.СборщикиДанных.Удалить(СборщикДанных);
	КонецЦикла;
КонецФункции


Функция ПрочитатьСериализированныеДанные(СтрокаXML, Кэш=Неопределено) Экспорт
	
	Если СтрокаXML="" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Кэш) <> Тип("Структура") Тогда
		Кэш = Новый Структура;
	КонецЕсли;
	
	Если Кэш.Свойство("ПараметрыЧтенияXML") Тогда
		ПараметрыЧтенияXML = Кэш.ПараметрыЧтенияXML;
	Иначе
		ПараметрыЧтенияXML = вмс_РаботаСXMLКлиентСервер.ПолучитьПараметрыЧтенияXML();
		Кэш.Вставить("ПараметрыЧтенияXML", ПараметрыЧтенияXML);
	КонецЕсли;
	
	ПараметрыЧтенияXML.ЧтениеXML.УстановитьСтроку(СтрокаXML);
	Попытка
		ПараметрыЧтенияXML.ЧтениеXML.Прочитать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Значение = вмс_РаботаСXMLКлиентСервер.ПрочитатьОбъект(ПараметрыЧтенияXML);
	
	Возврат Значение;
	
КонецФункции

Функция СериализоватьДанные(Значение) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ПараметрыЗаписиXML = вмс_РаботаСXMLКлиентСервер.ПолучитьПараметрыЗаписиXML(ЗаписьXML, Истина);

	вмс_РаботаСXMLКлиентСервер.ПодготовитьОбъектыИЗначенияСвойствОбъектовДляЗаписи(ПараметрыЗаписиXML, Значение);
	
	вмс_РаботаСXMLКлиентСервер.ЗаписатьОбъект(Значение, ПараметрыЗаписиXML);
	
	СтрокаXML = ЗаписьXML.Закрыть();
	
	Возврат СтрокаXML;
	
КонецФункции