
Функция ЗаписатьДокументСписанияОтобранныхИПроверенныхТоваровПоЗаданиям(Задания, Реквизиты=Неопределено) Экспорт
	
	Документ = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
	Документ.Заполнить(Неопределено);
	Документ.Дата = ТекущаяДата();
	Если ТипЗнч(Реквизиты) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Документ, Реквизиты);
	КонецЕсли;
	
	Документ.ЗаполнитьТаблицуТоваровПоОтгрузкеЗаданий(Задания); 
	// ТУ_Прошин 17.04.2023++
	Документ.ДополнительныеСвойства.Вставить("ОбменДанными", Истина);
    // ТУ_Прошин 17.04.2023--
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
КонецФункции  

Функция ЗаписатьДокументСписанияТоваров(ТаблицаКонтейнеров, Реквизиты=Неопределено) Экспорт

	Документ = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
	Документ.Заполнить(Неопределено);
	Документ.Дата = ТекущаяДата();
	Если ТипЗнч(Реквизиты) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Документ, Реквизиты);
	КонецЕсли;
	
	Документ.ЗаполнитьТаблицуТоваровПоОтгрузкеЗаданий(ТаблицаКонтейнеров);  
	// ТУ_Прошин 17.04.2023++
	Документ.ДополнительныеСвойства.Вставить("ОбменДанными", Истина);   
	// ТУ_Прошин 17.04.2023--
	Документ.Записать(РежимЗаписиДокумента.Запись);	

КонецФункции // ЗаписатьДокументСписанияТоваров()

Функция ПолучитьСсылкиНовыхДокументов(КоличествоНовыхСсылок) Экспорт

	СсылкиНовыхОбъектов = Новый Массив;
	Для НомерСсылки=1 По КоличествоНовыхСсылок Цикл
		СсылкиНовыхОбъектов.Добавить(ПолучитьСсылку());
	КонецЦикла;
		
	Возврат СсылкиНовыхОбъектов;
	
КонецФункции


