
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоздатьЭлементыФормы();
	ЗаполнитьСпискиВыбора();
	
	Если Параметры.Свойство("КлючКода") И ЗначениеЗаполнено(Параметры.КлючКода) Тогда
		КлючКода = Параметры.КлючКода;
		ПрочитатьИнформациюПоКодуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

//#КонецОбласти

// #Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлючКодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДлинаУИД = 36;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВводаКлючаКода", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВводаСтроки(ОписаниеОбработчика, Строка(КлючКода) , "Введите ключ кода", ДлинаУИД);
	
КонецПроцедуры

&НаКлиенте
Процедура КодМаркировкиПриИзменении(Элемент)
	
	КлючКода = Неопределено;
	
	ПрочитатьИнформациюПоКодуНаСервере();
	НастроитьЭлементыФормы();
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСвязанныеРегистры Тогда
		ОбновитьДинамическиеСпискиСвязанныхРегистров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодАгрегатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МодульКлиента().ОткрытьФормуРедактораКодаМаркировки(КлючАгрегата, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КодМаркировкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(КлючКода) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуКодаМаркировки(КлючКода, , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолныйКодОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВводаПолногоКода", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВводаСтроки(ОписаниеОбработчика, ПолныйКод, НСтр("ru='Введите полный код маркировки'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлСПолнымКодомОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ФайлСПолнымКодом) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораСпособаОткрытияФайлаПолногоКода", ЭтаФорма);
	
	СпособыОткрытия = МодульКлиента().СписокСпособовОткрытияЗначения();
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика, СпособыОткрытия, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСпособаОткрытияФайлаПолногоКода(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СпособыОткрытияЗначения = МодульКлиента().Перечисление_СпособыОткрытияЗначения();
	
	Если Результат.Представление = СпособыОткрытияЗначения.ВФормеОбъекта Тогда
		МодульКлиента().ОткрытьФормуОбъектаИС(ФайлСПолнымКодом);
	Иначе
		АдресТаблицы = ПоместитьДанныеФайлаВХранилище(ФайлСПолнымКодом);
		МодульКлиента().ОткрытьФормуПросмотраТаблицы(ЭтаФорма, АдресТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция Файл_Прочитать(Файл)
	
	Возврат МодульОбъекта().Файл_Прочитать(ФайлСПолнымКодом);
	
КонецФункции

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаСвязанныеРегистры Тогда
		ОбновитьДинамическиеСпискиСвязанныхРегистров();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РасформироватьАгрегат(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("РасформироватьАгрегатПослеСогласия", ЭтаФорма);
	
	ТекстВопроса = НСтр("ru='Агрегат будет расформирован. Вложенные коды записаны в документ учета вместо агрегата.
	|Вы уверены, что хотите расформировать агрегат?'");
	
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика
	, ТекстВопроса
	, РежимДиалогаВопрос.ДаНет
	, "Контур.Маркировка (Администратор)");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюИзИБ(Команда)
	
	ПрочитатьИнформациюПоКодуНаСервере();
	Модифицированность = Ложь;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСвязанныеРегистры Тогда
		ОбновитьДинамическиеСпискиСвязанныхРегистров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюИзГИСМТ(Команда)
	
	Если НЕ ВыполнитьАвторизацию_ОрганизацияПоУмолчанию() Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьИнформациюИзГИСМТНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	
	Если Модифицированность Тогда
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("СохранитьИзмененияПослеСогласия", ЭтаФорма);
		МодульКлиента().ПодтвердитьДействияТехническогоСпециалиста(ОписаниеОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаписатьДанныеНаСервере();
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОсновнуюФорму(Команда)
	
	МодульКлиента().ОткрытьФормуАдминистратораМаркировки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовоеСвязанноеОкно(Команда)
	
	МодульКлиента().ОткрытьФормуРедактораКодаМаркировки(, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиДокументыИОперации(Команда)
	
	Если ЗначениеЗаполнено(КлючКода) Тогда
		ЗаполнитьСвязи();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьИнформациюОКодахПоВыделеннымСтрокам(Команда)
	
	Если НЕ ЗначениеЗаполнено(ВложенныеКоды) Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ВызватьИсключение НСтр("ru='Есть несохраненные данные. Перед изменением информации о кодах сохраните данные.'");
	КонецЕсли;
	
	АдресТаблицыКодов = ПоместитьВыделенныеВложенныеКодыВХранилищеНаСервере();
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеЗавершенияРедактированияВложенныхКодов", ЭтаФорма);
	МодульКлиента().ОткрытьФормуГрупповоеИзменениеИнформацииОКодах(ЭтаФорма, АдресТаблицыКодов, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияРедактированияВложенныхКодов(РезультатЗакрытия, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатЗакрытия Тогда
		ПрочитатьИнформациюПоКодуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормы Связи

&НаКлиенте
Процедура СвязиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Связи.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ПослеВыбораСпособаОткрытияОбъектаСвязи"
	, ЭтаФорма
	, ДанныеСтроки.ДокументИлиОперация);
	
	СпособыОткрытия = МодульКлиента().СписокСпособовОткрытияЗначения();
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика, СпособыОткрытия, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСпособаОткрытияОбъектаСвязи(Результат, ДокументИлиОперация = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СпособыОткрытияЗначения = МодульКлиента().Перечисление_СпособыОткрытияЗначения();
	ТипДокументИлиОперация = ТипЗнч(ДокументИлиОперация);
	
	Если Результат.Представление = СпособыОткрытияЗначения.ВФормеОбъекта Тогда
		
		Если ТипДокументИлиОперация = Тип("СправочникСсылка.КонтурМаркировка_ДокументыУчета") Тогда
			МодульКлиента().ОткрытьФормуДокументаУчета(ДокументИлиОперация, ЭтаФорма);
		ИначеЕсли ТипДокументИлиОперация = Тип("СправочникСсылка.КонтурМаркировка_Операции") Тогда
			МодульКлиента().ОткрытьФормуОперации(ДокументИлиОперация, ЭтаФорма);
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		
		Если ТипДокументИлиОперация = Тип("СправочникСсылка.КонтурМаркировка_ДокументыУчета") Тогда
			МодульКлиента().ОткрытьФормуРедактораДокументаУчета(ДокументИлиОперация, ЭтаФорма);
		ИначеЕсли ТипДокументИлиОперация = Тип("СправочникСсылка.КонтурМаркировка_Операции") Тогда
			МодульКлиента().ОткрытьФормуРедактораОперации(ДокументИлиОперация, ЭтаФорма);
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормы СвязанныеРегистры

&НаКлиенте
Процедура ДинамическийСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.Имя = Перечисление_СвязанныеРегистрыСведений().ДанныеФайлов Тогда
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораСпособаОткрытияФайлаДанныеФайлов"
		, ЭтаФорма
		, Элемент.ТекущиеДанные.Файл);
		
		СпособыОткрытия = МодульКлиента().СписокСпособовОткрытияЗначения();
		МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика, СпособыОткрытия, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСпособаОткрытияФайлаДанныеФайлов(Результат, Файл = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СпособыОткрытияЗначения = МодульКлиента().Перечисление_СпособыОткрытияЗначения();
	
	Если Результат.Представление = СпособыОткрытияЗначения.ВФормеОбъекта Тогда
		МодульКлиента().ОткрытьФормуОбъектаИС(Файл);
	Иначе
		АдресТаблицы = ПоместитьДанныеФайлаВХранилище(Файл);
		МодульКлиента().ОткрытьФормуПросмотраТаблицы(ЭтаФорма, АдресТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписокПередУдалением(Элемент, Отказ)
	
	Если Элемент.Имя <> Перечисление_СвязанныеРегистрыСведений().ТоварыАгрегатов Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru='Не поддерживается для выбранного регистра'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормы ВложенныеКоды

&НаКлиенте
Процедура ВложенныеКодыДобавить(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВводаВложенногоКодаМаркировки", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВводаСтроки(ОписаниеОбработчика, , НСтр("ru='Введите код идентификации'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенныеКодыИзвлечь(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ИзвлечьКодыПослеСогласия", ЭтаФорма);
	МодульКлиента().ПодтвердитьДействияТехническогоСпециалиста(ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенныеКодыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВложенныеКоды.ТекущиеДанные;
	
	ПараметрыОповещения = Новый Структура("КлючКода", ТекущиеДанные.КлючКода);
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораСпособаОткрытияВложенногоКода", ЭтаФорма, ПараметрыОповещения);
	
	СпособыОткрытия = МодульКлиента().СписокСпособовОткрытияЗначения();
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика, СпособыОткрытия, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСпособаОткрытияВложенногоКода(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СпособыОткрытияЗначения = МодульКлиента().Перечисление_СпособыОткрытияЗначения();
	
	Если Результат.Значение = СпособыОткрытияЗначения.ВФормеОбъекта Тогда
		МодульКлиента().ОткрытьФормуКодаМаркировки(ДопПараметры.КлючКода, , ЭтаФорма);
	Иначе
		МодульКлиента().ОткрытьФормуРедактораКодаМаркировки(ДопПараметры.КлючКода, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзвлечьКодыПослеСогласия(Результат, ДопПараметры = Неопределено) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ИзвлечьВыделенныеКодыИзАгрегата();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьЭлементыФормы()
	
	Для Каждого КлючЗначение Из Перечисление_СвязанныеРегистрыСведений() Цикл
		МодульОбъекта().Форма_СоздатьДинамическийСписокРегистра(ЭтаФорма, КлючЗначение.Значение, Элементы.СтраницаСвязанныеРегистры);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДинамическиеСпискиСвязанныхРегистров()
	
	УстановитьОтборыДинамическихСписков();
	
	Для Каждого КлючЗначение Из Перечисление_СвязанныеРегистрыСведений() Цикл
		Элементы[КлючЗначение.Значение].Обновить();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыДинамическихСписков()
	
	ВидСравненияРавно = ВидСравненияКомпоновкиДанных.Равно;
	СвязанныеРегистры = Перечисление_СвязанныеРегистрыСведений();
	
	ИмяДинамическогоСписка = СвязанныеРегистры.ТоварыАгрегатов;
	МодульОбъекта().Форма_УстановитьОтборДинамическогоСписка(ЭтаФорма, ИмяДинамическогоСписка
	, "КлючКода"
	, ВидСравненияРавно
	, КлючКода);
	
	ИмяДинамическогоСписка = СвязанныеРегистры.ДанныеФайлов;
	МодульОбъекта().Форма_УстановитьОтборДинамическогоСписка(ЭтаФорма, ИмяДинамическогоСписка
	, "Файл.Идентификатор"
	, ВидСравненияРавно
	, Строка(ПорцияЗаписей));
	
	ИмяДинамическогоСписка = СвязанныеРегистры.СтатусыКодовГИСМТ;
	МодульОбъекта().Форма_УстановитьОтборДинамическогоСписка(ЭтаФорма, ИмяДинамическогоСписка
	, "КлючСтатусаКода"
	, ВидСравненияРавно
	, КлючСтатусаКода);
	
	ИмяДинамическогоСписка = СвязанныеРегистры.ИнформацияОКодах;
	МодульОбъекта().Форма_УстановитьОтборДинамическогоСписка(ЭтаФорма, ИмяДинамическогоСписка
	, "КлючИнформацииОКоде"
	, ВидСравненияРавно
	, КлючИнформацииОКоде);
	
	ИмяДинамическогоСписка = СвязанныеРегистры.КодыМаркировки;
	МодульОбъекта().Форма_УстановитьОтборДинамическогоСписка(ЭтаФорма, ИмяДинамическогоСписка
	, "КлючКода"
	, ВидСравненияРавно
	, КлючКода);
	МодульОбъекта().Форма_УстановитьОтборДинамическогоСписка(ЭтаФорма, ИмяДинамическогоСписка
	, "ПорцияЗаписей"
	, ВидСравненияРавно
	, ПорцияЗаписей
	, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()

	СписокСтатусовКодов = МодульОбъекта().Перечисление_СтатусыКодов();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.Статус.СписокВыбора, СписокСтатусовКодов);
	
	СписокСпособыВыпускаТоваров = МодульОбъекта().Перечисление_СпособыВыпускаТоваров();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.СпособВыпускаТоваров.СписокВыбора, СписокСпособыВыпускаТоваров);
	
	РезультатыПроверкиРДКода = МодульОбъекта().Перечисление_РезультатыПроверкиРДКода();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.СтатусПроверкиРД.СписокВыбора, РезультатыПроверкиРДКода);
	
	СостоянияКодов = МодульОбъекта().Перечисление_СостоянияКодов();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ОсобоеСостояниеКода.СписокВыбора, СостоянияКодов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязи()
	
	СвязиКода = МодульОбъекта().КодМаркировки_СвязиОбъектов(КлючКода);
	
	Связи.Загрузить(СвязиКода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаВложенногоКодаМаркировки(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьВложенныйКодНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВложенныйКодНаСервере(НовыйКод)
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	ТаблицаКодов.Добавить().КодМаркировки = НовыйКод;
	
	МодульОбъекта().ТаблицаКодов_ЗаполнитьКлючиКодов(ТаблицаКодов);
	
	Если Не ЗначениеЗаполнено(ТаблицаКодов[0].КлючКода) Тогда
		ВызватьИсключение "Не удалось найти код маркировки в базе: " + ТаблицаКодов[0].КодМаркировки;
	КонецЕсли;
	
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	Если ЗначениеЗаполнено(ТаблицаКодов[0].КодАгрегата) Тогда
		ВызватьИсключение "Код уже находится в агрегате: " + ТаблицаКодов[0].КодАгрегата;
	КонецЕсли;
	
	ТаблицаКодов[0].КодАгрегата = КодМаркировки;
	ТаблицаКодов[0].КлючАгрегата = КлючКода;
	
	МодульОбъекта().ТаблицаКодов_ЗаписатьВсюИнформацию(ТаблицаКодов);
	
	ПрочитатьИнформациюПоКодуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИзвлечьВыделенныеКодыИзАгрегата()
	
	ПустойКлюч = МодульОбъекта().ПустойУникальныйИдентификатор();
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	Для Каждого Идентификатор Из Элементы.ВложенныеКоды.ВыделенныеСтроки Цикл
		ДанныеСтроки = ВложенныеКоды.НайтиПоИдентификатору(Идентификатор);
		ЗаполнитьЗначенияСвойств(ТаблицаКодов.Добавить(), ДанныеСтроки);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТаблицаКодов) Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	ТаблицаКодов.ЗаполнитьЗначения("", "КодАгрегата");
	ТаблицаКодов.ЗаполнитьЗначения(ПустойКлюч, "КлючАгрегата");
	
	МодульОбъекта().ТаблицаКодов_ЗаписатьВсюИнформацию(ТаблицаКодов);
	
	ПрочитатьИнформациюПоКодуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РасформироватьАгрегатПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		РасформироватьАгрегатНаСервере();
		ПрочитатьИнформациюПоКодуНаСервере();
		
		НастроитьЭлементыФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	ТаблицаКодов.Добавить().КлючКода = КлючКода;
	
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	ЗаполнитьЗначенияСвойств(ТаблицаКодов[0], ЭтаФорма);
	
	Если Не ТаблицаКодов[0].ЕстьПолныйКод Тогда
		ТаблицаКодов[0].ПолныйКод = Неопределено;
	КонецЕсли;
	
	МодульОбъекта().ТаблицаКодов_ЗаписатьВсюИнформацию(ТаблицаКодов);
	Если ЗначениеЗаполнено(ТаблицаКодов[0].ПолныйКод) Тогда
		МодульОбъекта().ПолныеКоды_Записать(ТаблицаКодов);
	КонецЕсли;
	
	ПрочитатьИнформациюПоКодуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПолногоКода(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьПолныйКодМаркировки(Результат) Тогда
		ПолныйКод = Результат;
		ЕстьПолныйКод = Истина;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКлючаКода(Результат, ДопПараметры = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	КодМаркировки = Неопределено;
	КлючКода = Новый УникальныйИдентификатор(Результат);
	
	ПрочитатьИнформациюПоКодуНаСервере();
	НастроитьЭлементыФормы();
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСвязанныеРегистры Тогда
		ОбновитьДинамическиеСпискиСвязанныхРегистров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПолныйКодМаркировки(Код)
	
	Ошибки = Новый Массив;
	
	ЭквивалентGS = МодульКлиента().ЭквивалентРазделителяGS1();
	
	ЭтоТранспортнаяУпаковки = ЗначениеЗаполнено(ОбщийТипУпаковки) 
	И ОбщийТипУпаковки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ОбщиеТипыУпаковок.ТранспортнаяУпаковка");
	
	ЭтоАТК = ЗначениеЗаполнено(ОбщийТипУпаковки)
	И ОбщийТипУпаковки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ОбщиеТипыУпаковок.АТК");
	
	ШаблонОшибки = НСтр("ru='Не удалось записать полный код: <%1>. Общий тип упаковки: <%2>. Ошибка: %3'");
	
	Если Не ЭтоТранспортнаяУпаковки И Не ЭтоАТК Тогда
		
		Если Найти(Код, ЭквивалентGS) = 0 Тогда
			ШаблонОшибкиСимволаGS = НСтр("ru='Не найден разделитель GS %1.'");
			Ошибки.Добавить(МодульКлиента().ПараметрыВСтроку(ШаблонОшибкиСимволаGS, ЭквивалентGS));
		КонецЕсли;
		
		Если СтрДлина(Код) <= СтрДлина(КодМаркировки) Тогда
			Ошибка = НСтр("ru='Полный код меньше или равен КИ.'");
			Ошибки.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого Ошибка Из Ошибки Цикл
		
		ТекстОшибки = МодульКлиента().ПараметрыВСтроку(ШаблонОшибки, Код, ОбщийТипУпаковки, Ошибка);
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки);
		
	КонецЦикла;
	
	Возврат Не ЗначениеЗаполнено(Ошибки);
	
КонецФункции

&НаСервере
Процедура ОбновитьИнформациюИзГИСМТНаСервере()
	
	Если НЕ ЗначениеЗаполнено(КлючКода) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	
	ЗаполнитьЗначенияСвойств(ТаблицаКодов.Добавить(), ЭтаФорма, "КлючКода, КодМаркировки");
	
	Для Каждого Стр Из ВложенныеКоды Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаКодов.Добавить(), Стр, "КлючКода, КодМаркировки");
	КонецЦикла;
	
	ОбновитьСтатусыКодов(ТаблицаКодов, Организация);
	
	ПрочитатьИнформациюПоКодуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьАвторизацию_ОрганизацияПоУмолчанию()
	
	Результат = Ложь;
	
	ЗначенияПоУмолчанию = ЗначенияПолейПоУмолчанию();
	Организация = ЗначенияПоУмолчанию.Организация;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Результат = ВыполнитьАвторизацию(Организация);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	УстановитьВидимостьПолей();
	УстановитьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПолей()
	
	Элементы.Кнопка_РасформироватьАгрегат.Видимость = ВложенныеКоды.Количество() > 0 И Не Модифицированность;
	
КонецПроцедуры

&НаСервере
Процедура РасформироватьАгрегатНаСервере()
	
	МодульОбъекта().КодыМаркировки_РасформироватьАгрегат(КлючКода);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьИнформациюПоКодуНаСервере()
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	
	Если ЗначениеЗаполнено(КодМаркировки) Тогда
		ТаблицаКодов.Добавить().КлючКода = МодульОбъекта().КодМаркировки_КлючКода(КодМаркировки);
	Иначе
		ТаблицаКодов.Добавить().КлючКода = КлючКода;
	КонецЕсли;
	
	МодульОбъекта().ТаблицаКодов_ДобавитьКлючиВложенныхКодов(ТаблицаКодов);
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	МодульОбъекта().ПолныеКоды_Прочитать(ТаблицаКодов);
	
	МодульОбъекта().ТаблицаКодов_ЗаменитьНаЭквивалентРазделителиGS1(ТаблицаКодов);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ТаблицаКодов[0]);
	
	ВладелецФайла = Неопределено;
	ПорцияЗаписей = ТаблицаКодов[0].ПорцияЗаписей;
	ТипФайла = МодульОбъекта().Перечисление_ТипыФайлов().ПолныеКоды;
	ФайлСПолнымКодом = МодульОбъекта().Файл_НайтиПоИдентификатору(ВладелецФайла, ПорцияЗаписей, ТипФайла);
	
	ВложенныеКоды.Очистить();
	Для Каждого Стр Из ТаблицаКодов.НайтиСтроки(Новый Структура("КодАгрегата", КодМаркировки)) Цикл
		ЗаполнитьЗначенияСвойств(ВложенныеКоды.Добавить(), Стр);
	КонецЦикла;
	
	ТаблицаТоваров = ВложенныеКоды.Выгрузить(, "Товар, КлючНоменклатуры1С");
	ТаблицаТоваров.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.ЗаполнитьЗначения(1, "КоличествоУпаковок");
	ТаблицаТоваров.Свернуть("Товар, КлючНоменклатуры1С", "КоличествоУпаковок");
	
	ВложенныеТовары.Очистить();
	Для Каждого Стр Из ТаблицаТоваров Цикл
		Если ЗначениеЗаполнено(Стр.Товар)
			Или ЗначениеЗаполнено(Стр.КлючНоменклатуры1С) Тогда
			ЗаполнитьЗначенияСвойств(ВложенныеТовары.Добавить(), Стр);
		КонецЕсли;
	КонецЦикла;
	
	Связи.Очистить();
	
	КоличествоВложенныхКодов = ВложенныеКоды.Количество();
	КоличествоВложенныхТоваров = ВложенныеТовары.Количество();
	
	Параметры.КлючКода = КлючКода;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов)
	
	Если Не ЗначениеЗаполнено(ТаблицаКодов[0].КлючКода) Тогда
		МодульОбъекта().ТаблицаКодов_ЗаполнитьКлючиКодов(ТаблицаКодов);
	КонецЕсли;
	
	МодульОбъекта().ТаблицаКодов_ДобавитьКлючиВложенныхКодов(ТаблицаКодов);
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	МодульОбъекта().ПолныеКоды_Прочитать(ТаблицаКодов);
	
	МодульОбъекта().ТаблицаКодов_ЗаменитьНаЭквивалентРазделителиGS1(ТаблицаКодов);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеФайлаВХранилище(Файл)
	
	ОписаниеФайла = МодульОбъекта().Файл_Прочитать(Файл);
	
	Если ТипЗнч(ОписаниеФайла.ДанныеФайла) = Тип("Структура") И ОписаниеФайла.ДанныеФайла.Свойство("ТаблицаКодов") Тогда
		ДанныеФайла = ОписаниеФайла.ДанныеФайла.ТаблицаКодов;
	ИначеЕсли ТипЗнч(ОписаниеФайла.ДанныеФайла) = Тип("ТаблицаЗначений") Тогда
		ДанныеФайла = ОписаниеФайла.ДанныеФайла;
	Иначе
		ТекстОшибки = НСтр("ru='Неизвестный тип файла для просмотра таблицы значений'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Результат = ПоместитьВоВременноеХранилище(ДанныеФайла, ЭтаФорма.УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗаголовок()
	
	ШаблонЗаголовка = НСтр("ru='Контур.Маркировка (Администратор) Редактор кода: %1'");
	ЭтаФорма.Заголовок = МодульКлиента().ПараметрыВСтроку(ШаблонЗаголовка, КодМаркировки);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВыделенныеВложенныеКодыВХранилищеНаСервере()
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	
	Для Каждого Идентификатор Из Элементы.ВложенныеКоды.ВыделенныеСтроки Цикл
		ДанныеСтроки = ВложенныеКоды.НайтиПоИдентификатору(Идентификатор);
		ЗаполнитьЗначенияСвойств(ТаблицаКодов.Добавить(), ДанныеСтроки);
	КонецЦикла;
	
	ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаКодов, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция ВерсияМодуляВыше(ТребуемаяВерсия)
	
	Возврат МодульОбъекта().ВерсияМодуляВыше(ТребуемаяВерсия);
	
КонецФункции

&НаСервере
Процедура ОбновитьСтатусыКодов(ТаблицаКодов, Организация)
	
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	МодульОбъекта().ТаблицаКодов_ОбновитьСтатусы(ТаблицаКодов, Организация);
	МодульОбъекта().ТаблицаКодов_ЗаписатьВсюИнформацию(ТаблицаКодов);

КонецПроцедуры

&НаСервере
Функция Перечисление_СвязанныеРегистрыСведений()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеФайлов", "КонтурМаркировка_ДанныеФайлов");
	Результат.Вставить("КодыМаркировки", "КонтурМаркировка_КодыМаркировки");
	Результат.Вставить("ИнформацияОКодах", "КонтурМаркировка_ИнформацияОКодах");
	Результат.Вставить("СтатусыКодовГИСМТ", "КонтурМаркировка_СтатусыКодовГИСМТ");
	Результат.Вставить("ТоварыАгрегатов", "КонтурМаркировка_ТоварыАгрегатов");
	
	Возврат Результат;
	
КонецФункции

// Методы модуля Контур.Маркировки

&НаКлиенте
Функция ВыполнитьАвторизацию(Организация)
	
	Возврат МодульКлиента().ВыполнитьАвторизацию(Организация, МодульКлиента());
	
КонецФункции

&НаСервере
Функция ЗначенияПолейПоУмолчанию()

	Возврат МодульОбъекта().ЗначенияПолейПоУмолчанию();
	
КонецФункции

// #КонецОбласти

