
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОчистки = НовыеПараметрыОчистки();
	
	ОО = Новый ОписаниеОповещения("ОбработчикВопросаОчиститьОстатки", ЭтотОбъект, ПараметрыОчистки);
	ПоказатьВопрос(ОО, "Выполнить очистку остатков?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Функция ОбработчикВопросаОчиститьОстатки(Ответ, ПараметрыОчистки) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		
		СписокОтветов = Новый СписокЗначений;
		СписокОтветов.Добавить("ТолькоМинуса", "Только минуса");
		СписокОтветов.Добавить("Все", "Полностью");
		
		ОО = Новый ОписаниеОповещения("ОбработчикВопросаОчиститьОстаткиПродолжение", ЭтотОбъект, ПараметрыОчистки);
		ПоказатьВопрос(ОО, "Выберите режим очистки остатков", СписокОтветов);
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПослеВводаСклада(ВыбранныйСклад, ПараметрыОчистки) Экспорт
	
	ПустаяСсылкаСклад = ПустаяСсылкаСклад();
	Если ВыбранныйСклад <> Неопределено И ВыбранныйСклад <> ПустаяСсылкаСклад Тогда
		ПараметрыОчистки.Склад = ВыбранныйСклад;
		СоздатьДокументОбнуленияОстатков(ПараметрыОчистки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПустаяСсылкаСклад()
	
	ИмяСправочника = вмс_АдаптацияКонфигураций.ПолучитьИмяСправочникаСклады();
	Возврат Справочники[ИмяСправочника].ПустаяСсылка(); 
	
КонецФункции

&НаСервере
Процедура СоздатьДокументОбнуленияОстатков(ПараметрыОчистки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Контейнер КАК Контейнер,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка.Владелец КАК Склад,
	|	вмс_ОперацияПоЯчейкамОстатки.Партия КАК Партия,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия КАК Серия,
	|	вмс_ОперацияПоЯчейкамОстатки.Качество КАК Качество,
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(, Ячейка.Владелец = &Склад) КАК вмс_ОперацияПоЯчейкамОстатки
	|ГДЕ
	|	&УсловиеПоКоличествуОстатков";
	
	Запрос.УстановитьПараметр("Склад", ПараметрыОчистки.Склад);
	
	Если ПараметрыОчистки.ТолькоМинуса Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКоличествуОстатков", "вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток < 0");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКоличествуОстатков", "ИСТИНА");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Остатков не обнаружено");
		Возврат;
	КонецЕсли;
	
	ДокументСписанияОстатков = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
	ДокументСписанияОстатков.Заполнить(Неопределено);
	ДокументСписанияОстатков.Дата = ТекущаяДатаСеанса();
	
	ПустаяЯчейка = Справочники.вмс_МестаХранения.ПустаяСсылка();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = ДокументСписанияОстатков.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
		СтрокаТЧ.Количество = Выборка.КоличествоОстаток;
		СтрокаТЧ.ЯчейкаПриемник = ПустаяЯчейка;
	КонецЦикла;
	
	ДокументСписанияОстатков.Комментарий = "Создано программно в результате обработки Очистить остатки по складу """ + Строка(ПараметрыОчистки.Склад) + """";
	ДокументСписанияОстатков.Записать(РежимЗаписиДокумента.Проведение);
	ОбщегоНазначения.СообщитьПользователю(
	СтрШаблон("Остатки успешно очищены по складу ""%1"""), ПараметрыОчистки.Склад);
	
	
	
КонецПроцедуры

&НаКлиенте
Функция ОбработчикВопросаОчиститьОстаткиПродолжение(Ответ, ПараметрыОчистки) Экспорт
	
	Если Ответ = "ТолькоМинуса" Тогда
		ПараметрыОчистки.ТолькоМинуса = Истина;
	КонецЕсли;
	
	ПустаяСсылкаСклад = ПустаяСсылкаСклад();
	ПослеВводаСклада = Новый ОписаниеОповещения("ПослеВводаСклада", ЭтотОбъект, ПараметрыОчистки);
	ПоказатьВводЗначения(ПослеВводаСклада, ПустаяСсылкаСклад, "Выберите склад, по которому хотите очистить остатки wms-ячеек");
	
КонецФункции

&НаКлиенте
Функция НовыеПараметрыОчистки()
	
	ПараметрыОчистки = Новый Структура;
	ПараметрыОчистки.Вставить("Склад", Неопределено);
	ПараметрыОчистки.Вставить("ТолькоМинуса", Ложь);
	
	Возврат ПараметрыОчистки;
	
КонецФункции
