#Область ПрограммныйИнтерфейс

Функция ЗаполнениеШтрихкдовУпаковокВДокументнте(ДокументПриемник, ДанныеОперации, СрокГодности = Неопределено, Упаковка = "") Экспорт 
	
	СозданныеШтрихкодыУпаковок = Новый Массив;
	МетаданныеДокумента = ДокументПриемник.Метаданные();  
	
	Если МетаданныеДокумента.ТабличныеЧасти.Найти("ШтрихкодыУпаковок") = Неопределено Тогда
		Возврат СозданныеШтрихкодыУпаковок;
	КонецЕсли;  
	
	ЕстьСрокГодности = ЗначениеЗаполнено(СрокГодности) И МетаданныеДокумента.ТабличныеЧасти.ШтрихкодУпаковки.Реквизиты.Найти("СрокГодности") <> Неопределено; 	
	
	Если ДанныеОперации.Свойство("ДокументТСД") Тогда
		КодыМаркировки = ПолучитьКодыМаркировкиПоОснованию(,,ДанныеОперации.ДокументТСД);
	Иначе
		КодыМаркировки = ПолучитьКодыМаркировкиПоОснованию(ДанныеОперации.ДокументОснование, ДанныеОперации.ВидОперации);
	КонецЕсли;  
	
	Для Каждого СтрокаДокумента Из КодыМаркировки Цикл
		
		КонструкторУпаковки = Новый Структура("Номенклатура, Характеристика, Маркировка, Серия, ВидНоменклатуры, Упаковка, ПолныйКодМаркировки",);
		ЗаполнитьЗначенияСвойств(КонструкторУпаковки, СтрокаДокумента);
		
		РазобраннаяМаркировка = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(КонструкторУпаковки.ПолныйКодМаркировки, Истина);
		ЭлементСправочника = ПолучитьШтрихкодУпаковки(РазобраннаяМаркировка, КонструкторУпаковки);
		
		НоваяСтрока = ДокументПриемник.ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ШтрихкодУпаковки = ЭлементСправочника;
		Если ЕстьСрокГодности Тогда
			НоваяСтрока.СрокГодности = СрокГодности;
		КонецЕсли;
		
		//Переключатель на случай, если по операции нужно сохранить код в пул кодов (например заполнение чека)
		ДобавитьМаркировкуВПул = Ложь;
		Организация = Неопределено;
		
		Если ДобавитьМаркировкуВПул И ЗначениеЗаполнено(Организация) Тогда
			ДобавитьМаркировкуВПул(РазобраннаяМаркировка, НоваяСтрока.ШтрихкодУпаковки, Организация);
		КонецЕсли;
		
		СозданныеШтрихкодыУпаковок.Добавить(НоваяСтрока.ШтрихкодУпаковки);
		
	КонецЦикла;
	
	Возврат СозданныеШтрихкодыУпаковок;
	
КонецФункции

Функция ПроверитьВозможностьИспользованияМаркировки(Маркировка, ЗаданиеКладовщику) Экспорт
	
	КонтролироватьМаркировку = Истина; // переключатель, который можно завязать, например, на правило. Чтобы не проверять маркировку при определенных сценариях.
	
	Если Не КонтролироватьМаркировку Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТаблицаМаркировки = ПолучитьКодыМаркировкиПоОснованию(ЗаданиеКладовщику.Распоряжение, ЗаданиеКладовщику.Операция);
	
	Если ТаблицаМаркировки.Найти(Маркировка) <> Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	
КонецФункции

Функция ДвоичныеДанныеBase64(ДвоичныеДанные) Экспорт
	
	Base64 = Base64Строка(ДвоичныеДанные);
	Base64 = СтрЗаменить(Base64, Символы.ПС, "");
	Base64 = СтрЗаменить(Base64, Символы.ВК, "");
	
	Возврат Base64;
	
КонецФункции

Процедура вмс_ПриЗаписиШтрихкодаУпаковокПриЗаписи(Источник, Отказ) Экспорт
	
	// 3.2.5 - обработчик подписки на штрихкоды упаковок
	//Если это маркированный товар и Количество = 1 (отсекаем КИГУ) - не сохраняем в регистр
	Если Источник.Количество = 1 И Источник.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар Тогда
		Возврат;
	КонецЕсли;
	
	НоваяЗапись = РегистрыСведений.вмс_ШтрихкодыРасширенный.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, Источник);
	
	НоваяЗапись.Штрихкод = ШтрихкодыУпаковокКлиентСервер.КодМаркировкиБезСкобок(Источник.ЗначениеШтрихкода);
	Если ЗначениеЗаполнено(Источник.Серия) Тогда
		НоваяЗапись.Серия = вмс_ВзаимодействиеСОбъектамиУчетаСервер.ПолучитьИлиСоздатьОбъектВмсПоОбъектуУчета(Источник.Серия);
	КонецЕсли;
	
	НоваяЗапись.Записать();
	
КонецПроцедуры

#Область РаботаСДаннымиМаркировкиПолученнымиЧерезИнтерфейсМОПТ

Функция КодаМаркировкиВОбороте(КодМаркировки) Экспорт
	Возврат ПолучитьСтатусКодаМаркировки(КодМаркировки) = Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот;
КонецФункции

Функция ПолучитьСтатусКодаМаркировки(КодМаркировки, Организация = Неопределено, СОпределениемВидаПродкукции = Ложь) Экспорт   

	ДанныеСтатусовКодовМаркировки = ПолучитьДанныеМаркировки(КодМаркировки, Организация, СОпределениемВидаПродкукции);

	Если ДанныеСтатусовКодовМаркировки.РезультатОтправкиЗапроса = Неопределено ИЛИ ДанныеСтатусовКодовМаркировки.ТекстОшибки <> "" Тогда
		Возврат Неопределено;
	КонецЕсли;

	Статус = ПолучитьЗначениеИзДанныеМаркировки(ДанныеСтатусовКодовМаркировки, "Статус");
	
	Возврат Статус;
		
КонецФункции

Функция ПолучитьЗначениеИзДанныеМаркировки(ДанныеСтатусовКодовМаркировки, Свойство) Экспорт
	
	Для Каждого КлючИЗначение Из ДанныеСтатусовКодовМаркировки.СтатусыКодовМаркировки Цикл
		СпецификаСтроки     = КлючИЗначение.Значение;
		
		Если СпецификаСтроки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если СпецификаСтроки.Свойство(Свойство) Тогда
			Возврат СпецификаСтроки[Свойство] 	
		КонецЕсли;				
	КонецЦикла; 
	
КонецФункции

Функция ПолучитьДанныеМаркировки(КодМаркировки, Организация = Неопределено, СОпределениемВидаПродкукции = Ложь) Экспорт  
	
	КодМаркировкиСтруктура =  ОбщийМодульШтрихкодированиеОбщегоНазначенияИС().НоваяСтруктураОбработкиШтрихкода(КодМаркировки); 
	
	Модуль_вмс_РаботаСКоллекциями = Вычислить("вмс_РаботаСКоллекциями");
	
	Если СОпределениемВидаПродкукции Тогда     
		
		КодМаркировкиСтруктура.ВидыПродукцииКодаМаркировки = ОбщийМодульШтрихкодированиеОбщегоНазначенияИС().ВидыПродукцииИСМП(Истина);   

		ДанныеМаркировки = ЗапроситьСтатусыКодовМаркировки(Модуль_вмс_РаботаСКоллекциями.ЗначениеВМассив(КодМаркировкиСтруктура), Организация);
		
		ВидыПродукции = Новый Массив;
		
		Для Каждого КлючИЗначение Из ДанныеМаркировки.СтатусыКодовМаркировки Цикл
			
			СпецификаСтроки = КлючИЗначение.Значение;
			
			Если СпецификаСтроки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
						
			Если ЗначениеЗаполнено(СпецификаСтроки.ВидПродукции) Тогда
				ВидыПродукции.Добавить(СпецификаСтроки.ВидПродукции);
			КонецЕсли;
			
		КонецЦикла;
		
		КодМаркировкиСтруктура.ВидыПродукцииКодаМаркировки.Очистить();
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КодМаркировкиСтруктура.ВидыПродукцииКодаМаркировки, ВидыПродукции);
				
		Возврат ЗапроситьСтатусыКодовМаркировки(Модуль_вмс_РаботаСКоллекциями.ЗначениеВМассив(КодМаркировкиСтруктура), Организация);
		
	Иначе
		
		КодМаркировкиСтруктура.ВидыПродукцииКодаМаркировки = Новый Массив(КодМаркировкиСтруктура.ДанныеРазбора.ВидыПродукции);
		Возврат ЗапроситьСтатусыКодовМаркировки(Модуль_вмс_РаботаСКоллекциями.ЗначениеВМассив(КодМаркировкиСтруктура), Организация);
		
	КонецЕсли;
	
КонецФункции      
	
Функция ЗапроситьСтатусыКодовМаркировки(ДанныеДляОтправки, Знач Организация = Неопределено) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = Справочники.Организации.ПолучитьОрганизациюПоУмолчанию()	
	КонецЕсли;  
	
	
	СтатусКодов = ИнтерфейсМОТП.ЗапроситьСтатусыКодовМаркировки(ДанныеДляОтправки, Организация);    
	
	Результат = СтатусКодов.РезультатОтправкиЗапроса;  
			
	Возврат СтатусКодов; 
	
КонецФункции

#КонецОбласти  

#Область ПакетнаяРаботаСДаннымиМаркировкиПолученнымиЧерезИнтерфейсМОПТ

Функция ПолучитьСтатусыКодовМаркировки(КодыМаркировки, Организация = Неопределено, СОпределениемВидаПродкукции = Ложь) Экспорт   

	ДанныеСтатусовКодовМаркировки = ПолучитьПакетДанныхМаркировки(КодыМаркировки, Организация, СОпределениемВидаПродкукции);

	Если ДанныеСтатусовКодовМаркировки.РезультатОтправкиЗапроса = Неопределено ИЛИ ДанныеСтатусовКодовМаркировки.ТекстОшибки <> "" Тогда  
		Возврат Неопределено; 
	КонецЕсли;    

	Статусы = ПолучитьЗначенияИзПакетаДанныеМаркировки(ДанныеСтатусовКодовМаркировки, "Статус");
	
	Возврат Статусы;
		
КонецФункции 

Функция ПолучитьЗначенияИзПакетаДанныеМаркировки(ДанныеСтатусовКодовМаркировки, Свойство) Экспорт
	
	
	МаркировкаИЗначение = Новый Соответствие();
	
	Для Каждого КлючИЗначение Из ДанныеСтатусовКодовМаркировки.СтатусыКодовМаркировки Цикл

		Если КлючИЗначение.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если КлючИЗначение.Значение.Свойство(Свойство) Тогда
			 МаркировкаИЗначение.Вставить(КлючИЗначение.Ключ.ИсходныйШтрихкод, КлючИЗначение.Значение[Свойство] );	
		КонецЕсли;	
		 
	КонецЦикла; 
	
	Возврат МаркировкаИЗначение;
	
КонецФункции

Функция ПолучитьПакетДанныхМаркировки(КодыМаркировки, Организация = Неопределено, СОпределениемВидаПродкукции = Ложь)  
	
	МодульШтрихкодированиеОбщегоНазначенияИС = ОбщийМодульШтрихкодированиеОбщегоНазначенияИС();
	Модуль_вмс_РаботаСКоллекциями = Вычислить("вмс_РаботаСКоллекциями");

	Если ТипЗнч(КодыМаркировки) = Тип("Массив") Тогда 
		МассивСтруктурКодовМаркировки = Новый Массив;
		Для Каждого КодМаркировки  Из КодыМаркировки Цикл
			МассивСтруктурКодовМаркировки.Добавить(МодульШтрихкодированиеОбщегоНазначенияИС.НоваяСтруктураОбработкиШтрихкода(КодМаркировки));	
		КонецЦикла;
	Иначе
		МассивСтруктурКодовМаркировки =  Модуль_вмс_РаботаСКоллекциями.ЗначениеВМассив(МодульШтрихкодированиеОбщегоНазначенияИС.НоваяСтруктураОбработкиШтрихкода(КодМаркировки)); 	
	КонецЕсли;
	
		
	Если СОпределениемВидаПродкукции Тогда  
		
		ВсеВидыПродукцииИСМП = Вычислить("ОбщегоНазначенияИСКлиентСервер").ВидыПродукцииИСМП(Истина); 
		
		Для Каждого СтруктураМаркировки Из МассивСтруктурКодовМаркировки Цикл
			СтруктураМаркировки.ВидыПродукцииКодаМаркировки = ВсеВидыПродукцииИСМП; 	
		КонецЦикла; 

		ДанныеМаркировки = ЗапроситьСтатусыКодовМаркировки(МассивСтруктурКодовМаркировки, Организация);
		
		ВидыПродукции = Новый Массив;
		
		Для Каждого КлючИЗначение Из ДанныеМаркировки.СтатусыКодовМаркировки Цикл
			
			СпецификаСтроки = КлючИЗначение.Значение;
			
			Если СпецификаСтроки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
						
			Если ЗначениеЗаполнено(СпецификаСтроки.ВидПродукции) Тогда
				ВидыПродукции.Добавить(СпецификаСтроки.ВидПродукции);
			КонецЕсли;
			
		КонецЦикла;
		
		МассивСтруктурКодовМаркировки.ВидыПродукцииКодаМаркировки.Очистить();
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтруктурКодовМаркировки.ВидыПродукцииКодаМаркировки, ВидыПродукции);
				
		Возврат ЗапроситьСтатусыКодовМаркировки(Модуль_вмс_РаботаСКоллекциями.ЗначениеВМассив(МассивСтруктурКодовМаркировки), Организация);
		
	Иначе
			
		Для Каждого СтруктураМаркировки Из МассивСтруктурКодовМаркировки Цикл
			СтруктураМаркировки.ВидыПродукцииКодаМаркировки = Новый Массив(СтруктураМаркировки.ДанныеРазбора.ВидыПродукции); 	
		КонецЦикла;
		
		Возврат ЗапроситьСтатусыКодовМаркировки(МассивСтруктурКодовМаркировки, Организация);
		
	КонецЕсли;
	
КонецФункции       

#КонецОбласти    

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьКодыМаркировкиПоОснованию(Основание = Неопределено, ВидОперации = Неопределено, ДокументТСД = Неопределено, Упаковка = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкам.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокументыОпераций
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам КАК вмс_ОперацияПоЯчейкам
	|ГДЕ
	|	вмс_ОперацияПоЯчейкам.Проведен 
	|	И &ОтборПоВидуОперации
	|	И &ОтборПоОснованию
	|	И &ОтборПоСсылке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамКодыМаркировки.Маркировка КАК Маркировка,
	|	вмс_ОперацияПоЯчейкамКодыМаркировки.Товар КАК Номенклатура, 
	|	&вмс_ОперацияПоЯчейкамКодыМаркировки_Товар_ВидНоменклатуры КАК ВидНоменклатуры,
	|	вмс_ОперацияПоЯчейкамКодыМаркировки.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамКодыМаркировки.Серия КАК Серия,
	|	&ПустаяУпаковка КАК Упаковка	
	|ИЗ
	|	ДокументыОпераций КАК ДокументыОпераций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вмс_ОперацияПоЯчейкам.КодыМаркировки КАК вмс_ОперацияПоЯчейкамКодыМаркировки 
	|		ПО ДокументыОпераций.Ссылка = вмс_ОперацияПоЯчейкамКодыМаркировки.Ссылка
	|			И &УпаковкаСоединение
	|ГДЕ
	|	ИСТИНА
	|	И &УпаковкаУсловие";
	
	ИмяРеквизитаНоменклатурыВид = вмс_АдаптацияКонфигураций.ИмяРеквизитаНоменклатурыВид();
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&вмс_ОперацияПоЯчейкамКодыМаркировки_Товар_ВидНоменклатуры", "вмс_ОперацияПоЯчейкамКодыМаркировки.Товар." + ИмяРеквизитаНоменклатурыВид);
	
	Если ВидОперации <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВидуОперации",
		"вмс_ОперацияПоЯчейкам.ВидОперации = &ВидОперации");
		Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВидуОперации", "ИСТИНА");		
	КонецЕсли;
		
	Если Основание <> Неопределено Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоОснованию",
		"вмс_ОперацияПоЯчейкам.ДокументОснование = &ДокументОснование");
		
		Запрос.УстановитьПараметр("ДокументОснование", Основание); 	
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоОснованию", "ИСТИНА");		
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ДокументТСД) Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ОтборПоСсылке", "И вмс_ОперацияПоЯчейкам.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", ДокументТСД);	
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ОтборПоСсылке", "");		
	КонецЕсли; 
	
	Если Упаковка <> "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПустаяУпаковка", ", УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&И УпаковкаСоединение", "ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + вмс_АдаптацияКонфигураций.ПолучитьИмяСправочникаУпаковки() + " КАК УпаковкиЕдиницыИзмерения 
		|ПО вмс_ОперацияПоЯчейкамКодыМаркировки.Товар = УпаковкиЕдиницыИзмерения.Владелец");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УпаковкаУсловие",
		"	И УпаковкиЕдиницыИзмерения.ПометкаУдаления
		|	И УпаковкиЕдиницыИзмерения.Наименование = &Наименование");
	Иначе 
		Запрос.УстановитьПараметр("ПустаяУпаковка", вмс_АдаптацияКонфигураций.ПустаяУпаковка());
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УпаковкаСоединение", ""); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УпаковкаУсловие", ""); 
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьПоУмолчаниюПараметрыПроверкиСтатусаКИЗ(Оранизация = Неопределено) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Организация", Оранизация); 
	Параметры.Вставить("Статус", "INTRODUCED");
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьШтрихкодУпаковки(РазобраннаяМаркировка, ДанныеДляУпаковки) Экспорт
	
	ШУ = Справочники.ШтрихкодыУпаковокТоваров;
	
	ПредставлениеМаркировки = ПолучитьМаркировкуБезКриптоХвоста(РазобраннаяМаркировка);
	ШтрихкодУпаковки = ШУ.ПолучитьПоЗначениюШтрихкода(ПредставлениеМаркировки);
	
	Если НЕ ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда
		// создаем новый штрихкод упаковки
		ДанныеНовойУпаковки = ШУ.СтруктураСозданияШтрихкодаУпаковки();
		
		ЗаполнитьЗначенияСвойств(ДанныеНовойУпаковки, ДанныеДляУпаковки);
		
		ДанныеНовойУпаковки.Штрихкод = ДанныеДляУпаковки.Маркировка;
		ДанныеНовойУпаковки.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар; 
		ДанныеНовойУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
		ДанныеНовойУпаковки.Количество = 1; 
		ДанныеНовойУпаковки.ДатаУпаковки = ТекущаяДатаСеанса();
		
		ШтрихкодУпаковки = ШУ.СоздатьШтрихкодУпаковки(ДанныеНовойУпаковки);
		
	КонецЕсли;
	
	Возврат ШтрихкодУпаковки;
	
КонецФункции

Функция ПолучитьМаркировкуБезКриптоХвоста(РазобраннаяМаркировка) Экспорт
	Если РазобраннаяМаркировка.Свойство("ПредставлениеШтрихкодаБезКриптоХвоста") Тогда
		Возврат РазобраннаяМаркировка.ПредставлениеШтрихкодаБезКриптоХвоста;	
	Иначе
		ДанныеШтрихкода = РазобраннаяМаркировка.ДанныеШтрихкода;	
		Возврат СтрШаблон("(01)%1(21)%2", ДанныеШтрихкода["01"].Значение, ДанныеШтрихкода["21"].Значение);	
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьМаркировкуВПул(ДанныеКодаТовара, ШтрихкодУпаковки, Организация)
		
	КодМаркировки = ПолучитьМаркировкуБезКриптоХвоста(ДанныеКодаТовара);
	ХешСуммаКодаМаркировки = ИнтеграцияИС.ХешированиеДанныхSHA256(КодМаркировки);
	
	// Проверяем, есть ли уже такой код в пуле
	НаборЗаписей = РегистрыСведений.ПулКодовМаркировкиСУЗ.СоздатьНаборЗаписей();
	НаборЗаписей.Заполнить(Неопределено);
	НаборЗаписей.Отбор.КодМаркировки.Установить(КодМаркировки);
	НаборЗаписей.Отбор.ХешСуммаКодаМаркировки.Установить(ХешСуммаКодаМаркировки);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Метаданные.ОбщиеМодули.Найти("ОбщегоНазначенияИС") <> Неопределено Тогда
		ВидПродукцииИС = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияИС").ОписаниеНоменклатуры(ШтрихкодУпаковки.Номенклатура)[ШтрихкодУпаковки.Номенклатура].КлючВидовПродукции;
	Иначе
		ВидПродукцииИС = ИнтеграцияИСМПВызовСервера.ВидПродукцииПоНоменклатуре(ШтрихкодУпаковки.Номенклатура);
	КонецЕсли;
	
	МенеджерЗаписи = НаборЗаписей.Добавить();
	МенеджерЗаписи.КодМаркировки = КодМаркировки; //КИ
	МенеджерЗаписи.ХешСуммаКодаМаркировки = ХешСуммаКодаМаркировки; //хэш сумма КИ
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Номенклатура = ШтрихкодУпаковки.Номенклатура;
	МенеджерЗаписи.Характеристика = ШтрихкодУпаковки.Характеристика;
	МенеджерЗаписи.ВидПродукции = ВидПродукцииИС;
	МенеджерЗаписи.ШтрихкодУпаковки = ШтрихкодУпаковки;
	МенеджерЗаписи.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
	МенеджерЗаписи.Шаблон = ИнтеграцияИСМПКлиентСервер.ШаблонКодаМаркировкиПоВидуПродукции(
			МенеджерЗаписи.ВидПродукции);
	МенеджерЗаписи.ПолныйКодМаркировки = ДанныеКодаТовара.ШтрихкодBase64;
	
	// Записываем набор
	НаборЗаписей.Записать();
	Возврат;
	
КонецПроцедуры   

Функция ОбщийМодульШтрихкодированиеОбщегоНазначенияИС()
	
	Попытка
		Возврат Вычислить("ШтрихкодированиеОбщегоНазначенияИС");
	Исключение
	КонецПопытки;
	
	// На старых версиях УТ может быть ШтрихкодированиеИС
	Попытка
		Возврат Вычислить("ШтрихкодированиеИС");
	Исключение
	КонецПопытки;
	
КонецФункции

Функция ЭтоАгрегационнаяУпаковка(ШтрихкодУпаковки)
	
	МенеджерПеречисления = Перечисления.ТипыУпаковок;
	ТипыАгрегационныхУпаковок = вмс_РаботаСКоллекциями.НовыйМассив(МенеджерПеречисления.МонотоварнаяУпаковка, МенеджерПеречисления.МультитоварнаяУпаковка);
	
	РеквизитПоиска = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШтрихкодУпаковки, "ТипУпаковки");
	
	Возврат ТипыАгрегационныхУпаковок.Найти(РеквизитПоиска) <> Неопределено;
	
КонецФункции

Функция ЭтоИндивидуальнаяУпаковка(ШтрихкодУпаковки)
	
	МенеджерПеречисления = Перечисления.ТипыУпаковок;
	ТипыИндивидуальныхУпаковок = вмс_РаботаСКоллекциями.НовыйМассив(МенеджерПеречисления.МаркированныйТовар);
	
	РеквизитПоиска = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШтрихкодУпаковки, "ТипУпаковки");
	
	Возврат ТипыИндивидуальныхУпаковок.Найти(РеквизитПоиска) <> Неопределено;
	
КонецФункции

#КонецОбласти