#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПомещениеНеназначенныхЯчеек() Экспорт
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Наименование", "Помещение неназначенных ячеек");
	Возврат ПолучитьПомещение(ПараметрыОтбора);
	
КонецФункции

Функция ПолучитьПомещениеБезОстатка() Экспорт
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Наименование", "Без остатка");
	Возврат ПолучитьПомещение(ПараметрыОтбора);
	
КонецФункции

// Функция - Получить помещение. Гарантированно возвращает элемент справочника вмс_Помещения по переданным реквизитам.
// Осуществляется поиск помещения, если найти не удалось - создается новый экземпляр
//
// Параметры:
//  ПараметрыОтбора -структура (НазваниеПараметра, ПараметрСсылка)
// 
// Возвращаемое значение:
//   -СправочникСсылка.вмс_Помещения - экземпляр справочника помещения 
//
Функция ПолучитьПомещение(ПараметрыОтбора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_Помещения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_Помещения КАК вмс_Помещения
	|ГДЕ
	|	&Отборы";  
	
	МассивОтборов = Новый Массив;
	Для Каждого Реквизит Из ПараметрыОтбора Цикл  
		МассивОтборов.Добавить("вмс_Помещения." + Реквизит.Ключ + " = &" + Реквизит.Ключ);
		Запрос.УстановитьПараметр(Реквизит.Ключ, Реквизит.Значение);
	КонецЦикла;  
	
	ТекстОтборов = вмс_РаботаСКоллекциями.МассивВСтроку(МассивОтборов, Символы.ПС + Символы.Таб + "И ");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отборы", ТекстОтборов);  
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		Возврат СоздатьОтсутствующееПомещение(ПараметрыОтбора);
	КонецЕсли;
	
КонецФункции

Функция СоздатьОтсутствующееПомещение(ПараметрыОтбора)
	НовоеПомещение = Справочники.вмс_Помещения.СоздатьЭлемент();
	НовоеПомещение.Заполнить(Неопределено);
	ЗаполнитьЗначенияСвойств(НовоеПомещение, ПараметрыОтбора);
	НовоеПомещение.Записать();
	Возврат НовоеПомещение.Ссылка;
КонецФункции

Функция ПолучитьВсеПомещения() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	вмс_Помещения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_Помещения КАК вмс_Помещения";
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Результат;
КонецФункции

#КонецЕсли
