#Область ПрограммныйИнтерфейс 

#Область РаботаСМодулями

Функция ПолучитьФактическоеИмяОбщегоМодуля(ИмяМодуля) Экспорт
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ПолучитьФактическоеИмяОбщегоМодуля(ИмяМодуля);
	
КонецФункции

Функция Модуль(ИмяМодуля) Экспорт
	// ТУ_Кулалаев Е.С ++ 11.06.2024 11:48:53
	// Получение модуля обработки, как общего модуля.
	// Для хранения там защищенного кода.
	
	ОбщийМодуль = Обработки[ИмяМодуля].Создать();
	
	Возврат ОбщийМодуль;
	
КонецФункции

#КонецОбласти

#Область Конструкторы

Функция ПолучитьПустуюСсылкуНаТовар() Экспорт
	Возврат ПолучитьПустуюСсылкуНаОбъектИБ("Справочник.Номенклатура");
КонецФункции

Функция ПолучитьПустуюСсылкуНаОбъектИБ(ИмяОбъекта) Экспорт
	Менеджер = вмс_ОбщегоНазначенияСервер.ПолучитьМенеджерОбъектовБазы(ИмяОбъекта);
	Возврат Менеджер.ПустаяСсылка();
КонецФункции

Функция ПолучитьСсылкуОбъектаИБ(ТипОбъекта, пСсылка=Неопределено, Представление=Неопределено) Экспорт
	
	Перем ОбщегоНазначенияСервер, ОбщегоНазначенияВызовСервера;
	Перем Гуид, Ссылка, ЭтоГруппа, Объект;
	
	ОбщегоНазначенияСервер = вмс_ОбщегоНазначенияСервер;
	ОбщегоНазначенияВызовСервера = вмс_ОбщегоНазначенияВызовСервера;
	
	МетаданныеОбъекта = ОбщегоНазначенияСервер.ПолучитьМетаДанныеОбъекта(ТипОбъекта);
	Если МетаданныеОбъекта <> Неопределено Тогда
		ЭтоПеречисление = Метаданные.Перечисления.Содержит(МетаданныеОбъекта);
	Иначе
		ЭтоПеречисление = ТипЗнч(ТипОбъекта) = Тип("Строка") И Найти(ТипОбъекта, "ПеречислениеСсылка.") = 1;
	КонецЕсли;
	
	Если пСсылка <> Неопределено Тогда
		Если ТипЗнч(пСсылка) = Тип("Строка") Тогда
			Если ЭтоПеречисление Тогда
				Гуид = пСсылка;
			Иначе
				Гуид = Новый УникальныйИдентификатор(пСсылка);
			КонецЕсли;
		ИначеЕсли ТипЗнч(пСсылка) = Тип("УникальныйИдентификатор") Тогда
			Гуид = пСсылка;
		Иначе
			Гуид = пСсылка.УникальныйИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	Если МетаданныеОбъекта <> Неопределено Тогда
		Менеджер = ОбщегоНазначенияСервер.ПолучитьМенеджерОбъектовБазы(МетаданныеОбъекта);
		Если Гуид <> Неопределено Тогда
			Если ЭтоПеречисление Тогда
				Если МетаданныеОбъекта.ЗначенияПеречисления.Найти(Гуид) = Неопределено Тогда
					Ссылка = Менеджер.ПустаяСсылка();
				Иначе	
					Ссылка = Менеджер[Гуид];
				КонецЕсли;
			Иначе
				Ссылка = Менеджер.ПолучитьСсылку(Гуид);
			КонецЕсли;
		КонецЕсли;
	Иначе
		МетаданныеОбъекта = ОбщегоНазначенияСервер.ПолучитьМетаДанныеОбъекта("Справочник.КвазиСсылки");
		Если МетаданныеОбъекта <> Неопределено Тогда
			Если ТипЗнч(ТипОбъекта) = Тип("Строка") И Гуид <> Неопределено Тогда
				ИмяТипаОбъекта = ТипОбъекта;
				ИмяТипаОбъекта = СтрЗаменить(ИмяТипаОбъекта, "Ссылка.", ".");
				ИмяТипаОбъекта = СтрЗаменить(ИмяТипаОбъекта, "Объект.", ".");
				Ссылка = ОбщегоНазначенияВызовСервера.ПолучитьКвазиСсылкуИБ(ИмяТипаОбъекта, Гуид, Представление);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Функция ПолучитьСсылкиОбъектовИБ(знач ТаблицаДанныхОбъектов) Экспорт
	
	Перем РК, ОбщегоНазначенияСервер, ОбращенияКИСВызовСервера;
	
	РК = вмс_РаботаСКоллекциями;
	ОбщегоНазначенияСервер = вмс_ОбщегоНазначенияСервер;
	ОбращенияКИСВызовСервера = вмс_Обмен_с_КИС_ВызовСервера;
	
	ТаблицаТиповОбъектов = Новый ТаблицаЗначений;
	ТаблицаТиповОбъектов.Колонки.Добавить("ТипОбъекта");
	ТаблицаТиповОбъектов.Колонки.Добавить("МетаданныеОбъекта");
	ТаблицаТиповОбъектов.Колонки.Добавить("Менеджер");
	ТаблицаТиповОбъектов.Колонки.Добавить("ЭтоПеречисление");
	ТаблицаТиповОбъектов.Индексы.Добавить("ТипОбъекта");
	
	МетаданныеКвазиСсылок = ОбщегоНазначенияСервер.ПолучитьМетаДанныеОбъекта("Справочник.КвазиСсылки");
	
	ТаблицаКвазиСсылок = ОбращенияКИСВызовСервера.НоваяТаблицаКвазиСсылок();
	ТаблицаКвазиСсылок.Колонки.Добавить("Номер");
	
	ПоискТипа = Новый Структура("ТипОбъекта");
	МассивСсылок = Новый Массив;
	Для Каждого ДанныеОбъекта Из РК.ПолучитьЭлементыКоллекции(ТаблицаДанныхОбъектов) Цикл
		
		ТипОбъекта = ДанныеОбъекта.ТипОбъекта;
		ПоискТипа.ТипОбъекта = ТипОбъекта;
		ДанныеТипаОбъектаМассив = ТаблицаТиповОбъектов.НайтиСтроки(ПоискТипа);
		Если ДанныеТипаОбъектаМассив.Количество()=0 Тогда

			МетаданныеОбъекта = ОбщегоНазначенияСервер.ПолучитьМетаДанныеОбъекта(ТипОбъекта);
			Если МетаданныеОбъекта <> Неопределено Тогда
				ЭтоПеречисление = Метаданные.Перечисления.Содержит(МетаданныеОбъекта);
			Иначе
				МетаданныеОбъекта = МетаданныеКвазиСсылок;
				ЭтоПеречисление = ТипЗнч(ТипОбъекта)=Тип("Строка") И Найти(ТипОбъекта, "ПеречислениеСсылка.")=1;
			КонецЕсли;
			
			Менеджер = ОбщегоНазначенияСервер.ПолучитьМенеджерОбъектовБазы(МетаданныеОбъекта);

			ДанныеТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
			ДанныеТипаОбъекта.ТипОбъекта = ТипОбъекта;
			ДанныеТипаОбъекта.МетаданныеОбъекта = МетаданныеОбъекта;
			ДанныеТипаОбъекта.Менеджер = Менеджер;
			ДанныеТипаОбъекта.ЭтоПеречисление = ЭтоПеречисление;
			
		Иначе
			
			ДанныеТипаОбъекта = ДанныеТипаОбъектаМассив[0];
			
			МетаданныеОбъекта = ДанныеТипаОбъекта.МетаданныеОбъекта;
			Менеджер = ДанныеТипаОбъекта.Менеджер;
			ЭтоПеречисление = ДанныеТипаОбъекта.ЭтоПеречисление;
			
		КонецЕсли;
		
		GUID = ДанныеОбъекта.GUID;
		Если МетаданныеОбъекта=МетаданныеКвазиСсылок Тогда
			// поищем пакетно позже в едином запросе
			ИмяТипаКвазиСсылкиИБ = ТипОбъекта;
			ИмяТипаКвазиСсылкиИБ = СтрЗаменить(ИмяТипаКвазиСсылкиИБ, "Ссылка.", ".");
			ИмяТипаКвазиСсылкиИБ = СтрЗаменить(ИмяТипаКвазиСсылкиИБ, "Объект.", ".");
			СсылкаОбъектаИБ = Неопределено;
			СтрокаКвазиСсылки = ТаблицаКвазиСсылок.Добавить();
			СтрокаКвазиСсылки.ИмяТипа = ИмяТипаКвазиСсылкиИБ;
			Если ЭтоПеречисление Тогда
				СтрокаКвазиСсылки.Имя = GUID;
			Иначе
				СтрокаКвазиСсылки.GUID = Новый УникальныйИдентификатор(GUID);
			КонецЕсли;
			СтрокаКвазиСсылки.Представление = ДанныеОбъекта.Представление;
			СтрокаКвазиСсылки.Номер = МассивСсылок.Количество();
		Иначе
			Если ЭтоПеречисление Тогда
				Если МетаданныеОбъекта.ЗначенияПеречисления.Найти(GUID) = Неопределено Тогда
					СсылкаОбъектаИБ = Менеджер.ПустаяСсылка();
				Иначе	
					СсылкаОбъектаИБ = Менеджер[GUID];
				КонецЕсли;
			Иначе
				GUID = Новый УникальныйИдентификатор(GUID);
				СсылкаОбъектаИБ = Менеджер.ПолучитьСсылку(GUID);
			КонецЕсли;
		КонецЕсли;

		МассивСсылок.Добавить(СсылкаОбъектаИБ);
		
	КонецЦикла;
	
	Если ТаблицаКвазиСсылок.Количество() > 0 Тогда
		ОбращенияКИСВызовСервера.ПолучитьКвазиСсылкиИБПоТаблицеКвазиСсылок(ТаблицаКвазиСсылок);
		
		Для Каждого СтрокаКвазиСсылки Из ТаблицаКвазиСсылок Цикл
			МассивСсылок[СтрокаКвазиСсылки.Номер] = СтрокаКвазиСсылки.КвазиСсылкаИБ;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивСсылок;
	
КонецФункции

Функция ПолучитьМакет(ИмяМакета) Экспорт
	
	ПутьКМакетуМассив = вмс_РаботаСКоллекциями.СтрокуВМассив(ИмяМакета);
	Если ПутьКМакетуМассив.Количество() = 1 Тогда
		Возврат ПолучитьОбщийМакет(ПутьКМакетуМассив[0]);
	КонецЕсли;
	
	Если ПутьКМакетуМассив.Количество() = 2 Тогда
		ИмяМакета = ПутьКМакетуМассив[ПутьКМакетуМассив.ВГраница()];
		ПутьКМакетуМассив.Удалить(ПутьКМакетуМассив.ВГраница());
		
		Менеджер = вмс_ОбщегоНазначенияСервер.ПолучитьМенеджерОбъектовБазы(ПутьКМакетуМассив);
		Возврат Менеджер.ПолучитьМакет(ИмяМакета);
	КонецЕсли;
	
КонецФункции

Функция КодОсновногоЯзыка() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ПараметрыСеанса.ОсновнойЯзык;
	
КонецФункции

Функция ВернутьЦветОсобогоТекстаНаСервере() Экспорт

      Возврат ЦветаСтиля.ЦветОсобогоТекста;

КонецФункции

Функция ЦветСтиля(ИмяЦветаСтиля) Экспорт

	Возврат ЦветаСтиля[ИмяЦветаСтиля];
	
КонецФункции

Функция ЗначениеИзСтрокиВнутр_(Строка) Экспорт
	
	Возврат ЗначениеИзСтрокиВнутр(Строка);
	
КонецФункции

#КонецОбласти

#Область ВыполнениеКода

Функция ВыполнитьПрограммныйКод(ПрограммныйКод, Параметры=Неопределено) Экспорт
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьПрограммныйКод(ПрограммныйКод, Параметры);
	
КонецФункции

Функция ВыполнитьПакетМетодов(ПакетМетодов, ВыполнятьВПопытке=Истина, ОстанавливатьсяПоОшибке=Ложь) Экспорт

	ПакетРезультатовМассив = Новый Массив;
	ПакетРезультатовСоответствие = Новый Соответствие;
	Отказ = Ложь;
	
	Для Каждого ОписаниеМетода Из ПакетМетодов Цикл
		
		ДанныеВыполнения = Новый Структура;
		ДанныеВыполнения.Вставить("Имя", ОписаниеМетода.Имя);
		ДанныеВыполнения.Вставить("ОписаниеМетода", ОписаниеМетода);
		ДанныеВыполнения.Вставить("Ошибка", Ложь);
		ДанныеВыполнения.Вставить("Результат");
		ДанныеВыполнения.Вставить("ИнформацияОбОшибке");
		ДанныеВыполнения.Вставить("Отказ", Ложь);
		
		Если Не Отказ Тогда
			Если ВыполнятьВПопытке Тогда
				Попытка
					ВыполнитьПакетнуюПредОбработкуМетода(ОписаниеМетода, ПакетРезультатовСоответствие, Отказ);
					Если Отказ Тогда
						Результат = Неопределено;
					Иначе
						Результат = ВыполнитьМетод(ОписаниеМетода, Ложь);
					КонецЕсли;
				Исключение
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					ДанныеВыполнения.ИнформацияОбОшибке = ИнформацияОбОшибке;
					ТекстОшибки = "";
					ТекстОшибки = ТекстОшибки + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке) + Символы.ПС + Символы.ПС;
					ТекстОшибки = ТекстОшибки + вмс_Журналирование.СериализоватьКонтекст(Новый Структура("Имя, Параметры", ОписаниеМетода.Имя, ОписаниеМетода.Параметры));
					вмс_Журналирование.Ошибка(ТекстОшибки, "Метод """ + ОписаниеМетода.Имя + """");
					Результат = Неопределено;
				КонецПопытки
			Иначе
				ВыполнитьПакетнуюПредОбработкуМетода(ОписаниеМетода, ПакетРезультатовСоответствие, Отказ);
				Если Отказ Тогда
					Результат = Неопределено;
				Иначе
					Результат = ВыполнитьМетод(ОписаниеМетода, Ложь);
				КонецЕсли;
			КонецЕсли;

			ДанныеВыполнения.Ошибка = ДанныеВыполнения.ИнформацияОбОшибке <> Неопределено;
			ДанныеВыполнения.Результат = Результат;
			
			Если ДанныеВыполнения.Ошибка И ОстанавливатьсяПоОшибке Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;

		ДанныеВыполнения.Отказ = Отказ;
		
		ПакетРезультатовМассив.Добавить(ДанныеВыполнения);
		ПакетРезультатовСоответствие[ОписаниеМетода.Имя] = ДанныеВыполнения;
		
	КонецЦикла;
	
	Возврат ПакетРезультатовМассив;

КонецФункции

Функция ВыполнитьМетод(ОписаниеМетода, ВыполнятьВПопытке=Истина, ИнформацияОбОшибке=Неопределено) Экспорт
	
	ИнформацияОбОшибке = Неопределено;
	
	Если ВыполнятьВПопытке Тогда
		
		Попытка
			
			// Рефакторинг, чтобы уменьшить размер стека вызова функции
			// { Тело функции ВыполнитьОбработчикМетода
			Если ОписаниеМетода.ПредОбработка <> Неопределено Тогда
				Выполнить(ОписаниеМетода.ПредОбработка + "(ОписаниеМетода)");
			КонецЕсли;
			
			Параметры = ОписаниеМетода.Параметры;
			СтрокаПараметров = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтрокуПараметровМетода(Параметры);
			ТекстИсполняемогоКода = ОписаниеМетода.ИмяОбработчика + СтрокаПараметров;
			
			Если ОписаниеМетода.ВозвращаетРезультат Тогда
				Результат = Вычислить(ТекстИсполняемогоКода);
			Иначе
				Выполнить(ТекстИсполняемогоКода);
				Результат = Неопределено;
			КонецЕсли;

			Если ОписаниеМетода.ПостОбработка <> Неопределено Тогда
				ДанныеВыполнения = Новый Структура;
				ДанныеВыполнения.Вставить("Результат", Результат);
				ДанныеВыполнения.Вставить("ОписаниеМетода", ОписаниеМетода);
				Выполнить(ОписаниеМетода.ПостОбработка + "(ДанныеВыполнения)");
				Результат = ДанныеВыполнения.Результат;
			КонецЕсли;
			// } Тело функции
			
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			вмс_Журналирование.Ошибка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;
		
	Иначе
		
		// { Тело функции ВыполнитьОбработчикМетода
		Если ОписаниеМетода.ПредОбработка <> Неопределено Тогда
			Выполнить(ОписаниеМетода.ПредОбработка + "(ОписаниеМетода)");
		КонецЕсли;
		
		Параметры = ОписаниеМетода.Параметры;
		СтрокаПараметров = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтрокуПараметровМетода(Параметры);
		ТекстИсполняемогоКода = ОписаниеМетода.ИмяОбработчика + СтрокаПараметров;
		
		Если ОписаниеМетода.ВозвращаетРезультат Тогда
			Результат = Вычислить(ТекстИсполняемогоКода);
		Иначе
			Выполнить(ТекстИсполняемогоКода);
			Результат = Неопределено;
		КонецЕсли;

		Если ОписаниеМетода.ПостОбработка <> Неопределено Тогда
			ДанныеВыполнения = Новый Структура;
			ДанныеВыполнения.Вставить("Результат", Результат);
			ДанныеВыполнения.Вставить("ОписаниеМетода", ОписаниеМетода);
			Выполнить(ОписаниеМетода.ПостОбработка + "(ДанныеВыполнения)");
			Результат = ДанныеВыполнения.Результат;
		КонецЕсли;
		// } Тело функции
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#Область ПреобразованиеВСтруктурыОбъектовИБ  

Функция ПолучитьСтруктуруИзОбъекта(знач Объект) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	Структура = Новый Структура;
	Структура.Вставить("Представление", Строка(Объект));
	Структура.Вставить("ДополнительныеСвойства", Новый Структура);
	
	МетаДанныеОбъекта = МетаДанные.НайтиПоТипу(ТипЗнч(Объект));
	Если МетаДанныеОбъекта = Неопределено Тогда
		Возврат Структура;
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений.Содержит(МетаДанныеОбъекта) ИЛИ Метаданные.РегистрыНакопления.Содержит(МетаДанныеОбъекта) Тогда
		// набор записей регистра
		СтруктураОтбора = Новый Структура;
		Для Каждого ЭлементОтбора Из Объект.Отбор Цикл
			СтруктураОтбора.Вставить(ЭлементОтбора.ПутьКДанным, ЭлементОтбора.Значение);
		КонецЦикла;
		
		ТаблицаЗаписей = Новый ТаблицаЗначений;
		Для Каждого Реквизит Из МетаДанныеОбъекта.СтандартныеРеквизиты Цикл
			ТаблицаЗаписей.Колонки.Добавить(Реквизит.Имя);
		КонецЦикла;
		
		Для Каждого Реквизит Из МетаДанныеОбъекта.Измерения Цикл
			ТаблицаЗаписей.Колонки.Добавить(Реквизит.Имя);
		КонецЦикла;
		
		Для Каждого Реквизит Из МетаДанныеОбъекта.Реквизиты Цикл
			ТаблицаЗаписей.Колонки.Добавить(Реквизит.Имя);
		КонецЦикла;
		
		Для Каждого Реквизит Из МетаДанныеОбъекта.Ресурсы Цикл
			ТаблицаЗаписей.Колонки.Добавить(Реквизит.Имя);
		КонецЦикла;
		
		Для Каждого Запись Из Объект Цикл
			СтрокаЗаписи = ТаблицаЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗаписи, Запись);
		КонецЦикла;
		
		Структура.Вставить("Отбор", СтруктураОтбора);
		Структура.Вставить("Записи", ТаблицаЗаписей);
	Иначе
		Для Каждого Реквизит Из МетаДанныеОбъекта.СтандартныеРеквизиты Цикл
			Структура.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);
		КонецЦикла;
		
		Для Каждого Реквизит Из МетаДанныеОбъекта.Реквизиты Цикл
			Структура.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);
		КонецЦикла;
		
		Для Каждого МетаДанныеТабличнойЧасти Из МетаДанныеОбъекта.ТабличныеЧасти Цикл
			ИмяТабличнойЧасти = МетаДанныеТабличнойЧасти.Имя;
			ТабличнаяЧасть = Объект[ИмяТабличнойЧасти];
			Таблица = РК.СкопироватьТаблицуЗначений(ТабличнаяЧасть.Выгрузить(), , Истина);
			Структура.Вставить(ИмяТабличнойЧасти, Таблица);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ДополнительноеСвойство Из Объект.ДополнительныеСвойства Цикл
		Структура.ДополнительныеСвойства.Вставить(ДополнительноеСвойство.Ключ, ДополнительноеСвойство.Значение);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

Функция ПолучитьИменаРеквизитовШапкиОбъекта(Объект) Экспорт
	
	МассивИменРеквизитов = Новый Массив;
	
	МетаДанныеОбъекта = МетаДанные.НайтиПоТипу(ТипЗнч(Объект));
	Если МетаДанныеОбъекта = Неопределено Тогда
		Возврат МассивИменРеквизитов;
	КонецЕсли; 
	
	Для Каждого Реквизит Из МетаДанныеОбъекта.Реквизиты Цикл
		МассивИменРеквизитов.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	Возврат МассивИменРеквизитов;
	
КонецФункции

Функция ПолучитьЗначенияРеквизитовОбъектов(Объекты, Реквизиты, ДополнительныеПараметры=Неопределено) Экспорт
	
	ТаблицаРезультата = вмс_ОбщегоНазначенияСервер.ПолучитьРеквизитыОбъектов(Объекты, Реквизиты, ДополнительныеПараметры);

	// для возможности передачи на клиент
	КвазиТаблицаРезультата = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений(ТаблицаРезультата);
	
	Возврат КвазиТаблицаРезультата;
	
КонецФункции

Функция ПолучитьЗначенияРеквизитовОбъекта(Объект, СписокРеквизитов, ДополнительныеПараметры=Неопределено) Экспорт
	
	ТаблицаРеквизитов = вмс_ОбщегоНазначенияСервер.ПолучитьРеквизитыОбъектов(Объект, СписокРеквизитов, ДополнительныеПараметры);

	Если ЗначениеЗаполнено(ТаблицаРеквизитов) Тогда
		СтрокаРеквизита = ТаблицаРеквизитов[0];
		Значения = Новый Структура;
		Для Каждого Колонка Из ТаблицаРеквизитов.Колонки Цикл
			Значения.Вставить(Колонка.Имя, СтрокаРеквизита[Колонка.Имя]);
		КонецЦикла;
		Возврат Значения;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначениеРеквизитаОбъекта(Объект, Реквизит, ДополнительныеПараметры=Неопределено) Экспорт
	
	ТаблицаРеквизитов = вмс_ОбщегоНазначенияСервер.ПолучитьРеквизитыОбъектов(Объект, Реквизит, ДополнительныеПараметры);
	
	Если ЗначениеЗаполнено(ТаблицаРеквизитов) Тогда
		Возврат ТаблицаРеквизитов[0][ТаблицаРеквизитов.Колонки[0].Имя];
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РаботаСТипамиДанных

Функция ЭтоЗначениеСсылочногоТипа(Значение) Экспорт

	Возврат ЭтоСсылочныйТип(ТипЗнч(Значение));
	
КонецФункции

Функция ЭтоСсылочныйТип(знач ТипЗначения) Экспорт
	
	ТипЗначенияТипаЗначения = ТипЗнч(ТипЗначения);
	Если ТипЗначенияТипаЗначения = Тип("Тип") Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗначения);
	ИначеЕсли ТипЗначенияТипаЗначения = Тип("Массив") Тогда
		МассивТипов = ТипЗначения;
	ИначеЕсли ТипЗначенияТипаЗначения = Тип("ОписаниеТипов") Тогда
		МассивТипов = ТипЗначения.Типы();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ТипЗначения Из МассивТипов Цикл
		МетаДанныеЗначения = МетаДанные.НайтиПоТипу(ТипЗначения);
		Если ЭтоМетаданныеСсылочногоТипа(МетаДанныеЗначения) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоМетаданныеСсылочногоТипа(МетаДанныеЗначения) Экспорт

	Если МетаДанныеЗначения <> Неопределено Тогда
		Если МетаДанные.Справочники.Содержит(МетаДанныеЗначения) Тогда
			Возврат Истина;
		КонецЕсли;

		Если МетаДанные.Документы.Содержит(МетаДанныеЗначения) Тогда
			Возврат Истина;
		КонецЕсли;

		Если МетаДанные.ПланыВидовХарактеристик.Содержит(МетаДанныеЗначения) Тогда
			Возврат Истина;
		КонецЕсли;

		Если МетаДанные.Перечисления.Содержит(МетаДанныеЗначения) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоЗначениеПеречисления(Значение) Экспорт
	МетаДанныеОбъекта = МетаДанные.НайтиПоТипу(ТипЗнч(Значение));
	Возврат МетаДанныеОбъекта <> Неопределено И МетаДанные.Перечисления.Содержит(МетаДанныеОбъекта);
КонецФункции

Функция ПолучитьИменаСсылочныхТипов(ДляСправочников=Истина, ДляДокументов=Истина, ДляПлановВидовХарактеристик=Истина) Экспорт
	
	РазделыМетаданных = Новый Массив;
	
	Если ДляСправочников Тогда
		РазделыМетаданных.Добавить(Метаданные.Справочники);
	КонецЕсли;
	
	Если ДляДокументов Тогда
		РазделыМетаданных.Добавить(Метаданные.Документы);
	КонецЕсли;
	
	Если ДляПлановВидовХарактеристик Тогда
		РазделыМетаданных.Добавить(Метаданные.ПланыВидовХарактеристик);
	КонецЕсли;
	
	МассивИменТипов = Новый Массив;
	Для Каждого Раздел Из РазделыМетаданных Цикл
		Для Каждого ОбъектМетаданных Из Раздел Цикл
			ИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
			ИмяТипа = СтрЗаменить(ИмяОбъекта, ".", "Ссылка.");
			МассивИменТипов.Добавить(ИмяТипа);
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивИменТипов;
	
КонецФункции

Функция ЭтоОбъектИБ(Объект) Экспорт
	
	Возврат ЭтоТипОбъектаИБ(ТипЗнч(Объект));
	
КонецФункции

Функция ЭтоСсылкаОбъектаИБ(Ссылка) Экспорт
	
	Возврат ЭтоТипСсылкиОбъектаИБ(ТипЗнч(Ссылка));
	
КонецФункции

Функция ЭтоТипОбъектаИБ(ТипОбъекта) Экспорт
	
	Возврат ПолучитьДанныеТипаОбъекта(ТипОбъекта).ЭтоТипОбъектаИБ;
	
КонецФункции

Функция ЭтоТипСсылкиОбъектаИБ(ТипОбъекта) Экспорт
	
	Возврат ПолучитьДанныеТипаОбъекта(ТипОбъекта).ЭтоТипСсылкиОбъектаИБ;
	
КонецФункции

Функция ПолучитьДанныеТипаОбъекта(знач ТипОбъекта) Экспорт
	
	Данные = вмс_ОбщегоНазначенияСервер.ПолучитьДанныеТипаОбъекта(ТипОбъекта);
	
	// Значения этих полей не передаем так, как могут быть недоступны на клиенте
	Данные.Вставить("МенеджерОбъектов");
	Данные.Вставить("ТипОбъекта");
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьИмяТипаЗначения(Значение) Экспорт
	
	Возврат ПолучитьИмяТипа(ТипЗнч(Значение));
	
КонецФункции

Функция ПолучитьИмяТипаОбъекта(Объект) Экспорт
	
	МетаДанныеОбъекта = МетаДанные.НайтиПоТипу(ТипЗнч(Объект));
	
	Если МетаДанныеОбъекта <> Неопределено Тогда
		Возврат МетаДанныеОбъекта.ПолноеИмя();
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьИмяТипа(Тип) Экспорт
	
	Если Тип = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если Тип = Тип("Структура") Тогда
		ИмяТипа = "Структура";
	ИначеЕсли Тип = Тип("Соответствие") Тогда
		ИмяТипа = "Соответствие";
	ИначеЕсли Тип = Тип("Массив") Тогда
		ИмяТипа = "Массив";
	ИначеЕсли Тип = Тип("ТаблицаЗначений") Тогда
		ИмяТипа = "ТаблицаЗначений";
	ИначеЕсли Тип = Тип("УдалениеОбъекта") Тогда
		ИмяТипа = "УдалениеОбъекта";
	ИначеЕсли Тип = Тип("ОписаниеТипов") Тогда
		ИмяТипа = "ОписаниеТипов";
	ИначеЕсли Тип = Тип("ФормаКлиентскогоПриложения") Тогда
		ИмяТипа = "ФормаКлиентскогоПриложения";
	ИначеЕсли Тип = Тип("ПолеФормы") Тогда
		ИмяТипа = "ПолеФормы";
	ИначеЕсли Тип = Тип("КнопкаФормы") Тогда
		ИмяТипа = "КнопкаФормы";
	ИначеЕсли Тип = Тип("ТаблицаФормы") Тогда
		ИмяТипа = "ТаблицаФормы";
	ИначеЕсли Тип = Тип("ГруппаФормы") Тогда
		ИмяТипа = "ГруппаФормы";
	ИначеЕсли Тип = Тип("Число") Тогда
		ИмяТипа = "Число";
	ИначеЕсли Тип = Тип("Строка") Тогда
		ИмяТипа = "Строка";
	ИначеЕсли Тип = Тип("Дата") Тогда
		ИмяТипа = "Дата";
	ИначеЕсли Тип = Тип("Булево") Тогда
		ИмяТипа = "Булево";
	ИначеЕсли Тип = Тип("Неопределено") Тогда
		ИмяТипа = "Неопределено";
	Иначе
		XMLТип = XMLТип(Тип);
		Если XMLТип <> Неопределено Тогда
			ИмяТипа = XMLТип.ИмяТипа;
			ИмяТипа = СтрЗаменить(ИмяТипа, "EnumRef.", "ПеречислениеСсылка.");
			ИмяТипа = СтрЗаменить(ИмяТипа, "CatalogRef.", "СправочникСсылка.");
			ИмяТипа = СтрЗаменить(ИмяТипа, "DocumentRef.", "ДокументСсылка.");
			ИмяТипа = СтрЗаменить(ИмяТипа, "ChartOfCharacteristicTypesRef.", "ПланВидовХарактеристикСсылка.");
			ИмяТипа = СтрЗаменить(ИмяТипа, "CatalogObject.", "СправочникОбъект.");
			ИмяТипа = СтрЗаменить(ИмяТипа, "DocumentObject.", "ДокументОбъект.");
			ИмяТипа = СтрЗаменить(ИмяТипа, "ChartOfCharacteristicTypesObject.", "ПланВидовХарактеристикОбъект.");
			ИмяТипа = СтрЗаменить(ИмяТипа, "InformationRegisterRecordSet.", "РегистрСведенийНаборЗаписей.");
			ИмяТипа = СтрЗаменить(ИмяТипа, "AccumulationRegisterRecordSet.", "РегистрНакопленияНаборЗаписей.");
		Иначе
			МетаданныеОбъекта = Метаданные.НайтиПоТипу(Тип);
			Если МетаданныеОбъекта <> Неопределено Тогда
				ИмяТипа = МетаданныеОбъекта.ПолноеИмя();
			Иначе
				ИмяТипа = Строка(Тип);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат ИмяТипа;
	
КонецФункции

Функция ЕстьМетаданныеОбъекта(Объект) Экспорт
	
	Возврат вмс_ОбщегоНазначенияСервер.ПолучитьМетаданныеОбъекта(Объект) <> Неопределено;
	
КонецФункции

Функция ПолучитьСписокИменОбщихМодулей(НаКлиенте) Экспорт
	
	СписокИмен = Новый Массив;
	
	Для Каждого ОМ Из Метаданные.ОбщиеМодули Цикл
		
		Если ОМ.Глобальный Тогда
			Продолжить;
		КонецЕсли;
		
		Если НаКлиенте И (ОМ.КлиентУправляемоеПриложение ИЛИ ОМ.ВызовСервера) ИЛИ
			НЕ НаКлиенте И ОМ.Сервер Тогда
			СписокИмен.Добавить(ОМ.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокИмен;
	
КонецФункции

// Безопасное получение описания типов,
// если каких-то типов не существует в данной конфигурации, то он добавлен не будет
//
// Параметры:
//  Источник - Произвольный - Если тип "ОписаниеТипов",то без изменений.
//    Иначе преобразуется в только существующие типы.
//  КвалификаторыЧисла - КвалификаторыЧисла - По умолчанию Неопределено.
//  КвалификаторыСтроки - КвалификаторыСтроки - По умолчанию Неопределено.
//  КвалификаторыДаты - КвалификаторыДаты - По умолчанию Неопределено.
//
// Возвращаемое значение:
//  ОписаниеТипов
//
Функция ПолучитьОписаниеТипов(Источник, КвалификаторыЧисла=Неопределено, КвалификаторыСтроки=Неопределено, КвалификаторыДаты=Неопределено) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("ОписаниеТипов") Тогда
		Возврат Источник;
	КонецЕсли;
	
	МассивТипов = вмс_РаботаСКоллекциями.ЗначениеВМассив(Источник);
	МассивТиповПроверенный = ПроверитьТипыДанных(МассивТипов);
	ОписаниеТипов = Новый ОписаниеТипов(МассивТиповПроверенный, КвалификаторыЧисла, КвалификаторыСтроки, КвалификаторыДаты);
	
	Возврат ОписаниеТипов;
	
КонецФункции

Функция ПроверитьТипыДанных(ТипыДанных) Экспорт

	МассивТипов = вмс_РаботаСКоллекциями.ЗначениеВМассив(ТипыДанных, , Ложь);
	МассивТиповПроверенный = Новый Массив;
	Для Каждого ТипДанных Из МассивТипов Цикл
		Если ТипЗнч(ТипДанных) <> Тип("Тип") Тогда
			ИмяТипаДанных = Строка(ТипДанных);
			Если СтрНайти(ИмяТипаДанных, "Ссылка.") > 0 Тогда
				ИмяОбъекта = СтрЗаменить(ИмяТипаДанных, "Ссылка.", ".");
				МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяОбъекта);
				Если МетаданныеОбъекта = Неопределено Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ТипДанных = Тип(ИмяТипаДанных);
		КонецЕсли;
		
		МассивТиповПроверенный.Добавить(ТипДанных);
	КонецЦикла;
	
	Возврат МассивТиповПроверенный;
	
КонецФункции

Функция ПолучитьИмяТипаСсылкиОбъектаИБ(ИмяТипаОбъектаИБ) Экспорт
	
	ИмяТипаСсылкиОбъектаИБ = СтрЗаменить(ИмяТипаОбъектаИБ, ".", "Ссылка.");
	
	Возврат ИмяТипаСсылкиОбъектаИБ;
	
КонецФункции

#КонецОбласти

#Область РаботаСXDTO

Функция ПолучитьТекстОбъектаXDTO(Объект) Экспорт
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ПолучитьТекстОбъектаXDTO(Объект);
	
КонецФункции

Функция ПрочитатьТекстОбъектаXDTO(ТекстОбъекта) Экспорт
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ПрочитатьТекстОбъектаXDTO(ТекстОбъекта);
	
КонецФункции

Функция СериализаторXDTO_XMLТип(знач Тип) Экспорт
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.СериализаторXDTO_XMLТип(Тип);
	
КонецФункции

Функция СериализаторXDTO_XMLСтрока(знач Значение) Экспорт
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.СериализаторXDTO_XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

#Область КвазиСсылки

Функция ПолучитьКвазиСсылкуИБ(ИмяТипа, GUID, Представление="") Экспорт
	
	Ссылка = НайтиКвазиСсылкуИБ(ИмяТипа, GUID);
	
	Если Ссылка = Неопределено Тогда
		Ссылка = СоздатьКвазиСсылкуИБ(ИмяТипа, GUID, Представление);
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Функция ПолучитьОбъектКвазиСсылкиИБ(ИмяТипа, GUID, Представление="") Экспорт
	
	Ссылка = НайтиКвазиСсылкуИБ(ИмяТипа, GUID);
	
	Если Ссылка <> Неопределено Тогда
		Объект = Ссылка.ПолучитьОбъект();
	Иначе
		Объект = СоздатьОбъектКвазиСсылкиИБ(ИмяТипа, GUID, Представление);
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции

Функция НайтиКвазиСсылкуИБ(ИмяТипа, GUID) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяТипа", ИмяТипа);
	Запрос.УстановитьПараметр("GUID", GUID);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КвазиСсылки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КвазиСсылки КАК КвазиСсылки
	|ГДЕ
	|	КвазиСсылки.ИмяТипа = &ИмяТипа
	|	И КвазиСсылки.GUID = &GUID
	|	И НЕ КвазиСсылки.ПометкаУдаления";
	
	Если ТипЗнч(GUID) = Тип("Строка") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КвазиСсылки.GUID", "КвазиСсылки.Имя"); 
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

// Функция - ПолучитьДанныеКвазиСсылокИБ
//
// Параметры:
//  - КвазиСсылкиИБ - Массив - массив квази-ссылок информационной базы
//  - ТипРезультата - Число -	1 - возвращает квазитаблицу значений (КвазиТаблицаЗначений), 
//								2 - возвращает массив структур
// 
// Возвращаемое значение:
//  - КвазиТаблицаЗначений - если ТипРезультата = 1
//  - Массив - массив структур с полями Ссылка, ИмяТипа, GUID, Имя, если ТипРезультата = 2
//
Функция ПолучитьДанныеКвазиСсылокИБ(КвазиСсылкиИБ, ТипРезультата=1) Экспорт
	
	Перем РаботаСКоллекциями, ОбщегоНазначенияСервер;
	
	РаботаСКоллекциями = вмс_РаботаСКоллекциями;
	ОбщегоНазначенияСервер = вмс_ОбщегоНазначенияСервер;
	
	/////////////////////////////////////////////////////////////////////////////////////////
	ТаблицаКвазиСсылокИБ = ОбщегоНазначенияСервер.ПолучитьДанныеКвазиСсылокИБ(КвазиСсылкиИБ);
	
	Если ТипРезультата = 1 Тогда
		Возврат РаботаСКоллекциями.НоваяКвазиТаблицаЗначений(ТаблицаКвазиСсылокИБ);
	КонецЕсли;
	
	Если ТипРезультата = 2 Тогда
		МассивКвазиСсылкиИБ = Новый Массив;
		ПоляДанных = "Ссылка, ИмяТипа, GUID, Имя";
		Для Каждого СтрокаТаблицыКвазиСсылкиИБ Из ТаблицаКвазиСсылокИБ Цикл
			ДанныеКвазиСсылкиИБ = Новый Структура(ПоляДанных);
			ЗаполнитьЗначенияСвойств(ДанныеКвазиСсылкиИБ, СтрокаТаблицыКвазиСсылкиИБ);
			МассивКвазиСсылкиИБ.Добавить(ДанныеКвазиСсылкиИБ);
		КонецЦикла;
		Возврат МассивКвазиСсылкиИБ;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область МетаданныеОбъектов 

Функция ПолучитьОписаниеМетаданныхОбъекта(Объект) Экспорт
	
	Описание = вмс_ОбщегоНазначенияСервер.ПолучитьОписаниеМетаданныхОбъекта(Объект);
	вмс_РаботаСКоллекциями.ПреобразоватьТаблицыЗначенийВКвазиТаблицыЗначенийВДанных(Описание);
	
	Возврат Описание;
	
КонецФункции

Функция ПолучитьОписанияМетаданныхОбъектов(ИменаОбъектов) Экспорт
	
	МассивОписанийМетаданныхОбъектов = вмс_ОбщегоНазначенияСервер.ПолучитьОписанияМетаданныхОбъектов(ИменаОбъектов);
	вмс_РаботаСКоллекциями.ПреобразоватьТаблицыЗначенийВКвазиТаблицыЗначенийВДанных(МассивОписанийМетаданныхОбъектов);
	
	Возврат МассивОписанийМетаданныхОбъектов;
	
КонецФункции

#КонецОбласти

#Область ХранилищеОбщихНастроек

Функция ХранилищеОбщихНастроек_Загрузить(КлючОбъекта, КлючНастроек) Экспорт
	
	Возврат ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек);
	
КонецФункции

Функция ХранилищеОбщихНастроек_Сохранить(КлючОбъекта, КлючНастроек, Настройки) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, Настройки);
	
КонецФункции

Функция ХранилищеОбщихНастроек_Удалить(КлючОбъекта, КлючНастроек) Экспорт
	
	ИмяПользователяИБ = ПолучитьТекущийСеансИнформационнойБазы().Пользователь.Имя;
	
	ХранилищеОбщихНастроек.Удалить(КлючОбъекта, КлючНастроек, ИмяПользователяИБ);
	
КонецФункции

#КонецОбласти

#Область УправлениеКонтекстом

Функция ЭтоБэкенд() Экспорт
	
	Возврат Метаданные.HTTPСервисы.Найти("HTTPObmen") <> Неопределено;
	
КонецФункции

Функция СеансСуществует(НомерСеанса, НачалоСеанса) Экспорт

	Для Каждого Сеанс Из ПолучитьСеансыИнформационнойБазы() Цикл
		Если Сеанс.НомерСеанса=НомерСеанса И Сеанс.НачалоСеанса=НачалоСеанса Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	ПрефиксПараметров = "вмс_";
	
	Если ИменаПараметровСеанса = Неопределено Тогда
		ПриНачалеРаботы();
		Возврат;
	КонецЕсли;
	
	ИменаПараметровСеансаМассив = вмс_РаботаСКоллекциями.ЗначениеВМассив(ИменаПараметровСеанса);
	
	Для Каждого ИмяПараметраСеанса Из ИменаПараметровСеансаМассив Цикл
		
		Если ИмяПараметраСеанса = ПрефиксПараметров + "НастройкаТоварныхПолей" Тогда 
			ПараметрыСеанса.вмс_НастройкаТоварныхПолей =
					Новый ХранилищеЗначения(Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("НастройкаТоварныхПолей"));
		КонецЕсли;
				
		Если ИмяПараметраСеанса = "вмс_АдресХранилищаПараметровПриложения" Тогда
			
			ПараметрыСеанса.вмс_АдресХранилищаПараметровПриложения = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
			
		ИначеЕсли ИмяПараметраСеанса = "вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок" Тогда
			
			ПараметрыСеанса.вмс_АдресХранилищаСостоянийСерверУправляемыхОбработок = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
			
		ИначеЕсли ИмяПараметраСеанса = "вмс_НомерКэшированияПараметровПриложения" Тогда
			
			ПараметрыСеанса.вмс_НомерКэшированияПараметровПриложения = 0;
			
		ИначеЕсли ИмяПараметраСеанса = "вмс_ХешСуммаРасширенияКонфигурации" Тогда
			
			ПараметрыСеанса.вмс_ХешСуммаРасширенияКонфигурации = вмс_ОбновлениеИнформационнойБазыWMS.ХешСуммаРасширенияКонфигурации();
			
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Алгоритмы

Функция ВыполнитьАлгоритм(АлгоритмСсылка, ВходящиеПараметры = Неопределено, ОшибкаВыполнения = Ложь,
	СообщениеОбОшибке = "") Экспорт
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьАлгоритм(АлгоритмСсылка, ВходящиеПараметры, ОшибкаВыполнения,
		СообщениеОбОшибке);
КонецФункции

Функция ПолучитьСсылкуСправочникАлгоритмы(Алгоритм) Экспорт
	Возврат вмс_ОбщегоНазначенияСервер.ПолучитьСсылкуСправочникАлгоритмы(Алгоритм);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьРазмерДанных(Данные) Экспорт
	
	ХЗ = Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
	Строка = XMLСтрока(ХЗ);
	РазмерДанных = СтрДлина(Строка);
	Возврат РазмерДанных;
	
КонецФункции

#Область НачальноеЗаполнение

Функция СформироватьТабличныйДокументНачальногоЗаполненияТСД() Экспорт  
	
	Данные = ПолучитьДанныеНачальногоЗаполнения();
	
	Если Данные = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = ПолучитьОбщийМакет("МакетШтрихкода");
	Шаблон = Макет.ПолучитьОбласть("ОбластьШтрихкода"); 
	
	Эталон = ПолучитьОбщийМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;  //0.26454
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",          Окр(100 / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",          Окр(100 / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",        Данные);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь); 
	ПараметрыШтрихкода.Вставить("Масштабировать", Истина);
	
	ПараметрыШтрихкода.Вставить("ТипКода",16);
	
	// ТУ Алфимов 01.03.2024++
	//Шаблон.Рисунки.Штрихкод.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
	// ТУ_Кулалаев Е.С ++ 31.05.2024 17:59:26 
	// Рефакторинг: Заменил вмс_Печать на вмс_Печать
		
	Шаблон.Рисунки.Штрихкод.Картинка = вмс_Печать.ИзображениеШтрихкода(ПараметрыШтрихкода);
	// ТУ Алфимов 01.03.2024--
	
	Шаблон.Рисунки.Штрихкод.Высота = 100;
	ТабличныйДокумент.Вывести(Шаблон);   
	
	ПредставлениеКода = Макет.ПолучитьОбласть("ПредставлениеКода");
	ПредставлениеКода.Параметры.ПредставлениеКода = "Отсканируйте данный штрихкод на ТСД для заполнения начальных параметров";  
	ТабличныйДокумент.Вывести(ПредставлениеКода);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСМодулями

//{ Адаптация
//
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

#КонецОбласти

#Область НачальноеЗаполнение 

Функция ПолучитьДанныеНачальногоЗаполнения()

	Данные = Новый Структура("", );
	
	// Проверка настройки публикации
	НастройкаПодключения = вмс_Сервер.ПолучитьНастройкуПодключения();
	Если ЗначениеЗаполнено(НастройкаПодключения) Тогда 
		Если ЗначениеЗаполнено(НастройкаПодключения.Значение) Тогда
			Данные.Вставить("АдресПубликации",НастройкаПодключения.Значение);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнена ключевая настройка ""Адрес публикации""";
			Сообщение.Сообщить();  
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена ключевая настройка ""Адрес публикации""";
		Сообщение.Сообщить();  
		Возврат Неопределено;
	КонецЕсли;  
	
	Данные = вмс_РаботаСXMLКлиентСервер.СериализироватьВXMLНаСервере(Данные);
	Данные = СтрЗаменить(Данные,Символы.ПС,"");
	
	Данные = "INICIALIZATION" + Данные;
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область ВыполнениеКода

Функция ВыполнитьПакетнуюПредОбработкуМетода(ОписаниеМетода, ПакетРезультатовСоответствие, Отказ)
	
	Если ОписаниеМетода.ПакетнаяПредОбработка <> Неопределено Тогда
		Выполнить(ОписаниеМетода.ПакетнаяПредОбработка);
	КонецЕсли;
	
КонецФункции 

Функция ВыполнитьОбработчикМетода(ОписаниеМетода)
	
	Если ОписаниеМетода.ПредОбработка <> Неопределено Тогда
		Выполнить(ОписаниеМетода.ПредОбработка + "(ОписаниеМетода)");
	КонецЕсли;
	
	Параметры = ОписаниеМетода.Параметры;
	СтрокаПараметров = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтрокуПараметровМетода(Параметры);
	ТекстИсполняемогоКода = ОписаниеМетода.ИмяОбработчика + СтрокаПараметров;
	
	Если ОписаниеМетода.ВозвращаетРезультат Тогда
		Результат = Вычислить(ТекстИсполняемогоКода);
	Иначе
		Выполнить(ТекстИсполняемогоКода);
		Результат = Неопределено;
	КонецЕсли;

	Если ОписаниеМетода.ПостОбработка <> Неопределено Тогда
		ДанныеВыполнения = Новый Структура;
		ДанныеВыполнения.Вставить("Результат", Результат);
		ДанныеВыполнения.Вставить("ОписаниеМетода", ОписаниеМетода);
		Выполнить(ОписаниеМетода.ПостОбработка + "(ДанныеВыполнения)");
		Результат = ДанныеВыполнения.Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СлужебнаяФункцияВызовСервераНаФорме(Форма, ПрограммныйКод, ДополнительныеПараметры=Неопределено) Экспорт
	
	Результат = Неопределено;
	Выполнить(ПрограммныйКод);
	Возврат Результат;
	
КонецФункции

// ТУ_Кошелев 13.12.24 - добавил функцию текстового представления ошибки.
// В мобилке есть дубль этой функции, сделан для новой формы отбора. Вероятно целесообразно проверить использования этой
// функции в МП, и заменить все случаи на формирование текста в учетной системе напрямую.
//
Функция ТекстовоеПредставлениеОшибки(Инфо) Экспорт
	Если Инфо.Причина = Неопределено Тогда
		Причина = "";
	Иначе
		Причина = Инфо.Причина.Описание;
	КонецЕсли;
	
	Сообщение =
		"Модуль  : " + Инфо.ИмяМодуля + Символы.ПС +
		"Строка №: " + Инфо.НомерСтроки + Символы.ПС +
		"Строка  : " + Инфо.ИсходнаяСтрока + Символы.ПС +
		"Описание: " + Инфо.Описание + Символы.ПС +
		"Доп инфо: " + Инфо.ДополнительнаяИнформация + Символы.ПС +
		"Причина : " + Причина + Символы.ПС +
		"Код     : " + Инфо.Код + Символы.ПС;
	Возврат Сообщение;
КонецФункции

#КонецОбласти 

#Область КвазиСсылки

Функция СоздатьКвазиСсылкуИБ(ИмяТипа, GUID, Представление="")

	КвазиСсылкаИБ = СоздатьОбъектКвазиСсылкиИБ(ИмяТипа, GUID, Представление);
	КвазиСсылкаИБ.Записать();
	
	Возврат КвазиСсылкаИБ.Ссылка;

КонецФункции

Функция СоздатьОбъектКвазиСсылкиИБ(ИмяТипа, GUID, Представление="")

	КвазиСсылкаИБ = Справочники.КвазиСсылки.СоздатьЭлемент();
	КвазиСсылкаИБ.ИмяТипа = ИмяТипа;
	Если ТипЗнч(GUID) = Тип("Строка") Тогда
		КвазиСсылкаИБ.Имя = GUID;
	Иначе
		КвазиСсылкаИБ.GUID = GUID;
	КонецЕсли;
	КвазиСсылкаИБ.Наименование = Представление;
	
	Возврат КвазиСсылкаИБ;

КонецФункции

#КонецОбласти

Функция ПолучитьДанныеСеанса() Экспорт
	
	ПараметрыПриложения = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПриложения();
	ДанныеСеансаИБ = ПолучитьДанныеТекущегоСеансаИнформационнойБазы();
	
	ДанныеДляОтладки = ПараметрыПриложения["ДанныеДляОтладки"];
	
	ДанныеСеанса = Новый Структура;
	ДанныеСеанса.Вставить("ДатаИнициализации", ДанныеДляОтладки.ДатаИнициализации);
	ДанныеСеанса.Вставить("Идентификатор", ДанныеДляОтладки.Идентификатор);
	ДанныеСеанса.Вставить("СсылочностьНарушена", ДанныеДляОтладки.Ссылка1 <> ДанныеДляОтладки.Ссылка2);
	ДанныеСеанса.Вставить("ПотерялиКэш", ДанныеДляОтладки.ПотерялиКэш);
	ДанныеСеанса.Вставить("ЧутьНеПотерялиКэш", ДанныеДляОтладки.ЧутьНеПотерялиКэш);
	ДанныеСеанса.Вставить("ПричинаПотериКэша", ДанныеДляОтладки.ПричинаПотериКэша);
	
	Для Каждого ПолеДанныхСеансаИБ Из ДанныеСеансаИБ Цикл
		ДанныеСеанса.Вставить(ПолеДанныхСеансаИБ.Ключ, ПолеДанныхСеансаИБ.Значение);
	КонецЦикла;
	
	Возврат ДанныеСеанса;
	
КонецФункции

Функция ПолучитьДанныеТекущегоСеансаИнформационнойБазы() Экспорт

	ДанныеСеанса = Новый Структура("IPАдресКлиента, ИмяКомпьютера, ИмяПриложения, НачалоСеанса, НомерСеанса, НомерСоединения, ИмяПользователя");
	
	ТекущийСеанс = ПолучитьТекущийСеансИнформационнойБазы();
	ЗаполнитьЗначенияСвойств(ДанныеСеанса, ТекущийСеанс);
	ДанныеСеанса.ИмяПользователя = ТекущийСеанс.Пользователь.Имя;
	
	Возврат ДанныеСеанса;
	
КонецФункции

Функция ПриНачалеРаботы()
	
КонецФункции

#КонецОбласти

Функция ПолучитьТаблицуРезультатаЗапроса(знач Запрос) Экспорт
	
	ТаблицаРезультата = вмс_ОбщегоНазначенияСервер.ПолучитьТаблицуРезультатаЗапроса(Запрос);
	
	// для передачи на клиент
	КвазиТаблицаРезультата = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений(ТаблицаРезультата);
	
	Возврат КвазиТаблицаРезультата;
	
КонецФункции

Функция НайтиЭлементыИерархическогоСправочника(ИмяСправочника, знач ИдентификаторыЭлементов, ИмяРеквизитаПоиска="Наименование") Экспорт
	
	ТаблицаРезультата = вмс_ОбщегоНазначенияСервер.НайтиЭлементыИерархическогоСправочника(ИмяСправочника, ИдентификаторыЭлементов, ИмяРеквизитаПоиска);
	
	// для возможности передачи на клиент
	КвазиТаблицаРезультата = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений(ТаблицаРезультата);
	
	Возврат КвазиТаблицаРезультата;
	
КонецФункции

Функция ВерсияДанных(знач Ссылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	ТаблицаДанныхИБ = Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)).ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДанныхИБ.ВерсияДанных КАК ВерсияДанных
	|ИЗ
	|	Документ.вмс_ЗаданиеКладовщику КАК ТаблицаДанныхИБ
	|ГДЕ
	|	ТаблицаДанныхИБ.Ссылка = &Ссылка";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.вмс_ЗаданиеКладовщику", ТаблицаДанныхИБ);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ВерсияДанных;
	
КонецФункции

// Для исследования поведения системы при критических сбоях
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  Не стоит ждать
//
Функция УронитьСистему() Экспорт
	
	БесконечнаяСтруктура = Новый Структура;
	БесконечнаяСтруктура.Вставить("а", БесконечнаяСтруктура);
	
	ХранилищеЗначения = Новый ХранилищеЗначения(БесконечнаяСтруктура);
	
	Возврат "Груз200";
	
КонецФункции

Функция ПолучитьИмяПользователяОС() Экспорт
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ПолучитьИмяПользователяОС();
	
КонецФункции

Функция ПолучитьИмяСистемнойПеременной(ИмяПеременной) Экспорт
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ПолучитьИмяСистемнойПеременной(ИмяПеременной);
	
КонецФункции