
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	АдаптироватьТекстЗапросаПодКонфигурацию();
	
КонецПроцедуры

Процедура АдаптироватьТекстЗапросаПодКонфигурацию() 
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;
	
	Если вмс_АдаптацияКонфигураций.ЭтоУТ() ИЛИ вмс_АдаптацияКонфигураций.ЭтоЕРП() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗанятыйОбъем", 
		
		// ТУ_Кулалаев
		// Убрал расчет объема из контейнера. Теперь считает по составу контейнера
		
		//"	ВЫБОР
		//|	КОГДА вмс_ОперацияПоЯчейкамОстатки.Контейнер <> НЕОПРЕДЕЛЕНО
		//|			И вмс_ОперацияПоЯчейкамОстатки.Контейнер <> ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка)
		//|		ТОГДА вмс_ОперацияПоЯчейкамОстатки.Контейнер.ТипТары.Объем
		//|	ИНАЧЕ ВЫБОР
		//|			КОГДА вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЧислитель / ВЫБОР
		//|					КОГДА вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЗнаменатель = 0
		//|						ТОГДА 1
		//|					ИНАЧЕ вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЗнаменатель
		//|				КОНЕЦ * вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток < 0
		//|				ТОГДА 0
		//|			ИНАЧЕ вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЧислитель / ВЫБОР
		//|					КОГДА вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЗнаменатель = 0
		//|						ТОГДА 1
		//|					ИНАЧЕ вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЗнаменатель
		//|				КОНЕЦ * вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток
		//|		КОНЕЦ
		//|КОНЕЦ");
		
		"	ВЫБОР
		|			КОГДА вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЧислитель / ВЫБОР
		|					КОГДА вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЗнаменатель = 0
		|						ТОГДА 1
		|					ИНАЧЕ вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЗнаменатель
		|				КОНЕЦ * вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток < 0
		|				ТОГДА 0
		|			ИНАЧЕ вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЧислитель / ВЫБОР
		|					КОГДА вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЗнаменатель = 0
		|						ТОГДА 1
		|					ИНАЧЕ вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЗнаменатель
		|				КОНЕЦ * вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток
		|		КОНЕЦ");
		
	КонецЕсли;
	
	Если вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗанятыйОбъем", 
		
		// ТУ_Кулалаев
		// Убрал расчет объема из контейнера. Теперь считает по составу контейнера
		
		//"	ВЫБОР
		//|	КОГДА вмс_ОперацияПоЯчейкамОстатки.Контейнер <> НЕОПРЕДЕЛЕНО
		//|			И вмс_ОперацияПоЯчейкамОстатки.Контейнер <> ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка)
		//|		ТОГДА вмс_ОперацияПоЯчейкамОстатки.Контейнер.ТипТары.Объем
		//|	ИНАЧЕ вмс_ОперацияПоЯчейкамОстатки.Товар.Объем * вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток
		//|		КОНЕЦ");
		
		"вмс_ОперацияПоЯчейкамОстатки.Товар.Объем * вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток");
	КонецЕсли; 
	
	СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = ТекстЗапроса;
	
КонецПроцедуры
