// Сетраков 14.10.2025
Процедура вмс_АнализироватьABC(ГраницаПоказателяA = 90, ГраницаПоказателяB = 76) Экспорт
	
	// Получаем НачалоПериода из даты последнего выполненного успешно фонового задания у регламентного задания
	РегЗадания = ПолучитьРегЗаданияABCАнализ();
	ДатаВыполнения = ТекущаяДатаСеанса();
	
	// Ищем есть ли вообще регламентное задание, если нет,
	// то будем искать по регистру первой записи регистра ВыручкаИСебестоимостьПродаж
	Если РегЗадания.Количество() > 0 Тогда
		
		ПоследнееЗадание = РегЗадания[0].ПоследнееЗадание;
		
		Если ЗначениеЗаполнено(ПоследнееЗадание) Тогда
			НачалоПериода = ПоследнееЗадание.Конец;
		Иначе
			НачалоПериода = ДобавитьМесяц(ДатаВыполнения, -3);
		КонецЕсли;
		
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыручкаИСебестоимостьПродаж.Период КАК Период
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
		
		РезультатЗапросаПериодовВыручкаИСебестоимостьПродаж = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписиВыручкаИСебестоимостьПродаж = РезультатЗапросаПериодовВыручкаИСебестоимостьПродаж.Выбрать();
		// Ищем есть ли вообще записи в регистре накопления
		Если ВыборкаДетальныеЗаписиВыручкаИСебестоимостьПродаж.Следующий() Тогда
			
			НачалоПериода = ВыборкаДетальныеЗаписиВыручкаИСебестоимостьПродаж.Период;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	// Получаем данные из ВыручкаИСебестоимостьПродаж
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыручкаИСебестоимостьПродаж.Склад.Ссылка КАК СкладСсылка,
	|	СУММА(ВыручкаИСебестоимостьПродаж.Количество) КАК Количество,
	|	СУММА(ВыручкаИСебестоимостьПродаж.СуммаВыручки) КАК СуммаВыручки
	|ПОМЕСТИТЬ ВТИтогиКоличествоИСуммаПоСкладам
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|ГДЕ
	|	ВыручкаИСебестоимостьПродаж.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ОптовыйСклад)
	|	И ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимостьПродаж.Склад.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИтогиКоличествоИСуммаПоСкладам.СкладСсылка КАК СкладСсылка,
	|	ВТИтогиКоличествоИСуммаПоСкладам.Количество КАК КоличествоПоСкладу,
	|	ВТИтогиКоличествоИСуммаПоСкладам.СуммаВыручки КАК СуммаВыручкиПоСкладу,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаВыручкиОборот,
	|	ВЫБОР
	|			КОГДА ВТИтогиКоличествоИСуммаПоСкладам.Количество = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот / ВТИтогиКоличествоИСуммаПоСкладам.Количество * 100
	|	КОНЕЦ КАК ПроцентСуммыПроданного,
	|	ВЫБОР
	|			КОГДА ВТИтогиКоличествоИСуммаПоСкладам.СуммаВыручки = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот / ВТИтогиКоличествоИСуммаПоСкладам.СуммаВыручки * 100
	|	КОНЕЦ КАК ПроцентКоличестваПроданного
	|ИЗ
	|	ВТИтогиКоличествоИСуммаПоСкладам КАК ВТИтогиКоличествоИСуммаПоСкладам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ПО ВТИтогиКоличествоИСуммаПоСкладам.СкладСсылка = ВыручкаИСебестоимостьПродажОбороты.Склад.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТИтогиКоличествоИСуммаПоСкладам.СкладСсылка,
	|	ВТИтогиКоличествоИСуммаПоСкладам.Количество,
	|	ВТИтогиКоличествоИСуммаПоСкладам.СуммаВыручки,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот,
	|	ВЫБОР
	|			КОГДА ВТИтогиКоличествоИСуммаПоСкладам.Количество = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот / ВТИтогиКоличествоИСуммаПоСкладам.Количество * 100
	|	КОНЕЦ,
	|	ВЫБОР
	|			КОГДА ВТИтогиКоличествоИСуммаПоСкладам.СуммаВыручки = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот / ВТИтогиКоличествоИСуммаПоСкладам.СуммаВыручки * 100
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкладСсылка УБЫВ,
	|	ПроцентСуммыПроданного УБЫВ,
	|	ПроцентКоличестваПроданного УБЫВ";
	
	Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
	Запрос.Параметры.Вставить("КонецПериода", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Выручка = Новый Структура;
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Склад = ВыборкаДетальныеЗаписи.СкладСсылка;
		
		Если НЕ Выручка.Свойство("Склад") Тогда
			
			Выручка.Вставить("Склад", Склад);
			Выручка.Вставить("ИтоговыйВкладКоличестваПроцент", 0);
			Выручка.Вставить("ИтоговыйВкладСуммаПроцент", 0);
			Выручка.Вставить("КоличествоПоСкладу", ВыборкаДетальныеЗаписи.КоличествоПоСкладу);
			Выручка.Вставить("СуммаВыручкиПоСкладу", ВыборкаДетальныеЗаписи.СуммаВыручкиПоСкладу);
			Выручка.Вставить("Номенклатура", " ");
			Выручка.Вставить("ABCАнализСумма", " ");
			Выручка.Вставить("ABCАнализКоличество", " ");
			
		КонецЕсли;
		
		Если Склад = Выручка.Склад Тогда
			// Высчитываем нарастающие итоги
			Выручка.ИтоговыйВкладКоличестваПроцент = Выручка.ИтоговыйВкладКоличестваПроцент + ВыборкаДетальныеЗаписи.ПроцентКоличестваПроданного;
			Выручка.ИтоговыйВкладСуммаПроцент = Выручка.ИтоговыйВкладСуммаПроцент + ВыборкаДетальныеЗаписи.ПроцентСуммыПроданного;				
			
		Иначе   
			
			// Сбрасываем данные для нового склада
			Выручка.Склад = Склад;
			Выручка.КоличествоПоСкладу = ВыборкаДетальныеЗаписи.КоличествоПоСкладу;
			Выручка.СуммаВыручкиПоСкладу = ВыборкаДетальныеЗаписи.СуммаВыручкиПоСкладу;
			Выручка.ИтоговыйВкладКоличестваПроцент = 0 + ВыборкаДетальныеЗаписи.ПроцентКоличестваПроданного;
			Выручка.ИтоговыйВкладСуммаПроцент = 0 + ВыборкаДетальныеЗаписи.ПроцентСуммыПроданного;
			
		КонецЕсли;
		
		Выручка.Номенклатура = ВыборкаДетальныеЗаписи.АналитикаУчетаНоменклатурыНоменклатура;
		// Высчитываем значения групп
		СуммовойПоказатель = Выручка.ИтоговыйВкладСуммаПроцент;
		КоличественныйПоказатель = Выручка.ИтоговыйВкладКоличестваПроцент;
		
		Выручка.ABCАнализСумма = ?(СуммовойПоказатель >= ГраницаПоказателяA, "A", ?(СуммовойПоказатель >=ГраницаПоказателяB, "B", "C"));
		Выручка.ABCАнализКоличество = ?(КоличественныйПоказатель >= ГраницаПоказателяA, "A", ?(КоличественныйПоказатель >=ГраницаПоказателяB, "B", "C"));
		
		Стр = РегистрыСведений.вмс_ABCАнализ.СоздатьМенеджерЗаписи();
		Стр.Заполнить(Неопределено);
		Стр.Период = ТекущаяДата();
		Стр.Номенклатура = Выручка.Номенклатура;
		Стр.Склад = Выручка.Склад;
		Стр.ГруппыКоличество = Выручка.ABCАнализКоличество;
		Стр.ГруппыСумма = Выручка.ABCАнализСумма;
		Стр.ИтоговыйВкладКоличествоПроцент = СуммовойПоказатель;
		Стр.ИтоговыйВкладСуммаПроцент = КоличественныйПоказатель;
		Стр.Записать();
		
	КонецЦикла;			
	
КонецПроцедуры

// Сетраков 20.10.2025 
&НаСервере
Функция ПолучитьРегЗаданияABCАнализ() Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные", Метаданные.РегламентныеЗадания.вмс_АнализироватьABC);
	РегЗаданияABCАнализ = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	
	Возврат РегЗаданияABCАнализ;
	
КонецФункции

&НаСервере
Функция СоздатьРасписаниеРегламентногоЗаданияABCАнализа()

	Расписание = Новый РасписаниеРегламентногоЗадания();
	
	Расписание.ПериодПовтораДней = 90;       
	
	Возврат Расписание;
	
КонецФункции 

&НаСервере
Функция СоздатьРегламентноеЗаданиеABCАнализа(МассивПараметров)
	
	ПараметрыЗадания = Новый Структура;
	
	ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.вмс_АнализироватьABC); 
	
	ПараметрыЗадания.Вставить("Параметры", МассивПараметров);
	ПараметрыЗадания.Вставить("Расписание", СоздатьРасписаниеРегламентногоЗаданияABCАнализа());  
	ПараметрыЗадания.Вставить("Наименование", "ABCАнализ");
	ПараметрыЗадания.Вставить("Ключ", "КлючABCАнализ");  
	ПараметрыЗадания.Вставить("Использование", Истина);	
	
	РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	
КонецФункции 

Функция ЗапуститьABCАнализ(ИспользоватьABCАнализ, ГраницаГруппыA, ГраницаГруппыB) Экспорт
	
	РегЗадания = ПолучитьРегЗаданияABCАнализ();
	
	Если ИспользоватьABCАнализ Тогда
		
		ВключитьРегЗаданияABCАнализ(РегЗадания, ГраницаГруппыA, ГраницаГруппыB);		
		
	Иначе
		
		ОтключитьРегЗаданияABCАнализ(РегЗадания);	
		
	КонецЕсли; 	
	
КонецФункции

Функция ОтключитьРегЗаданияABCАнализ(РегЗадания)

	Если РегЗадания.Количество() > 0 Тогда
		
		Для Каждого РегЗадание Из РегЗадания Цикл
			
			РегЗадание.Использование = Ложь;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция ВключитьРегЗаданияABCАнализ(РегЗадания, ГраницаГруппыA, ГраницаГруппыB)
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ГраницаГруппыA);
	МассивПараметров.Добавить(ГраницаГруппыB);
	
	Если РегЗадания.Количество() > 0 Тогда
		
		Для Каждого РегЗадание Из РегЗадания Цикл 
			
			РегЗадание.Параметры = МассивПараметров;
			РегЗадание.Использование = Истина;
			
		КонецЦикла;
		
	Иначе
		
		СоздатьРегламентноеЗаданиеABCАнализа(МассивПараметров);	
		
	КонецЕсли;	
	
КонецФункции