
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Ошибки = 0;
	Ошибки = Ошибки + вмс_СлужебныйВызовСервера.УдалитьЗаписиРегистраБезРегистратора("РегистрНакопления.вмс_ОперацияПоЯчейкам");
	Ошибки = Ошибки + вмс_СлужебныйВызовСервера.УдалитьЗаписиРегистраБезРегистратора("РегистрНакопления.вмс_ОстаткиВКонтейнерах");
	Ошибки = Ошибки + вмс_СлужебныйВызовСервера.УдалитьЗаписиРегистраБезРегистратора("РегистрСведений.вмс_ИсторияИерархииКонтейнеров");
	
	Если Ошибки > 0 Тогда
		ПоказатьПредупреждение(, "Были обнаружены и исправлены ошибки в данных базы");
	Иначе
		ПоказатьПредупреждение(, "Ошибок не обнаружено");
	КонецЕсли;

КонецПроцедуры
