#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ИнициализироватьДанныеОбработки(ПараметрыОбработки) Экспорт
	
	ИнициализироватьПоляОбработки(ПараметрыОбработки);
	ИнициализироватьЭлементыВывода(ПараметрыОбработки);
	ИнициализироватьДанныеПолейОбработки(ПараметрыОбработки);
	ИнициализироватьДанныеТранзакции(ПараметрыОбработки);
	
КонецФункции

Функция ИнициализироватьПоляОбработки(ПараметрыОбработки)
	
	РК = вмс_РаботаСКоллекциями;
	
	ПоляОбработки = НовыеПоляОбработки();
	
	СвойстваПолейОбработкиМассив = РК.ПолучитьКолонкиКоллекции(ПоляОбработки);
	СвойстваПолейОбработки = РК.МассивВСтроку(СвойстваПолейОбработкиМассив);
	
	РК.ВычестьМассив(СвойстваПолейОбработкиМассив, "Имя");
	СвойстваПолейОбработкиБезИмени = РК.МассивВСтроку(СвойстваПолейОбработкиМассив);
	
	ПередатьСвойстваПолейВЭлементВывода = Новый Соответствие;
	ПередатьСвойстваПолейВЭлементВывода["Вывод"] = "Видимость";
	ПередатьСвойстваПолейВЭлементВывода["Страница"] = "Родитель";
	ПередатьСвойстваПолейВЭлементВывода["Синоним"] = "Заголовок";
	ПередатьСвойстваПолейВЭлементВывода["ПоложениеЗаголовка"] = "ПоложениеЗаголовка";
	ПередатьСвойстваПолейВЭлементВывода["СписокВыбора"] = "СписокВыбора";
	ПередатьСвойстваПолейВЭлементВывода["Шрифт"] = "Шрифт";

	ПараметрыОбработки.Вставить("ПоляОбработки", ПоляОбработки);
	ПараметрыОбработки.Вставить("СтраницаПолейОбработкиПоУмолчанию", "ГлавнаяПанельСтраницаВводДанных");
	ПараметрыОбработки.Вставить("СвойстваПолейОбработки", СвойстваПолейОбработки);
	ПараметрыОбработки.Вставить("СвойстваПолейОбработкиБезИмени", СвойстваПолейОбработкиБезИмени);
	ПараметрыОбработки.Вставить("ПорядокВводаНовогоПоляОбработки", 0);

	ПустоеПолеОбработки = Новый Структура;
	ПустоеПолеОбработки.Вставить("Использование", Ложь);
	ПустоеПолеОбработки.Вставить("ПустоеПолеОбработки", Истина);
	ПараметрыОбработки.Вставить("ПустоеПолеОбработки", ПустоеПолеОбработки);

	ПараметрыОбработки.Вставить("ПередатьСвойстваПолейВЭлементВывода", ПередатьСвойстваПолейВЭлементВывода);

	Возврат Истина;
	
КонецФункции

Функция ИнициализироватьЭлементыВывода(ПараметрыОбработки)

	ПараметрыОбработки.Вставить("ЭлементыВывода", НовыеЭлементыВывода());
	ПараметрыОбработки.Вставить("ПустойЭлементВывода", Новый Структура("ПустойЭлементВывода", Истина));
	ПараметрыОбработки.Вставить("ПанельЭлементовВыводаПоУмолчанию", ПараметрыОбработки.СтраницаПолейОбработкиПоУмолчанию);
	
	СтандартныеСвойства = 
	"Использование, Новый, Удалить, Родитель, ТипЭлемента, ТипЗначения, Видимость, Номер, Портал";
	
	РК = вмс_РаботаСКоллекциями;
	ПараметрыОбработки.Вставить("СтандартныеСвойстваЭлементовВывода", РК.ПреобразоватьМассивВСоответствие(РК.СтрокуВМассив(СтандартныеСвойства)));
	
	Возврат Истина;
	
КонецФункции

Функция НовыеЭлементыВывода()

	РК = вмс_РаботаСКоллекциями;

	ЭлементыВывода = РК.НоваяТаблицаЗначений("Имя, ТипЭлемента, ТипЗначения, Новый, Удалить, Уровень, Родитель, Портал, Номер, Использование, Видимость, Обновить, События, Свойства, СвойстваПередать, СвойстваНаКлиенте, СвойстваУстановленныеЯвно");
	ЭлементыВывода.Индексы.Добавить("Имя");
	ЭлементыВывода.Индексы.Добавить("Обновить");
	ЭлементыВывода.Индексы.Добавить("Портал");
	ЭлементыВывода.Индексы.Добавить("Использование");
	
	Возврат ЭлементыВывода;
	
КонецФункции

Функция	ИнициализироватьДанныеТранзакции(ПараметрыОбработки)
	
	ДанныеТранзакции = Новый Структура;
	ДанныеТранзакции.Вставить("Активна", Ложь);
	ДанныеТранзакции.Вставить("Прервать", Ложь);
	ДанныеТранзакции.Вставить("Отменить", Ложь);
	ДанныеТранзакции.Вставить("ПоляОбработки", НовыеПоляОбработки());
	
	ПараметрыОбработки.Вставить("ДанныеТранзакции", ДанныеТранзакции);
	СкопироватьДанныеВТранзакцию(ПараметрыОбработки);
	
КонецФункции

Функция НовыеВходящиеДанные(Данные=Неопределено) Экспорт
	
	ДанныеШтрихкода = Новый Структура;
	ДанныеШтрихкода.Вставить("Штрихкод");
	ДанныеШтрихкода.Вставить("Обработан", Ложь);
	ДанныеШтрихкода.Вставить("Результат");
	ДанныеШтрихкода.Вставить("Количество", 1);
	
	ВходящиеДанные = Новый Структура;
	ВходящиеДанные.Вставить("ЭтоВходящиеДанные", Истина); // для идентификации типа
	ВходящиеДанные.Вставить("НачалоВвода", Истина);
	ВходящиеДанные.Вставить("Обработаны", Ложь);
	ВходящиеДанные.Вставить("НомерДанных", 0);
	ВходящиеДанные.Вставить("МассивДанных", Новый Массив); // для множественного ввода данных (например список товаров)
	ВходящиеДанные.Вставить("ДанныеШтрихкода", ДанныеШтрихкода);
	ВходящиеДанные.Вставить("ВходящиеОбъекты", Новый Массив);
	ВходящиеДанные.Вставить("ДанныеПолей", Новый Структура);
	ВходящиеДанные.Вставить("Описание", "");
	
	ИнициализироватьВходящиеДанные(ВходящиеДанные, Данные);
	
	Возврат ВходящиеДанные;
	
КонецФункции

Функция ИнициализироватьВходящиеДанные(ВходящиеДанные, Данные=Неопределено) Экспорт

	РК = вмс_РаботаСКоллекциями;

	МассивДанных = ВходящиеДанные.МассивДанных;
	МассивДанных.Очистить();
	
	ДанныеШтрихкода = ВходящиеДанные.ДанныеШтрихкода;
	ДанныеШтрихкода.Штрихкод = Неопределено;
	ДанныеШтрихкода.Обработан = Ложь;
	ДанныеШтрихкода.Результат = Неопределено;
	
	ДанныеПолей = ВходящиеДанные.ДанныеПолей;
	ДанныеПолей.Очистить();
	
	ТипДанных = ТипЗнч(Данные);
	
	Если ТипДанных=Тип("Структура") Тогда
		РК.СкопироватьПоляСтруктуры(Данные, ДанныеПолей);
		МассивДанных.Добавить(ДанныеПолей);
	ИначеЕсли ТипДанных=Тип("Строка") Тогда
		ДанныеШтрихкода.Штрихкод = Данные;
		МассивДанных.Добавить(ДанныеШтрихкода.Штрихкод);
	ИначеЕсли ТипДанных=Тип("Массив") ИЛИ ТипДанных=Тип("ТаблицаЗначений") Тогда
		Для Каждого ЭлементДанных Из Данные Цикл
			Если ТипЗнч(ЭлементДанных)=Тип("СтрокаТаблицыЗначений") Тогда
				ЭлементДанныхНовый = РК.СтрокуТаблицыЗначенийВСтруктуру(ЭлементДанных);
			ИначеЕсли ТипЗнч(ЭлементДанных)=Тип("Структура") Тогда
				ЭлементДанныхНовый = РК.СкопироватьСтруктуру(ЭлементДанных);
			Иначе
				ЭлементДанныхНовый = ЭлементДанных;
			КонецЕсли;
			МассивДанных.Добавить(ЭлементДанныхНовый);
		КонецЦикла;
	КонецЕсли;
	
	ВходящиеДанные.Описание = ОписаниеВходящихДанных(ВходящиеДанные);

	Возврат Истина;
	
КонецФункции

Функция ОписаниеВходящихДанных(ВходящиеДанные) Экспорт
	
	РК = вмс_РаботаСКоллекциями;

	Если ЗначениеЗаполнено(ВходящиеДанные.ДанныеШтрихкода.Штрихкод) Тогда
		
		Описание = ВходящиеДанные.ДанныеШтрихкода.Штрихкод;
		
	ИначеЕсли ВходящиеДанные.ВходящиеОбъекты.Количество() > 0 Тогда

		Описание = РК.МассивВСтроку(ВходящиеДанные.ВходящиеОбъекты);
		
	ИначеЕсли ВходящиеДанные.ДанныеПолей.Количество() > 0 Тогда
		
		ИменаПолейМассив = РК.ВыгрузитьЗначенияКолонкиКоллекции(ВходящиеДанные.ДанныеПолей, "Ключ");
		Описание = РК.МассивВСтроку(ИменаПолейМассив);
		
	Иначе
		
		Описание = "";
		
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

Функция ЭтоВходящиеДанные(Объект) Экспорт
	
	Возврат ТипЗнч(Объект)=Тип("Структура") И Объект.Свойство("ЭтоВходящиеДанные") И Объект.ЭтоВходящиеДанные=Истина;
	
КонецФункции

Функция СкопироватьВходящиеДанные(ВходящиеДанные) Экспорт
	
	Возврат вмс_РаботаСКоллекциями.СкопироватьОбъект(ВходящиеДанные, Истина, 3);
	
КонецФункции

/////////////////////////////////////////////////////////////////////////
//
//				Поля обработки+
//

Функция НовыеПоляОбработки() Экспорт
	
	РК = вмс_РаботаСКоллекциями;

	ПоляОбработки = РК.НоваяТаблицаЗначений("
	
		|Имя, ПутьКДаннымСохранения, ПутьКДаннымЗаполнения, ПутьРодителяДанныхЗаполнения, ПутьРодителяДанныхСохранения, Использование,
		|Ввод, Сборка, План, Вывод, ПорядокВвода, ПорядокВывода, ОбязательныйВвод, ОбязательноеЗаполнение, Ресурс, Группа, Суффикс,
		|ТипЗначения, Значение, ЗначениеУстановлено, НачальноеЗначение, ЗначениеПоУмолчанию, ПустыеЗначения, СписокВыбора, АвтоНачалоВыбора,
		
		|ИмяЭлементаВывода, ПоложениеЗаголовка, Страница, События, ТипЭлемента, Синоним, СинонимРодительныйПадеж, СинонимВинительныйПадеж, Пол,
		|Шрифт
		
	|");
	
	ПоляОбработки.Индексы.Добавить("Имя");
	
	Возврат ПоляОбработки;
	
КонецФункции

Функция ИнициализироватьДанныеПолейОбработки(ПараметрыОбработки)
	
	ДанныеОбработки = ПараметрыОбработки.Данные;
	
	ДанныеОбработки.Вставить("ВходящиеДанные", НовыеВходящиеДанные());
	ДанныеОбработки.Вставить("ПринятыеДанныеПолей", Новый Структура); //отфильтрованные и типизированные данные входящих полей для ввода
	ДанныеОбработки.Вставить("ВведенныеДанныеПолей", Новый Структура);
	ДанныеОбработки.Вставить("СтатическиеДанныеПолей", Новый Структура);
	ДанныеОбработки.Вставить("ЗапланированныеДанныеПолей", Новый Структура);
	ДанныеОбработки.Вставить("СобранныеДанныеПолей", Новый Структура);
	ДанныеОбработки.Вставить("ОбщиеДанныеПолей", Новый Структура);
	ДанныеОбработки.Вставить("ПредыдущиеВведенныеДанныеПолей", Новый Структура); //для отслеживания изменений во введенных данных
	ДанныеОбработки.Вставить("ПредставлениеДанныхПолей", Новый Структура);
	ДанныеОбработки.Вставить("РезультатАнализаЗаполненияПолейДанныхВвода", Обработки.вмс_СерверУправляемыйМодульСборщикДанных.НовыйРезультатАнализаЗаполненияПолейДанных());
	ДанныеОбработки.Вставить("РезультатАнализаЗаполненияПолейДанныхПлана", Обработки.вмс_СерверУправляемыйМодульСборщикДанных.НовыйРезультатАнализаЗаполненияПолейДанных());
	ДанныеОбработки.Вставить("РезультатАнализаЗаполненияПолейОбщихДанных", Обработки.вмс_СерверУправляемыйМодульСборщикДанных.НовыйРезультатАнализаЗаполненияПолейДанных());
	ДанныеОбработки.Вставить("РезультатАнализаЗаполненияПолейДанныхСборки", Обработки.вмс_СерверУправляемыйМодульСборщикДанных.НовыйРезультатАнализаЗаполненияПолейДанных());
	
	Возврат Истина;

КонецФункции

//возвращает всю таблицу полей или массив полей по отбору
Функция ПоляОбработки(ПараметрыОбработки, знач Отбор=Неопределено) Экспорт

	РК = вмс_РаботаСКоллекциями;
	
	Если ПараметрыОбработки.ДанныеТранзакции.Активна Тогда
		ПоляОбработки = ПараметрыОбработки.ДанныеТранзакции.ПоляОбработки;
	Иначе
		ПоляОбработки = ПараметрыОбработки.ПоляОбработки;
	КонецЕсли;
	
	ТипОтбора = ТипЗнч(Отбор);
	
	ПустоеПолеОбработки = ПараметрыОбработки.ПустоеПолеОбработки;
	
	Если Отбор=ПустоеПолеОбработки Тогда
		
		Отбор = Новый Массив;
		
	ИначеЕсли Отбор=Неопределено ИЛИ Отбор=ПоляОбработки Тогда
		
		//вернуть всю таблицу полей
		Возврат ПоляОбработки;
		
	ИначеЕсли ТипОтбора=Тип("Структура") Тогда
		
		Если Отбор.Свойство("Имя") Тогда
			ВыбранныеПоля = Новый Массив;
			ИменаПолей = РК.ЗначениеВМассив(Отбор.Имя, , Ложь);
			//обработка имен нескольких полей
			Отбор = РК.СкопироватьСтруктуру(Отбор);
			Для Каждого ИмяПоля Из ИменаПолей Цикл
				Отбор.Имя = ИмяПоля;
				Для Каждого Поле Из ПоляОбработки.НайтиСтроки(Отбор) Цикл
					ВыбранныеПоля.Добавить(Поле);
				КонецЦикла;
			КонецЦикла;
			
		Иначе
			//обычный поиск
			ВыбранныеПоля = ПоляОбработки.НайтиСтроки(Отбор);
		КонецЕсли;
		
		Возврат ВыбранныеПоля;
		
	ИначеЕсли ТипОтбора=Тип("Строка") Тогда
		
		Отбор = РК.СтрокуВМассив(Отбор);
		
	ИначеЕсли ТипОтбора <> Тип("Массив") Тогда
		
		ЭлементОтбора = Отбор;
		Отбор = Новый Массив;
		Отбор.Добавить(ЭлементОтбора);
		
	КонецЕсли;
	
	ВыбранныеПоля = Новый Массив;
	ОтборПоИмени = Новый Структура("Имя");
	Для Каждого Элемент Из Отбор Цикл
		
		Если Элемент=ПустоеПолеОбработки Тогда
			Продолжить;
		КонецЕсли;
		
		ТипЭлемента = ТипЗнч(Элемент);
		Если ТипЭлемента=Тип("Строка") Тогда
			ОтборПоИмени.Имя = Элемент;
			Для Каждого Поле Из ПоляОбработки.НайтиСтроки(ОтборПоИмени) Цикл
				ВыбранныеПоля.Добавить(Поле);
			КонецЦикла;
		ИначеЕсли ТипЭлемента=Тип("СтрокаТаблицыЗначений") Тогда
			Если ПоляОбработки.Индекс(Элемент) > -1 Тогда
				ВыбранныеПоля.Добавить(Элемент);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВыбранныеПоля;
	
КонецФункции

Функция ПолеОбработки(ПараметрыОбработки, Отбор) Экспорт
	
	Поля = ПоляОбработки(ПараметрыОбработки, Отбор);
	
	Если Поля.Количество()=1 Тогда
		Возврат Поля[0];
	КонецЕсли;
	
	Возврат ПараметрыОбработки.ПустоеПолеОбработки;
	
КонецФункции

Функция ПолучитьПолеОбработки(ПараметрыОбработки, Отбор) Экспорт
	
	Поля = ПолучитьПоляОбработки(ПараметрыОбработки, Отбор);
	
	Если Поля.Количество() > 0 Тогда
		Возврат Поля[0];
	КонецЕсли;
	
КонецФункции

//возвращает поля с указанными именами, если поля нет, то создает новое
Функция ПолучитьПоляОбработки(ПараметрыОбработки, знач Поля=Неопределено) Экспорт

	РК = вмс_РаботаСКоллекциями;

	ПоляОбработки = ПоляОбработки(ПараметрыОбработки);
	
	Если Поля=Неопределено ИЛИ Поля=ПоляОбработки Тогда
		Возврат ПоляОбработки;
	КонецЕсли;
	
	Если ТипЗнч(Поля)=Тип("Массив") Тогда
		ПоляМассив = Поля;
	ИначеЕсли ТипЗнч(Поля)=Тип("Строка") Тогда
		ПоляМассив = СтрРазделить(СтрЗаменить(Поля, " ", ""), ",", Ложь);
	Иначе
		ПоляМассив = Новый Массив;
		ПоляМассив.Добавить(Поля);
	КонецЕсли;

	Поля = Новый Массив;
	Отбор = Новый Структура("Имя");
	ПустоеПолеОбработки = ПараметрыОбработки.ПустоеПолеОбработки;
	Для Каждого Поле Из ПоляМассив Цикл
		
		Если Поле=ПустоеПолеОбработки Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Поле)=Тип("Строка") Тогда

			ИмяПоля = Поле;
			Отбор.Имя = ИмяПоля;
			ПолеМассив = ПоляОбработки.НайтиСтроки(Отбор);
			Если ПолеМассив.Количество()=0 Тогда
				Поле = НовоеПолеОбработки(ПараметрыОбработки, ИмяПоля);
			Иначе
				Поле = ПолеМассив[0];
			КонецЕсли;

			Поля.Добавить(Поле);
			
		ИначеЕсли ТипЗнч(Поле)=Тип("СтрокаТаблицыЗначений") Тогда
			
			Если ПоляОбработки.Индекс(Поле) > -1 Тогда
				Поля.Добавить(Поле);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Поля;

КонецФункции

Функция НовоеПолеОбработки(ПараметрыОбработки, Имя)

	ПорядокВвода = ПараметрыОбработки.ПорядокВводаНовогоПоляОбработки;
	ПараметрыОбработки.ПорядокВводаНовогоПоляОбработки = ПорядокВвода + 1;

	Поле = ПараметрыОбработки.ПоляОбработки.Добавить();
	Поле.Имя = Имя;
	Поле.Страница = "ГлавнаяПанельСтраницаВводДанных";
	Поле.ПутьКДаннымСохранения = "";
	Поле.ПутьКДаннымЗаполнения = "";
	Поле.ИмяЭлементаВывода = Имя;
	Поле.Использование = Ложь;
	Поле.Ввод = Ложь;
	Поле.Сборка = Ложь;
	Поле.План = Ложь;
	Поле.Вывод = Истина;
	Поле.Ресурс = Ложь;
	Поле.ОбязательныйВвод = Ложь;
	Поле.ОбязательноеЗаполнение = Истина;
	Поле.ПустыеЗначения = Новый Массив;
	Поле.ПустыеЗначения.Добавить(Неопределено);
	Поле.ЗначениеУстановлено = Ложь;
	Поле.События = Новый Структура;
	Поле.ПорядокВвода = ПорядокВвода;
	Поле.ПорядокВывода = ПорядокВвода;
	Поле.АвтоНачалоВыбора = Ложь;
	Поле.ТипЗначения = Новый ОписаниеТипов("Строка");
	Поле.Шрифт = Новый Шрифт;
	
	Возврат Поле;
	
КонецФункции

Функция УстановитьСвойстваПолейОбработки(ПараметрыОбработки, Поля=Неопределено, знач Свойства=Неопределено, Значение=Неопределено) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	Если ТипЗнч(Свойства)=Тип("Строка") Тогда
		Свойства = Новый Структура(Свойства);
		Для Каждого ЭлементСвойства Из Свойства Цикл
			Свойства.Вставить(ЭлементСвойства.Ключ, Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(Свойства)=Тип("СтрокаТаблицыЗначений") Тогда
		// передали элемент поля
		ПолеИсточник = Свойства;
		Свойства = Новый Структура(ПараметрыОбработки.СвойстваПолейОбработкиБезИмени);
		ЗаполнитьЗначенияСвойств(Свойства, ПолеИсточник);
	КонецЕсли;
	
	Если ТипЗнч(Свойства) <> Тип("Структура") Тогда
		Свойства = Новый Структура;
	КонецЕсли;
	
	Если Свойства.Свойство("Имя") Тогда
		ВызватьИсключение "Свойство поля обработки ""Имя"" недоступно для изменения";
	КонецЕсли;
	
	Если НЕ Свойства.Свойство("Использование") Тогда
		Свойства.Вставить("Использование", Истина);
	КонецЕсли;
	
	ДанныеТранзакции = ПараметрыОбработки.ДанныеТранзакции;
	Если ДанныеТранзакции.Активна Тогда
		ДанныеОбработки = ДанныеТранзакции;
	Иначе
		ДанныеОбработки = ПараметрыОбработки.Данные;
	КонецЕсли;
	
	ЗначениеСвойства = Неопределено;
	Для Каждого Поле Из ПолучитьПоляОбработки(ПараметрыОбработки, Поля) Цикл
		
		ИзмененныеСвойства = Новый Структура;
		Для Каждого ЭлементСвойства Из Свойства Цикл
			
			ИмяСвойства = ЭлементСвойства.Ключ;
			ТекущееЗначение = Поле[ИмяСвойства];
			ТипЗначения = ТипЗнч(ТекущееЗначение);
			НовоеЗначение = ЭлементСвойства.Значение;
			Если ТипЗначения=Тип("Структура") Тогда
				РК.УстановитьЭлементыКоллекции(ТекущееЗначение, НовоеЗначение);
			ИначеЕсли ТипЗначения=Тип("Массив") Тогда
				РК.УстановитьЭлементыКоллекции(ТекущееЗначение, РК.ЗначениеВМассив(НовоеЗначение));
			ИначеЕсли ТекущееЗначение <> НовоеЗначение Тогда
				Поле[ИмяСвойства] = НовоеЗначение;
				ИзмененныеСвойства.Вставить(ИмяСвойства, НовоеЗначение);
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ Свойства.Свойство("ЗначениеУстановлено") ИЛИ Свойства.ЗначениеУстановлено Тогда
			Если ИзмененныеСвойства.Свойство("Значение", ЗначениеСвойства) ИЛИ Свойства.Свойство("Значение", ЗначениеСвойства) И НЕ Поле.ЗначениеУстановлено Тогда
				Поле.ЗначениеУстановлено = Истина;
				ДанныеОбработки.СтатическиеДанныеПолей.Вставить(Поле.Имя, ЗначениеСвойства);
			ИначеЕсли Свойства.Свойство("ЗначениеУстановлено") Тогда
				ДанныеОбработки.СтатическиеДанныеПолей.Вставить(Поле.Имя, Поле.Значение);
			КонецЕсли;
		Иначе
			ДанныеОбработки.СтатическиеДанныеПолей.Удалить(Поле.Имя);
		КонецЕсли;
		
		Если ИзмененныеСвойства.Свойство("ПутьКДаннымЗаполнения") Тогда
			Поле.ПутьРодителяДанныхЗаполнения = ПрочитатьПутьРодителяДанныхПоля(ПараметрыОбработки, Поле, "ПутьКДаннымЗаполнения");
		КонецЕсли;

		Если ИзмененныеСвойства.Свойство("ПутьКДаннымСохранения") Тогда
			Поле.ПутьРодителяДанныхСохранения = ПрочитатьПутьРодителяДанныхПоля(ПараметрыОбработки, Поле, "ПутьКДаннымСохранения");
		КонецЕсли;
		
		Если ИзмененныеСвойства.Свойство("ПорядокВвода", ЗначениеСвойства) Тогда
			Если ЗначениеСвойства >= ПараметрыОбработки.ПорядокВводаНовогоПоляОбработки Тогда
				ПараметрыОбработки.ПорядокВводаНовогоПоляОбработки = ЗначениеСвойства + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если ИзмененныеСвойства.Свойство("ТипЗначения", ЗначениеСвойства) Тогда
			
			Если ТипЗнч(ЗначениеСвойства) <> Тип("ОписаниеТипов") Тогда
				Если ТипЗнч(ЗначениеСвойства)=Тип("Строка") Тогда
					ЗначениеСвойства = Тип(ЗначениеСвойства);
				КонецЕсли;
				
				Если ТипЗнч(ЗначениеСвойства)=Тип("Тип") Тогда
					Тип = ЗначениеСвойства;
					ЗначениеСвойства = Новый Массив;
					ЗначениеСвойства.Добавить(Тип);
				КонецЕсли;
				
				Если ТипЗнч(ЗначениеСвойства)=Тип("Массив") Тогда
					ЗначениеСвойства = Новый ОписаниеТипов(ЗначениеСвойства);
				КонецЕсли;
				
				ИзмененныеСвойства.ТипЗначения = ЗначениеСвойства;
					
				Поле.ТипЗначения = ЗначениеСвойства;
			КонецЕсли;
			
		КонецЕсли;
			
		Если ИзмененныеСвойства.Свойство("Использование", ЗначениеСвойства) Тогда
			
			Если ЗначениеСвойства Тогда
				
				Если Поле.Ввод Тогда
					ДанныеОбработки.ВведенныеДанныеПолей.Вставить(Поле.Имя, Поле.НачальноеЗначение);
				КонецЕсли;
				
				Если Поле.ЗначениеУстановлено Тогда
					ДанныеОбработки.СтатическиеДанныеПолей.Вставить(Поле.Имя, Поле.Значение);
				КонецЕсли;

				Если Поле.План Тогда
					ДанныеОбработки.ЗапланированныеДанныеПолей.Вставить(Поле.Имя, Поле.НачальноеЗначение);
				КонецЕсли;

				Если Поле.Сборка Тогда
					ДанныеОбработки.СобранныеДанныеПолей.Вставить(Поле.Имя, Поле.НачальноеЗначение);
				КонецЕсли;

				ДанныеОбработки.ОбщиеДанныеПолей.Вставить(Поле.Имя, Поле.НачальноеЗначение);

				Если Поле.Вывод Тогда
					ДанныеОбработки.ПредставлениеДанныхПолей.Вставить(Поле.Имя, "");
				КонецЕсли;
				
				Если НЕ ИзмененныеСвойства.Свойство("ТипЗначения") Тогда
					АвтоопределениеТипаЗначенияПоляОбработки(Поле, ИзмененныеСвойства);
				КонецЕсли;
				
			Иначе
				ДанныеОбработки.ВведенныеДанныеПолей.Удалить(Поле.Имя);
				ДанныеОбработки.СтатическиеДанныеПолей.Удалить(Поле.Имя);
				ДанныеОбработки.ЗапланированныеДанныеПолей.Удалить(Поле.Имя);
				ДанныеОбработки.СобранныеДанныеПолей.Удалить(Поле.Имя);
				ДанныеОбработки.ОбщиеДанныеПолей.Удалить(Поле.Имя);
				ДанныеОбработки.ПредставлениеДанныхПолей.Удалить(Поле.Имя);
			КонецЕсли;
			
		ИначеЕсли Поле.Использование Тогда
			
			Если ИзмененныеСвойства.Свойство("Ввод", ЗначениеСвойства) Тогда
				Если ЗначениеСвойства Тогда
					ДанныеОбработки.ВведенныеДанныеПолей.Вставить(Поле.Имя, Поле.НачальноеЗначение);
				Иначе
					// может быть динамический ввод
					//ДанныеОбработки.ВведенныеДанныеПолей.Удалить(Поле.Имя);
				КонецЕсли;
			КонецЕсли;
			
			Если ИзмененныеСвойства.Свойство("План", ЗначениеСвойства) Тогда
				Если ЗначениеСвойства Тогда
					ДанныеОбработки.ЗапланированныеДанныеПолей.Вставить(Поле.Имя, Поле.НачальноеЗначение);
				Иначе
					//ДанныеОбработки.ЗапланированныеДанныеПолей.Удалить(Поле.Имя);
				КонецЕсли;
			КонецЕсли;
			
			Если ИзмененныеСвойства.Свойство("Сборка", ЗначениеСвойства) Тогда
				Если ЗначениеСвойства Тогда
					ДанныеОбработки.СобранныеДанныеПолей.Вставить(Поле.Имя, Поле.НачальноеЗначение);
				Иначе
					//ДанныеОбработки.СобранныеДанныеПолей.Удалить(Поле.Имя);
				КонецЕсли;
			КонецЕсли;
			
			Если ИзмененныеСвойства.Свойство("Вывод", ЗначениеСвойства) Тогда
				Если ЗначениеСвойства Тогда
					ДанныеОбработки.ПредставлениеДанныхПолей.Вставить(Поле.Имя, "");
				Иначе
					//ДанныеОбработки.ПредставлениеДанныхПолей.Удалить(Поле.Имя);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		ПередатьСвойстваПоляОбработкиВЭлементФормы(ПараметрыОбработки, Поле, ИзмененныеСвойства);
		
	КонецЦикла;
	
КонецФункции

Функция АвтоопределениеТипаЗначенияПоляОбработки(Поле, ИзмененныеСвойства)
	
	// определим по типам списка выбора
	СписокВыбора = Поле.СписокВыбора;
	Если ТипЗнч(СписокВыбора)=Тип("СписокЗначений") И ЗначениеЗаполнено(СписокВыбора) Тогда
		Типы = Новый Массив;
		Для Каждого ЭлементСписка Из СписокВыбора Цикл
			Типы.Добавить(ТипЗнч(ЭлементСписка.Значение));
		КонецЦикла;
		
		ИзмененныеСвойства.Вставить("ТипЗначения", Новый ОписаниеТипов(Типы));
		Поле.ТипЗначения = ИзмененныеСвойства.ТипЗначения;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
		
КонецФункции

Функция ПередатьСвойстваПоляОбработкиВЭлементФормы(ПараметрыОбработки, Поле, ИзмененныеСвойства)
	
	ПередатьСвойстваПолейВЭлементВывода = ПараметрыОбработки.ПередатьСвойстваПолейВЭлементВывода;
	
	СвойстваЭлементаВывода = Новый Структура;

	Если ИзмененныеСвойства.Свойство("Использование") И ИзмененныеСвойства.Использование Тогда
		
		// при включении поля транслируем все свойства в элемент вывода
		Для Каждого ТранслироватьСвойство Из ПередатьСвойстваПолейВЭлементВывода Цикл
			СвойстваЭлементаВывода.Вставить(ТранслироватьСвойство.Значение, Поле[ТранслироватьСвойство.Ключ]);
		КонецЦикла;
		
		Если СвойстваЭлементаВывода.Свойство("СписокВыбора") И СвойстваЭлементаВывода.СписокВыбора=Неопределено Тогда
			СвойстваЭлементаВывода.Удалить("СписокВыбора");
		КонецЕсли;

		Если СвойстваЭлементаВывода.Свойство("ПоложениеЗаголовка") И СвойстваЭлементаВывода.ПоложениеЗаголовка=Неопределено Тогда
			СвойстваЭлементаВывода.Удалить("ПоложениеЗаголовка");
		КонецЕсли;
		
	Иначе
		
		Для Каждого ИзмененноеСвойство Из ИзмененныеСвойства Цикл
			ИмяСвойства = ИзмененноеСвойство.Ключ;
			НовоеЗначение = ИзмененноеСвойство.Значение;
			ИмяСвойстваЭлементаВывода = ПередатьСвойстваПолейВЭлементВывода[ИмяСвойства];
			Если ИмяСвойстваЭлементаВывода <> Неопределено Тогда
				СвойстваЭлементаВывода.Вставить(ИмяСвойстваЭлементаВывода, НовоеЗначение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если СвойстваЭлементаВывода.Количество() > 0 Тогда
		УстановитьСвойстваЭлементовВывода(ПараметрыОбработки, Поле.ИмяЭлементаВывода, СвойстваЭлементаВывода, , Ложь);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКоличествоЭлементовВыводаРодителя(ПараметрыОбработки, Родитель)

	Возврат ПараметрыОбработки.ЭлементыВывода.НайтиСтроки(Новый Структура("Родитель", Родитель)).Количество();

КонецФункции

Функция УдалитьПоляОбработки(ПараметрыОбработки, Поля=Неопределено) Экспорт
	
	Возврат вмс_РаботаСКоллекциями.УдалитьЭлементыКоллекции(ПоляОбработки(ПараметрыОбработки), ПоляОбработки(ПараметрыОбработки, Поля));
	
КонецФункции

Функция ПодготовитьДанныеПолейОбработки(ПараметрыОбработки) Экспорт
	
	ДанныеОбработки = ПараметрыОбработки.Данные;
	
	ДанныеОбработки.ВведенныеДанныеПолей.Очистить();
	ДанныеОбработки.ЗапланированныеДанныеПолей.Очистить();
	ДанныеОбработки.СобранныеДанныеПолей.Очистить();
	ДанныеОбработки.ОбщиеДанныеПолей.Очистить();
	ДанныеОбработки.ПредставлениеДанныхПолей.Очистить();
	
	Для Каждого Поле Из ПоляОбработки(ПараметрыОбработки) Цикл
		
		ИмяПоля = Поле.Имя;
		
		Если Поле.Ввод Тогда
			ДанныеОбработки.ВведенныеДанныеПолей.Вставить(ИмяПоля);
		КонецЕсли;
		
		Если Поле.План Тогда
			ДанныеОбработки.ЗапланированныеДанныеПолей.Вставить(ИмяПоля);
		КонецЕсли;

		ДанныеОбработки.ОбщиеДанныеПолей.Вставить(ИмяПоля);

		Если Поле.Сборка Тогда
			ДанныеОбработки.СобранныеДанныеПолей.Вставить(ИмяПоля);
		КонецЕсли;
		
		Если Поле.Вывод Тогда
			ДанныеОбработки.ПредставлениеДанныхПолей.Вставить(ИмяПоля);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция УстановитьЗначениеДанныхПоляОбработки(ПараметрыОбработки, Поле, Значение) Экспорт
	
	Возврат УстановитьСвойстваПолейОбработки(ПараметрыОбработки, Поле, "Значение", Значение);
	
КонецФункции

Функция ПолучитьЗначениеДанныхПоляОбработки(ПараметрыОбработки, ИмяПоля) Экспорт
	
	Возврат ПолучитьЗначениеСвойстваПоляОбработки(ПараметрыОбработки, ИмяПоля, "Значение");
	
КонецФункции

Функция ОчиститьЗначениеДанныхПоляОбработки(ПараметрыОбработки, ИмяПоля, Значение) Экспорт
	
	ПараметрыОбработки.Данные.СтатическиеДанныеПолей.Удалить(ИмяПоля);
	
КонецФункции

Функция ПолучитьЗначениеСвойстваПоляОбработки(ПараметрыОбработки, знач Поле, ИмяСвойства) Экспорт
	
	Поле = ПолеОбработки(ПараметрыОбработки, Поле);
	
	Если Поле <> ПараметрыОбработки.ПустоеПолеОбработки Тогда
		
		Возврат Поле[ИмяСвойства];
		
	КонецЕсли;
	
КонецФункции

Функция УстановитьПоляВводаОбработки(ПараметрыОбработки, Поля) Экспорт
	
	ПорядокВвода = 1;
	
	Для Каждого Поле Из ПолучитьПоляОбработки(ПараметрыОбработки, Поля) Цикл
		
		УстановитьСвойстваПолейОбработки(ПараметрыОбработки, Поле, Новый Структура("Ввод, Сборка, ОбязательныйВвод, Использование, ПорядокВывода", Истина, Истина, Истина, Истина, ПорядокВвода));
		
		ПорядокВвода = ПорядокВвода + 1;
		
	КонецЦикла;
	
КонецФункции

Функция УстановитьПоляВыводаОбработки(ПараметрыОбработки, Поля) Экспорт
	
	ПоляВывода = ПолучитьПоляОбработки(ПараметрыОбработки, Поля);
	
	Для Каждого Поле Из ПоляОбработки(ПараметрыОбработки) Цикл
		
		ПорядокВывода = ПоляВывода.Найти(Поле);
		
		Если ПорядокВывода=Неопределено Тогда
			УстановитьСвойстваПолейОбработки(ПараметрыОбработки, Поле, Новый Структура("Вывод", Ложь));
		Иначе
			УстановитьСвойстваПолейОбработки(ПараметрыОбработки, Поле, Новый Структура("Вывод, Использование, ПорядокВывода", Истина, Истина, ПорядокВывода));
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция СписокПолейВвода(ПараметрыОбработки) Экспорт
	
	Список = Новый Массив;
	Для Каждого Поле Из ПоляВвода(ПараметрыОбработки) Цикл
		Список.Добавить(Поле.Имя);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

Функция ПоляВвода(ПараметрыОбработки) Экспорт
	
	ПоляОбработки = ПоляОбработки(ПараметрыОбработки);
	ПоляОбработки.Сортировать("ПорядокВвода");
	ПоляВвода = ПоляОбработки.НайтиСтроки(Новый Структура("Ввод", Истина));
	
	Возврат ПоляВвода;
	
КонецФункции

Функция СписокПолейВывода(ПараметрыОбработки) Экспорт
	
	Список = Новый Массив;
	Для Каждого Поле Из ПоляВывода(ПараметрыОбработки) Цикл
		Список.Добавить(Поле.Имя);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

Функция ПоляВывода(ПараметрыОбработки) Экспорт
	
	ПоляОбработки = ПолучитьПоляОбработки(ПараметрыОбработки);
	ПоляОбработки.Сортировать("ПорядокВывода");
	ПоляВывода = ПоляОбработки.НайтиСтроки(Новый Структура("Вывод", Истина));
	
	Возврат ПоляВывода;
	
КонецФункции

Функция СписокПолейОбработки(ПараметрыОбработки, Отбор=Неопределено) Экспорт
	
	Список = Новый Массив;
	Для Каждого Поле Из ПоляОбработки(ПараметрыОбработки, Отбор) Цикл
		Список.Добавить(Поле.Имя);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

Функция ТаблицаПолейОбработки(ПараметрыОбработки, Отбор=Неопределено) Экспорт
	
	ВыбранныеПоля = ПоляОбработки(ПараметрыОбработки, Отбор);
	
	Если ТипЗнч(ВыбранныеПоля)=Тип("ТаблицаЗначений") Тогда
		
		ТаблицаВыбранныхПолей = ВыбранныеПоля.Скопировать();
		
	Иначе
		
		ТаблицаПолей = ПоляОбработки(ПараметрыОбработки);
		ТаблицаВыбранныхПолей = ТаблицаПолей.Скопировать(ВыбранныеПоля);
		
	КонецЕсли;
	
	Возврат ТаблицаВыбранныхПолей;
	
КонецФункции

Функция ПрочитатьПутьРодителяДанныхПоля(ПараметрыОбработки, Поле, ПолеПути)
	
	Пути = Поле[ПолеПути];
	
	ПозицияЗапятой = СтрНайти(Пути, ",");
	Если ПозицияЗапятой <> 0 Тогда
		Путь = Лев(Пути, ПозицияЗапятой-1);
	Иначе
		Путь = Пути;
	КонецЕсли;
	
	Символ = Лев(Путь, 1);
	Если Символ="!" ИЛИ Символ="@" Тогда
		Путь = Прав(Путь, СтрДлина(Путь)-1);
	КонецЕсли;
	
	ПозицияТочки = СтрНайти(Путь, ".", НаправлениеПоиска.СКонца);
	Если ПозицияТочки <> 0 Тогда
		ПутьРодителя = Лев(Путь, ПозицияТочки-1);
	Иначе
		ПутьРодителя = "";
	КонецЕсли;
	
	Возврат ПутьРодителя;
	
КонецФункции

Функция ПрочитатьПутиКДаннымПолей(ПараметрыОбработки, ПолеПути, знач Поля=Неопределено) Экспорт

	РК = вмс_РаботаСКоллекциями;
	ТаблицаПутейКДаннымПолей = РК.НоваяТаблицаЗначений("ИмяПоля, Поле, Раунд, ПутьКДанным, ПутьКДаннымМассив, ПутьРеквизита, ИмяРеквизита, Поиск");

	СпецСимволыПути = Новый Соответствие;
	СпецСимволыПути["!"] = Истина;
	СпецСимволыПути["@"] = Истина;
	Для Каждого Поле Из ПоляОбработки(ПараметрыОбработки, Поля) Цикл
		ПутиКДанным = СтрРазделить(Поле[ПолеПути], ",", Ложь);

		Раунд = 1;
		Для Каждого ПутьКДанным Из ПутиКДанным Цикл
			ПутьКДанным = СтрЗаменить(ПутьКДанным, " ", "");
			Поиск = НЕ Поле.Ресурс;
			Пока Истина Цикл
				Символ = Лев(ПутьКДанным, 1);
				Если СпецСимволыПути[Символ] <> Истина Тогда
					Прервать;
				КонецЕсли;
				ПутьКДанным = Прав(ПутьКДанным, СтрДлина(ПутьКДанным)-1);
				
				Если Символ="!" Тогда
					//поле должно быть заполнено до начала раунда, в противном случае данные в таблице не будут искаться
					//и ни одно поле в той же таблице не будет заполнено
				ИначеЕсли Символ="@" Тогда
					//не искать по этому полю, только заполнять данными, найденными по другим полям поиска
					Поиск = Ложь;
				КонецЕсли;
			КонецЦикла;
			
			ПутьКДаннымМассив = СтрРазделить(ПутьКДанным, ".", Ложь);
			Если ПутьКДаннымМассив.Количество() > 1 Тогда
				ИмяРеквизита = ПутьКДаннымМассив[ПутьКДаннымМассив.ВГраница()];
				ПутьРеквизита = Лев(ПутьКДанным, СтрДлина(ПутьКДанным)-СтрДлина(ИмяРеквизита)-1);
			Иначе
				ИмяРеквизита = ПутьКДанным;
				ПутьРеквизита = "";
			КонецЕсли;
			
			ЭлементПутьКДанным = ТаблицаПутейКДаннымПолей.Добавить();
			ЭлементПутьКДанным.ИмяПоля = Поле.Имя;
			ЭлементПутьКДанным.Поле = Поле;
			ЭлементПутьКДанным.Раунд = Раунд;
			ЭлементПутьКДанным.ПутьКДанным = ПутьКДанным;
			ЭлементПутьКДанным.ПутьКДаннымМассив = ПутьКДаннымМассив;
			ЭлементПутьКДанным.ПутьРеквизита = ПутьРеквизита;
			ЭлементПутьКДанным.ИмяРеквизита = ИмяРеквизита;
			ЭлементПутьКДанным.Поиск = Поиск;
			Раунд = Раунд + 1;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаПутейКДаннымПолей;
	
КонецФункции

Функция ЗаписатьПутиКДаннымПолей(ПараметрыОбработки, ПолеПути, ТаблицаПутейКДаннымПолей) Экспорт
	
	ТаблицаПолей = ТаблицаПутейКДаннымПолей.Скопировать();
	ТаблицаПолей.Свернуть("ИмяПоля");
	ИменаПолей = ТаблицаПолей.ВыгрузитьКолонку("ИмяПоля");
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		ТаблицаПутейКДаннымПоля = ТаблицаПутейКДаннымПолей.Скопировать(Новый Структура("ИмяПоля", ИмяПоля));
		Если ТаблицаПутейКДаннымПоля.Количество()=0 Тогда
			ПутьКДанным = "";
		Иначе
			ТаблицаПутейКДаннымПоля.Сортировать("Раунд");
			КоличествоРаундов = ТаблицаПутейКДаннымПоля[ТаблицаПутейКДаннымПоля.Количество()-1].Раунд;
		
			ПутиРаундовКДанным = Новый Массив;
			Для Раунд=1 По КоличествоРаундов Цикл
				ЭлементПутьРаундаКДаннымМассив = ТаблицаПутейКДаннымПоля.НайтиСтроки(Новый Структура("Раунд", Раунд));
				Если ЭлементПутьРаундаКДаннымМассив.Количество()=0 Тогда
					ПутьРаундаКДанным = "";
				Иначе
					ЭлементПутьРаундаКДанным = ЭлементПутьРаундаКДаннымМассив[0];
					ПутьРаундаКДанным = ЭлементПутьРаундаКДанным.ПутьКДанным;
					Если НЕ ЭлементПутьРаундаКДанным.Поиск Тогда
						ПутьРаундаКДанным = "@" + ПутьРаундаКДанным;
					КонецЕсли;
				КонецЕсли;
				ПутиРаундовКДанным.Добавить(ПутьРаундаКДанным);
			КонецЦикла;
		
			ПутьКДанным = вмс_РаботаСКоллекциями.МассивВСтроку(ПутиРаундовКДанным);
		КонецЕсли;
		
		УстановитьСвойстваПолейОбработки(ПараметрыОбработки, ИмяПоля, ПолеПути, ПутьКДанным);
	КонецЦикла;
	
КонецФункции

Функция ПолучитьТаблицыВычисленийЗначенийПолей(ПараметрыОбработки) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаВычисленийЗначенийПолей = РК.НоваяТаблицаЗначений("Раунд, Путь, Имя, ПолноеИмя, Значение, ЗначениеРассчитано");
	ТаблицаВычисляемыхПолей = ПрочитатьПутиКДаннымПолей(ПараметрыОбработки, "ПутьКДаннымЗаполнения");
	ТаблицаВычисляемыхПолей.Колонки.Добавить("План");
	
	Для Каждого ЭлементПоля Из ТаблицаВычисляемыхПолей Цикл
		
		ЭлементПоля.План = ЭлементПоля.Поле.План;
		
		Раунд = ЭлементПоля.Раунд;
			
		Путь = "";
		Для Каждого Имя Из ЭлементПоля.ПутьКДаннымМассив Цикл
			
			Если Путь <> "" Тогда
				ПолноеИмя = Путь + "." + Имя;
			Иначе
				ПолноеИмя = Имя;
			КонецЕсли;
			
			Если ТаблицаВычисленийЗначенийПолей.НайтиСтроки(Новый Структура("ПолноеИмя, Раунд", ПолноеИмя, Раунд)).Количество()=0 Тогда
				ЭлементВычислений = ТаблицаВычисленийЗначенийПолей.Добавить();
				ЭлементВычислений.Раунд = Раунд;
				ЭлементВычислений.Путь = Путь;
				ЭлементВычислений.Имя = Имя;
				ЭлементВычислений.ПолноеИмя = ПолноеИмя;
				ЭлементВычислений.ЗначениеРассчитано = Ложь;
			КонецЕсли;

			Путь = ПолноеИмя;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаВычисленийЗначенийПолей.Сортировать("Раунд, ПолноеИмя");
	
	Результат = Новый Структура("ТаблицаВычисленийЗначенийПолей, ТаблицаВычисляемыхПолей", ТаблицаВычисленийЗначенийПолей, ТаблицаВычисляемыхПолей);
	Возврат Результат;
	
КонецФункции

Функция ОчиститьДанныеПолей(ПараметрыОбработки, знач Поля=Неопределено, знач ИмяДанных=Неопределено) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	Данные = ?(ПараметрыОбработки.ДанныеТранзакции.Активна, ПараметрыОбработки.ДанныеТранзакции, ПараметрыОбработки.Данные);
	
	//	
	Если ИмяДанных=Неопределено Тогда
		ИмяДанных = "ВведенныеДанныеПолей, ЗапланированныеДанныеПолей, СобранныеДанныеПолей, ОбщиеДанныеПолей";
	КонецЕсли;

	ИмяДанныхМассив = РК.ЗначениеВМассив(ИмяДанных, , Ложь);
	Если ИмяДанныхМассив.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//	
	Поля = ПоляОбработки(ПараметрыОбработки, Поля);
	Если Поля.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//	
	Для Каждого ИмяДанных Из ИмяДанныхМассив Цикл
		ДанныеПолей = Данные[ИмяДанных];
		Для Каждого Поле Из Поля Цикл
			Если ДанныеПолей.Свойство(Поле.Имя) Тогда
				ДанныеПолей[Поле.Имя] = Поле.НачальноеЗначение;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

//
//				Поля обработки-
//
/////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////
//
//				Элементы вывода+
//

Функция УстановитьСвойстваЭлементовВывода(ПараметрыОбработки, Элементы=Неопределено, знач СвойстваУстановить=Неопределено, знач ЗначениеСвойства=Неопределено, Явно=Истина) Экспорт
	
	РК = вмс_РаботаСКоллекциями;

	Если ТипЗнч(Элементы)=Тип("СтрокаТаблицыЗначений") Тогда
		//для оптимизации
		ВыбранныеЭлементы = Новый Массив;
		ВыбранныеЭлементы.Добавить(Элементы);
	Иначе
		ВыбранныеЭлементы = ПолучитьЭлементыВывода(ПараметрыОбработки, Элементы);
		Если ВыбранныеЭлементы.Количество()=0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	СтандартныеСвойства = Новый Структура("Использование, Новый, Удалить, Родитель, ТипЭлемента, ТипЗначения, Видимость, Номер, Портал");
	
	Если ТипЗнч(СвойстваУстановить)=Тип("Строка") Тогда
		СвойстваУстановить = Новый Структура(СвойстваУстановить);
		Для Каждого СвойствоУстановить Из СвойстваУстановить Цикл
			СвойстваУстановить[СвойствоУстановить.Ключ] = ЗначениеСвойства;
		КонецЦикла;
	ИначеЕсли ТипЗнч(СвойстваУстановить)=Тип("Структура") Тогда
		СвойстваУстановить = РК.СкопироватьСтруктуру(СвойстваУстановить);
	Иначе
		СвойстваУстановить = Новый Структура;
	КонецЕсли;
	
	Если СвойстваУстановить.Свойство("Родитель") Тогда
		Родитель = СвойстваУстановить.Родитель;
		Если Родитель <> Неопределено И ТипЗнч(Родитель) <> Тип("Строка") Тогда
			СвойстваУстановить.Родитель = Родитель.Имя;
		КонецЕсли;
	КонецЕсли;
	
	Если СвойстваУстановить.Свойство("РодительНового") Тогда
		Родитель = СвойстваУстановить.РодительНового;
		Если Родитель <> Неопределено И ТипЗнч(Родитель) <> Тип("Строка") Тогда
			СвойстваУстановить.РодительНового = Родитель.Имя;
		КонецЕсли;
	КонецЕсли;
	
	СтандартныеСвойстваУстановить = Новый Структура;
	
	Для Каждого СвойствоУстановить Из СвойстваУстановить Цикл
		ИмяСвойства = СвойствоУстановить.Ключ;
		Если Прав(ИмяСвойства, 6)="Нового" Тогда
			ИмяСтандартногоСвойства = Лев(ИмяСвойства, СтрДлина(ИмяСвойства)-6);
		Иначе
			ИмяСтандартногоСвойства = ИмяСвойства;
		КонецЕсли;
		
		Если СтандартныеСвойства.Свойство(ИмяСтандартногоСвойства) Тогда
			СтандартныеСвойстваУстановить.Вставить(ИмяСтандартногоСвойства, СвойствоУстановить.Значение);
		КонецЕсли;
	КонецЦикла;
	
	СвойстваУстановить.Удалить("Использование");
	СвойстваУстановить.Удалить("Новый");
	СвойстваУстановить.Удалить("Портал");
	
	Родитель = Неопределено;
	Если СвойстваУстановить.Свойство("Родитель", Родитель) ИЛИ СвойстваУстановить.Свойство("РодительНового", Родитель) Тогда
		ПриУстановкеРодителяЭлементовВывода(ПараметрыОбработки, ВыбранныеЭлементы, Родитель);
	КонецЕсли;
	
	Для Каждого ЭлементВывода Из ВыбранныеЭлементы Цикл
		
		СвойстваУстановленныеЯвно = ЭлементВывода.СвойстваУстановленныеЯвно;

		Для Каждого СвойствоУстановить Из СтандартныеСвойстваУстановить Цикл
			ИмяСвойства = СвойствоУстановить.Ключ;
			Если Явно Тогда
				ЭлементВывода[ИмяСвойства] = СвойствоУстановить.Значение;
				СвойстваУстановленныеЯвно[ИмяСвойства] = Истина;
			ИначеЕсли СвойстваУстановленныеЯвно[ИмяСвойства] <> Истина Тогда
				ЭлементВывода[ИмяСвойства] = СвойствоУстановить.Значение;
			Иначе
				ТочкаЧеканута = 1;
			КонецЕсли;
		КонецЦикла;
		
		Свойства = ЭлементВывода.Свойства;
		СвойстваПередать = ЭлементВывода.СвойстваПередать;
		Для Каждого СвойствоУстановить Из СвойстваУстановить Цикл
			ИмяСвойства = СвойствоУстановить.Ключ;
			ЗначениеСвойства = СвойствоУстановить.Значение;

			Если Явно Тогда
				СвойстваПередать.Вставить(ИмяСвойства, ЗначениеСвойства);
				Свойства.Вставить(ИмяСвойства, ЗначениеСвойства);
				
				СвойстваПередать.Удалить(ИмяСвойства + "Нового");
				Свойства.Удалить(ИмяСвойства + "Нового");
				
				СвойстваУстановленныеЯвно[ИмяСвойства] = Истина;
			ИначеЕсли СвойстваУстановленныеЯвно[ИмяСвойства] <> Истина Тогда
				СвойстваПередать.Вставить(ИмяСвойства, ЗначениеСвойства);
				Свойства.Вставить(ИмяСвойства, ЗначениеСвойства);
				
				СвойстваПередать.Удалить(ИмяСвойства + "Нового");
				Свойства.Удалить(ИмяСвойства + "Нового");
			Иначе
				ТочкаЧеканута = 1;
			КонецЕсли;
		КонецЦикла;
		
		ЭлементВывода.Обновить = Истина;
		
		Если НЕ ЭлементВывода.Удалить И НЕ СтандартныеСвойстваУстановить.Свойство("Использование") Тогда
			ЭлементВывода.Использование = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

// пересчитывает уровень вложенности элементов по иерархии
Функция ПриУстановкеРодителяЭлементовВывода(ПараметрыОбработки, ВыбранныеЭлементы, Родитель)

	ЭлементыВывода = ПараметрыОбработки.ЭлементыВывода;
	
	Если Родитель=Неопределено Тогда
		Уровень = -1;
	Иначе
		ЭлементРодительМассив = ЭлементыВывода.НайтиСтроки(Новый Структура("Имя", Родитель));
		Если ЭлементРодительМассив.Количество() > 0 Тогда
			ЭлементРодитель = ЭлементРодительМассив[0];
			Уровень = ЭлементРодитель.Уровень;
		Иначе
			Уровень = 0;
		КонецЕсли;
	КонецЕсли;
	
	ЭлементыСоседи = ЭлементыВывода.НайтиСтроки(Новый Структура("Родитель", Родитель));
	Если ЭлементыСоседи.Количество()=0 Тогда
		Номер = 0;
	Иначе
		Номер = ЭлементыСоседи[0].Номер;
		Для Каждого ЭлементСосед Из ЭлементыСоседи Цикл
			Если ЭлементСосед.Номер > Номер Тогда
				Номер = ЭлементСосед.Номер;
			КонецЕсли;
		КонецЦикла;
		Номер = Номер + 1;
	КонецЕсли;
	
	Для Каждого ЭлементВывода Из ВыбранныеЭлементы Цикл
		Если ЭлементВывода.Родитель <> Родитель Тогда
			Если ЭлементВывода.Номер <> Номер Тогда
				ЭлементВывода.Номер = Номер;
				ЭлементВывода.Свойства.Удалить("НомерНового");
				ЭлементВывода.Свойства.Вставить("Номер", Номер);
				ЭлементВывода.СвойстваПередать.Удалить("НомерНового");
				ЭлементВывода.СвойстваПередать.Вставить("Номер", Номер);
				ЭлементВывода.Обновить = Истина;
			КонецЕсли;
			Номер = Номер + 1;
		КонецЕсли;
	КонецЦикла;
	
	ОбходЭлементов = ВыбранныеЭлементы;
	ОбработанныеЭлементы = Новый Соответствие;
	
	Пока ОбходЭлементов.Количество() > 0 Цикл
		
		Уровень = Уровень + 1;

		ОбходЭлементовСледующегоУровня = Новый Массив;
		Для Каждого ЭлементВывода Из ОбходЭлементов Цикл
			ИмяЭлемента = ЭлементВывода.Имя;
			Если ОбработанныеЭлементы[ИмяЭлемента]=Истина Тогда
				ВызватьИсключение "Зацикливание иерархии элементов вывода!";
			КонецЕсли;
			ОбработанныеЭлементы[ИмяЭлемента] = Истина;
			ЭлементВывода.Уровень = Уровень;
			ЭлементыДети = ЭлементыВывода.НайтиСтроки(Новый Структура("Родитель", ИмяЭлемента));
			Для Каждого ЭлементДитё Из ЭлементыДети Цикл
				ОбходЭлементовСледующегоУровня.Добавить(ЭлементДитё);
			КонецЦикла;
		КонецЦикла;
		
		ОбходЭлементов = ОбходЭлементовСледующегоУровня;

	КонецЦикла;
	
КонецФункции

Функция ПолучитьЭлементыВывода(ПараметрыОбработки, ОтборЭлементов) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	Если ОтборЭлементов=ПараметрыОбработки.ПустойЭлементВывода Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ДопРезультатОтбора = Новый Структура;
	ПолученныеЭлементы = РК.ОтобратьЭлементыКоллекции(ПараметрыОбработки.ЭлементыВывода, ОтборЭлементов, "Имя", , ДопРезультатОтбора);

	Для Каждого ИмяЭлемента Из ДопРезультатОтбора.НенайденныеПоИмени Цикл
		ЭлементВывода = НовыйЭлементВывода(ПараметрыОбработки, ИмяЭлемента);
		ПолученныеЭлементы.Добавить(ЭлементВывода);
	КонецЦикла;
	
	Возврат ПолученныеЭлементы;
	
КонецФункции

Функция ЭлементВывода(ПараметрыОбработки, ОтборЭлемента) Экспорт
	
	РК = вмс_РаботаСКоллекциями;

	Если ОтборЭлемента=Неопределено Тогда
		Возврат ПараметрыОбработки.ПустойЭлементВывода;
	КонецЕсли;
	
	Элементы = РК.ОтобратьЭлементыКоллекции(ПараметрыОбработки.ЭлементыВывода, ОтборЭлемента, "Имя");

	Если Элементы.Количество() > 0 Тогда
		
		Возврат Элементы[0];
		
	Иначе
		
		Возврат ПараметрыОбработки.ПустойЭлементВывода;
		
	КонецЕсли;
	
КонецФункции

Функция ЭлементыВывода(ПараметрыОбработки, ОтборЭлементов=Неопределено) Экспорт

	РК = вмс_РаботаСКоллекциями;

	ЭлементыВывода = ПараметрыОбработки.ЭлементыВывода;
	Если ОтборЭлементов=Неопределено ИЛИ ОтборЭлементов=ЭлементыВывода Тогда
		Возврат ЭлементыВывода;
	КонецЕсли;
	
	Возврат РК.ОтобратьЭлементыКоллекции(ЭлементыВывода, ОтборЭлементов, "Имя");

КонецФункции

Функция НовыйЭлементВывода(ПараметрыОбработки, Имя) Экспорт
	
	РК = вмс_РаботаСКоллекциями;

	ЭлементыВывода = ПараметрыОбработки.ЭлементыВывода;
	
	Если Имя <> "Форма" Тогда	
		Если Имя <> ПараметрыОбработки.ПанельЭлементовВыводаПоУмолчанию Тогда
			Родитель = ПараметрыОбработки.ПанельЭлементовВыводаПоУмолчанию;
			Номер = ЭлементыВывода.НайтиСтроки(Новый Структура("Родитель", Родитель)).Количество();
		КонецЕсли;
	КонецЕсли;

	Свойства = Новый Структура;
	
	ЭлементВывода = ЭлементыВывода.Добавить();
	ЭлементВывода.Имя = Имя;
	ЭлементВывода.Видимость = Истина;
	
	Если Родитель <> Неопределено Тогда
		ЭлементВывода.Уровень = 1;
		ЭлементВывода.Номер = Номер;
		Свойства.Вставить("НомерНового", Номер);

		ЭлементВывода.Родитель = Родитель;
		Свойства.Вставить("РодительНового", ЭлементВывода.Родитель);
	Иначе
		ЭлементВывода.Уровень = 0;
		ЭлементВывода.Номер = 0;
	КонецЕсли;

	Если Имя <> "Форма" Тогда	
		Свойства.Вставить("Видимость", ЭлементВывода.Видимость);
	КонецЕсли;
	
	ЭлементВывода.Новый = Истина;
	ЭлементВывода.Удалить = Ложь;
	ЭлементВывода.Обновить = Ложь;
	ЭлементВывода.Использование = Истина;
	ЭлементВывода.Свойства = Свойства;
	ЭлементВывода.СвойстваПередать = РК.СкопироватьСтруктуру(ЭлементВывода.Свойства);
	ЭлементВывода.СвойстваНаКлиенте = Новый Структура;
	ЭлементВывода.События = Новый Структура;
	ЭлементВывода.СвойстваУстановленныеЯвно = Новый Соответствие;
	
	Возврат ЭлементВывода;
	
КонецФункции

//
//				Элементы вывода-
//
/////////////////////////////////////////////////////////////////////////


Функция НачатьТранзакциюОбработки(ПараметрыОбработки) Экспорт

	СкопироватьДанныеВТранзакцию(ПараметрыОбработки);
	
	ДанныеТранзакции = ПараметрыОбработки.ДанныеТранзакции;
	ДанныеТранзакции.Активна = Истина;
	ДанныеТранзакции.Прервать = Ложь;
	ДанныеТранзакции.Отменить = Ложь;
	Возврат Истина;
	
КонецФункции

Функция СкопироватьДанныеВТранзакцию(ПараметрыОбработки) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ДанныеТранзакции = ПараметрыОбработки.ДанныеТранзакции;
	ДанныеОбработки = ПараметрыОбработки.Данные;
	
	СкопироватьПоляОбработки(ДанныеТранзакции.ПоляОбработки, ПараметрыОбработки.ПоляОбработки, ПараметрыОбработки, Ложь);
	ДанныеТранзакции.Вставить("ВходящиеДанные", СкопироватьВходящиеДанные(ДанныеОбработки.ВходящиеДанные));
	ДанныеТранзакции.Вставить("ПринятыеДанныеПолей", РК.СкопироватьОбъект(ДанныеОбработки.ПринятыеДанныеПолей));
	ДанныеТранзакции.Вставить("ВведенныеДанныеПолей", РК.СкопироватьОбъект(ДанныеОбработки.ВведенныеДанныеПолей));
	ДанныеТранзакции.Вставить("СтатическиеДанныеПолей", РК.СкопироватьОбъект(ДанныеОбработки.СтатическиеДанныеПолей));
	ДанныеТранзакции.Вставить("ЗапланированныеДанныеПолей", РК.СкопироватьОбъект(ДанныеОбработки.ЗапланированныеДанныеПолей));
	ДанныеТранзакции.Вставить("СобранныеДанныеПолей", РК.СкопироватьОбъект(ДанныеОбработки.СобранныеДанныеПолей));
	ДанныеТранзакции.Вставить("ОбщиеДанныеПолей", РК.СкопироватьОбъект(ДанныеОбработки.ОбщиеДанныеПолей));
	ДанныеТранзакции.Вставить("ПредставлениеДанныхПолей", РК.СкопироватьОбъект(ДанныеОбработки.ПредставлениеДанныхПолей));
	
	ДанныеТранзакции.Вставить("РезультатАнализаЗаполненияПолейДанныхВвода", РК.СкопироватьСтруктуру(ДанныеОбработки.РезультатАнализаЗаполненияПолейДанныхВвода));
	ДанныеТранзакции.Вставить("РезультатАнализаЗаполненияПолейДанныхПлана", РК.СкопироватьСтруктуру(ДанныеОбработки.РезультатАнализаЗаполненияПолейДанныхПлана));
	ДанныеТранзакции.Вставить("РезультатАнализаЗаполненияПолейДанныхСборки", РК.СкопироватьСтруктуру(ДанныеОбработки.РезультатАнализаЗаполненияПолейДанныхСборки));
	ДанныеТранзакции.Вставить("РезультатАнализаЗаполненияПолейОбщихДанных", РК.СкопироватьСтруктуру(ДанныеОбработки.РезультатАнализаЗаполненияПолейОбщихДанных));
	
КонецФункции

Функция СкопироватьПоляОбработки(ПоляПриемник, ПоляИсточник, ПараметрыОбработки, ОбрабатыватьУстановкуСвойств) Экспорт
	
	ПоляПриемник.Очистить();
	
	ПустойЭлементВывода = ПараметрыОбработки.ПустойЭлементВывода;
	ЭлементыВывода = ПараметрыОбработки.ЭлементыВывода;
	
	ПоискПоИмени = Новый Структура("Имя");
	
	Для Каждого ПолеИсточник Из ПоляИсточник Цикл
		ПолеПриемник = ПоляПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(ПолеПриемник, ПолеИсточник, , "События");
		
		СобытияПриемник = Новый Структура;
		СобытияПриемник.Очистить();
		Для Каждого Событие Из ПолеИсточник.События Цикл
			СобытияПриемник.Вставить(Событие.Ключ, Событие.Значение);
		КонецЦикла;
		
		ПолеПриемник.События = СобытияПриемник;

		Если ОбрабатыватьУстановкуСвойств Тогда
			// передать значения свойств в элемент вывода
			СвойстваЭлементаВывода = Новый Структура;
			ПоискПоИмени.Имя = ПолеПриемник.ИмяЭлементаВывода;
			ЭлементВыводаМассив = ЭлементыВывода.НайтиСтроки(ПоискПоИмени);
			Если ЭлементВыводаМассив.Количество() > 0 Тогда
				ЭлементВывода = ЭлементВыводаМассив[0];
				Если ЭлементВывода.Видимость <> ПолеПриемник.Вывод Тогда
					СвойстваЭлементаВывода.Вставить("Видимость", ПолеПриемник.Вывод);
				КонецЕсли;

				Если СвойстваЭлементаВывода.Количество() > 0 Тогда
					УстановитьСвойстваЭлементовВывода(ПараметрыОбработки, ЭлементВывода, СвойстваЭлементаВывода);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ЗафиксироватьТранзакциюОбработки(ПараметрыОбработки) Экспорт

	РК = вмс_РаботаСКоллекциями;
	
	ДанныеТранзакции = ПараметрыОбработки.ДанныеТранзакции;
	ДанныеОбработки = ПараметрыОбработки.Данные;

	ДанныеТранзакции.Активна = Ложь;

	//РК.УстановитьЭлементыКоллекции(ПараметрыОбработки.ПоляОбработки, ДанныеТранзакции.ПоляОбработки);
	СкопироватьПоляОбработки(ПараметрыОбработки.ПоляОбработки, ДанныеТранзакции.ПоляОбработки, ПараметрыОбработки, Истина);
	ДанныеОбработки.ВходящиеДанные = СкопироватьВходящиеДанные(ДанныеТранзакции.ВходящиеДанные);
	РК.СкопироватьПоляСтруктуры(ДанныеТранзакции.ПринятыеДанныеПолей, ДанныеОбработки.ПринятыеДанныеПолей);
	ЗаполнитьЗначенияСвойств(ДанныеОбработки.ВведенныеДанныеПолей, ДанныеТранзакции.ВведенныеДанныеПолей);
	ЗаполнитьЗначенияСвойств(ДанныеОбработки.ЗапланированныеДанныеПолей, ДанныеТранзакции.ЗапланированныеДанныеПолей);
	ЗаполнитьЗначенияСвойств(ДанныеОбработки.СобранныеДанныеПолей, ДанныеТранзакции.СобранныеДанныеПолей);
	ЗаполнитьЗначенияСвойств(ДанныеОбработки.ОбщиеДанныеПолей, ДанныеТранзакции.ОбщиеДанныеПолей);
	РК.СкопироватьПоляСтруктуры(ДанныеТранзакции.СтатическиеДанныеПолей, ДанныеОбработки.СтатическиеДанныеПолей);
	ЗаполнитьЗначенияСвойств(ДанныеОбработки.ПредставлениеДанныхПолей, ДанныеТранзакции.ПредставлениеДанныхПолей);

	ДанныеОбработки.РезультатАнализаЗаполненияПолейДанныхВвода = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода;
	ДанныеОбработки.РезультатАнализаЗаполненияПолейДанныхПлана = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхПлана;
	ДанныеОбработки.РезультатАнализаЗаполненияПолейДанныхСборки = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхСборки;
	ДанныеОбработки.РезультатАнализаЗаполненияПолейОбщихДанных = ДанныеТранзакции.РезультатАнализаЗаполненияПолейОбщихДанных;
	
КонецФункции
#КонецЕсли
