
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	ЭтаФорма.Заголовок = Объект.Наименование;
	
	НастройкаТоварныхПолей = ПолучитьСохраненнуюНастройкуТоварныхПолей();
	
    ЗагрузитьНастройкуТоварныхПолей(НастройкаТоварныхПолей);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСохраненнуюНастройкуТоварныхПолей()

	НастройкаТоварныхПолей = вмс_ОперацииПоЯчейкамКлиентСервер.ПолучитьСтруктуруНастройкиТоварныхПолей();
	
	НастройкаПрограммы = РеквизитФормыВЗначение("Объект");
	Если НастройкаПрограммы.ИспользуетсяХранилище Тогда 
		НастройкаТоварныхПолейСохраненная = НастройкаПрограммы.ХранилищеНастройки.Получить();
		вмс_ОперацииПоЯчейкамКлиентСервер.ЗагрузитьСохраненнуюНастройкуТоварныхПолей(НастройкаТоварныхПолей, НастройкаТоварныхПолейСохраненная);
	КонецЕсли;
	
	Возврат НастройкаТоварныхПолей;
	
КонецФункции

&НаСервере
Функция ЗагрузитьНастройкуТоварныхПолей(НастройкаТоварныхПолей)
	
	РК = вмс_РаботаСКоллекциями;

	ТаблицаНастройкиПолей.Очистить();
	Для Каждого СтрокаПоля Из РК.ПолучитьЭлементыКоллекции(НастройкаТоварныхПолей.ТаблицаПолей) Цикл
		СтрокаПоляНаФорме = ТаблицаНастройкиПолей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоляНаФорме, СтрокаПоля);
	КонецЦикла;
	
	СКДИсточникаПредставленийПолей = вмс_ОбщегоНазначенияКлиентСервер.ПрочитатьТекстОбъектаXDTO(НастройкаТоварныхПолей.СКДИсточникаПредставленийПолей);
	ЗагрузитьЗначениеВХранилищеНаФорме("СКДИсточникаПредставленийПолей", СКДИсточникаПредставленийПолей);
	
КонецФункции

&НаКлиенте
Процедура СохранитьПоля(Команда) 

	Записать();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруНастройки()

	СтруктураНастройки = вмс_ОперацииПоЯчейкамКлиентСервер.ПолучитьСтруктуруНастройкиТоварныхПолей();
	вмс_ОперацииПоЯчейкамКлиентСервер.ЗагрузитьСохраненнуюТаблицуНастройкиТоварныхПолей(СтруктураНастройки.ТаблицаПолей, ТаблицаНастройкиПолей);
	
	СКДИсточникаПредставленийПолей = ПолучитьЗначениеИзХранилищаНаФорме("СКДИсточникаПредставленийПолей");
	СтруктураНастройки.СКДИсточникаПредставленийПолей = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьТекстОбъектаXDTO(СКДИсточникаПредставленийПолей);
	
	Возврат СтруктураНастройки;
		
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтруктураНастройки = ПолучитьСтруктуруНастройки();
	
	ТекущийОбъект.ИспользуетсяХранилище = Истина;
	ТекущийОбъект.ХранилищеНастройки = Новый ХранилищеЗначения(СтруктураНастройки, Новый СжатиеДанных(9));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИсточникПредставленийПолей(Команда)
	
	ОО = Новый ОписаниеОповещения("СохранитьНастройкиРедактора",ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаРедакторСКД", Новый Структура("СКД", ПолучитьАдресХранилищаНаФорме("СКДИсточникаПредставленийПолей")), ЭтаФорма,,,, ОО);
	
КонецПроцедуры    

&НаСервере
Функция СохранитьНастройкиРедактора(АдресСхемыРедактора, ДополнительныеПараметры) Экспорт
	
	Если АдресСхемыРедактора = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СКД = ПолучитьИзВременногоХранилища(АдресСхемыРедактора);
	ЗагрузитьЗначениеВХранилищеНаФорме("СКДИсточникаПредставленийПолей", СКД);
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьАдресХранилищаНаФорме("СКДИсточникаПредставленийПолей"));
	
	ЭтаФорма.Модифицированность = Истина;
	Возврат Истина;

КонецФункции // СохранитьНастройкиРедактора()

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	УдалитьХранилищаНаФорме();
	
КонецПроцедуры

//********************************************
//{ Работа с хранилищами

Функция ЗагрузитьЗначениеВХранилищеНаФорме(Имя, Значение)
	
	Перем АдресХранилища;
	
	СписокАдресовХранилищЗначений = ПолучитьСписокАдресовХранилищЗначений();
	
	СписокАдресовХранилищЗначений.Свойство(Имя, АдресХранилища);

	Если АдресХранилища <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(Значение, АдресХранилища);
	Иначе
		АдресХранилища = ПоместитьВоВременноеХранилище(Значение, ЭтаФорма.УникальныйИдентификатор);
		СписокАдресовХранилищЗначений.Вставить(Имя, АдресХранилища);
	КонецЕсли;
	
	Возврат АдресХранилища;
	
КонецФункции

Функция ПолучитьЗначениеИзХранилищаНаФорме(Имя)
	
	АдресХранилища = ПолучитьАдресХранилищаНаФорме(Имя);
	Если ЗначениеЗаполнено(АдресХранилища) Тогда
		Возврат ПолучитьИзВременногоХранилища(АдресХранилища);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьАдресХранилищаНаФорме(Имя)
	
	Перем АдресХранилища;
	
	ПолучитьСписокАдресовХранилищЗначений().Свойство(Имя, АдресХранилища);

	Возврат АдресХранилища;
	
КонецФункции

Функция ПолучитьСписокАдресовХранилищЗначений()
	
	ВсеРеквизитыФормы = ПолучитьРеквизиты();
	Для Каждого РеквизитФормы Из ВсеРеквизитыФормы Цикл
		Если РеквизитФормы.Имя = "СписокАдресовХранилищЗначений" Тогда
			Возврат ЭтаФорма.СписокАдресовХранилищЗначений;
		КонецЕсли;
	КонецЦикла;
	
	НовыеРеквизиты = Новый Массив;
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("СписокАдресовХранилищЗначений", Новый ОписаниеТипов));
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	ЭтаФорма.СписокАдресовХранилищЗначений = Новый Структура;
	Возврат ЭтаФорма.СписокАдресовХранилищЗначений;
	
КонецФункции

Функция УдалитьХранилищаНаФорме()
	
	СписокАдресовХранилищЗначений = ПолучитьСписокАдресовХранилищЗначений();
	
	Для Каждого АдресХранилищаЗначения Из СписокАдресовХранилищЗначений Цикл
		УдалитьИзВременногоХранилища(АдресХранилищаЗначения.Значение);
	КонецЦикла;
	
	СписокАдресовХранилищЗначений.Очистить();
	
КонецФункции

//} Работа с хранилищами
//********************************************

&НаКлиенте
Функция Инициализация()
КонецФункции

&НаКлиенте
Процедура СброситьНастройки(Команда)
	
	СброситьНастройкиНаСервере();

	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СброситьНастройкиНаСервере()
	
	НастройкаТоварныхПолей = вмс_ОперацииПоЯчейкамКлиентСервер.ПолучитьСтруктуруНастройкиТоварныхПолей();

	ЗагрузитьНастройкуТоварныхПолей(НастройкаТоварныхПолей);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастройкиПолейПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаНастройкиПолей.ТекущиеДанные;
	
	ДоступныеПоля = ПолучитьДоступныеПоляПредставлений();
	
	ТекущиеПоля = вмс_РаботаСКоллекциями.СтрокуВМассив(ТекущиеДанные.Представление);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДоступныеПоля", ДоступныеПоля);
	ПараметрыФормы.Вставить("ТекущиеПоля", ТекущиеПоля);
	ОО = Новый ОписаниеОповещения("ОбработкаВыбораПолейПредставления", ЭтаФорма, ТекущиеДанные);
	ОткрытьФорму("Справочник.вмс_НастройкиПрограммы.Форма.ФормаВыбораПолейПредставления", ПараметрыФормы, ЭтаФорма, , , , ОО);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПолейПредставления(ВыбранныеПоля, СтрокаПоля) Экспорт
	
	Если ВыбранныеПоля = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПоля.Представление = вмс_РаботаСКоллекциями.МассивВСтроку(ВыбранныеПоля);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступныеПоляПредставлений()
	
	СКД = ПолучитьЗначениеИзХранилищаНаФорме("СКДИсточникаПредставленийПолей");
	ИсточникДоступныхНастроекКомпоновкиДанных = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	
	КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(ИсточникДоступныхНастроекКомпоновкиДанных);
	НастройкиСКД = КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();
	
	ДоступныеПоля = Новый СписокЗначений;
	
	Для Каждого ДоступноеПолеСКД Из НастройкиСКД.Выбор.ДоступныеПоляВыбора.Элементы Цикл
		Если Не ДоступноеПолеСКД.Папка Тогда
			ДоступныеПоля.Добавить(Строка(ДоступноеПолеСКД.Поле), ДоступноеПолеСКД.Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДоступныеПоля;
	
КонецФункции
