#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция УстановитьПараметрСеанса()
	
	Если Не ЗначениеЗаполнено(ПараметрСеанса) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МетаДанныеПараметра = МетаДанные.ПараметрыСеанса.Найти(ПараметрСеанса);
	Если МетаДанныеПараметра = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	Если МетаДанныеПараметра.Тип.Типы().Найти(ТипЗначения) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыСеанса[ПараметрСеанса] = Значение;
	Возврат Истина;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	УстановитьПараметрСеанса();
КонецПроцедуры

#Иначе

#КонецЕсли