
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере(Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПриЧтенииСозданииНаСервере(ТекущийОбъект)
	
	вмс_РаботаСФормамиСервер.КвазиРеквизиты_ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, ПолучитьСписокКвазиРеквизитов());
	
	ОбновитьПредставленияИдентификаторовКомандПечатныхФорм();

КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	вмс_РаботаСФормамиСервер.КвазиРеквизиты_ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, ПолучитьСписокКвазиРеквизитов());
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПредставленияИдентификаторовКомандПечатныхФорм();
	
КонецПроцедуры

&НаСервере
Функция ОбновитьПредставленияИдентификаторовКомандПечатныхФорм()

	Перем Объект;
	Объект = ЭтаФорма;
	
	ПечатныеОбработки = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(Объект.ФормыОтправки, "ПечатнаяФорма");
	ТаблицаКоманд = Справочники.вмс_ПечатныеФормы.ПолучитьТаблицуКоманд(ПечатныеОбработки);
	Для Каждого ФормаОтправки Из Объект.ФормыОтправки Цикл
		НайденныеСтрокиКоманд = ТаблицаКоманд.НайтиСтроки(Новый Структура("Ссылка, Идентификатор", ФормаОтправки.ПечатнаяФорма, ФормаОтправки.ИдентификаторКоманды));
		Если НайденныеСтрокиКоманд.Количество() > 0 Тогда
			ФормаОтправки.ПредставлениеКоманды = НайденныеСтрокиКоманд[0].Представление;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокКвазиРеквизитов()

	ТаблицаРеквизитов = Новый ТаблицаЗначений;
	ТаблицаРеквизитов.Колонки.Добавить("Имя");
	ТаблицаРеквизитов.Колонки.Добавить("Тип");
	
	СтрокаРеквизита = ТаблицаРеквизитов.Добавить();
	СтрокаРеквизита.Имя = "УчетнаяЗапись";
	СтрокаРеквизита.Тип = вмс_АдаптацияКонфигураций.ПолучитьИмяТипаСсылкиУчетныхЗаписей();

	СтрокаРеквизита = ТаблицаРеквизитов.Добавить();
	СтрокаРеквизита.Имя = "Свойства.Значение";
	СтрокаРеквизита.Тип = вмс_ОбщегоНазначенияВызовСервера.ПолучитьОписаниеТипов("Строка, СправочникСсылка.Склады, СправочникСсылка.СтруктурныеЕдиницы", , Новый КвалификаторыСтроки(100));
	
	МассивИменТипов = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИменаСсылочныхТипов(Истина, Истина, Ложь);
	ИменаТипов = вмс_РаботаСКоллекциями.МассивВСтроку(МассивИменТипов);
	СтрокаРеквизита = ТаблицаРеквизитов.Добавить();
	СтрокаРеквизита.Имя = "ПараметрПечати";
	СтрокаРеквизита.Тип = Новый ОписаниеТипов(ИменаТипов);
	
	СтрокаРеквизита = ТаблицаРеквизитов.Добавить();
	СтрокаРеквизита.Имя = "ФормыОтправки.ПечатнаяФорма";
	СтрокаРеквизита.Тип =
							вмс_ОбщегоНазначенияВызовСервера.ПолучитьОписаниеТипов(
								вмс_ОбщегоНазначенияКлиентСервер.ПолучитьИмяТипаСсылкиИзИмениТипаОбъекта(
									вмс_АдаптацияКонфигураций.ПолучитьИмяСправочникаДополнительныхОтчетовИОбработок()));

	Возврат ТаблицаРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура СформироватьФормыОтправки(Команда)
	
	МассивРезультатов = СформироватьФормыОтправкиНаСервере();
	
	Для Каждого Результат Из МассивРезультатов Цикл
		Результат.Показать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СформироватьФормыОтправкиНаСервере()

	вмс_РаботаСФормамиСервер.КвазиРеквизиты_ПередЗаписьюНаСервере(ЭтаФорма, Объект, ПолучитьСписокКвазиРеквизитов());
	МассивРезультатов = Справочники.вмс_ПочтовыеРассылки.СформироватьФормыОтправки(Объект, ПараметрПечати);
	
	Возврат МассивРезультатов;
	
КонецФункции

&НаКлиенте
Процедура Отправить(Команда)
	
	ОтправитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	вмс_РаботаСФормамиСервер.КвазиРеквизиты_ПередЗаписьюНаСервере(ЭтаФорма, Объект, ПолучитьСписокКвазиРеквизитов());
	Справочники.вмс_ПочтовыеРассылки.Отправить(Объект, ПараметрПечати);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКомандПечатнойОбработки(Обработка)
	
	Возврат Справочники.вмс_ПечатныеФормы.ПолучитьСписокКоманд(Обработка);
	
КонецФункции

&НаКлиенте
Процедура ФормыОтправкиПриАктивизацииСтроки(Элемент)
	
	ОбновитьСписокКомандДляТекущейПечатнойФормы();

КонецПроцедуры

&НаКлиенте
Процедура ФормыОтправкиПечатнаяФормаПриИзменении(Элемент)
	
	Перем Объект;
	Объект = ЭтаФорма;
	
	ОбновитьСписокКомандДляТекущейПечатнойФормы();
	
	СписокКоманд = Элементы.ФормыОтправкиИдентификаторКоманды.СписокВыбора;
	ФормаОтправки = Объект.ФормыОтправки.НайтиПоИдентификатору(Элементы.ФормыОтправки.ТекущаяСтрока);
	Если СписокКоманд.Количество() > 0 Тогда
		Команда = СписокКоманд.Получить(0);
		ФормаОтправки.ИдентификаторКоманды = Команда.Значение;
		ФормаОтправки.ПредставлениеКоманды = Команда.Представление;
	Иначе
		ФормаОтправки.ИдентификаторКоманды = "";
		ФормаОтправки.ПредставлениеКоманды = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормыОтправкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		ОбновитьСписокКомандДляТекущейПечатнойФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбновитьСписокКомандДляТекущейПечатнойФормы()
	
	Перем Объект;
	Объект = ЭтаФорма;
	
	ТекущаяСтрока = Элементы.ФормыОтправки.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущиеДанные = Объект.ФормыОтправки.НайтиПоИдентификатору(ТекущаяСтрока);
		СписокКоманд = ПолучитьСписокКомандПечатнойОбработки(ТекущиеДанные.ПечатнаяФорма);
		вмс_РаботаСКоллекциями.УстановитьЭлементыКоллекции(Элементы.ФормыОтправкиИдентификаторКоманды.СписокВыбора, СписокКоманд);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ФормыОтправкиИдентификаторКомандыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Перем Объект;
	Объект = ЭтаФорма;
	
	ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	Объект.ФормыОтправки.НайтиПоИдентификатору(Элементы.ФормыОтправки.ТекущаяСтрока).ПредставлениеКоманды = ЭлементСписка.Представление;
	
КонецПроцедуры
