Функция НоваяНастройка() Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ЭлементыВывода = РК.НоваяКоллекцияЗначений("Имя, ПолноеИмя, КлассЭлемента, ТипЭлемента, ВидЭлемента, Картинка, Родитель, Номер, Зависимый, Свойства, ДополнительныеДанные");
	РК.ДобавитьИндексКоллекции(ЭлементыВывода, "ПолноеИмя");
	РК.ДобавитьИндексКоллекции(ЭлементыВывода, "Родитель");

	ПоляДанных = РК.НоваяКоллекцияЗначений("Имя, ПолноеИмя, КлассЭлемента, ТипЭлемента, Картинка, Родитель, Номер, Зависимый, Свойства, ДополнительныеДанные");
	РК.ДобавитьИндексКоллекции(ПоляДанных, "ПолноеИмя");
	РК.ДобавитьИндексКоллекции(ПоляДанных, "Родитель");
	
	СборщикиДанных = РК.НоваяКоллекцияЗначений("Имя, ПолноеИмя, КлассЭлемента, Картинка, Родитель, Номер, Зависимый, Свойства, ДополнительныеДанные");
	РК.ДобавитьИндексКоллекции(СборщикиДанных, "ПолноеИмя");
	РК.ДобавитьИндексКоллекции(СборщикиДанных, "Родитель");
	
	СсылкиЭлементов = РК.НоваяКоллекцияЗначений("ЭлементИсточник, КлассЭлементаИсточника, ИмяСвойства, ЭлементПриемник, КлассЭлементаПриемника, СлабаяСсылка");
	РК.ДобавитьИндексКоллекции(СсылкиЭлементов, "ЭлементИсточник, КлассЭлементаИсточника");
	РК.ДобавитьИндексКоллекции(СсылкиЭлементов, "ЭлементИсточник, КлассЭлементаИсточника, ИмяСвойства");
	РК.ДобавитьИндексКоллекции(СсылкиЭлементов, "ЭлементПриемник, КлассЭлементаПриемника");
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("ТипыЗначенийСвойствЭлементовИБ", ТипыЗначенийСвойствЭлементовИБ());
	ДополнительныеДанные.Вставить("СведенияОТипахЭлементовВывода", СведенияОТипахЭлементовВывода());
	ДополнительныеДанные.Вставить("СведенияОСвойствахПолейОбработки", СведенияОСвойствахПолейОбработки());
	ДополнительныеДанные.Вставить("СведенияОСвойствахСборщиковДанных", СведенияОСвойствахСборщиковДанных());
	ДополнительныеДанные.Вставить("СсылкиЭлементов", СсылкиЭлементов);
	ДополнительныеДанные.Вставить("ПараметрыКонструирования", НовыеПараметрыКонструирования());
	ДополнительныеДанные.Вставить("НастройкаИБ");
	ДополнительныеДанные.Вставить("ДополнительныеПоляКлючаЭлемента");
	
	Настройка = Новый Структура;
	Настройка.Вставить("ЭлементыВывода", ЭлементыВывода);
	Настройка.Вставить("ПоляДанных", ПоляДанных);
	Настройка.Вставить("СборщикиДанных", СборщикиДанных);
	Настройка.Вставить("ДополнительныеДанные", ДополнительныеДанные);
	
	Возврат Настройка;
	
КонецФункции

// для переходного периода
Функция ИспользоватьНовуюСистему() Экспорт
	
	Возврат Истина;
	
КонецФункции

Функция ТипПоляДанных(ТипЗначенияПоляДанных)
	
	Типы = ТипЗначенияПоляДанных.Типы();
	
	Если Типы.Количество()=1 Тогда
		Тип = Типы[0];
		ДанныеТипа = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьДанныеТипаОбъекта(Тип);
		ИмяТипа = ДанныеТипа.Имя;
		Если ИмяТипа="ТаблицаЗначений" Тогда
			Возврат "Таблица";
		КонецЕсли;
	КонецЕсли;
	
	Возврат "Поле";
	
КонецФункции

Функция ПолучитьИмяНовогоЭлемента(Элементы, знач Префикс=Неопределено, Родитель=Неопределено)
	
	РК = вмс_РаботаСКоллекциями;
	
	Если НЕ ЗначениеЗаполнено(Префикс) Тогда
		Префикс = "Элемент";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		ПолныйПрефикс = Родитель + "." + Префикс;
	Иначе
		ПолныйПрефикс = Префикс;
	КонецЕсли;
	ПолныйПрефикс = ВРЕГ(ПолныйПрефикс);
	
	НомерЭлемента = 1;
	ПоискПоПолномуИмени = Новый Структура("ПолноеИмя");
	Пока Истина Цикл
		НомерЭлементаСтрокой = Формат(НомерЭлемента, "ЧГ=0");
		ПоискПоПолномуИмени.ПолноеИмя = ПолныйПрефикс + НомерЭлементаСтрокой;
		Если РК.НайтиЭлементКоллекции(Элементы, ПоискПоПолномуИмени)=Неопределено Тогда
			Возврат Префикс + НомерЭлементаСтрокой;
		КонецЕсли;
		НомерЭлемента = НомерЭлемента + 1;
	КонецЦикла;
	
КонецФункции

Функция ПроверитьИмяЭлемента(Элементы, Имя, ПолноеИмя, ТекстОшибки="")
	
	РК = вмс_РаботаСКоллекциями;
	
	Если Не РК.ПроверитьИмяПрограммнойПеременной(Имя) Тогда
		ТекстОшибки = "Неверное имя";
	ИначеЕсли РК.НайтиЭлементКоллекции(Элементы, Новый Структура("ПолноеИмя", ПолноеИмя)) <> Неопределено Тогда
		ТекстОшибки = "Элемент с таким именем уже есть";
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	ВызватьИсключение(ТекстОшибки, , "ОшибкаИзмененияЭлементовНастройкиПолей");
	Возврат Ложь;
	
КонецФункции

Функция ТипыЗначенийСвойствЭлементовИБ()
	
	ТипыЗначенийСвойствЭлементовИБ = Новый Соответствие;
	Для Каждого Тип Из вмс_НастройкиПолейЗаданияВызовСервера1.ТипыЗначенийСвойствЭлементовИБ().Типы() Цикл
		ТипыЗначенийСвойствЭлементовИБ[Тип] = Истина;
	КонецЦикла;
	
	ТипыЗначенийСвойствЭлементовИБ[Тип("Неопределено")] = Истина;
	
	Возврат ТипыЗначенийСвойствЭлементовИБ;
	
КонецФункции

Функция СведенияОТипахЭлементовВывода()
	
	КФ = вмс_КонструкторФорм;

	СведенияОТипахЭлементовВывода = КФ.ПолучитьСведенияОТипахЭлементовФормы();
	
	ЗарегистрироватьВидЭлементаСтраницаСборщикаДанных(СведенияОТипахЭлементовВывода);
	
	УстановитьТипСвойстваПутьКДаннымЭлементовВывода(СведенияОТипахЭлементовВывода);
	
	Возврат СведенияОТипахЭлементовВывода;
	
КонецФункции

Функция ЗарегистрироватьВидЭлементаСтраницаСборщикаДанных(СведенияОТипахЭлементовВывода)

	КФ = вмс_КонструкторФорм;
	
	ТипЭлемента = "ГруппаФормы";
	ВидЭлемента = "СтраницаВводаДанных";
	ЗначениеВидЭлемента = Новый Структура("ТипЭлемента, ВидЭлемента, Представление", ТипЭлемента, ВидЭлемента, "Страница ввода данных"); // искуственное значение вида элемента

	КФ.СкопироватьТипЭлементаФормы(СведенияОТипахЭлементовВывода, ТипЭлемента, "Страница", ТипЭлемента, ВидЭлемента);
	СведенияОТипеЭлементаФормы = КФ.ПолучитьСведенияОТипеЭлементаФормы(СведенияОТипахЭлементовВывода, ТипЭлемента, ВидЭлемента);
	СведенияОТипеЭлементаФормы.Представление = "Группа - страница ввода данных";
	СведенияОТипеЭлементаФормы.ЗначениеСвойстваВидЭлемента = ЗначениеВидЭлемента;
	СвойствоВид = КФ.ПолучитьСвойствоЭлементаФормы(СведенияОТипахЭлементовВывода, ТипЭлемента, ВидЭлемента, "Вид");
	СвойствоВид.ЗначениеПоУмолчанию = ЗначениеВидЭлемента;
	СвойствоВид.СписокВыбора.Добавить(ЗначениеВидЭлемента, ЗначениеВидЭлемента.Представление);

	СведенияОТипахЭлементовВывода.ВидыЭлементовПоЗначениям[ЗначениеВидЭлемента] = ЗначениеВидЭлемента;
	
	СвойствоЭлемента = КФ.ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовВывода, "СборщикиДанных", "Сборщики данных", "КлассЭлементовНастройкиПолейЗадания.СборщикиДанных", "");
	СвойствоЭлемента.НесколькоЗначений = Истина;
	СвойствоЭлемента.ОбработчикУстановкиЗначения = вмс_ОбщегоНазначенияКлиентСервер.НовыйОписаниеОповещения("СтраницаВводаДанных_ПриУстановкеСборщиковДанных", вмс_НастройкиПолейЗадания1);
	
КонецФункции

Функция УстановитьТипСвойстваПутьКДаннымЭлементовВывода(СведенияОТипахЭлементовВывода)
	
	РК = вмс_РаботаСКоллекциями;
	
	Для Каждого СвойствоЭлемента Из РК.ПолучитьЭлементыКоллекции(СведенияОТипахЭлементовВывода.ТаблицаСвойствЭлементов) Цикл
		Если СвойствоЭлемента.ИмяСвойства="ПутьКДанным" Тогда
			СвойствоЭлемента.Тип = "КлассЭлементовНастройкиПолейЗадания.ПоляДанных";
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция СведенияОСвойствахПолейОбработки()
	
	РК = вмс_РаботаСКоллекциями;
	
	ИменаКолонок = "ИмяСвойства, Тип, ЗначениеПоУмолчанию, СписокВыбора, СистемноеСвойство, СлабаяСсылка, ОбработчикУстановкиЗначения";
	Свойства = РК.НоваяКоллекцияЗначений(ИменаКолонок);
	
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "Имя", "Строка", ""));
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "Зависимый", "Булево", Ложь, , Истина));
	
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "Синоним", "Строка", ""));
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "Ввод", "Булево", Истина));
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "План", "Булево", Истина));
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "Сборка", "Булево", Истина));
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "Ресурс", "Булево", Ложь));
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "ОбязательныйВвод", "Булево", Истина));
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "ОбязательноеЗаполнение", "Булево", Истина));
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "ТипЗначения", "ОписаниеТипов", Новый ОписаниеТипов));
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "ПутьКДаннымЗаполнения", "Строка", ""));
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "ПутьКДаннымСохранения", "Строка", ""));
	
	РК.ДобавитьИндексКоллекции(Свойства, "ИмяСвойства");
	
	Возврат Свойства;
	
КонецФункции

Функция СведенияОСвойствахСборщиковДанных()
	
	РК = вмс_РаботаСКоллекциями;
	
	ИменаКолонок = "ИмяСвойства, Тип, ЗначениеПоУмолчанию, СписокВыбора, НесколькоЗначений, СистемноеСвойство, СлабаяСсылка, ОбработчикУстановкиЗначения";
	Свойства = РК.НоваяКоллекцияЗначений(ИменаКолонок);
	
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "Имя", "Строка", ""));
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "Зависимый", "Булево", Ложь, , , Истина));
	
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "Тип", "Строка", "СборщикДанныхСтандартный", вмс_НастройкиПолейЗаданияВызовСервера1.СписокТиповСборщиков()));
	РК.ДобавитьЭлементКоллекции(Свойства, Новый Структура(ИменаКолонок, "Поля", "КлассЭлементовНастройкиПолейЗадания.ПоляДанных", "", , Истина, , Истина));
	
	РК.ДобавитьИндексКоллекции(Свойства, "ИмяСвойства");
	
	Возврат Свойства;
	
КонецФункции

Функция ПолучитьСписокЗначенийСвойстваЭлемента(Настройка, Элемент, ИмяСвойства) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	Значение = ПолучитьЗначениеСвойстваЭлемента(Настройка, Элемент, ИмяСвойства);
	
	СписокЗначений = РК.ЗначениеВМассив(Значение);
	
	Возврат СписокЗначений;
	
КонецФункции

Функция ПолучитьЗначениеСвойстваЭлемента(Настройка, Элемент, ИмяСвойства) Экспорт
	
	Перем ЗначениеСвойства;
	
	Если Элемент=Неопределено Тогда
		ТекстОшибки = "Элемент не выбран!";
		ВызватьИсключение(ТекстОшибки, , "ОшибкаИзмененияЭлементовНастройкиПолей");
	КонецЕсли;
	
	Если Элемент.Свойства.Свойство(ИмяСвойства, ЗначениеСвойства) Тогда
		Возврат ЗначениеСвойства;
	КонецЕсли;
	
	Возврат ПолучитьЗначениеСвойстваЭлементаПоУмолчанию(Настройка, Элемент, ИмяСвойства);
	
КонецФункции

Функция ПолучитьЗначениеСвойстваЭлементаПоУмолчанию(Настройка, Элемент, ИмяСвойства) Экспорт
	
	ОписаниеСвойства = ПолучитьОписаниеСвойстваЭлемента(Настройка, Элемент, ИмяСвойства);
	
	Если ОписаниеСвойства <> Неопределено Тогда
		
		Возврат ОписаниеСвойства.ЗначениеПоУмолчанию;
		
	КонецЕсли;
	
КонецФункции

//
//	Возвращает описание свойства элемента
//	КлассЭлемента - ЭлементВывода или ПолеДанных
Функция ПолучитьОписаниеСвойстваЭлемента(Настройка, Элемент, ИмяСвойства)
	
	РК = вмс_РаботаСКоллекциями;
	
	ДополнительныеДанные = Настройка.ДополнительныеДанные;
	
	КлассЭлемента = Элемент.КлассЭлемента;
	
	Если КлассЭлемента="ЭлементыВывода" Тогда
		
		ТипЭлементаВывода = Элемент.ТипЭлемента;
		ВидЭлементаВывода = Элемент.ВидЭлемента;
		ОписаниеСвойства = вмс_КонструкторФорм.ПолучитьСвойствоЭлементаФормы(ДополнительныеДанные.СведенияОТипахЭлементовВывода, ТипЭлементаВывода, ВидЭлементаВывода, ИмяСвойства);
		
	ИначеЕсли КлассЭлемента="ПоляДанных" Тогда
		
		ОписаниеСвойства = РК.НайтиЭлементКоллекции(ДополнительныеДанные.СведенияОСвойствахПолейОбработки, Новый Структура("ИмяСвойства", ИмяСвойства));
		
	ИначеЕсли КлассЭлемента="СборщикиДанных" Тогда
		
		ОписаниеСвойства = РК.НайтиЭлементКоллекции(ДополнительныеДанные.СведенияОСвойствахСборщиковДанных, Новый Структура("ИмяСвойства", ИмяСвойства));
		
	КонецЕсли;
	
	Возврат ОписаниеСвойства;
	
КонецФункции

Функция ПолучитьОписаниеСвойствЭлемента(Настройка, Элемент)
	
	ДополнительныеДанные = Настройка.ДополнительныеДанные;
	
	КлассЭлемента = Элемент.КлассЭлемента;
	
	Если КлассЭлемента="ЭлементыВывода" Тогда
		
		ТипЭлементаВывода = Элемент.ТипЭлемента;
		ВидЭлементаВывода = Элемент.ВидЭлемента;
		ОписаниеСвойств = вмс_КонструкторФорм.ПолучитьСвойстваЭлементаФормы(ДополнительныеДанные.СведенияОТипахЭлементовВывода, ТипЭлементаВывода, ВидЭлементаВывода);
		
	ИначеЕсли КлассЭлемента="ПоляДанных" Тогда
		
		ОписаниеСвойств = ДополнительныеДанные.СведенияОСвойствахПолейОбработки;
		
	ИначеЕсли КлассЭлемента="СборщикиДанных" Тогда
		
		ОписаниеСвойств = ДополнительныеДанные.СведенияОСвойствахСборщиковДанных;
		
	КонецЕсли;
	
	Возврат ОписаниеСвойств;
	
КонецФункции

Функция ЗагрузитьНастройку(Настройка, НастройкаИБ) Экспорт
	
	Настройка.ДополнительныеДанные.НастройкаИБ = НастройкаИБ;
	
	ОчиститьНастройку(Настройка);
	
	ОбщиеПоля = "Имя, Родитель, Номер, Зависимый";
	
	ЗагрузитьТаблицуЭлементов(Настройка, "ЭлементыВывода", ОбщиеПоля + ", ТипЭлемента, ВидЭлемента", Новый Структура("ВидЭлемента", ""));
	ЗагрузитьТаблицуЭлементов(Настройка, "ПоляДанных", ОбщиеПоля + ", ТипЭлемента");
	ЗагрузитьТаблицуЭлементов(Настройка, "СборщикиДанных", ОбщиеПоля);
	
	ЗаполнитьСсылкиЭлементов(Настройка);
	
КонецФункции

Функция ОчиститьНастройку(Настройка)

	РК = вмс_РаботаСКоллекциями;
	
	РК.ОчиститьЭлементыКоллекции(Настройка.ЭлементыВывода);
	РК.ОчиститьЭлементыКоллекции(Настройка.ПоляДанных);
	РК.ОчиститьЭлементыКоллекции(Настройка.СборщикиДанных);
	РК.ОчиститьЭлементыКоллекции(Настройка.ДополнительныеДанные.СсылкиЭлементов);
	
КонецФункции

Функция ЗагрузитьТаблицуЭлементов(Настройка, КлассЭлементов, знач ОбщиеСвойства=Неопределено, знач ЗначенияПоУмолчанию=Неопределено)
	
	РК = вмс_РаботаСКоллекциями;
	
	Элементы = Настройка[КлассЭлементов];
	РК.ОчиститьЭлементыКоллекции(Элементы);
	
	НастройкаИБ = Настройка.ДополнительныеДанные.НастройкаИБ;
	Если НастройкаИБ=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщиеСвойства <> Неопределено Тогда
		ОбщиеСвойства = РК.ЗначениеВМассив(ОбщиеСвойства, , Ложь);
	Иначе
		ОбщиеСвойства = Новый Массив;
	КонецЕсли;
	
	Если КлассЭлементов="СборщикиДанных" Тогда
		// временно
		ЭлементыИБ = НастройкаИБ.СборщикиДанных1;
	Иначе
		ЭлементыИБ = НастройкаИБ[КлассЭлементов];
	КонецЕсли;
	
	Если ЗначенияПоУмолчанию=Неопределено Тогда
		ЗначенияПоУмолчанию = Новый Структура;
	КонецЕсли;

	ПараметрыЧтенияXML = вмс_РаботаСXMLКлиентСервер.ПолучитьПараметрыЧтенияXML();
	ПоискПоПолномуИмени = Новый Структура("ПолноеИмя");
	Для Каждого ЗначениеСвойстваЭлементаИБ Из РК.ПолучитьЭлементыКоллекции(ЭлементыИБ) Цикл
		ПолноеИмяЭлемента = ЗначениеСвойстваЭлементаИБ.Имя;
		ИмяСвойства = ЗначениеСвойстваЭлементаИБ.Свойство;
		Если ЗначениеСвойстваЭлементаИБ.ЗначениеXML <> "" Тогда
			ЗначениеСвойстваЭлемента = ПрочитатьЗначениеСвойстваXML(ПараметрыЧтенияXML, ЗначениеСвойстваЭлементаИБ.ЗначениеXML);
		Иначе
			ЗначениеСвойстваЭлемента = ЗначениеСвойстваЭлементаИБ.Значение;
		КонецЕсли;

		ПоискПоПолномуИмени.ПолноеИмя = ПолноеИмяЭлемента;
		Элемент = РК.НайтиЭлементКоллекции(Элементы, ПоискПоПолномуИмени);
		Если Элемент=Неопределено Тогда
			Элемент = РК.ДобавитьЭлементКоллекции(Элементы, ПоискПоПолномуИмени);
			ИнициализироватьНовыйЭлемент(Элемент);
			ЗаполнитьЗначенияСвойств(Элемент, ЗначенияПоУмолчанию);
			Элемент.КлассЭлемента = КлассЭлементов;
		КонецЕсли;
		
		Если ОбщиеСвойства.Найти(ИмяСвойства) <> Неопределено Тогда
			Элемент[ИмяСвойства] = ЗначениеСвойстваЭлемента;
		КонецЕсли;
		Элемент.Свойства.Вставить(ИмяСвойства, ЗначениеСвойстваЭлемента);
	КонецЦикла;
	
	РК.ИндексироватьКоллекцию(Элементы);

	Для Каждого Элемент Из РК.ПолучитьЭлементыКоллекции(Элементы) Цикл
		УстановитьКартинкуЭлемента(Настройка, Элемент);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция УстановитьСвойствоЭлементов(Настройка, Элементы, ИмяСвойства, ЗначениеСвойства) Экспорт
	
	СвойстваУстановить = Новый Структура(ИмяСвойства, ЗначениеСвойства);
	
	Возврат УстановитьСвойстваЭлементов(Настройка, Элементы, СвойстваУстановить);
	
КонецФункции

Функция УстановитьСвойстваЭлементов(Настройка, Элементы, СвойстваУстановить) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	МассивЭлементов = РК.ЗначениеВМассив(Элементы);
	
	ЭлементыПриемникиПотерявшиеСвязь = НовыйСписокЭлементов();
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		
		Для Каждого СвойствоУстановить Из СвойстваУстановить Цикл
			
			ИмяСвойства = СвойствоУстановить.Ключ;
			ОписаниеСвойства = ПолучитьОписаниеСвойстваЭлемента(Настройка, Элемент, ИмяСвойства);
			Если ОписаниеСвойства=Неопределено Тогда
				ТекстОшибки = "У элемента """ + Элемент.Имя + """ (" + Элемент.КлассЭлемента + ")";
				ТекстОшибки = ТекстОшибки + " отсутствует свойство """ + ИмяСвойства + """";
				ВызватьИсключение(ТекстОшибки, , "ОшибкаИзмененияЭлементовНастройкиПолей");
				Продолжить;
			КонецЕсли;
			
			ЗначениеСвойства = СвойствоУстановить.Значение;
			Если ОписаниеСвойства.СписокВыбора <> Неопределено Тогда
				Если ОписаниеСвойства.СписокВыбора.НайтиПоЗначению(ЗначениеСвойства)=Неопределено Тогда
					ТекстОшибки = "Недопустимое значение свойства элемента";
					ТекстОшибки = ТекстОшибки + " """ + ИмяСвойства + """";
					ТекстОшибки = ТекстОшибки + " (" + ЗначениеСвойства + ")";
					ВызватьИсключение(ТекстОшибки, , "ОшибкаИзмененияЭлементовНастройкиПолей");
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ТипЗнч(ЗначениеСвойства)=Тип("Массив") Тогда
				Если ТипЗнч(ОписаниеСвойства.ЗначениеПоУмолчанию)=Тип("Строка") Тогда
					// список хранится строкой
					ЗначениеСвойства = РК.МассивВСтроку(ЗначениеСвойства);
				КонецЕсли;
			КонецЕсли;
			
			ПриУстановкеЗначенияСвойстваЭлемента(Настройка, Элемент, ОписаниеСвойства, ЗначениеСвойства);
			
			Если ЗначениеСвойства <> ОписаниеСвойства.ЗначениеПоУмолчанию Тогда
				Элемент.Свойства.Вставить(ИмяСвойства, ЗначениеСвойства);
			Иначе
				// не сохранять значения по умолчанию
				Элемент.Свойства.Удалить(ИмяСвойства);
			КонецЕсли;
			
			Если ЭтоСсылочныйТипНаЭлементНастройки(ОписаниеСвойства.Тип) Тогда
				РезультатЗаполненияСсылок = ЗаполнитьСсылкиЭлементов(Настройка, Элемент, ИмяСвойства);
				РК.ДобавитьЭлементыКоллекции(ЭлементыПриемникиПотерявшиеСвязь, РезультатЗаполненияСсылок.ЭлементыПриемникиПотерявшиеСвязь);
			КонецЕсли;

		КонецЦикла;
		
	КонецЦикла;
	
	УдалитьДублиСпискаЭлементов(ЭлементыПриемникиПотерявшиеСвязь);
	
	ЗависимыеЭлементыБезСсылокНаНих = ОтобратьЗависимыеЭлементыБезСсылокНаНих(Настройка, ЭлементыПриемникиПотерявшиеСвязь);
	РезультатУдаленияЭлементов = УдалитьЭлементы(Настройка, ЗависимыеЭлементыБезСсылокНаНих);
	
	Возврат РезультатУдаленияЭлементов;

КонецФункции

Функция ПриУстановкеЗначенияСвойстваЭлемента(Настройка, Элемент, ОписаниеСвойства, ЗначениеСвойства)

	Если ОписаниеСвойства.ОбработчикУстановкиЗначения <> Неопределено Тогда
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("Настройка", Настройка);
		ПараметрыОбработчика.Вставить("Элемент", Элемент);
		ПараметрыОбработчика.Вставить("ОписаниеСвойства", ОписаниеСвойства);
		ПараметрыОбработчика.Вставить("ЗначениеСвойства", ЗначениеСвойства);
		ПараметрыОбработчика.Вставить("СтандартнаяОбработка", Истина);
		вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьОбработкуОповещенияПереопределенный(ОписаниеСвойства.ОбработчикУстановкиЗначения, ПараметрыОбработчика);
		Если НЕ ПараметрыОбработчика.СтандартнаяОбработка Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИмяСвойства = ОписаниеСвойства.ИмяСвойства;
	
	Если ИмяСвойства="Имя" Тогда
		ПриУстановкеИмениЭлемента(Настройка, Элемент, ЗначениеСвойства);
	ИначеЕсли ИмяСвойства="Вид" Тогда
		ПриУстановкеВидаЭлемента(Настройка, Элемент, ЗначениеСвойства);
	ИначеЕсли ИмяСвойства="ТипЗначения" Тогда
		ПриУстановкеТипаЗначенияЭлемента(Настройка, Элемент, ЗначениеСвойства);
	ИначеЕсли ИмяСвойства="Зависимый" Тогда
		ПриИзмененииСвойстваЗависмый(Настройка, Элемент, ЗначениеСвойства);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПриУстановкеИмениЭлемента(Настройка, Элемент, НовоеИмя)
	
	Если Элемент.Имя=НовоеИмя Тогда
		// обработка не требуется
		Возврат Истина;
	КонецЕсли;
	
	Если Элемент.КлассЭлемента="ПоляДанных" Тогда
		НовоеПолноеИмя = ?(ЗначениеЗаполнено(Элемент.Родитель), Элемент.Родитель + ".", "") + ВРЕГ(НовоеИмя);
	Иначе
		НовоеПолноеИмя = ВРЕГ(НовоеИмя);
	КонецЕсли;
	
	Если Элемент.ПолноеИмя <> НовоеПолноеИмя Тогда
		
		РК = вмс_РаботаСКоллекциями;
		
		Элементы = Настройка[Элемент.КлассЭлемента];

		ПроверитьИмяЭлемента(Элементы, НовоеИмя, НовоеПолноеИмя);
		
		ПрежнееПолноеИмя = Элемент.ПолноеИмя;

		ОбходЭлементов = Новый Массив;
		ОбходЭлементов.Добавить(Элемент);
		
		Элемент.Имя = НовоеИмя;
		Если Элемент.КлассЭлемента="ПоляДанных" Тогда
			ОсновнойЭлемент = Элемент;
			Для Каждого Элемент Из ОбходЭлементов Цикл
				ПодчиненныеЭлементы = ПолучитьПодчиненныеЭлементы(Настройка, Элемент);
				Элемент.ПолноеИмя = ?(ЗначениеЗаполнено(Элемент.Родитель), Элемент.Родитель + ".", "") + ВРЕГ(Элемент.Имя);
				Для Каждого ПодчиненныйЭлемент Из ПодчиненныеЭлементы Цикл
					ПодчиненныйЭлемент.Родитель = Элемент.ПолноеИмя;
					ПодчиненныйЭлемент.Свойства.Вставить("Родитель", ПодчиненныйЭлемент.Родитель);
					ОбходЭлементов.Добавить(ПодчиненныйЭлемент);
				КонецЦикла;
			КонецЦикла;
			Элемент = ОсновнойЭлемент;
		Иначе
			ПодчиненныеЭлементы = ПолучитьПодчиненныеЭлементы(Настройка, Элемент);
			Элемент.ПолноеИмя = ВРЕГ(Элемент.Имя);
			Для Каждого ПодчиненныйЭлемент Из ПодчиненныеЭлементы Цикл
				ПодчиненныйЭлемент.Родитель = Элемент.ПолноеИмя;
				ПодчиненныйЭлемент.Свойства.Вставить("Родитель", ПодчиненныйЭлемент.Родитель);
				ОбходЭлементов.Добавить(ПодчиненныйЭлемент);
			КонецЦикла;
		КонецЕсли;
		РК.ИндексироватьКоллекцию(Элементы, ОбходЭлементов);

		ОбновитьСвязиПриПереименованииЭлемента(Настройка, Элемент, ПрежнееПолноеИмя);
		
	Иначе
		
		Элемент.Имя = НовоеИмя;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПодчиненныеЭлементы(Настройка, Элемент=Неопределено, Рекурсивно=Ложь) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	Элементы = Настройка[Элемент.КлассЭлемента];
	
	ПодчиненныеЭлементы = Новый Массив;
	
	ПоискПоРодителю = Новый Структура("Родитель");
	Если Элемент <> Неопределено Тогда
		ПоискПоРодителю.Родитель = Элемент.ПолноеИмя;
	КонецЕсли;
	ПодчиненныеЭлементы = РК.НайтиЭлементыКоллекции(Элементы, ПоискПоРодителю);

	Если Рекурсивно Тогда
		Для Каждого ПодчиненныйЭлемент Из ПодчиненныеЭлементы Цикл
			ПоискПоРодителю.Родитель = ПодчиненныйЭлемент.ПолноеИмя;
			ПодчиненныеЭлементыСледующегоУровня = РК.НайтиЭлементыКоллекции(Элементы, ПоискПоРодителю);
			РК.ДобавитьЭлементыКоллекции(ПодчиненныеЭлементы, ПодчиненныеЭлементыСледующегоУровня);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПодчиненныеЭлементы;
	
КонецФункции

Функция ПриУстановкеВидаЭлемента(Настройка, Элемент, НовыйВид)
	
	Если Элемент.КлассЭлемента="ЭлементыВывода" Тогда
		
		ВидЭлемента = Настройка.ДополнительныеДанные.СведенияОТипахЭлементовВывода.ВидыЭлементовПоЗначениям[НовыйВид].ВидЭлемента;
		
		Элемент.ВидЭлемента = ВидЭлемента;
		Элемент.Свойства.Вставить("ВидЭлемента", ВидЭлемента);
		
		ПриИзмененииТипаЭлемента(Настройка, Элемент);
		
	КонецЕсли;
	
КонецФункции

Функция ПриУстановкеТипаЗначенияЭлемента(Настройка, Элемент, НовыйТипЗначения)

	Если Элемент.КлассЭлемента="ПоляДанных" Тогда
		ТипЭлемента = ТипПоляДанных(НовыйТипЗначения);
		Элемент.ТипЭлемента = ТипЭлемента;
		Элемент.Свойства.Вставить("ТипЭлемента", ТипЭлемента);
		ПриИзмененииТипаЭлемента(Настройка, Элемент);
	КонецЕсли;
		
КонецФункции

Функция ПриИзмененииТипаЭлемента(Настройка, Элемент)
	
	УстановитьКартинкуЭлемента(Настройка, Элемент);
	
КонецФункции

Функция ПриИзмененииСвойстваЗависмый(Настройка, Элемент, ЗначениеСвойства)
	Элемент.Зависимый = ЗначениеСвойства;
	УстановитьКартинкуЭлемента(Настройка, Элемент);
КонецФункции

Функция СтраницаВводаДанных_ПриУстановкеСборщиковДанных(Параметры, ДополнительныеПараметры) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	Настройка = Параметры.Настройка;
	Элемент = Параметры.Элемент;
	ИмяСвойства = Параметры.ОписаниеСвойства.ИмяСвойства;
	НовыеСборщики = РК.ЗначениеВМассив(Параметры.ЗначениеСвойства);
	Параметры.СтандартнаяОбработка = Ложь;
	
	ПредыдущиеСборщики = ПолучитьСписокЗначенийСвойстваЭлемента(Настройка, Элемент, ИмяСвойства);
	
	УдаляемыеСборщики = РК.ВычитаниеМассивов(ПредыдущиеСборщики, НовыеСборщики);
	ДобавляемыеСборщики = РК.ВычитаниеМассивов(НовыеСборщики, ПредыдущиеСборщики);
	
	Если УдаляемыеСборщики.Количество()=0 И ДобавляемыеСборщики.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭлементыВывода = ПолучитьПодчиненныеЭлементы(Настройка, Элемент, Истина);
	ПоляДанных = ОтобратьПоляДанных(Настройка, ЭлементыВывода);
	Если ПоляДанных.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаИзмененияСборщиков = РК.НоваяКоллекцияЗначений("ИмяСборщика, ИмяПоля, Изменение");
	Для Каждого ИмяСборщика Из УдаляемыеСборщики Цикл
		Для Каждого ПолеДанных Из ПоляДанных Цикл
			РК.ДобавитьЭлементКоллекции(ТаблицаИзмененияСборщиков, Новый Структура("ИмяСборщика, ИмяПоля, Изменение", ИмяСборщика, ПолеДанных.ПолноеИмя, -1));
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ИмяСборщика Из ДобавляемыеСборщики Цикл
		Для Каждого ПолеДанных Из ПоляДанных Цикл
			РК.ДобавитьЭлементКоллекции(ТаблицаИзмененияСборщиков, Новый Структура("ИмяСборщика, ИмяПоля, Изменение", ИмяСборщика, ПолеДанных.ПолноеИмя, 1));
		КонецЦикла;
	КонецЦикла;
	
	ИзменитьСоставПолейДанныхСборщиков(Настройка, ТаблицаИзмененияСборщиков);
	ПриИзмененииПорядкаЭлементовВыводаПолейДанных(Настройка, ЭлементыВывода);
	Возврат Истина;
	
КонецФункции

Функция ПриИзмененииРодителейЭлементов(Настройка, ИзмененныеЭлементы) Экспорт

	ИзмененныеПоляДанных = ОтобратьПоляДанных(Настройка, ИзмененныеЭлементы);
	Если ИзмененныеПоляДанных.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаИзмененияСборщиковПолейДанных = ПолучитьТаблицуИзмененияСборщиковПолейДанныхПриПеремещенииЭлементовВывода(Настройка, ИзмененныеПоляДанных);
	
	ИзменитьСоставПолейДанныхСборщиков(Настройка, ТаблицаИзмененияСборщиковПолейДанных);
	
	Возврат Истина;
	
КонецФункции

Функция ПриИзмененииПорядкаЭлементовВыводаПолейДанных(Настройка, ИзмененныеЭлементы) Экспорт

	ИзмененныеПоляДанных = ОтобратьПоляДанных(Настройка, ИзмененныеЭлементы);
	Если ИзмененныеПоляДанных.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СборщикиДанных = ПолучитьСборщикиДанныхПоПолямДанных(Настройка, ИзмененныеПоляДанных);
	Если СборщикиДанных.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПоляДанных = ПолучитьПоляДанныхСборщиковДанных(Настройка, СборщикиДанных);
	
	ПорядокПолейДанных = ПолучитьПорядокПолейДанныхПоЭлементамВывода(Настройка, ПоляДанных);
	Если ПорядокПолейДанных.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИзменитьПорядокПолейДанныхСборщиковДанных(Настройка, СборщикиДанных, ПорядокПолейДанных);
	
	Возврат Истина;
	
КонецФункции

Функция ИзменитьПорядокПолейДанныхСборщиковДанных(Настройка, СборщикиДанных, ПорядокПолейДанных)
	
	РК = вмс_РаботаСКоллекциями;

	Для Каждого СборщикДанных Из СборщикиДанных Цикл
		
		ПоляСборщика = СборщикДанных.ДополнительныеДанные.ПоляДанных;
		
		// список мест для полей, которые будут участвовать в упорядочивании (также могут быть поля, которые не участвуют (не выведены на форму с помощью связанного элемента вывода))
		ГнездаПолейДанных = Новый Массив;
		ИндексПоля = 0;
		Для Каждого ПолеСборщика Из ПоляСборщика Цикл
			Если ПорядокПолейДанных.Найти(ПолеСборщика) <> Неопределено Тогда
				ГнездаПолейДанных.Добавить(ИндексПоля);
			КонецЕсли;
			ИндексПоля = ИндексПоля + 1;
		КонецЦикла;
		
		УпорядоченныеПоляСборщика = РК.ПересечениеМассивов(ПорядокПолейДанных, ПоляСборщика);
		
		НомерГнезда = 0;
		Для Каждого ПолеСборщика Из УпорядоченныеПоляСборщика Цикл
			ИндексПоля = ГнездаПолейДанных[НомерГнезда];
			ПоляСборщика[ИндексПоля] = ПолеСборщика;
			НомерГнезда = НомерГнезда + 1;
		КонецЦикла;
		
		ИменаПолейСборщикаМассив = РК.ВыгрузитьЗначенияКолонкиКоллекции(ПоляСборщика, "ПолноеИмя");
		ИменаПолейСборщика = РК.МассивВСтроку(ИменаПолейСборщикаМассив);
		
		СборщикДанных.Свойства.Вставить("Поля", ИменаПолейСборщика);
		
	КонецЦикла;
	
КонецФункции

// Отбирает по элементам вывода связанные поля данных
// Также заполняет свзяь поля данных и элемента вывода
Функция ОтобратьПоляДанных(Настройка, Элементы)

	РК = вмс_РаботаСКоллекциями;
	
	СсылкиЭлементов = Настройка.ДополнительныеДанные.СсылкиЭлементов;
	ОтборЭлемента = Новый Структура("ПолноеИмя");
	
	//
	ПоляДанных = Новый Массив;
	
	ОтборСвязей = Новый Структура("ЭлементПриемник, КлассЭлементаПриемника");
	Для Каждого Элемент Из Элементы Цикл
		
		Если Элемент.КлассЭлемента="ЭлементыВывода" Тогда
			
			Если Элемент.Зависимый Тогда
				ОтборСвязей.ЭлементПриемник = Элемент.ПолноеИмя;
				ОтборСвязей.КлассЭлементаПриемника = Элемент.КлассЭлемента;

				Связи = РК.НайтиЭлементыКоллекции(СсылкиЭлементов, ОтборСвязей);
				Для Каждого Связь Из Связи Цикл
					
					Если Связь.КлассЭлементаИсточника="ПоляДанных" Тогда
						ОтборЭлемента.ПолноеИмя = Связь.ЭлементИсточник;
						ПолеДанных = РК.НайтиЭлементКоллекции(Настройка[Связь.КлассЭлементаИсточника], ОтборЭлемента);
						ПолеДанных.ДополнительныеДанные.Вставить("ПолеВвода", Элемент);
						ПоляДанных.Добавить(ПолеДанных);
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РК.УдалитьДублиВМассиве(ПоляДанных);
	
	Возврат ПоляДанных;
	
КонецФункции

Функция ПолучитьТаблицуИзмененияСборщиковПолейДанныхПриПеремещенииЭлементовВывода(Настройка, ПоляДанных)

	РК = вмс_РаботаСКоллекциями;
	
	ПоляВвода = Новый Массив;
	Для Каждого ПолеДанных Из ПоляДанных Цикл
		ПоляВвода.Добавить(ПолеДанных.ДополнительныеДанные.ПолеВвода);
	КонецЦикла;
	
	Предыдущие = Истина;
	Для Номер=1 По 2 Цикл
		ЗаполнитьСтраницыВводаПолейВвода(Настройка, ПоляВвода, Предыдущие);

		Для Каждого ПолеДанных Из ПоляДанных Цикл
			ПолеВвода = ПолеДанных.ДополнительныеДанные.ПолеВвода;
			
			СтраницаВвода = ПолеВвода.ДополнительныеДанные.СтраницаВвода;
			СборщикиДанных = Неопределено;
			Если СтраницаВвода <> Неопределено Тогда
				СтраницаВвода.Свойства.Свойство("СборщикиДанных", СборщикиДанных);
			КонецЕсли;
			
			Если СборщикиДанных=Неопределено Тогда
				СборщикиДанных = Новый Массив;
			Иначе
				СборщикиДанных = РК.ЗначениеВМассив(СборщикиДанных);
			КонецЕсли;

			Если Предыдущие Тогда
				ПолеДанных.ДополнительныеДанные.Вставить("ПредыдущиеСборщикиДанных", СборщикиДанных);
			Иначе
				ПолеДанных.ДополнительныеДанные.Вставить("СборщикиДанных", СборщикиДанных);
			КонецЕсли;
		КонецЦикла;
		
		Предыдущие = Ложь;
	КонецЦикла;
	
	ТаблицаИзмененияСборщиков = РК.НоваяКоллекцияЗначений("ИмяСборщика, ИмяПоля, Изменение");
	Для Каждого ПолеДанных Из ПоляДанных Цикл
		ИмяПоля = ПолеДанных.ПолноеИмя;
		УдаляемыеСборщики = РК.ВычитаниеМассивов(ПолеДанных.ДополнительныеДанные.ПредыдущиеСборщикиДанных, ПолеДанных.ДополнительныеДанные.СборщикиДанных);
		Для Каждого УдаляемыйСборщик Из УдаляемыеСборщики Цикл
			РК.ДобавитьЭлементКоллекции(ТаблицаИзмененияСборщиков, Новый Структура("ИмяСборщика, ИмяПоля, Изменение", УдаляемыйСборщик, ИмяПоля, -1));
		КонецЦикла;

		ДобавляемыеСборщики = РК.ВычитаниеМассивов(ПолеДанных.ДополнительныеДанные.СборщикиДанных, ПолеДанных.ДополнительныеДанные.ПредыдущиеСборщикиДанных);
		Для Каждого ДобавляемыйСборщик Из ДобавляемыеСборщики Цикл
			РК.ДобавитьЭлементКоллекции(ТаблицаИзмененияСборщиков, Новый Структура("ИмяСборщика, ИмяПоля, Изменение", ДобавляемыйСборщик, ИмяПоля, 1));
		КонецЦикла;
	КонецЦикла;
	
	РК.ДобавитьИндексКоллекции(ТаблицаИзмененияСборщиков, "ИмяСборщика");
	
	Возврат ТаблицаИзмененияСборщиков;

КонецФункции

Функция ПолучитьСборщикиДанныхПоПолямДанных(Настройка, ПоляДанных)

	РК = вмс_РаботаСКоллекциями;
	
	СсылкиЭлементов = Настройка.ДополнительныеДанные.СсылкиЭлементов;
	
	СборщикиДанных = Новый Массив;

	ОтборСвязей = Новый Структура("ЭлементПриемник, КлассЭлементаПриемника");
	ОтборСвязей.КлассЭлементаПриемника = "ПоляДанных";
	
	ОтборЭлемента = Новый Структура("ПолноеИмя");
	
	Для Каждого ПолеДанных Из ПоляДанных Цикл
		ОтборСвязей.ЭлементПриемник = ПолеДанных.ПолноеИмя;
		Связи = РК.НайтиЭлементыКоллекции(СсылкиЭлементов, ОтборСвязей);

		Для Каждого Связь Из Связи Цикл
			
			Если Связь.КлассЭлементаИсточника="СборщикиДанных" Тогда
				ОтборЭлемента.ПолноеИмя = Связь.ЭлементИсточник;
				СборщикДанныхМассив = РК.НайтиЭлементыКоллекции(Настройка[Связь.КлассЭлементаИсточника], ОтборЭлемента);
				РК.ДобавитьЭлементыКоллекции(СборщикиДанных, СборщикДанныхМассив);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	РК.УдалитьДублиВМассиве(СборщикиДанных);
	
	Возврат СборщикиДанных;
	
КонецФункции

Функция ПолучитьПоляДанныхСборщиковДанных(Настройка, СборщикиДанных)

	РК = вмс_РаботаСКоллекциями;
	
	ПоляДанных = Новый Массив;
	
	ОтборЭлемента = Новый Структура("ПолноеИмя");
	
	Для Каждого СборщикДанных Из СборщикиДанных Цикл
		
		ИменаПолейСборщика = Неопределено;
		СборщикДанных.Свойства.Свойство("Поля", ИменаПолейСборщика);
		Если ИменаПолейСборщика <> Неопределено Тогда
			ИменаПолейСборщикаМассив = РК.ЗначениеВМассив(ИменаПолейСборщика);
		Иначе
			ИменаПолейСборщикаМассив = Новый Массив;
		КонецЕсли;
		
		ПоляДанныхСборщика = Новый Массив;
		Для Каждого ИмяПоляСборщика Из ИменаПолейСборщикаМассив Цикл
			ОтборЭлемента.ПолноеИмя = ИмяПоляСборщика;
			ПолеДанныхМассив = РК.НайтиЭлементыКоллекции(Настройка.ПоляДанных, ОтборЭлемента);
			РК.ДобавитьЭлементыКоллекции(ПоляДанныхСборщика, ПолеДанныхМассив);
		КонецЦикла;
		
		СборщикДанных.ДополнительныеДанные.Вставить("ПоляДанных", ПоляДанныхСборщика);

		РК.ДобавитьЭлементыКоллекции(ПоляДанных, ПоляДанныхСборщика);
		
	КонецЦикла;
	
	РК.УдалитьДублиВМассиве(ПоляДанных);
	
	Возврат ПоляДанных;
	
КонецФункции

Функция ИзменитьСоставПолейДанныхСборщиков(Настройка, ТаблицаИзмененияСборщиковПолейДанных)
	
	РК = вмс_РаботаСКоллекциями;
	НПЗ = вмс_НастройкиПолейЗадания1;
	
	РК.ДобавитьИндексКоллекции(ТаблицаИзмененияСборщиковПолейДанных, "ИмяСборщика");
	ТаблицаСборщиков = РК.СкопироватьКоллекцию(ТаблицаИзмененияСборщиковПолейДанных);
	РК.СвернутьКоллекциюЗначений(ТаблицаСборщиков, "ИмяСборщика");
	
	ОтборЭлемента = Новый Структура("ПолноеИмя");
	Для Каждого ЭлементСборщика Из РК.ПолучитьЭлементыКоллекции(ТаблицаСборщиков) Цикл
		ОтборЭлемента.ПолноеИмя = ЭлементСборщика.ИмяСборщика;
		СборщикДанных = РК.НайтиЭлементКоллекции(Настройка.СборщикиДанных, ОтборЭлемента);
		ИзмененияПолейСборщика = РК.НайтиЭлементыКоллекции(ТаблицаИзмененияСборщиковПолейДанных, Новый Структура("ИмяСборщика", ЭлементСборщика.ИмяСборщика));
		УдаляемыеПоляСборщика = Новый Массив;
		ДобавляемыеПоляСборщика = Новый Массив;
		Для Каждого ИзменениеПоляСборщика Из ИзмененияПолейСборщика Цикл
			Если ИзменениеПоляСборщика.Изменение=-1 Тогда
				УдаляемыеПоляСборщика.Добавить(ИзменениеПоляСборщика.ИмяПоля);
			ИначеЕсли ИзменениеПоляСборщика.Изменение=1 Тогда
				ДобавляемыеПоляСборщика.Добавить(ИзменениеПоляСборщика.ИмяПоля);
			КонецЕсли;
		КонецЦикла;

		ПоляСборщика = НПЗ.ПолучитьСписокЗначенийСвойстваЭлемента(Настройка, СборщикДанных, "Поля");
		РК.ВычестьМассив(ПоляСборщика, УдаляемыеПоляСборщика);
		РК.ДобавитьЭлементыКоллекции(ПоляСборщика, ДобавляемыеПоляСборщика);
		РК.УдалитьДублиВМассиве(ПоляСборщика);
		НПЗ.УстановитьСвойствоЭлементов(Настройка, СборщикДанных, "Поля", ПоляСборщика);
	КонецЦикла;
	
КонецФункции

Функция ЗаполнитьСтраницыВводаПолейВвода(Настройка, ПоляВвода, Предыдущие)
	
	РК = вмс_РаботаСКоллекциями;

	Для Каждого ПолеВвода Из ПоляВвода Цикл
		ПолеВвода.ДополнительныеДанные.Вставить("СтраницаВвода");
	КонецЦикла;
	
	ИерархияЭлементов = ПолучитьИерархиюЭлементов(Настройка, ПоляВвода, Предыдущие);
	ТаблицаБлизостиЭлементов = РК.ПостроитьТаблицуБлизостиЭлементов(ИерархияЭлементов, "Родитель", "Элемент");
	Для Каждого СтрокаБлизости Из РК.ПолучитьЭлементыКоллекции(ТаблицаБлизостиЭлементов) Цикл
		Если СтрокаБлизости.Основной Тогда
			Родитель = СтрокаБлизости.Родитель;
			Если Родитель <> Неопределено И Родитель.ТипЭлемента="ГруппаФормы" И Родитель.ВидЭлемента="СтраницаВводаДанных" Тогда
				ПолеВвода = СтрокаБлизости.Элемент;
				ПолеВвода.ДополнительныеДанные.СтраницаВвода = Родитель;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьПорядокПолейДанныхПоЭлементамВывода(Настройка, ПоляДанных)

	РК = вмс_РаботаСКоллекциями;
	
	СсылкиЭлементов = Настройка.ДополнительныеДанные.СсылкиЭлементов;
	
	ОтборСвязей = Новый Структура("ЭлементИсточник, КлассЭлементаИсточника, ИмяСвойства");
	ОтборСвязей.ИмяСвойства = Неопределено;
	
	ОтборЭлемента = Новый Структура("ПолноеИмя");
	
	ЭлементыВывода = Новый Массив;
	Для Каждого ПолеДанных Из ПоляДанных Цикл
		ОтборСвязей.ЭлементИсточник = ПолеДанных.ПолноеИмя;
		ОтборСвязей.КлассЭлементаИсточника = ПолеДанных.КлассЭлемента;
		Связи = РК.НайтиЭлементыКоллекции(СсылкиЭлементов, ОтборСвязей);
		Для Каждого Связь Из Связи Цикл
			Если Связь.КлассЭлементаПриемника="ЭлементыВывода" Тогда
				ОтборЭлемента.ПолноеИмя = Связь.ЭлементПриемник;
				ЭлементВывода = РК.НайтиЭлементКоллекции(Настройка[Связь.КлассЭлементаПриемника], ОтборЭлемента);
				Если ЭлементВывода <> Неопределено Тогда
					ЭлементВывода.ДополнительныеДанные.Вставить("ПолеДанных", ПолеДанных);
					ЭлементыВывода.Добавить(ЭлементВывода);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	РК.УдалитьДублиВМассиве(ЭлементыВывода);
	
	ИерархияЭлементовВывода = ПолучитьИерархиюЭлементов(Настройка, ЭлементыВывода);
	
	ПорядокПолейДанных = Новый Массив;

	Для Каждого ИерархияЭлементаВывода Из РК.ПолучитьЭлементыКоллекции(ИерархияЭлементовВывода) Цикл
		Если НЕ ИерархияЭлементаВывода.Основной Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементВывода = ИерархияЭлементаВывода.Элемент;
		ПолеДанных = ЭлементВывода.ДополнительныеДанные.ПолеДанных;
		ПорядокПолейДанных.Добавить(ПолеДанных);
	КонецЦикла;
	
	РК.УдалитьДублиВМассиве(ПорядокПолейДанных);
	
	Возврат ПорядокПолейДанных;
	
КонецФункции

Функция ПолучитьИерархиюЭлементов(Настройка, Элементы, ПоПредыдущимРодителям=Ложь) Экспорт

	РК = вмс_РаботаСКоллекциями;

	ИерархияЭлементов = РК.НоваяКоллекцияЗначений("Родитель, Элемент, Номер, Основной");
	РК.ДобавитьИндексКоллекции(ИерархияЭлементов, "Элемент");

	ОтборЭлементаВИерархии = Новый Структура("Элемент");
	Для Каждого Элемент Из РК.ЗначениеВМассив(Элементы) Цикл
		ОтборЭлементаВИерархии.Элемент = Элемент;
		ИерархияЭлемента = РК.НайтиЭлементКоллекции(ИерархияЭлементов, ОтборЭлементаВИерархии);
		Если ИерархияЭлемента <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ИерархияЭлемента = РК.ДобавитьЭлементКоллекции(ИерархияЭлементов, ОтборЭлементаВИерархии);
		ИерархияЭлемента.Номер = Элемент.Номер;
		ИерархияЭлемента.Основной = Истина;
	КонецЦикла;
	
	ОтборЭлемента = Новый Структура("ПолноеИмя");
	Для Каждого ИерархияЭлемента Из РК.ПолучитьЭлементыКоллекции(ИерархияЭлементов) Цикл
		Элемент = ИерархияЭлемента.Элемент;
		Если Элемент.Родитель <> Неопределено Тогда
			Если ПоПредыдущимРодителям И Элемент.ДополнительныеДанные.Свойство("ПредыдущийРодитель") Тогда
				ОтборЭлемента.ПолноеИмя = Элемент.ДополнительныеДанные.ПредыдущийРодитель;
			Иначе
				ОтборЭлемента.ПолноеИмя = Элемент.Родитель;
			КонецЕсли;
			РодительМассив = РК.НайтиЭлементыКоллекции(Настройка[Элемент.КлассЭлемента], ОтборЭлемента);
			Для Каждого Родитель Из РодительМассив Цикл
				ИерархияЭлемента.Родитель = Родитель;
				ОтборЭлементаВИерархии.Элемент = Родитель;
				ИерархияРодителя = РК.НайтиЭлементКоллекции(ИерархияЭлементов, ОтборЭлементаВИерархии);
				Если ИерархияРодителя=Неопределено Тогда
					ИерархияРодителя = РК.ДобавитьЭлементКоллекции(ИерархияЭлементов, ОтборЭлементаВИерархии);
					ИерархияРодителя.Номер = Родитель.Номер;
					ИерархияРодителя.Основной = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	РК.ДобавитьИндексКоллекции(ИерархияЭлементов, "Родитель");
	
	ОтборПоРодителю = Новый Структура("Родитель");
	ОтборПоРодителю.Родитель = Неопределено;
	ПорядокЭлементовСИерархией = РК.НайтиЭлементыКоллекции(ИерархияЭлементов, ОтборПоРодителю);
	
	НомерРодителя = 0;
	Для Каждого ИерархияРодителя Из ПорядокЭлементовСИерархией Цикл
		ОтборПоРодителю.Родитель = ИерархияРодителя.Элемент;
		ИерархияЭлементовРодителя = РК.НайтиЭлементыКоллекции(ИерархияЭлементов, ОтборПоРодителю);
		РК.СортироватьКоллекцию(ИерархияЭлементовРодителя, "Номер");
		Для НомерЭлемента=0 По ИерархияЭлементовРодителя.Количество()-1 Цикл
			ПорядокЭлементовСИерархией.Вставить(НомерРодителя+НомерЭлемента+1, ИерархияЭлементовРодителя[НомерЭлемента]);
		КонецЦикла;
		НомерРодителя = НомерРодителя + 1;
	КонецЦикла;
	
	РК.УпорядочитьЭлементыКоллекцииЗначенийПоМассиву(ИерархияЭлементов, ПорядокЭлементовСИерархией);

	Возврат ИерархияЭлементов;
	
КонецФункции

Функция ЗаполнитьСсылкиЭлементов(Настройка, знач ЭлементыИсточники=Неопределено, ИменаСвойств=Неопределено) Экспорт
	
	РК = вмс_РаботаСКоллекциями;

	Если ЭлементыИсточники=Неопределено Тогда
		ЭлементыИсточники = ВсеЭлементы(Настройка);
	Иначе
		ЭлементыИсточники = РК.ЗначениеВМассив(ЭлементыИсточники, , Ложь);
	КонецЕсли;
	
	СсылкиЭлементов = Настройка.ДополнительныеДанные.СсылкиЭлементов;
	
	ЭлементыПриемникиПотерявшиеСвязь = НовыйСписокЭлементов();
	
	КлючевыеДанныеСвязи = Новый Структура("ЭлементИсточник, КлассЭлементаИсточника, ИмяСвойства, ЭлементПриемник, КлассЭлементаПриемника");
	ОтборТекущихСвязей = Новый Структура("ЭлементИсточник, КлассЭлементаИсточника, ИмяСвойства");
	ДополнительныеДанныеСвязи = Новый Структура("СлабаяСсылка");
	
	Если ИменаСвойств <> Неопределено Тогда
		ИменаСвойствМассив = РК.ЗначениеВМассив(ИменаСвойств, , Ложь);
	КонецЕсли;

	Для Каждого ЭлементИсточник Из ЭлементыИсточники Цикл
		
		КлючевыеДанныеСвязи.ЭлементИсточник = ЭлементИсточник.ПолноеИмя;
		КлючевыеДанныеСвязи.КлассЭлементаИсточника = ЭлементИсточник.КлассЭлемента;
		
		ОтборТекущихСвязей.ЭлементИсточник = ЭлементИсточник.ПолноеИмя;
		ОтборТекущихСвязей.КлассЭлементаИсточника = ЭлементИсточник.КлассЭлемента;

		КлючевыеДанныеОбратнойСвязи = Новый Структура("ЭлементИсточник, КлассЭлементаИсточника, ИмяСвойства, ЭлементПриемник, КлассЭлементаПриемника");
		КлючевыеДанныеОбратнойСвязи.ЭлементПриемник = ЭлементИсточник.ПолноеИмя;
		КлючевыеДанныеОбратнойСвязи.КлассЭлементаПриемника = ЭлементИсточник.КлассЭлемента;
		
		Если ИменаСвойствМассив <> Неопределено Тогда
			
			ОписанияСвойств = Новый Массив;
			
			Для Каждого ИмяСвойства Из ИменаСвойствМассив Цикл
				ОписаниеСвойства = ПолучитьОписаниеСвойстваЭлемента(Настройка, ЭлементИсточник, ИмяСвойства);
				Если ОписаниеСвойства <> Неопределено Тогда
					ОписанияСвойств.Добавить(ОписаниеСвойства);
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			ОписанияСвойств = РК.ПолучитьЭлементыКоллекции(ПолучитьОписаниеСвойствЭлемента(Настройка, ЭлементИсточник));
			
		КонецЕсли;
		
		СвойстваЭлемента = ЭлементИсточник.Свойства;

		Для Каждого ОписаниеСвойства Из ОписанияСвойств Цикл
			
			ИмяСвойства = ОписаниеСвойства.ИмяСвойства;
			
			КлассЭлементовЗначенияСвойства = Неопределено;
			Если НЕ ЭтоСсылочныйТипНаЭлементНастройки(ОписаниеСвойства.Тип, КлассЭлементовЗначенияСвойства) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеСвойства = Неопределено;
			Если НЕ СвойстваЭлемента.Свойство(ИмяСвойства, ЗначениеСвойства) Тогда
				ЗначениеСвойства = ОписаниеСвойства.ЗначениеПоУмолчанию;
			КонецЕсли;
			
			Если ЗначениеСвойства=Неопределено Тогда
				ЗначениеСвойстваМассив = Новый Массив;
			Иначе
				ЗначениеСвойстваМассив = РК.ЗначениеВМассив(ЗначениеСвойства);
			КонецЕсли;
			
			КлючевыеДанныеСвязи.ИмяСвойства = ИмяСвойства;
			КлючевыеДанныеСвязи.КлассЭлементаПриемника = КлассЭлементовЗначенияСвойства;
			ДополнительныеДанныеСвязи.СлабаяСсылка = ОписаниеСвойства.СлабаяСсылка;
			
			УстановленныеСвязи = Новый Соответствие;
			СписокНовыхСвязей = Новый Массив;
			Для Каждого ИмяЭлементаПриемника Из ЗначениеСвойстваМассив Цикл
				КлючевыеДанныеСвязи.ЭлементПриемник = ИмяЭлементаПриемника;
				Связь = РК.НайтиЭлементКоллекции(СсылкиЭлементов, КлючевыеДанныеСвязи);
				Если Связь=Неопределено Тогда
					Связь = РК.ДобавитьЭлементКоллекции(СсылкиЭлементов, КлючевыеДанныеСвязи);
					СписокНовыхСвязей.Добавить(Связь);
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(Связь, ДополнительныеДанныеСвязи);
				УстановленныеСвязи[Связь] = Истина;
			КонецЦикла;
			
			ОтборТекущихСвязей.ИмяСвойства = ИмяСвойства;
			ТекущиеСвязи = РК.НайтиЭлементыКоллекции(СсылкиЭлементов, ОтборТекущихСвязей);
			УдаленныеСвязи = Новый Массив;
			Для Каждого ТекущаяСвязь Из ТекущиеСвязи Цикл
				Если УстановленныеСвязи[ТекущаяСвязь] <> Истина Тогда
					// связь разорвана
					УдаленныеСвязи.Добавить(ТекущаяСвязь);
				КонецЕсли;
			КонецЦикла;

			Если УдаленныеСвязи.Количество() > 0 Тогда
				Для Каждого УдаленнаяСвязь Из УдаленныеСвязи Цикл
					ДобавитьЭлементыСписка(ЭлементыПриемникиПотерявшиеСвязь, УдаленнаяСвязь.ЭлементПриемник, УдаленнаяСвязь.КлассЭлементаПриемника);
				КонецЦикла;
				
				РК.УдалитьЭлементыКоллекции(СсылкиЭлементов, УдаленныеСвязи);
			КонецЕсли;
			
			Если СписокНовыхСвязей.Количество() > 0 Тогда
				Если ЭлементИсточник.Зависимый Тогда
					Для Каждого Связь Из СписокНовыхСвязей Цикл
						КлючевыеДанныеОбратнойСвязи.ЭлементИсточник = Связь.ЭлементПриемник;
						КлючевыеДанныеОбратнойСвязи.КлассЭлементаИсточника = Связь.КлассЭлементаПриемника;
						Если РК.НайтиЭлементКоллекции(СсылкиЭлементов, КлючевыеДанныеОбратнойСвязи)=Неопределено Тогда
							Связь = РК.ДобавитьЭлементКоллекции(СсылкиЭлементов, КлючевыеДанныеОбратнойСвязи);
							ЗаполнитьЗначенияСвойств(Связь, ДополнительныеДанныеСвязи);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;
		
	КонецЦикла;
	
	УдалитьДублиСпискаЭлементов(ЭлементыПриемникиПотерявшиеСвязь);
	
	РезультатДействия = Новый Структура;
	РезультатДействия.Вставить("ЭлементыПриемникиПотерявшиеСвязь", ЭлементыПриемникиПотерявшиеСвязь);
	
	Возврат РезультатДействия;
	
КонецФункции

Функция НовыйСписокЭлементов()
	
	РК = вмс_РаботаСКоллекциями;
	
	СписокЭлементов = РК.НоваяКоллекцияЗначений("ПолноеИмя, КлассЭлемента");
	РК.ДобавитьИндексКоллекции(СписокЭлементов, "ПолноеИмя, КлассЭлемента");
	
	Возврат СписокЭлементов;
	
КонецФункции

Функция ДобавитьЭлементыСписка(СписокЭлементов, КлючиЭлементов, КлассЭлементов=Неопределено)
	
	РК = вмс_РаботаСКоллекциями;
	
	Для Каждого КлючЭлемента Из РК.ЗначениеВМассив(КлючиЭлементов) Цикл
		КлючЭлемента = КлючЭлемента(КлючЭлемента, КлассЭлементов);
		РК.ДобавитьЭлементКоллекции(СписокЭлементов, КлючЭлемента);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция УдалитьДублиСпискаЭлементов(СписокЭлементов)

	РК = вмс_РаботаСКоллекциями;
	РК.СвернутьКоллекциюЗначений(СписокЭлементов, "ПолноеИмя, КлассЭлемента");
	
КонецФункции

Функция ОтобратьЗависимыеЭлементыБезСсылокНаНих(Настройка, Элементы)
	
	РК = вмс_РаботаСКоллекциями;

	СсылкиЭлементов = Настройка.ДополнительныеДанные.СсылкиЭлементов;
	ПоискСсылок = Новый Структура("ЭлементПриемник, КлассЭлементаПриемника");
	
	ЗависимыеЭлементыБезСсылок = Новый Массив;
	
	Для Каждого Элемент Из РК.ПолучитьЭлементыКоллекции(Элементы) Цикл
		
		Элемент = Элемент(Настройка, Элемент);
		
		Если НЕ Элемент.Зависимый Тогда
			Продолжить;
		КонецЕсли;
		
		ПоискСсылок.ЭлементПриемник = Элемент.ПолноеИмя;
		ПоискСсылок.КлассЭлементаПриемника = Элемент.КлассЭлемента;
		Связи = РК.НайтиЭлементыКоллекции(СсылкиЭлементов, ПоискСсылок);
		ЕстьСсылки = Ложь;
		Для Каждого Связь Из Связи Цикл
			Если НЕ Связь.СлабаяСсылка Тогда
				ЕстьСсылки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьСсылки Тогда
			Продолжить;
		КонецЕсли;
		
		ЗависимыеЭлементыБезСсылок.Добавить(Элемент);
		
	КонецЦикла;
	
	РК.УдалитьДублиВМассиве(ЗависимыеЭлементыБезСсылок);
	
	Возврат ЗависимыеЭлементыБезСсылок;
	
КонецФункции

Функция УдалитьЭлементы(Настройка, знач ЭлементыДляУдаления) Экспорт

	РК = вмс_РаботаСКоллекциями;

	ДополнительныеПоляКлючаЭлемента = Настройка.ДополнительныеДанные.ДополнительныеПоляКлючаЭлемента;
	
	ЭлементыДляУдаления = РК.ЗначениеВМассив(ЭлементыДляУдаления);
	
	ЗарегистрированныеЭлементыДляУдаления = Новый Соответствие;
	Для Каждого ЭлементДляУдаления Из ЭлементыДляУдаления Цикл
		ЗарегистрированныеЭлементыДляУдаления[ЭлементДляУдаления] = Истина;
	КонецЦикла;
	
	ЭлементыДляУдаленияПоСсылкам = ЭлементыДляУдаления;
	Пока ЭлементыДляУдаленияПоСсылкам.Количество() > 0 Цикл
		РезультатУдаленияСсылок = УдалитьСсылкиЭлементов(Настройка, ЭлементыДляУдаленияПоСсылкам);
		ЭлементыДляУдаленияПоСсылкам = ОтобратьЗависимыеЭлементыБезСсылокНаНих(Настройка, РезультатУдаленияСсылок.ЭлементыПриемникиПотерявшиеСвязь);
		Для Каждого ЭлементДляУдаленияПоСсылкам Из ЭлементыДляУдаленияПоСсылкам Цикл
			Если ЗарегистрированныеЭлементыДляУдаления[ЭлементДляУдаленияПоСсылкам] <> Истина Тогда
				ЭлементыДляУдаления.Добавить(ЭлементДляУдаленияПоСсылкам);
				ЗарегистрированныеЭлементыДляУдаления[ЭлементДляУдаленияПоСсылкам] = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	УдалитьСсылкиНаЭлементы(Настройка, ЭлементыДляУдаления);

	МассивыЭлементовДляУдаленияПоКлассам = Новый Соответствие;
	УдаленныеЭлементы = Новый Массив;
	Для Каждого ЭлементДляУдаления Из ЭлементыДляУдаления Цикл
		УдаленныеЭлементы.Добавить(КлючЭлемента(ЭлементДляУдаления, , ДополнительныеПоляКлючаЭлемента));
		КлассЭлементов = ЭлементДляУдаления.КлассЭлемента;
		МассивЭлементовКлассаДляУдаления = МассивыЭлементовДляУдаленияПоКлассам[КлассЭлементов];
		Если МассивЭлементовКлассаДляУдаления=Неопределено Тогда
			МассивЭлементовКлассаДляУдаления = Новый Массив;
			МассивыЭлементовДляУдаленияПоКлассам[КлассЭлементов] = МассивЭлементовКлассаДляУдаления;
		КонецЕсли;
		МассивЭлементовКлассаДляУдаления.Добавить(ЭлементДляУдаления);
	КонецЦикла;
	
	Для Каждого КЗМассивЭлементовКлассаДляУдаления Из МассивыЭлементовДляУдаленияПоКлассам Цикл
		КлассЭлементов = КЗМассивЭлементовКлассаДляУдаления.Ключ;
		МассивЭлементовКлассаДляУдаления = КЗМассивЭлементовКлассаДляУдаления.Значение;
		Элементы = Настройка[КлассЭлементов];
		
		ПересчитатьНомераЭлементовПриУдалении(Элементы, МассивЭлементовКлассаДляУдаления);
		
		РК.УдалитьЭлементыКоллекции(Элементы, МассивЭлементовКлассаДляУдаления);
	КонецЦикла;
	
	РезультатУдаленияЭлементов = Новый Структура;
	РезультатУдаленияЭлементов.Вставить("УдаленныеЭлементы", УдаленныеЭлементы);
	Возврат РезультатУдаленияЭлементов;
	
КонецФункции

Функция ПересчитатьНомераЭлементовПриУдалении(Элементы, УдаляемыеЭлементы)
	
	РК = вмс_РаботаСКоллекциями;

	НомераУдаляемыхЭлементовПоРодителям = РК.НоваяКоллекцияЗначений("Родитель, НомераДляУдаления");
	РК.ДобавитьИндексКоллекции(НомераУдаляемыхЭлементовПоРодителям, "Родитель");

	ПоискПоРодителю = Новый Структура("Родитель");
	
	Для Каждого Элемент Из УдаляемыеЭлементы Цикл
		ПоискПоРодителю.Родитель = Элемент.Родитель;
		НомераУдаляемыхЭлементовРодителя = РК.НайтиЭлементКоллекции(НомераУдаляемыхЭлементовПоРодителям, ПоискПоРодителю);
		Если НомераУдаляемыхЭлементовРодителя=Неопределено Тогда
			НомераУдаляемыхЭлементовРодителя = РК.ДобавитьЭлементКоллекции(НомераУдаляемыхЭлементовПоРодителям, ПоискПоРодителю);
			НомераУдаляемыхЭлементовРодителя.НомераДляУдаления = Новый Массив;
		КонецЕсли;
		НомераУдаляемыхЭлементовРодителя.НомераДляУдаления.Добавить(Элемент.Номер);
	КонецЦикла;
	
	Для Каждого НомераУдаляемыхЭлементовРодителя Из РК.ПолучитьЭлементыКоллекции(НомераУдаляемыхЭлементовПоРодителям) Цикл
		ПоискПоРодителю.Родитель = НомераУдаляемыхЭлементовРодителя.Родитель;
		ЭлементыРодителя = РК.НайтиЭлементыКоллекции(Элементы, ПоискПоРодителю);
		
		НомераЭлементовРодителя = РК.ВыгрузитьЗначенияКолонкиКоллекции(ЭлементыРодителя, "Номер");

		Индексы_и_НомераЭлементов = РК.ПересчитатьНомераЭлементовПриУдалении(НомераЭлементовРодителя, НомераУдаляемыхЭлементовРодителя.НомераДляУдаления);
		Для Каждого Индекс_и_НомерЭлемента Из Индексы_и_НомераЭлементов Цикл
			ЭлементРодителя = ЭлементыРодителя[Индекс_и_НомерЭлемента[0]];
			НомерЭлемента = Индекс_и_НомерЭлемента[1];
			ЭлементРодителя.Номер = НомерЭлемента;
			ЭлементРодителя.Свойства.Вставить("Номер", НомерЭлемента);
		КонецЦикла;
	КонецЦикла;
	
КонецФункции

Функция УдалитьСсылкиНаЭлементы(Настройка, знач ЭлементыПриемники)

	РК = вмс_РаботаСКоллекциями;

	СсылкиЭлементов = Настройка.ДополнительныеДанные.СсылкиЭлементов;
	
	ЭлементыПриемники = РК.ЗначениеВМассив(ЭлементыПриемники, , Ложь);
	
	ОтборСвязейПриемника = Новый Структура("ЭлементПриемник, КлассЭлементаПриемника");
	
	Для Каждого ЭлементПриемник Из ЭлементыПриемники Цикл
		ОтборСвязейПриемника.ЭлементПриемник = ЭлементПриемник.ПолноеИмя;
		ОтборСвязейПриемника.КлассЭлементаПриемника = ЭлементПриемник.КлассЭлемента;
		Связи = РК.НайтиЭлементыКоллекции(СсылкиЭлементов, ОтборСвязейПриемника);
		ОчисткаСвязей = РК.СкопироватьКоллекцию(СсылкиЭлементов, Связи);
		РК.УдалитьЭлементыКоллекции(СсылкиЭлементов, Связи);
		ОчиститьСслыкиСвойствЭлементов(Настройка, ОчисткаСвязей);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция УдалитьСсылкиЭлементов(Настройка, знач ЭлементыИсточники=Неопределено, ИмяСвойства=Неопределено)

	РК = вмс_РаботаСКоллекциями;

	СсылкиЭлементов = Настройка.ДополнительныеДанные.СсылкиЭлементов;
	
	Если ЭлементыИсточники=Неопределено Тогда
		Если ИмяСвойства=Неопределено Тогда
			РК.ОчиститьЭлементыКоллекции(СсылкиЭлементов);
			Возврат Истина;
		КонецЕсли;
		
		ЭлементыИсточники = ВсеЭлементы(Настройка);
	Иначе
		ЭлементыИсточники = РК.ЗначениеВМассив(ЭлементыИсточники, , Ложь);
	КонецЕсли;
	
	ОтборСвязейИсточника = Новый Структура("ЭлементИсточник, КлассЭлементаИсточника");
	Если ИмяСвойства <> Неопределено Тогда
		ОтборСвязейИсточника.Вставить(ИмяСвойства);
	КонецЕсли;
	
	ЭлементыПриемникиПотерявшиеСвязь = НовыйСписокЭлементов();
	
	Для Каждого ЭлементИсточник Из ЭлементыИсточники Цикл
		ОтборСвязейИсточника.ЭлементИсточник = ЭлементИсточник.ПолноеИмя;
		ОтборСвязейИсточника.КлассЭлементаИсточника = ЭлементИсточник.КлассЭлемента;
		Связи = РК.НайтиЭлементыКоллекции(СсылкиЭлементов, ОтборСвязейИсточника);
		Для Каждого Связь Из Связи Цикл
			ДобавитьЭлементыСписка(ЭлементыПриемникиПотерявшиеСвязь, Связь.ЭлементПриемник, Связь.КлассЭлементаПриемника);
		КонецЦикла;
		РК.УдалитьЭлементыКоллекции(СсылкиЭлементов, Связи);
	КонецЦикла;
	
	УдалитьДублиСпискаЭлементов(ЭлементыПриемникиПотерявшиеСвязь);
	
	Результат = Новый Структура;
	Результат.Вставить("ЭлементыПриемникиПотерявшиеСвязь", ЭлементыПриемникиПотерявшиеСвязь);
	Возврат Результат;
	
КонецФункции

Функция ОбновитьСвязиПриПереименованииЭлемента(Настройка, Элемент, ПредыдущееИмя)
	
	РК = вмс_РаботаСКоллекциями;

	СсылкиЭлементов = Настройка.ДополнительныеДанные.СсылкиЭлементов;
	
	// обновим имя элемента в свойствах элементов, ссылающихся на этот элемент
	СсылкиНаЭлемент = РК.НайтиЭлементыКоллекции(СсылкиЭлементов, Новый Структура("ЭлементПриемник, КлассЭлементаПриемника", ПредыдущееИмя, Элемент.КлассЭлемента));
	
	Для Каждого СсылкаНаЭлемент Из СсылкиНаЭлемент Цикл
		
		ЭлементИсточник = РК.НайтиЭлементКоллекции(Настройка[СсылкаНаЭлемент.КлассЭлементаИсточника], Новый Структура("ПолноеИмя", СсылкаНаЭлемент.ЭлементИсточник));
		
		Если СсылкаНаЭлемент.ИмяСвойства <> Неопределено Тогда
			// переименовать ссылку в списке значений свойства элемента-источника
			СписокЭлементовСвойстваМассив = РК.ЗначениеВМассив(ЭлементИсточник.Свойства[СсылкаНаЭлемент.ИмяСвойства]);
			
			ИндексЭлемента = СписокЭлементовСвойстваМассив.Найти(ПредыдущееИмя);
			СписокЭлементовСвойстваМассив[ИндексЭлемента] = Элемент.ПолноеИмя;
			СписокЭлементовСвойства = РК.МассивВСтроку(СписокЭлементовСвойстваМассив);
			ЭлементИсточник.Свойства[СсылкаНаЭлемент.ИмяСвойства] = СписокЭлементовСвойства;
		КонецЕсли;
		
		СсылкаНаЭлемент.ЭлементПриемник = Элемент.ПолноеИмя;
		
	КонецЦикла;
	
	РК.ИндексироватьКоллекцию(СсылкиЭлементов, СсылкиНаЭлемент);
	
	// обновим ссылки элемента
	СсылкиНаЭлемент = РК.НайтиЭлементыКоллекции(СсылкиЭлементов, Новый Структура("ЭлементИсточник, КлассЭлементаИсточника", ПредыдущееИмя, Элемент.КлассЭлемента));
	
	Для Каждого СсылкаНаЭлемент Из СсылкиНаЭлемент Цикл
		СсылкаНаЭлемент.ЭлементИсточник = Элемент.ПолноеИмя;
	КонецЦикла;
	
	РК.ИндексироватьКоллекцию(СсылкиЭлементов, СсылкиНаЭлемент);
	
КонецФункции

Функция ДобавитьСсылкиНаЭлементы(Настройка, знач ЭлементыИсточники, знач ЭлементыПриемники, ИмяСвойства=Неопределено, СлабаяСсылка=Ложь)

	РК = вмс_РаботаСКоллекциями;

	ЭлементыИсточники = РК.ЗначениеВМассив(ЭлементыИсточники, , Ложь);
	ЭлементыПриемники = РК.ЗначениеВМассив(ЭлементыПриемники, , Ложь);
	
	КлючевыеДанныеСвязи = Новый Структура("ЭлементИсточник, КлассЭлементаИсточника, ИмяСвойства, ЭлементПриемник, КлассЭлементаПриемника, СлабаяСсылка");
	КлючевыеДанныеСвязи.ИмяСвойства = ИмяСвойства;
	
	ДополнительныеДанныеСвязи = Новый Структура;
	ДополнительныеДанныеСвязи.Вставить("СлабаяСсылка", СлабаяСсылка=Истина);
	
	СсылкиЭлементов = Настройка.ДополнительныеДанные.СсылкиЭлементов;
	
	Для Каждого ЭлементИсточник Из ЭлементыИсточники Цикл
		КлючевыеДанныеСвязи.ЭлементИсточник = ЭлементИсточник.ПолноеИмя;
		КлючевыеДанныеСвязи.КлассЭлементаИсточника = ЭлементИсточник.КлассЭлемента;
		Для Каждого ЭлементПриемник Из ЭлементыПриемники Цикл
			КлючевыеДанныеСвязи.ЭлементПриемник = ЭлементПриемник.ПолноеИмя;
			КлючевыеДанныеСвязи.КлассЭлементаПриемника = ЭлементПриемник.КлассЭлемента;
			Если РК.НайтиЭлементКоллекции(СсылкиЭлементов, КлючевыеДанныеСвязи)=Неопределено Тогда
				Связь = РК.ДобавитьЭлементКоллекции(СсылкиЭлементов, КлючевыеДанныеСвязи);
				ЗаполнитьЗначенияСвойств(Связь, ДополнительныеДанныеСвязи);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецФункции

Функция ОчиститьСслыкиСвойствЭлементов(Настройка, ОчисткаСвязей)
	
	РК = вмс_РаботаСКоллекциями;

	СсылкиЭлементов = Настройка.ДополнительныеДанные.СсылкиЭлементов;
	
	ОтборПоПолномуИмени = Новый Структура("ПолноеИмя");
	ОтборСвязей = Новый Структура("ЭлементИсточник, КлассЭлементаИсточника, ИмяСвойства");
	Для Каждого ОчисткаСвязи Из РК.ПолучитьЭлементыКоллекции(ОчисткаСвязей) Цикл
		Если ОчисткаСвязи.ИмяСвойства=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОтборПоПолномуИмени.ПолноеИмя = ОчисткаСвязи.ЭлементИсточник;
		Элемент = РК.НайтиЭлементКоллекции(Настройка[ОчисткаСвязи.КлассЭлементаИсточника], ОтборПоПолномуИмени);
		СписокЭлементов = Элемент.Свойства[ОчисткаСвязи.ИмяСвойства];
		СписокЭлементовМассив = РК.ЗначениеВМассив(СписокЭлементов);
		
		ЗаполнитьЗначенияСвойств(ОтборСвязей, ОчисткаСвязи);
		СвязиЭлементов = РК.НайтиЭлементыКоллекции(СсылкиЭлементов, ОтборСвязей);
		СписокЭлементовДоступныйМассив = РК.ВыгрузитьЗначенияКолонкиКоллекции(СвязиЭлементов, "ЭлементПриемник");

		СписокЭлементовОчищенныйМассив = РК.ПересечениеМассивов(СписокЭлементовМассив, СписокЭлементовДоступныйМассив);
		СписокЭлементовОчищенный = РК.МассивВСтроку(СписокЭлементовОчищенныйМассив);
		Элемент.Свойства[ОчисткаСвязи.ИмяСвойства] = СписокЭлементовОчищенный;
	КонецЦикла;
	
КонецФункции

Функция ЭтоСсылочныйТипНаЭлементНастройки(Тип, выхКлассЭлементовЗначенияСвойства=Неопределено) Экспорт

	ПрефиксСсылочногоТипа = "КлассЭлементовНастройкиПолейЗадания.";
	ДлинаПрефиксаСсылочногоТипа = СтрДлина(ПрефиксСсылочногоТипа);

	Если Лев(Тип, ДлинаПрефиксаСсылочногоТипа) <> ПрефиксСсылочногоТипа Тогда
		Возврат Ложь;
	КонецЕсли;

	выхКлассЭлементовЗначенияСвойства = Прав(Тип, СтрДлина(Тип)-ДлинаПрефиксаСсылочногоТипа);
	Возврат Истина;
	
КонецФункции

Функция ВсеЭлементы(Настройка)
	
	РК = вмс_РаботаСКоллекциями;
	
	ВсеЭлементы = Новый Массив;
	РК.ДобавитьЭлементыКоллекции(ВсеЭлементы, Настройка.ЭлементыВывода);
	РК.ДобавитьЭлементыКоллекции(ВсеЭлементы, Настройка.ПоляДанных);
	РК.ДобавитьЭлементыКоллекции(ВсеЭлементы, Настройка.СборщикиДанных);
	
	Возврат ВсеЭлементы;
	
КонецФункции

Функция ДобавитьСтраницуВводаДанных(Настройка, Имя, Родитель=Неопределено) Экспорт
	
	Элемент = ДобавитьСтраницуВводаДанныхОсновное(Настройка, Имя, Родитель);
	
	КонструированиеСтраницыВводаДанных(Настройка, Элемент);

	Возврат Элемент;
	
КонецФункции

Функция ДобавитьСтраницуВводаДанныхОсновное(Настройка, знач Имя, Родитель=Неопределено)
	
	ИмяРодителя = ПолучитьИмяРодителяСтраницыВводаДанных(Родитель);
	Имя = СформироватьИмяСтраницыВводаДанных(Имя, ИмяРодителя);
	
	Элемент = ДобавитьЭлементВывода(Настройка, "ГруппаФормы", "СтраницаВводаДанных", ИмяРодителя, Имя);
	
	Возврат Элемент;
	
КонецФункции

Функция ПолучитьИмяРодителяСтраницыВводаДанных(Родитель)

	Если Родитель=Неопределено Тогда
		ИмяРодителя = "ГлавнаяПанель";
	Иначе
		Если ТипЗнч(Родитель)=Тип("Строка") Тогда
			ИмяРодителя = Родитель;
		Иначе
			ИмяРодителя = Родитель.ПолноеИмя;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИмяРодителя;
	
КонецФункции

Функция СформироватьИмяСтраницыВводаДанных(НачальноеИмя, Родитель=Неопределено)
	
	РК = вмс_РаботаСКоллекциями;
	
	Имя = НачальноеИмя;
	ИмяРодителя = ПолучитьИмяРодителяСтраницыВводаДанных(Родитель);

	// добавим обязательные префиксы в имя
	Префиксы = Новый Массив;
	Префиксы.Добавить(ИмяРодителя);
	Префиксы.Добавить("Страница");
	
	Для Каждого Префикс Из Префиксы Цикл
		Если Лев(Имя, СтрДлина(Префикс))=Префикс Тогда
			Имя = Прав(Имя, СтрДлина(Имя)-СтрДлина(Префикс));
		КонецЕсли;
	КонецЦикла;
	
	Префикс = РК.МассивВСтроку(Префиксы, "");
	
	Имя = Префикс + Имя;
	
	Возврат Имя;

КонецФункции

Функция ДобавитьЭлементВывода(Настройка, ТипЭлемента=Неопределено, ВидЭлемента=Неопределено, Родитель=Неопределено, Имя=Неопределено) Экспорт
	
	ЭлементВывода = ДобавитьЭлементВыводаОсновное(Настройка, ТипЭлемента, ВидЭлемента, Родитель, Имя);

	КонструированиеЭлементаВывода(Настройка, ЭлементВывода);
	
	Возврат ЭлементВывода;
	
КонецФункции

Функция ДобавитьЭлементВыводаОсновное(Настройка, ТипЭлемента=Неопределено, знач ВидЭлемента=Неопределено, Родитель=Неопределено, Имя=Неопределено)
	
	РК = вмс_РаботаСКоллекциями;
	
	Если Имя=Неопределено Тогда
		Имя = ПолучитьИмяНовогоЭлемента(Настройка.ЭлементыВывода, ТипЭлемента);
	КонецЕсли;
	
	Если Родитель <> Неопределено Тогда
		Если ТипЗнч(Родитель)=Тип("Строка") Тогда
			ИмяРодителя = ВРЕГ(Родитель);
		Иначе
			ИмяРодителя = Родитель.ПолноеИмя;
		КонецЕсли;
	Иначе
		ИмяРодителя = Неопределено;
	КонецЕсли;
	
	ПолноеИмя = ВРЕГ(Имя);
	
	Если ВидЭлемента=Неопределено Тогда
		ВидЭлемента = "";
	КонецЕсли;
	
	Элементы = Настройка.ЭлементыВывода;
	
	ПроверитьИмяЭлемента(Элементы, Имя, ПолноеИмя);
	
	НомерЭлемента = РК.НайтиЭлементыКоллекции(Элементы, Новый Структура("Родитель", ИмяРодителя)).Количество();
	ЭлементВывода = РК.ДобавитьЭлементКоллекции(Элементы, Новый Структура("ПолноеИмя, Родитель", ПолноеИмя, ИмяРодителя));
	ИнициализироватьНовыйЭлемент(ЭлементВывода);

	ЭлементВывода.Имя = Имя;
	ЭлементВывода.КлассЭлемента = "ЭлементыВывода";
	ЭлементВывода.Номер = НомерЭлемента;
	ЭлементВывода.ТипЭлемента = ТипЭлемента;
	ЭлементВывода.ВидЭлемента = ВидЭлемента;
	
	ЭлементВывода.Свойства.Вставить("Имя", Имя);
	ЭлементВывода.Свойства.Вставить("Родитель", ИмяРодителя);
	ЭлементВывода.Свойства.Вставить("Номер", НомерЭлемента);
	ЭлементВывода.Свойства.Вставить("ТипЭлемента", ТипЭлемента);
	ЭлементВывода.Свойства.Вставить("ВидЭлемента", ВидЭлемента);

	УстановитьКартинкуЭлемента(Настройка, ЭлементВывода);
	
	Возврат ЭлементВывода;
	
КонецФункции

Функция ДобавитьПолеДанных(Настройка, Родитель=Неопределено, Имя=Неопределено) Экспорт
	
	ПолеДанных = ДобавитьПолеДанныхОсновной(Настройка, Родитель, Имя);

	КонструированиеПоляДанных(Настройка, ПолеДанных);
	
	Возврат ПолеДанных;
	
КонецФункции

Функция ДобавитьПолеДанныхОсновной(Настройка, Родитель=Неопределено, Имя=Неопределено)

	РК = вмс_РаботаСКоллекциями;

	Если Родитель <> Неопределено Тогда
		Если ТипЗнч(Родитель)=Тип("Строка") Тогда
			ИмяРодителя = ВРЕГ(Родитель);
		Иначе
			ИмяРодителя = Родитель.ПолноеИмя;
		КонецЕсли;
	Иначе
		ИмяРодителя = Неопределено;
	КонецЕсли;

	Если Имя=Неопределено Тогда
		Если ЗначениеЗаполнено(ИмяРодителя) Тогда
			Имя = ПолучитьИмяНовогоЭлемента(Настройка.ПоляДанных, "Колонка", ИмяРодителя);
		Иначе
			Имя = ПолучитьИмяНовогоЭлемента(Настройка.ПоляДанных, "Поле");
		КонецЕсли;
	КонецЕсли;
	
	ПолноеИмя = Имя;
	Если ЗначениеЗаполнено(ИмяРодителя) Тогда
		ПолноеИмя = ИмяРодителя + "." + ПолноеИмя;
	КонецЕсли;
	ПолноеИмя = ВРЕГ(ПолноеИмя);
	
	Элементы = Настройка.ПоляДанных;
	
	ПроверитьИмяЭлемента(Элементы, Имя, ПолноеИмя);

	НомерЭлемента = РК.НайтиЭлементыКоллекции(Элементы, Новый Структура("Родитель", ИмяРодителя)).Количество();
	ПолеДанных = вмс_РаботаСКоллекциями.ДобавитьЭлементКоллекции(Элементы, Новый Структура("ПолноеИмя, Родитель", ПолноеИмя, ИмяРодителя));
	ИнициализироватьНовыйЭлемент(ПолеДанных);

	ПолеДанных.Имя = Имя;
	ПолеДанных.КлассЭлемента = "ПоляДанных";
	ПолеДанных.Номер = НомерЭлемента;
	ПолеДанных.ТипЭлемента = "Поле";
	
	ПолеДанных.Свойства.Вставить("Имя", Имя);
	ПолеДанных.Свойства.Вставить("Родитель", ИмяРодителя);
	ПолеДанных.Свойства.Вставить("Номер", НомерЭлемента);
	ПолеДанных.Свойства.Вставить("ТипЭлемента", ПолеДанных.ТипЭлемента);

	УстановитьКартинкуЭлемента(Настройка, ПолеДанных);
	
	Возврат ПолеДанных;
	
КонецФункции

Функция ДобавитьСборщикДанных(Настройка, Имя=Неопределено, Тип=Неопределено) Экспорт
	
	СборщикДанных = ДобавитьСборщикДанныхОсновной(Настройка, Имя);
	Если Тип <> Неопределено Тогда
		УстановитьСвойстваЭлементов(Настройка, СборщикДанных, Новый Структура("Тип", Тип));
	КонецЕсли;
	
	КонструированиеСборщикаДанных(Настройка, СборщикДанных);
	
	Возврат СборщикДанных;
	
КонецФункции

Функция ДобавитьСборщикДанныхОсновной(Настройка, знач Имя=Неопределено)
	
	РК = вмс_РаботаСКоллекциями;

	ИмяРодителя = Неопределено;
	
	Если Имя=Неопределено Тогда
		Имя = ПолучитьИмяНовогоЭлемента(Настройка.СборщикиДанных, "СборщикДанных");
	КонецЕсли;
	
	ПолноеИмя = Имя;
	ПолноеИмя = ВРЕГ(ПолноеИмя);
	
	Элементы = Настройка.СборщикиДанных;
	
	ПроверитьИмяЭлемента(Элементы, Имя, ПолноеИмя);

	НомерЭлемента = РК.НайтиЭлементыКоллекции(Элементы, Новый Структура("Родитель", ИмяРодителя)).Количество();
	СборщикДанных = вмс_РаботаСКоллекциями.ДобавитьЭлементКоллекции(Элементы, Новый Структура("ПолноеИмя, Родитель", ПолноеИмя, ИмяРодителя));
	ИнициализироватьНовыйЭлемент(СборщикДанных);

	СборщикДанных.Имя = Имя;
	СборщикДанных.КлассЭлемента = "СборщикиДанных";
	СборщикДанных.Номер = НомерЭлемента;
	
	СборщикДанных.Свойства.Вставить("Имя", Имя);
	СборщикДанных.Свойства.Вставить("Номер", НомерЭлемента);

	Возврат СборщикДанных;
	
КонецФункции

Функция ДобавитьПоляСборщикаДанных(Настройка, знач СборщикДанных, ПоляДанных)
	
	РК = вмс_РаботаСКоллекциями;
	
	Если ТипЗнч(СборщикДанных)=Тип("Строка") Тогда
		СборщикДанных = Элемент(Настройка, СборщикДанных, "СборщикиДанных");
	КонецЕсли;
	
	ПоляСборщика = ПолучитьЗначениеСвойстваЭлемента(Настройка, СборщикДанных, "Поля");
	ПоляСборщикаМассив = РК.ЗначениеВМассив(ПоляСборщика);
	Для Каждого ПолеДанных Из РК.ЗначениеВМассив(ПоляДанных) Цикл
		Если ТипЗнч(ПолеДанных)=Тип("Строка") Тогда
			ПоляСборщикаМассив.Добавить(ПолеДанных);
		Иначе
			ПоляСборщикаМассив.Добавить(ПолеДанных.ПолноеИмя);
		КонецЕсли;
	КонецЦикла;
	ПоляСборщика = РК.МассивВСтроку(ПоляСборщикаМассив);
	
	УстановитьСвойствоЭлементов(Настройка, СборщикДанных, "Поля", ПоляСборщика);
	
КонецФункции

Функция ИнициализироватьНовыйЭлемент(Элемент)
	Элемент.Зависимый = Ложь;
	Элемент.Свойства = Новый Структура;
	Элемент.ДополнительныеДанные = Новый Структура;
КонецФункции

Функция УстановитьКартинкуЭлемента(Настройка, Элемент) Экспорт

	Картинка = Новый Картинка;
	
	КлассЭлемента = Элемент.КлассЭлемента;
	Если КлассЭлемента="ЭлементыВывода" Тогда
		
		Если Элемент.Зависимый И Элемент.ТипЭлемента="ПолеФормы" Тогда
			Картинка = БиблиотекаКартинок.вмс_ПолеДанныхИФормы;
		Иначе
			СведенияОТипахЭлементовВывода = Настройка.ДополнительныеДанные.СведенияОТипахЭлементовВывода;
			СведенияОТипеЭлементаФормы = вмс_КонструкторФорм.ПолучитьСведенияОТипеЭлементаФормы(СведенияОТипахЭлементовВывода, Элемент.ТипЭлемента, Элемент.ВидЭлемента);
			Если СведенияОТипеЭлементаФормы <> Неопределено Тогда
				Картинка = СведенияОТипеЭлементаФормы.Картинка;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли КлассЭлемента="ПоляДанных" Тогда
		
		Если Элемент.ТипЭлемента="Поле" Тогда
			Картинка = БиблиотекаКартинок.вмс_Реквизит;
		ИначеЕсли Элемент.ТипЭлемента="Таблица" Тогда
			Картинка = БиблиотекаКартинок.вмс_Таблица;
		КонецЕсли;
		
	КонецЕсли;
	
	Элемент.Картинка = Картинка;
	
КонецФункции

Функция Элемент(Настройка, КлючЭлемента, КлассЭлементов=Неопределено) Экспорт
	
	Элементы = Элементы(Настройка, КлючЭлемента, КлассЭлементов);
	
	Если Элементы.Количество() > 0 Тогда
		
		Элемент = Элементы[0];
		Возврат Элемент;
		
	КонецЕсли;
	
КонецФункции

Функция Элементы(Настройка, знач КлючиЭлементов, КлассЭлементов=Неопределено, выхДополнительныйРезультат=Неопределено) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	КлючиЭлементов = РК.ЗначениеВМассив(КлючиЭлементов, , Ложь);
	
	НайденныеЭлементы = Новый Массив;
	НеНайденныеЭлементы = Новый Массив;
	
	выхДополнительныйРезультат = Новый Структура;
	выхДополнительныйРезультат.Вставить("НайденныеЭлементы", НайденныеЭлементы);
	выхДополнительныйРезультат.Вставить("НеНайденныеЭлементы", НеНайденныеЭлементы);
	
	Для Каждого КлючЭлемента Из КлючиЭлементов Цикл
		
		КлючЭлемента = КлючЭлемента(КлючЭлемента, КлассЭлементов);
		
		Если КлючЭлемента.ПолноеИмя <> Неопределено И КлючЭлемента.КлассЭлемента <> Неопределено Тогда
			Элемент = РК.НайтиЭлементКоллекции(Настройка[КлючЭлемента.КлассЭлемента], Новый Структура("ПолноеИмя", КлючЭлемента.ПолноеИмя));
			Если Элемент <> Неопределено Тогда
				НайденныеЭлементы.Добавить(Элемент);
			Иначе
				НеНайденныеЭлементы.Добавить(КлючЭлемента);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НайденныеЭлементы;
	
КонецФункции

Функция КлючЭлемента(Элемент, КлассЭлемента=Неопределено, ДополнительныеПоляКлючаЭлемента=Неопределено) Экспорт
	
	ПоляКлюча = "ПолноеИмя, КлассЭлемента";
	Если ДополнительныеПоляКлючаЭлемента <> Неопределено Тогда
		ПоляКлюча = ПоляКлюча + ", " + ДополнительныеПоляКлючаЭлемента;
	КонецЕсли;
	
	КлючЭлемента = Новый Структура(ПоляКлюча, , КлассЭлемента);
	
	Если Элемент <> Неопределено Тогда
		Если ТипЗнч(Элемент)=Тип("Строка") Тогда
			КлючЭлемента.ПолноеИмя = Элемент;
		Иначе
			ЗаполнитьЗначенияСвойств(КлючЭлемента, Элемент);
		КонецЕсли;
		
		Если КлючЭлемента.ПолноеИмя <> Неопределено Тогда
			КлючЭлемента.ПолноеИмя = ВРЕГ(КлючЭлемента.ПолноеИмя);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КлючЭлемента;
	
КонецФункции

Функция СохранитьНастройку(Настройка, НастройкаИБ) Экспорт
	
	РК = вмс_РаботаСКоллекциями;

	ПараметрыЗаписиXML = ПараметрыЗаписиXML();
	
	ТипыЗначенийСвойствЭлементовИБ = Настройка.ДополнительныеДанные.ТипыЗначенийСвойствЭлементовИБ;
	
	ТаблицыЭлементов = РК.ЗначениеВМассив("ЭлементыВывода, ПоляДанных, СборщикиДанных");
	
	Для Каждого ТаблицаЭлементов Из ТаблицыЭлементов Цикл
		Элементы = РК.ПолучитьЭлементыКоллекции(Настройка[ТаблицаЭлементов]);
		
		Если ТаблицаЭлементов="СборщикиДанных" Тогда
			ЭлементыИБ = НастройкаИБ["СборщикиДанных1"];
		Иначе
			ЭлементыИБ = НастройкаИБ[ТаблицаЭлементов];
		КонецЕсли;
		ЭлементыИБ.Очистить();
		
		ИерархияЭлементов = ПолучитьИерархиюЭлементов(Настройка, Элементы);
		ПорядокЭлементов = РК.ВыгрузитьЗначенияКолонкиКоллекции(ИерархияЭлементов, "Элемент");
		
		Для Каждого Элемент Из ПорядокЭлементов Цикл
			
			Для Каждого СвойствоЭлемента Из Элемент.Свойства Цикл
				ЗначениеСвойства = СвойствоЭлемента.Значение;

				Если ТипыЗначенийСвойствЭлементовИБ[ТипЗнч(ЗначениеСвойства)]=Истина Тогда
					ЗначениеXML = "";
				Иначе
					вмс_РаботаСXMLКлиентСервер.ПодготовитьОбъектыИЗначенияСвойствОбъектовДляЗаписи(ПараметрыЗаписиXML, ЗначениеСвойства);

					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку();
					ПараметрыЗаписиXML.ЗаписьXML = ЗаписьXML;
					вмс_РаботаСXMLКлиентСервер.ЗаписатьОбъект(ЗначениеСвойства, ПараметрыЗаписиXML);
					ЗначениеXML = ПараметрыЗаписиXML.ЗаписьXML.Закрыть();
					ЗначениеСвойства = Неопределено;
				КонецЕсли;
				
				СвойствоЭлементаВыводаИБ = ЭлементыИБ.Добавить();
				СвойствоЭлементаВыводаИБ.Имя = Элемент.ПолноеИмя;
				СвойствоЭлементаВыводаИБ.Свойство = СвойствоЭлемента.Ключ;
				СвойствоЭлементаВыводаИБ.Значение = ЗначениеСвойства;
				СвойствоЭлементаВыводаИБ.ЗначениеXML = ЗначениеXML;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецФункции

Функция ПараметрыЗаписиXML()
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ПараметрыЗаписиXML = вмс_РаботаСXMLКлиентСервер.ПолучитьПараметрыЗаписиXML(ЗаписьXML, Истина);
	
	Возврат ПараметрыЗаписиXML;
	
КонецФункции

Функция ПрочитатьЗначениеСвойстваXML(ПараметрыЧтенияXML, ЗначениеXML)

	ПараметрыЧтенияXML.ЧтениеXML.УстановитьСтроку(ЗначениеXML);
	ПараметрыЧтенияXML.ЧтениеXML.Прочитать();
	Значение = вмс_РаботаСXMLКлиентСервер.ПрочитатьОбъект(ПараметрыЧтенияXML);
	
	Возврат Значение;
	
КонецФункции

Функция ЗаписатьЗначениеСвойстваXML(ПараметрыЗаписиXML, Значение)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ПараметрыЗаписиXML.ЗаписьXML = ЗаписьXML;
	вмс_РаботаСXMLКлиентСервер.ПодготовитьОбъектыИЗначенияСвойствОбъектовДляЗаписи(ПараметрыЗаписиXML, Значение);
	вмс_РаботаСXMLКлиентСервер.ЗаписатьОбъект(Значение, ПараметрыЗаписиXML);
	ЗначениеXML = ПараметрыЗаписиXML.ЗаписьXML.Закрыть();
	
	Возврат ЗначениеXML;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//						Конструирование +
//

#Область Конструирование

Функция НовыеПараметрыКонструирования()
	
	ПараметрыКонструирования = Новый Структура;	
	ПараметрыКонструирования.Вставить("Начато", Ложь);
	ПараметрыКонструирования.Вставить("СтраницыВводаДанных", Новый Массив);
	ПараметрыКонструирования.Вставить("СборщикиДанных", Новый Массив);
	ПараметрыКонструирования.Вставить("НовыеЭлементы", Новый Массив);
	
	Возврат ПараметрыКонструирования;
	
КонецФункции

Функция ПараметрыКонструирования(Настройка)
	
	Возврат Настройка.ДополнительныеДанные.ПараметрыКонструирования;
	
КонецФункции

Функция ПараметрыПродолженияКонструирования(Настройка)
	
	ПараметрыКонструирования = ПараметрыКонструирования(Настройка);
	
	Если НЕ ПараметрыКонструирования.Начато Тогда
		ВызватьИсключение "Конструирование не начато";
	КонецЕсли;
	
	Возврат ПараметрыКонструирования;
	
КонецФункции

Функция НачатьКонструированиеЭлементов(Настройка) Экспорт
	
	ПараметрыКонструирования = ПараметрыКонструирования(Настройка);
	
	Если ПараметрыКонструирования.Начато Тогда
		ВызватьИсключение "Не завершено предыдущее конструирование";
	КонецЕсли;
	
	ПараметрыКонструирования.Начато = Истина;
	ПараметрыКонструирования.СтраницыВводаДанных.Очистить();
	ПараметрыКонструирования.СборщикиДанных.Очистить();
	ПараметрыКонструирования.НовыеЭлементы.Очистить();
	
	Возврат Истина;
	
КонецФункции

Функция КонструированиеСтраницыВводаДанных(Настройка, СтраницаВвода)

	ПараметрыКонструирования = ПараметрыКонструирования(Настройка);

	Если НЕ ПараметрыКонструирования.Начато Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьКонструированиеСтраницыВводаДанных(Настройка, СтраницаВвода);
	
	Возврат Истина;
		
КонецФункции

Функция НачатьКонструированиеСтраницыВводаДанных(Настройка, знач СтраницаВвода) Экспорт

	РК = вмс_РаботаСКоллекциями;

	ПараметрыКонструирования = ПараметрыПродолженияКонструирования(Настройка);
	
	Если ТипЗнч(СтраницаВвода)=Тип("Строка") Тогда
		ИмяСтраницы = СтраницаВвода;
		СтраницаВвода = СформироватьИмяСтраницыВводаДанных(СтраницаВвода);
	КонецЕсли;
	
	СтраницаВвода = Элемент(Настройка, СтраницаВвода, "ЭлементыВывода");
	Если СтраницаВвода=Неопределено Тогда
		ПараметрыКонструирования.Начато = Ложь;
		Если ИмяСтраницы <> Неопределено Тогда
			ВызватьИсключение "Не найдена страница ввода данных """ + ИмяСтраницы + """";
		Иначе
			ВызватьИсключение "Не указана страница ввода данных";
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыКонструирования.СтраницыВводаДанных.Добавить(СтраницаВвода.ПолноеИмя);
	
	РК.УстановитьЭлементыКоллекции(ПараметрыКонструирования.СборщикиДанных, ПолучитьСписокЗначенийСвойстваЭлемента(Настройка, СтраницаВвода, "СборщикиДанных"));

КонецФункции

Функция ЗакончитьКонструированиеСтраницыВводаДанных(Настройка, знач СтраницаВвода=Неопределено) Экспорт

	РК = вмс_РаботаСКоллекциями;

	ПараметрыКонструирования = ПараметрыПродолженияКонструирования(Настройка);
	СтраницыВводаДанных = ПараметрыКонструирования.СтраницыВводаДанных;
	Если СтраницыВводаДанных.Количество()=0 Тогда
		ВызватьИсключение "Не указана страница ввода данных";
		Возврат Ложь;
	КонецЕсли;
	
	Если СтраницаВвода=Неопределено Тогда
		ИмяСтраницы = СтраницыВводаДанных[СтраницыВводаДанных.Количество()-1];
	ИначеЕсли ТипЗнч(СтраницаВвода)=Тип("Строка") Тогда
		ИмяСтраницы = СформироватьИмяСтраницыВводаДанных(СтраницаВвода);
	Иначе
		ИмяСтраницы = Неопределено;
	КонецЕсли;
	
	Если ИмяСтраницы <> Неопределено Тогда
		ЭлементСтраницыВвода = Элемент(Настройка, ИмяСтраницы, "ЭлементыВывода");
	Иначе
		ЭлементСтраницыВвода = СтраницаВвода;
	КонецЕсли;
	
	СборщикиДанныхСтраницы = ПолучитьСписокЗначенийСвойстваЭлемента(Настройка, ЭлементСтраницыВвода, "СборщикиДанных");
	
	РК.ВычестьМассив(СтраницыВводаДанных, ЭлементСтраницыВвода.ПолноеИмя);
	
	ЭлементыСтраницВводаДанных = Элементы(Настройка, СтраницыВводаДанных, "ЭлементыВывода");
	
	СборщикиДанныхСтраниц = Новый Массив;
	Для Каждого ЭлементСтраницВводаДанных Из ЭлементыСтраницВводаДанных Цикл
		
		РК.ДобавитьЭлементыКоллекции(СборщикиДанныхСтраниц, ПолучитьСписокЗначенийСвойстваЭлемента(Настройка, ЭлементСтраницВводаДанных, "СборщикиДанных"));
		
	КонецЦикла;
	РК.УдалитьДублиВМассиве(СборщикиДанныхСтраниц);
	
	УдаляемыеСборщики = РК.ВычитаниеМассивов(СборщикиДанныхСтраницы, СборщикиДанныхСтраниц);
	
	РК.ВычестьМассив(ПараметрыКонструирования.СборщикиДанных, УдаляемыеСборщики);

КонецФункции

Функция КонструированиеЭлементаВывода(Настройка, ЭлементВывода)
	
	ПараметрыКонструирования = ПараметрыКонструирования(Настройка);

	Если НЕ ПараметрыКонструирования.Начато Тогда
		Возврат Ложь;
	КонецЕсли;

	ПараметрыКонструирования.НовыеЭлементы.Добавить(КлючЭлемента(ЭлементВывода));
	
КонецФункции

Функция КонструированиеСборщикаДанных(Настройка, СборщикДанных)

	ПараметрыКонструирования = ПараметрыКонструирования(Настройка);

	Если НЕ ПараметрыКонструирования.Начато Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыКонструирования.НовыеЭлементы.Добавить(КлючЭлемента(СборщикДанных));
	
	НачатьКонструированиеСборщиковДанных(Настройка, СборщикДанных);
	
	Возврат Истина;
	
КонецФункции

Функция НачатьКонструированиеСборщиковДанных(Настройка, знач СборщикиДанных) Экспорт

	ПараметрыКонструирования = ПараметрыПродолженияКонструирования(Настройка);
	
	Если ПараметрыКонструирования.СтраницыВводаДанных.Количество()=0 Тогда
		ПараметрыКонструирования.Начато = Ложь;
		ВызватьИсключение "Не указана страница ввода данных";
	КонецЕсли;
	
	РК = вмс_РаботаСКоллекциями;
	
	СборщикиДанных = РК.ЗначениеВМассив(СборщикиДанных);
	
	ДобавленныеСборщики = Новый Массив;
	Для Каждого СборщикДанных Из СборщикиДанных Цикл
		Если ТипЗнч(СборщикДанных)=Тип("Строка") Тогда
			ИмяСборщика = СборщикДанных;
		КонецЕсли;
		
		СборщикДанных = Элемент(Настройка, СборщикДанных, "СборщикиДанных");
		Если СборщикДанных=Неопределено Тогда
			ПараметрыКонструирования.Начато = Ложь;
			Если ИмяСборщика <> Неопределено Тогда
				ВызватьИсключение "Не найден сборщик данных """ + ИмяСборщика + """";
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыКонструирования.СборщикиДанных.Найти(СборщикДанных.ПолноеИмя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыКонструирования.СборщикиДанных.Добавить(СборщикДанных.ПолноеИмя);
		ДобавленныеСборщики.Добавить(СборщикДанных.ПолноеИмя);
	КонецЦикла;

	Для Каждого СтраницаВводаДанных Из ПараметрыКонструирования.СтраницыВводаДанных Цикл
		СтраницаВводаДанных = Элемент(Настройка, СтраницаВводаДанных, "ЭлементыВывода");
		СборщикиДанныхСтраницы = ПолучитьСписокЗначенийСвойстваЭлемента(Настройка, СтраницаВводаДанных, "СборщикиДанных");
		РК.ДобавитьЭлементыКоллекции(СборщикиДанныхСтраницы, ДобавленныеСборщики);
		УстановитьСвойствоЭлементов(Настройка, СтраницаВводаДанных, "СборщикиДанных", СборщикиДанныхСтраницы);
	КонецЦикла;
	
КонецФункции

Функция КонструированиеПоляДанных(Настройка, ПолеДанных)

	ПараметрыКонструирования = ПараметрыКонструирования(Настройка);

	Если НЕ ПараметрыКонструирования.Начато Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыКонструирования.СтраницыВводаДанных.Количество()=0 Тогда
		ПараметрыКонструирования.Начато = Ложь;
		ВызватьИсключение "Не указана страница ввода данных";
	КонецЕсли;

	УстановитьСвойстваЭлементов(Настройка, ПолеДанных, Новый Структура("Зависимый", Истина));
	
	ЗначенияЗаполненияСвойствПоляДанныхПоУмолчанию = ПолучитьЗначенияЗаполненияСвойствПоляДанныхПоУмолчанию(Настройка, ПолеДанных.Имя);
	Если ЗначенияЗаполненияСвойствПоляДанныхПоУмолчанию <> Неопределено Тогда
		УстановитьСвойстваЭлементов(Настройка, ПолеДанных, ЗначенияЗаполненияСвойствПоляДанныхПоУмолчанию);
	КонецЕсли;
	
	ПараметрыКонструирования.НовыеЭлементы.Добавить(КлючЭлемента(ПолеДанных));
	
	// в режиме конструирования добавим также элемент вывода поля
	Для Каждого СтраницаВводаДанных Из ПараметрыКонструирования.СтраницыВводаДанных Цикл
		ИмяЭлементаВывода = ПолучитьИмяНовогоЭлемента(Настройка.ЭлементыВывода, ПолеДанных.Имя, СтраницаВводаДанных);
		Если ИмяЭлементаВывода = ПолеДанных.Имя + "1" Тогда
			// для первого элемента не указывать индекс в имени
			ИмяЭлементаВывода = ПолеДанных.Имя;
		КонецЕсли;
		
		ЭлементВывода = ДобавитьЭлементВывода(Настройка, "ПолеФормы", "ПолеВвода", СтраницаВводаДанных, ИмяЭлементаВывода);
		УстановитьСвойстваЭлементов(Настройка, ЭлементВывода, Новый Структура("Зависимый, ПутьКДанным", Истина, ПолеДанных.ПолноеИмя));
	КонецЦикла;
	
	Для Каждого СборщикДанных Из ПараметрыКонструирования.СборщикиДанных Цикл
		ДобавитьПоляСборщикаДанных(Настройка, СборщикДанных, ПолеДанных);
	КонецЦикла;	
	
	Возврат Истина;
		
КонецФункции

Функция ПолучитьЗначенияЗаполненияСвойствПоляДанныхПоУмолчанию(Настройка, Имя)

	РК = вмс_РаботаСКоллекциями;
	
	ЗначенияЗаполненияСвойствПоляДанныхПоУмолчаниюНаСервере = вмс_НастройкиПолейЗаданияВызовСервера1.ПолучитьЗначенияЗаполненияСвойствПоляДанныхПоУмолчанию(Имя);
	Если ЗначенияЗаполненияСвойствПоляДанныхПоУмолчаниюНаСервере=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ЗначенияЗаполненияСвойствПоляДанныхПоУмолчанию = Новый Структура;
	Для Каждого ОписаниеСвойства Из РК.ЗначениеВМассив(Настройка.ДополнительныеДанные.СведенияОСвойствахПолейОбработки) Цикл
		ИмяСвойства = ОписаниеСвойства.ИмяСвойства;
		Если ЗначенияЗаполненияСвойствПоляДанныхПоУмолчаниюНаСервере.Свойство(ИмяСвойства) Тогда
			ЗначенияЗаполненияСвойствПоляДанныхПоУмолчанию.Вставить(ИмяСвойства, ЗначенияЗаполненияСвойствПоляДанныхПоУмолчаниюНаСервере[ИмяСвойства]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначенияЗаполненияСвойствПоляДанныхПоУмолчанию;

КонецФункции

Функция ЗакончитьКонструированиеЭлементов(Настройка) Экспорт

	ПараметрыКонструирования = ПараметрыПродолженияКонструирования(Настройка);
	
	ПараметрыКонструирования.Начато = Ложь;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСконструированныеЭлементы(Настройка) Экспорт
	
	Возврат Элементы(Настройка, ПараметрыКонструирования(Настройка).НовыеЭлементы);
	
КонецФункции

#КонецОбласти

//
//						Конструирование -
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
