
Функция ТоварныеПоля() Экспорт
	
	ТоварныеПоля = Новый Массив;
	ТоварныеПоля.Добавить("Товар");
	ТоварныеПоля.Добавить("Характеристика"); 
	ТоварныеПоля.Добавить("Партия");
	ТоварныеПоля.Добавить("Серия");
	ТоварныеПоля.Добавить("Упаковка"); 
	ТоварныеПоля.Добавить("Качество");
	//3.2.4: Убраны неиспользуемые товарные поля
	//ТоварныеПоля.Добавить("УчетныйПараметр1");
	//ТоварныеПоля.Добавить("УчетныйПараметр2");
	
	Возврат ТоварныеПоля;
	
КонецФункции

Функция ОбязательныеТоварныеПоля() Экспорт
	
	ОбязательныеТоварныеПоляМассив = Новый Массив;
	ОбязательныеТоварныеПоляМассив.Добавить("Товар");
	Возврат ОбязательныеТоварныеПоляМассив;
	
КонецФункции
