#Область ПрограммныйИнтерфейс  

Функция ПолучитьСоставыКомплектов(Комплекты) Экспорт
	
	ТаблицаКомплектовИсточник = вмс_РаботаСКоллекциями.ЗначениеВТаблицуЗначений(Комплекты, "Товар");
	ТаблицаКомплектов = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("Товар, Характеристика");
	вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(ТаблицаКомплектов, ТаблицаКомплектовИсточник);
	
	Если ТаблицаКомплектовИсточник.Колонки.Найти("Характеристика") = Неопределено Тогда
		ТаблицаКомплектов.ЗаполнитьЗначения(вмс_АдаптацияКонфигураций.ПустаяХарактеристика(), "Характеристика");
	КонецЕсли;
	
	вмс_РаботаСКоллекциями.ТипизироватьТаблицуЗначений(ТаблицаКомплектов);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаКомплектов.Товар КАК Товар,
	|	ТаблицаКомплектов.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Комплекты
	|ИЗ
	|	&ТаблицаКомплектов КАК ТаблицаКомплектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_СоставыКомплектовСрезПоследних.Товар КАК Товар,
	|	вмс_СоставыКомплектовСрезПоследних.ХарактеристикаТовара КАК ХарактеристикаТовара,
	|	вмс_СоставыКомплектовСрезПоследних.Комплектующая КАК Комплектующая,
	|	вмс_СоставыКомплектовСрезПоследних.ХарактеристикаКомплектующей КАК ХарактеристикаКомплектующей,
	|	вмс_СоставыКомплектовСрезПоследних.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.вмс_СоставыКомплектов.СрезПоследних(
	|			,
	|			(Товар, ХарактеристикаТовара) В
	|				(ВЫБРАТЬ
	|					ВТ_Комплекты.Товар,
	|					ВТ_Комплекты.Характеристика
	|				ИЗ
	|					ВТ_Комплекты)) КАК вмс_СоставыКомплектовСрезПоследних";
	Запрос.УстановитьПараметр("ТаблицаКомплектов", ТаблицаКомплектов);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаСоставовКомплектов = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаСоставовКомплектов;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс    
// Мовчан 20.03.23++
// Добавлены вызовы функций ПолучитьИмяПриходногоДокумента() и ИмяКолонкиХарактеристика() из вмс_АдаптацияКонфигураций
// Мовчан 20.03.23-- 

Функция ЗавестиПотребностиКомплектовИКомплектующих(Источник, Отказ, РежимПроведения)  Экспорт 
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект."+ вмс_АдаптацияКонфигураций.ПолучитьИмяПриходногоДокумента()) Тогда  
		
		// 1. Проверяем есть ли вообще комплекты в документе
		// 2. Проверяем есть ли документ потребности 
		// 3. Заполняем и проводим документ потребности
					
		ТоварыПоРаспоряжению = Источник.Товары.Выгрузить(, "Номенклатура, " + вмс_АдаптацияКонфигураций.ИмяКолонкиХарактеристика() + ", Количество");
		ТоварыПоРаспоряжению.Колонки["Номенклатура"].Имя = "Товар";	
		ТаблицаКомплектов = ПолучитьСоставыКомплектов(ТоварыПоРаспоряжению); 		 
		
		Если ТаблицаКомплектов.Количество() > 0 Тогда
			
			ДокументПотребности = Неопределено;
			СоздатьДокумент = Истина;
						
			ТаблицаКомплектов.Колонки["ХарактеристикаТовара"].Имя = "Характеристика";
			ТаблицаКомплектов.Колонки["Количество"].Имя = "КоличествоКомплектующих";
			ТаблицаКомплектов.Колонки.Добавить("Количество");
			Отбор = Новый Структура("Товар, Характеристика",);
			
			// заполнение количества комплектующих по количеству комплектов
			Для каждого СтрокаРаспоряжения Из ТоварыПоРаспоряжению  Цикл
				
				ЗаполнитьЗначенияСвойств(Отбор, СтрокаРаспоряжения);
				СтрокиКомплектующих = ТаблицаКомплектов.НайтиСтроки(Отбор);
				
				Для каждого Комплектующая Из СтрокиКомплектующих Цикл
					Комплектующая.КоличествоКомплектующих = Комплектующая.КоличествоКомплектующих * СтрокаРаспоряжения.Количество;	
				КонецЦикла;
				
			КонецЦикла;
			// заполнение количества комплектующих по количеству комплектов 
			
			СводнаяТаблица = вмс_РаботаСКоллекциями.СоединитьТаблицы(ТаблицаКомплектов, ТоварыПоРаспоряжению, "Товар, " + вмс_АдаптацияКонфигураций.ИмяКолонкиХарактеристика(), "Количество", , Ложь); 
						
			ДокументПотребности = ПолучитьДокументПотребности(Источник.Ссылка); 
			
			Если ДокументПотребности = Неопределено Тогда
				ДокументОбъект = Документы.вмс_ПотребностьКомплектов.СоздатьДокумент();
				ДокументОбъект.Заполнить(Неопределено);
				ДокументОбъект.Дата = Источник.Дата;
				ДокументОбъект.ДокументОснование = Источник.Ссылка;
				ДокументОбъект.Комментарий = "#Создан автоматически#";
			Иначе
				ДокументОбъект = ДокументПотребности.ПолучитьОбъект();
			КонецЕсли; 
			
			ДокументОбъект.Комплекты.Очистить();
			
			Для каждого Строка Из СводнаяТаблица Цикл			
				нСтрока = ДокументОбъект.Комплекты.Добавить();
				ЗаполнитьЗначенияСвойств(нСтрока, Строка);
			КонецЦикла;
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецФункции 

Функция ОчиститьПотребностиКомплектовИКомплектующих(Источник, Отказ)  Экспорт 
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект."+ вмс_АдаптацияКонфигураций.ПолучитьИмяПриходногоДокумента()) Тогда  		
		ОчиститьДокументыПотребности(Источник.Ссылка);			
	КонецЕсли;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

Функция ПолучитьДокументПотребности(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_ПотребностьКомплектов.Ссылка КАК ДокументПотребности
	|ИЗ
	|	Документ.вмс_ПотребностьКомплектов КАК вмс_ПотребностьКомплектов
	|ГДЕ
	|	вмс_ПотребностьКомплектов.ДокументОснование = &ДокументОснование
	|	И вмс_ПотребностьКомплектов.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокументПотребности;
	КонецЕсли;
	
КонецФункции

Функция ОчиститьДокументыПотребности(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_ПотребностьКомплектов.Ссылка КАК ДокументПотребности
	|ИЗ
	|	Документ.вмс_ПотребностьКомплектов КАК вмс_ПотребностьКомплектов
	|ГДЕ
	|	вмс_ПотребностьКомплектов.Проведен
	|	И вмс_ПотребностьКомплектов.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.ДокументПотребности.ПолучитьОбъект();
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецФункции


#КонецОбласти


