// #Область ПрограммныйИнтерфейс

Процедура ДокументПриСозданииНаСервереПосле(Форма) Экспорт
	
	Документ1С = ДокументИзФормыДокумента(Форма);
	
	Попытка
		КомандыДокумента = ВзаимодействиеКонтурМаркировка.МодульМаркировки().КонтурИнтеграция_КомандыДокумента1С(Документ1С);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	МодульКонтурИнтеграция = ОбщийМодуль("КонтурИнтеграция");
	МодульКонтурИнтеграция.ДобавитьОсновныеКоманды(Форма, КомандыДокумента.Основные);
	МодульКонтурИнтеграция.ДобавитьДополнительныеКоманды(Форма, КомандыДокумента.Дополнительные);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

Функция ОбщийМодуль(ИмяОбщегоМодуля)
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяОбщегоМодуля) = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Общий модуль не существует: '") + ИмяОбщегоМодуля;
	КонецЕсли;
	
	Возврат Вычислить(ИмяОбщегоМодуля);
	
КонецФункции

Функция ДокументИзФормыДокумента(ФормаДокумента)
	
	Попытка
		Результат = ФормаДокумента.Объект.Ссылка;
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти
