
// #Область СлужебныйПрограммныйИнтерфейс

// См. ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент()
// 
// Параметры:
//  ИдентификаторСеанса - Строка - идентификатор сеанса, с которым связан модуль для повторного использования;
//  ПутьКФорме - Строка - путь к форме модуля клиента;
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения - форма модуля клиента маркировки;
//
Функция МодульМаркировкиКлиент(ИдентификаторСеанса, ПутьКФорме) Экспорт
	
	Возврат ОткрытьФорму(ПутьКФорме, , , Новый УникальныйИдентификатор(ИдентификаторСеанса));
	
КонецФункции

// #КонецОбласти // СлужебныйПрограммныйИнтерфейс
