&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаОтображенияЛК = вмс_Сервер.ПолучитьНастройкуОтображениеЛК();
	ИспользоватьОблачныйКабинет = НастройкаОтображенияЛК.Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ИменаВсехПодсистем = вмс_ОбщегоНазначенияКлиентСервер.ИменаВсехПодсистем().Имена;  
	КоличествоДоступных = 0;
	
	Для Каждого ПодсистемаИмя Из ИменаВсехПодсистем Цикл
		СтраницаПодсистемы = ЭтаФорма.Элементы.Найти(ПодсистемаИмя);
		
		Если СтраницаПодсистемы <> Неопределено Тогда  
			ПодсистемаДоступна = ПроверкаСистемаДоступна(ПодсистемаИмя); 
			
			СтраницаПодсистемы.Видимость = ПодсистемаДоступна; 
			
			КоличествоДоступных = КоличествоДоступных + Число(ПодсистемаДоступна);
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоДоступных = 0 Тогда
		Отказ = Истина;
		ОткрытьФорму("Обработка.вмс_ВводЛицензий.Форма", , , , , , , РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли; 
	
	//ТУ_Чаликова 10.10.24 ++
	Если ИспользоватьОблачныйКабинет = Истина Тогда
		Элементы.ОХРЧетвертаяКолонкаЛК.Видимость = Истина;
		Элементы.вмс_ВыдачаСХранения.Видимость = Истина;
		Элементы.вмс_ПередачаНаХранение.Видимость = Истина;
		Элементы.вмс_Поклажедатели.Видимость = Истина;
		Элементы.вмс_КарточкаПоклажедателя.Видимость = Истина;//ТУ_ХабароваВВ_15.04.25
		Элементы.вмс_ОстаткиТоваровПоклажедателей.Видимость = Истина;
		Элементы.вмс_НастройкиОбменаДанными.Видимость = Истина;
		Элементы.вмс_СвязанныеДокументыПоклажедателя.Видимость = Истина;//ТУ_ХабароваВВ_15.04.25
		
		Отображение = вмс_Сервер.ПолучитьНастройкуАдресЛК();
		Отображение = вмс_Сервер.ПолучитьНастройкуИдентификаторПользователяЛК();
		Отображение = вмс_Сервер.ПолучитьНастройкуСекретПользователяЛК();
	КонецЕсли;
	
	// в разработке!
	Элементы.СкладКомплекты.Видимость = Ложь;
	
	//ТУ_Чаликова 10.10.24 --
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверкаСистемаДоступна(ПодсистемаИмя)
	Возврат вмс_ОбщегоНазначенияВызовСервера.Модуль("вмс_ЗащищенныйМодуль").ПодсистемаДоступна(ПодсистемаИмя);
КонецФункции

#Область КомандыОткрытияОбъектов

&НаКлиенте
Процедура ОткрытьФормуСпискаСправочника(Команда)
	ОткрытьФорму("Справочник." + Команда.Имя + ".ФормаСписка", , , , , , , РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
  
&НаКлиенте
Процедура ОткрытьФормуСпискаДокумента(Команда)
	ОткрытьФорму("Документ." + Команда.Имя + ".ФормаСписка", , , , , , , РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаРегистраСведений(Команда)
	ОткрытьФорму("РегистрСведений." + Команда.Имя + ".ФормаСписка", , , , , , , РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаПланаВидовХарактеристик(Команда)
	ОткрытьФорму("ПланВидовХарактеристик." + Команда.Имя + ".ФормаСписка", , , , , , , РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчёта(Команда)
	ОткрытьФорму("Отчет." + Команда.Имя + ".Форма", , , , , , , РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОбработки(Команда)
	ОткрытьФорму("Обработка." + Команда.Имя + ".Форма", , , , , , , РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура вмс_ПервоначальноеЗаполнение(Команда)
	ОткрытьФорму("Обработка.вмс_СозданиеЗаданияНаПервоначальноеЗаполнениеСкладаПоЯчейкам.Форма.Форма", , , , , , , РежимОткрытияОкнаФормы.Независимый)
КонецПроцедуры


#КонецОбласти 	

