Функция ПолучитьСписокПричинРасхождений() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ПричиныРасхождений.Ссылка КАК Ссылка,
	|	вмс_ПричиныРасхождений.Наименование КАК Наименование,
	|	вмс_ПричиныРасхождений.ПодкатегорииРасхождений.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Причина КАК Причина
	|	) КАК ПодкатегорииРасхождений
	|ИЗ
	|	ПланВидовХарактеристик.вмс_ПричиныРасхождений КАК вмс_ПричиныРасхождений";
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
КонецФункции   

Функция ПолучитьПричинуБрак() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ПричиныРасхождений.Ссылка КАК Ссылка,
	|	вмс_ПричиныРасхождений.Наименование КАК Наименование,
	|	вмс_ПричиныРасхождений.ПодкатегорииРасхождений.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Причина КАК Причина
	|	) КАК ПодкатегорииРасхождений
	|ИЗ
	|	ПланВидовХарактеристик.вмс_ПричиныРасхождений КАК вмс_ПричиныРасхождений
	|ГДЕ
	|	вмс_ПричиныРасхождений.Наименование = ""Брак""
	|	И вмс_ПричиныРасхождений.Предопределенный = ИСТИНА";
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
	
КонецФункции
