&НаКлиенте
Перем ФормаКонструктора;

//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

&НаКлиентеНаСервереБезКонтекста
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

&НаКлиенте
Процедура Редактировать(Команда)
	
	ФормаКонструктора = вмс_КонструкторФормКлиент.ОткрытьКонструкторФормы(ЭтаФорма, Новый ОписаниеОповещения("ОбработкаРедактированияФормы", ЭтаФорма), Объект.Данные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРедактированияФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Если ФормаКонструктора=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Данные = ФормаКонструктора.ПолучитьТекстОписанияФормы();
	ФормаКонструктора.ВладелецФормы = Неопределено;
	ФормаКонструктора.ОписаниеОповещенияОЗакрытии = Неопределено;
	ФормаКонструктора = Неопределено;
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ФормаКонструктора = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СохранитьМакет" Тогда 
		
		Если Параметр=Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Объект.Данные = Параметр.ПолучитьТекстОписанияФормы();
		Параметр.ВладелецФормы = Неопределено;
		Параметр.ОписаниеОповещенияОЗакрытии = Неопределено;
		Параметр = Неопределено;
		Записать();
			
	КонецЕсли;
	
КонецПроцедуры


//ТУ_Васильев 11.07.24 ++
&НаКлиенте
Процедура ДобавитьВнешнююОбработку(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Запишите объект перед добавлением файла";
		Сообщение.Сообщить();	
	Иначе
		СтандартнаяОбработка = Ложь;
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = "Выберите файл";
		Диалог.ПолноеИмяФайла = ""; 
		Фильтр = "epf (*.epf)|*.epf"; 
		Диалог.Фильтр = Фильтр; 
		Диалог.МножественныйВыбор = Ложь;
		Диалог.Показать(Новый ОписаниеОповещения("ЗавершениеВводаПутиФайлаОбработки", ЭтаФорма, Новый Структура("Диалог", Диалог)));
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Асинх Процедура ЗавершениеВводаПутиФайлаОбработки(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		Путь = Диалог.ПолноеИмяФайла;
		ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,Путь);
		Если ОписаниеФайла <> Неопределено Тогда
			СохранитьФайл(ОписаниеФайла.Адрес,ОписаниеФайла.СсылкаНаФайл.Расширение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура СохранитьФайл(Адрес, Расширение) 
	ПутьКФайлу = ПолучитьИмяВременногоФайла(Расширение); 
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	Если Данные = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при создании временного файла";
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли; 
	
	Данные.Записать(ПутьКФайлу);
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	
	Объект.Ссылка.ПолучитьОбъект().СохранитьФайлВРеквизитВнешняяОбработка(ПутьКФайлу); 
	ЭтаФорма.Прочитать(); 
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Файл добавлен";
	Сообщение.Сообщить();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВнешнююОбработкуКоманда(Команда)
	ВнешняяОбработка = ПолучитьВнешнююОбработкуОбъекта();
	Если ВнешняяОбработка <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		Диалог.Заголовок = "Выберите каталог";
		Диалог.ПолноеИмяФайла = Объект.Наименование + ".epf"; 
		ТипыФайла = Новый Массив();
		Фильтр = "epf (*.epf)|*.epf"; 
		Диалог.МножественныйВыбор = Ложь;  
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("Диалог", Диалог);
		ДополнительныеПараметры.Вставить("ВнешняяОбработка", ВнешняяОбработка);
		Диалог.Показать(Новый ОписаниеОповещения("ЗавершениеВводаПутиФайлаДляСохранения", ЭтаФорма, ДополнительныеПараметры));	
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Внешняя обработка не добавлена";
		Сообщение.Сообщить();
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗавершениеВводаПутиФайлаДляСохранения(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Диалог = ДополнительныеПараметры.Диалог; 
	Если Диалог.Каталог <> "" Тогда
		Путь = Диалог.ПолноеИмяФайла; 
		ВнешняяОбработка = ДополнительныеПараметры.ВнешняяОбработка;
		Сообщение = Новый СообщениеПользователю;
		Попытка
			ВнешняяОбработка.Записать(Путь);	
		    Сообщение.Текст = "Файл создан";
			Сообщение.Сообщить();
		Исключение
			Сообщение.Текст = "Ошибка при записи файла";
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;			
КонецПроцедуры 

&НаСервере
Функция ПолучитьВнешнююОбработкуОбъекта()
	ВнешняяОбработка = Объект.Ссылка.ПолучитьОбъект().ВнешняяОбработка.Получить();
	Возврат ВнешняяОбработка;
КонецФункции
//ТУ_Васильев 11.07.24 --