
Функция НоваяКвазиСсылкаНаОбъект(ИмяТипа=Неопределено, GUID=Неопределено, ПредставлениеСсылки=Неопределено) Экспорт
	
	КвазиСсылка = Новый Структура;
	КвазиСсылка.Вставить("ИмяТипа", ИмяТипа);
	КвазиСсылка.Вставить("GUID", GUID);
	КвазиСсылка.Вставить("Представление", ПредставлениеСсылки);
	КвазиСсылка.Вставить("Удостоверение", ПолучитьУдостоверениеКвазиСсылки());
	
	Возврат КвазиСсылка;
	
КонецФункции

Функция ЭтоКвазиСсылка(Значение) Экспорт
	
	Удостоверение = Неопределено;
	Возврат ТипЗнч(Значение) = Тип("Структура") И
			Значение.Свойство("Удостоверение", Удостоверение) И
			Удостоверение = ПолучитьУдостоверениеКвазиСсылки();
	
КонецФункции
		
Функция ПолучитьУдостоверениеКвазиСсылки() Экспорт
	
	Возврат "Да, да я квази-ссылка, по виду не скажешь, но ты меня не спутаешь";
	
КонецФункции
