Функция ТипМаркировка() Экспорт
	
	ТипМаркировка = ПланыВидовХарактеристик.ТипыКонтейнеров.НайтиПоНаименованию("Маркировка", Истина);
	
	Если ЗначениеЗаполнено(ТипМаркировка) Тогда
		Возврат ТипМаркировка;
	Иначе
		НовыйТип = ПланыВидовХарактеристик.ТипыКонтейнеров.СоздатьЭлемент();
		НовыйТип.Заполнить(Неопределено);
		НовыйТип.Наименование = "Маркировка";
		НовыйТип.Префикс = "01";
		НовыйТип.ШаблонЭтикетки = Справочники.ШаблоныЭтикеток_WMS.НайтиПоКоду("000000001");
		НовыйТип.Записать();
		Возврат НовыйТип.Ссылка;
	КонецЕсли;
		
КонецФункции
