// Адаптация: в расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ОбщийМодуль(ИмяМодуля);
КонецФункции

Функция ЗдесьОстановиПоБратски(Адрес=Неопределено)
	// Для установки точки остановки
	ТочкаОстановы = 0;
КонецФункции

///////////////////////////////////////////////////////////////////////

Функция ВыполнитьКод(Код) Экспорт
	
	ПроцессорКода = НовыйПроцессорКода();
	КомпиляторКода_Скомпилировать(ПроцессорКода.КомпиляторКода, Код);
	ПроцессорКода_ЗаполнитьДанныеДляВыполненияКода(ПроцессорКода);
	
	ДанныеДляВыполненияКода = ПроцессорКода.ДанныеДляВыполненияКода;

	ИмяГлобальногоКласса = ПроцессорКода.КомпиляторКода.ТекстовыйПарсер.ГлобальныйКласс.ВРИмя;
	Если ДанныеДляВыполненияКода.ДанныеКлассов[ИмяГлобальногоКласса].КодыПодпрограмм["@ГЛАВНАЯ@"] <> Неопределено Тогда
		Результат = ВызовПодпрограммы(Неопределено, "", "@ГЛАВНАЯ@", ДанныеДляВыполненияКода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ГлобальныйПроцессорКода() Экспорт
	
	Перем ОбщегоНазначенияКлиентСервер;
	
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	ПроцессорКода = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрПриложения("ПроцессорКода");
	Если ПроцессорКода=Неопределено Тогда
		ПроцессорКода = НовыйПроцессорКода();
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрПриложения("ПроцессорКода", ПроцессорКода);
	КонецЕсли;
	
	Возврат ПроцессорКода;
	
КонецФункции

Функция НовыйПроцессорКода() Экспорт
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	КомпоновщикКода = НовыйКомпоновщикКода();
	
	ДанныеВыполненияМетода = Новый Структура;
	ДанныеВыполненияМетода.Вставить("ВыполнитьНативныйМетод", Ложь);
	ДанныеВыполненияМетода.Вставить("НативныйОбъект");
	
	ПроцессорКода = Новый Структура;
	ПроцессорКода.Вставить("КонтекстыИсполнения", КомпоновщикКода.КонтекстыИсполнения);
	ПроцессорКода.Вставить("КонтекстИсполнения", КомпоновщикКода.КонтекстИсполнения);
	ПроцессорКода.Вставить("КомпоновщикКода", КомпоновщикКода);
	ПроцессорКода.Вставить("СтекВызововПодпрограмм", Новый Массив);
	ПроцессорКода.Вставить("ДанныеВыполненияМетода", ДанныеВыполненияМетода);
	ПроцессорКода.Вставить("ДанныеДляВыполненияКода");
	ПроцессорКода.Вставить("ТекущиеДанныеДляВыполненияКода");
	ПроцессорКода.Вставить("ИдентификаторНовогоОбъекта", 1);
	ПроцессорКода.Вставить("ПулОбъектов", Новый Соответствие);
	ПроцессорКода.Вставить("ТипыОписанийПодпрограмм", КомпоновщикКода.ТипыОписанийПодпрограмм);
	ПроцессорКода.Вставить("ЕстьДанныеКомпиляции", Ложь);
	ПроцессорКода.Вставить("ЕстьДанныеВыполнения", Ложь);
	
	Возврат ПроцессорКода;
	
КонецФункции

Функция ПроцессорКода_ЗаполнитьДанныеДляВыполненияКода(ПроцессорКода) Экспорт
	
	Перем РК;
	
	КомпоновщикКода = ПроцессорКода.КомпоновщикКода;
	ДанныеКомпиляции = КомпоновщикКода.Данные;
	Если НЕ ДанныеКомпиляции.Свойство(ПроцессорКода.КонтекстИсполнения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеКомпиляцииГлавногоКонтекстаИсполнения = ДанныеКомпиляции[ПроцессорКода.КонтекстИсполнения];
	Если НЕ ДанныеКомпиляцииГлавногоКонтекстаИсполнения.Свойство("СДаннымиКонтекста") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ДанныеДляВыполненияКода = ДанныеКомпиляцииГлавногоКонтекстаИсполнения.СДаннымиКонтекста;
	
	ТипыОписанийПодпрограмм = КомпоновщикКода.ТипыОписанийПодпрограмм;
	
	Для Каждого ДанныеДляВыполненияКодаКонтекста Из КомпоновщикКода.ДанныеМассив Цикл
		
		// обновим данные при переходе в другой контекст исполнения
		ДанныеДляВыполненияКодаКонтекста.Вставить("ОбновитьДанныеКонтекстаИсполнения", Истина);
		
		ОбщиеОбъектыКлассов = Новый Структура;
		ДанныеДляВыполненияКодаКонтекста.Вставить("ОбщиеОбъектыКлассов", ОбщиеОбъектыКлассов);

		Для Каждого ЭлементДанныеКласса Из ДанныеДляВыполненияКодаКонтекста.ДанныеКлассов Цикл
			
			ДанныеКласса = ЭлементДанныеКласса.Значение;

			Для Каждого ЭлементОписанияПодпрограммы Из ДанныеКласса.ОписанияПодпрограмм Цикл
				ОписаниеПодпрограммы = ЭлементОписанияПодпрограммы.Значение;
				Если ОписаниеПодпрограммы.Тип=ТипыОписанийПодпрограмм.Переход Тогда
					ДирективаПерехода = ОписаниеПодпрограммы.Данные;
					ДанныеДляВыполненияКодаКонтекстаИсполненияПослеПерехода = ДанныеКомпиляции[ДирективаПерехода.КонтекстИсполнения];
					Если ДирективаПерехода.ИспользоватьДанныеКонтекста Тогда
						ДанныеДляВыполненияКодаКонтекстаИсполненияПослеПерехода = ДанныеДляВыполненияКодаКонтекстаИсполненияПослеПерехода.СДаннымиКонтекста;
					Иначе
						ДанныеДляВыполненияКодаКонтекстаИсполненияПослеПерехода = ДанныеДляВыполненияКодаКонтекстаИсполненияПослеПерехода.БезДанныхКонтекста;
					КонецЕсли;
					ОписаниеПодпрограммы.Данные = ДанныеДляВыполненияКодаКонтекстаИсполненияПослеПерехода;
				КонецЕсли;
			КонецЦикла;
			
			//ИмяКласса = ЭлементДанныеКласса.Ключ;
			//Если ИмяКласса<>"" Тогда
			//	ПроцессорКода.ТекущиеДанныеДляВыполненияКода = ДанныеДляВыполненияКодаКонтекста;
			//	ОбщийОбъектКласса = вмс_КлассныеОбъекты.НовыйОбъект(ИмяКласса, , ПроцессорКода);
			//	ОбщиеОбъектыКлассов.Вставить(ИмяКласса, ОбщийОбъектКласса);
			//КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПроцессорКода.ДанныеДляВыполненияКода = ДанныеДляВыполненияКода;
	ПроцессорКода.ТекущиеДанныеДляВыполненияКода = ДанныеДляВыполненияКода;
	
КонецФункции

Функция ПроцессорКода_ДобавитьПрограммныйМодуль(ПрограммныйМодуль) Экспорт
	
	ПроцессорКода = ГлобальныйПроцессорКода();
	
	Если КомпоновщикКода_Скомпилировать(ПроцессорКода.КомпоновщикКода, ПрограммныйМодуль) Тогда
		ПроцессорКода_ЗаполнитьДанныеДляВыполненияКода(ПроцессорКода);
	КонецЕсли;
	
КонецФункции

//{
//	Процессорные функции+
//

Функция ВызовПодпрограммы(ОбъектКонтекста_e8a17f9465ac4b1dbd98b4f6427d0162, ТипОбъекта, ИмяМетода, ПроцессорКода, Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162="ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162", Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162="ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162", Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162="ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162", Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162="ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162", Параметр5_e8a17f9465ac4b1dbd98b4f6427d0162="ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162", Параметр6_e8a17f9465ac4b1dbd98b4f6427d0162="ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162", Параметр7_e8a17f9465ac4b1dbd98b4f6427d0162="ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162", Параметр8_e8a17f9465ac4b1dbd98b4f6427d0162="ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162") Экспорт

	КлассныйОбъект = вмс_КлассныеОбъекты.ПолучитьКлассныйОбъект(ОбъектКонтекста_e8a17f9465ac4b1dbd98b4f6427d0162, ПроцессорКода);
	
	Если ТипОбъекта=Неопределено Тогда
		
		// неявная типизация
		Если КлассныйОбъект <> Неопределено Тогда
			ТипОбъекта = КлассныйОбъект.ИмяКлассаДляВыполненияКода;
		Иначе
			// Не удалось определить тип объекта
			// будет вызван его нативный метод
			ПроцессорКода.ДанныеВыполненияМетода.НативныйОбъект = ОбъектКонтекста_e8a17f9465ac4b1dbd98b4f6427d0162;
			ПроцессорКода.ДанныеВыполненияМетода.ВыполнитьНативныйМетод = Истина;
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	ТипыОписанийПодпрограмм = ПроцессорКода.ТипыОписанийПодпрограмм;

	ДанныеКласса = ПроцессорКода.ТекущиеДанныеДляВыполненияКода.ДанныеКлассов[ТипОбъекта];
	ОписаниеПодпрограммы = ДанныеКласса.ОписанияПодпрограмм[ИмяМетода];
	Если ОписаниеПодпрограммы=Неопределено ИЛИ ОписаниеПодпрограммы.Тип=ТипыОписанийПодпрограмм.Нативная Тогда
		// метод не определен
		Если ДанныеКласса.ИспользоватьНативныеМетоды Тогда
			// попробуем вызвать нативный метод
			ПроцессорКода.ДанныеВыполненияМетода.НативныйОбъект = КлассныйОбъект.НативныйОбъект;
			ПроцессорКода.ДанныеВыполненияМетода.ВыполнитьНативныйМетод = Истина;
		Иначе
			ВызватьИсключение "Метод """ + ИмяМетода + """ класса """ + ТипОбъекта + """ не определен!";
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	КадрСтека = ДобавитьВызовПодпрограммыВСтек(ОбъектКонтекста_e8a17f9465ac4b1dbd98b4f6427d0162, ТипОбъекта, ИмяМетода, ПроцессорКода, Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр5_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр6_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр7_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр8_e8a17f9465ac4b1dbd98b4f6427d0162);
	
	Если КадрСтека.КоличествоПереданныхПараметров < ОписаниеПодпрограммы.КоличествоОбязательныхПараметров Тогда
		УдалитьВызовПодпрограммыИзСтека(ПроцессорКода);
		ВызватьИсключение "Недостаточно фактических парамеров";
	КонецЕсли;
	
	Если КадрСтека.КоличествоПереданныхПараметров > ОписаниеПодпрограммы.КоличествоПараметров Тогда
		УдалитьВызовПодпрограммыИзСтека(ПроцессорКода);
		ВызватьИсключение "Слишком много фактических парамеров";
	КонецЕсли;
	
	Если ОписаниеПодпрограммы.Тип=ТипыОписанийПодпрограмм.Код Тогда
		
		КодПодпрограммы = ОписаниеПодпрограммы.Данные;
		
		Результат_e8a17f9465ac4b1dbd98b4f6427d0162 = Неопределено;
		Выполнить(КодПодпрограммы);
		Результат = Результат_e8a17f9465ac4b1dbd98b4f6427d0162;
		
	ИначеЕсли ОписаниеПодпрограммы.Тип=ТипыОписанийПодпрограмм.Переход Тогда

		ПереходПодпрограммы = ОписаниеПодпрограммы.Данные;
		
		Если ПереходПодпрограммы.КонтекстИсполнения=ПроцессорКода.ТекущиеДанныеДляВыполненияКода.КонтекстИсполнения Тогда
			// Ближний переход (просто меняем данные для выполнения кода и останемся в текущем контексте исполнения кода)
			ТекущиеДанныеДляВыполненияКода = ПроцессорКода.ТекущиеДанныеДляВыполненияКода;
			ПроцессорКода.ТекущиеДанныеДляВыполненияКода = ПереходПодпрограммы;
			Результат =
				ВызовПодпрограммы(ОбъектКонтекста_e8a17f9465ac4b1dbd98b4f6427d0162, ТипОбъекта, ИмяМетода, ПроцессорКода, Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр5_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр6_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр7_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр8_e8a17f9465ac4b1dbd98b4f6427d0162);
			ПроцессорКода.ТекущиеДанныеДляВыполненияКода = ТекущиеДанныеДляВыполненияКода;
		Иначе
			// Дальний переход в другой контекст исполнения кода (на сервер или на бэкенд). Reise, Reise, эээх...
			Результат =
				ВызовПодпрограммыПередПереходом(ОбъектКонтекста_e8a17f9465ac4b1dbd98b4f6427d0162, ТипОбъекта, ИмяМетода, ПроцессорКода, ПереходПодпрограммы, Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр5_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр6_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр7_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр8_e8a17f9465ac4b1dbd98b4f6427d0162);
		КонецЕсли;
		
	ИначеЕсли ОписаниеПодпрограммы.Тип=ТипыОписанийПодпрограмм.Наследование Тогда
		
		ИмяКлассаПредка = ОписаниеПодпрограммы.Данные;
		
		КлассныйОбъект.ИмяКлассаДляВыполненияКода = ИмяКлассаПредка;
		Результат =
			ВызовПодпрограммы(ОбъектКонтекста_e8a17f9465ac4b1dbd98b4f6427d0162, ИмяКлассаПредка, ИмяМетода, ПроцессорКода, Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр5_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр6_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр7_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр8_e8a17f9465ac4b1dbd98b4f6427d0162);
		КлассныйОбъект.ИмяКлассаДляВыполненияКода = ТипОбъекта;
		
	КонецЕсли;
	
	ПроцессорКода.ДанныеВыполненияМетода.НативныйОбъект = Неопределено;
	ПроцессорКода.ДанныеВыполненияМетода.ВыполнитьНативныйМетод = Ложь;

	УдалитьВызовПодпрограммыИзСтека(ПроцессорКода);
	
	Возврат Результат;
	
КонецФункции

Функция ВызовПодпрограммыПередПереходом(знач ОбъектКонтекста, ТипОбъекта, ИмяМетода, ПроцессорКода, ДанныеДляВыполненияКодаПослеПерехода, Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр5_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр6_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр7_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр8_e8a17f9465ac4b1dbd98b4f6427d0162) Экспорт

	ПараметрыВызоваПодпрограммы = Новый Массив;
	ПараметрыВызоваПодпрограммы.Добавить(ОбъектКонтекста);
	ПараметрыВызоваПодпрограммы.Добавить(ТипОбъекта);
	ПараметрыВызоваПодпрограммы.Добавить(ИмяМетода);
	ПараметрыВызоваПодпрограммы.Добавить(Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыВызоваПодпрограммы.Добавить(Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыВызоваПодпрограммы.Добавить(Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыВызоваПодпрограммы.Добавить(Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыВызоваПодпрограммы.Добавить(Параметр5_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыВызоваПодпрограммы.Добавить(Параметр6_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыВызоваПодпрограммы.Добавить(Параметр7_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыВызоваПодпрограммы.Добавить(Параметр8_e8a17f9465ac4b1dbd98b4f6427d0162);
	
	ПараметрыВызоваКонтекстаИсполнения = Новый Структура;
	ПараметрыВызоваКонтекстаИсполнения.Вставить("Действие", "ИсполнениеКода");
	ПараметрыВызоваКонтекстаИсполнения.Вставить("ПараметрыВызоваПодпрограммы", ПараметрыВызоваПодпрограммы);
	ПараметрыВызоваКонтекстаИсполнения.Вставить("ДанныеДляВыполненияКода", ДанныеДляВыполненияКодаПослеПерехода);
	ПараметрыВызоваКонтекстаИсполнения.Вставить("ИспользоватьКэш", Истина);
	ПараметрыВызоваКонтекстаИсполнения.Вставить("КонтекстИсполнения", ДанныеДляВыполненияКодаПослеПерехода.КонтекстИсполнения);
	ПараметрыВызоваКонтекстаИсполнения.Вставить("ИспользоватьДанныеКонтекста", ДанныеДляВыполненияКодаПослеПерехода.ИспользоватьДанныеКонтекста);
	ПараметрыВызоваКонтекстаИсполнения.Вставить("ПроцессорКода", ПроцессорКода);
	
	Результат = ВызватьКонтекстИсполнения(ПараметрыВызоваКонтекстаИсполнения);

	Возврат Результат;

КонецФункции

Функция ДобавитьВызовПодпрограммыВСтек(Объект, ТипОбъекта, ИмяМетода, ПроцессорКода, Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр5_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр6_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр7_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр8_e8a17f9465ac4b1dbd98b4f6427d0162)
	
	ПараметрыМассив = Новый Массив;
	ПараметрыМассив.Добавить(Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыМассив.Добавить(Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыМассив.Добавить(Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыМассив.Добавить(Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыМассив.Добавить(Параметр5_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыМассив.Добавить(Параметр6_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыМассив.Добавить(Параметр7_e8a17f9465ac4b1dbd98b4f6427d0162);
	ПараметрыМассив.Добавить(Параметр8_e8a17f9465ac4b1dbd98b4f6427d0162);
	
	КоличествоПереданныхПараметров = ПараметрыМассив.Количество();
	Пока КоличествоПереданныхПараметров > 0 Цикл
		Если ПараметрыМассив[КоличествоПереданныхПараметров-1]<>"ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162" Тогда
			Прервать;
		КонецЕсли;
		КоличествоПереданныхПараметров = КоличествоПереданныхПараметров - 1;
	КонецЦикла;
	
	КадрСтека = Новый Структура;
	КадрСтека.Вставить("Объект", Объект);
	КадрСтека.Вставить("ТипОбъекта", ТипОбъекта);
	КадрСтека.Вставить("ИмяМетода", ИмяМетода);
	КадрСтека.Вставить("Параметр1", Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162);
	КадрСтека.Вставить("Параметр2", Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162);
	КадрСтека.Вставить("Параметр3", Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162);
	КадрСтека.Вставить("Параметр4", Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162);
	КадрСтека.Вставить("Параметр5", Параметр5_e8a17f9465ac4b1dbd98b4f6427d0162);
	КадрСтека.Вставить("Параметр6", Параметр6_e8a17f9465ac4b1dbd98b4f6427d0162);
	КадрСтека.Вставить("Параметр7", Параметр7_e8a17f9465ac4b1dbd98b4f6427d0162);
	КадрСтека.Вставить("Параметр8", Параметр8_e8a17f9465ac4b1dbd98b4f6427d0162);
	КадрСтека.Вставить("КоличествоПереданныхПараметров", КоличествоПереданныхПараметров);
	ПроцессорКода.СтекВызововПодпрограмм.Добавить(КадрСтека);
	Возврат КадрСтека;
	
КонецФункции

Функция ПолучитьВызовПодпрограммыИзСтека(Номер=0, ПроцессорКода)

	СтекВызовов = ПроцессорКода.СтекВызововПодпрограмм;
	Если Номер>СтекВызовов.Количество()-1 Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	КадрСтека = СтекВызовов[СтекВызовов.Количество()-1-Номер];
	
	Возврат КадрСтека;
	
КонецФункции

Функция УдалитьВызовПодпрограммыИзСтека(ПроцессорКода)

	СтекВызовов = ПроцессорКода.СтекВызововПодпрограмм;
	СтекВызовов.Удалить(СтекВызовов.ВГраница());
	
КонецФункции

Функция ПолучитьИтераторКоллекции(Коллекция, ПроцессорКода)

	ИтераторКоллекции = ВызовПодпрограммы(Коллекция, Неопределено, "ИТЕРАТОРКОЛЛЕКЦИИ", ПроцессорКода);
	
	Если ПроцессорКода.ДанныеВыполненияМетода.ВыполнитьНативныйМетод Тогда
		
		ИтераторКоллекции = ПроцессорКода.ДанныеВыполненияМетода.НативныйОбъект;
		
	КонецЕсли;
	
	Возврат ИтераторКоллекции;

КонецФункции

Функция ПереопределениеСозданияНовогоОбъекта(знач ТипОбъекта, ПроцессорКода, знач Параметр1=null, знач Параметр2=null, знач Параметр3=null, знач Параметр4=null) Экспорт
	
	Если ТипОбъекта=Неопределено Тогда
		ТипОбъекта = ВРЕГ(Параметр1);
		ПараметрыСоздания = Параметр2;
	Иначе
		ПараметрыСоздания = Новый Массив;
		ПараметрыСоздания.Добавить(Параметр1);
		ПараметрыСоздания.Добавить(Параметр2);
		ПараметрыСоздания.Добавить(Параметр3);
		ПараметрыСоздания.Добавить(Параметр4);
		НомерЭлемента = ПараметрыСоздания.Количество();
		Пока НомерЭлемента>0 Цикл
			НомерЭлемента = НомерЭлемента - 1;
			Если ПараметрыСоздания.Получить(НомерЭлемента)<>null Тогда
				Прервать;
			КонецЕсли;
			ПараметрыСоздания.Удалить(НомерЭлемента);
		КонецЦикла;
	КонецЕсли;

	ТипОбъекта = ВРЕГ(ТипОбъекта);
	НовыйОбъект = вмс_КлассныеОбъекты.НовыйОбъект(ТипОбъекта, , ПроцессорКода);
	Если НовыйОбъект<>Неопределено Тогда
		Возврат НовыйОбъект;
	КонецЕсли;
	
	Если ТипОбъекта="ОПИСАНИЕОПОВЕЩЕНИЯ" Тогда
		
		СОО = ПереопределениеСозданияНовогоОписанияОповещения(ПараметрыСоздания, ПроцессорКода);
		
		Если СОО<>Неопределено Тогда
			Возврат СОО;
		КонецЕсли;
			
	КонецЕсли;
	
	// стандартное создание объекта
	НовыйОбъект = Новый(ТипОбъекта, ПараметрыСоздания);
	Возврат НовыйОбъект;
	
КонецФункции

Функция ПереопределениеСозданияНовогоОписанияОповещения(ПараметрыСоздания, ПроцессорКода)

	Модуль = ПараметрыСоздания[1];
	КлассныйОбъектМодуля = вмс_КлассныеОбъекты.ПолучитьКлассныйОбъект(Модуль, ПроцессорКода);
	Если КлассныйОбъектМодуля=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяОбработчика = ВРег(ПараметрыСоздания[0]);
		
	ДанныеКласса = ПроцессорКода.ТекущиеДанныеДляВыполненияКода.ДанныеКлассов[КлассныйОбъектМодуля.ИмяКласса];
	ОписаниеПодпрограммы = ДанныеКласса.ОписанияПодпрограмм[ИмяОбработчика];
	Если ОписаниеПодпрограммы=Неопределено Тогда
		ВызватьИсключение "Обработчик оповещения """ + КлассныйОбъектМодуля.ИмяКласса + "." + ИмяОбработчика + """ не обнаружен!";
	КонецЕсли;
	
	Если ОписаниеПодпрограммы.КоличествоПараметров=1 Тогда
		ИмяСервисногоОбработчикаОповещения = "ОбработчикОповещенияСОднимПараметром";
	Иначе
		ИмяСервисногоОбработчикаОповещения = "ОбработчикОповещенияСДвумяПараметрами";
	КонецЕсли;
	
	Если ТипЗнч(Модуль)=Тип("ФормаКлиентскогоПриложения") И Модуль.ИмяФормы="ОбщаяФорма.вмс_ФормаШаблон" Тогда
		// Для пущей натуральности интерпретации кода укажем обработчик на шаблонной форме,
		// коли есть такая возможность
		МодульСОО = Модуль;
	Иначе
		// в общем случае используем текущий модуль
		МодульСОО = вмс_ВыполнениеПрограммногоКода;
	КонецЕсли;
		
	ДополнительныеПараметрыСОО = Новый Структура;
	ДополнительныеПараметрыСОО.Вставить("ИмяОбработчика", ИмяОбработчика);
	ДополнительныеПараметрыСОО.Вставить("Модуль", Модуль);
	ДополнительныеПараметрыСОО.Вставить("ИмяКласса", КлассныйОбъектМодуля.ИмяКласса);
	ДополнительныеПараметрыСОО.Вставить("ДополнительныеПараметры", ПараметрыСоздания[2]);
	ДополнительныеПараметрыСОО.Вставить("ПроцессорКода", ПроцессорКода);

	ПараметрыСозданияСОО = Новый Массив;
	ПараметрыСозданияСОО.Добавить(ИмяСервисногоОбработчикаОповещения);
	ПараметрыСозданияСОО.Добавить(МодульСОО);
	ПараметрыСозданияСОО.Добавить(ДополнительныеПараметрыСОО);
	СОО = Новый ("ОписаниеОповещения", ПараметрыСозданияСОО);
		
	Возврат СОО;
		

КонецФункции

Функция ОбработчикОповещенияСОднимПараметром(ДополнительныеПараметрыСОО) Экспорт
	
	ВызовПодпрограммы(ДополнительныеПараметрыСОО.Модуль, ДополнительныеПараметрыСОО.ИмяКласса, ДополнительныеПараметрыСОО.ИмяОбработчика,  ДополнительныеПараметрыСОО.ПроцессорКода, ДополнительныеПараметрыСОО.ДополнительныеПараметры);
	
КонецФункции

Функция ОбработчикОповещенияСДвумяПараметрами(Результат, ДополнительныеПараметрыСОО) Экспорт

	ВызовПодпрограммы(ДополнительныеПараметрыСОО.Модуль, ДополнительныеПараметрыСОО.ИмяКласса, ДополнительныеПараметрыСОО.ИмяОбработчика,  ДополнительныеПараметрыСОО.ПроцессорКода, Результат, ДополнительныеПараметрыСОО.ДополнительныеПараметры);
	
КонецФункции

//
//	Процессорные функции-
//}

//{
//	Компоновщик кода+
//
//	Собирает данные программных модулей, в том числе клиентские и серверные части модулей,
//	анализирует актуальность программных модулей и зависимости от других модулей
//

Функция НовыйКомпоновщикКода() Экспорт
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	КомпиляторКода = НовыйКомпиляторКода();
	
	ТаблицаПрограммныхМодулей = РК.НоваяКоллекцияЗначений("Ссылка, СкомпилированныйТекст, Текст, Зависимости, Проверен, Актуальность");
	РК.ДобавитьИндексКоллекции(ТаблицаПрограммныхМодулей, "Ссылка");
	
	КонтекстИсполнения = КомпиляторКода.КонтекстИсполнения;
	КонтекстыИсполнения = КомпиляторКода.КонтекстыИсполнения;
	ВызываемыеКонтекстыИсполненияМассив = Новый Массив;
	КонтекстИсполненияНайден = Ложь;
	Для Каждого ЭлементКонтекстаИсполнения Из КонтекстыИсполнения Цикл
		Если КонтекстИсполненияНайден Тогда
			ВызываемыеКонтекстыИсполненияМассив.Добавить(ЭлементКонтекстаИсполнения.Ключ);
		Иначе
			Если КонтекстИсполнения=ЭлементКонтекстаИсполнения.Ключ Тогда
				КонтекстИсполненияНайден = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	КомпоновщикКода = Новый Структура;
	КомпоновщикКода.Вставить("КомпиляторКода", КомпиляторКода);
	КомпоновщикКода.Вставить("КонтекстыИсполнения", КонтекстыИсполнения);
	КомпоновщикКода.Вставить("КонтекстИсполнения", КонтекстИсполнения);
	КомпоновщикКода.Вставить("ВызываемыеКонтекстыИсполненияМассив", ВызываемыеКонтекстыИсполненияМассив);
	КомпоновщикКода.Вставить("ТаблицаПрограммныхМодулей", ТаблицаПрограммныхМодулей);
	КомпоновщикКода.Вставить("ТекущиеДанныеКомпоновкиПрограммногоМодуля");
	КомпоновщикКода.Вставить("Данные", Новый Структура);
	КомпоновщикКода.Вставить("ДанныеМассив", Новый Массив);
	КомпоновщикКода.Вставить("ТипыОписанийПодпрограмм", КомпиляторКода.ТипыОписанийПодпрограмм);
	
	КомпоновщикКода_ИнициализироватьДанныеКомпиляции(КомпоновщикКода);
	
	Возврат КомпоновщикКода;
	
КонецФункции

Функция КомпоновщикКода_ИнициализироватьДанныеКомпиляции(КомпоновщикКода)

	КомпоновщикКода.Данные.Очистить();
	КомпоновщикКода.ДанныеМассив.Очистить();
	
	Для Каждого ЭлементКонтекстаИсполнения Из КомпоновщикКода.КонтекстыИсполнения Цикл
		
		КонтекстИсполнения = ЭлементКонтекстаИсполнения.Ключ;
		ДанныеКомпиляцииКонтекстаИсполнения = КомпиляторКода_НовыеДанныеКомпиляцииКонтекстаИсполнения(КомпоновщикКода.КомпиляторКода, КонтекстИсполнения);
		
		КомпоновщикКода.Данные.Вставить(КонтекстИсполнения, ДанныеКомпиляцииКонтекстаИсполнения);
		Для Каждого ЭлементДанныеДирективы Из ДанныеКомпиляцииКонтекстаИсполнения Цикл
			ДанныеДирективы = ЭлементДанныеДирективы.Значение;
			КомпоновщикКода.ДанныеМассив.Добавить(ДанныеДирективы);
		КонецЦикла;
		
	КонецЦикла;

КонецФункции

Функция КомпоновщикКода_Скомпилировать(КомпоновщикКода, ПрограммныеМодули) Экспорт
	
	Если Не КомпоновщикКода_СкомпилироватьКонтекстИсполнения(КомпоновщикКода, ПрограммныеМодули, КомпоновщикКода.КонтекстИсполнения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ВызываемыйКонтекстИсполнения Из КомпоновщикКода.ВызываемыеКонтекстыИсполненияМассив Цикл
		КомпоновщикКода_СкомпилироватьВызываемыйКонтекстИсполнения(КомпоновщикКода, ПрограммныеМодули, ВызываемыйКонтекстИсполнения);
	КонецЦикла;
	
	КомпоновщикКода_АктуализироватьПрограммныеМодули(КомпоновщикКода);

	Возврат Истина;
	
КонецФункции

Функция КомпоновщикКода_СкомпилироватьКонтекстИсполнения(КомпоновщикКода, ПрограммныеМодули, КонтекстИсполнения) Экспорт
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	МассивКомпилируемыхПрограммныхМодулей = РК.ЗначениеВМассив(ПрограммныеМодули);
	
	Для Каждого ДанныеКомпоновкиМодуля Из РК.ПолучитьЭлементыКоллекции(КомпоновщикКода.ТаблицаПрограммныхМодулей) Цикл
		ДанныеКомпоновкиМодуля.Проверен = Ложь;
	КонецЦикла;
	
	КомпиляторКода = КомпоновщикКода.КомпиляторКода;
	КомпиляторКода.КонтекстИсполнения = КонтекстИсполнения;
	КомпиляторКода.Данные = КомпоновщикКода.Данные[КонтекстИсполнения];
	
	ДанныеОбновленны = Ложь;
	
	Для Каждого ПрограммныйМодуль Из МассивКомпилируемыхПрограммныхМодулей Цикл
		
		Если КомпоновщикКода_ПроверитьАктуальностьПрограммногоМодуля(КомпоновщикКода, ПрограммныйМодуль, МассивКомпилируемыхПрограммныхМодулей) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеКомпоновкиМодуля = КомпоновщикКода.ТекущиеДанныеКомпоновкиПрограммногоМодуля;
		КомпиляторКода_Скомпилировать(КомпиляторКода, ДанныеКомпоновкиМодуля.Текст);
		КомпоновщикКода_ЗаполнитьЗависимостиМодуля(КомпоновщикКода, ДанныеКомпоновкиМодуля, КомпиляторКода.Зависимости);
		
		ДанныеОбновленны = Истина;
		
	КонецЦикла;
	
	Возврат ДанныеОбновленны;
	
КонецФункции

Функция КомпоновщикКода_СкомпилироватьВызываемыйКонтекстИсполнения(КомпоновщикКода, ПрограммныеМодули, КонтекстИсполнения) Экспорт

	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	

	ДанныеКомпоновщикаКода = Новый Структура;
	ДанныеКомпоновщикаКода.Вставить("ТаблицаПрограммныхМодулей", РК.ПолучитьЭлементыКоллекции(КомпоновщикКода.ТаблицаПрограммныхМодулей));
	ДанныеКомпоновщикаКода.Вставить("ДанныеКомпиляцииДирективКонтекстаИсполнения", КомпоновщикКода_ПолучитьДанныеКомпиляцииДирективКонтекстаИсполнения(КомпоновщикКода, КонтекстИсполнения));
	
	ПараметрыВызоваКонтекстаИсполнения = Новый Структура;
	ПараметрыВызоваКонтекстаИсполнения.Вставить("Действие", "КомпиляцияКода");
	ПараметрыВызоваКонтекстаИсполнения.Вставить("ИспользоватьКэш", Истина);
	ПараметрыВызоваКонтекстаИсполнения.Вставить("ПрограммныеМодули", ПрограммныеМодули);
	ПараметрыВызоваКонтекстаИсполнения.Вставить("КонтекстИсполнения", КонтекстИсполнения);
	ПараметрыВызоваКонтекстаИсполнения.Вставить("ДанныеКомпоновщикаКода", ДанныеКомпоновщикаКода);

	ДанныеКомпоновщикаКода = ВызватьКонтекстИсполнения(ПараметрыВызоваКонтекстаИсполнения);
	
	КомпоновщикКода_ЗагрузитьДанныеКомпиляцииДирективКонтекстовИсполнения(КомпоновщикКода, ДанныеКомпоновщикаКода.ДанныеКомпиляцииДирективКонтекстаИсполнения);
	
КонецФункции

Функция КомпоновщикКода_ПолучитьДанныеКомпиляцииДирективКонтекстаИсполнения(КомпоновщикКода, КонтекстИсполнения) Экспорт
	
	ДанныеКомпиляцииДирективКонтекстаИсполнения = Новый Массив;
	Для Каждого ДанныеКомпиляцииДирективыКонтекстаИсполнения Из КомпоновщикКода.ДанныеМассив Цикл
		Если ДанныеКомпиляцииДирективыКонтекстаИсполнения.КонтекстИсполнения=КонтекстИсполнения Тогда
			ДанныеКомпиляцииДирективКонтекстаИсполнения.Добавить(ДанныеКомпиляцииДирективыКонтекстаИсполнения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеКомпиляцииДирективКонтекстаИсполнения;
	
КонецФункции

Функция КомпоновщикКода_ЗагрузитьДанныеКомпиляцииДирективКонтекстовИсполнения(КомпоновщикКода, ДанныеКомпиляцииДирективКонтекстовИсполнения) Экспорт
	
	Для Каждого ДанныеКомпиляцииДирективыКонтекстаИсполнения Из ДанныеКомпиляцииДирективКонтекстовИсполнения Цикл
		
		ДанныеКомпиляцииКонтекстаИсполненияПриемник = КомпоновщикКода.Данные[ДанныеКомпиляцииДирективыКонтекстаИсполнения.КонтекстИсполнения];
		
		Если ДанныеКомпиляцииДирективыКонтекстаИсполнения.ИспользоватьДанныеКонтекста Тогда
			ДанныеКомпиляцииДирективыКонтекстаИсполненияПриемник = ДанныеКомпиляцииКонтекстаИсполненияПриемник.СДаннымиКонтекста;
		Иначе
			ДанныеКомпиляцииДирективыКонтекстаИсполненияПриемник = ДанныеКомпиляцииКонтекстаИсполненияПриемник.БезДанныхКонтекста;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДанныеКомпиляцииДирективыКонтекстаИсполненияПриемник, ДанныеКомпиляцииДирективыКонтекстаИсполнения);
		
	КонецЦикла;
	
КонецФункции

Функция КомпоновщикКода_ЗаполнитьЗависимостиМодуля(КомпоновщикКода, ДанныеКомпоновкиМодуля, Зависимости)
	
	Для Каждого Включение Из Зависимости.Включения Цикл
		
		Если ДанныеКомпоновкиМодуля.Зависимости.Включения.Найти(Включение)=Неопределено Тогда
			ДанныеКомпоновкиМодуля.Зависимости.Включения.Добавить(Включение);
			КомпоновщикКода_ПроверитьАктуальностьПрограммногоМодуля(КомпоновщикКода, Включение);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Использование Из Зависимости.Использования Цикл
		
		Если ДанныеКомпоновкиМодуля.Зависимости.Использования.Найти(Использование)=Неопределено Тогда
			ДанныеКомпоновкиМодуля.Зависимости.Использования.Добавить(Использование);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция КомпоновщикКода_ПроверитьАктуальностьПрограммногоМодуля(КомпоновщикКода, ПрограммныйМодуль, МассивКомпилируемыхПрограммныхМодулей=Неопределено)
	
	Если ТипЗнч(ПрограммныйМодуль)=Тип("Структура") Тогда
		Ссылка = ПрограммныйМодуль.Ссылка;
	ИначеЕсли ТипЗнч(ПрограммныйМодуль)=Тип("СправочникСсылка.вмс_ПрограммныеМодули") Тогда
		Ссылка = ПрограммныйМодуль;
	Иначе
		Ссылка = вмс_ВыполнениеПрограммногоКодаВызовСервера.НайтиПрограммныйМодуль(ПрограммныйМодуль);
	КонецЕсли;

	ДанныеКомпоновкиМодуля = КомпоновщикКода_ПолучитьДанныеКомпоновкиПрограммногоМодуля(КомпоновщикКода, Ссылка);
	Если ДанныеКомпоновкиМодуля.Проверен Тогда
		КомпоновщикКода.ТекущиеДанныеКомпоновкиПрограммногоМодуля = ДанныеКомпоновкиМодуля;
		Возврат ДанныеКомпоновкиМодуля.Актуальность;
	КонецЕсли;
	
	Если ТипЗнч(ПрограммныйМодуль)=Тип("Структура") Тогда
		ДанныеМодуля = ПрограммныйМодуль;
	Иначе
		ДанныеМодуля = вмс_ВыполнениеПрограммногоКодаВызовСервера.ПолучитьДанныеПрограммногоМодуля(ПрограммныйМодуль);
	КонецЕсли;
	
	ДанныеКомпоновкиМодуля.Проверен = Истина;
	ДанныеКомпоновкиМодуля.Актуальность = Истина;
	ДанныеКомпоновкиМодуля.Текст = ДанныеМодуля.Текст;
	
	Если ДанныеКомпоновкиМодуля.СкомпилированныйТекст<>ДанныеКомпоновкиМодуля.Текст Тогда
		ДанныеКомпоновкиМодуля.Актуальность = Ложь;
	КонецЕсли;
	
	Если ДанныеКомпоновкиМодуля.Актуальность Тогда
		
		Для Каждого ВключаемыйМодуль Из ДанныеКомпоновкиМодуля.Зависимости.Включения Цикл
			
			Если Не КомпоновщикКода_ПроверитьАктуальностьПрограммногоМодуля(КомпоновщикКода, ВключаемыйМодуль, МассивКомпилируемыхПрограммныхМодулей) Тогда
				// Включаемый модуль изменился
				// требуется перекомпилировать текущий модуль
				ДанныеКомпоновкиМодуля.Актуальность = Ложь;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;

	Если МассивКомпилируемыхПрограммныхМодулей=Неопределено Тогда
		МассивКомпилируемыхПрограммныхМодулей = Новый Массив;
	КонецЕсли;
	
	Для Каждого ИспользуемыйМодуль Из ДанныеКомпоновкиМодуля.Зависимости.Использования Цикл
		
		Если Не КомпоновщикКода_ПроверитьАктуальностьПрограммногоМодуля(КомпоновщикКода, ИспользуемыйМодуль, МассивКомпилируемыхПрограммныхМодулей) Тогда
			Если МассивКомпилируемыхПрограммныхМодулей.Найти(ИспользуемыйМодуль)=Неопределено Тогда
				// Используемый модуль изменился, его надо перекомпилировать для взаимодействия с текущим модулем
				МассивКомпилируемыхПрограммныхМодулей.Добавить(ИспользуемыйМодуль);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ДанныеКомпоновкиМодуля.Актуальность Тогда
		
		ДанныеКомпоновкиМодуля.Зависимости.Включения.Очистить();
		ДанныеКомпоновкиМодуля.Зависимости.Использования.Очистить();
		
	КонецЕсли;
	
	КомпоновщикКода.ТекущиеДанныеКомпоновкиПрограммногоМодуля = ДанныеКомпоновкиМодуля;
	Возврат ДанныеКомпоновкиМодуля.Актуальность;
	
КонецФункции

Функция КомпоновщикКода_АктуализироватьПрограммныеМодули(КомпоновщикКода)

	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");

	Для Каждого ДанныеКомпоновкиМодуля Из РК.ПолучитьЭлементыКоллекции(КомпоновщикКода.ТаблицаПрограммныхМодулей) Цикл
		ДанныеКомпоновкиМодуля.СкомпилированныйТекст = ДанныеКомпоновкиМодуля.Текст;
	КонецЦикла;
	
КонецФункции

Функция КомпоновщикКода_ПолучитьДанныеКомпоновкиПрограммногоМодуля(КомпоновщикКода, Ссылка)
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	Отбор = Новый Структура("Ссылка", Ссылка);
	ДанныеКомпоновкиМодуля = РК.НайтиЭлементКоллекции(КомпоновщикКода.ТаблицаПрограммныхМодулей, Отбор);
	
	Если ДанныеКомпоновкиМодуля=Неопределено Тогда
		ДанныеКомпоновкиМодуля = РК.ДобавитьЭлементКоллекции(КомпоновщикКода.ТаблицаПрограммныхМодулей, Отбор);
		ДанныеКомпоновкиМодуля.Проверен = Ложь;
		ДанныеКомпоновкиМодуля.Актуальность = Ложь;
		ДанныеКомпоновкиМодуля.Зависимости = Новый Структура;
		ДанныеКомпоновкиМодуля.Зависимости.Вставить("Включения", Новый Массив);
		ДанныеКомпоновкиМодуля.Зависимости.Вставить("Использования", Новый Массив);
	КонецЕсли;
	
	Возврат ДанныеКомпоновкиМодуля;
	
КонецФункции

//
//	Компоновщик кода-
//}


Функция ПолучитьТекстПрограммногоМодуля(ПрограммныйМодуль) Экспорт
	
	Если ТипЗнч(ПрограммныйМодуль)=Тип("Структура") Тогда
		ТекстМодуля = ПрограммныйМодуль.Текст;
	Иначе
		ТекстМодуля = вмс_ВыполнениеПрограммногоКодаВызовСервера.ПолучитьТекстПрограммногоМодуля(ПрограммныйМодуль);
	КонецЕсли;
	
	Возврат ТекстМодуля;
		
КонецФункции

//{
//	Компилятор кода+
//

Функция НовыйКомпиляторКода() Экспорт
	
	Перем РК, ОбщегоНазначенияКлиентСервер;
	
	ТекстовыйПарсер = НовыйТекстовыйПарсер();
	КонтекстыИсполнения = ТекстовыйПарсер.КонтекстыИсполнения;

	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	Если ОбщегоНазначенияКлиентСервер.ЭтоКлиент() Тогда
		КонтекстИсполнения = КонтекстыИсполнения.Клиент;
	Иначе
		КонтекстИсполнения = КонтекстыИсполнения.Сервер;
	КонецЕсли;

	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	ОбработчикиОжидания = РК.НоваяКвазиТаблицаЗначений("ИмяПроцедуры, Интервал, Однократно, ВремяНачала");
	ОбработкаОжидания = Новый Структура;
	ОбработкаОжидания.Вставить("ОбработчикиОжидания", ОбработчикиОжидания);
	ОбработкаОжидания.Вставить("Время", 0);
	ОбработкаОжидания.Вставить("КратностьВремени", 10); //срабатывает 10 раз в секунду
	
	ТипыОписанийПодпрограмм = РК.НовоеПеречисление("Нативная, Код, Переход, Наследование");
	
	КомпиляторКода = Новый Структура;
	КомпиляторКода.Вставить("ФункцииДляВызововПодпрограмм", Новый Соответствие);
	КомпиляторКода.Вставить("ФункцииДляСозданияНовыхОбъектов", Новый Соответствие);
	КомпиляторКода.Вставить("ИдентификаторОбъектаКонтекста");
	КомпиляторКода.Вставить("ИспользоватьКэш", Истина);
	КомпиляторКода.Вставить("ТекстовыйПарсер", ТекстовыйПарсер);
	КомпиляторКода.Вставить("ОбработкаОжидания", ОбработкаОжидания);
	КомпиляторКода.Вставить("Данные", Новый Структура);
	КомпиляторКода.Вставить("КонтекстИсполнения", КонтекстИсполнения);
	КомпиляторКода.Вставить("Зависимости", ТекстовыйПарсер.Зависимости);
	
	КомпиляторКода.Вставить("ТипыОписанийПодпрограмм", ТипыОписанийПодпрограмм);
	КомпиляторКода.Вставить("КонтекстыИсполнения", КонтекстыИсполнения);
	КомпиляторКода.Вставить("ДирективыКонтекстовИсполнения", ТекстовыйПарсер.ДирективыКонтекстовИсполнения);
	КомпиляторКода.Вставить("ДирективыКонтекстовИсполненияМассив", ТекстовыйПарсер.ДирективыКонтекстовИсполненияМассив);
	
	ИменаПараметровВызоваПодпрограммы = "Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр5_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр6_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр7_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр8_e8a17f9465ac4b1dbd98b4f6427d0162";
	ИмяПеременнойРезультатПодпрограммы = "Результат_e8a17f9465ac4b1dbd98b4f6427d0162";
	КомпиляторКода_УказатьФункциюДляВызововПодпрограмм(КомпиляторКода, "ВызовПодпрограммы", "НаКлиенте, НаКлиентеБезКонтекста, НаСервере, НаСервереБезКонтекста", ИменаПараметровВызоваПодпрограммы, ИмяПеременнойРезультатПодпрограммы);
	КомпиляторКода_УказатьФункциюДляСозданияНовыхОбъектов(КомпиляторКода, "ПереопределениеСозданияНовогоОбъекта", "НаКлиенте, НаКлиентеБезКонтекста, НаСервере, НаСервереБезКонтекста", ИменаПараметровВызоваПодпрограммы);
	КомпиляторКода_УказатьИдентификаторОбъектаКонтекста(КомпиляторКода, "ОбъектКонтекста_e8a17f9465ac4b1dbd98b4f6427d0162");

	Возврат КомпиляторКода;
	
КонецФункции

Функция КомпиляторКода_Скомпилировать(КомпиляторКода, ТекстМодуля) Экспорт

	КомпиляторКода_РазобратьТекст(КомпиляторКода, ТекстМодуля);
	КомпиляторКода_ПреобразоватьКодМодуля(КомпиляторКода);
	ТекстовыйПарсер_СформироватьКодМодуля(КомпиляторКода.ТекстовыйПарсер);
	КомпиляторКода_ЗаполнитьДанные(КомпиляторКода);
	ТекстовыйПарсер_Очистить(КомпиляторКода.ТекстовыйПарсер);
	
КонецФункции

Функция КомпиляторКода_ЗаполнитьДанные(КомпиляторКода, ВспомогательныеДанные=Ложь) Экспорт

	Перем РК;
	
	ТипыОписанийПодпрограмм = КомпиляторКода.ТипыОписанийПодпрограмм;
	КонтекстИсполнения = КомпиляторКода.КонтекстИсполнения;
	
	ДирективыКонтекстаИсполнения = Новый Массив;
	Для Каждого ДирективаКонтекстаИсполнения Из КомпиляторКода.ДирективыКонтекстовИсполненияМассив Цикл
		
		Если ДирективаКонтекстаИсполнения.КонтекстИсполнения=КонтекстИсполнения Тогда
			
			ДирективыКонтекстаИсполнения.Добавить(ДирективаКонтекстаИсполнения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	МассивПодпрограмм = РК.ПолучитьЭлементыКоллекции(ТекстовыйПарсер.ТаблицаПодпрограмм);
	МассивКлассов = РК.ПолучитьЭлементыКоллекции(ТекстовыйПарсер.ТаблицаКлассов);
	
	ДанныеКонтекстаИсполнения = КомпиляторКода.Данные;
	
	Для Каждого Директива Из ДирективыКонтекстаИсполнения Цикл
		
		Если Директива.ИспользоватьДанныеКонтекста Тогда
			ДанныеДирективы = ДанныеКонтекстаИсполнения.СДаннымиКонтекста;
		Иначе
			ДанныеДирективы = ДанныеКонтекстаИсполнения.БезДанныхКонтекста;
		КонецЕсли;
		
		ДанныеКлассов = ДанныеДирективы.ДанныеКлассов;
		Для Каждого Класс Из МассивКлассов Цикл
			ДанныеКласса = Новый Структура;
			ДанныеКласса.Вставить("Поля", Новый Структура(Класс.ИменаПолей));
			ДанныеКласса.Вставить("КодыПодпрограмм", Новый Соответствие);
			ДанныеКласса.Вставить("ПереходыПодпрограмм", Новый Соответствие);
			ДанныеКласса.Вставить("НаследованиеМетодов", Новый Соответствие);
			ДанныеКласса.Вставить("ОписанияПодпрограмм", Новый Соответствие);
			ДанныеКласса.Вставить("НативныеМетоды", Новый Соответствие);
			ДанныеКласса.Вставить("ИспользоватьНативныеМетоды", Класс.ИспользоватьНативныеМетоды);
			ДанныеКласса.Вставить("Предки", Новый Массив);
			ДанныеКласса.Вставить("Конструкторы", Новый Массив);
			ДанныеКлассов[Класс.ВРИмя] = ДанныеКласса;
		КонецЦикла;
		
		Для Каждого Подпрограмма Из МассивПодпрограмм Цикл
			ИмяПодпрограммы = Подпрограмма.ВРИмя;

			ДополнительныеДанныеПодпрограммы = Подпрограмма.ДополнительныеДанные;
			ИмяКласса = ДополнительныеДанныеПодпрограммы.Класс.ВРИмя;
			ДанныеКласса = ДанныеКлассов[ИмяКласса];
			
			ДирективаПодпрограммы = Подпрограмма.Директива;
			
			Если Директива<>ДирективаПодпрограммы И Директива.ВозможныеПереходы[ДирективаПодпрограммы.Имя]<>Истина Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыПодпрограммы = РК.ПолучитьЭлементыКоллекции(Подпрограмма.ТаблицаПараметров);
			КоличествоОбязательныхПараметровПодпрограммы =ПараметрыПодпрограммы.Количество();
			Пока КоличествоОбязательныхПараметровПодпрограммы>0 Цикл
				Если ПараметрыПодпрограммы[КоличествоОбязательныхПараметровПодпрограммы-1].ЗначениеПоУмолчанию=Неопределено Тогда
					Прервать;
				КонецЕсли;
				КоличествоОбязательныхПараметровПодпрограммы = КоличествоОбязательныхПараметровПодпрограммы - 1;
			КонецЦикла;
			
			ОписаниеПодпрограммы = Новый Структура;
			ОписаниеПодпрограммы.Вставить("Имя", ИмяПодпрограммы);
			ОписаниеПодпрограммы.Вставить("Тип");
			ОписаниеПодпрограммы.Вставить("Данные");
			ОписаниеПодпрограммы.Вставить("КоличествоПараметров", ПараметрыПодпрограммы.Количество());
			ОписаниеПодпрограммы.Вставить("КоличествоОбязательныхПараметров", КоличествоОбязательныхПараметровПодпрограммы);
			
			Если Подпрограмма.Нативная Тогда
				
				ДанныеКласса.НативныеМетоды[ИмяПодпрограммы] = Истина;
				ОписаниеПодпрограммы.Тип = ТипыОписанийПодпрограмм.Нативная
					
			Иначе
				
				Если Директива=ДирективаПодпрограммы Тогда
					КодПодпрограммы = ДополнительныеДанныеПодпрограммы.Тело.Код;
					ДанныеКласса.КодыПодпрограмм[ИмяПодпрограммы] = КодПодпрограммы;
					ОписаниеПодпрограммы.Тип = ТипыОписанийПодпрограмм.Код;
					ОписаниеПодпрограммы.Данные = КодПодпрограммы;
				Иначе
					ДанныеКласса.ПереходыПодпрограмм[ИмяПодпрограммы] = ДирективаПодпрограммы;
					ОписаниеПодпрограммы.Тип = ТипыОписанийПодпрограмм.Переход;
					ОписаниеПодпрограммы.Данные = ДирективаПодпрограммы;
				КонецЕсли;
				
			КонецЕсли;
			
			ДанныеКласса.ОписанияПодпрограмм[ИмяПодпрограммы] = ОписаниеПодпрограммы;
			
		КонецЦикла;
		
		//наследование
		Для Каждого Класс Из МассивКлассов Цикл

			ИмяКласса = Класс.ВРИмя;
			ДанныеКласса = ДанныеКлассов[ИмяКласса];
			Для Каждого Предок Из Класс.Предки Цикл
				
				ДанныеПредкаКласса = ДанныеКлассов[Предок];
				Если ДанныеПредкаКласса=Неопределено И ДанныеКлассов<>Неопределено Тогда
					ДанныеПредкаКласса = ДанныеКлассов[Предок];
				КонецЕсли;
				
				Если ДанныеПредкаКласса=Неопределено Тогда
					ВызватьИсключение "Класс """ + Предок + """ не определен!";
				КонецЕсли;
				
				Для Каждого Поле Из ДанныеПредкаКласса.Поля Цикл
					ДанныеКласса.Поля.Вставить(Поле.Ключ);
				КонецЦикла;
					
				Для Каждого ЭлементОписанияПодпрограммы Из ДанныеПредкаКласса.ОписанияПодпрограмм Цикл
					ОписаниеПодпрограммыПредка = ЭлементОписанияПодпрограммы.Значение;
					ИмяПодпрограммы = ОписаниеПодпрограммыПредка.Имя;
					Если ДанныеКласса.ОписанияПодпрограмм[ИмяПодпрограммы]=Неопределено Тогда
						ОписаниеПодпрограммы = РК.СкопироватьОбъект(ОписаниеПодпрограммыПредка);
						ОписаниеПодпрограммы.Тип = ТипыОписанийПодпрограмм.Наследование;
						ОписаниеПодпрограммы.Данные = Предок;
						ДанныеКласса.ОписанияПодпрограмм[ИмяПодпрограммы] = ОписаниеПодпрограммы;
						ДанныеКласса.НаследованиеМетодов[ИмяПодпрограммы] = Предок;
					КонецЕсли;
				КонецЦикла;
				
				ДанныеКласса.Предки.Добавить(Предок);
				РК.ДобавитьЭлементыКоллекции(ДанныеКласса.Конструкторы, ДанныеПредкаКласса.Конструкторы);
				
			КонецЦикла;
			
			ИмяКонструктора = "@ГЛАВНАЯ@";
			Если ДанныеКласса.КодыПодпрограмм[ИмяКонструктора]<>Неопределено Тогда
				ДанныеКласса.Конструкторы.Добавить(ИмяКонструктора);
			КонецЕсли;
			
			ИмяКонструктора = ИмяКласса;
			Если ДанныеКласса.КодыПодпрограмм[ИмяКонструктора]<>Неопределено Тогда
				ДанныеКласса.Конструкторы.Добавить(ИмяКонструктора);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВспомогательныеДанные Тогда
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("ЗаменаИдентификаторовОбщихОбъектовКлассов", Новый Соответствие);
			
			ПрефиксИдентификатораОбщегоОбъектаКласса = "ПроцессорКода.ТекущиеДанныеДляВыполненияКода.ОбщиеОбъектыКлассов.";
			Для Каждого Класс Из МассивКлассов Цикл

				ДанныеКласса = ДанныеКлассов[Класс.ВРИмя];
				ДополнительныеДанные.ЗаменаИдентификаторовОбщихОбъектовКлассов[Класс.ВРИмя] = ПрефиксИдентификатораОбщегоОбъектаКласса + Класс.ВРИмя;
				
				ДополнительныеДанныеКласса = Новый Структура;
				ДополнительныеДанныеКласса.Вставить("ДоступныеПоляМассив", Новый Массив);
				ДополнительныеДанныеКласса.Вставить("ОпределенныеПодпрограммыСоответствие", Новый Соответствие);
				ДополнительныеДанныеКласса.Вставить("ДоступныеПодпрограммыМассив", Новый Массив);
				ДополнительныеДанныеКласса.Вставить("ИдентификаторыУказателейТекущегоОбъекта", Класс.ИдентификаторыУказателейТекущегоОбъекта);

				Для Каждого ПолеКласса Из ДанныеКласса.Поля Цикл
					ДополнительныеДанныеКласса.ДоступныеПоляМассив.Добавить(ПолеКласса.Ключ);
				КонецЦикла;
				РК.ДобавитьЭлементыКоллекции(ДополнительныеДанныеКласса.ДоступныеПоляМассив, Класс.ИменаНативныхПолейМассив);
				
				Для Каждого ЭлементОписанияПодпрограммы Из ДанныеКласса.ОписанияПодпрограмм Цикл
					ИмяПодпрограммы = ЭлементОписанияПодпрограммы.Ключ;
					ОписаниеПодпрограммы = ЭлементОписанияПодпрограммы.Значение;
					Если ОписаниеПодпрограммы.Тип<>ТипыОписанийПодпрограмм.Нативная Тогда
						ДополнительныеДанныеКласса.ОпределенныеПодпрограммыСоответствие[ИмяПодпрограммы] = Истина;
					КонецЕсли;
					ДополнительныеДанныеКласса.ДоступныеПодпрограммыМассив.Добавить(ИмяПодпрограммы);
				КонецЦикла;
				
				ДанныеКласса.Вставить("ДополнительныеДанные", ДополнительныеДанныеКласса);
			КонецЦикла;
		КонецЕсли;
		
		ДанныеДирективы.ДополнительныеДанные = ДополнительныеДанные;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция КомпиляторКода_НовыеДанныеКомпиляцииКонтекстаИсполнения(КомпиляторКода, КонтекстИсполнения)
	
	ДанныеКомпиляцииКонтекста = Новый Структура;
	
	Для Каждого ДирективаКонтекстаИсполнения Из КомпиляторКода.ДирективыКонтекстовИсполненияМассив Цикл
		
		Если ДирективаКонтекстаИсполнения.КонтекстИсполнения=КонтекстИсполнения Тогда
			
			ДанныеКомпиляцииДирективы = КомпиляторКода_НовыеДанныеКомпиляцииДирективыКонтекстаИсполнения(КомпиляторКода, ДирективаКонтекстаИсполнения);
			
			Если ДанныеКомпиляцииДирективы.ИспользоватьДанныеКонтекста Тогда
				
				ДанныеКомпиляцииКонтекста.Вставить("СДаннымиКонтекста", ДанныеКомпиляцииДирективы);
				
			Иначе

				ДанныеКомпиляцииКонтекста.Вставить("БезДанныхКонтекста", ДанныеКомпиляцииДирективы);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеКомпиляцииКонтекста;
	
КонецФункции

Функция КомпиляторКода_НовыеДанныеКомпиляцииДирективыКонтекстаИсполнения(КомпиляторКода, Директива)
	
	ДанныеКомпиляцииДирективы = Новый Структура;
	ДанныеКомпиляцииДирективы.Вставить("ДанныеКлассов", Новый Соответствие);
	ДанныеКомпиляцииДирективы.Вставить("Директива", Директива);
	ДанныеКомпиляцииДирективы.Вставить("КонтекстИсполнения", Директива.КонтекстИсполнения);
	ДанныеКомпиляцииДирективы.Вставить("ИспользоватьДанныеКонтекста", Директива.ИспользоватьДанныеКонтекста);
	ДанныеКомпиляцииДирективы.Вставить("ДополнительныеДанные");
	
	Возврат ДанныеКомпиляцииДирективы;

КонецФункции

Функция ПолучитьНастройкиКомпилятораКода(КомпиляторКода)
	
	НастройкиКомпилятора = Новый Структура("ФункцииДляВызововПодпрограмм, ФункцииДляСозданияНовыхОбъектов");
	ЗаполнитьЗначенияСвойств(НастройкиКомпилятора, КомпиляторКода);
	Возврат НастройкиКомпилятора;
	
КонецФункции

Функция УстановитьНастройкиКомпилятораКода(КомпиляторКода, НастройкиКомпилятора) Экспорт
	
	Если НастройкиКомпилятора=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(КомпиляторКода, НастройкиКомпилятора);
	Возврат Истина;
	
КонецФункции

Функция КомпиляторКода_РазобратьТекст(КомпиляторКода, ТекстМодуля) Экспорт

	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	
	ЗдесьОстановиПоБратски();
	
	
	ТекстовыйПарсер.КонтекстИсполнения = КомпиляторКода.КонтекстИсполнения;
	ТекстовыйПарсер_РазобратьТекст(ТекстовыйПарсер, ТекстМодуля);
	
	//ОТЛАДКА
	ТекстовыйПарсер_СформироватьКодМодуля(ТекстовыйПарсер);
	
	Возврат Истина;
	
КонецФункции

Функция КомпиляторКода_ПолучитьОписаниеПодпрограммы(КомпиляторКода, ИмяПодпрограммы) Экспорт
	
	Перем РК;
	
	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ОписаниеПодпрограммы = РК.НайтиЭлементКоллекции(ТекстовыйПарсер.ТаблицаПодпрограмм, Новый Структура("ВРИмя", ВРЕГ(ИмяПодпрограммы)));

	Возврат ОписаниеПодпрограммы;
	
КонецФункции

Функция КомпиляторКода_УказатьФункциюДляВызововПодпрограмм(КомпиляторКода, ИмяФункции, ДирективыВыполнения, Параметры=Неопределено, ПеременнаяДляВозвратаРезультата=Неопределено) Экспорт
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ПараметрыМассив = РК.ЗначениеВМассив(Параметры, , Ложь);
	ДирективыВыполненияМассив = РК.ЗначениеВМассив(ДирективыВыполнения, , Ложь);
	
	ФункцияДляВызововПодпрограмм = Новый Структура;
	ФункцияДляВызововПодпрограмм.Вставить("Имя", ИмяФункции);
	ФункцияДляВызововПодпрограмм.Вставить("Параметры", ПараметрыМассив);
	ФункцияДляВызововПодпрограмм.Вставить("ПеременнаяДляВозвратаРезультата", ПеременнаяДляВозвратаРезультата);
	
	Для Каждого ДирективаВыполнения Из ДирективыВыполненияМассив Цикл
		КомпиляторКода.ФункцииДляВызововПодпрограмм[ВРЕГ(ДирективаВыполнения)] = ФункцияДляВызововПодпрограмм;
	КонецЦикла;
	
КонецФункции

Функция КомпиляторКода_УказатьФункциюДляСозданияНовыхОбъектов(КомпиляторКода, ИмяФункции, ДирективыВыполнения, Параметры=Неопределено) Экспорт
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ПараметрыМассив = РК.ЗначениеВМассив(Параметры);
	
	ФункцияДляСозданияНовыхОбъектов = Новый Структура;
	ФункцияДляСозданияНовыхОбъектов.Вставить("Имя", ИмяФункции);
	ФункцияДляСозданияНовыхОбъектов.Вставить("Параметры", ПараметрыМассив);
	
	МассивДирективВыполнения = РК.ЗначениеВМассив(ДирективыВыполнения, , Ложь);
	Для Каждого ДирективаВыполнения Из МассивДирективВыполнения Цикл
		ДирективаВыполнения = ВРЕГ(ДирективаВыполнения);
		КомпиляторКода.ФункцииДляСозданияНовыхОбъектов[ДирективаВыполнения] = ФункцияДляСозданияНовыхОбъектов;
	КонецЦикла;
	
КонецФункции

Функция КомпиляторКода_УказатьИдентификаторОбъектаКонтекста(КомпиляторКода, Идентификатор) Экспорт
	
	КомпиляторКода.ИдентификаторОбъектаКонтекста = Идентификатор;
	
КонецФункции

Функция КомпиляторКода_ПреобразоватьКодМодуля(КомпиляторКода) Экспорт
	
	КомпиляторКода_ПреобразоватьКодПодпрограмм(КомпиляторКода);
	
КонецФункции

Функция КомпиляторКода_ПреобразоватьКодПодпрограмм(КомпиляторКода, Подпрограммы=Неопределено) Экспорт

	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	Если Подпрограммы<>Неопределено Тогда
		МассивПодпрограмм = РК.ЗначениеВМассив(Подпрограммы, , Ложь);
	Иначе
		МассивПодпрограмм = РК.ПолучитьЭлементыКоллекции(КомпиляторКода.ТекстовыйПарсер.ТаблицаПодпрограмм);
	КонецЕсли;
	
	КомпиляторКода_ЗаполнитьДанные(КомпиляторКода, Истина);
	
	Для Каждого Подпрограмма Из МассивПодпрограмм Цикл
		
		Если Подпрограмма.Объявление Тогда
			Продолжить;
		КонецЕсли;
		
		КомпиляторКода_ПреобразоватьКодПодпрограммы(КомпиляторКода, Подпрограмма);
		
	КонецЦикла;
	
КонецФункции

Функция КомпиляторКода_ПреобразоватьКодПодпрограммы(КомпиляторКода, Подпрограмма)
	
	КомпиляторКода_ПреобразоватьЛокальныеПеременныеПодпрограммы(КомпиляторКода, Подпрограмма);
	КомпиляторКода_ПреобразоватьПараметрыПодпрограммы(КомпиляторКода, Подпрограмма);
	КомпиляторКода_ПреобразоватьВозвратИзПодпрограммы(КомпиляторКода, Подпрограмма);
	КомпиляторКода_ПоместитьИдентификаторыПодпрограммыВКонтекстОбъекта(КомпиляторКода, Подпрограмма);
	КомпиляторКода_ПреобразоватьИдентификаторыОбщихОбъектовКлассовПодпрограммы(КомпиляторКода, Подпрограмма);
	//КомпиляторКода_ПреобразоватьВызовыПодпрограмм(КомпиляторКода, Подпрограмма);
	КомпиляторКода_ПреобразоватьСозданиеНовыхОбъектов(КомпиляторКода, Подпрограмма);
	КомпиляторКода_ПреобразоватьПодключениеОтключениеОбработчиковОжидания(КомпиляторКода, Подпрограмма);
	//КомпиляторКода_ПреобразоватьДобавленияКомандФормы(КомпиляторКода, Подпрограмма);
	
	КомпиляторКода_ПреобразоватьЦиклыПодпрограммы(КомпиляторКода, Подпрограмма);
	КомпиляторКода_РазорватьЦепочкиУсловныхОператоров(КомпиляторКода, Подпрограмма);
	КомпиляторКода_РазвернутьВыраженияПодпрограммы(КомпиляторКода, Подпрограмма);
	КомпиляторКода_ПреобразоватьВызовыМетодовПодпрограммы(КомпиляторКода, Подпрограмма);
	
КонецФункции

Функция КомпиляторКода_ПоместитьИдентификаторыПодпрограммыВКонтекстОбъекта(КомпиляторКода, Подпрограмма)

	ИмяКласса = Подпрограмма.ДополнительныеДанные.Класс.ВРИмя;
	ДанныеКонтекста = КомпиляторКода.Данные;
	Если Подпрограмма.Директива.ИспользоватьДанныеКонтекста Тогда
		ДанныеКласса = ДанныеКонтекста.СДаннымиКонтекста.ДанныеКлассов[ИмяКласса];
	Иначе
		//ДанныеКласса = ДанныеКонтекста.БезДанныхКонтекста.ДанныеКлассов[ИмяКласса];
		Возврат Ложь;
	КонецЕсли;
	
	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	ПрефиксОбъекта = КомпиляторКода.ИдентификаторОбъектаКонтекста + ".";
	
	////////////////
	ЗаменыИдентификаторовПолейКласса = Новый Соответствие;
	Для Каждого ИмяПоля Из ДанныеКласса.ДополнительныеДанные.ДоступныеПоляМассив Цикл
		ЗаменыИдентификаторовПолейКласса[ИмяПоля] = ПрефиксОбъекта + ИмяПоля;
	КонецЦикла;
	ТекстовыйПарсер_ЗаменитьИдентификаторыПодпрограммы(ТекстовыйПарсер, Подпрограмма, ЗаменыИдентификаторовПолейКласса, Ложь);
	
	////////////////
	ЗаменыИдентификаторовМетодовКласса = Новый Соответствие;
	Для Каждого ДоступнаяПодпрограмма Из ДанныеКласса.ДополнительныеДанные.ДоступныеПодпрограммыМассив Цикл
		ЗаменыИдентификаторовМетодовКласса[ДоступнаяПодпрограмма] = ПрефиксОбъекта + ДоступнаяПодпрограмма;
	КонецЦикла;
	
	ТекстовыйПарсер_ЗаменитьИдентификаторыПодпрограммы(ТекстовыйПарсер, Подпрограмма, ЗаменыИдентификаторовМетодовКласса, Истина);
	Для Каждого ПреобразованныйОператор Из Подпрограмма.ДополнительныеДанные.ПреобразованныеОператоры Цикл
		опВызовМетода = ПреобразованныйОператор;
		ИмяМетода = ВРЕГ(опВызовМетода.ДополнительныеДанные.ВызываемаяПодпрограмма.Код);
		опВызовМетода.ДополнительныеДанные.ИмяКласса = ИмяКласса;
		опВызовМетода.ДополнительныеДанные.МетодОпределен = ДанныеКласса.ДополнительныеДанные.ОпределенныеПодпрограммыСоответствие[ИмяМетода]=Истина;
		опВызовМетода.ДополнительныеДанные.ИспользоватьНативныеМетоды = ДанныеКласса.ИспользоватьНативныеМетоды;
	КонецЦикла;
	
	// заменим идентификаторы указателей текущего объекта на "ОбъектКонтекста"
	ЗаменаИдентификаторовУказателейТекущегоОбъекта = Новый Соответствие;
	Для Каждого ИдентификаторУказателяТекущегоОбъекта Из ДанныеКласса.ДополнительныеДанные.ИдентификаторыУказателейТекущегоОбъекта Цикл
		ЗаменаИдентификаторовУказателейТекущегоОбъекта[ИдентификаторУказателяТекущегоОбъекта] = КомпиляторКода.ИдентификаторОбъектаКонтекста;
	КонецЦикла;
	ТекстовыйПарсер_ЗаменитьИдентификаторыПодпрограммы(ТекстовыйПарсер, Подпрограмма, ЗаменаИдентификаторовУказателейТекущегоОбъекта, Ложь);

	тВызовМетода = ТекстовыйПарсер.ТипыСловИОператоров.ВызовМетода;
	Для Каждого ПреобразованныйОператор Из Подпрограмма.ДополнительныеДанные.ПреобразованныеОператоры Цикл
		опРодитель = ПреобразованныйОператор.Родитель;
		Если опРодитель.ТипОператора=тВызовМетода Тогда
			опВызовМетода = опРодитель;
			ИмяМетода = ВРЕГ(опВызовМетода.ДополнительныеДанные.ВызываемаяПодпрограмма.Код);
			опВызовМетода.ДополнительныеДанные.ИмяКласса = ИмяКласса;
			опВызовМетода.ДополнительныеДанные.МетодОпределен = ДанныеКласса.ДополнительныеДанные.ОпределенныеПодпрограммыСоответствие[ИмяМетода]=Истина;
			опВызовМетода.ДополнительныеДанные.ИспользоватьНативныеМетоды = ДанныеКласса.ИспользоватьНативныеМетоды;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

Функция КомпиляторКода_ПреобразоватьЛокальныеПеременныеПодпрограммы(КомпиляторКода, Подпрограмма)

	Перем РК;
	
	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	МассивПеременных = РК.ПолучитьЭлементыКоллекции(Подпрограмма.ТаблицаПеременных);
	Если МассивПеременных.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТипыОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	МассивОператоровЛокальныеПеременные = РК.НайтиЭлементыКоллекции(Подпрограмма.ДополнительныеДанные.Тело.Операторы, Новый Структура("ТипОператора", ТипыОператоров.ЛокальныеПеременные));
	Если МассивОператоровЛокальныеПеременные.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	тСпецсимвол = ТипыОператоров.Спецсимвол;
	тИдентификатор = ТипыОператоров.Идентификатор;
	
	слНеопределено = Слово(тИдентификатор, "Неопределено");
	
	ЗаменаИдентификаторов = Новый Соответствие;
	КонтекстПеременных = "ЛокальныеПеременные_e8a17f9465ac4b1dbd98b4f6427d0162";
	ПрефиксПеременных = КонтекстПеременных + ".";
	Для Каждого ОператорЛокальныеПеременные Из МассивОператоровЛокальныеПеременные Цикл
		Операторы = ОператорЛокальныеПеременные.Операторы;
		Если Не (Операторы.Количество() > 0 И Операторы[0].ТипОператора=тИдентификатор И ВРЕГ(Операторы[0].Код)="ПЕРЕМ") Тогда
			Продолжить;
		КонецЕсли;
		
		Операторы.Удалить(0);
		
		Для Каждого Оператор Из Операторы Цикл
			Если Оператор.ТипОператора=тИдентификатор Тогда
				ИмяПеременной = Оператор.Код;
				НовыйОператор(ТекстовыйПарсер, , Слово("ПростоКод", ПрефиксПеременных + "Вставить(""" + ИмяПеременной + """)"), ОператорЛокальныеПеременные);
				ЗаменаИдентификаторов[ВРЕГ(ИмяПеременной)] = ПрефиксПеременных + ИмяПеременной;
			ИначеЕсли Оператор.ТипОператора=тСпецсимвол И Оператор.Код="," Тогда
				НовыйРазделительОператоров(ТекстовыйПарсер, , ОператорЛокальныеПеременные);
			КонецЕсли;
		КонецЦикла;
		
		УдалитьОператор(ОператорЛокальныеПеременные);
	КонецЦикла;
	
	ТелоПодпрограммы = Подпрограмма.ДополнительныеДанные.Тело;
	НовыйОператор(ТекстовыйПарсер, ТелоПодпрограммы, Слово("ПростоКод", КонтекстПеременных + " = Новый Структура"), 0);
	НовыйРазделительОператоров(ТекстовыйПарсер, ТелоПодпрограммы, 1);
	
	ТекстовыйПарсер_ЗаменитьИдентификаторыПодпрограммы(ТекстовыйПарсер, Подпрограмма, ЗаменаИдентификаторов, Ложь);
	
	Для Каждого ПреобразованныйОператор Из Подпрограмма.ДополнительныеДанные.ПреобразованныеОператоры Цикл
		ПреобразованныйОператор.ДополнительныеДанные.Вставить("Непреобразовывать", Истина);
	КонецЦикла;
	
КонецФункции

Функция КомпиляторКода_ПреобразоватьИдентификаторыОбщихОбъектовКлассовПодпрограммы(КомпиляторКода, Подпрограмма)

	ДанныеКонтекста = КомпиляторКода.Данные.СДаннымиКонтекста;
	ЗаменаИдентификаторовОбщихОбъектовКлассов = ДанныеКонтекста.ДополнительныеДанные.ЗаменаИдентификаторовОбщихОбъектовКлассов;

	ТекстовыйПарсер_ЗаменитьИдентификаторыПодпрограммы(КомпиляторКода.ТекстовыйПарсер, Подпрограмма, ЗаменаИдентификаторовОбщихОбъектовКлассов, Ложь);

	Для Каждого Оператор Из ПолучитьВсеОператоры(Подпрограмма.ДополнительныеДанные.ПреобразованныеОператоры) Цикл
		Оператор.ДополнительныеДанные.Вставить("Непреобразовывать", Истина);
	КонецЦикла;
	
КонецФункции

Функция КомпиляторКода_ПреобразоватьПараметрыПодпрограммы(КомпиляторКода, Подпрограмма)

	ПараметрыПодпрограммы = Подпрограмма.ТаблицаПараметров.Строки;
	Если ПараметрыПодпрограммы.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ФункцияДляВызововПодпрограмм = КомпиляторКода.ФункцииДляВызововПодпрограмм[Подпрограмма.Директива.Имя];
	Если ФункцияДляВызововПодпрограмм=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыСФ = ФункцияДляВызововПодпрограмм.Параметры;
	Если ПараметрыПодпрограммы.Количество() > ПараметрыСФ.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	опТело = Подпрограмма.ДополнительныеДанные.Тело;
	Если опТело.Операторы.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	тСпецСимвол = ТипыСловИОператоров.СпецСимвол;
	тСтрока = ТипыСловИОператоров.Строка;
	
	слЗнакРавно = Слово(тСпецСимвол, "=");
	слИЛИ = Слово(тИдентификатор, "ИЛИ");
	слНеопределено = Слово(тИдентификатор, "НЕОПРЕДЕЛЕНО");
	слПропущенныйПараметр = Слово(тСтрока, "ПропущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162");
	слОпущенныйПараметр = Слово(тСтрока, "ОпущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162");
	
	опПервый = опТело.Операторы[0];
	
	НомерПоследнегоПараметра = Мин(ПараметрыПодпрограммы.Количество(), ПараметрыСФ.Количество()) - 1;
	
	ЗаменаИдентификаторов = Новый Соответствие;
	Для НомерПараметра=0 По НомерПоследнегоПараметра Цикл
		ПараметрПодпрограммы = ПараметрыПодпрограммы[НомерПараметра];
		ИмяПараметраСервиснойФункции = ПараметрыСФ[НомерПараметра];
		слИмяПараметраСервиснойФункции = Слово(тИдентификатор, ИмяПараметраСервиснойФункции);

		// значение параметра по умолчанию
		опУсловный = НовыйУсловныйОператор(ТекстовыйПарсер, , опПервый);
		
		опЗаголовок = опУсловный.ДополнительныеДанные.Заголовок;
			НовыйОператор(ТекстовыйПарсер, опЗаголовок, слИмяПараметраСервиснойФункции);
			НовыйОператор(ТекстовыйПарсер, опЗаголовок, слЗнакРавно);
			НовыйОператор(ТекстовыйПарсер, опЗаголовок, слОпущенныйПараметр);
			НовыйОператор(ТекстовыйПарсер, опЗаголовок, слИЛИ);
			НовыйОператор(ТекстовыйПарсер, опЗаголовок, слИмяПараметраСервиснойФункции);
			НовыйОператор(ТекстовыйПарсер, опЗаголовок, слЗнакРавно);
			НовыйОператор(ТекстовыйПарсер, опЗаголовок, слПропущенныйПараметр);
		
		Если ПараметрПодпрограммы.ЗначениеПоУмолчанию<>Неопределено Тогда
			ЗначениеПоУмолчанию = ПараметрПодпрограммы.ЗначениеПоУмолчанию;
		Иначе
			ЗначениеПоУмолчанию = слНеопределено;
		КонецЕсли;
		
		опТело = опУсловный.ДополнительныеДанные.Тело; 
			НовыйОператорПрисвоениеЗначение(слИмяПараметраСервиснойФункции, ЗначениеПоУмолчанию, ТекстовыйПарсер, опТело);
			
		НовыйРазделительОператоров(ТекстовыйПарсер, , опПервый);
		
		// передач параметра по значению
		Если ПараметрПодпрограммы.ПоЗначению Тогда
			ИмяКопииПараметраСервиснойФункции = "Копия" + ИмяПараметраСервиснойФункции;
			слИмяКопииПараметраСервиснойФункции = Слово(тИдентификатор, ИмяКопииПараметраСервиснойФункции);
			НовыйОператорПрисвоениеЗначение(слИмяКопииПараметраСервиснойФункции, слИмяПараметраСервиснойФункции, ТекстовыйПарсер, , опПервый);
			НовыйРазделительОператоров(ТекстовыйПарсер, , опПервый);
			ИмяПараметраСервиснойФункции = ИмяКопииПараметраСервиснойФункции;
		КонецЕсли;
		
		ЗаменаИдентификаторов[ПараметрПодпрограммы.ВРИмя] = ИмяПараметраСервиснойФункции;
	КонецЦикла;
	
	ТекстовыйПарсер_ЗаменитьИдентификаторыПодпрограммы(ТекстовыйПарсер, Подпрограмма, ЗаменаИдентификаторов, Ложь);
	
КонецФункции

Функция КомпиляторКода_ПреобразоватьВызовыПодпрограмм(КомпиляторКода, Подпрограмма)

	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	ТипИдентификатор = ТипыСловИОператоров.Идентификатор;
	ТипСтрока = ТипыСловИОператоров.Строка;
	ТипСпецсимвол = ТипыСловИОператоров.Спецсимвол;
	
	МассивОператоров = ТекстовыйПарсер_ПолучитьОператорыПодпрограммы(КомпиляторКода.ТекстовыйПарсер, Подпрограмма, "ВызовПодпрограммы");
	
	ФункцииДляВызововПодпрограмм = КомпиляторКода.ФункцииДляВызововПодпрограмм;
	ФункцияДляВызововПодпрограмм = ФункцииДляВызововПодпрограмм[Подпрограмма.Директива.Имя];
	Если ФункцияДляВызововПодпрограмм=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ИмяГлобальногоКласса = ТекстовыйПарсер.ГлобальныйКласс.ВРИмя;
	
	ДанныеКонтекста = КомпиляторКода.Данные;
	Если Подпрограмма.Директива.ИспользоватьДанныеКонтекста Тогда
		ДанныеДляВыполненияКода = ДанныеКонтекста.СДаннымиКонтекста.ДанныеКлассов[ИмяГлобальногоКласса];
	Иначе
		ДанныеДляВыполненияКода = ДанныеКонтекста.БезДанныхКонтекста.ДанныеКлассов[ИмяГлобальногоКласса];
	КонецЕсли;
	
	слНеопределено = Слово(ТипИдентификатор, "Неопределено");
	слОбъектКонтекста = слНеопределено;
	слТипОбъекта = Слово(ТипСтрока, ИмяГлобальногоКласса);
	слПроцессорКода = Слово(ТипИдентификатор, "ПроцессорКода");

	Для Каждого ОператорГруппа Из МассивОператоров Цикл
		
		Если ОператорГруппа.Операторы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОператорИдентификаторПодпрограммы = ОператорГруппа.Операторы[0];
		ИмяВызываемойПодпрограммы = ВРЕГ(ОператорИдентификаторПодпрограммы.Код);
		Если ДанныеДляВыполненияКода.КодыПодпрограмм[ИмяВызываемойПодпрограммы]=Неопределено И ДанныеДляВыполненияКода.ПереходыПодпрограмм[ИмяВызываемойПодпрограммы]=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВызываемаяПодпрограмма = РК.НайтиЭлементКоллекции(ТекстовыйПарсер.ТаблицаПодпрограмм, Новый Структура("ВРИмя", ИмяВызываемойПодпрограммы));
		Если ВызываемаяПодпрограмма = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОператорИдентификаторПодпрограммы.Код = ФункцияДляВызововПодпрограмм.Имя;
		
		ОператорПараметрыВызоваПодпрограммы = ОператорГруппа.ДополнительныеДанные.ПараметрыВызоваПодпрограммы;
		
		// вставим значения параметров по умолчанию, если параметры не переданы
		НомерПараметра = 0;
		ПараметрыПодпрограммы = ВызываемаяПодпрограмма.ТаблицаПараметров.Строки;
		КоличествоПараметров = ПараметрыПодпрограммы.Количество();
		НомерПоследнегоПараметра = КоличествоПараметров-1;
		Для Каждого ПараметрВызоваПодпрограммы Из ОператорПараметрыВызоваПодпрограммы.Операторы Цикл
			Если ПараметрВызоваПодпрограммы.Операторы.Количество() = 0 Тогда
				// не заполнен
				Если НомерПараметра > НомерПоследнегоПараметра Тогда
					// Слишком много фактических параметров
					// выдаст ошибку
					Прервать;
				КонецЕсли;
				
				ПараметрПодпрограммы = ПараметрыПодпрограммы[НомерПараметра];
				Если ПараметрПодпрограммы.ЗначениеПоУмолчанию = Неопределено Тогда
					// Значение параметра по умолчанию не указано
					// при выполнении произойдет ошибка, ну и пущай
				Иначе
					НовыйОператор(ТекстовыйПарсер, ПараметрВызоваПодпрограммы, Слово("ПростоКод", ПараметрПодпрограммы.ЗначениеПоУмолчанию.Код));
				КонецЕсли;
			КонецЕсли;
			НомерПараметра = НомерПараметра + 1;
		КонецЦикла;
		
		// Если скобка закрылась раньше, чем были переданы все параметры, добавим их в конец
		Пока НомерПараметра <= НомерПоследнегоПараметра Цикл
			ПараметрПодпрограммы = ПараметрыПодпрограммы[НомерПараметра];
			Если ПараметрПодпрограммы.ЗначениеПоУмолчанию = Неопределено Тогда
				//ошибка
			Иначе
				ПараметрВызоваПодпрограммы = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, ОператорПараметрыВызоваПодпрограммы);
					НовыйОператор(ТекстовыйПарсер, ПараметрВызоваПодпрограммы, Слово("ПростоКод", ПараметрПодпрограммы.ЗначениеПоУмолчанию.Код));
			КонецЕсли;

			НомерПараметра = НомерПараметра + 1;
		КонецЦикла;
		
		// вставим дополнительные параметры вызываемой подпрограммы
		ПараметрВызоваПодпрограммы = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, ОператорПараметрыВызоваПодпрограммы, 0);
			НовыйОператор(ТекстовыйПарсер, ПараметрВызоваПодпрограммы, слОбъектКонтекста);

		ПараметрВызоваПодпрограммы = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, ОператорПараметрыВызоваПодпрограммы, 1);
			НовыйОператор(ТекстовыйПарсер, ПараметрВызоваПодпрограммы, слТипОбъекта);
			
		ПараметрВызоваПодпрограммы = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, ОператорПараметрыВызоваПодпрограммы, 2);
			НовыйОператор(ТекстовыйПарсер, ПараметрВызоваПодпрограммы, Слово(ТипСтрока, ИмяВызываемойПодпрограммы));
		
		ПараметрВызоваПодпрограммы = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, ОператорПараметрыВызоваПодпрограммы, 3);
			НовыйОператор(ТекстовыйПарсер, ПараметрВызоваПодпрограммы, слПроцессорКода);
	КонецЦикла;
	
КонецФункции

Функция КомпиляторКода_ПреобразоватьВозвратИзПодпрограммы(КомпиляторКода, Подпрограмма)
	
	ТелоПодпрограммы = Подпрограмма.ДополнительныеДанные.Тело;
	Если ТелоПодпрограммы=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	ФункцияДляВызововПодпрограмм = КомпиляторКода.ФункцииДляВызововПодпрограмм[Подпрограмма.Директива.Имя];
	Если ФункцияДляВызововПодпрограмм = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	ПеременнаяДляВозвратаРезультата = ФункцияДляВызововПодпрограмм.ПеременнаяДляВозвратаРезультата;
	
	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	МассивОператоров = ТекстовыйПарсер_ПолучитьОператорыПодпрограммы(КомпиляторКода.ТекстовыйПарсер, ТелоПодпрограммы, ТипыСловИОператоров.ВозвратИзПодпрограммы);
	
	МеткаПерехода = "~КонецПодпрограммы";
	СловоЗнакРавенста = Слово(ТипыСловИОператоров.Спецсимвол, "=");
	СловоТочкаСЗапятой = Слово(ТипыСловИОператоров.Спецсимвол, ";");
	СловоПереход = Слово("ПростоКод", "Перейти " + МеткаПерехода);
	
	ЕстьОператорыВозврата = Ложь;
	Для Каждого ОператорГруппа Из МассивОператоров Цикл
		
		Операторы = ОператорГруппа.Операторы;
		Оператор1 = Операторы[0];
		Если Оператор1.Код = "Возврат" Тогда
			Если ОператорГруппа.Операторы.Количество() > 1 Тогда
				// Функция возвращает результат
				// поместим его в служебную переменную
				Оператор1.Код = ПеременнаяДляВозвратаРезультата;
				НовыйОператор(ТекстовыйПарсер, ОператорГруппа, СловоЗнакРавенста, 1);
				НовыйОператор(ТекстовыйПарсер, ОператорГруппа, СловоТочкаСЗапятой);
				НовыйОператор(ТекстовыйПарсер, ОператорГруппа, СловоПереход);
			Иначе
				// Это процедура
				// нет возвращаемого результата
				// просто преобразуем в выход из подпрограммы
				Оператор1.ТипОператора = СловоПереход.ТипСлова;
				Оператор1.Код = СловоПереход.Слово;
			КонецЕсли;
			ЕстьОператорыВозврата = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОператорыВозврата Тогда
		ПоследнийОператор = ТелоПодпрограммы.Операторы[ТелоПодпрограммы.Операторы.ВГраница()];
		Если Не (ПоследнийОператор.ТипОператора=ТипыСловИОператоров.Спецсимвол И ПоследнийОператор.Код=";" ИЛИ ПоследнийОператор.ТипОператора=ТипыСловИОператоров.ЛогическийБлокПрепроцессора) Тогда
			НовыйОператор(ТекстовыйПарсер, ТелоПодпрограммы, СловоТочкаСЗапятой);
		КонецЕсли;
		
		НовыйОператор(ТекстовыйПарсер, ТелоПодпрограммы, Слово(ТипыСловИОператоров.Идентификатор, МеткаПерехода + ":"));
	КонецЕсли;
	
КонецФункции

Функция КомпиляторКода_ПреобразоватьСозданиеНовыхОбъектов(КомпиляторКода, Подпрограмма)
	
	ФункцияДляСозданияНовыхОбъектов = КомпиляторКода.ФункцииДляСозданияНовыхОбъектов[Подпрограмма.Директива.Имя];
	Если ФункцияДляСозданияНовыхОбъектов=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ИмяФункцииДляСозданияНовыхОбъектов = ФункцияДляСозданияНовыхОбъектов.Имя;
	
	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тВызовПодпрограммы = ТипыСловИОператоров.ВызовПодпрограммы;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	тПрисвоениеЗначения = ТипыСловИОператоров.ПрисвоениеЗначения;
	тСтрока = ТипыСловИОператоров.Строка;
	
	слИмяФункции = Слово(тИдентификатор, ИмяФункцииДляСозданияНовыхОбъектов);
	слНеопределено = Слово(тИдентификатор, "НЕОПРЕДЕЛЕНО");
	слПроцессорКода = Слово(тИдентификатор, "ПроцессорКода");
	
	ОператорыСозданияНовыхОбъектов = Подпрограмма.ДополнительныеДанные.ОператорыСозданияНовыхОбъектов;
	
	Для Каждого опСозданиеНовогоОбъекта Из ОператорыСозданияНовыхОбъектов Цикл
		
		// вызов подпрограммы для переопредения создания нового объекта
		опВызовПодпрограммы = опСозданиеНовогоОбъекта;
		опВызовПодпрограммы.ТипОператора = тВызовПодпрограммы;
		опТипОбъекта = опВызовПодпрограммы.ДополнительныеДанные.ОператорТипОбъекта;
		опСкобки = опВызовПодпрограммы.ДополнительныеДанные.ОператорСкобки;
		опПараметрыВызоваПодпрограммы = опВызовПодпрограммы.ДополнительныеДанные.ПараметрыВызоваПодпрограммы;

		опВызовПодпрограммы.Операторы.Очистить();
		НовыйОператор(ТекстовыйПарсер, опВызовПодпрограммы, слИмяФункции);
		ПоместитьОператор(ТекстовыйПарсер, опВызовПодпрограммы, опСкобки);
		
		опПараметрВызова = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, опПараметрыВызоваПодпрограммы, 0);
			Если опТипОбъекта<>Неопределено Тогда
				НовыйОператор(ТекстовыйПарсер, опПараметрВызова, Слово(тСтрока, опТипОбъекта.Код));
			Иначе
				НовыйОператор(ТекстовыйПарсер, опПараметрВызова, слНеопределено);
			КонецЕсли;
			
		опПараметрВызова = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, опПараметрыВызоваПодпрограммы, 1);
			НовыйОператор(ТекстовыйПарсер, опПараметрВызова, слПроцессорКода);
		
	КонецЦикла;
		
	ОператорыСозданияНовыхОбъектов.Очистить();
	
КонецФункции

Функция КомпиляторКода_ПреобразоватьПодключениеОтключениеОбработчиковОжидания(КомпиляторКода, Подпрограмма)
	
	МассивОператоровПодключениеОтключениеОбработчиковОжидания = КомпиляторКода_ПолучитьОператорыПодключениеОтключениеОбработчиковОжидания(КомпиляторКода, Подпрограмма);
	
	Для Каждого ОператорПодключениеОтключениеОбработчиковОжидания Из МассивОператоровПодключениеОтключениеОбработчиковОжидания Цикл
		
		ОператорИмяПроцедуры = ОператорПодключениеОтключениеОбработчиковОжидания.Операторы[0];
		
		ОператорИмяПроцедуры.Код = ОператорИмяПроцедуры.Код + "Переопределенная";
		
	КонецЦикла;
	
КонецФункции

Функция КомпиляторКода_ПолучитьОператорыПодключениеОтключениеОбработчиковОжидания(КомпиляторКода, Подпрограмма)
	
	МассивОператоровПодключениеОтключениеОбработчиковОжидания = Новый Массив;

	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	МассивОператоровВызовПодпрограммы = ТекстовыйПарсер_ПолучитьОператорыПодпрограммы(КомпиляторКода.ТекстовыйПарсер, Подпрограмма, ТипыСловИОператоров.ВызовПодпрограммы);
	
	Для Каждого ОператорВызовПодпрограммы Из МассивОператоровВызовПодпрограммы Цикл
		
		Если ОператорВызовПодпрограммы.Операторы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОператорИдентификатор = ОператорВызовПодпрограммы.Операторы[0];
		Если Не (ОператорИдентификатор.Код = "ПодключитьОбработчикОжидания" ИЛИ ОператорИдентификатор.Код = "ОтключитьОбработчикОжидания") Тогда
			Продолжить;
		КонецЕсли;
		
		МассивОператоровПодключениеОтключениеОбработчиковОжидания.Добавить(ОператорВызовПодпрограммы);
		
	КонецЦикла;
	
	Возврат МассивОператоровПодключениеОтключениеОбработчиковОжидания;
	
КонецФункции

Функция КомпиляторКода_ПреобразоватьДобавленияКомандФормы(КомпиляторКода, Подпрограмма)
	
	Если Подпрограмма.Директива.Имя <> "НАСЕРВЕРЕ" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	МассивОператоровВызовМетода = ТекстовыйПарсер_ПолучитьОператорыПодпрограммы(КомпиляторКода.ТекстовыйПарсер, Подпрограмма, ТипыСловИОператоров.ВызовМетода);
	
	МассивОператоровВызовМетодаКомандФормыДобавить = Новый Массив;
	
	Для Каждого ОператорВызовМетода Из МассивОператоровВызовМетода Цикл
		
		СубОператоры = ОператорВызовМетода.Операторы;
		
		Если СубОператоры.Количество() = 6 Тогда
			Если СубОператоры[0].Код = "ЭтаФорма" И СубОператоры[2].Код = "Команды" И СубОператоры[4].Код = "Добавить" Тогда
				МассивОператоровВызовМетодаКомандФормыДобавить.Добавить(ОператорВызовМетода);
			КонецЕсли;
		ИначеЕсли СубОператоры.Количество() = 4 Тогда
			Если СубОператоры[0].Код = "Команды" И СубОператоры[2].Код = "Добавить" Тогда
				МассивОператоровВызовМетодаКомандФормыДобавить.Добавить(ОператорВызовМетода);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ОператорВызоваМетодаКомандФормыДобавить Из МассивОператоровВызовМетодаКомандФормыДобавить Цикл
		
		СубОператоры = ОператорВызоваМетодаКомандФормыДобавить.Операторы;
		
		Пока СубОператоры.Количество() > 2 Цикл
			СубОператоры.Удалить(1);
		КонецЦикла;
		
		СубОператоры[0].Код = "ДобавитьКомандуФормы";
		
	КонецЦикла;
	
КонецФункции

Функция КомпиляторКода_ПоместитьПеременныеПодпрограммВКонтекст(КомпиляторКода, Контекст, ИменаПеременных, Подпрограммы) Экспорт

	ТекстовыйПарсер_ПоместитьПеременныеПодпрограммВКонтекст(КомпиляторКода.ТекстовыйПарсер, Контекст, ИменаПеременных, Подпрограммы);
	
КонецФункции

Функция КомпиляторКода_ПодключитьОбработчикОжидания(КомпиляторКода, ИмяПроцедуры, Интервал, Однократно=Ложь) Экспорт

	Перем РаботаСКоллекциями;

	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ОбработкаОжидания = КомпиляторКода.ОбработкаОжидания;
	ОбработчикиОжидания = ОбработкаОжидания.ОбработчикиОжидания;
	
	ОбработчикОжидания = РаботаСКоллекциями.НайтиЭлементКоллекции(ОбработчикиОжидания, Новый Структура("ИмяПроцедуры", ИмяПроцедуры));
	Если ОбработчикОжидания = Неопределено Тогда
		ОбработчикОжидания = РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(ОбработчикиОжидания);
	КонецЕсли;
	
	ОбработчикОжидания.ИмяПроцедуры = ИмяПроцедуры;
	ОбработчикОжидания.Интервал = Интервал;
	ОбработчикОжидания.Однократно = Однократно;
	ОбработчикОжидания.ВремяНачала = ОбработкаОжидания.Время;
	
КонецФункции

Функция КомпиляторКода_ОбработкаОжидания(КомпиляторКода) Экспорт

	Перем РаботаСКоллекциями;

	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ОбработкаОжидания = КомпиляторКода.ОбработкаОжидания;
	ОбработчикиОжидания = ОбработкаОжидания.ОбработчикиОжидания;
	
	ОбработчикиОжидания = РаботаСКоллекциями.ПолучитьЭлементыКоллекции(ОбработкаОжидания.ОбработчикиОжидания);
	
	ОтработанныеОбработчикиОжидания = Новый Массив;
	
	Для Каждого ОбработчикОжидания Из ОбработчикиОжидания Цикл
		
		Если ОбработкаОжидания.Время - ОбработчикОжидания.ВремяНачала >= ОбработчикОжидания.Интервал*ОбработкаОжидания.КратностьВремени Тогда
			ОтработанныеОбработчикиОжидания.Добавить(ОбработчикОжидания);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбработкаОжидания.Время = ОбработкаОжидания.Время + 1;
	
	Для Каждого ОтработанныйОбработчикОжидания Из ОтработанныеОбработчикиОжидания Цикл
		Если ОтработанныйОбработчикОжидания.Однократно Тогда
			РаботаСКоллекциями.УдалитьЭлементыКоллекции(ОбработчикиОжидания, ОтработанныйОбработчикОжидания);
		Иначе
			ОтработанныйОбработчикОжидания.ВремяНачала = ОбработкаОжидания.Время;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтработанныеОбработчикиОжидания;
	
КонецФункции

Функция КомпиляторКода_РазорватьЦепочкиУсловныхОператоров(КомпиляторКода, Подпрограмма)
	
	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	тЛогическийБлок = ТипыСловИОператоров.ЛогическийБлок;
	
	ДополнительныеДанныеПодпрограммы = Подпрограмма.ДополнительныеДанные;
	ДополнительныеДанныеПодпрограммы.Вставить("НомерЦепочкиУсловныхОператоров", 1);
	
	слКонецЕсли = Слово(тИдентификатор, "КонецЕсли");
	
	ОбходОператоров = Новый Массив;
	ОбходОператоров.Добавить(Подпрограмма);
	
	ИскатьНачалоБлока = Истина;
	Цепочка = Новый Массив;
	
	Для Каждого Оператор Из ОбходОператоров Цикл
		
		Для Каждого СубОператор Из Оператор.Операторы Цикл
			ОбходОператоров.Добавить(СубОператор);
		КонецЦикла;
		
		Если Оператор.ТипОператора=тЛогическийБлок Тогда
			
			опПервый = Оператор.Операторы[0];
			опПоследний = Оператор.Операторы[Оператор.Операторы.ВГраница()];
			Если ИскатьНачалоБлока Тогда
				Если опПервый.Код="Если" Тогда
					Если опПоследний.Код="КонецЕсли" Тогда
						// отдельный блок
					Иначе
						ИскатьНачалоБлока = Ложь;
						Цепочка.Добавить(Оператор);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если опПервый.Код="ИначеЕсли" ИЛИ опПервый.Код="Иначе" Тогда
					БезУсловия = опПервый.Код="Иначе";
					Цепочка.Добавить(Оператор);
					Если опПоследний.Код="КонецЕсли" Тогда
						// конец цепочки
						ИмяМеткиПерехода = "~КонецЦепочкиУсловныхОператоров" + Формат(ДополнительныеДанныеПодпрограммы.НомерЦепочкиУсловныхОператоров, "ЧГ=0");
						ДополнительныеДанныеПодпрограммы.НомерЦепочкиУсловныхОператоров = ДополнительныеДанныеПодпрограммы.НомерЦепочкиУсловныхОператоров + 1;
						слПереходНаКонецЦепочки = Слово("ПростоКод", "Перейти " + ИмяМеткиПерехода);
						ПоследнийУсловныйОператор = Цепочка[Цепочка.ВГраница()];
						Для Каждого опУсловныйОператор Из Цепочка Цикл
							
							опРодитель = опУсловныйОператор.Родитель;
							ИндексВставкиПослеУсловногоОператора = опРодитель.Операторы.Найти(опУсловныйОператор)+1;
							
							опПервый = опУсловныйОператор.Операторы[0];
							опПервый.Код = "Если";
							
							опТело = опУсловныйОператор.ДополнительныеДанные.Тело;
							Если опУсловныйОператор=ПоследнийУсловныйОператор Тогда
								НовыйОператор(ТекстовыйПарсер, опРодитель, Слово("ПростоКод", ИмяМеткиПерехода+":"), ИндексВставкиПослеУсловногоОператора);
								НовыйРазделительОператоров(ТекстовыйПарсер, опРодитель, ИндексВставкиПослеУсловногоОператора);
								Если БезУсловия Тогда
									// извлечь операторы
									Пока опТело.Операторы.Количество() > 0 Цикл
										опОператорТела = опТело.Операторы[0];
										ПоместитьОператор(ТекстовыйПарсер, , опОператорТела, опУсловныйОператор);
									КонецЦикла;
									УдалитьОператор(опУсловныйОператор);
								КонецЕсли;
							Иначе
								НовыйРазделительОператоров(ТекстовыйПарсер, опРодитель, ИндексВставкиПослеУсловногоОператора);
								НовыйОператор(ТекстовыйПарсер, опТело, слПереходНаКонецЦепочки);
								НовыйОператор(ТекстовыйПарсер, опУсловныйОператор, слКонецЕсли);
							КонецЕсли;
							
						КонецЦикла;
						
						ИскатьНачалоБлока = Истина;
						Цепочка.Очистить();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция КомпиляторКода_ПреобразоватьЦиклыПодпрограммы(КомпиляторКода, Подпрограмма)
	
	ТелоПодпрограммы = Подпрограмма.ДополнительныеДанные.Тело;
	Если ТелоПодпрограммы=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Подпрограмма.ДополнительныеДанные.Вставить("НомерЦикла", 1);
	
	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	тПрисвоениеЗначения = ТипыСловИОператоров.ПрисвоениеЗначения;
	тЛогическиБлок = ТипыСловИОператоров.ЛогическийБлок;
	тСпецсимвол = ТипыСловИОператоров.Спецсимвол;
	
	слНЕ = Слово(тИдентификатор, "НЕ");
	слИстина = Слово(тИдентификатор, "ИСТИНА");
	слБольше = Слово(тСпецсимвол, ">");
	слПрервать = Слово(тИдентификатор, "Прервать");
	слПлюс = Слово(ТипыСловИОператоров.ОперацияВыражения, "+");
	слШаг = Слово(ТипыСловИОператоров.Число, "1");
	
	слПроцессорКода = Слово(тИдентификатор, "ПроцессорКода");

	Для Каждого опЦикл Из Подпрограмма.ДополнительныеДанные.ОператорыЦиклов Цикл
		
		опПервый = опЦикл.Операторы[0];
		опЗаголовокЦикла = опЦикл.ДополнительныеДанные.Заголовок;
		опТелоЦикла = опЦикл.ДополнительныеДанные.Тело;
		ТипЦикла = ВРЕГ(опПервый.Код);

		ОператорыУправленияЦиклом =ТекстовыйПарсер_ПолучитьОператорыУправленияЦиклом(ТекстовыйПарсер, Подпрограмма, опЦикл);
		ОператорыПродолжить = ОператорыУправленияЦиклом.ОператорыПродолжить;
		Если ОператорыПродолжить.Количество() > 0 Тогда
			МеткаПередКонцомЦикла = "~ПередКонцомЦикла" + Формат(Подпрограмма.ДополнительныеДанные.НомерЦикла, "ЧГ=0"); 
			Подпрограмма.ДополнительныеДанные.НомерЦикла = Подпрограмма.ДополнительныеДанные.НомерЦикла + 1;
			Для Каждого ОператорПродолжить Из ОператорыПродолжить Цикл
				ОператорПродолжить.Код = "Перейти " + МеткаПередКонцомЦикла;
				ОператорПродолжить.ТипОператора = "ПростоКод";
			КонецЦикла;
			
			НовыйОператор(ТекстовыйПарсер, опТелоЦикла, Слово("ПростоКод", МеткаПередКонцомЦикла + ":"));
		КонецЕсли;
		
		Если ТипЦикла="ПОКА" Тогда
			
			// Перенесем условие внутрь цикла
			// чтобы в дальнейшем можно было его декомпозировать,
			// и все элементы декомпозиции выполнялись при каждой итерации цикла
			опУсловный = НовыйУсловныйОператор(ТекстовыйПарсер, опТелоЦикла, 0);
			НовыйРазделительОператоров(ТекстовыйПарсер, опТелоЦикла, 1);
			опУсловие = опУсловный.ДополнительныеДанные.Заголовок;

			НовыйОператор(ТекстовыйПарсер, опУсловие, слНЕ);
			опСкобки = НовыйОператорСкобки(ТекстовыйПарсер, опУсловие);
			Пока опЗаголовокЦикла.Операторы.Количество() > 0 Цикл
				опУсловияЦикла = опЗаголовокЦикла.Операторы[0];
				ПоместитьОператор(ТекстовыйПарсер, опСкобки, опУсловияЦикла);
			КонецЦикла;
			ЗакрытьОператорСкобки(опСкобки, ТекстовыйПарсер);

			опТело = опУсловный.ДополнительныеДанные.Тело;
			НовыйОператор(ТекстовыйПарсер, опТело, слПрервать);
			
			// "Вечный" цикл :)
			НовыйОператор(ТекстовыйПарсер, опЗаголовокЦикла, слИстина);
			
		ИначеЕсли ТипЦикла="ДЛЯ" Тогда
			
			Если опЗаголовокЦикла.Операторы.Количество() > 3 Тогда
				
				Если ВРЕГ(опЗаголовокЦикла.Операторы[0].Код)="КАЖДОГО" Тогда
					
					опКоллекцияДляОбхода = опЗаголовокЦикла.Операторы[опЗаголовокЦикла.Операторы.Количество()-1];

					опВызовПодпрограммы = НовыйОператорВызовПодпрограммы("ПолучитьИтераторКоллекции", ТекстовыйПарсер, , опКоллекцияДляОбхода);
						опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
							ПоместитьОператор(ТекстовыйПарсер, опПараметрВызова, опКоллекцияДляОбхода);
						опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
							НовыйОператор(ТекстовыйПарсер, опПараметрВызова, слПроцессорКода);
							
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если опЗаголовокЦикла.Операторы.Количество()=3 Тогда
				ОпрераторЗаголовка = опЗаголовокЦикла.Операторы[1];
				Если ОпрераторЗаголовка.ТипОператора=тИдентификатор И ВРЕГ(ОпрераторЗаголовка.Код)="ПО" Тогда
					
					опИнициализацияПеременной = опЗаголовокЦикла.Операторы[0];
					опКонечноеЗначение = опЗаголовокЦикла.Операторы[2];
					Если опИнициализацияПеременной.ТипОператора=тПрисвоениеЗначения Тогда
						
						//преобразовать цикл
						опЗаголовокЦикла.Операторы.Очистить();
						НовыйОператор(ТекстовыйПарсер, опЗаголовокЦикла, слИстина);
						
						опПервый = опЦикл.Операторы[0];
						опПервый.Код = "Пока";
						
						// инициализация переменной
						ПоместитьОператор(ТекстовыйПарсер, , опИнициализацияПеременной, опЦикл);
						НовыйРазделительОператоров(ТекстовыйПарсер, , опЦикл);

						// условие выхода из цикла
						опПеременная = опИнициализацияПеременной.Операторы[0];
						опУсловный = НовыйУсловныйОператор(ТекстовыйПарсер, опТелоЦикла, 0);
						опУсловие = опУсловный.ДополнительныеДанные.Заголовок;
						опТело = опУсловный.ДополнительныеДанные.Тело;
						СкопироватьОператор(ТекстовыйПарсер, опПеременная, опУсловие);
						НовыйОператор(ТекстовыйПарсер, опУсловие, слБольше);
						ПоместитьОператор(ТекстовыйПарсер, опУсловие, опКонечноеЗначение);
						НовыйОператор(ТекстовыйПарсер, опТело, слПрервать);
						НовыйРазделительОператоров(ТекстовыйПарсер, опТелоЦикла, 1);
						
						// инкремент переменной
						опПеременная = СкопироватьОператор(ТекстовыйПарсер, опПеременная, опТелоЦикла);
						опПравоеВыражение = НовыйОператорВыражение(ТекстовыйПарсер, опТелоЦикла);
							опПравоеВыражение.ЛевоеЗначение = Ложь;
							СкопироватьОператор(ТекстовыйПарсер, опПеременная, опПравоеВыражение);
							НовыйОператор(ТекстовыйПарсер, опПравоеВыражение, слПлюс);
							НовыйОператор(ТекстовыйПарсер, опПравоеВыражение, слШаг);
						опИнкрементПеременной = НовыйОператорПрисвоениеЗначение(опПеременная, опПравоеВыражение, ТекстовыйПарсер, опТелоЦикла);
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция КомпиляторКода_ПреобразоватьВызовыМетодовПодпрограммы(КомпиляторКода, Подпрограмма)
	
	ЕстьПреобразования = Ложь;
	ДополнительныеДанныеПодпрограммы = Подпрограмма.ДополнительныеДанные;
	ТелоПодпрограммы = ДополнительныеДанныеПодпрограммы.Тело;
	Если ТелоПодпрограммы=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ФункцияДляОбработки = КомпиляторКода.ФункцииДляВызововПодпрограмм[Подпрограмма.Директива.Имя];
	Если ФункцияДляОбработки=Неопределено Тогда
		Возврат ЕстьПреобразования;
	КонецЕсли;
	
	ИмяОбработчикаВызовПодпрограммы = ФункцияДляОбработки.Имя;
	КоличествоПараметровСервиснойФункции = ФункцияДляОбработки.Параметры.Количество();
		
	ДополнительныеДанныеПодпрограммы.Вставить("НомерРезультатаВычисленияОбъектаКонтекста", 1);
	ДополнительныеДанныеПодпрограммы.Вставить("НомерРезультатаВызоваМетода", 1);
	ДополнительныеДанныеПодпрограммы.Вставить("НомерРезультатаВызоваПодпрограммы", 1);
	ДополнительныеДанныеПодпрограммы.Вставить("НомерРезультатаПараметраВызоваМетода", 1);
	ДополнительныеДанныеПодпрограммы.Вставить("НомерРезультатаПравогоЗначения", 1);
	ДополнительныеДанныеПодпрограммы.Вставить("НомерРезультатаПолученияЗначенияПоля", 1);
	
	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	тВызовМетода = ТипыСловИОператоров.ВызовМетода;
	тПоле = ТипыСловИОператоров.Поле;
	тВызовПодпрограммы = ТипыСловИОператоров.ВызовПодпрограммы;
	тПрисвоениеЗначения = ТипыСловИОператоров.ПрисвоениеЗначения;
	тСтрока = ТипыСловИОператоров.Строка;
	тНовыйОбъект = ТипыСловИОператоров.НовыйОбъект;
	тСкобки = ТипыСловИОператоров.Скобки;
	тВыражение = ТипыСловИОператоров.Выражение;
	
	слФункцияДляОбработки = Слово(тИдентификатор, ФункцияДляОбработки.Имя);
	слНеопределено = Слово(тИдентификатор, "НЕОПРЕДЕЛЕНО");
	слНЕ = Слово(тИдентификатор, "НЕ");
	слПроцессорКода = Слово(тИдентификатор, "ПроцессорКода");
	слНативныйОбъект = Слово(тИдентификатор, "ПроцессорКода.ДанныеВыполненияМетода.НативныйОбъект");
	слВыполнитьНативныйМетод = Слово("ПростоКод", "ПроцессорКода.ДанныеВыполненияМетода.ВыполнитьНативныйМетод");
	слОпущенныйПараметр = Слово(тСтрока, "ОпущенныйПараметр_e8a17f9465ac4b1dbd98b4f6427d0162");
	
	РазворачиватьТипыОператоровПриВызовеМетодов = Новый Соответствие;
	РазворачиватьТипыОператоровПриВызовеМетодов[тВызовМетода] = Истина;
	РазворачиватьТипыОператоровПриВызовеМетодов[тВызовПодпрограммы] = Истина;
	РазворачиватьТипыОператоровПриВызовеМетодов[тНовыйОбъект] = Истина;
	РазворачиватьТипыОператоровПриВызовеМетодов[тСкобки] = Истина;
	РазворачиватьТипыОператоровПриВызовеМетодов[тВыражение] = Истина;
	
	СкопированныеОператоры = ТекстовыйПарсер.ДополнительныеДанные.СкопированныеОператоры;

	// сначала развернем вложенные вызовы в параметрах вызова и в выражениях
	
	ОператорыВызововМетодов = Новый Массив;
	ОператорыУстановкиПолученияЗначенийПолей = Новый Массив;
	
	ВсеОператоры = ПолучитьВсеОператоры(ТелоПодпрограммы);
	Для Каждого Оператор Из ВсеОператоры Цикл
		
		Если Оператор.ДополнительныеДанные.Свойство("Непреобразовывать") Тогда
			
			// не трогать
			Продолжить;
			
		КонецЕсли;
			
		Если Оператор.ТипОператора=тВызовМетода Тогда
			
			опВызовМетода = Оператор;
			ИмяКласса = Оператор.ДополнительныеДанные.ИмяКласса;
			МетодОпределен = Оператор.ДополнительныеДанные.МетодОпределен;
			Если ИмяКласса<>Неопределено И Не МетодОпределен И Оператор.ДополнительныеДанные.ИспользоватьНативныеМетоды Тогда
				// будет вызван метод нативного объекта так, как в интерпретаторе он не определен
				Продолжить;
			КонецЕсли;
			
			ТочкаЭкстракции = КомпиляторКода_ПолучитьТочкуЭкстракцииВыражения(ТекстовыйПарсер, Оператор);
			
			Если МетодОпределен Тогда
				// Вызов нативного метода не потребуется
				// и временная переменная для хранения результата тоже
			Иначе
				// Возможно потребуется вызов нативного метода,
				// если при динамической типизации объекта класс объекта или метод класса не получиться идентифицировать
				// подготовим для этого операторы...
				
				Если НЕ Оператор.ЛевоеЗначение Тогда
					// подменим обращение к методу объекта переменной с результатом вычисления
					ИмяПеременнойРезультатаВычисления = "РезультатВызоваМетода" + Формат(ДополнительныеДанныеПодпрограммы.НомерРезультатаВызоваМетода, "ЧГ=0");
					ДополнительныеДанныеПодпрограммы.НомерРезультатаВызоваМетода = ДополнительныеДанныеПодпрограммы.НомерРезультатаВызоваМетода + 1;
					слРезультатВычисления = Слово(тИдентификатор, ИмяПеременнойРезультатаВычисления);
					
					// подменим обращение к методу объекта переменной с результатом вычисления
					НовыйОператор(ТекстовыйПарсер, , слРезультатВычисления, Оператор);
					
					// оператор вычисления и присвоения результата
					опПрисвоениеЗначения = НовыйОператорПрисвоениеЗначение(слРезультатВычисления, Оператор, ТекстовыйПарсер, , ТочкаЭкстракции);
					НовыйРазделительОператоров(ТекстовыйПарсер, , ТочкаЭкстракции);
					ТочкаЭкстракции = опПрисвоениеЗначения;
				КонецЕсли;

				
				
				// Также развернем выражение контекстного объекта так, как
				// оно по сути тоже является главным параметром при вызове сервисной функции
				опОбъект = опВызовМетода.Операторы[0];
				Если РазворачиватьТипыОператоровПриВызовеМетодов[опОбъект.ТипОператора]=Истина И НЕ(опОбъект.ДополнительныеДанные.Свойство("НеПреобразовывать") И опОбъект.ДополнительныеДанные.НеПреобразовывать=Истина) Тогда
					ИмяПеременнойРезультатаВычисления = "РезультатВычисленияОбъектаКонтекста" + Формат(ДополнительныеДанныеПодпрограммы.НомерРезультатаВычисленияОбъектаКонтекста, "ЧГ=0");
					ДополнительныеДанныеПодпрограммы.НомерРезультатаВычисленияОбъектаКонтекста = ДополнительныеДанныеПодпрограммы.НомерРезультатаВычисленияОбъектаКонтекста + 1;
					слРезультатВычисления = Слово(тИдентификатор, ИмяПеременнойРезультатаВычисления);

					// подменим обращение к объекту переменной с результатом вычисления
					опЗаменаОбъекта = НовыйОператор(ТекстовыйПарсер, опВызовМетода, слРезультатВычисления, опОбъект);
					опВызовМетода.ДополнительныеДанные.Объект = опЗаменаОбъекта;

					// оператор вычисления и присвоения результата
					НовыйОператорПрисвоениеЗначение(слРезультатВычисления, опОбъект, ТекстовыйПарсер, , ТочкаЭкстракции);
					НовыйРазделительОператоров(ТекстовыйПарсер, , ТочкаЭкстракции);
				КонецЕсли;
				
			КонецЕсли;
			
			// Развернем входящие параметры, в которых может быть вызов других методов или подпрограмм
			// чтобы исключить двойной вызов вложенных подпрограмм (сначала при попытке вызова переопределенного метода, а потом нативного)
			// и присвоить значение параметра как результат вызова функции в поле объекта
			Для Каждого ПараметрВызоваМетода Из Оператор.ДополнительныеДанные.ПараметрыВызоваПодпрограммы.Операторы Цикл
				Если ПараметрВызоваМетода.Операторы.Количество()=0 Тогда
					Продолжить;
				КонецЕсли;
				
				ОператорВыражения = ПараметрВызоваМетода.Операторы[0];

				Если МетодОпределен Тогда
					Если ОператорВыражения.ТипОператора<>тПоле Тогда
						Продолжить;
					КонецЕсли;
				Иначе
					Если РазворачиватьТипыОператоровПриВызовеМетодов[ОператорВыражения.ТипОператора]<>Истина И ОператорВыражения.ТипОператора<>тПоле Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				ИмяПеременнойРезультатаПараметраВызоваМетода = "РезультатПараметраВызоваМетода" + Формат(ДополнительныеДанныеПодпрограммы.НомерРезультатаПараметраВызоваМетода, "ЧГ=0");
				ДополнительныеДанныеПодпрограммы.НомерРезультатаПараметраВызоваМетода = ДополнительныеДанныеПодпрограммы.НомерРезультатаПараметраВызоваМетода + 1;

				слРезультатВычисления = Слово(тИдентификатор, ИмяПеременнойРезультатаПараметраВызоваМетода);
				НовыйОператорПрисвоениеЗначение(слРезультатВычисления, ОператорВыражения, ТекстовыйПарсер, , ТочкаЭкстракции);
				НовыйРазделительОператоров(ТекстовыйПарсер, , ТочкаЭкстракции);
				НовыйОператор(ТекстовыйПарсер, ПараметрВызоваМетода, слРезультатВычисления);

				Если ОператорВыражения.ТипОператора=тПоле Тогда
					ИмяПеременнойРезультатаПараметраВызоваМетода = СтрЗаменить(ИмяПеременнойРезультатаПараметраВызоваМетода, "РезультатПараметраВызоваМетода", "РезультатПараметраВызоваМетодаДо");
					слРезультатВычисленияДо = Слово(тИдентификатор, ИмяПеременнойРезультатаПараметраВызоваМетода);
					НовыйОператорПрисвоениеЗначение(слРезультатВычисленияДо, слРезультатВычисления, ТекстовыйПарсер, , ТочкаЭкстракции);
					НовыйРазделительОператоров(ТекстовыйПарсер, , ТочкаЭкстракции);
					
					ИндексТочкиЭкстракции = ТочкаЭкстракции.Родитель.Операторы.Найти(ТочкаЭкстракции);
					НовыйРазделительОператоров(ТекстовыйПарсер, ТочкаЭкстракции.Родитель, ИндексТочкиЭкстракции+1);
					опПоле = СкопироватьОператор(ТекстовыйПарсер, ОператорВыражения);
					опПоле.ЛевоеЗначение = Истина;
					НовыйОператорПрисвоениеЗначение(опПоле, слРезультатВычисления, ТекстовыйПарсер, ТочкаЭкстракции.Родитель, ИндексТочкиЭкстракции+2);
					Для Каждого СубОператор Из ПолучитьВсеОператоры(опПоле) Цикл
						ВсеОператоры.Добавить(СубОператор);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			ОператорыВызововМетодов.Добавить(опВызовМетода);
			
			
			
		ИначеЕсли Оператор.ТипОператора=тПоле Тогда
			
			опОбращениеКПолюОбъекта = Оператор;
			ОператорРодитель = опОбращениеКПолюОбъекта.Родитель;
			
			Если опОбращениеКПолюОбъекта.ЛевоеЗначение Тогда
				Если ОператорРодитель.ТипОператора=тПрисвоениеЗначения Тогда
					опПрисвоениеЗначения = ОператорРодитель;
					опЛевоеЗначение = опПрисвоениеЗначения.Операторы[0];
					Если опОбращениеКПолюОбъекта=опЛевоеЗначение Тогда
						// развернем вычисление правого значения
						опПравоеЗначение = опПрисвоениеЗначения.Операторы[2];

						ИмяПеременнойРезультатаВычисления = "РезультатПравогоЗначения" + Формат(ДополнительныеДанныеПодпрограммы.НомерРезультатаПравогоЗначения, "ЧГ=0");
						ДополнительныеДанныеПодпрограммы.НомерРезультатаПравогоЗначения = ДополнительныеДанныеПодпрограммы.НомерРезультатаПравогоЗначения + 1;

						слРезультатВычисления = Слово(тИдентификатор, ИмяПеременнойРезультатаВычисления);
						НовыйОператор(ТекстовыйПарсер, , слРезультатВычисления, опПравоеЗначение);

						ТочкаЭкстракции = опПрисвоениеЗначения;
						НовыйОператорПрисвоениеЗначение(слРезультатВычисления, опПравоеЗначение, ТекстовыйПарсер, , ТочкаЭкстракции);
						НовыйРазделительОператоров(ТекстовыйПарсер, , ТочкаЭкстракции);
						ОператорыУстановкиПолученияЗначенийПолей.Добавить(опОбращениеКПолюОбъекта);
					КонецЕсли;
				КонецЕсли;
			Иначе
				ИмяПеременнойРезультатаВычисления = "РезультатПолученияЗначенияПоля" + Формат(ДополнительныеДанныеПодпрограммы.НомерРезультатаПолученияЗначенияПоля, "ЧГ=0");
				ДополнительныеДанныеПодпрограммы.НомерРезультатаПолученияЗначенияПоля = ДополнительныеДанныеПодпрограммы.НомерРезультатаПолученияЗначенияПоля + 1;

				слРезультатВычисления = Слово(тИдентификатор, ИмяПеременнойРезультатаВычисления);
				опЗаменаОбращенияКПолю = НовыйОператор(ТекстовыйПарсер, , слРезультатВычисления, опОбращениеКПолюОбъекта);
				Если ОператорРодитель.ТипОператора=тВызовМетода Тогда
					ОператорРодитель.ДополнительныеДанные.Объект = опЗаменаОбращенияКПолю;
				КонецЕсли;

				ТочкаЭкстракции = КомпиляторКода_ПолучитьТочкуЭкстракцииВыражения(ТекстовыйПарсер, опОбращениеКПолюОбъекта);
				НовыйОператорПрисвоениеЗначение(слРезультатВычисления, опОбращениеКПолюОбъекта, ТекстовыйПарсер, , ТочкаЭкстракции);
				НовыйРазделительОператоров(ТекстовыйПарсер, , ТочкаЭкстракции);
				ОператорыУстановкиПолученияЗначенийПолей.Добавить(опОбращениеКПолюОбъекта);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	
	Для Каждого опВызовМетода Из ОператорыВызововМетодов Цикл
		
		ИмяКласса = опВызовМетода.ДополнительныеДанные.ИмяКласса;
		МетодОпределен = опВызовМетода.ДополнительныеДанные.МетодОпределен;
		
		Если МетодОпределен Тогда
			// однозначно не используем нативный метод
			слИмяКласса = Слово(тСтрока, ИмяКласса);
			опВызовПодпрограммы = опВызовМетода;
		Иначе
			// возможно потребуется вызов нативного метода
			слИмяКласса = слНеопределено;
			опРодитель = опВызовМетода.Родитель;
			Если опРодитель.ТипОператора=тПрисвоениеЗначения Тогда
				// копируем и вставляем вместе с оператором присвоения
				опПрисвоениеЗначения = опРодитель;
				ТочкаИнжекции = опПрисвоениеЗначения;
				СкопироватьОператор(ТекстовыйПарсер, опПрисвоениеЗначения);
				опВызовПодпрограммы = СкопированныеОператоры[опВызовМетода];
				опГруппа = опПрисвоениеЗначения;
			Иначе
				ТочкаИнжекции = опВызовМетода;
				опВызовПодпрограммы = СкопироватьОператор(ТекстовыйПарсер, опВызовМетода);
				опГруппа = опВызовМетода;
			КонецЕсли;
			
		КонецЕсли;
		
		опВызовПодпрограммы.ТипОператора = тВызовПодпрограммы;
		опОбъект = опВызовПодпрограммы.Операторы[0];
		опМетод = опВызовПодпрограммы.Операторы[2];
		ИмяМетода = ВРЕГ(опМетод.Код);
		опСкобки = опВызовПодпрограммы.Операторы[3];
		
		опПараметрыВызоваПодпрограммы = опВызовПодпрограммы.ДополнительныеДанные.ПараметрыВызоваПодпрограммы;
		Для Каждого опПараметрВызоваПодпрограммы Из опПараметрыВызоваПодпрограммы.Операторы Цикл
			Если опПараметрВызоваПодпрограммы.Операторы.Количество()=0 Тогда
				НовыйОператор(ТекстовыйПарсер, опПараметрВызоваПодпрограммы, слОпущенныйПараметр);
			КонецЕсли;
		КонецЦикла;
			опПараметрВызоваПодпрограммы = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, опПараметрыВызоваПодпрограммы, 0);
				ПоместитьОператор(ТекстовыйПарсер, опПараметрВызоваПодпрограммы, опОбъект);
			опПараметрВызоваПодпрограммы = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, опПараметрыВызоваПодпрограммы, 1);
				НовыйОператор(ТекстовыйПарсер, опПараметрВызоваПодпрограммы, слИмяКласса);
			опПараметрВызоваПодпрограммы = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, опПараметрыВызоваПодпрограммы, 2);
				НовыйОператор(ТекстовыйПарсер, опПараметрВызоваПодпрограммы, Слово(тСтрока, ИмяМетода));
			опПараметрВызоваПодпрограммы = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, опПараметрыВызоваПодпрограммы, 3);
				НовыйОператор(ТекстовыйПарсер, опПараметрВызоваПодпрограммы, слПроцессорКода);

		опВызовПодпрограммы.Операторы.Очистить();
			НовыйОператор(ТекстовыйПарсер, опВызовПодпрограммы, слФункцияДляОбработки);
			ПоместитьОператор(ТекстовыйПарсер, опВызовПодпрограммы, опСкобки);

		Если Не МетодОпределен Тогда
			
			опОбъект = опВызовМетода.ДополнительныеДанные.Объект;
			опОбъект.Операторы.Очистить();
			опОбъект.ТипОператора = слНативныйОбъект.ТипСлова;
			опОбъект.Код = слНативныйОбъект.Слово;
				
			НовыйРазделительОператоров(ТекстовыйПарсер, , ТочкаИнжекции);
			
			// вставим проверку необходимости вызова встроенного метода 1с
			опУсловныйОператор = НовыйУсловныйОператор(ТекстовыйПарсер, , ТочкаИнжекции);
			опУсловие = опУсловныйОператор.ДополнительныеДанные.Заголовок;
				НовыйОператор(ТекстовыйПарсер, опУсловие, слВыполнитьНативныйМетод);
			
			опТело = опУсловныйОператор.ДополнительныеДанные.Тело;
			ПоместитьОператор(ТекстовыйПарсер, опТело, опГруппа);
		КонецЕсли;

	КонецЦикла;

	слИмяКласса = слНеопределено;
	слУстановитьЗначениеПоля = Слово(тСтрока, "УСТАНОВИТЬЗНАЧЕНИЕПОЛЯ");
	слПолучитьЗначениеПоля = Слово(тСтрока, "ПОЛУЧИТЬЗНАЧЕНИЕПОЛЯ");
	Для Каждого Оператор Из ОператорыУстановкиПолученияЗначенийПолей Цикл
		
		Если Оператор.Операторы.Количество()<>3 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Оператор.Операторы[1].Код<>"." Тогда
			Продолжить;
		КонецЕсли;
		
		опОбъект = Оператор.Операторы[0];
		опПоле = Оператор.Операторы[2];
		
		ОператорРодитель = Оператор.Родитель;
		
		Если ОператорРодитель.ТипОператора=тПрисвоениеЗначения Тогда
			
			опПрисвоениеЗначения = ОператорРодитель;
			опЛевоеЗначение = опПрисвоениеЗначения.Операторы[0];
			опПравоеЗначение = опПрисвоениеЗначения.Операторы[2];
			ТочкаИнжекции = опПрисвоениеЗначения;
			
			Если Оператор.ЛевоеЗначение Тогда

				// установка значения поля
				опВызовПодпрограммы = НовыйОператорВызовПодпрограммы(ИмяОбработчикаВызовПодпрограммы, ТекстовыйПарсер, , ТочкаИнжекции); 
					опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
						СкопироватьОператор(ТекстовыйПарсер, опОбъект, опПараметрВызова);
					опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
						НовыйОператор(ТекстовыйПарсер, опПараметрВызова, слИмяКласса);
					опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
						НовыйОператор(ТекстовыйПарсер, опПараметрВызова, слУстановитьЗначениеПоля);
					опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
						НовыйОператор(ТекстовыйПарсер, опПараметрВызова, слПроцессорКода);
					опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
						НовыйОператор(ТекстовыйПарсер, опПараметрВызова, Слово(тСтрока, опПоле.Код));
					опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
						СкопироватьОператор(ТекстовыйПарсер, опПравоеЗначение, опПараметрВызова);
				
			Иначе

				// получить значения поля
				опПрисвоениеЗначенияОпределяемый = НовыйОператорПрисвоениеЗначение(СкопироватьОператор(ТекстовыйПарсер, опЛевоеЗначение), Неопределено, ТекстовыйПарсер, , ТочкаИнжекции); 
				
				опВызовПодпрограммы = НовыйОператорВызовПодпрограммы(ИмяОбработчикаВызовПодпрограммы, ТекстовыйПарсер, опПрисвоениеЗначенияОпределяемый); 
					опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
						СкопироватьОператор(ТекстовыйПарсер, опОбъект, опПараметрВызова);
					опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
						НовыйОператор(ТекстовыйПарсер, опПараметрВызова, слИмяКласса);
					опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
						НовыйОператор(ТекстовыйПарсер, опПараметрВызова, слПолучитьЗначениеПоля);
					опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
						НовыйОператор(ТекстовыйПарсер, опПараметрВызова, слПроцессорКода);
					опПараметрВызова = ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер);
						НовыйОператор(ТекстовыйПарсер, опПараметрВызова, Слово(тСтрока, опПоле.Код));

			КонецЕсли;
			
			// вставим проверку необходимости вызова встроенного метода 1с
			НовыйРазделительОператоров(ТекстовыйПарсер, , ТочкаИнжекции);
			опУсловныйОператор = НовыйУсловныйОператор(ТекстовыйПарсер, , ТочкаИнжекции);
			опУсловие = опУсловныйОператор.ДополнительныеДанные.Заголовок;
				НовыйОператор(ТекстовыйПарсер, опУсловие, слВыполнитьНативныйМетод);
			
			опТело = опУсловныйОператор.ДополнительныеДанные.Тело;
			ПоместитьОператор(ТекстовыйПарсер, опТело, опПрисвоениеЗначения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьПреобразования;
	
КонецФункции

Функция КомпиляторКода_РазвернутьВыраженияПодпрограммы(КомпиляторКода, Подпрограмма) Экспорт
	
	ТекстовыйПарсер = КомпиляторКода.ТекстовыйПарсер;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	ТипВыражение = ТипыСловИОператоров.Выражение;
	ТипОперацияВыражения = ТипыСловИОператоров.ОперацияВыражения;
	ТипИдентификатор = ТипыСловИОператоров.Идентификатор;
	ТипПравоеЗначение = ТипыСловИОператоров.ПравоеЗначение;
	ТипСкобки = ТипыСловИОператоров.Скобки;

	СловоИ = Слово(ТипИдентификатор, "И");
	СловоИстины = Слово(ТипИдентификатор, "ИСТИНА");
	
	Подпрограмма.ДополнительныеДанные.Вставить("НомерВыражения", 1);
	Подпрограмма.ДополнительныеДанные.Вставить("НомерРезультатаВыражения", 1);

	ОбходОператоров = Новый Массив;
	ОбходОператоров.Добавить(Подпрограмма);
	Для Каждого Оператор Из ОбходОператоров Цикл
		
		ЭтоЛогическоеВыражение = Ложь;
		Если Оператор.ТипОператора=ТипВыражение Тогда
			
			ОператорВыражение = Оператор;
			ОперандыВыражения = Новый Массив;
			Для Каждого ОператорВыражения Из ОператорВыражение.Операторы Цикл
				
				Если ОператорВыражения.ТипОператора=ТипОперацияВыражения Тогда
					Если Не ЭтоЛогическоеВыражение Тогда
						КодОперации = ВРег(ОператорВыражения.Код);
						Если КодОперации="И" ИЛИ КодОперации="ИЛИ" Тогда
							ЭтоЛогическоеВыражение = Истина;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ОперандыВыражения.Добавить(ОператорВыражения);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЭтоЛогическоеВыражение Тогда
			
			// Особенность логических выражений в том,
			// что результат одного операнда влияет на то, будут ли рассчитаны результаты следующих операндов или нет
			
			Если ОператорВыражение.ДополнительныеДанные.Свойство("ОбработкаВыражения") Тогда
				// заполнены параметры обработки вложенного выражения
				ОбработкаВыражения = ОператорВыражение.ДополнительныеДанные.ОбработкаВыражения;
				ОператорПрисвоенияРезультатаВыражения = ОбработкаВыражения.ОператорПрисвоенияРезультатаВыражения;
				ТочкаЭкстракции = ОбработкаВыражения.ТочкаЭкстракции;
				ИмяПеременнойРезультатВыражения = ОбработкаВыражения.ИмяПеременнойРезультатВыражения;

				// Для первого операнда можно использовать существующий оператор присвоения, в котором находится текущее выражение
				// вытащим выражение из оператора присвоения и оставим там лишь первый операнд
				ПервыйОперанд = ОперандыВыражения[0];
				ПоместитьОператор(ТекстовыйПарсер, ОператорВыражение.Родитель, ПервыйОперанд, ОператорВыражение);
				ПоместитьОператор(ТекстовыйПарсер, ТочкаЭкстракции.Родитель, ОператорВыражение, ТочкаЭкстракции);
				ВложенноеВыражение = Истина;
			Иначе
				// новое выражение
				ОператорПрисвоенияРезультатаВыражения = Неопределено;
				ТочкаЭкстракции = КомпиляторКода_ПолучитьТочкуЭкстракцииВыражения(ТекстовыйПарсер, ОператорВыражение);
				ИмяПеременнойРезультатВыражения = "РезультатВыражения" + Формат(Подпрограмма.ДополнительныеДанные.НомерРезультатаВыражения, "ЧГ=0");
				Подпрограмма.ДополнительныеДанные.НомерРезультатаВыражения = Подпрограмма.ДополнительныеДанные.НомерРезультатаВыражения + 1;
				ВложенноеВыражение = Ложь;
			КонецЕсли;
			
			ИмяМеткиКонцаВыражения = "~КонецВыражения" + Формат(Подпрограмма.ДополнительныеДанные.НомерВыражения, "ЧГ=0");
			Подпрограмма.ДополнительныеДанные.НомерВыражения = Подпрограмма.ДополнительныеДанные.НомерВыражения + 1;

			КодУсловногоПерехода = "Если ";
			Если КодОперации="И" Тогда
				КодУсловногоПерехода = КодУсловногоПерехода + "НЕ ";
			КонецЕсли;
			КодУсловногоПерехода = КодУсловногоПерехода + ИмяПеременнойРезультатВыражения + " Тогда Перейти " + ИмяМеткиКонцаВыражения + " КонецЕсли";

			СловоРезультатВыражения = Слово(ТипИдентификатор, ИмяПеременнойРезультатВыражения);
			ПоследнийОперанд = ОперандыВыражения[ОперандыВыражения.ВГраница()];
			Для Каждого ОперандВыражения Из ОперандыВыражения Цикл
				
				Если ОператорПрисвоенияРезультатаВыражения=Неопределено Тогда
					ОператорРезультатВыражения = НовыйОператор(ТекстовыйПарсер, ТочкаЭкстракции.Родитель, СловоРезультатВыражения, ТочкаЭкстракции);
					ОператорПрисвоенияРезультатаВыражения = НовыйОператорПрисвоениеЗначение(ОператорРезультатВыражения, ОперандВыражения, ТекстовыйПарсер, , ТочкаЭкстракции);
					НовыйРазделительОператоров(ТекстовыйПарсер, , ТочкаЭкстракции);
				КонецЕсли;
				
				Если ОперандВыражения=ПоследнийОперанд Тогда
					ОператорУсловногоПереходаИлиКонецВыражения = НовыйОператор(ТекстовыйПарсер, ТочкаЭкстракции.Родитель, Слово(ТипИдентификатор, ИмяМеткиКонцаВыражения+":"), ТочкаЭкстракции);
				Иначе
					ОператорУсловногоПереходаИлиКонецВыражения = НовыйОператор(ТекстовыйПарсер, ТочкаЭкстракции.Родитель, Слово("ПростоКод", КодУсловногоПерехода), ТочкаЭкстракции);
					НовыйРазделительОператоров(ТекстовыйПарсер, , ТочкаЭкстракции);
				КонецЕсли;

				ОбработкаВыражения = Новый Структура;
				ОбработкаВыражения.Вставить("ОператорПрисвоенияРезультатаВыражения", ОператорПрисвоенияРезультатаВыражения);
				ОбработкаВыражения.Вставить("ТочкаЭкстракции", ОператорУсловногоПереходаИлиКонецВыражения);
				ОбработкаВыражения.Вставить("ИмяПеременнойРезультатВыражения", ИмяПеременнойРезультатВыражения);
				ОперандВыражения.ДополнительныеДанные.Вставить("ОбработкаВыражения", ОбработкаВыражения);

				ОбходОператоров.Добавить(ОперандВыражения);
				
				ОператорПрисвоенияРезультатаВыражения = Неопределено;
				
			КонецЦикла;
			
			Если ВложенноеВыражение Тогда
				УдалитьОператор(ОператорВыражение);
			Иначе
				// Само выражение подменим идентификатором переменной, в которой рассчитан результат выражения
				ОператорВыражение.Операторы.Очистить();
				НовыйОператор(ТекстовыйПарсер, ОператорВыражение, Слово(ТипИдентификатор, ИмяПеременнойРезультатВыражения));
				// для преобразования выражения в булевый тип
				НовыйОператор(ТекстовыйПарсер, ОператорВыражение, СловоИ);
				НовыйОператор(ТекстовыйПарсер, ОператорВыражение, СловоИстины);
			КонецЕсли;
	
		Иначе
			
			Если Оператор.ДополнительныеДанные.Свойство("ОбработкаВыражения") Тогда
				// оператор выражения
				Если Оператор.ТипОператора=ТипСкобки Тогда
					// Скобки в выражении можно раскрыть так, как операторы уже сгруппированы с учетом приоритетов операций
					ОператорСкобки = Оператор;
					ОператорВыражение = ОператорСкобки.Операторы[1];
					ОператорВыражение.ДополнительныеДанные.Вставить("ОбработкаВыражения", ОператорСкобки.ДополнительныеДанные.ОбработкаВыражения);
					ПоместитьОператор(ТекстовыйПарсер, ОператорСкобки.Родитель, ОператорВыражение, ОператорСкобки);
					УдалитьОператор(ОператорСкобки);
					
					ОбходОператоров.Добавить(ОператорВыражение);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого СубОператор Из Оператор.Операторы Цикл
				ОбходОператоров.Добавить(СубОператор);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат Истина;
	
КонецФункции

Функция КомпиляторКода_ПолучитьТочкуЭкстракцииВыражения(ТекстовыйПарсер, ОператорВыражение)

	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тТелоЛогическогоБлока = ТипыСловИОператоров.ТелоЛогическогоБлока;
	
	Оператор = ОператорВыражение;
	Пока Истина Цикл
		
		ОператорРодитель = Оператор.Родитель;
		Если ОператорРодитель=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ОператорРодитель.ТипОператора=тТелоЛогическогоБлока Тогда
			Возврат Оператор;
		КонецЕсли;
		
		Оператор = ОператорРодитель;
		
	КонецЦикла;
	
КонецФункции

//
//	Компилятор кода-
//}



Функция НовыйТекстовыйПарсер(Текст=Неопределено) Экспорт
	
	Перем РК, РаботаСXML;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	РаботаСXML = глОбщийМодуль("РаботаСXMLКлиентСервер");

	ОбщиеМодули = Новый Соответствие;
	ОбщиеМодули["РаботаСКоллекциями"] = РК;
	ОбщиеМодули["РаботаСXML"] = РаботаСXML;
	
	Цифры = "1234567890";
	ЦифрыМассив = РК.СтрокуВМассивПосимвольно(Цифры);
	ЦифрыСоответствие = РК.ПреобразоватьМассивВСоответствие(ЦифрыМассив);
	ДопустимыеСимволыИдентификаторовНРЕГ = "йцукенгшщзхъфывапролджэячсмитьбюqwertyuiopasdfghjklzxcvbnm";
	ДопустимыеСимволыИдентификаторов = ДопустимыеСимволыИдентификаторовНРЕГ + ВРЕГ(ДопустимыеСимволыИдентификаторовНРЕГ) + Цифры + "_";
	ДопустимыеСимволыИдентификаторовМассив = РК.СтрокуВМассивПосимвольно(ДопустимыеСимволыИдентификаторов);
	ДопустимыеСимволыИдентификаторовСоответствие = РК.ПреобразоватьМассивВСоответствие(ДопустимыеСимволыИдентификаторовМассив);
	
	ПоляОператоров = "Код, ТипОператора, НомерСтроки, ЛевоеЗначение, ПространствоИмен, Операторы, Родитель, ДополнительныеДанные";
	ПоляПодпрограммы = "ВРИмя, Имя, ВРИмяКласса, Объявление, Директива, Тип, Нативная, Экспорт, НепосредственныйДоступКПолямОбъекта, ТаблицаПараметров, ТаблицаПеременных";
	ПоляПодпрограммы = ПоляПодпрограммы + ", " + ПоляОператоров;
	
	ПоляКласса = ПоляОператоров + ", " + "ВРИмя, Имя, Директива, ИдентификаторыУказателейТекущегоОбъекта, ИменаПолей, ИменаПолейМассив, ИменаНативныхПолейМассив, Поля, Методы, ИспользоватьНативныеМетоды, ТаблицаПеременных, Предки";
	
	Слова = Новый Массив;
	ТаблицаПодпрограмм = РК.НоваяКвазиТаблицаЗначений(ПоляПодпрограммы);
	РК.ДобавитьИндексКоллекции(ТаблицаПодпрограмм, "ВРИмя, ВРИмяКласса");
	ТаблицаКлассов = РК.НоваяКвазиТаблицаЗначений(ПоляКласса);
	РК.ДобавитьИндексКоллекции(ТаблицаКлассов, "ВРИмя");
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("ОбщиеМодули", ОбщиеМодули);
	ДополнительныеДанные.Вставить("СкопированныеОператоры", Новый Соответствие);

	ТипыСловИОператоров = РК.НовоеПеречисление
	(
		"Спецсимвол, Идентификатор, Выражение, ПрисвоениеЗначения, ЛинейноеУсловие, ЛевоеЗначение, ПравоеЗначение, ОперацияВыражения, Строка, Число, ЛокальныеПеременные, Переменная, Подпрограмма, Класс, НовыйОбъект, ВызовПодпрограммы, ПараметрыВызоваПодпрограммы, ПараметрВызоваПодпрограммы, Поле, ВызовМетода, Скобки, ЛинейныйУсловныйОператор, ЛогическийБлок, ЛогическийБлокПрепроцессора, ЗаголовокЛогическогоБлока, ТелоЛогическогоБлока, ВыражениеВозврата, ВозвратИзПодпрограммы",
		"Строка"
	);
	
	КонтекстыИсполнения = РК.НовоеПеречисление
	(	"Клиент, Сервер", //Бэкенд
		"Строка"
	);
	
	МассивПолейОператоровКопируемыхЗначений = Новый Массив;
	МассивПолейОператоровКопируемыхЗначений.Добавить("ПространствоИмен");
	
	Зависимости = Новый Структура;
	Зависимости.Вставить("Включения", Новый Массив);
	Зависимости.Вставить("Использования", Новый Массив);
	
	ТекстовыйПарсер = Новый Структура;
	ТекстовыйПарсер.Вставить("МассивПолейОператоровКопируемыхЗначений", МассивПолейОператоровКопируемыхЗначений);
	ТекстовыйПарсер.Вставить("ДопустимыеСимволыИдентификаторов", ДопустимыеСимволыИдентификаторов);
	ТекстовыйПарсер.Вставить("ДопустимыеСимволыИдентификаторовМассив", ДопустимыеСимволыИдентификаторовМассив);
	ТекстовыйПарсер.Вставить("ДопустимыеСимволыИдентификаторовСоответствие", ДопустимыеСимволыИдентификаторовСоответствие);
	ТекстовыйПарсер.Вставить("Цифры", Цифры);
	ТекстовыйПарсер.Вставить("ЦифрыМассив", ЦифрыМассив);
	ТекстовыйПарсер.Вставить("ЦифрыСоответствие", ЦифрыСоответствие);
	ТекстовыйПарсер.Вставить("ТипыСловИОператоров", ТипыСловИОператоров);
	ТекстовыйПарсер.Вставить("КонтекстыИсполнения", КонтекстыИсполнения);
	ТекстовыйПарсер.Вставить("КонтекстИсполнения", КонтекстыИсполнения.Клиент);
	ТекстовыйПарсер.Вставить("ЧтениеТекста");
	ТекстовыйПарсер.Вставить("Текст", "");
	ТекстовыйПарсер.Вставить("СформированныйТекст", "");
	ТекстовыйПарсер.Вставить("Строка");
	ТекстовыйПарсер.Вставить("ДлинаСтроки", 0);
	ТекстовыйПарсер.Вставить("НомерСимвола", 0);
	ТекстовыйПарсер.Вставить("НомерСтроки", 0);
	ТекстовыйПарсер.Вставить("Слова", Слова);
	ТекстовыйПарсер.Вставить("КоличествоСлов", 0);
	ТекстовыйПарсер.Вставить("ТекущееСлово");
	ТекстовыйПарсер.Вставить("НомерТекущегоСлова", 0);
	ТекстовыйПарсер.Вставить("ПустоеСлово", Слово());
	ТекстовыйПарсер.Вставить("ГлобальнаяОбласть");
	ТекстовыйПарсер.Вставить("ГлобальныйКласс");
	ТекстовыйПарсер.Вставить("ТаблицаПодпрограмм", ТаблицаПодпрограмм);
	ТекстовыйПарсер.Вставить("ТаблицаКлассов", ТаблицаКлассов);
	ТекстовыйПарсер.Вставить("Пробел", " ");
	ТекстовыйПарсер.Вставить("ПереводСтроки", Символы.ПС);
	ТекстовыйПарсер.Вставить("Кавычка", """");
	ТекстовыйПарсер.Вставить("ПоляПодпрограммы", ПоляПодпрограммы);
	ТекстовыйПарсер.Вставить("ПоляОператоров", ПоляОператоров);
	ТекстовыйПарсер.Вставить("ЛогическиеБлоки", ПолучитьЛогическиеБлоки());
	ТекстовыйПарсер.Вставить("ОписанияСкобок", ПолучитьОписанияСкобок());
	ТекстовыйПарсер.Вставить("ОператорыСравнения", ПолучитьОператорыСравнения());
	ТекстовыйПарсер.Вставить("ОперацииВыражений", ПолучитьОперацииВыражений());
	ТекстовыйПарсер.Вставить("ДополнительныеДанные", ДополнительныеДанные);
	ТекстовыйПарсер.Вставить("ТекущийОператор");
	ТекстовыйПарсер.Вставить("ИдентификаторыПрепроцессора", Новый Соответствие);
	ТекстовыйПарсер.Вставить("Зависимости", Зависимости);
	
	ТекстовыйПарсер_УстановитьИдентификаторыПрепроцессораПоУмолчанию(ТекстовыйПарсер);

	ЗаполнитьГраницыЛогическихБлоков(ТекстовыйПарсер);
	
	ЗаполнитьЗарезервированныеИдентификаторы(ТекстовыйПарсер);
	
	ЗарегистрироватьДирективыКонтекстовИсполнения(ТекстовыйПарсер);
	
	Если Текст <> Неопределено Тогда
		ТекстовыйПарсер_РазобратьТекст(ТекстовыйПарсер, Текст);
	КонецЕсли;
	
	Возврат ТекстовыйПарсер;
КонецФункции

Функция ТекстовыйПарсер_УстановитьИдентификаторыПрепроцессораПоУмолчанию(ТекстовыйПарсер)
	
	Перем ОбщегоНазначенияКлиентСервер;
	
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	ТекстовыйПарсер.ИдентификаторыПрепроцессора.Очистить();
	ТекстовыйПарсер.ИдентификаторыПрепроцессора["НЕОПРЕДЕЛЕНО"] = "НЕОПРЕДЕЛЕНО";
	ТекстовыйПарсер.ИдентификаторыПрепроцессора["NULL"] = "NULL";
	ТекстовыйПарсер.ИдентификаторыПрепроцессора["ИСТИНА"] = 0;
	ТекстовыйПарсер.ИдентификаторыПрепроцессора["ЛОЖЬ"] = 1;
	ТекстовыйПарсер.ИдентификаторыПрепроцессора["БЭКЕНД"] = ?(ОбщегоНазначенияКлиентСервер.ЭтоБэкенд(), 1, 0);
	
КонецФункции

Функция ЗарегистрироватьДирективыКонтекстовИсполнения(ТекстовыйПарсер)

	ТекстовыйПарсер.Вставить("ДирективыКонтекстовИсполненияМассив", Новый Массив);
	ТекстовыйПарсер.Вставить("ДирективыКонтекстовИсполнения", Новый Соответствие);
	
	ЗарегистрироватьДирективуКонтекстаИсполнения(ТекстовыйПарсер, "НаКлиенте",				"Клиент",	Истина,		"НаКлиентеБезКонтекста, НаСервере, НаСервереБезКонтекста");
	ЗарегистрироватьДирективуКонтекстаИсполнения(ТекстовыйПарсер, "НаКлиентеБезКонтекста",	"Клиент",	Ложь,		"НаСервереБезКонтекста");
	ЗарегистрироватьДирективуКонтекстаИсполнения(ТекстовыйПарсер, "НаСервере",				"Сервер",	Истина,		"НаСервереБезКонтекста");
	ЗарегистрироватьДирективуКонтекстаИсполнения(ТекстовыйПарсер, "НаСервереБезКонтекста",	"Сервер",	Ложь);

КонецФункции

Функция ЗарегистрироватьДирективуКонтекстаИсполнения(ТекстовыйПарсер, Имя, КонтекстИсполнения, ИспользоватьДанныеКонтекста, ВозможныеПереходы=Неопределено)
	
	Перем РК;
	
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	Директива = Новый Структура;
	Директива.Вставить("Имя", ВРЕГ(Имя));
	Директива.Вставить("КонтекстИсполнения", КонтекстИсполнения);
	Директива.Вставить("ИспользоватьДанныеКонтекста", ИспользоватьДанныеКонтекста);
	Директива.Вставить("ВозможныеПереходы", Новый Соответствие);
	
	Если ВозможныеПереходы<>Неопределено Тогда
		ВозможныеПереходыМассив = РК.ЗначениеВМассив(ВозможныеПереходы, , Ложь);
		Для Каждого ВозможныйПереход Из ВозможныеПереходыМассив Цикл
			Директива.ВозможныеПереходы[ВРЕГ(ВозможныйПереход)] = Истина;
		КонецЦикла;
	КонецЕсли;
	
	ТекстовыйПарсер.ДирективыКонтекстовИсполненияМассив.Добавить(Директива);
	ТекстовыйПарсер.ДирективыКонтекстовИсполнения[Директива.Имя] = Директива;
	
КонецФункции

Функция ЗаполнитьЗарезервированныеИдентификаторы(ТекстовыйПарсер)
	
	ЗарезервированныеИдентификаторы = Новый Соответствие;
	
	Для Каждого ЭлементКлючевогоСлова Из ТекстовыйПарсер.ЛогическиеБлоки.КлючевыеСлова Цикл
		ЗарезервированныеИдентификаторы[ЭлементКлючевогоСлова.Ключ] = Истина;
	КонецЦикла;
	
	ЗарезервированныеИдентификаторы["И"] = Истина;
	ЗарезервированныеИдентификаторы["НЕ"] = Истина;
	ЗарезервированныеИдентификаторы["ИЛИ"] = Истина;
	
	ЗарезервированныеИдентификаторы["ФУНКЦИЯ"] = Истина;
	ЗарезервированныеИдентификаторы["КОНЕЦФУНКЦИИ"] = Истина;
	ЗарезервированныеИдентификаторы["ПРОЦЕДУРА"] = Истина;
	ЗарезервированныеИдентификаторы["КОНЕЦПРОЦЕДУРЫ"] = Истина;
	ЗарезервированныеИдентификаторы["НОВЫЙ"] = Истина;
	
	// Ключевые только для операторов препроцессора
	// а так можно пользовать
	ЗарезервированныеИдентификаторы.Удалить("ОБЛАСТЬ");
	ЗарезервированныеИдентификаторы.Удалить("КОНЕЦОБЛАСТИ");
	
	ТекстовыйПарсер.Вставить("ЗарезервированныеИдентификаторы", ЗарезервированныеИдентификаторы);
	
КонецФункции

Функция ПолучитьОперацииВыражений()
	
	Порядок = 1;
	Поля = "Тип, Порядок";
	ОперацииВыраженийМассив = Новый Массив;
	
	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, "НЕ", Порядок));
	Порядок = Порядок + 1;

	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, "*", Порядок));
	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, "/", Порядок));
	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, "%", Порядок));
	Порядок = Порядок + 1;

	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, "+", Порядок));
	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, "-", Порядок));
	Порядок = Порядок + 1;
	
	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, "=", Порядок));
	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, "<>", Порядок));
	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, ">", Порядок));
	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, ">=", Порядок));
	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, "<", Порядок));
	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, "<=", Порядок));
	Порядок = Порядок + 1;
	
	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, "И", Порядок));
	Порядок = Порядок + 1;
	
	ОперацииВыраженийМассив.Добавить(Новый Структура(Поля, "ИЛИ", Порядок));
	Порядок = Порядок + 1;

	ОперацииВыражений = Новый Соответствие;
	Для Каждого ОперацияВыражения Из ОперацииВыраженийМассив Цикл
		ОперацииВыражений[ОперацияВыражения.Тип] = ОперацияВыражения;
	КонецЦикла;
	
	Возврат ОперацииВыражений;

КонецФункции

Функция ЗаполнитьГраницыЛогическихБлоков(ТекстовыйПарсер)

	ГраницыЛогическихБлоков = Новый Соответствие;
	Для Каждого Элемент Из ТекстовыйПарсер.ЛогическиеБлоки.НачалаЛогическихБлоков Цикл
		ГраницыЛогическихБлоков[Элемент.Ключ] = Истина;
	КонецЦикла;
	
	Для Каждого Элемент Из ТекстовыйПарсер.ЛогическиеБлоки.ЭтоКонецЛогическогоБлока Цикл
		ГраницыЛогическихБлоков[Элемент.Ключ] = Истина;
	КонецЦикла;
	
	ТекстовыйПарсер.Вставить("ГраницыЛогическихБлоков", ГраницыЛогическихБлоков);
	
КонецФункции

Функция ПолучитьЛогическиеБлоки()
	
	Перем РК, ПарсированиеТекста;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	ПарсированиеТекста = глОбщийМодуль("ПарсированиеТекста");

	ОписаниеБлоковТекст =
	"[
	|	[Если,		[КонецЕсли, ИначеЕсли, Иначе], Тогда],
	|	[ИначеЕсли,	[КонецЕсли, ИначеЕсли, Иначе], Тогда],
	|	[Иначе,		КонецЕсли],
	|
	|	[Для, КонецЦикла, Цикл],
	|	[Пока, КонецЦикла, Цикл],
	|
	|	[Область, КонецОбласти, ],
	|
	|	[Попытка, Исключение],
	|	[Исключение, КонецПопытки]
	|]";

	ОписаниеБлоков = ПарсированиеТекста.ТекстовыйПарсер_РазобратьТекст(ОписаниеБлоковТекст);
	
	СписокЛогическихБлоков = Новый Массив;
	НачалаЛогическихБлоков = Новый Соответствие;
	ЭтоКонецЛогическогоБлока = Новый Соответствие;
	Для Каждого ОписаниеБлока Из ОписаниеБлоков Цикл
		КонцыБлокаМассив = РК.ЗначениеВМассив(ОписаниеБлока[1], , Ложь);
		КонцыЛогическогоБлока = Новый Соответствие;
		Для Каждого КонецБлока Из КонцыБлокаМассив Цикл
			ЭтоКонецЛогическогоБлока[ВРЕГ(КонецБлока)] = Истина;
			КонцыЛогическогоБлока[ВРЕГ(КонецБлока)] = Истина;
		КонецЦикла;
		
		ЛогическийБлок = Новый Структура;
		ЛогическийБлок.Вставить("Начало", ВРЕГ(ОписаниеБлока[0]));
		ЛогическийБлок.Вставить("Концы", КонцыЛогическогоБлока);
		Если ОписаниеБлока.Количество() > 2 Тогда
			ЛогическийБлок.Вставить("КонецЗаголовка", ВРЕГ(ОписаниеБлока[2]));
		Иначе
			ЛогическийБлок.Вставить("КонецЗаголовка");
		КонецЕсли;
		
		ЛогическийБлок.Вставить("ЕстьЗаголовок", ЛогическийБлок.КонецЗаголовка <> Неопределено);
		СписокЛогическихБлоков.Добавить(ЛогическийБлок);
		
		НачалаЛогическихБлоков[ЛогическийБлок.Начало] = ЛогическийБлок;
	КонецЦикла;

	КлючевыеСлова = Новый Соответствие;
	ОбходКлючевыхСловБлока = Новый Массив;
	ОбходКлючевыхСловБлока.Добавить(ОписаниеБлоков);
	Для Каждого ЭлементОбходаКлючевыхСловБлока Из ОбходКлючевыхСловБлока Цикл
		
		Если ТипЗнч(ЭлементОбходаКлючевыхСловБлока)=Тип("Массив") Тогда
			
			Для Каждого ВложенныйЭлементОбходаКлючевыхСловБлока Из ЭлементОбходаКлючевыхСловБлока Цикл
				ОбходКлючевыхСловБлока.Добавить(ВложенныйЭлементОбходаКлючевыхСловБлока);
			КонецЦикла;
			
		Иначе
			
			Слово = ЭлементОбходаКлючевыхСловБлока;
			КлючевыеСлова[ВРЕГ(Слово)] = Слово;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЛогическиеБлоки = Новый Структура;
	ЛогическиеБлоки.Вставить("СписокЛогическихБлоков", СписокЛогическихБлоков);
	ЛогическиеБлоки.Вставить("НачалаЛогическихБлоков", НачалаЛогическихБлоков);
	ЛогическиеБлоки.Вставить("ЭтоКонецЛогическогоБлока", ЭтоКонецЛогическогоБлока);
	ЛогическиеБлоки.Вставить("КлючевыеСлова", КлючевыеСлова);
	
	Возврат ЛогическиеБлоки;
	
КонецФункции

Функция ПолучитьОписанияСкобок()
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = глОбщийМодуль("РаботаСКоллекциями");
	
	ОписаниеСкобок =
	"[,]
	|(,)";
	//|<,>";

	СписокОписанийСкобок = Новый Массив;
	ОписаниеСкобокСтроки = РаботаСКоллекциями.СтрокуВМассив(ОписаниеСкобок, Символы.ПС);
	ЛевыеСкобки = Новый Соответствие;
	ПравыеСкобки = Новый Соответствие;
	Для Каждого ОписаниеСкобкиСтрока Из ОписаниеСкобокСтроки Цикл
		ОписаниеСкобкиМассив = РаботаСКоллекциями.СтрокуВМассив(ОписаниеСкобкиСтрока, ",");
		ОписаниеСкобки = Новый Структура;
		ОписаниеСкобки.Вставить("Начало", ОписаниеСкобкиМассив[0]);
		ОписаниеСкобки.Вставить("Конец", ОписаниеСкобкиМассив[1]);
		
		СписокОписанийСкобок.Добавить(ОписаниеСкобки);
		
		ЛевыеСкобки[ОписаниеСкобки.Начало] = ОписаниеСкобки;
		ПравыеСкобки[ОписаниеСкобки.Конец] = ОписаниеСкобки;
	КонецЦикла;
	
	ОписанияСкобок = Новый Структура;
	ОписанияСкобок.Вставить("СписокОписанийСкобок", СписокОписанийСкобок);
	ОписанияСкобок.Вставить("ЛевыеСкобки", ЛевыеСкобки);
	ОписанияСкобок.Вставить("ПравыеСкобки", ПравыеСкобки);
	
	Возврат ОписанияСкобок;
	
КонецФункции

Функция ПолучитьОператорыСравнения()
	
	ОператорыСравнения = Новый Соответствие;
	ОператорыСравнения[">"] = Истина;
	ОператорыСравнения["<"] = Истина;
	ОператорыСравнения["="] = Истина;
	
	Возврат ОператорыСравнения;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьТекст(ТекстовыйПарсер, Текст) Экспорт
	ТекстовыйПарсер_УстановитьТекст(ТекстовыйПарсер, Текст);
	ТекстовыйПарсер_РазобратьСлова(ТекстовыйПарсер);
	ТекстовыйПарсер_РазобратьМодуль(ТекстовыйПарсер);
	Возврат Истина;
КонецФункции

Функция ТекстовыйПарсер_УстановитьТекст(ТекстовыйПарсер, Текст) Экспорт

	ЗдесьОстановиПоБратски("Гагаринский дом 3");
	
	Кодировка = КодировкаТекста.UTF8;
	
	Поток = Новый ПотокВПамяти;
	ЗаписьТекста = Новый ЗаписьТекста;
	ЗаписьТекста.Открыть(Поток, Кодировка);
	ЗаписьТекста.ЗаписатьСтроку(Текст);
	ЗаписьТекста.Закрыть();
	Поток.Перейти(0, ПозицияВПотоке.Начало);
	
	ТекстовыйПарсер.ЧтениеТекста = Новый ЧтениеТекста(Поток, Кодировка);
	ТекстовыйПарсер.Текст = Текст;
	ТекстовыйПарсер.НомерСимвола = 1;
	ТекстовыйПарсер.НомерСтроки = 0;
	ТекстовыйПарсер.ДлинаСтроки = 0;
	ТекстовыйПарсер.Строка = Неопределено;

КонецФункции

Функция ТекстовыйПарсер_РазобратьМодуль(ТекстовыйПарсер) Экспорт

	ОписаниеОшибки = Новый Структура;
	ОписаниеОшибки.Вставить("Текст");
	ОписаниеОшибки.Вставить("Строка");
	ОписаниеОшибки.Вставить("Ошибка", Ложь);
	ТекстовыйПарсер.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	
	ТекстовыйПарсер_Очистить(ТекстовыйПарсер);
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	ДирективаПоУмолчанию = ТекстовыйПарсер.ДирективыКонтекстовИсполнения["НАСЕРВЕРЕ"];

	ГлобальнаяОбласть = Новый Структура(ТекстовыйПарсер.ПоляПодпрограммы);
	ИнициализироватьНовуюПодпрограмму(ТекстовыйПарсер, ГлобальнаяОбласть);
	ГлобальнаяОбласть.ТипОператора = Неопределено;
	ГлобальнаяОбласть.ДополнительныеДанные.ДирективаКомпиляции = ДирективаПоУмолчанию;
	
	ТекстовыйПарсер.ГлобальнаяОбласть = ГлобальнаяОбласть;
	ТекстовыйПарсер.ТекущийОператор = Неопределено;
	
	ГлобальныйКласс = НовыйКласс(ТекстовыйПарсер, "");
	ГлобальныйКласс.ИспользоватьНативныеМетоды = Истина;
	ТекстовыйПарсер.ГлобальныйКласс = ГлобальныйКласс;
	
	КонтекстыИсполнения = ТекстовыйПарсер.КонтекстыИсполнения;
	ИдентификаторыПрепроцессора = ТекстовыйПарсер.ИдентификаторыПрепроцессора;
	Если ТекстовыйПарсер.КонтекстИсполнения=КонтекстыИсполнения.Клиент Тогда
		ИдентификаторыПрепроцессора["КЛИЕНТ"] = 1;
		ИдентификаторыПрепроцессора["СЕРВЕР"] = 0;
	ИначеЕсли ТекстовыйПарсер.КонтекстИсполнения=КонтекстыИсполнения.Сервер Тогда
		ИдентификаторыПрепроцессора["КЛИЕНТ"] = 0;
		ИдентификаторыПрепроцессора["СЕРВЕР"] = 1;
	КонецЕсли;
	
	ТекстовыйПарсер_ОбработатьДирективыПрепроцессора(ТекстовыйПарсер);
	
	УстановитьТекущееСлово(ТекстовыйПарсер, 0);
	Пока Истина Цикл
		
		Слово = ТекстовыйПарсер.ТекущееСлово;
		Если Слово.ТипСлова=Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол Тогда
			
			Если ТекстовыйПарсер_ПрочитатьДирективуКомпиляции(ТекстовыйПарсер, ГлобальнаяОбласть) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
		ИначеЕсли Слово.ТипСлова=ТипыСловИОператоров.Идентификатор Тогда
			
			Если ТекстовыйПарсер_ПрочитатьОписаниеКласса(ТекстовыйПарсер, ГлобальнаяОбласть) Тогда
				
				Продолжить;
				
			ИначеЕсли ТекстовыйПарсер_РазобратьОператорПеременные(ТекстовыйПарсер, ГлобальныйКласс, ГлобальнаяОбласть) Тогда
				
				ГлобальнаяОбласть.ДополнительныеДанные.ДирективаКомпиляции = ДирективаПоУмолчанию;
				Продолжить;
				
			ИначеЕсли ТекстовыйПарсер_РазобратьОператорПодпрограмма(ТекстовыйПарсер, ГлобальныйКласс, ГлобальнаяОбласть) Тогда
				
				ГлобальнаяОбласть.ДополнительныеДанные.ДирективаКомпиляции = ДирективаПоУмолчанию;
				Продолжить;
				
			ИначеЕсли ТекстовыйПарсер_РазобратьОператорГлавнаяПодпрограмма(ТекстовыйПарсер, ГлобальныйКласс) Тогда
				
				Продолжить;

			Иначе
				
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;
			
		НовыйОператор(ТекстовыйПарсер, ГлобальнаяОбласть, Слово);
		СледующееСлово(ТекстовыйПарсер);
		
	КонецЦикла;
	
КонецФункции

Функция ТекстовыйПарсер_Очистить(ТекстовыйПарсер)
	
	Перем РК;
	
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];

	ТекстовыйПарсер.ТекущийОператор = Неопределено;
	ТекстовыйПарсер.ДополнительныеДанные.СкопированныеОператоры.Очистить();
	ТекстовыйПарсер.ГлобальныйКласс = Неопределено;
	ТекстовыйПарсер.ГлобальнаяОбласть = Неопределено;
	
	РК.ОчиститьЭлементыКоллекции(ТекстовыйПарсер.ТаблицаКлассов);
	РК.ОчиститьЭлементыКоллекции(ТекстовыйПарсер.ТаблицаПодпрограмм);
	ТекстовыйПарсер_ОчиститьЗависимости(ТекстовыйПарсер);
	ТекстовыйПарсер_УстановитьИдентификаторыПрепроцессораПоУмолчанию(ТекстовыйПарсер);
	
КонецФункции

Функция ТекстовыйПарсер_ОчиститьЗависимости(ТекстовыйПарсер)
	
	ТекстовыйПарсер.Зависимости.Включения.Очистить();
	ТекстовыйПарсер.Зависимости.Использования.Очистить();
	
КонецФункции

//
//{ Препроцессор

Функция ТекстовыйПарсер_ОбработатьДирективыПрепроцессора(ТекстовыйПарсер)

	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	тСпецсивол = ТипыСловИОператоров.Спецсимвол;
	УстановитьТекущееСлово(ТекстовыйПарсер, 0);
	
	Пока Истина Цикл
		
		Слово = ТекстовыйПарсер.ТекущееСлово;
		Если Слово.ТипСлова=Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если Слово.ТипСлова=тСпецсивол И Слово.Слово="#" Тогда
			
			Если ТекстовыйПарсер_ОбработатьДирективуПрепроцессораЛогическийБлок(ТекстовыйПарсер) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекстовыйПарсер_ОбработатьДирективуПрепроцессораВключить(ТекстовыйПарсер) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекстовыйПарсер_ОбработатьДирективуПрепроцессораОпределить(ТекстовыйПарсер) Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		СледующееСлово(ТекстовыйПарсер);
		
	КонецЦикла;
	
КонецФункции

Функция ТекстовыйПарсер_ОбработатьДирективуПрепроцессораЛогическийБлок(ТекстовыйПарсер)

	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тСпецсимвол = ТипыСловИОператоров.Спецсимвол;
	
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если НЕ (Слово.ТипСлова=тСпецсимвол И Слово.Слово="#") Тогда
		Возврат Ложь;
	КонецЕсли;
	НомерПервогоСлова = ТекстовыйПарсер.НомерТекущегоСлова;
	
	Слово = СледующееСлово(ТекстовыйПарсер);
	Директива = Слово.ВРСлово;
	Если НЕ (Директива="ЕСЛИ" ИЛИ Директива="ИНАЧЕЕСЛИ" ИЛИ Директива="ИНАЧЕ" ИЛИ Директива="ОБЛАСТЬ") Тогда
		УстановитьТекущееСлово(ТекстовыйПарсер, НомерПервогоСлова);
		Возврат Ложь;
	КонецЕсли;
	
	ЛогическиеБлоки = ТекстовыйПарсер.ЛогическиеБлоки;
	ЛогическийБлок = ЛогическиеБлоки.НачалаЛогическихБлоков[Директива];
	Если ЛогическийБлок = Неопределено Тогда
		УстановитьТекущееСлово(ТекстовыйПарсер, НомерПервогоСлова);
		Возврат Ложь;
	КонецЕсли;
	СледующееСлово(ТекстовыйПарсер);
	
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	СловаВыражения = Новый Массив;
	Если Директива="ОБЛАСТЬ" Тогда
		КлючевоеСловоНачалоЦепиБлоков = "ОБЛАСТЬ";
		КлючевоеСловоКонецЦепиБлоков = "КОНЕЦОБЛАСТИ";
		
		Если Слово.ТипСлова=тИдентификатор Тогда //Имя области
			СледующееСлово(ТекстовыйПарсер);
		КонецЕсли;
	Иначе
		КлючевоеСловоНачалоЦепиБлоков = "ЕСЛИ";
		КлючевоеСловоКонецЦепиБлоков = "КОНЕЦЕСЛИ";

		Если ЛогическийБлок.ЕстьЗаголовок Тогда
			Пока Истина Цикл
				
				Слово = ТекстовыйПарсер.ТекущееСлово;
				Если Слово.ТипСлова=тИдентификатор Тогда
					Если Слово.ВРСлово=ЛогическийБлок.КонецЗаголовка Тогда
						СледующееСлово(ТекстовыйПарсер);
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
				СловаВыражения.Добавить(Слово);
				
				СледующееСлово(ТекстовыйПарсер);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	НомерСловаНачалоБлока = ТекстовыйПарсер.НомерТекущегоСлова;
	
	Если СловаВыражения.Количество() > 0 Тогда
		ИдентификаторыПрепроцессора = ТекстовыйПарсер.ИдентификаторыПрепроцессора;
		ЗарезервированныеИдентификаторы = ТекстовыйПарсер.ЗарезервированныеИдентификаторы;
		Пробел = ТекстовыйПарсер.Пробел;
		Выражение = "";
		ЭтоСловоИдентификатор = Ложь;
		ЭтоОткрывающаяСкобка = Ложь;
		ЭтоЗакрывающаяСкобка = Ложь;
		Для Каждого СловоВыражения Из СловаВыражения Цикл
			ПредыдущееСловоЭтоИдентификатор = ЭтоСловоИдентификатор;
			ПредыдущееСловоЭтоОткрывающаяСкобка = ЭтоОткрывающаяСкобка;
			ПредыдущееСловоЭтоЗакрывающаяСкобка = ЭтоЗакрывающаяСкобка;

			ЭтоСловоИдентификатор = СловоВыражения.ТипСлова=тИдентификатор;
			ЭтоОткрывающаяСкобка = СловоВыражения.ТипСлова=тСпецсимвол И СловоВыражения.Слово="(";
			ЭтоЗакрывающаяСкобка = СловоВыражения.ТипСлова=тСпецсимвол И СловоВыражения.Слово=")";
			
			Если НЕ ЭтоОткрывающаяСкобка И ЭтоСловоИдентификатор ИЛИ ПредыдущееСловоЭтоИдентификатор И НЕ ЭтоСловоИдентификатор И НЕ ЭтоЗакрывающаяСкобка Тогда
				Выражение = Выражение + Пробел;
			КонецЕсли;
			
			Если ЭтоСловоИдентификатор И ЗарезервированныеИдентификаторы[СловоВыражения.ВРСлово]=Неопределено Тогда
				ЗначениеИдентификатора = ИдентификаторыПрепроцессора[СловоВыражения.ВРСлово];
				Если ЗначениеИдентификатора=Неопределено Тогда
					ЗначениеИдентификатора = 0;
				КонецЕсли;
				Выражение = Выражение + ЗначениеИдентификатора;
			Иначе
				Выражение = Выражение + СловоВыражения.Слово;
			КонецЕсли;
		КонецЦикла;
		ЗначениеВыражения = Вычислить(Выражение);
	Иначе
		ЗначениеВыражения = Истина;
	КонецЕсли;
	
	// ищем конец блока
	Уровень = 0;
	Пока Истина Цикл
		
		Слово = ТекстовыйПарсер.ТекущееСлово;
		Если Слово.ТипСлова=Неопределено Тогда
			//ОШИБКА
			Возврат Ложь;
		КонецЕсли;
		
		Если Слово.ТипСлова=тСпецсимвол И Слово.Слово="#" Тогда
			Слово = СледующееСлово(ТекстовыйПарсер);
			
			Если Слово.ВРСлово=КлючевоеСловоНачалоЦепиБлоков Тогда
				
				Уровень = Уровень + 1;
				
			ИначеЕсли Уровень=0 Тогда
				
				Если ЛогическийБлок.Концы[Слово.ВРСлово]<>Неопределено Тогда
					Прервать;
				КонецЕсли;
				
			ИначеЕсли Слово.ВРСлово=КлючевоеСловоКонецЦепиБлоков Тогда
				
				Уровень = Уровень - 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СледующееСлово(ТекстовыйПарсер);
		
	КонецЦикла;
	НомерСловаКонецБлока = ТекстовыйПарсер.НомерТекущегоСлова;
	НомерСловаКонецБлока = НомерСловаКонецБлока - 1; //встанем на решетку "#"
	УстановитьТекущееСлово(ТекстовыйПарсер, НомерСловаКонецБлока);
	
	Если ЗначениеВыражения Тогда
		
		// ицем конец паравозика-цепочки условных операторов
		Уровень = 0;
		Пока Истина Цикл
			
			Слово = ТекстовыйПарсер.ТекущееСлово;
			Если Слово.ТипСлова=Неопределено Тогда
				//ОШИБКА
				Возврат Ложь;
			КонецЕсли;
			
			Если Слово.ТипСлова=тСпецсимвол И Слово.Слово="#" Тогда
				Слово = СледующееСлово(ТекстовыйПарсер);
				
				Если Слово.ВРСлово=КлючевоеСловоНачалоЦепиБлоков Тогда
					
					Уровень = Уровень + 1;
					
				ИначеЕсли Слово.ВРСлово=КлючевоеСловоКонецЦепиБлоков Тогда
					
					Если Уровень=0 Тогда
						СледующееСлово(ТекстовыйПарсер);
						Прервать;
					КонецЕсли;
					
					Уровень = Уровень - 1;
					
				КонецЕсли;
				
			КонецЕсли;
			
			СледующееСлово(ТекстовыйПарсер);
			
		КонецЦикла;
		
		НомерСловаКонецЦепиБлоков = ТекстовыйПарсер.НомерТекущегоСлова;
		
		// вырежем цепь блоков
		КоличествоСловВырезать = НомерСловаКонецЦепиБлоков-НомерСловаКонецБлока;
		Для НомерСловаВырезать=1 По КоличествоСловВырезать Цикл
			ТекстовыйПарсер.Слова.Удалить(НомерСловаКонецБлока);
		КонецЦикла;
		ТекстовыйПарсер.КоличествоСлов = ТекстовыйПарсер.КоличествоСлов-КоличествоСловВырезать;
		
		// вырежем заголовок блока
		КоличествоСловВырезать = НомерСловаНачалоБлока-НомерПервогоСлова;
		Для НомерСловаВырезать=1 По КоличествоСловВырезать Цикл
			ТекстовыйПарсер.Слова.Удалить(НомерПервогоСлова);
		КонецЦикла;
		ТекстовыйПарсер.КоличествоСлов = ТекстовыйПарсер.КоличествоСлов-КоличествоСловВырезать;
	Иначе

		// вырежем текущий блок
		Если Слово.ВРСлово=КлючевоеСловоКонецЦепиБлоков Тогда
			НомерСловаКонецБлока = НомерСловаКонецБлока + 2;
		КонецЕсли;
		
		КоличествоСловВырезать = НомерСловаКонецБлока-НомерПервогоСлова;
		Для НомерСловаВырезать=1 По КоличествоСловВырезать Цикл
			ТекстовыйПарсер.Слова.Удалить(НомерПервогоСлова);
		КонецЦикла;
		ТекстовыйПарсер.КоличествоСлов = ТекстовыйПарсер.КоличествоСлов-КоличествоСловВырезать;
		
	КонецЕсли;
	
	УстановитьТекущееСлово(ТекстовыйПарсер, НомерПервогоСлова);
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_ОбработатьДирективуПрепроцессораВключить(ТекстовыйПарсер)

	Слово = ТекстовыйПарсер.ТекущееСлово;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	Если Не (Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол И Слово.Слово="#") Тогда
		Возврат Ложь;
	КонецЕсли;
	НомерПервогоСлова = ТекстовыйПарсер.НомерТекущегоСлова;

	Слово = СледующееСлово(ТекстовыйПарсер);
	Если Не (Слово.ТипСлова=ТипыСловИОператоров.Идентификатор И Слово.ВРСлово = "ВКЛЮЧИТЬ") Тогда
		УстановитьТекущееСлово(ТекстовыйПарсер, НомерПервогоСлова);
		Возврат Ложь;
	КонецЕсли;
	
	Слово = СледующееСлово(ТекстовыйПарсер);
	ИмяПрограммногоМодуля = Слово.Слово;
	СледующееСлово(ТекстовыйПарсер);
	
	Слова = ТекстовыйПарсер.Слова;
	УдалитьСлова(ТекстовыйПарсер, НомерПервогоСлова);
	
	ДанныеМодуля = вмс_ВыполнениеПрограммногоКодаВызовСервера.ПолучитьДанныеПрограммногоМодуля(ИмяПрограммногоМодуля);
	Если ДанныеМодуля=Неопределено Тогда
		ВызватьИсключение "Программный модуль """ + ИмяПрограммногоМодуля + """ не обнаружен";
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекстовыйПарсер.Зависимости.Включения.Найти(ДанныеМодуля.Ссылка)=Неопределено Тогда
		ТекстовыйПарсер.Зависимости.Включения.Добавить(ДанныеМодуля.Ссылка);
	КонецЕсли;
	
	СловаВключенногоМодуля = Новый Массив;
	ТекстовыйПарсер.Слова = СловаВключенногоМодуля;
	ТекстовыйПарсер_УстановитьТекст(ТекстовыйПарсер, ДанныеМодуля.Текст);
	ТекстовыйПарсер_РазобратьСлова(ТекстовыйПарсер);
	
	ИндексСлова = НомерПервогоСлова;
	Для Каждого Слово Из СловаВключенногоМодуля Цикл
		Слова.Вставить(ИндексСлова, Слово);
		ИндексСлова = ИндексСлова + 1;
	КонецЦикла;
	
	ТекстовыйПарсер.Слова = Слова;
	ТекстовыйПарсер.КоличествоСлов = Слова.Количество();
	УстановитьТекущееСлово(ТекстовыйПарсер, НомерПервогоСлова);

	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_ОбработатьДирективуПрепроцессораОпределить(ТекстовыйПарсер)

	Слово = ТекстовыйПарсер.ТекущееСлово;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	Если Не (Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол И Слово.Слово="#") Тогда
		Возврат Ложь;
	КонецЕсли;
	НомерПервогоСлова = ТекстовыйПарсер.НомерТекущегоСлова;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;

	Слово = СледующееСлово(ТекстовыйПарсер);
	Если Не (Слово.ТипСлова=тИдентификатор И Слово.ВРСлово = "ОПРЕДЕЛИТЬ") Тогда
		УстановитьТекущееСлово(ТекстовыйПарсер, НомерПервогоСлова);
		Возврат Ложь;
	КонецЕсли;
	
	Слово = СледующееСлово(ТекстовыйПарсер);
	Если НЕ Слово.ТипСлова=тИдентификатор Тогда
		Возврат Ложь;
	КонецЕсли;
	НомерСтрокиИмяИдентификатора = Слово.НомерСтроки;
	ИмяИдентификатора = Слово.ВРСлово;

	Слово = СледующееСлово(ТекстовыйПарсер);
	Если Слово.НомерСтроки=НомерСтрокиИмяИдентификатора Тогда
		ЗначениеИдентификатора = Слово.ВРСлово;
		СледующееСлово(ТекстовыйПарсер);
	Иначе
		ЗначениеИдентификатора = "ИСТИНА";
	КонецЕсли;
	
	ТекстовыйПарсер.ИдентификаторыПрепроцессора[ИмяИдентификатора] = ЗначениеИдентификатора;
	
	УдалитьСлова(ТекстовыйПарсер, НомерПервогоСлова);
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_ПрочитатьДирективуКомпиляции(ТекстовыйПарсер, Область)

	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если НЕ (Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол И Слово.Слово = "&") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Слово = СледующееСлово(ТекстовыйПарсер);
	Если Слово.ТипСлова<>ТипыСловИОператоров.Идентификатор Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Область.ДополнительныеДанные.ДирективаКомпиляции = Слово.ВРСлово;
	СледующееСлово(ТекстовыйПарсер);

	Возврат Истина;

КонецФункции

Функция ПолучитьПараметрыДирективыКомпиляции(Директива)
	
	ПараметрыДирективы = Новый Структура;
	ПараметрыДирективы.Вставить("Клиент", СтрНайти(Директива, "НАКЛИЕНТЕ")>0);
	ПараметрыДирективы.Вставить("Сервер", СтрНайти(Директива, "НАСЕРВЕРЕ")>0);
	ПараметрыДирективы.Вставить("Бэкенд", СтрНайти(Директива, "НАБЭКЕНДЕ")>0);
	ПараметрыДирективы.Вставить("ИспользоватьДанныеКонтекста", СтрНайти(Директива, "БЕЗКОНТЕКСТА")=0);
	
	Возврат ПараметрыДирективы;
	
КонецФункции

//
//} Препроцессор

Функция ТекстовыйПарсер_ПрочитатьОписаниеКласса(ТекстовыйПарсер, ОператорВладелец)
	
	Перем РК;
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не (Слово.ТипСлова=тИдентификатор И Слово.ВРСлово="КЛАСС") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СловоИмяКласса = СледующееСлово(ТекстовыйПарсер);
	Если СловоИмяКласса.ТипСлова<>тИдентификатор Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяКласса = СловоИмяКласса.Слово;
	
	Класс = НовыйКласс(ТекстовыйПарсер, ИмяКласса);
	ПоместитьОператор(ТекстовыйПарсер, ОператорВладелец, Класс);
	Класс.ДополнительныеДанные.Вставить("ДирективаПоУмолчанию", "НАКЛИЕНТЕНАСЕРВЕРЕ");
	
	НовыйОператор(ТекстовыйПарсер, Класс, Слово);
	НовыйОператор(ТекстовыйПарсер, Класс, СловоИмяКласса);
	СледующееСлово(ТекстовыйПарсер);
	
	ТекстовыйПарсер_ПрочитатьПредковКласса(ТекстовыйПарсер, Класс);
	ТекстовыйПарсер_ПрочитатьМодификаторыКласса(ТекстовыйПарсер, Класс);
	
	Класс.ДополнительныеДанные.Вставить("ДирективаКомпиляции", Класс.ДополнительныеДанные.ДирективаПоУмолчанию);
	
	Пока Истина Цикл
		
		Слово = ТекстовыйПарсер.ТекущееСлово;
		Если Слово.ТипСлова=тИдентификатор Тогда
			Если Слово.ВРСлово="КОНЕЦКЛАССА" Тогда
				НовыйОператор(ТекстовыйПарсер, Класс, Слово);
				СледующееСлово(ТекстовыйПарсер);
				Прервать;
			КонецЕсли;

			Если Слово.ВРСлово="КЛАСС" Тогда
				// Допускается определение класса внутри другого класса (удобно при описании в модуле формы, который потом
				// трансформируется в класс), но при этом классы никак не связаны с друг другом(не включают другие классы, не наследуют)
				ТекстовыйПарсер_ПрочитатьОписаниеКласса(ТекстовыйПарсер, ОператорВладелец);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ТекстовыйПарсер_РазобратьОператорКласса(ТекстовыйПарсер, Класс) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	Для Каждого Переменная Из РК.ПолучитьЭлементыКоллекции(Класс.ТаблицаПеременных) Цикл
		ИмяПеременной = ВРЕГ(Переменная.Имя);
		Если Переменная.Нативный Тогда
			// Поле уже есть во встроенном объекте
			// соответственно не добавляем его в главный объект
			Класс.ИменаНативныхПолейМассив.Добавить(ИмяПеременной);
		Иначе
			Класс.Поля.Добавить(Переменная);
			Класс.ИменаПолейМассив.Добавить(ИмяПеременной);
		КонецЕсли;
	КонецЦикла;
	Класс.ИменаПолей = РК.МассивВСтроку(Класс.ИменаПолейМассив);
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_ПрочитатьПредковКласса(ТекстовыйПарсер, Класс)
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	тСпецсимвол = ТипыСловИОператоров.Спецсимвол;
	
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не (Слово.ТипСлова=тСпецсимвол И Слово.Слово=":") Тогда
		Возврат Ложь;
	КонецЕсли;

	НовыйОператор(ТекстовыйПарсер, Класс, Слово);
	
	Пока Истина Цикл
		
		Слово = СледующееСлово(ТекстовыйПарсер);
		Если Слово.ТипСлова=тИдентификатор Тогда
			Класс.Предки.Добавить(Слово.ВРСлово);
			НовыйОператор(ТекстовыйПарсер, Класс, Слово);
		Иначе
			Прервать;
		КонецЕсли;
			
		Слово = СледующееСлово(ТекстовыйПарсер);
		Если Слово.ТипСлова=тСпецсимвол И Слово.Слово="," Тогда
			НовыйОператор(ТекстовыйПарсер, Класс, Слово);
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_ПрочитатьМодификаторыКласса(ТекстовыйПарсер, Класс)

	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	тСпецсимвол = ТипыСловИОператоров.Спецсимвол;
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Пока Истина Цикл
		
		Если Слово.ВРСлово="ДИРЕКТИВАКОМПИЛЯЦИИПОУМОЛЧАНИЮ" Тогда
			
			Слово = СледующееСлово(ТекстовыйПарсер);
			Если Слово.ТипСлова=тИдентификатор Тогда
				ДирективаПоУмолчанию = Слово.ВРСлово;
				Класс.ДополнительныеДанные.ДирективаПоУмолчанию = ДирективаПоУмолчанию;
				Слово = СледующееСлово(ТекстовыйПарсер);
			КонецЕсли;
			
		ИначеЕсли Слово.ВРСлово="ИСПОЛЬЗОВАТЬНАТИВНЫЕМЕТОДЫ" Тогда
			
			Класс[Слово.ВРСлово] = Истина;
			Слово = СледующееСлово(ТекстовыйПарсер);
			
		ИначеЕсли Слово.ВРСлово="ИДЕНТИФИКАТОРЫУКАЗАТЕЛЕЙТЕКУЩЕГООБЪЕКТА" Тогда
			
			Класс.ИдентификаторыУказателейТекущегоОбъекта.Очистить();
			Слово = СледующееСлово(ТекстовыйПарсер);
			
			Пока Истина Цикл
				
				Если Слово.ТипСлова=тИдентификатор Тогда
					Класс.ИдентификаторыУказателейТекущегоОбъекта.Добавить(Слово.ВРСлово);
					Слово = СледующееСлово(ТекстовыйПарсер);
					Если Слово.ТипСлова=тСпецсимвол И Слово.ВРСлово="," Тогда
						Слово = СледующееСлово(ТекстовыйПарсер);
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				Прервать;
				
			КонецЦикла;
			
		Иначе
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорКласса(ТекстовыйПарсер, Класс)
	
	Если ТекстовыйПарсер_ПрочитатьДирективуКомпиляции(ТекстовыйПарсер, Класс) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТекстовыйПарсер_РазобратьОператорПеременные(ТекстовыйПарсер, Класс, Класс) Тогда
		Класс.ДополнительныеДанные.ДирективаКомпиляции = Класс.ДополнительныеДанные.ДирективаПоУмолчанию;
		Возврат Истина;
	КонецЕсли;
	
	Если ТекстовыйПарсер_РазобратьОператорПодпрограмма(ТекстовыйПарсер, Класс) Тогда
		Класс.ДополнительныеДанные.ДирективаКомпиляции = Класс.ДополнительныеДанные.ДирективаПоУмолчанию;
		Возврат Истина;
	КонецЕсли;
	
	Если ТекстовыйПарсер_РазобратьОператорГлавнаяПодпрограмма(ТекстовыйПарсер, Класс) Тогда
		Возврат Истина;
	КонецЕсли;

	Если ТекстовыйПарсер_РазобратьОператорСпецсимвол(ТекстовыйПарсер, Класс) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

Функция НовыйКласс(ТекстовыйПарсер, Имя)
	
	Перем РК;
	
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ТаблицаКлассов = ТекстовыйПарсер.ТаблицаКлассов;

	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("ДирективаКомпиляции");
	
	Класс = РК.НовыйЭлементКоллекции(ТаблицаКлассов);
	Класс.ВРИмя = ВРЕГ(Имя);
	Класс.Имя = Имя;
	Класс.ДополнительныеДанные = ДополнительныеДанные;
	РК.ИндексироватьКоллекцию(ТаблицаКлассов, Класс);
	
	Класс.ТаблицаПеременных = НоваяТаблицаПеременных(ТекстовыйПарсер);
	Класс.ИдентификаторыУказателейТекущегоОбъекта = Новый Массив;
	Класс.Предки = Новый Массив;
	Класс.Поля = Новый Массив;
	Класс.ИменаПолейМассив = Новый Массив;
	Класс.ИменаНативныхПолейМассив = Новый Массив;
	Класс.Методы = Новый Массив;
	Класс.ИспользоватьНативныеМетоды = Ложь;
	Класс.Операторы = Новый Массив;
	Класс.ЛевоеЗначение = Истина;
	
	Класс.ИдентификаторыУказателейТекущегоОбъекта.Добавить("ЭТОТОБЪЕКТ");
	
	Если Класс.ВРИмя<>"БАЗОВЫЙКЛАСС" Тогда
		Класс.Предки.Добавить("БАЗОВЫЙКЛАСС");
	КонецЕсли;
	
	Возврат Класс;
	
КонецФункции

Функция НоваяПодпрограмма(ТекстовыйПарсер, Имя, Класс)

	Перем РК;
	
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ТаблицаПодпрограмм = ТекстовыйПарсер.ТаблицаПодпрограмм;

	Подпрограмма = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаПодпрограмм);
	
	ИнициализироватьНовуюПодпрограмму(ТекстовыйПарсер, Подпрограмма);
	Подпрограмма.ДополнительныеДанные.Класс = Класс;
	
	Подпрограмма.Имя = Имя;
	Подпрограмма.ВРИмя = ВРЕГ(Имя);
	Подпрограмма.ВРИмяКласса = Класс.ВРИмя;
	РК.ИндексироватьКоллекцию(ТаблицаПодпрограмм, Подпрограмма);
	
	Возврат Подпрограмма;

КонецФункции

Функция ИнициализироватьНовуюПодпрограмму(ТекстовыйПарсер, Подпрограмма)

	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("ДирективаКомпиляции");
	ДополнительныеДанные.Вставить("ПреобразованныеОператоры", Новый Массив);
	ДополнительныеДанные.Вставить("Описание");
	ДополнительныеДанные.Вставить("Тело");
	ДополнительныеДанные.Вставить("Класс");
	ДополнительныеДанные.Вставить("ОператорыСозданияНовыхОбъектов", Новый Массив);
	ДополнительныеДанные.Вставить("ОператорыЦиклов", Новый Массив);
	
	Подпрограмма.Объявление = Ложь;
	Подпрограмма.Нативная = Ложь;
	Подпрограмма.Экспорт = Ложь;
	Подпрограмма.НепосредственныйДоступКПолямОбъекта = Ложь;
	Подпрограмма.ТаблицаПараметров = НоваяТаблицаПараметров(ТекстовыйПарсер);
	Подпрограмма.ТаблицаПеременных = НоваяТаблицаПеременных(ТекстовыйПарсер);
	Подпрограмма.ТипОператора = ТекстовыйПарсер.ТипыСловИОператоров.Подпрограмма; //подпрограмма это большой оператор
	Подпрограмма.ЛевоеЗначение = Истина;
	Подпрограмма.Операторы = Новый Массив;
	Подпрограмма.ДополнительныеДанные = ДополнительныеДанные;

КонецФункции

Функция НоваяТаблицаПараметров(ТекстовыйПарсер)
	
	Перем РК;
	
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];

	ТаблицаПараметров = РК.НоваяКвазиТаблицаЗначений("Имя, ВРИмя, ПоЗначению, ЗначениеПоУмолчанию");
	
	Возврат ТаблицаПараметров;
	
КонецФункции

Функция НоваяТаблицаПеременных(ТекстовыйПарсер)
	
	Перем РК;
	
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];

	ТаблицаПеременных = РК.НоваяКвазиТаблицаЗначений("Имя, Экспорт, Нативный");
	
	Возврат ТаблицаПеременных;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорГлавнаяПодпрограмма(ТекстовыйПарсер, Класс)
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Слово.ТипСлова <> тИдентификатор Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтопСлова = Новый Соответствие;
	СтопСлова["ПРОЦЕДУРА"] = Истина;
	СтопСлова["ФУНКЦИЯ"] = Истина;
	СтопСлова["КЛАСС"] = Истина;
	СтопСлова["КОНЕЦКЛАССА"] = Истина;
	Если СтопСлова[Слово.ВРСлово]=Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КонтекстИсполнения = ТекстовыйПарсер.КонтекстИсполнения;
	КонтекстыИсполнения = ТекстовыйПарсер.КонтекстыИсполнения;
	
	Если КонтекстИсполнения=КонтекстыИсполнения.Клиент Тогда
		ИмяДирективыПодпрограммы = "НАКЛИЕНТЕ";
	ИначеЕсли КонтекстИсполнения=КонтекстыИсполнения.Сервер Тогда
		ИмяДирективыПодпрограммы = "НАСЕРВЕРЕ";
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
	Подпрограмма = НоваяПодпрограмма(ТекстовыйПарсер, "@ГЛАВНАЯ@", Класс);
	Подпрограмма.Директива = ТекстовыйПарсер.ДирективыКонтекстовИсполнения[ИмяДирективыПодпрограммы];
	Подпрограмма.Тип = "ФУНКЦИЯ";
	Подпрограмма.НомерСтроки = Слово.НомерСтроки;
	
	ПоместитьОператор(ТекстовыйПарсер, ТекстовыйПарсер.ГлобальнаяОбласть, Подпрограмма);

	опТелоПодпрограммы = НовыйОператор(ТекстовыйПарсер, Подпрограмма, Слово(ТипыСловИОператоров.ТелоЛогическогоБлока));
	
	Пока Истина Цикл
		
		Слово = ТекстовыйПарсер.ТекущееСлово;
		Если Слово.ТипСлова=Неопределено Тогда
			Прервать;
		КонецЕсли;
			
		Если Слово.ТипСлова=тИдентификатор Тогда
			
			Если СтопСлова[Слово.ВРСлово]=Истина Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ТекстовыйПарсер_РазобратьОператорПодпрограммы(ТекстовыйПарсер, Подпрограмма, опТелоПодпрограммы) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Подпрограмма.ДополнительныеДанные.Тело = опТелоПодпрограммы;
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_ПропуститьОператорПодпрограмма(ТекстовыйПарсер)

	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;

	Пока Истина Цикл
		
		Слово = ТекстовыйПарсер.ТекущееСлово;
		Если Слово.ТипСлова=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если Слово.ТипСлова=тИдентификатор Тогда
			
			ВРСлово = Слово.ВРСлово;
			Если ВРСлово="КОНЕЦФУНКЦИИ" ИЛИ ВРСлово="КОНЕЦПРОЦЕДУРЫ" Тогда
				СледующееСлово(ТекстовыйПарсер);
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
		СледующееСлово(ТекстовыйПарсер);
		
	КонецЦикла;
	
	Возврат Истина;
		
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорПодпрограмма(ТекстовыйПарсер, Класс, знач ОператорВладелец=Неопределено)

	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Слово.ТипСлова<>тИдентификатор Тогда
		Возврат Ложь;
	КонецЕсли;
	
	слТипПодпрограммы = Слово;
	ТипПодпрограммы = слТипПодпрограммы.ВРСлово;
	Если НЕ (ТипПодпрограммы="ПРОЦЕДУРА" ИЛИ ТипПодпрограммы="ФУНКЦИЯ") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОписаниеОшибки = ТекстовыйПарсер.ОписаниеОшибки;
	
	Если ОператорВладелец=Неопределено Тогда
		ОператорВладелец = Класс;
	КонецЕсли;
	
	ДирективаКомпиляции = ОператорВладелец.ДополнительныеДанные.ДирективаКомпиляции;
	
	слИмяПодпрограммы = СледующееСлово(ТекстовыйПарсер);
	ИмяПодпрограммы = слИмяПодпрограммы.Слово;
	СледующееСлово(ТекстовыйПарсер);
	
	КонтекстИсполнения = ТекстовыйПарсер.КонтекстИсполнения;
	КонтекстыИсполнения = ТекстовыйПарсер.КонтекстыИсполнения;
	ПараметрыДирективыКомпиляции = ПолучитьПараметрыДирективыКомпиляции(ДирективаКомпиляции);
	КонтекстИсполненияПодпрограммы = Неопределено;
	ВызовСервера = Ложь;
	Если ПараметрыДирективыКомпиляции[КонтекстИсполнения] Тогда
		// подпрограмма выполняется в текущем контексте
		КонтекстИсполненияПодпрограммы = КонтекстИсполнения;
	ИначеЕсли КонтекстИсполнения=КонтекстыИсполнения.Клиент Тогда
		// с клиента возможен вызов других контекстов исполнения
		Если ПараметрыДирективыКомпиляции.Сервер Тогда
			КонтекстИсполненияПодпрограммы = КонтекстыИсполнения.Сервер;
			ВызовСервера = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если КонтекстИсполненияПодпрограммы=Неопределено Тогда
		// Подпрограмма не предназначена для данного контекста исполнения
		Возврат ТекстовыйПарсер_ПропуститьОператорПодпрограмма(ТекстовыйПарсер);
	КонецЕсли;
		
	Подпрограмма = НоваяПодпрограмма(ТекстовыйПарсер, ИмяПодпрограммы, Класс);
	Подпрограмма.Тип = ТипПодпрограммы;
	Подпрограмма.НомерСтроки = слТипПодпрограммы.НомерСтроки;
	
	ПоместитьОператор(ТекстовыйПарсер, ОператорВладелец, Подпрограмма);

	опОписаниеПодпрограммы = НовыйОператор(ТекстовыйПарсер, Подпрограмма, Слово(ТипыСловИОператоров.ЗаголовокЛогическогоБлока));
	Подпрограмма.ДополнительныеДанные.Описание = опОписаниеПодпрограммы;

	НовыйОператор(ТекстовыйПарсер, опОписаниеПодпрограммы, слТипПодпрограммы);
	НовыйОператор(ТекстовыйПарсер, опОписаниеПодпрограммы, слИмяПодпрограммы);
	ТекстовыйПарсер_РазобратьПараметрыОписанияПодпрограммы(ТекстовыйПарсер, Подпрограмма, опОписаниеПодпрограммы, ОписаниеОшибки);
	Если ОписаниеОшибки.Ошибка Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстовыйПарсер_ПрочитатьМодификаторыПодпрограммы(ТекстовыйПарсер, Подпрограмма);

	Если КонтекстИсполненияПодпрограммы=КонтекстыИсполнения.Клиент Тогда
		ИмяДирективыПодпрограммы = "НАКЛИЕНТЕ";
	ИначеЕсли КонтекстИсполненияПодпрограммы=КонтекстыИсполнения.Сервер Тогда
		ИмяДирективыПодпрограммы = "НАСЕРВЕРЕ";
	КонецЕсли;
	
	Если НЕ ПараметрыДирективыКомпиляции.ИспользоватьДанныеКонтекста Тогда
		ИмяДирективыПодпрограммы = ИмяДирективыПодпрограммы + "БЕЗКОНТЕКСТА";
	КонецЕсли;
	
	Подпрограмма.Директива = ТекстовыйПарсер.ДирективыКонтекстовИсполнения[ИмяДирективыПодпрограммы];

	Подпрограмма.Объявление = Подпрограмма.Нативная ИЛИ КонтекстИсполненияПодпрограммы<>КонтекстИсполнения;
	
	Если Подпрограмма.Объявление Тогда
		
		// только заголовок подпрограммы
		Если Не ТекстовыйПарсер_ПропуститьОператорПодпрограмма(ТекстовыйПарсер) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		НовыйРазделительОператоров(ТекстовыйПарсер, ОператорВладелец);
		
	Иначе
		
		// полный код подпрограммы
		Подпрограмма.ДополнительныеДанные.ДирективаКомпиляции = ДирективаКомпиляции;
		опТелоПодпрограммы = НовыйОператор(ТекстовыйПарсер, Подпрограмма, Слово(ТипыСловИОператоров.ТелоЛогическогоБлока));
		опТелоПодпрограммы.НомерСтроки = Неопределено;
		
		Пока Истина Цикл
			
			Слово = ТекстовыйПарсер.ТекущееСлово;
			Если Слово.ТипСлова=тИдентификатор Тогда
				
				ВРСлово = Слово.ВРСлово;
				Если ВРСлово="КОНЕЦФУНКЦИИ" ИЛИ ВРСлово="КОНЕЦПРОЦЕДУРЫ" Тогда
					НовыйОператор(ТекстовыйПарсер, Подпрограмма, Слово);
					СледующееСлово(ТекстовыйПарсер);
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ТекстовыйПарсер_РазобратьОператорПодпрограммы(ТекстовыйПарсер, Подпрограмма, опТелоПодпрограммы) Тогда
				Возврат Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		Подпрограмма.ДополнительныеДанные.Тело = опТелоПодпрограммы;
		
	КонецЕсли;

	Возврат Истина;
			
КонецФункции

Функция ТекстовыйПарсер_ПрочитатьМодификаторыПодпрограммы(ТекстовыйПарсер, Подпрограмма)

	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	
	опОписаниеПодпрограммы = Подпрограмма.ДополнительныеДанные.Описание;

	Слово = ТекстовыйПарсер.ТекущееСлово;
	Пока Истина Цикл
		
		Если Слово.ТипСлова=тИдентификатор Тогда
			Если Слово.ВРСлово="ЭКСПОРТ" ИЛИ Слово.ВРСлово="НАТИВНАЯ" ИЛИ Слово.ВРСлово="НЕПОСРЕДСТВЕННЫЙДОСТУПКПОЛЯМОБЪЕКТА" Тогда
				НовыйОператор(ТекстовыйПарсер, опОписаниеПодпрограммы, Слово);
				Подпрограмма[Слово.ВРСлово] = Истина;
				Слово = СледующееСлово(ТекстовыйПарсер);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;

КонецФункции

Функция ТекстовыйПарсер_РазобратьПараметрыОписанияПодпрограммы(ТекстовыйПарсер, Подпрограмма, ОператорВладелец, ОписаниеОшибки)
	
	Перем РК;
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;

	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не (Слово.ТипСлова = ТипыСловИОператоров.Спецсимвол И Слово.Слово = "(") Тогда
		ОписаниеОшибки.Ошибка = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	опСкобки = НовыйОператор(ТекстовыйПарсер, ОператорВладелец, Слово(ТипыСловИОператоров.Скобки));
	НовыйОператор(ТекстовыйПарсер, опСкобки, Слово);
	СледующееСлово(ТекстовыйПарсер);

	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	НайденаЗакрываюшаяСкобка = Ложь;
	Этап = 1;
	ПрочитатьЗначениеПоУмолчанию = Ложь;
	ПараметрПоЗначению = Ложь;
	ТаблицаПараметров = Подпрограмма.ТаблицаПараметров;
	СтрокаПараметра = Неопределено;

	Пока Истина Цикл
		
		Слово = ТекстовыйПарсер.ТекущееСлово;
		Если Слово.ТипСлова=Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если ПрочитатьЗначениеПоУмолчанию Тогда
			
			ПрочитатьЗначениеПоУмолчанию = Ложь;
			ЗначениеПоУмолчанию = НовыйОператор(ТекстовыйПарсер, опСкобки);
			Если ТекстовыйПарсер_РазобратьОператорПодпрограммы(ТекстовыйПарсер, опСкобки, ЗначениеПоУмолчанию) Тогда
				ТекстовыйПарсер_СформироватьКодОператора(ТекстовыйПарсер, ЗначениеПоУмолчанию);
				СтрокаПараметра.ЗначениеПоУмолчанию = ЗначениеПоУмолчанию;
				Продолжить;
			КонецЕсли;
			
		ИначеЕсли Слово.ТипСлова = ТипыСловИОператоров.Идентификатор Тогда
			
			Если Этап = 1 И НРЕГ(Слово.Слово) = "знач" Тогда
				ПараметрПоЗначению = Истина;
			ИначеЕсли Этап = 3 Тогда
				ОписаниеОшибки.Ошибка = Истина;
				Прервать;
			Иначе
				СтрокаПараметра = РК.ДобавитьЭлементКоллекции(ТаблицаПараметров);
				СтрокаПараметра.Имя = Слово.Слово;
				СтрокаПараметра.ВРИмя = Слово.ВРСлово;
				СтрокаПараметра.ПоЗначению = ПараметрПоЗначению;
			КонецЕсли;

			НовыйОператор(ТекстовыйПарсер, опСкобки, Слово);
			
			Этап = Этап + 1;
			
		ИначеЕсли Слово.ТипСлова = ТипыСловИОператоров.Спецсимвол Тогда
			
			Если Слово.Слово = "," Тогда
				Этап = 1;
				ПараметрПоЗначению = Ложь;
			ИначеЕсли Слово.Слово = "=" Тогда
				ПрочитатьЗначениеПоУмолчанию = Истина;
			ИначеЕсли Слово.Слово = ")" Тогда
				НайденаЗакрываюшаяСкобка = Истина;
				СледующееСлово(ТекстовыйПарсер);
			Иначе
				ОписаниеОшибки.Ошибка = Истина;
				Прервать;
			КонецЕсли;
			
			НовыйОператор(ТекстовыйПарсер, опСкобки, Слово);
			Если НайденаЗакрываюшаяСкобка Тогда
				Прервать;
			КонецЕсли;
			
		Иначе
			
			ОписаниеОшибки.Ошибка = Истина;
			Прервать;
			
		КонецЕсли;
		
		СледующееСлово(ТекстовыйПарсер);
		
	КонецЦикла;
	
	Если Не НайденаЗакрываюшаяСкобка Тогда
		ОписаниеОшибки.Ошибка = Истина;
	КонецЕсли;
	
	Если ОписаниеОшибки.Ошибка Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТаблицаПараметров;
	
КонецФункции

//
// { Разбор операторов подпрограмм

Функция НовыйОператорПрисвоениеЗначение(знач ЛевоеЗначение, знач ПравоеЗначение, ТекстовыйПарсер, Родитель=Неопределено, Индекс=Неопределено)
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	ПрисвоениеЗначения = НовыйОператор(ТекстовыйПарсер, Родитель, , Индекс);
	ПрисвоениеЗначения.ТипОператора = ТипыСловИОператоров.ПрисвоениеЗначения;
	Если ЛевоеЗначение.Свойство("Слово") Тогда
		НовыйОператор(ТекстовыйПарсер, ПрисвоениеЗначения, ЛевоеЗначение);
	Иначе
		ПоместитьОператор(ТекстовыйПарсер, ПрисвоениеЗначения, ЛевоеЗначение);
	КонецЕсли;
	
	НовыйОператор(ТекстовыйПарсер, ПрисвоениеЗначения, Слово(ТипыСловИОператоров.ОперацияВыражения, "="));

	Если ПравоеЗначение<>Неопределено Тогда
		Если ПравоеЗначение.Свойство("Слово") Тогда
			ПравоеЗначение = НовыйОператор(ТекстовыйПарсер, ПрисвоениеЗначения, ПравоеЗначение);
		Иначе
			ПоместитьОператор(ТекстовыйПарсер, ПрисвоениеЗначения, ПравоеЗначение);
		КонецЕсли;
		ПравоеЗначение.ЛевоеЗначение = Ложь;
	КонецЕсли;
	
	Возврат ПрисвоениеЗначения;
	
КонецФункции

Функция НовыйОператорВыражение(ТекстовыйПарсер, Родитель=Неопределено, Индекс=Неопределено)

	опВыражение = НовыйОператор(ТекстовыйПарсер, Родитель, , Индекс);
	опВыражение.ТипОператора = ТекстовыйПарсер.ТипыСловИОператоров.Выражение;
	
	Возврат опВыражение;

КонецФункции

Функция НовыйРазделительОператоров(ТекстовыйПарсер, Родитель, Индекс=Неопределено)
	
	Оператор = НовыйОператор(ТекстовыйПарсер, Родитель, , Индекс);
	Оператор.ТипОператора = ТекстовыйПарсер.ТипыСловИОператоров.Спецсимвол;
	Оператор.Код = ";";
	
	Возврат Оператор;
	
КонецФункции

Функция НовыйОператорЛевоеЗначение(ТекстовыйПарсер, Родитель, Индекс=Неопределено)
	
	ПравоеЗначение = НовыйОператор(ТекстовыйПарсер, Родитель, , Индекс);
	ПравоеЗначение.ТипОператора = ТекстовыйПарсер.ТипыСловИОператоров.ЛевоеЗначение;
	ПравоеЗначение.ЛевоеЗначение = Истина;
	
	Возврат ПравоеЗначение;
	
КонецФункции

Функция НовыйОператорПравоеЗначение(ТекстовыйПарсер, Родитель, Индекс=Неопределено)
	
	ПравоеЗначение = НовыйОператор(ТекстовыйПарсер, Родитель, , Индекс);
	ПравоеЗначение.ТипОператора = ТекстовыйПарсер.ТипыСловИОператоров.ПравоеЗначение;
	ПравоеЗначение.ЛевоеЗначение = Ложь;
	
	Возврат ПравоеЗначение;
	
КонецФункции

Функция НовыйУсловныйОператор(ТекстовыйПарсер, Родитель=Неопределено, Индекс=Неопределено)
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	
	опУсловныйОператор = НовыйОператор(ТекстовыйПарсер, Родитель, , Индекс);
	опУсловныйОператор.ТипОператора = ТипыСловИОператоров.ЛогическийБлок;
	НовыйОператор(ТекстовыйПарсер, опУсловныйОператор, Слово(тИдентификатор, "Если"));
	опЗаголовок = НовыйОператор(ТекстовыйПарсер, опУсловныйОператор, Слово(ТипыСловИОператоров.ЗаголовокЛогическогоБлока));
	опЗаголовок.ЛевоеЗначение = Ложь;
	НовыйОператор(ТекстовыйПарсер, опУсловныйОператор, Слово(тИдентификатор, "Тогда"));
	опТело = НовыйОператор(ТекстовыйПарсер, опУсловныйОператор, Слово(ТипыСловИОператоров.ТелоЛогическогоБлока));
	НовыйОператор(ТекстовыйПарсер, опУсловныйОператор, Слово(тИдентификатор, "КонецЕсли"));
	
	опУсловныйОператор.ДополнительныеДанные.Вставить("Заголовок", опЗаголовок);
	опУсловныйОператор.ДополнительныеДанные.Вставить("Тело", опТело);
	
	Возврат опУсловныйОператор;
	
КонецФункции

Функция НовыйЛинейныйУсловныйОператор(Выражение, ВеткаИстина, ВеткаЛожь, ТекстовыйПарсер, Родитель, Индекс=Неопределено)
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	ТипЛинейноеУсловие = ТипыСловИОператоров.ЛинейныйУсловныйОператор;
	ТипСкобки = ТипыСловИОператоров.Скобки;
	ТипСпецсимвол = ТипыСловИОператоров.Спецсимвол;

	УсловныйОператор = НовыйОператор(ТекстовыйПарсер, Родитель, , Индекс);
	УсловныйОператор.ТипОператора = ТипЛинейноеУсловие;
	НовыйОператор(ТекстовыйПарсер, УсловныйОператор, Слово(ТипСпецсимвол, "?"));
	Скобки = НовыйОператор(ТекстовыйПарсер, УсловныйОператор, Слово(ТипСкобки));
	НовыйОператор(ТекстовыйПарсер, Скобки, Слово(ТипСпецсимвол, "("));
	ПоместитьОператор(ТекстовыйПарсер, Скобки, Выражение);
	НовыйОператор(ТекстовыйПарсер, Скобки, Слово(ТипСпецсимвол, ","));
	ПоместитьОператор(ТекстовыйПарсер, Скобки, ВеткаИстина);
	НовыйОператор(ТекстовыйПарсер, Скобки, Слово(ТипСпецсимвол, ","));
	ПоместитьОператор(ТекстовыйПарсер, Скобки, ВеткаЛожь);
	НовыйОператор(ТекстовыйПарсер, Скобки, Слово(ТипСпецсимвол, ")"));
	
	Возврат УсловныйОператор;
	
КонецФункции

Функция НовыйОператорВызовПодпрограммы(ИмяПодпрограммы, ТекстовыйПарсер, Родитель=Неопределено, Индекс=Неопределено)
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	опВызовПодпрограммы = НовыйОператор(ТекстовыйПарсер, Родитель, , Индекс);
	опВызовПодпрограммы.ТипОператора = ТипыСловИОператоров.ВызовПодпрограммы;
	ИдентификаторПодпрограммы = НовыйОператор(ТекстовыйПарсер, опВызовПодпрограммы, Слово(ТипыСловИОператоров.Идентификатор, ИмяПодпрограммы));
	
	опСкобки = НовыйОператорСкобки(ТекстовыйПарсер, опВызовПодпрограммы);
	опПараметрыВызоваПодпрограммы = НовыйОператор(ТекстовыйПарсер, опСкобки);
	опПараметрыВызоваПодпрограммы.ТипОператора = ТипыСловИОператоров.ПараметрыВызоваПодпрограммы;
	ЗакрытьОператорСкобки(опСкобки, ТекстовыйПарсер);
	
	опВызовПодпрограммы.ДополнительныеДанные.Вставить("ПараметрыВызоваПодпрограммы", опПараметрыВызоваПодпрограммы);
	
	Возврат опВызовПодпрограммы;
	
КонецФункции

Функция НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, ОператорРодитель, Индекс=Неопределено)

	ОператорПараметр = НовыйОператор(ТекстовыйПарсер, ОператорРодитель, , Индекс);
	ОператорПараметр.ТипОператора = ТекстовыйПарсер.ТипыСловИОператоров.ПараметрВызоваПодпрограммы;
	
	Возврат ОператорПараметр;
	
КонецФункции

Функция ДобавитьПараметрВызоваПодпрограммы(опВызовПодпрограммы, ТекстовыйПарсер, Индекс=Неопределено)
	
	ПараметрыВызоваПодпрограммы = опВызовПодпрограммы.ДополнительныеДанные.ПараметрыВызоваПодпрограммы;
	ПараметрВызоваПодпрограммы = НовыйОператор(ТекстовыйПарсер, ПараметрыВызоваПодпрограммы, , Индекс);
	ПараметрВызоваПодпрограммы.ТипОператора = ТекстовыйПарсер.ТипыСловИОператоров.ПараметрВызоваПодпрограммы;
	
	Возврат ПараметрВызоваПодпрограммы;
	
КонецФункции

Функция НовыйОператорСкобки(ТекстовыйПарсер, Родитель=Неопределено, Индекс=Неопределено)
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	опСкобки = НовыйОператор(ТекстовыйПарсер, Родитель, , Индекс);
	опСкобки.ТипОператора = ТипыСловИОператоров.Скобки;
	опСкобки.ЛевоеЗначение = Ложь;
	
	НовыйОператор(ТекстовыйПарсер, опСкобки, Слово(ТипыСловИОператоров.Спецсимвол, "("));
	
	Возврат опСкобки;
	
КонецФункции

Функция ЗакрытьОператорСкобки(опСкобки, ТекстовыйПарсер)

	НовыйОператор(ТекстовыйПарсер, опСкобки, Слово(ТекстовыйПарсер.ТипыСловИОператоров.Спецсимвол, ")"));
	
КонецФункции

Функция НовыйОператор(ТекстовыйПарсер, Родитель=Неопределено, Слово=Неопределено, знач Индекс=Неопределено)

	НовыйОператор = Новый Структура(ТекстовыйПарсер.ПоляОператоров);
	НовыйОператор.Операторы = Новый Массив;
	НовыйОператор.ЛевоеЗначение = Истина;
	НовыйОператор.ДополнительныеДанные = Новый Структура;
	
	Если Слово <> Неопределено Тогда
		НовыйОператор.ТипОператора = Слово.ТипСлова;
		НовыйОператор.Код = Слово.Слово;
		НовыйОператор.НомерСтроки = Слово.НомерСтроки;
	КонецЕсли;
	
	ПоместитьОператор(ТекстовыйПарсер, Родитель, НовыйОператор, Индекс);
	
	Возврат НовыйОператор;
	
КонецФункции

Функция ПоместитьОператор(ТекстовыйПарсер, знач Родитель=Неопределено, Оператор, знач Индекс=Неопределено)
	
	ПредыдущийРодитель = Оператор.Родитель;
	Если ПредыдущийРодитель<>Неопределено Тогда
		ПредыдущийИндекс = ПредыдущийРодитель.Операторы.Найти(Оператор);
		Если ПредыдущийИндекс<>Неопределено Тогда
			ПредыдущийРодитель.Операторы.Удалить(ПредыдущийИндекс);
		КонецЕсли;
	КонецЕсли;
	
	Если Индекс=Неопределено Тогда
		Если Родитель<>Неопределено Тогда
			Индекс = Родитель.Операторы.Количество();
			Родитель.Операторы.Добавить(Оператор);
		КонецЕсли;
	Иначе
		Если ТипЗнч(Индекс) <> Тип("Число") Тогда
			ОператорПозиции = Индекс;
			Родитель = ОператорПозиции.Родитель;
			Если Родитель<>Неопределено Тогда
				Индекс = Родитель.Операторы.Найти(ОператорПозиции);
			Иначе
				Индекс = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если Родитель<>Неопределено Тогда
			Если Индекс <> Неопределено Тогда
				Родитель.Операторы.Вставить(Индекс, Оператор);
			Иначе
				Индекс = Родитель.Операторы.Количество();
				Родитель.Операторы.Добавить(Оператор);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Оператор.Родитель = Родитель;
	Если Родитель<>Неопределено Тогда
		Если Оператор.ЛевоеЗначение Тогда
			Оператор.ЛевоеЗначение = Родитель.ЛевоеЗначение;
		КонецЕсли;
		Оператор.ПространствоИмен = Родитель.ПространствоИмен;
		
		Если Оператор.НомерСтроки=Неопределено Тогда
			Если ОператорПозиции=Неопределено Тогда
				Если Индекс>0 Тогда
					ОператорПозиции = Родитель.Операторы[Индекс-1];
					Оператор.НомерСтроки = ОператорПозиции.НомерСтроки;
				Иначе
					Оператор.НомерСтроки = Родитель.НомерСтроки;
				КонецЕсли;
			Иначе
				Оператор.НомерСтроки = ОператорПозиции.НомерСтроки;
			КонецЕсли;
		Иначе
			Если Родитель.НомерСтроки=Неопределено ИЛИ Родитель.Операторы.Количество()=1 Тогда
				Родитель.НомерСтроки = Оператор.НомерСтроки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция СкопироватьОператор(ТекстовыйПарсер, ОператорИсточник, знач Родитель=Неопределено)
	
	СкопированныеОператоры = ТекстовыйПарсер.ДополнительныеДанные.СкопированныеОператоры;
	СкопированныеОператоры.Очистить();

	Если Родитель=Неопределено Тогда
		Родитель = ОператорИсточник.Родитель;
	КонецЕсли;
	
	СкопированныеОператоры[ОператорИсточник.Родитель] = Родитель;
	
	ВсеОператоры = ПолучитьВсеОператоры(ОператорИсточник);
	Для Каждого Оператор Из ВсеОператоры Цикл
		КопияОператора = НовыйОператор(ТекстовыйПарсер, , , Оператор);
		ЗаполнитьЗначенияСвойств(КопияОператора, Оператор, "ТипОператора, Код, ЛевоеЗначение");

		ОператорРодитель = Оператор.Родитель;
		КопияОператораРодителя = СкопированныеОператоры[ОператорРодитель];
		Если КопияОператораРодителя<>ОператорРодитель Тогда
			ПоместитьОператор(ТекстовыйПарсер, КопияОператораРодителя, КопияОператора);
		КонецЕсли;
		
		СкопированныеОператоры[Оператор] = КопияОператора;
	КонецЦикла;
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	МассивПолейОператоровКопируемыхЗначений = ТекстовыйПарсер.МассивПолейОператоровКопируемыхЗначений;
	Для Каждого Оператор Из ВсеОператоры Цикл

		КопияОператора = СкопированныеОператоры[Оператор];
		Для Каждого Поле Из МассивПолейОператоровКопируемыхЗначений Цикл
			Значение = Оператор[Поле];
			КопияЗначения = СкопированныеОператоры[Значение];
			Если КопияЗначения<>Неопределено Тогда
				КопияОператора[Поле] = КопияЗначения;
			Иначе
				КопияОператора[Поле] = Значение;
			КонецЕсли;
			
		КонецЦикла;
		
		ДополнительныеДанные = КопияОператора.ДополнительныеДанные;
		Для Каждого ЭлементДанных Из Оператор.ДополнительныеДанные Цикл
			
			Значение = ЭлементДанных.Значение;
			Если ТипЗнч(Значение)=Тип("Массив") Тогда
				КопияЗначения = Новый Массив;
				Для ИндексЭлемента=0 По Значение.ВГраница() Цикл
					ЭлементЗначения = Значение[ИндексЭлемента];
					КопияЭлементаЗначения = СкопированныеОператоры[ЭлементЗначения];
					Если КопияЭлементаЗначения<>Неопределено Тогда
						КопияЗначения.Добавить(КопияЭлементаЗначения);
					Иначе
						КопияЗначения.Добавить(ЭлементЗначения);
					КонецЕсли;
				КонецЦикла;
				ДополнительныеДанные.Вставить(ЭлементДанных.Ключ, КопияЗначения);
			Иначе
				КопияЗначения = СкопированныеОператоры[Значение];
				Если КопияЗначения<>Неопределено Тогда
					ДополнительныеДанные.Вставить(ЭлементДанных.Ключ, КопияЗначения);
				Иначе
					ДополнительныеДанные.Вставить(ЭлементДанных.Ключ, Значение);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	КопияОператора = СкопированныеОператоры[ОператорИсточник];
	
	Возврат КопияОператора;
	
КонецФункции

Функция УдалитьОператор(Оператор)
	
	Операторы = Оператор.Родитель.Операторы;
	ИндексОператора = Операторы.Найти(Оператор);
	Операторы.Удалить(ИндексОператора);
	
КонецФункции

Функция ПолучитьВсеОператоры(ГлавныеОператоры, знач РеверсироватьГоризонтально=Ложь, знач РеверсироватьВертикально=Ложь)
	
	ТекущийУровеньОператоров = Новый Массив;
	Если ТипЗнч(ГлавныеОператоры)=Тип("Массив") Тогда
		Для Каждого Оператор Из ГлавныеОператоры Цикл
			ТекущийУровеньОператоров.Добавить(Оператор);
		КонецЦикла;
	Иначе
		ТекущийУровеньОператоров.Добавить(ГлавныеОператоры);
	КонецЕсли;
	
	ВсеОператоры = Новый Массив;
	Для Каждого Оператор Из ТекущийУровеньОператоров Цикл
		ВсеОператоры.Добавить(Оператор);
	КонецЦикла;
	Индекс = 1;
	
	Пока ТекущийУровеньОператоров.Количество() > 0 Цикл
		Если РеверсироватьВертикально Тогда
			Индекс = 0;
		КонецЕсли;
		
		СледующийУровеньОператоров = Новый Массив;
		Для Каждого Оператор Из ТекущийУровеньОператоров Цикл
			Для Каждого СубОператор Из Оператор.Операторы Цикл
				ВсеОператоры.Вставить(Индекс, СубОператор);
				СледующийУровеньОператоров.Добавить(СубОператор);
				Если Не РеверсироватьГоризонтально Тогда
					Индекс = Индекс + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ТекущийУровеньОператоров = СледующийУровеньОператоров;
		
	КонецЦикла;
	
	Возврат ВсеОператоры;
	
КонецФункции



Функция ТекстовыйПарсер_РазобратьОператорПодпрограммы(ТекстовыйПарсер, Подпрограмма, ОператорВладелец)

	Если ТекстовыйПарсер.ТекущееСлово.ТипСлова=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекстовыйПарсер_РазобратьОператорЛогическийБлок(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТекстовыйПарсер_РазобратьОператорВозвратИзПодпрограммы(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;

	Если ТекстовыйПарсер_РазобратьОператорПеременные(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;

	Если ТекстовыйПарсер_РазобратьОператорПрисвоениеЗначения(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;

	Если ТекстовыйПарсер_РазобратьОперандВыражения(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТекстовыйПарсер_РазобратьОператорВыражение(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;

	Если ТекстовыйПарсер_РазобратьОператорСпецсимвол(ТекстовыйПарсер, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорПеременные(ТекстовыйПарсер, Подпрограмма, ОператорВладелец)

	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не (Слово.ТипСлова=ТипыСловИОператоров.Идентификатор И Слово.ВРСлово="ПЕРЕМ") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КонтекстИсполнения = ТекстовыйПарсер.КонтекстИсполнения;
	ПараметрыДирективыКомпиляции = ПолучитьПараметрыДирективыКомпиляции(Подпрограмма.ДополнительныеДанные.ДирективаКомпиляции);
	Если ПараметрыДирективыКомпиляции[КонтекстИсполнения] Тогда
		// оператор предназначен для данного контекста исполнения
		ТаблицаПеременных = Подпрограмма.ТаблицаПеременных;
		
		ОператорЛокальныеПеременные = НовыйОператор(ТекстовыйПарсер, ОператорВладелец, Слово(ТипыСловИОператоров.ЛокальныеПеременные));
		НовыйОператор(ТекстовыйПарсер, ОператорЛокальныеПеременные, Слово);

		СледующееСлово(ТекстовыйПарсер);
		
		НомерИдентификатора = 0;
		Пока Истина Цикл
			
			Слово = ТекстовыйПарсер.ТекущееСлово;
			Если Слово.ТипСлова = ТипыСловИОператоров.Спецсимвол И Слово.Слово = ";" Тогда
				Прервать;
			КонецЕсли;
			
			НовыйОператор(ТекстовыйПарсер, ОператорЛокальныеПеременные, Слово);
			
			Если Слово.ТипСлова = ТипыСловИОператоров.Спецсимвол И Слово.Слово = "," Тогда
				
				НомерИдентификатора = 0;
				
			ИначеЕсли Слово.ТипСлова = ТипыСловИОператоров.Идентификатор Тогда
				
				НомерИдентификатора = НомерИдентификатора + 1;
				Если НомерИдентификатора = 1 Тогда
					ИмяПеременной = Слово.Слово;
					Переменная = РаботаСКоллекциями.ДобавитьЭлементКоллекции(ТаблицаПеременных);
					Переменная.Имя = ИмяПеременной;
					Переменная.Экспорт = Ложь;
					Переменная.Нативный = Ложь;
				ИначеЕсли Слово.ВРСлово = "ЭКСПОРТ" ИЛИ Слово.ВРСлово = "НАТИВНЫЙ" Тогда
					Переменная[Слово.ВРСлово] = Истина;
				Иначе
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
			СледующееСлово(ТекстовыйПарсер);
			
		КонецЦикла;
		
	Иначе
		
		// оператор не предназначен для данного контекста исполнения
		Пока Истина Цикл
			
			Слово = СледующееСлово(ТекстовыйПарсер);
			Если Слово.ТипСлова=Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Если Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол И Слово.Слово = ";" Тогда
				СледующееСлово(ТекстовыйПарсер);
				Прервать;
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорЛогическийБлок(ТекстовыйПарсер, Подпрограмма, ОператорВладелец)

	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Слово.ТипСлова<>ТипыСловИОператоров.Идентификатор Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачалаЛогическихБлоков = ТекстовыйПарсер.ЛогическиеБлоки.НачалаЛогическихБлоков;
	ЛогическийБлок = НачалаЛогическихБлоков[Слово.ВРСлово];
	Если ЛогическийБлок = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Слово.ВРСлово="ОБЛАСТЬ" Тогда
		// используются только для операторов препроцессора
		Возврат Ложь;
	КонецЕсли;
	
	ЛогическийБлокЦиклДля = НачалаЛогическихБлоков["ДЛЯ"];
	
	тЛогическийБлок = ТипыСловИОператоров.ЛогическийБлок;
	
	ЭтоЦикл = ЛогическийБлок.Начало="ДЛЯ" ИЛИ ЛогическийБлок.Начало="ПОКА";
	
	КлючевыеСловаБлоков = ТекстовыйПарсер.ЛогическиеБлоки.КлючевыеСлова;
	Слово.Слово = КлючевыеСловаБлоков[Слово.ВРСлово];
	
	ОператорЛогическийБлок = НовыйОператор(ТекстовыйПарсер, ОператорВладелец);
	ОператорЛогическийБлок.Вставить("Тип", ЛогическийБлок);
	ОператорЛогическийБлок.ДополнительныеДанные.Вставить("Цепь", Ложь);
	ОператорЛогическийБлок.ДополнительныеДанные.Вставить("ЭтоЦикл", ЭтоЦикл);
	ОператорЛогическийБлок.ТипОператора = тЛогическийБлок;
	НовыйОператор(ТекстовыйПарсер, ОператорЛогическийБлок, Слово);
	СледующееСлово(ТекстовыйПарсер);

	Если ЛогическийБлок.ЕстьЗаголовок Тогда
		ПустаяСтрока = "";
		ОператорЗаголовок = НовыйОператор(ТекстовыйПарсер, ОператорЛогическийБлок);
		ОператорЗаголовок.ТипОператора = ТипыСловИОператоров.ЗаголовокЛогическогоБлока;
		Пока Истина Цикл
			Слово = ТекстовыйПарсер.ТекущееСлово;
			Если Слово.ТипСлова=ТипыСловИОператоров.Идентификатор Тогда
				Если Слово.ВРСлово=ЛогическийБлок.КонецЗаголовка Тогда
					Слово.Слово = КлючевыеСловаБлоков[Слово.ВРСлово];
					НовыйОператор(ТекстовыйПарсер, ОператорЛогическийБлок, Слово);
					СледующееСлово(ТекстовыйПарсер);
					Прервать;
				КонецЕсли;
				
				Если ОператорЗаголовок.ЛевоеЗначение Тогда
					Если ЛогическийБлок=ЛогическийБлокЦиклДля Тогда
						Если Слово.ВРСлово="КАЖДОГО" ИЛИ Слово.ВРСлово="ПО" Тогда
							ОператорЗаголовок.ЛевоеЗначение = Ложь;
						КонецЕсли;
					Иначе
						ОператорЗаголовок.ЛевоеЗначение = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если Не ТекстовыйПарсер_РазобратьОператорПодпрограммы(ТекстовыйПарсер, Подпрограмма, ОператорЗаголовок) Тогда
				Прервать;
			КонецЕсли;
			
			Если ЛогическийБлок.КонецЗаголовка=ПустаяСтрока Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		 
		ОператорЗаголовок.ЛевоеЗначение = Ложь;
	КонецЕсли;
	
	ТелоБлока = НовыйОператор(ТекстовыйПарсер, ОператорЛогическийБлок);
	ТелоБлока.ТипОператора = ТипыСловИОператоров.ТелоЛогическогоБлока;
	Пока Истина Цикл
		
		Слово = ТекстовыйПарсер.ТекущееСлово;
		Если Слово.ТипСлова=ТипыСловИОператоров.Идентификатор Тогда

			Если ЛогическийБлок.Концы[Слово.ВРСлово]=Истина Тогда
				Слово.Слово = КлючевыеСловаБлоков[Слово.ВРСлово];
				СледующийЛогическийБлок = НачалаЛогическихБлоков[Слово.ВРСлово];
				Если СледующийЛогическийБлок<>Неопределено Тогда
					// паравозиком идут следующие блоки
					ОператорЛогическийБлок.ДополнительныеДанные.Цепь = Истина;
				Иначе
					// этот блок последний в цепи, добавляем закрывающее ключевое слово
					НовыйОператор(ТекстовыйПарсер, ОператорЛогическийБлок, Слово);
					СледующееСлово(ТекстовыйПарсер);
				КонецЕсли;
		
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
		Пока Истина Цикл
			Если Не ТекстовыйПарсер_РазобратьОператорПодпрограммы(ТекстовыйПарсер, Подпрограмма, ТелоБлока) Тогда
				СледующееСлово(ТекстовыйПарсер);
				Прервать;
			КонецЕсли;
			
			Оператор = ТелоБлока.Операторы[ТелоБлока.Операторы.ВГраница()];
			Если Оператор.ТипОператора=тЛогическийБлок И Оператор.ДополнительныеДанные.Цепь Тогда
				// прочитан блок, соединенный с другими блоками, продолжим чтение цепочки блоков
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ОператорЛогическийБлок.ДополнительныеДанные.Вставить("Заголовок", ОператорЗаголовок);
	ОператорЛогическийБлок.ДополнительныеДанные.Вставить("Тело", ТелоБлока);
	
	Если ЭтоЦикл Тогда
		Подпрограмма.ДополнительныеДанные.ОператорыЦиклов.Добавить(ОператорЛогическийБлок);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорИдентификатор(ТекстовыйПарсер, Подпрограмма, ОператорВладелец)

	Перем РаботаСКоллекциями;
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не Слово.ТипСлова=ТипыСловИОператоров.Идентификатор Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ТекстовыйПарсер.ЗарезервированныеИдентификаторы[Слово.ВРСлово]<>Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	тВызовПодпрограммы = ТипыСловИОператоров.ВызовПодпрограммы;
	тСкобки = ТипыСловИОператоров.Скобки;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	
	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	ОператорГруппа = Неопределено;
	ПространствоИмен = ОператорВладелец.ПространствоИмен;
	
	ПрочитатьИдентификатор = Истина;
	ТипОператора = тИдентификатор;
	Пока Истина Цикл

		Слово = ТекстовыйПарсер.ТекущееСлово;
		
		Если ПрочитатьИдентификатор Тогда
			
			Если Слово.ТипСлова=тИдентификатор Тогда
				ПрочитатьИдентификатор = Ложь;
				Если ОператорГруппа=Неопределено Тогда
					ОператорГруппа = НовыйОператор(ТекстовыйПарсер, ОператорВладелец, Слово);
				Иначе
					Оператор = НовыйОператор(ТекстовыйПарсер, ОператорГруппа, Слово);
					Оператор.ПространствоИмен = ПространствоИмен;
				КонецЕсли;
			Иначе
				Прервать;
			КонецЕсли;
			
		Иначе
			
			Если Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол И Слово.Слово="." Тогда
				
				ПрочитатьИдентификатор = Истина;
				ТипОператора = ТипыСловИОператоров.Поле;
				Оператор = ОператорГруппа;
				ОператорГруппа = НовыйОператор(ТекстовыйПарсер, ОператорВладелец);
				ОператорГруппа.ТипОператора = ТипОператора;
				ПоместитьОператор(ТекстовыйПарсер, ОператорГруппа, Оператор);
				Оператор.ЛевоеЗначение = Ложь;
				НовыйОператор(ТекстовыйПарсер, ОператорГруппа, Слово);
				ПространствоИмен = Оператор;
			
			ИначеЕсли Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол И Слово.Слово="[" Тогда
				
				ТипОператора = ТипыСловИОператоров.Поле;
				Пока Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол И Слово.Слово="[" Цикл
					Оператор = ОператорГруппа;
					
					ОператорГруппа = НовыйОператор(ТекстовыйПарсер, ОператорВладелец);
					ОператорГруппа.ТипОператора = ТипОператора;
					Если Оператор<>Неопределено Тогда
						ПоместитьОператор(ТекстовыйПарсер, ОператорГруппа, Оператор);
						Оператор.ЛевоеЗначение = Ложь;
					КонецЕсли;
					ПространствоИмен = Оператор;
					ТекстовыйПарсер_РазобратьОператорСкобки(ТекстовыйПарсер, Подпрограмма, ОператорГруппа);
					Слово = ТекстовыйПарсер.ТекущееСлово;
				КонецЦикла;
				Продолжить;
				
			ИначеЕсли Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол И Слово.Слово="(" Тогда

				Если ТипОператора = ТипыСловИОператоров.Поле Тогда
					ТипОператора = ТипыСловИОператоров.ВызовМетода;
				ИначеЕсли ТипОператора = тИдентификатор Тогда
					ТипОператора = тВызовПодпрограммы;
				КонецЕсли;
				
				Если ТипОператора = ТипыСловИОператоров.ВызовМетода Тогда
					ОператорОбъект = ОператорГруппа.Операторы[0];
					ОператорВызываемаяПодпрограмма = ОператорГруппа.Операторы[2];
				Иначе
					ОператорОбъект = Неопределено;
					ОператорВызываемаяПодпрограмма = ОператорГруппа;

					ОператорГруппа = НовыйОператор(ТекстовыйПарсер, ОператорВладелец);
					ПоместитьОператор(ТекстовыйПарсер, ОператорГруппа, ОператорВызываемаяПодпрограмма);
				КонецЕсли;
				
				ОператорГруппа.ТипОператора = ТипОператора;
				ОператорГруппа.ДополнительныеДанные.Вставить("Объект", ОператорОбъект);
				ОператорГруппа.ДополнительныеДанные.Вставить("ИмяКласса");
				ОператорГруппа.ДополнительныеДанные.Вставить("МетодОпределен", Ложь);
				ОператорГруппа.ДополнительныеДанные.Вставить("ИспользоватьНативныеМетоды", Ложь);
				ОператорГруппа.ДополнительныеДанные.Вставить("ВызываемаяПодпрограмма", ОператорВызываемаяПодпрограмма);
				
				ТекстовыйПарсер_РазобратьОператорСкобки(ТекстовыйПарсер, Подпрограмма, ОператорГруппа);
				ОператорГруппа.ДополнительныеДанные.Вставить("ОператорСкобки", ОператорГруппа.Операторы[ОператорГруппа.Операторы.ВГраница()]);
				
				ТекстовыйПарсер_РазобратьПараметрыВызоваПодпрограммы(ТекстовыйПарсер, Подпрограмма, ОператорГруппа);
				Продолжить;
				
			Иначе
				
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СледующееСлово(ТекстовыйПарсер);
		
	КонецЦикла;
	
	Если ОператорГруппа=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипОператора=тВызовПодпрограммы И ОператорГруппа.ТипОператора<>ТипОператора Тогда
		
		// Оператор вызова подпрограммы не завершен
		// не указаны параметры вызова, добавим пустые
		опВызываемаяПодпрограмма = ОператорГруппа;
		опВызовПодпрограммы = НовыйОператор(ТекстовыйПарсер, ОператорВладелец);
		опВызовПодпрограммы.ТипОператора = ТипОператора;
		ПоместитьОператор(ТекстовыйПарсер, опВызовПодпрограммы, опВызываемаяПодпрограмма);

		опВызовПодпрограммы.ДополнительныеДанные.Вставить("Объект");
		опВызовПодпрограммы.ДополнительныеДанные.Вставить("ИмяКласса");
		опВызовПодпрограммы.ДополнительныеДанные.Вставить("МетодОпределен", Ложь);
		опВызовПодпрограммы.ДополнительныеДанные.Вставить("ИспользоватьНативныеМетоды", Ложь);
		опВызовПодпрограммы.ДополнительныеДанные.Вставить("ВызываемаяПодпрограмма", опВызываемаяПодпрограмма);

		опСкобки = НовыйОператорСкобки(ТекстовыйПарсер, опВызовПодпрограммы);
		ЗакрытьОператорСкобки(опСкобки, ТекстовыйПарсер);
		опВызовПодпрограммы.ДополнительныеДанные.Вставить("ОператорСкобки", опСкобки);
		
		ТекстовыйПарсер_РазобратьПараметрыВызоваПодпрограммы(ТекстовыйПарсер, Подпрограмма, опВызовПодпрограммы);
		
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорПрисвоениеЗначения(ТекстовыйПарсер, Подпрограмма, знач ОператорВладелец)
	
	Если Не ОператорВладелец.ЛевоеЗначение Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КоличествоОператоров = ОператорВладелец.Операторы.Количество();
	Если КоличествоОператоров<1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не Слово.Слово="=" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	Если Не Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол Тогда
		Возврат Ложь;
	КонецЕсли;
	
	опЛевоеЗначение = ОператорВладелец.Операторы[КоличествоОператоров-1];
	Если Не (опЛевоеЗначение.ТипОператора=ТипыСловИОператоров.Идентификатор ИЛИ опЛевоеЗначение.ТипОператора=ТипыСловИОператоров.Поле) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	опПрисвоениеЗначения = НовыйОператор(ТекстовыйПарсер, , , опЛевоеЗначение);
	опПрисвоениеЗначения.ТипОператора = ТипыСловИОператоров.ПрисвоениеЗначения;
	ПоместитьОператор(ТекстовыйПарсер, опПрисвоениеЗначения, опЛевоеЗначение);
	НовыйОператор(ТекстовыйПарсер, опПрисвоениеЗначения, Слово); //"="
	СледующееСлово(ТекстовыйПарсер);
	ТекстовыйПарсер_РазобратьОператорВыражение(ТекстовыйПарсер, Подпрограмма, опПрисвоениеЗначения);
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорНовыйОбъект(ТекстовыйПарсер, Подпрограмма, ОператорВладелец)
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не (Слово.ТипСлова=тИдентификатор И Слово.ВРСлово="НОВЫЙ") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	опНовыйОбъект = НовыйОператор(ТекстовыйПарсер, ОператорВладелец);
	опНовыйОбъект.ТипОператора = ТипыСловИОператоров.НовыйОбъект;
	НовыйОператор(ТекстовыйПарсер, опНовыйОбъект, Слово);
	
	Слово = СледующееСлово(ТекстовыйПарсер);
	Если Слово.ТипСлова=тИдентификатор Тогда
		опТипОбъекта = НовыйОператор(ТекстовыйПарсер, опНовыйОбъект, Слово);
		Слово = СледующееСлово(ТекстовыйПарсер);
	КонецЕсли;
	
	Если ТекстовыйПарсер_РазобратьОператорСкобки(ТекстовыйПарсер, Подпрограмма, опНовыйОбъект) Тогда
		опСкобки = ТекстовыйПарсер.ТекущийОператор;
	Иначе
		опСкобки = НовыйОператорСкобки(ТекстовыйПарсер, опНовыйОбъект);
		ЗакрытьОператорСкобки(опСкобки, ТекстовыйПарсер);
	КонецЕсли;
	
	опНовыйОбъект.ДополнительныеДанные.Вставить("ОператорТипОбъекта", опТипОбъекта);
	опНовыйОбъект.ДополнительныеДанные.Вставить("ОператорСкобки", опСкобки);
	ТекстовыйПарсер_РазобратьПараметрыВызоваПодпрограммы(ТекстовыйПарсер, Подпрограмма, опНовыйОбъект);
	ТекстовыйПарсер.ТекущийОператор = опНовыйОбъект;
	
	Подпрограмма.ДополнительныеДанные.ОператорыСозданияНовыхОбъектов.Добавить(опНовыйОбъект);
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорВыражение(ТекстовыйПарсер, Подпрограмма, знач ОператорВладелец)
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тВыражение = ТипыСловИОператоров.Выражение;
	тОперацияВыражения = ТипыСловИОператоров.ОперацияВыражения;
	
	Если ТекстовыйПарсер_РазобратьОперандВыражения(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
	
		КоличествоОператоров = ОператорВладелец.Операторы.Количество();
		ПервыйОперанд = ОператорВладелец.Операторы[КоличествоОператоров-1];
		ОперацияВыражения = Неопределено;
		
	ИначеЕсли ТекстовыйПарсер_РазобратьОперациюВыражения(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		
		КоличествоОператоров = ОператорВладелец.Операторы.Количество();
		Если КоличествоОператоров > 1 Тогда
			// Первый операнд уже был прочитан вне выражения
			// поместим его внутрь выражения
			ПервыйОперанд = ОператорВладелец.Операторы[КоличествоОператоров-2];
		Иначе
			ПервыйОперанд = Неопределено;
		КонецЕсли;
		ОперацияВыражения = ОператорВладелец.Операторы[КоличествоОператоров-1];
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ОператорВыражение = НовыйОператор(ТекстовыйПарсер, ОператорВладелец);
	ОператорВыражение.ТипОператора = тВыражение;
	ОператорВыражение.ЛевоеЗначение = Ложь;
	Если ПервыйОперанд<>Неопределено Тогда
		ПоместитьОператор(ТекстовыйПарсер, ОператорВыражение, ПервыйОперанд);
		УнарнаяОперация = Ложь;
	Иначе
		// унарный оператор перед операндом так, как операнд еще не прочитан
		УнарнаяОперация = Истина;
	КонецЕсли;
	
	Если ОперацияВыражения<>Неопределено Тогда
		ПоместитьОператор(ТекстовыйПарсер, ОператорВыражение, ОперацияВыражения);
		РазобратьОперанд = Истина;
	Иначе
		РазобратьОперанд = Ложь;
	КонецЕсли;
	
	Пока Истина Цикл
		
		Если РазобратьОперанд Тогда
			Если ТекстовыйПарсер_РазобратьОперандВыражения(ТекстовыйПарсер, Подпрограмма, ОператорВыражение) Тогда
				Если УнарнаяОперация Тогда
					КоличествоОператоров = ОператорВыражение.Операторы.Количество();
					ОперацияВыражения = ОператорВыражение.Операторы[КоличествоОператоров-2];
					Операнд = ОператорВыражение.Операторы[КоличествоОператоров-1];
					
					// вложенное выражение с унарной операцией
					ОператорВложенноеВыражение = НовыйОператор(ТекстовыйПарсер, ОператорВыражение);
					ОператорВложенноеВыражение.ТипОператора = тВыражение;
					ПоместитьОператор(ТекстовыйПарсер, ОператорВложенноеВыражение, ОперацияВыражения);
					ПоместитьОператор(ТекстовыйПарсер, ОператорВложенноеВыражение, Операнд);
					УнарнаяОперация = Ложь;
				КонецЕсли;
			Иначе
				// может унарная операция?
				Если УнарнаяОперация Тогда
					//нет
					Прервать;
				КонецЕсли;
				УнарнаяОперация = Истина;
			КонецЕсли;
		Иначе
			Если Не ТекстовыйПарсер_РазобратьОперациюВыражения(ТекстовыйПарсер, Подпрограмма, ОператорВыражение) Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		РазобратьОперанд = Не РазобратьОперанд;
	КонецЦикла;
	
	ТекстовыйПарсер_СгруппироватьОперацииВыраженияПоПриоритетам(ТекстовыйПарсер, Подпрограмма, ОператорВыражение);
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_СгруппироватьОперацииВыраженияПоПриоритетам(ТекстовыйПарсер, Подпрограмма, ОператорВыражение)

	Перем РК;
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	ТипВыражение = ТипыСловИОператоров.Выражение;
	ТипОперацияВыражения = ТипыСловИОператоров.ОперацияВыражения;
	
	ПорядкиОпераций = Новый Массив;
	ОперацииПорядков = Новый Соответствие;
	Для Каждого ОператорВыражения Из ОператорВыражение.Операторы Цикл
		
		Если ОператорВыражения.ТипОператора<>ТипОперацияВыражения Тогда
			Продолжить;
		КонецЕсли;
		
		ОператорОперации = ОператорВыражения;
		
		ПорядокОпераций = ОператорОперации.Порядок;
		ОперацииПорядка = ОперацииПорядков[ПорядокОпераций];
		Если ОперацииПорядка=Неопределено Тогда
			ОперацииПорядка = Новый Массив;
			ОперацииПорядков[ПорядокОпераций] = ОперацииПорядка;
			
			ПорядкиОпераций.Добавить(ПорядокОпераций);
		КонецЕсли;
		ОперацииПорядка.Добавить(ОператорОперации);
		
	КонецЦикла;
	
	Если ПорядкиОпераций.Количество() < 2 Тогда
		// группировки не требуются
		Возврат Истина;
	КонецЕсли;
	
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	РК.СортироватьКоллекцию(ПорядкиОпераций);
	
	Для Каждого ПорядокОпераций Из ПорядкиОпераций Цикл
		
		ПредыдущийОператор = Неопределено;
		НачалоГруппы = Неопределено;
		КонецГруппы = Неопределено;
		ИскатьНачалоГруппы = Истина;
		ОбработатьКонецГруппы = Ложь;
		ИндексОператора = ОператорВыражение.Операторы.Количество();
		Пока ИндексОператора > 0 Цикл

			ИндексОператора = ИндексОператора - 1;
			ОператорВыражения = ОператорВыражение.Операторы[ИндексОператора];
				
			Если ОператорВыражения.ТипОператора=ТипОперацияВыражения Тогда
			
				Если ИскатьНачалоГруппы Тогда
					
					Если ОператорВыражения.Порядок=ПорядокОпераций Тогда
						НачалоГруппы = ПредыдущийОператор;
						ИскатьНачалоГруппы = Ложь;
					КонецЕсли;
					
				Иначе
					
					Если ОператорВыражения.Порядок<>ПорядокОпераций Тогда
						КонецГруппы = ПредыдущийОператор;
						ОбработатьКонецГруппы = Истина;
					КонецЕсли;
					
				КонецЕсли;
			
			КонецЕсли;
			
			Если Не ИскатьНачалоГруппы Тогда
				Если ИндексОператора=0 Тогда
					КонецГруппы = ОператорВыражения;
					ОбработатьКонецГруппы = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если ОбработатьКонецГруппы Тогда
				ИндексНачалаГруппы = ОператорВыражение.Операторы.Найти(НачалоГруппы);
				ИндексКонцаГруппы = ОператорВыражение.Операторы.Найти(КонецГруппы);
				Если ИндексНачалаГруппы > ИндексКонцаГруппы Тогда
					ВремПерем = ИндексНачалаГруппы;
					ИндексНачалаГруппы = ИндексКонцаГруппы;
					ИндексКонцаГруппы = ВремПерем;
				КонецЕсли;
				
				Если ИндексНачалаГруппы=0 И ИндексКонцаГруппы=ОператорВыражение.Операторы.Количество()-1 Тогда
					// Попали все операторы исходной группы
					// в таком случае нет смысла выделять внутреннюю группу
					Прервать;
				КонецЕсли;
				
				ОператорыГруппы = Новый Массив;
				Для ИндексОператораГруппы=ИндексНачалаГруппы По ИндексКонцаГруппы Цикл
					ОператорГруппы = ОператорВыражение.Операторы[ИндексОператораГруппы];
					ОператорыГруппы.Добавить(ОператорГруппы);
				КонецЦикла;

				ОператорГруппыВыражения = НовыйОператор(ТекстовыйПарсер, ОператорВыражение, , НачалоГруппы);
				ОператорГруппыВыражения.ТипОператора = ТипВыражение;
				Для Каждого ОператорГруппы Из ОператорыГруппы Цикл
					ПоместитьОператор(ТекстовыйПарсер, ОператорГруппыВыражения, ОператорГруппы);
				КонецЦикла;

				ИскатьНачалоГруппы = Истина;
				ОбработатьКонецГруппы = Ложь;
			КонецЕсли;
			
			ПредыдущийОператор = ОператорВыражения;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОперандВыражения(ТекстовыйПарсер, Подпрограмма, ОператорВладелец)

	Если ТекстовыйПарсер.ТекущееСлово.ТипСлова=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекстовыйПарсер_РазобратьОператорНовыйОбъект(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТекстовыйПарсер_РазобратьОператорИдентификатор(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;

	Если ТекстовыйПарсер_РазобратьОператорЧисло(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТекстовыйПарсер_РазобратьОператорСтрока(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТекстовыйПарсер_РазобратьОператорСкобки(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;

	Если ТекстовыйПарсер_РазобратьОператорЛинейныйУсловныйОператор(ТекстовыйПарсер, Подпрограмма, ОператорВладелец) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорЛинейныйУсловныйОператор(ТекстовыйПарсер, Подпрограмма, ОператорВладелец)

	Перем РК;
	
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если НЕ (Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол И Слово.Слово="?") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	опУсловныйОператор = НовыйОператор(ТекстовыйПарсер, ОператорВладелец);
	опУсловныйОператор.ЛевоеЗначение = Ложь;
	опУсловныйОператор.ТипОператора = ТипыСловИОператоров.ЛинейныйУсловныйОператор;
	НовыйОператор(ТекстовыйПарсер, опУсловныйОператор, Слово);

	СледующееСлово(ТекстовыйПарсер);
	Если НЕ ТекстовыйПарсер_РазобратьОператорСкобки(ТекстовыйПарсер, Подпрограмма, опУсловныйОператор) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
	
Функция ТекстовыйПарсер_РазобратьОперациюВыражения(ТекстовыйПарсер, Подпрограмма, ОператорВладелец)
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	ТипСпецсимвол = ТипыСловИОператоров.Спецсимвол;
	ТипИдентификатор = ТипыСловИОператоров.Идентификатор;
	Слово = ТекстовыйПарсер.ТекущееСлово;

	Если НЕ (Слово.ТипСлова=ТипСпецсимвол ИЛИ Слово.ТипСлова=ТипИдентификатор) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОперацииВыражений = ТекстовыйПарсер.ОперацииВыражений;
	ОперацияВыражения = ОперацииВыражений[ВРег(Слово.Слово)];
	Если ОперацияВыражения=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СледующееСлово(ТекстовыйПарсер);
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Слово.ТипСлова=ТипСпецсимвол Тогда
		ОперацияВыражения2 = ОперацииВыражений[ОперацияВыражения.Тип + Слово.Слово];
		Если ОперацияВыражения2<>Неопределено Тогда
			// из двух символов
			ОперацияВыражения = ОперацияВыражения2;
			СледующееСлово(ТекстовыйПарсер);
		КонецЕсли;
	КонецЕсли;
	
	ОператорВыражения = НовыйОператор(ТекстовыйПарсер, ОператорВладелец, Слово(ТипыСловИОператоров.ОперацияВыражения, ОперацияВыражения.Тип));
	ОператорВыражения.Вставить("Порядок", ОперацияВыражения.Порядок);
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорСкобки(ТекстовыйПарсер, Подпрограмма, ОператорВладелец)
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Слово.ТипСлова<>ТипыСловИОператоров.Спецсимвол Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОписаниеСкобок = ТекстовыйПарсер.ОписанияСкобок.ЛевыеСкобки[Слово.Слово];
	Если ОписаниеСкобок=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗакрывающаяСкобка = ОписаниеСкобок.Конец;
	
	опСкобки = НовыйОператор(ТекстовыйПарсер, ОператорВладелец);
	опСкобки.ТипОператора = ТипыСловИОператоров.Скобки;
	опСкобки.ЛевоеЗначение = Ложь; //внутри может быть выражение, но без присвоения значения
	опСкобки.ПространствоИмен = Неопределено; //операторы внутри скобок будут в глобальном пространстве...
	
	НовыйОператор(ТекстовыйПарсер, опСкобки, Слово);
	СледующееСлово(ТекстовыйПарсер);
	
	Пока Истина Цикл

		Слово = ТекстовыйПарсер.ТекущееСлово;
		Если Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол И Слово.Слово=ЗакрывающаяСкобка Тогда
			НовыйОператор(ТекстовыйПарсер, опСкобки, Слово);
			СледующееСлово(ТекстовыйПарсер);
			// ... а сами скобки в указанном пространстве
			опСкобки.ПространствоИмен = ОператорВладелец.ПространствоИмен;
			ТекстовыйПарсер.ТекущийОператор = опСкобки;
			Возврат Истина;
		КонецЕсли;
		
		Если Не ТекстовыйПарсер_РазобратьОператорПодпрограммы(ТекстовыйПарсер, Подпрограмма, опСкобки) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорЧисло(ТекстовыйПарсер, Подпрограмма, ОператорВладелец)
	
	НомерСловаПередРазбором = ТекстовыйПарсер.НомерТекущегоСлова;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	// проверим знак
	//Слово = ТекстовыйПарсер.ТекущееСлово;
	//Если Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол И (Слово.Слово="+" ИЛИ Слово.Слово="-") Тогда
	//	СловоЗнак = Слово;
	//	СледующееСлово(ТекстовыйПарсер);
	//КонецЕсли;
	
	// проверим целую часть
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не (Слово.ТипСлова=ТипыСловИОператоров.Число) Тогда
		Если НомерСловаПередРазбором < ТекстовыйПарсер.НомерТекущегоСлова Тогда
			УстановитьТекущееСлово(ТекстовыйПарсер, НомерСловаПередРазбором);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;

	ОператорГруппа = НовыйОператор(ТекстовыйПарсер, ОператорВладелец);
	ОператорГруппа.ТипОператора = Слово.ТипСлова;
	
	//Если СловоЗнак<>Неопределено Тогда
	//	НовыйОператор = НовыйОператор(ТекстовыйПарсер, ОператорГруппа, СловоЗнак);
	//КонецЕсли;
	НовыйОператор = НовыйОператор(ТекстовыйПарсер, ОператорГруппа, Слово);
	СледующееСлово(ТекстовыйПарсер);
	
	// проверим точку
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не (Слово.ТипСлова=ТипыСловИОператоров.Спецсимвол И Слово.Слово=".") Тогда
		Возврат Истина;
	КонецЕсли;
	
	НовыйОператор = НовыйОператор(ТекстовыйПарсер, ОператорГруппа, Слово);
	СледующееСлово(ТекстовыйПарсер);
	
	// проверим дробную часть
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не (Слово.ТипСлова=ТипыСловИОператоров.Число) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НовыйОператор = НовыйОператор(ТекстовыйПарсер, ОператорГруппа, Слово);
	СледующееСлово(ТекстовыйПарсер);
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорСтрока(ТекстовыйПарсер, Подпрограмма, ОператорВладелец)
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;

	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не (Слово.ТипСлова=ТипыСловИОператоров.Строка) Тогда
		Возврат Ложь;
	КонецЕсли;

	НовыйОператор(ТекстовыйПарсер, ОператорВладелец, Слово);
	СледующееСлово(ТекстовыйПарсер);
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорСпецсимвол(ТекстовыйПарсер, ОператорВладелец)
	
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не (Слово.ТипСлова=ТекстовыйПарсер.ТипыСловИОператоров.Спецсимвол) Тогда
		Возврат Ложь;
	КонецЕсли;

	НовыйОператор(ТекстовыйПарсер, ОператорВладелец, Слово);
	СледующееСлово(ТекстовыйПарсер);
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьОператорВозвратИзПодпрограммы(ТекстовыйПарсер, Подпрограмма, ОператорВладелец)

	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	Слово = ТекстовыйПарсер.ТекущееСлово;
	Если Не (Слово.ТипСлова=ТипыСловИОператоров.Идентификатор И Слово.Слово="Возврат") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОператорВозвратИзПодпрограммы = НовыйОператор(ТекстовыйПарсер, ОператорВладелец);
	ОператорВозвратИзПодпрограммы.ТипОператора = ТипыСловИОператоров.ВозвратИзПодпрограммы;
	
	НовыйОператор(ТекстовыйПарсер, ОператорВозвратИзПодпрограммы, Слово);
	СледующееСлово(ТекстовыйПарсер);
	
	ТекстовыйПарсер_РазобратьОператорВыражение(ТекстовыйПарсер, Подпрограмма, ОператорВозвратИзПодпрограммы);
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьПараметрыВызоваПодпрограммы(ТекстовыйПарсер, Подпрограмма, ОператорВызоваПодпрограммы)
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	ОператорСкобки = ОператорВызоваПодпрограммы.ДополнительныеДанные.ОператорСкобки;
	Если ОператорСкобки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Операторы = ОператорСкобки.Операторы;
	КоличествоОператоров = Операторы.Количество();
	Если КоличествоОператоров < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Оператор = Операторы[0];
	Если Не (Оператор.ТипОператора = ТипыСловИОператоров.Спецсимвол И Оператор.Код = "(") Тогда
		Возврат Ложь;
	КонецЕсли;
	ЛеваяСкобка = Оператор;
	
	Оператор = Операторы[КоличествоОператоров-1];
	Если Не (Оператор.ТипОператора = ТипыСловИОператоров.Спецсимвол И Оператор.Код = ")") Тогда
		Возврат Ложь;
	КонецЕсли;
	ПраваяСкобка = Оператор;
	
	КоличествоОператоров = КоличествоОператоров - 2;
	
	Операторы = РаботаСКоллекциями.СкопироватьОбъект(Операторы);
	ОператорСкобки.Операторы.Очистить();
	ОператорСкобки.Операторы.Добавить(ЛеваяСкобка);
	
	ПараметрыВызоваПодпрограммы = НовыйОператор(ТекстовыйПарсер, ОператорСкобки);
	ПараметрыВызоваПодпрограммы.ТипОператора = ТипыСловИОператоров.ПараметрыВызоваПодпрограммы;
	ОператорВызоваПодпрограммы.ДополнительныеДанные.Вставить("ПараметрыВызоваПодпрограммы", ПараметрыВызоваПодпрограммы);
	
	Если КоличествоОператоров > 0 Тогда
		
		ОператорПараметр = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, ПараметрыВызоваПодпрограммы);
		Для НомерОператора=1 По КоличествоОператоров Цикл

			Оператор = Операторы[НомерОператора];
			ЭтоРазделитель = Оператор.ТипОператора = ТипыСловИОператоров.Спецсимвол И Оператор.Код = ",";

			Если ЭтоРазделитель Тогда
				ОператорПараметр = НовыйОператорПараметрВызоваПодпрограммы(ТекстовыйПарсер, ПараметрыВызоваПодпрограммы);
			Иначе
				Оператор.Родитель = ОператорПараметр;
				ОператорПараметр.Операторы.Добавить(Оператор);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	ОператорСкобки.Операторы.Добавить(ПраваяСкобка);
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_ПолучитьОператорыПодпрограммы(ТекстовыйПарсер, Подпрограмма, ТипыОператоров)
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ТипыОператоровСоответствие = РаботаСКоллекциями.ПреобразоватьМассивВСоответствие(РаботаСКоллекциями.ЗначениеВМассив(ТипыОператоров, , Ложь));
	
	ОбходОператоров = Новый Массив;
	ОбходОператоров.Добавить(Подпрограмма);
	
	МассивОператоров = Новый Массив;
	Для Каждого Оператор Из ОбходОператоров Цикл
		Если ТипыОператоровСоответствие[Оператор.ТипОператора] = Истина Тогда
			МассивОператоров.Добавить(Оператор);
		КонецЕсли;
		
		СубОператоры = Оператор.Операторы;
		Если СубОператоры.Количество() > 0 Тогда
			Для Каждого СубОператор Из СубОператоры Цикл
				ОбходОператоров.Добавить(СубОператор);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивОператоров;
	
КонецФункции

Функция ТекстовыйПарсер_ПолучитьОператорыУправленияЦиклом(ТекстовыйПарсер, Подпрограмма, ОператорЦикла)
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	тЛогическийБлок = ТипыСловИОператоров.ЛогическийБлок;
	тИдентификатор =  ТипыСловИОператоров.Идентификатор;
	
	ОператорТелоЦикла = ОператорЦикла.ДополнительныеДанные.Тело;
	
	ОператорыУправления = Новый Структура;
	ОператорыУправления.Вставить("ОператорыПродолжить", Новый Массив);
	ОператорыУправления.Вставить("ОператорыПрервать", Новый Массив);
	
	ОбходОператоров = Новый Массив;
	РК.ДобавитьЭлементыКоллекции(ОбходОператоров, ОператорТелоЦикла.Операторы);
	Для Каждого Оператор Из ОбходОператоров Цикл
		
		Если Оператор.ТипОператора=тЛогическийБлок Тогда
			
			Если Оператор.ДополнительныеДанные.ЭтоЦикл Тогда
				// Не искать во вложенных циклах, так
				// как это будут операторы управления другим циклом
				Продолжить;
			КонецЕсли;
			
			РК.ДобавитьЭлементыКоллекции(ОбходОператоров, Оператор.ДополнительныеДанные.Тело.Операторы);
			
		ИначеЕсли Оператор.ТипОператора=тИдентификатор Тогда
			
			КодОператора = ВРЕГ(Оператор.Код);
			Если КодОператора="ПРОДОЛЖИТЬ" Тогда
				ОператорыУправления.ОператорыПродолжить.Добавить(Оператор);
			ИначеЕсли КодОператора="ПРЕРВАТЬ" Тогда
				ОператорыУправления.ОператорыПрервать.Добавить(Оператор);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОператорыУправления;
	
КонецФункции

Функция ТекстовыйПарсер_ЗаменитьИдентификаторыПодпрограммы(ТекстовыйПарсер, Подпрограмма, ЗаменаИдентификаторов, ВызовыПодпрограмм) Экспорт
	
	Перем РК;
	
	ПреобразованныеОператоры = Подпрограмма.ДополнительныеДанные.ПреобразованныеОператоры;
	ПреобразованныеОператоры.Очистить();

	ТелоПодпрограммы = Подпрограмма.ДополнительныеДанные.Тело;
	Если ТелоПодпрограммы=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РК = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	тВызовПодпрограммы = ТипыСловИОператоров.ВызовПодпрограммы;
	тВызовМетода = ТипыСловИОператоров.ВызовМетода;
	тПоле = ТипыСловИОператоров.Поле;
	тСпецсимвол = ТипыСловИОператоров.Спецсимвол;
	
	слТочка = Слово(тСпецсимвол, ".");
	
	ОбходОператоров = Новый Массив;
	ОбходОператоров.Добавить(ТелоПодпрограммы);
	
	Для Каждого ЗаменаИдентификатора Из ЗаменаИдентификаторов Цикл
		Идентификатор = ЗаменаИдентификатора.Значение;
		ИдентификаторМассив = РК.ЗначениеВМассив(Идентификатор, ".", Ложь);
		ЗаменаИдентификаторов[ЗаменаИдентификатора.Ключ] = ИдентификаторМассив;
	КонецЦикла;
	
	Для Каждого Оператор Из ОбходОператоров Цикл
		
		Если Оператор.Операторы.Количество()=0 Тогда
			
			Если Оператор.ТипОператора=тИдентификатор И Оператор.ПространствоИмен=Неопределено
				И ВызовыПодпрограмм=(Оператор.Родитель.ТипОператора=тВызовПодпрограммы) Тогда
				НовыйИдентификаторМассив = ЗаменаИдентификаторов[ВРЕГ(Оператор.Код)];
				
				Если НовыйИдентификаторМассив <> Неопределено Тогда
					
					ИндексПоследнегоИдентификатора = НовыйИдентификаторМассив.ВГраница();
					Оператор.Код = НовыйИдентификаторМассив[ИндексПоследнегоИдентификатора];
					
					Если ИндексПоследнегоИдентификатора>0 Тогда
						НомерИдентификатора = ИндексПоследнегоИдентификатора;
						ОператорПравый = Оператор;
						
						Если ОператорПравый.Родитель.ТипОператора=тВызовПодпрограммы Тогда
							НомерИдентификатора = НомерИдентификатора - 1;
							ОператорГруппа = ОператорПравый.Родитель;
							Если ОператорГруппа.ТипОператора=тВызовПодпрограммы Тогда
								ОператорГруппа.ТипОператора = тВызовМетода;
							КонецЕсли;
							слЛевое = Слово(тИдентификатор, НовыйИдентификаторМассив[НомерИдентификатора]);
							ОператорЛевый = НовыйОператор(ТекстовыйПарсер, ОператорГруппа, слЛевое, 0);
							НовыйОператор(ТекстовыйПарсер, ОператорГруппа, слТочка, 1);
							ОператорПравый.ПространствоИмен = ОператорЛевый;

							ОператорПравый = ОператорЛевый;
						КонецЕсли;
						
						Пока НомерИдентификатора>0 Цикл
							НомерИдентификатора = НомерИдентификатора - 1;
							слЛевое = Слово(тИдентификатор, НовыйИдентификаторМассив[НомерИдентификатора]);
							ОператорГруппа = НовыйОператор(ТекстовыйПарсер, , , ОператорПравый);
							ОператорГруппа.ТипОператора = тПоле;
							ОператорГруппа.ЛевоеЗначение = ОператорПравый.ЛевоеЗначение;
							ОператорЛевый = НовыйОператор(ТекстовыйПарсер, ОператорГруппа, слЛевое);
							НовыйОператор(ТекстовыйПарсер, ОператорГруппа, слТочка);
							ПоместитьОператор(ТекстовыйПарсер, ОператорГруппа, ОператорПравый);
							ОператорПравый.ПространствоИмен = ОператорЛевый;
							
							ОператорПравый = ОператорЛевый;
						КонецЦикла;
						
						ПреобразованныеОператоры.Добавить(Оператор.Родитель);
					Иначе
						ПреобразованныеОператоры.Добавить(Оператор);
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			Для Каждого СубОператор Из Оператор.Операторы Цикл
				
				ОбходОператоров.Добавить(СубОператор);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

//
// } Разбор операторов подпрограмм

//
// { Формирование кода операторов

Функция ТекстовыйПарсер_СформироватьКодМодуля(ТекстовыйПарсер) Экспорт
	
	ТекстовыйПарсер_СформироватьКодОператора(ТекстовыйПарсер, ТекстовыйПарсер.ГлобальнаяОбласть);
	ТекстМодуля = ТекстовыйПарсер.ГлобальнаяОбласть.Код;
	
	ТекстовыйПарсер.СформированныйТекст = ТекстМодуля;
	
	Возврат ТекстМодуля;
	
КонецФункции

Функция ТекстовыйПарсер_СформироватьКодОператора(ТекстовыйПарсер, ОператорГруппа)
	
	// Получить полный список операторов вместе с вложенными,
	// причем сначала идут вложенные, потом родительские операторы
	// так, как код родительских операторов формируется на основе вложенных
	Операторы = ПолучитьВсеОператоры(ОператорГруппа, Ложь, Истина);
	
	// формирование кода каждого оператора
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	Для Каждого Оператор Из Операторы Цикл
		
		Если Оператор.ТипОператора=ТипыСловИОператоров.Идентификатор ИЛИ Оператор.ТипОператора=ТипыСловИОператоров.Поле ИЛИ Оператор.ТипОператора=ТипыСловИОператоров.ВызовПодпрограммы ИЛИ Оператор.ТипОператора=ТипыСловИОператоров.ВызовМетода Тогда
			ТекстовыйПарсер_СформироватьКодОператораИдентификатор(ТекстовыйПарсер, Оператор);
		ИначеЕсли Оператор.ТипОператора=ТипыСловИОператоров.Число Тогда
			ТекстовыйПарсер_СформироватьКодОператораЧисло(ТекстовыйПарсер, Оператор);
		ИначеЕсли Оператор.ТипОператора=ТипыСловИОператоров.ЛогическийБлок ИЛИ Оператор.ТипОператора=ТипыСловИОператоров.ЛогическийБлокПрепроцессора ИЛИ Оператор.ТипОператора=ТипыСловИОператоров.Подпрограмма Тогда
			ТекстовыйПарсер_СформироватьКодОператораЛогическиБлок(ТекстовыйПарсер, Оператор);
		ИначеЕсли Оператор.ТипОператора=ТипыСловИОператоров.ПараметрыВызоваПодпрограммы Тогда
			ТекстовыйПарсер_СформироватьКодОператораПараметрыВызоваПодпрограммы(ТекстовыйПарсер, Оператор);
		Иначе
			ТекстовыйПарсер_СформироватьКодОператораОбщий(ТекстовыйПарсер, Оператор);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ТекстовыйПарсер_СформироватьКодОператораПараметрыВызоваПодпрограммы(ТекстовыйПарсер, ОператорГруппа)

	Операторы = ОператорГруппа.Операторы;
	
	Код = "";
	
	Если Операторы.Количество() > 0 Тогда
		Разделитель = ", ";
		Для Каждого Оператор Из Операторы Цикл
			Код = Код + Оператор.Код + Разделитель;
		КонецЦикла;
		Код = Лев(Код, СтрДлина(Код)-СтрДлина(Разделитель));
	КонецЕсли;
	
	ОператорГруппа.Код = Код;
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_СформироватьКодОператораИдентификатор(ТекстовыйПарсер, ОператорГруппа)

	Операторы = ОператорГруппа.Операторы;
	Если Операторы.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// код лепим сплошняком без пробелов и отступов
	Код = "";
	Для Каждого Оператор Из Операторы Цикл
		Код = Код + Оператор.Код;
	КонецЦикла;
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	
	ОператорГруппа.Код = Код;
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_СформироватьКодОператораЧисло(ТекстовыйПарсер, ОператорГруппа)

	Операторы = ОператорГруппа.Операторы;
	Если Операторы.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// код лепим сплошняком без пробелов и отступов
	Код = "";
	Для Каждого Оператор Из Операторы Цикл
		Код = Код + Оператор.Код;
	КонецЦикла;
	
	ОператорГруппа.Код = Код;
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_СформироватьКодОператораЛогическиБлок(ТекстовыйПарсер, ОператорГруппа)
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	Операторы = ОператорГруппа.Операторы;
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	ПереводСтроки = ТекстовыйПарсер.ПереводСтроки;
	Пробел = ТекстовыйПарсер.Пробел;
	
	ПоследнийОператор = Операторы.Количество()-1;
	
	Код = "";
	ПредыдущийОператор = Неопределено;
	Для НомерОператора=0 По ПоследнийОператор Цикл
		Оператор = Операторы[НомерОператора]; 
		Если Оператор.ТипОператора = ТипыСловИОператоров.ТелоЛогическогоБлока Тогда
			Код = Код + ПереводСтроки + РаботаСКоллекциями.ДобавитьОтступСтрок(Оператор.Код);
			НомерОператора = НомерОператора + 1;
			Прервать;
		Иначе
			Если ПредыдущийОператор <> Неопределено И ПредыдущийОператор.ТипОператора = ТипыСловИОператоров.Спецсимвол И ПредыдущийОператор.Код = "#" Тогда
				Код = Код + Оператор.Код;
			Иначе
				Код = Код + Пробел + Оператор.Код;
			КонецЕсли;
		КонецЕсли;
		ПредыдущийОператор = Оператор;
	КонецЦикла;
	Код = СокрЛ(Код);
	
	// должен остаться конец блока, его добавляем с новой строки
	Если НомерОператора <= ПоследнийОператор Тогда
		Код = Код + ПереводСтроки;
		Для НомерОператора=НомерОператора По ПоследнийОператор Цикл
			Оператор = Операторы[НомерОператора]; 
			Код = Код + Оператор.Код;
		КонецЦикла;
	КонецЕсли;
	
	ОператорГруппа.Код = Код;
	Возврат Истина;

КонецФункции

Функция ТекстовыйПарсер_СформироватьКодСтроки(ТекстовыйПарсер, Строка)
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	Кавычка = ТекстовыйПарсер.Кавычка;
	
	Строки = РаботаСКоллекциями.СтрокуВМассив(Строка, Символы.ПС, Ложь, Истина);
	
	СимволыПереносаСтроки = Символы.ПС + "|";
	НоваяСтрока = Строки[0];
	Для НомерСтроки=1 По Строки.ВГраница() Цикл
		НоваяСтрока = НоваяСтрока + СимволыПереносаСтроки + Строки[НомерСтроки];
	КонецЦикла;
	
	НоваяСтрока = СтрЗаменить(НоваяСтрока, Кавычка, Кавычка+Кавычка);
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция ТекстовыйПарсер_СформироватьКодОператораОбщий(ТекстовыйПарсер, ОператорГруппа)
	
	Перем РаботаСКоллекциями;
	
	Операторы = ОператорГруппа.Операторы;

	Если Операторы.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	ТипыСловИОператоров = ТекстовыйПарсер.ТипыСловИОператоров;
	тИдентификатор = ТипыСловИОператоров.Идентификатор;
	тЛогическийБлок = ТипыСловИОператоров.ЛогическийБлок;
	тПодпрограмма = ТипыСловИОператоров.Подпрограмма;
	
	ПереводСтроки = ТекстовыйПарсер.ПереводСтроки;
	Пробел = ТекстовыйПарсер.Пробел;
	Кавычка = ТекстовыйПарсер.Кавычка;
	ОписанияСкобок = ТекстовыйПарсер.ОписанияСкобок;
	ОператорыСравнения = ТекстовыйПарсер.ОператорыСравнения;
	
	Код = "";
	КодСтроки = "";
	ЭтоОткрывающаяСкобка = Ложь;
	ЭтоЗакрывающаяСкобка = Ложь;
	ЭтоСпецСимвол = Ложь;
	ЭтоОператорСравнения = Ложь;
	ПредыдущийТипОператора = Неопределено;
	
	Для Каждого Оператор Из Операторы Цикл
		
		КодОператора = Оператор.Код;
		ТипОператора = Оператор.ТипОператора;
		
		ПредыдущийОператорЭтоСпецсимвол = ЭтоСпецСимвол;
		ПредыдущийОператорЭтоОператорСравнения = ЭтоОператорСравнения;
		ЭтоСпецСимвол = ТипОператора=ТипыСловИОператоров.СпецСимвол;
		ЭтоОператорСравнения = ЭтоСпецСимвол И ОператорыСравнения[КодОператора]=Истина;
		
		ПредыдущийОператорЭтоОткрывающаяСкобка = ЭтоОткрывающаяСкобка;
		ПредыдущийОператорЭтоЗакрывающаяСкобка = ЭтоЗакрывающаяСкобка;
		ЭтоОткрывающаяСкобка = ЭтоСпецСимвол И ОписанияСкобок.ЛевыеСкобки[КодОператора] <> Неопределено;
		ЭтоЗакрывающаяСкобка = ЭтоСпецСимвол И ОписанияСкобок.ПравыеСкобки[КодОператора] <> Неопределено;
		ЭтоРазделитель = ЭтоСпецСимвол И КодОператора = ";";
		ЭтоЛогическийБлок = ТипОператора=тЛогическийБлок ИЛИ ТипОператора=тПодпрограмма;
		ЭтоЛогическийБлокПрепроцессора = ТипОператора = ТипыСловИОператоров.ЛогическийБлокПрепроцессора;
		ЭтоЗапятая = ЭтоСпецСимвол И КодОператора = ",";
		
		Если ЭтоЗакрывающаяСкобка Тогда
			КодСтроки = КодСтроки + КодОператора;
		ИначеЕсли ЭтоЛогическийБлок ИЛИ ЭтоЛогическийБлокПрепроцессора Тогда
			Если КодСтроки<>"" Тогда
				// блок с новой строки
				Код = Код + ПереводСтроки + СокрЛП(КодСтроки);
			КонецЕсли;
			КодСтроки = КодОператора;
		ИначеЕсли ЭтоРазделитель Тогда
			КодСтроки = КодСтроки + КодОператора;
			Код = Код + ПереводСтроки + СокрЛП(КодСтроки);
			КодСтроки = "";
		ИначеЕсли ЭтоЗапятая Тогда
			КодСтроки = КодСтроки + КодОператора;
		Иначе
			Если ТипОператора=тИдентификатор И ТипОператора=ПредыдущийТипОператора Тогда
				КодСтроки = КодСтроки + Пробел;
			ИначеЕсли Не ПредыдущийОператорЭтоОткрывающаяСкобка И НЕ (ЭтоОператорСравнения И ПредыдущийОператорЭтоОператорСравнения) Тогда
				КодСтроки = КодСтроки + Пробел;
			КонецЕсли;
			
			Если ТипОператора = ТипыСловИОператоров.Строка Тогда
				КодСтроки = КодСтроки + Кавычка + ТекстовыйПарсер_СформироватьКодСтроки(ТекстовыйПарсер, КодОператора) + Кавычка;
			Иначе
				КодСтроки = КодСтроки + КодОператора;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоЛогическийБлокПрепроцессора Тогда
			// после блока препроцессора сделать перевод строки
			Код = Код + ПереводСтроки + СокрЛП(КодСтроки);
			КодСтроки = "";
		КонецЕсли;
		
		ПредыдущийТипОператора = ТипОператора;
		
	КонецЦикла;
	
	Если КодСтроки <> "" Тогда
		Код = Код + ПереводСтроки + СокрЛП(КодСтроки);
	КонецЕсли;
	
	Код = СокрЛП(Код);
	
	ОператорГруппа.Код = Код;
	
	Возврат Истина;
	
КонецФункции

//
// } Формирование кода операторов

//
// { Разбор слов

Функция ТекстовыйПарсер_РазобратьСловаСтарая(ТекстовыйПарсер) Экспорт

	Слова = ТекстовыйПарсер.Слова;
	Слова.Очистить();
	
	Пока ТекстовыйПарсер_РазобратьСлово(ТекстовыйПарсер) Цикл
		Слова.Добавить(ТекстовыйПарсер.ТекущееСлово);
	КонецЦикла;
	
	ТекстовыйПарсер.КоличествоСлов = Слова.Количество();
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьСлова(ТекстовыйПарсер) Экспорт
	
	ПустаяСтрока = "";
	Кавычка = """";
	Пробел = " ";
	Слэш = "/";
	ПереносСтроки = "|";
	
	Цифры = ТекстовыйПарсер.ЦифрыСоответствие;
	ТипыСлов = ТекстовыйПарсер.ТипыСловИОператоров;
	СимволыИдентификаторов = ТекстовыйПарсер.ДопустимыеСимволыИдентификаторовСоответствие;
	
	ПустыеСимволы = Новый Соответствие;
	ПустыеСимволы[Пробел] = Истина;
	ПустыеСимволы[Символы.Таб] = Истина;
	
	ТекстовыйПарсер.НомерСимвола = 1;
	ТекстовыйПарсер.НомерСтроки = 0;
	ТекстовыйПарсер.ДлинаСтроки = 0;
	
	Слова = ТекстовыйПарсер.Слова;
	Слова.Очистить();
	
	Пока Истина Цикл
		
		Если ТекстовыйПарсер.НомерСимвола>ТекстовыйПарсер.ДлинаСтроки Тогда
			Если Не ТекстовыйПарсер_ПолучитьСтроку(ТекстовыйПарсер) Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;

		Символ = Сред(ТекстовыйПарсер.Строка, ТекстовыйПарсер.НомерСимвола, 1);
		ТекстовыйПарсер.НомерСимвола = ТекстовыйПарсер.НомерСимвола + 1;
		
		Если ПустыеСимволы[Символ]=Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если Символ=Слэш Тогда
			СледующийСимвол = Сред(ТекстовыйПарсер.Строка, ТекстовыйПарсер.НомерСимвола, 1);
			Если СледующийСимвол=Слэш Тогда
				// комментарий строки, прыгаем в конец строки
				ТекстовыйПарсер.НомерСимвола = ТекстовыйПарсер.ДлинаСтроки + 1;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если Символ=Кавычка Тогда
			
			//строка
			ТекстСлова = ПустаяСтрока;
			Пока Истина Цикл
				
				Если ТекстовыйПарсер.НомерСимвола>ТекстовыйПарсер.ДлинаСтроки Тогда
					Если Не ТекстовыйПарсер_ПолучитьСтроку(ТекстовыйПарсер) Тогда
						// не прочитана кавычка
						ВызватьИсключение "Обнаружена незавершенная строка";
					КонецЕсли;
					
					// новая строка, обработать перенос строки
					Пока Истина Цикл
						Символ = Сред(ТекстовыйПарсер.Строка, ТекстовыйПарсер.НомерСимвола, 1);
						ТекстовыйПарсер.НомерСимвола = ТекстовыйПарсер.НомерСимвола + 1;
						Если Символ=ПереносСтроки Тогда
							ТекстСлова = ТекстСлова + Символы.ПС;
							Прервать;
						ИначеЕсли ПустыеСимволы[Символ]=Истина Тогда
							
						Иначе
							ВызватьИсключение "Обнаружена незавершенная строка";
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;

				Символ = Сред(ТекстовыйПарсер.Строка, ТекстовыйПарсер.НомерСимвола, 1);
				ТекстовыйПарсер.НомерСимвола = ТекстовыйПарсер.НомерСимвола + 1;
				
				Если Символ=Кавычка Тогда
					СледующийСимвол = Сред(ТекстовыйПарсер.Строка, ТекстовыйПарсер.НомерСимвола, 1);
					Если СледующийСимвол=Кавычка Тогда
						// символ "кавычка"
						ТекстовыйПарсер.НомерСимвола = ТекстовыйПарсер.НомерСимвола + 1;
					Иначе
						// конец строки
						Слова.Добавить(Новый Структура("Слово, ТипСлова, НомерСтроки, ВРСлово", ТекстСлова, ТипыСлов.Строка, ТекстовыйПарсер.НомерСтроки, ВРЕГ(ТекстСлова)));
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
				ТекстСлова = ТекстСлова + Символ;
				
			КонецЦикла;
			
		ИначеЕсли СимволыИдентификаторов[Символ]=Истина Тогда

			ТекстСлова = Символ;
			
			Если Цифры[Символ]=Истина Тогда
				ТипСлова = ТипыСлов.Число;
			Иначе
				ТипСлова = ТипыСлов.Идентификатор;
			КонецЕсли;
			
			Пока Истина Цикл
				
				Если ТекстовыйПарсер.НомерСимвола>ТекстовыйПарсер.ДлинаСтроки Тогда
					// конец строки
					Символ = Неопределено;
				Иначе
					Символ = Сред(ТекстовыйПарсер.Строка, ТекстовыйПарсер.НомерСимвола, 1);
				КонецЕсли;
				
				Если НЕ СимволыИдентификаторов[Символ]=Истина Тогда
					// конец идентификатора
					Слова.Добавить(Новый Структура("Слово, ТипСлова, НомерСтроки, ВРСлово", ТекстСлова, ТипСлова, ТекстовыйПарсер.НомерСтроки, ВРЕГ(ТекстСлова)));
					Прервать;
				КонецЕсли;

				ТекстСлова = ТекстСлова + Символ;
				ТекстовыйПарсер.НомерСимвола = ТекстовыйПарсер.НомерСимвола + 1;
				
			КонецЦикла;
			
		Иначе
			
			ТекстСлова = Символ;
			Слова.Добавить(Новый Структура("Слово, ТипСлова, НомерСтроки, ВРСлово", ТекстСлова, ТипыСлов.СпецСимвол, ТекстовыйПарсер.НомерСтроки, ВРЕГ(ТекстСлова)));
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстовыйПарсер.КоличествоСлов = Слова.Количество();
	
КонецФункции

Функция ТекстовыйПарсер_ПолучитьСтроку(ТекстовыйПарсер) Экспорт

	Если ТекстовыйПарсер.ЧтениеТекста = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Пока Истина Цикл
		Строка = ТекстовыйПарсер.ЧтениеТекста.ПрочитатьСтроку();
		Если Строка = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Строка = СокрП(Строка);
		ДлинаСтроки = СтрДлина(Строка);
		Если ДлинаСтроки=0 Тогда
			ТекстовыйПарсер.НомерСтроки = ТекстовыйПарсер.НомерСтроки + 1;
			Продолжить;
		КонецЕсли;
		
		ТекстовыйПарсер.Строка = Строка;
		ТекстовыйПарсер.НомерСимвола = 1;
		ТекстовыйПарсер.НомерСтроки = ТекстовыйПарсер.НомерСтроки + 1;
		ТекстовыйПарсер.ДлинаСтроки = ДлинаСтроки;
		Прервать;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьСлово(ТекстовыйПарсер) Экспорт
	
	СимволыИдентификаторов = ТекстовыйПарсер.ДопустимыеСимволыИдентификаторовСоответствие;
	Цифры = ТекстовыйПарсер.ЦифрыСоответствие;
	ТипыСлов = ТекстовыйПарсер.ТипыСловИОператоров;
	
	ПустаяСтрока = "";
	Слово = ПустаяСтрока;
	Кавычка = """";
	Пробел = " ";
	Слэш = "/";
	Строка = ТекстовыйПарсер.Строка;
	НомерСтроки = ТекстовыйПарсер.НомерСтроки;

	Литер = 0;
	ТипСлова = 0;
	Пока Истина Цикл
			
		Если Строка = Неопределено Тогда
			Если ТекстовыйПарсер.ЧтениеТекста = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Строка = ТекстовыйПарсер.ЧтениеТекста.ПрочитатьСтроку();
			Если Строка = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
			Строка = СокрП(Строка);
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;

		НомерСлэша = 0;
		Идентификатор = Ложь;
		Строка = СокрЛ(Строка);
		ДлинаСтроки = СтрДлина(Строка);
		Для НомерСимвола=1 По ДлинаСтроки Цикл
			
			Символ = Сред(Строка, НомерСимвола, 1);
			
			// Обработать кавычки
			Если ТипСлова = 0 ИЛИ ТипСлова = ТипыСлов.Строка Тогда
				Если Символ = Кавычка Тогда
					ТипСлова = ТипыСлов.Строка;
					Если Литер = 2 Тогда
						// двойная кавычка
						Слово = Слово + Кавычка;
						Литер = 1;
					Иначе
						Литер = Литер + 1;
					КонецЕсли;
					Продолжить;
				Иначе
					Если Литер > 0 Тогда
						Если Литер = 2 Тогда
							// конец строки
							Прервать;
						КонецЕсли;
						
						Если Символ = "|" Тогда
							// символ переноса строки
							Слово = Слово + Символы.ПС;
						Иначе
							// слово в кавычках
							Слово = Слово + Символ;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			// Обработать слэши
			Если ТипСлова = 0 ИЛИ ТипСлова = ТипыСлов.Спецсимвол Тогда
				Если Символ = Слэш Тогда
					НомерСлэша = НомерСлэша + 1;
					Если НомерСлэша = 2 Тогда
						// двойной слэш
						Прервать; //чтение строки
					КонецЕсли;
					Продолжить;
				Иначе
					Если НомерСлэша = 1 Тогда
						// одинарный слэш
						Слово = Слово + Слэш;
						ТипСлова = ТипыСлов.Спецсимвол;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
				
			//Идентификатор
			Если ТипСлова = 0 ИЛИ ТипСлова = ТипыСлов.Идентификатор Тогда
				
				Если СимволыИдентификаторов[Символ] = Истина Тогда
					Слово = Слово + Символ;
					ТипСлова = ТипыСлов.Идентификатор;
				Иначе
					Если ТипСлова = ТипыСлов.Идентификатор Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			// спец. символ
			Если ТипСлова = 0 Тогда
				Если Символ <> Пробел Тогда
					Слово = Слово + Символ;
					ТипСлова = ТипыСлов.Спецсимвол;
					НомерСимвола = НомерСимвола + 1;
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НомерСлэша = 2 Тогда
			// строка закоментированна
			Строка = Неопределено
		ИначеЕсли НомерСимвола > ДлинаСтроки Тогда
			Строка = Неопределено;
		Иначе
			Строка = Прав(Строка, ДлинаСтроки - НомерСимвола + 1);
		КонецЕсли;
		
		Если ТипСлова = ТипыСлов.Строка Тогда
			Если Литер = 2 Тогда
				// строка закрылась кавычкой
				Прервать;
			Иначе
				// мультистрока, продолжение следует
			КонецЕсли;
		ИначеЕсли Слово <> ПустаяСтрока Тогда
			Прервать;
		Иначе
			ТипСлова = 0;
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если ТипСлова = ТипыСлов.Идентификатор Тогда
		Если Цифры[Лев(Слово, 1)] = Истина Тогда
			// цифровая константа
			ТипСлова = ТипыСлов.Число;
		КонецЕсли;
	КонецЕсли;
	
	ТекстовыйПарсер.ТекущееСлово = Новый Структура("Слово, ТипСлова, НомерСтроки, ВРСлово", Слово, ТипСлова, НомерСтроки, ВРЕГ(Слово));
	
	ТекстовыйПарсер.Строка = Строка;
	ТекстовыйПарсер.НомерСтроки = НомерСтроки;
	Возврат Истина;
	
КонецФункции

Функция Слово(ТипСлова=Неопределено, Слово="")
	
	СтруктураСлова = Новый Структура("ТипСлова, Слово, НомерСтроки", ТипСлова, Слово);
	
	Возврат СтруктураСлова;
	
КонецФункции

Функция СледующееСлово(ТекстовыйПарсер)
	
	Возврат УстановитьТекущееСлово(ТекстовыйПарсер, ТекстовыйПарсер.НомерТекущегоСлова + 1);
	
КонецФункции

Функция ПредыдущееСлово(ТекстовыйПарсер)

	Возврат УстановитьТекущееСлово(ТекстовыйПарсер, ТекстовыйПарсер.НомерТекущегоСлова - 1);
	
КонецФункции

Функция УстановитьТекущееСлово(ТекстовыйПарсер, НомерСлова)

	Если НомерСлова < 0 ИЛИ НомерСлова >= ТекстовыйПарсер.КоличествоСлов Тогда
		ТекстовыйПарсер.ТекущееСлово = ТекстовыйПарсер.ПустоеСлово;
	Иначе
		ТекстовыйПарсер.ТекущееСлово = ТекстовыйПарсер.Слова[НомерСлова];
	КонецЕсли;

	ТекстовыйПарсер.НомерТекущегоСлова = НомерСлова;
	
	Возврат ТекстовыйПарсер.ТекущееСлово;
	
КонецФункции

Функция УдалитьСлова(ТекстовыйПарсер, ИндексСлова, знач ИндексСловаДо=Неопределено)
	
	Если ИндексСловаДо=Неопределено Тогда
		ИндексСловаДо = ТекстовыйПарсер.НомерТекущегоСлова;
	КонецЕсли;
	
	Если ИндексСловаДо <= ИндексСлова Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КоличествоСловУдалить = ИндексСловаДо-ИндексСлова;
	
	Слова = ТекстовыйПарсер.Слова;
	
	Для НомерСловаУдалить=1 По КоличествоСловУдалить Цикл
		Слова.Удалить(ИндексСлова);
	КонецЦикла;
	
	Если ТекстовыйПарсер.НомерТекущегоСлова>=ИндексСлова Тогда
		Если ТекстовыйПарсер.НомерТекущегоСлова<ИндексСловаДо Тогда
			УстановитьТекущееСлово(ТекстовыйПарсер, ИндексСлова);
		Иначе
			ТекстовыйПарсер.НомерТекущегоСлова = ТекстовыйПарсер.НомерТекущегоСлова - КоличествоСловУдалить;
		КонецЕсли;
	КонецЕсли;
	
	ТекстовыйПарсер.КоличествоСлов = ТекстовыйПарсер.КоличествоСлов - КоличествоСловУдалить;
	Возврат Истина;
	
КонецФункции

//
// } Разбор слов

Функция ТекстовыйПарсер_ПоместитьПеременныеПодпрограммВКонтекст(ТекстовыйПарсер, Контекст, ИменаПеременных, Подпрограммы=Неопределено) Экспорт

	Перем РаботаСКоллекциями;

	Если Не ЗначениеЗаполнено(Контекст) Тогда
		Возврат Ложь;
	КонецЕсли;

	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	Если ТипЗнч(ИменаПеременных) = Тип("Структура") Тогда
		ИменаПеременныхМассив = РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(ИменаПеременных, "Ключ");
	Иначе
		ИменаПеременныхМассив = РаботаСКоллекциями.ЗначениеВМассив(ИменаПеременных);
	КонецЕсли;
	
	ЗаменаИдентификаторов = Новый Соответствие;
	Для Каждого ИмяПеременной Из ИменаПеременныхМассив Цикл
		ЗаменаИдентификаторов[ВРЕГ(ИмяПеременной)] = Контекст + "." + ИмяПеременной;
	КонецЦикла;
	
	МассивПодпрограмм = ТекстовыйПарсер_ПолучитьМассивПодпрограмм(ТекстовыйПарсер, Подпрограммы);
	Для Каждого Подпрограмма Из МассивПодпрограмм Цикл

		Если НЕ Подпрограмма.Директива.ИспользоватьДанныеКонтекста Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстовыйПарсер_ЗаменитьИдентификаторыПодпрограммы(ТекстовыйПарсер, Подпрограмма, ЗаменаИдентификаторов, Ложь);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ТекстовыйПарсер_ПолучитьМассивПодпрограмм(ТекстовыйПарсер, Подпрограммы=Неопределено) Экспорт
	
	Перем РаботаСКоллекциями;

	РаботаСКоллекциями = ТекстовыйПарсер.ДополнительныеДанные.ОбщиеМодули["РаботаСКоллекциями"];
	
	Если Подпрограммы = Неопределено Тогда
		МассивПодпрограмм = ТекстовыйПарсер.ТаблицаПодпрограмм.Строки;
	Иначе
		МассивПодпрограмм = РаботаСКоллекциями.ЗначениеВМассив(Подпрограммы);
	КонецЕсли;
	
	Возврат МассивПодпрограмм;
	
КонецФункции



Функция ВызватьКонтекстИсполнения(ПараметрыВызоваКонтекстаИсполнения)
	
	Перем РаботаСXMLКлиентСервер;
	
	ОбработанныеПараметрыВызоваКонтекстаИсполнения = Новый Структура;
	ОбработанныеПараметрыВызоваКонтекстаИсполнения.Вставить("Действие", ПараметрыВызоваКонтекстаИсполнения.Действие);
	ОбработанныеПараметрыВызоваКонтекстаИсполнения.Вставить("ИспользоватьКэш", ПараметрыВызоваКонтекстаИсполнения.ИспользоватьКэш);
	
	ПередатьДанные = Ложь;
	Если ПараметрыВызоваКонтекстаИсполнения.Действие="КомпиляцияКода" Тогда
		
		ОбработанныеПараметрыВызоваКонтекстаИсполнения.Вставить("КонтекстИсполнения", ПараметрыВызоваКонтекстаИсполнения.КонтекстИсполнения);
		ОбработанныеПараметрыВызоваКонтекстаИсполнения.Вставить("ПрограммныеМодули", ПараметрыВызоваКонтекстаИсполнения.ПрограммныеМодули);
		
		ДанныеКомпоновщикаКода = ПараметрыВызоваКонтекстаИсполнения.ДанныеКомпоновщикаКода;
		
	ИначеЕсли ПараметрыВызоваКонтекстаИсполнения.Действие="ИсполнениеКода" Тогда

		ДанныеДляВыполненияКода = ПараметрыВызоваКонтекстаИсполнения.ДанныеДляВыполненияКода;
		ОбработанныеПараметрыВызоваКонтекстаИсполнения.Вставить("ПараметрыВызоваПодпрограммы", ПараметрыВызоваКонтекстаИсполнения.ПараметрыВызоваПодпрограммы);
		Если Не ПараметрыВызоваКонтекстаИсполнения.ИспользоватьКэш ИЛИ ДанныеДляВыполненияКода.ОбновитьДанныеКонтекстаИсполнения Тогда
			ПередатьДанные = Истина;
			ДанныеДляВыполненияКода.ОбновитьДанныеКонтекстаИсполнения = Ложь;
		КонецЕсли;
		
		ОбработанныеПараметрыВызоваКонтекстаИсполнения.Вставить("Форма");
		ОбработанныеПараметрыВызоваКонтекстаИсполнения.Вставить("ИспользоватьДанныеКонтекста", ПараметрыВызоваКонтекстаИсполнения.ИспользоватьДанныеКонтекста);

		ОбработатьПараметрыВызоваПодпрограммыПередПереходом(ОбработанныеПараметрыВызоваКонтекстаИсполнения, ПараметрыВызоваКонтекстаИсполнения.ПроцессорКода);
		
		Форма = ОбработанныеПараметрыВызоваКонтекстаИсполнения.Форма;
		Если Форма <> Неопределено Тогда
			ОбработанныеПараметрыВызоваКонтекстаИсполнения.Форма = Неопределено;
			КодВызоваСервераНаФорме =
			"ПараметрыВызоваКонтекстаИсполнения = ДополнительныеПараметры;
			|ПараметрыВызоваКонтекстаИсполнения.Форма = Форма;
			|Результат = вмс_ВыполнениеПрограммногоКодаВызовСервера.ОбработатьПереходКонтекстаИсполнения(ПараметрыВызоваКонтекстаИсполнения);";
		КонецЕсли;
	КонецЕсли;
	
	РаботаСXMLКлиентСервер = глОбщийМодуль("РаботаСXMLКлиентСервер");

	ВызываемыйКонтекстИсполнения = ПараметрыВызоваКонтекстаИсполнения.КонтекстИсполнения;
	Для НомерВызова=1 По 2 Цикл
		
		Если ПередатьДанные Тогда
			Если ПараметрыВызоваКонтекстаИсполнения.Действие="КомпиляцияКода" Тогда
				ДанныеКомпоновщикаКодаXML = РаботаСXMLКлиентСервер.XMLСтрокаИзЗначенияУлучшенная(ДанныеКомпоновщикаКода);
				ОбработанныеПараметрыВызоваКонтекстаИсполнения.Вставить("ДанныеКомпоновщикаКодаXML", ДанныеКомпоновщикаКодаXML);
			ИначеЕсли ПараметрыВызоваКонтекстаИсполнения.Действие="ИсполнениеКода" Тогда
				ДанныеДляВыполненияКодаXML = РаботаСXMLКлиентСервер.XMLСтрокаИзЗначенияУлучшенная(ДанныеДляВыполненияКода);
				ОбработанныеПараметрыВызоваКонтекстаИсполнения.Вставить("ДанныеДляВыполненияКодаXML", ДанныеДляВыполненияКодаXML);
			КонецЕсли;
		КонецЕсли;
		
		Если ВызываемыйКонтекстИсполнения="Сервер" Тогда
			Если Форма <> Неопределено Тогда
				РезультатВызоваКонтекстаИсполнения = Форма.СлужебнаяФункцияВызовСервера(КодВызоваСервераНаФорме, ОбработанныеПараметрыВызоваКонтекстаИсполнения);
			Иначе
				РезультатВызоваКонтекстаИсполнения = вмс_ВыполнениеПрограммногоКодаВызовСервера.ОбработатьПереходКонтекстаИсполнения(ОбработанныеПараметрыВызоваКонтекстаИсполнения);
			КонецЕсли;
		Иначе
			ВызватьИсключение "Вызов неизвестного контекста исполнения """ + ВызываемыйКонтекстИсполнения + """";
		КонецЕсли;
		
		Если РезультатВызоваКонтекстаИсполнения.Успешно Тогда
			Если РезультатВызоваКонтекстаИсполнения.ФорматРезультатаВXML Тогда
				Возврат РаботаСXMLКлиентСервер.ПрочитатьТекстXMLУлучшенная(РезультатВызоваКонтекстаИсполнения.Результат);
			Иначе
				Возврат РезультатВызоваКонтекстаИсполнения.Результат;
			КонецЕсли;
		КонецЕсли;

		Если РезультатВызоваКонтекстаИсполнения.НетДанных Тогда
			ПередатьДанные = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ВызватьИсключение "Ошибка вызова контекста исполнения """ + ВызываемыйКонтекстИсполнения + """";

КонецФункции

Функция ОбработатьПараметрыВызоваПодпрограммыПередПереходом(ПараметрыВызоваКонтекстаИсполнения, ПроцессорКода)

	ПараметрыВызоваКонтекстаИсполнения.Вставить("НативныйОбъектКонтекстаЗамещен", Ложь);

	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ОбъектКонтекста = ПараметрыВызоваКонтекстаИсполнения.ПараметрыВызоваПодпрограммы[0];
	КлассныйОбъект = вмс_КлассныеОбъекты.ПолучитьКлассныйОбъект(ОбъектКонтекста, ПроцессорКода);
	НативныйОбъект = КлассныйОбъект.НативныйОбъект;
	Если НативныйОбъект <> Неопределено Тогда
		
		Если ТипЗнч(НативныйОбъект)=Тип("ФормаКлиентскогоПриложения") Тогда
			Если ПараметрыВызоваКонтекстаИсполнения.ИспользоватьДанныеКонтекста Тогда
				ПараметрыВызоваКонтекстаИсполнения.Форма = НативныйОбъект;
			КонецЕсли;
			ПараметрыВызоваКонтекстаИсполнения.НативныйОбъектКонтекстаЗамещен = ОбъектКонтекста<>КлассныйОбъект;
			КлассныйОбъект = РК.СкопироватьОбъект(КлассныйОбъект);
			КлассныйОбъект.НативныйОбъект = Неопределено;
			Если ПараметрыВызоваКонтекстаИсполнения.НативныйОбъектКонтекстаЗамещен Тогда
				ПараметрыВызоваКонтекстаИсполнения.ПараметрыВызоваПодпрограммы[0] = КлассныйОбъект;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецФункции
