Функция ПолучитьСсылкуСозданногоДокумента(ДокументОснование, ТипСозданногоДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	вмс_СвязанныеДокументы.СозданныйДокумент КАК СозданныйДокумент
	               |ИЗ
	               |	РегистрСведений.вмс_СвязанныеДокументы КАК вмс_СвязанныеДокументы
	               |ГДЕ
	               |	вмс_СвязанныеДокументы.ДокументОснование = &ДокументОснование
	               |	И ТИПЗНАЧЕНИЯ(вмс_СвязанныеДокументы.СозданныйДокумент) = &ТипСозданногоДокумента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	вмс_СвязанныеДокументы.СозданныйДокумент";
	Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
	Запрос.УстановитьПараметр("ТипСозданногоДокумента",ТипСозданногоДокумента);
	Результат = Запрос.Выполнить().Выгрузить();
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат[0].СозданныйДокумент;	
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСозданныеДокументы(ПолеПоиска, ЗначениеПоиска) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	вмс_СвязанныеДокументы.СозданныйДокумент КАК СозданныйДокумент
	               |ИЗ
	               |	РегистрСведений.вмс_СвязанныеДокументы КАК вмс_СвязанныеДокументы
	               |ГДЕ
	               |	вмс_СвязанныеДокументы." + ПолеПоиска + " = &ЗначениеПоиска
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	вмс_СвязанныеДокументы.СозданныйДокумент";
	Запрос.УстановитьПараметр("ЗначениеПоиска",ЗначениеПоиска);
	Результат = Запрос.Выполнить().Выгрузить();
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат.ВыгрузитьКолонку("СозданныйДокумент");	
	Иначе
		Возврат Новый Массив;	
	КонецЕсли;
	
КонецФункции

Функция АктуализироватьДанныеРегистра(ДокументОснование, СсылкиНаОперации, СозданныйДокумент) Экспорт
	
	НаборЗаписей = РегистрыСведений.вмс_СвязанныеДокументы.СоздатьНаборЗаписей();
	НаборЗаписей.Заполнить(Неопределено);
	НаборЗаписей.Отбор.ДокументОснование.Установить(ДокументОснование);
	НаборЗаписей.Отбор.СозданныйДокумент.Установить(СозданныйДокумент);	
	НаборЗаписей.Записать();
	
	Для Каждого СсылкаНаОперацию Из СсылкиНаОперации Цикл
		МенеджерЗаписи = РегистрыСведений.вмс_СвязанныеДокументы.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Заполнить(Неопределено);
		МенеджерЗаписи.ДокументОснование = ДокументОснование;
		МенеджерЗаписи.Операция = СсылкаНаОперацию;
		МенеджерЗаписи.СозданныйДокумент = СозданныйДокумент;				
		МенеджерЗаписи.Записать();	
	КонецЦикла;
	
КонецФункции
