
&НаСервере
Функция ЗагрузитьНаСервере(Массив,Владелец)
	
	КоличествоПропущенных = 0;
		
	Для Каждого Элемент из Массив Цикл  
		
		НаборЗаписей = РегистрыСведений.ШтрихкодыКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.Контрагент.Установить(Владелец);
		НаборЗаписей.Отбор.Штрихкод.Установить(Элемент);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			КоличествоПропущенных = КоличествоПропущенных + 1;
			Продолжить; 
		Иначе
			Запись = НаборЗаписей.Добавить();
			Запись.Период = ТекущаяДата();
			Запись.Контрагент =     Владелец;
			Запись.Штрихкод = Элемент;
			Запись.Использовано = Ложь;
			НаборЗаписей.Записать();	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КоличествоПропущенных;
	
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		Массив = Новый Массив;
		Предел=2;
		Пока Предел <= ТабличныйДокумент.ВысотаТаблицы цикл
			Массив.Добавить(ТабличныйДокумент.Область(Предел,1).Текст);
			Предел=Предел+1;
		КонецЦикла;
		КоличествоПропущенных = ЗагрузитьНаСервере(Массив,Контрагент);
				
		КоличествоЗаписей = Массив.Количество() - КоличествоПропущенных;
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю("Загружено " + КоличествоЗаписей + " записей." + Символы.ПС + "Пропущено " + КоличествоПропущенных + " дублирующих записей");
		
	Иначе 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран контрагент");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

