Процедура ДобавитьПотребностьПоРаспоряжению(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект." + вмс_АдаптацияКонфигураций.ПолучитьИмяПриходногоДокумента()) Тогда  
		
		// //1. Проверяем есть ли вообще комплекты в документе
		// //2. Проверяем есть ли документ потребности 
		// //3. Заполняем и проводим документ потребности
		//			
		//ТоварыПоРаспоряжению = Источник.Товары.Выгрузить(, "Номенклатура, Характеристика, Количество");
		//ТоварыПоРаспоряжению.Колонки["Номенклатура"].Имя = "Товар";	
		//ТаблицаКомплектов = вмс_КомплектованиеТоваровСервер.ПолучитьСоставыКомплектов(ТоварыПоРаспоряжению); 		 
		//
		//Если ТаблицаКомплектов.Количество() > 0 Тогда
		//	
		//	ДокументПотребности = Неопределено;
		//	СоздатьДокумент = Истина;
		//				
		//	ТаблицаКомплектов.Колонки["ХарактеристикаТовара"].Имя = "Характеристика";
		//	ТаблицаКомплектов.Колонки["Количество"].Имя = "КоличествоКомплектующих";
		//	ТаблицаКомплектов.Колонки.Добавить("Количество");
		//	Отбор = Новый Структура("Товар, Характеристика",);
		//	
		//	//заполнение количества комплектующих по количеству комплектов
		//	Для каждого СтрокаРаспоряжения Из ТоварыПоРаспоряжению  Цикл
		//		
		//		ЗаполнитьЗначенияСвойств(Отбор, СтрокаРаспоряжения);
		//		СтрокиКомплектующих = ТаблицаКомплектов.НайтиСтроки(Отбор);
		//		
		//		Для каждого Комплектующая Из СтрокиКомплектующих Цикл
		//			Комплектующая.КоличествоКомплектующих = Комплектующая.КоличествоКомплектующих * СтрокаРаспоряжения.Количество;	
		//		КонецЦикла;
		//		
		//	КонецЦикла;
		//	//заполнение количества комплектующих по количеству комплектов 
		//	
		//	СводнаяТаблица = вмс_РаботаСКоллекциями.СоединитьТаблицы(ТаблицаКомплектов, ТоварыПоРаспоряжению, "Товар, Характеристика", "Количество", , Ложь); 
		//				
		//	ДокументПотребности = ПолучитьДокументПотребности(Источник.Ссылка); 
		//	
		//	Если ДокументПотребности = Неопределено Тогда
		//		ДокументОбъект = Документы.вмс_ПотребностьКомплектов.СоздатьДокумент();
		//		ДокументОбъект.Заполнить(Неопределено);
		//		ДокументОбъект.Дата = Источник.Дата;
		//		ДокументОбъект.ДокументОснование = Источник.Ссылка;
		//		ДокументОбъект.Комментарий = "#Создан автоматически#";
		//	Иначе
		//		ДокументОбъект = ДокументПотребности.ПолучитьОбъект();
		//	КонецЕсли; 
		//	
		//	ДокументОбъект.Комплекты.Очистить();
		//	
		//	Для каждого Строка Из СводнаяТаблица Цикл			
		//		нСтрока = ДокументОбъект.Комплекты.Добавить();
		//		ЗаполнитьЗначенияСвойств(нСтрока, Строка);
		//	КонецЦикла;
		//	
		//	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//	
		//КонецЕсли;
		
		
	КонецЕсли;

		
КонецПроцедуры
