// Функция - Запись события в журнал регистрации
//
// Синтаксис:
// ЗаписатьСобытиеВЖурнал(УровеньСобытия, Контекст, Комментарий)
//
// Параметры:
//  УровеньСобытия - УровеньЖурналаРегистрации - уровень важности события. 
//                   Если не указан, по умолчанию используется "Информация".
//  Контекст       - Произвольный - данные контекста события, которые будут сериализованы для хранения.
//                   При ошибке сериализации сохраняется исходное значение.
//  Комментарий    - Строка - текстовое описание события.
//
// Возвращаемое значение:
//  Не возвращает значений.
//
// Описание:
//  Функция создает новую запись в регистре сведений "вмс_ЖурналСобытий" с указанными параметрами.
//  Автоматически заполняются системные данные: дата события, пользователь, компьютер, приложение, номер сеанса.
//
// Пример использования:
//  вмс_Журналирование.ЗаписатьСобытиеВЖурнал(УровеньЖурналаРегистрации.Ошибка, Объект, "Произошла ошибка при выполнении
//      операции");
//
Функция Записать(Комментарий = "", знач Контекст = "", УровеньСобытия=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если УровеньСобытия = Неопределено Тогда
		УровеньСобытия = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	
	Попытка
		Контекст = СериализоватьКонтекст(Контекст);
	Исключение
		ИН = ИнформацияОбОшибке();
		Контекст = Контекст;
	КонецПопытки;
	
	ДанныеСеанса = ПолучитьТекущийСеансИнформационнойБазы();
	
	ДанныеСобытия = Новый Структура;
	ДанныеСобытия.Вставить("Контекст", Контекст);
	ДанныеСобытия.Вставить("Комментарий", Комментарий);
	ДанныеСобытия.Вставить("УровеньСобытия", Строка(УровеньСобытия));
	ДанныеСобытия.Вставить("Пользователь", Строка(ДанныеСеанса.Пользователь));
	ДанныеСобытия.Вставить("ИмяКомпьютера", Строка(ДанныеСеанса.ИмяКомпьютера));
	ДанныеСобытия.Вставить("ИмяПриложения", Строка(ДанныеСеанса.ИмяПриложения));
	ДанныеСобытия.Вставить("НомерСеанса", Строка(ДанныеСеанса.НомерСеанса));
	
	//Записываем логирование вне транзакции
	ФоновыеЗадания.Выполнить("вмс_Журналирование.ЗаписатьФоново", вмс_РаботаСКоллекциями.ЗначениеВМассив(ДанныеСобытия));
	
КонецФункции

// Функция - Запись ошибки в журнал регистрации
//
// Синтаксис:
// Ошибка(СтекОшибки, Контекст)
//
// Параметры:
//  СтекОшибки - Строка - текст стека вызовов или сообщение об ошибке.
//  Контекст   - Произвольный - дополнительные данные контекста ошибки.
//
// Возвращаемое значение:
//  Не возвращает значений.
//
// Описание:
//  Функция выполняет запись ошибки в журнал регистрации с уровнем "Ошибка".
//  Использует базовую функцию Записать() для сохранения данных.
//
// Пример использования:
//  вмс_Журналирование.Ошибка(ОписаниеОшибки(), Объект);
//
Функция Ошибка(СтекОшибки = "", Контекст = "") Экспорт
	Записать(СтекОшибки, Контекст, УровеньЖурналаРегистрации.Ошибка);
КонецФункции

Функция СериализоватьКонтекст(Контекст) Экспорт 
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	ПараметрыЗаписиXML = вмс_РаботаСXMLКлиентСервер.ПолучитьПараметрыЗаписиXML(ЗаписьXML);
	ПараметрыЗаписиXML.СсылочнаяМодельДанных = Ложь;
	ПараметрыЗаписиXML.КодироватьСтроковыеЗначения = Ложь;
	ПараметрыЗаписиXML.КодироватьИменаТипов = Ложь;
	вмс_РаботаСXMLКлиентСервер.ПодготовитьОбъектыИЗначенияСвойствОбъектовДляЗаписи(ПараметрыЗаписиXML, Контекст);
	вмс_РаботаСXMLКлиентСервер.ЗаписатьСодержимое(ПараметрыЗаписиXML);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Функция - API: Запись событий ТСД в журнал вмс_ЖурналСобытийТСД (2.1.10)
//
// Синтаксис:
// ЗаписатьСобытиеТСД(СообщениеЛогирования)
//
// Параметры:
//  СообщениеЛогирования - Структура - текст стека вызовов или сообщение об ошибке:
//    *ДатаВремя - Дата - дата события с временной меткой ТСД (если сервер на другой дате)
//    *ВерсияПриложения - Строка - версия мобильного приложения
//    *Уровень - Строка - уровень события
//    *Комменарий - Строка - само сообщение с данными
//
// Возвращаемое значение:
//  Не возвращает значений.
//
Функция ЗаписатьСобытиеТСД(СообщениеЛогирования) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеСеанса = ПолучитьТекущийСеансИнформационнойБазы();
	
	ВерсияРасширения = РасширенияКонфигурации.Получить(Новый Структура("Имя", "WMS"))[0].Версия;
	
	НоваяЗапись = РегистрыСведений.вмс_ЖурналСобытийТСД.СоздатьМенеджерЗаписи(); 
	НоваяЗапись.Заполнить(Неопределено);
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СообщениеЛогирования);
	НоваяЗапись.Сеанс = ДанныеСеанса.НомерСеанса;
	НоваяЗапись.ВерсияКонфигурации = ВерсияРасширения;
	НоваяЗапись.Записать();
	
КонецФункции

// Служебный метод для записи лога в отдельном сеансе, вне транзакции
// Параметры:
//  ДанныеСобытия - Структура - данные для записи в регистр:
//    *Контекст - Строка - описание контекста выполнения
//    *Комментарий - Строка - комментарий к событию
//    *УровеньСобытия - Строка - уровень события
//    *Пользователь - Строка - пользователь
//    *ИмяКомпьютера - Строка - имя компьютера
//    *ИмяПриложения - Строка - приложение
//    *НомерСеанса - Строка - номер сеанса
Процедура ЗаписатьФоново(ДанныеСобытия) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяЗапись = РегистрыСведений.вмс_ЖурналСобытий.СоздатьМенеджерЗаписи();
	НоваяЗапись.Заполнить(Неопределено);
	НоваяЗапись.Дата = ТекущаяДатаСеанса();
	НоваяЗапись.Пользователь = ДанныеСобытия.Пользователь;
	НоваяЗапись.Компьютер = ДанныеСобытия.ИмяКомпьютера;
	НоваяЗапись.Приложение = ДанныеСобытия.ИмяПриложения;
	НоваяЗапись.Сеанс = ДанныеСобытия.НомерСеанса;
	НоваяЗапись.Контекст = ДанныеСобытия.Контекст;
	НоваяЗапись.Комментарий = ДанныеСобытия.Комментарий;
	НоваяЗапись.Уровень = ДанныеСобытия.УровеньСобытия;
	
	НоваяЗапись.Записать();
	
КонецПроцедуры
