&НаСервере
Функция ОбновитьФотографию(ВыбраннаяСтрока)              
	
	НЗ = РегистрыСведений.вмс_ПрикрепленныеФотографии.СоздатьНаборЗаписей();
	//ТУ_Самойленко 23.06.23 ++
	//НЗ.Отбор.УникальныйИдентификатор.Установить(ВыбраннаяСтрока.УникальныйИдентификатор);
	НЗ.Отбор.Владелец.Установить(ВыбраннаяСтрока.Владелец);
	//ТУ_Самойленко 23.06.23 --
	НЗ.Отбор.НомерЗаписи.Установить(ВыбраннаяСтрока.НомерЗаписи); 
	НЗ.Прочитать();
	
	Если ЗначениеЗаполнено(НЗ) Тогда
		
		Запись = НЗ[0]; 
		
		Фотография = ПоместитьВоВременноеХранилище(Запись.Значение.Получить(), 
		УникальныйИдентификатор); 
		
		//ТУ_Самойленко 23.06.23 ++ 
		
		//Попытка
		//	МенеджерВладельца = вмс_ОбщегоНазначенияСервер.ПолучитьМенеджерОбъектовБазы(Запись.ТипОбъекта);
		//	пВладелец = МенеджерВладельца.ПолучитьСсылку(Запись.УникальныйИдентификатор);
		//	Владелец = "" + пВладелец.Метаданные().Синоним + ":" + пВладелец;
		//Исключение
		//	//ОписаниеОшибки()
		//КонецПопытки;
		
		Владелец = Запись.Владелец;
		
		//ТУ_Самойленко 23.06.23 --
		
	КонецЕсли;
	
													   
	
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Строка = Элементы.Список.ТекущиеДанные; 
	Если Строка <> Неопределено Тогда
		ОбновитьФотографию(Строка);
	Иначе
		Фотография = "";
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОтборОчисткаНаСервере()
	Список.Отбор.Элементы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОтборОчистка(Элемент, СтандартнаяОбработка)
	ОтборОчисткаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтборПриИзмененииНаСервере() 
	Если Отбор <> Неопределено Тогда
		Список.Отбор.Элементы.Очистить();
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УникальныйИдентификатор");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Отбор.УникальныйИдентификатор();   
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	ОтборПриИзмененииНаСервере();
КонецПроцедуры
