
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Ссылка", Ссылка);
	Параметры.Свойство("ШаблонМаршрута", ШаблонМаршрута);
	Параметры.Свойство("СсылкаДляКопирования", СсылкаДляКопирования);
	
	ЗаполнитьКонтекстФормы();
	ЗаполнитьСпискиВыбораЭлементовФормы();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

// #КонецОбласти


// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭтапыМаркировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Стр = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	Если Поле = Элементы.ЭтапыМаркировкиПредставлениеПорядка Тогда
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"ПорядокОбработкиПослеВыбора", ЭтаФорма, ВыбраннаяСтрока);
		
		МодульКлиента().ОткрытьФормуПорядкаОбработкиЭтапаМаркировки(
		Стр.Этап, Стр.ПорядокОбработки, ЭтаФорма, ОписаниеОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаркировкиЭтапПриИзменении(Элемент)
	
	ЭтапыМаркировкиЭтапПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаркировкиСпособОтраженияПриИзменении(Элемент)
	
	ЭтапыМаркировкиСпособОтраженияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаркировкиСпособОтраженияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ЭтапыМаркировки.ТекущиеДанные;
	СписокВыбора = Элементы.ЭтапыМаркировкиСпособОтражения.СписокВыбора;
	ЗначенияСписка = МодульКлиента().СпособыОтраженияВЧЗПоЭтапуМаркировки(ТекущаяСтрока.Этап);
	МодульКлиента().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

// #КонецОбласти


// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти


// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ОписаниеМаршрута = МодульОбъекта().МаршрутМаркировки_Прочитать(Ссылка);
	ИначеЕсли ЗначениеЗаполнено(ШаблонМаршрута) Тогда
		ОписаниеМаршрута = МодульОбъекта().МаршрутМаркировки_ПрочитатьШаблон(ШаблонМаршрута);
	ИначеЕсли ЗначениеЗаполнено(СсылкаДляКопирования) Тогда
		ОписаниеМаршрута = МодульОбъекта().МаршрутМаркировки_Прочитать(СсылкаДляКопирования);
		ОписаниеМаршрута.Ссылка = Неопределено;
	Иначе
		ОписаниеМаршрута = МодульОбъекта().Новый_МаршрутМаркировки();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеМаршрута,, "ЭтапыМаркировки");
	
	ЗаполнитьЭтапыМаркировки(ОписаниеМаршрута);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭтапыМаркировки(ОписаниеМаршрута)
	
	КлючиТребДействий = МодульОбъекта().КлючиПеречисления_ТребуемыеДействияДокументовУчета();
	КлючиСпособыВыполнения = МодульОбъекта().КлючиПеречисления_СпособыВыполнения();
	
	ЭтапыМаркировки.Очистить();
	
	Этап = Неопределено;
	НоваяСтрока = Неопределено;
	Для Каждого Стр Из ОписаниеМаршрута.ЭтапыМаркировки Цикл
		
		Если Стр.Этап <> Этап Тогда
			
			Если НоваяСтрока <> Неопределено Тогда
				ОбновитьПредставлениеПорядкаОбработки(НоваяСтрока);
			КонецЕсли;
			
			Этап = Стр.Этап;
			
			НоваяСтрока = ЭтапыМаркировки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр, "Этап, СпособОтражения");
			НоваяСтрока.ПорядокОбработки = Новый Структура;
			НоваяСтрока.ПорядокОбработки.Вставить("СпособыВыполнения", МодульОбъекта().СпособыВыполненияЭтапаМаркировки(Стр.Этап));
			
		КонецЕсли;
		
		КлючТребДействия = КлючиТребДействий.Получить(Стр.ТребуемоеДействие);
		Если ЗначениеЗаполнено(КлючТребДействия) Тогда
			
			НоваяСтрока.ПорядокОбработки.Вставить(КлючТребДействия, Не Стр.Пропущен);
			
			Для Каждого Элемент Из Стр.СпособыВыполнения Цикл
				
				КлючСпособаВыполнения = КлючиСпособыВыполнения.Получить(Элемент);
				Если ЗначениеЗаполнено(КлючСпособаВыполнения) Тогда
					НоваяСтрока.ПорядокОбработки.СпособыВыполнения[КлючСпособаВыполнения] = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НоваяСтрока <> Неопределено Тогда
		ОбновитьПредставлениеПорядкаОбработки(НоваяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораЭлементовФормы()
	
	ЗаполнитьСписокВыбораЭтапаМаркировки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораЭтапаМаркировки()
	
	СписокВыбора = Элементы.ЭтапыМаркировкиЭтап.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ЭтапыМаркировки();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЭтапыМаркировкиЭтапПриИзмененииНаСервере()
	
	КлючиТребДействий = МодульОбъекта().КлючиПеречисления_ТребуемыеДействияДокументовУчета();
	КлючиСпособыВыполнения = МодульОбъекта().КлючиПеречисления_СпособыВыполнения();
	
	ТекущаяСтрока = ЭтапыМаркировки.НайтиПоИдентификатору(Элементы.ЭтапыМаркировки.ТекущаяСтрока);
	
	СписокВыбора = Элементы.ЭтапыМаркировкиСпособОтражения.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().СпособыОтраженияВЧЗПоЭтапуМаркировки(ТекущаяСтрока.Этап);
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
	ТекущаяСтрока.СпособОтражения = МодульОбъекта().СпособОтраженияВЧЗПоУмолчанию(ТекущаяСтрока.Этап);
	ТекущаяСтрока.ПорядокОбработки = Новый Структура;
	ТекущаяСтрока.ПорядокОбработки.Вставить("СпособыВыполнения", МодульОбъекта().СпособыВыполненияЭтапаМаркировки(ТекущаяСтрока.Этап));
	
	Для Каждого Стр Из МодульОбъекта().ПорядокОбработкиЭтапаМаркировки(ТекущаяСтрока.Этап) Цикл
		
		КлючТребДействия = КлючиТребДействий.Получить(Стр.ТребуемоеДействие);
		Если ЗначениеЗаполнено(КлючТребДействия) Тогда
			
			ТекущаяСтрока.ПорядокОбработки.Вставить(КлючТребДействия, Истина);
			
			Для Каждого Элемент Из Стр.СпособыВыполнения Цикл
				
				КлючСпособаВыполнения = КлючиСпособыВыполнения.Получить(Элемент);
				Если ЗначениеЗаполнено(КлючСпособаВыполнения) Тогда
					ТекущаяСтрока.ПорядокОбработки.СпособыВыполнения[КлючСпособаВыполнения] = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьПредставлениеПорядкаОбработки(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ЭтапыМаркировкиСпособОтраженияПриИзмененииНаСервере()
	
	ТекущаяСтрока = ЭтапыМаркировки.НайтиПоИдентификатору(Элементы.ЭтапыМаркировки.ТекущаяСтрока);
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.СпособОтражения) Тогда
		ТекущаяСтрока.СпособОтражения = МодульОбъекта().СпособОтраженияВЧЗПоУмолчанию(ТекущаяСтрока.Этап);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПорядокОбработкиПослеВыбора(ПорядокОбработки, ИдентификаторСтроки) Экспорт
	
	Если ПорядокОбработки <> Неопределено Тогда
		ТекущаяСтрока = ЭтапыМаркировки.НайтиПоИдентификатору(ИдентификаторСтроки);
		ТекущаяСтрока.ПорядокОбработки = ПорядокОбработки;
		ОбновитьПредставлениеПорядкаОбработки(, ИдентификаторСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать()
	
	ЗаписатьНаСервере();
	Оповестить("КонтурМаркировка_МаршрутМаркировки_Запись");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ОписаниеМаршрута = ОписаниеМаршрутаПоКонтекстуФормы();
	
	МодульОбъекта().МаршрутМаркировки_Записать(ОписаниеМаршрута);
	
	Ссылка = ОписаниеМаршрута.Ссылка;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеМаршрутаПоКонтекстуФормы()
	
	СпособыВыполнения = МодульОбъекта().Перечисление_СпособыВыполнения();
	КлючиТребДействий = МодульОбъекта().КлючиПеречисления_ТребуемыеДействияДокументовУчета();
	
	Результат = МодульОбъекта().Новый_МаршрутМаркировки();
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма,, "ЭтапыМаркировки");
	
	Для Каждого Стр Из ЭтапыМаркировки Цикл
		
		ПорядокОбработки = МодульОбъекта().ПорядокОбработкиЭтапаМаркировки(Стр.Этап);
		Для Каждого СтрТребДействие Из ПорядокОбработки Цикл
			
			КлючТребДействия = КлючиТребДействий.Получить(СтрТребДействие.ТребуемоеДействие);
			Если Не ЗначениеЗаполнено(КлючТребДействия) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Результат.ЭтапыМаркировки.Добавить();
			НоваяСтрока.Этап = Стр.Этап;
			НоваяСтрока.СпособОтражения = Стр.СпособОтражения;
			НоваяСтрока.ТребуемоеДействие = СтрТребДействие.ТребуемоеДействие;
			НоваяСтрока.Пропущен = Не Стр.ПорядокОбработки[КлючТребДействия];
			
			Для Каждого КлючЗначение Из Стр.ПорядокОбработки.СпособыВыполнения Цикл
				Если КлючЗначение.Значение Тогда
					НоваяСтрока.СпособыВыполнения.Добавить(СпособыВыполнения[КлючЗначение.Ключ]);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьПредставлениеПорядкаОбработки(ТекущаяСтрока = Неопределено, ИдентификаторСтроки = Неопределено)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекСтр = ЭтапыМаркировки.НайтиПоИдентификатору(ИдентификаторСтроки);
	Иначе
		ТекСтр = ТекущаяСтрока;
	КонецЕсли;
	
	ТребуемыеДействия = МодульОбъекта().Перечисление_ТребуемыеДействияДокументовУчета();
	КлючиТребДействий = МодульОбъекта().КлючиПеречисления_ТребуемыеДействияДокументовУчета();
	
	ПредставлениеПорядка = "";
	Разделитель = "; ";
	
	ПорядокОбработки = МодульОбъекта().ПорядокОбработкиЭтапаМаркировки(ТекСтр.Этап);
	Для Каждого Стр Из ПорядокОбработки Цикл
		КлючТребДействие = КлючиТребДействий.Получить(Стр.ТребуемоеДействие);
		Если КлючТребДействие = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ТекСтр.ПорядокОбработки[КлючТребДействие] Тогда
			ПредставлениеПорядка = ПредставлениеПорядка + Стр.ТребуемоеДействие + Разделитель;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПредставлениеПорядка) Тогда
		ТекСтр.ПредставлениеПорядка = Лев(ПредставлениеПорядка, СтрДлина(ПредставлениеПорядка) - СтрДлина(Разделитель));
	Иначе
		ТекСтр.ПредставлениеПорядка = НСтр("ru = 'Укажите порядок обработки этапа маркировки'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УстановитьУсловноеОформлениеСпособаОтражения();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСпособаОтражения()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЭтапыМаркировкиСпособОтражения");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтапыМаркировки.СпособОтражения");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	МодульОбъекта().УсловноеОформление_УстановитьТекстНеТребуется(ЭлементУО);
	
КонецПроцедуры

// #КонецОбласти
