#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
		
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПолноеСопоставление = Ложь Тогда
		ПроверкаСопоставления = ПроверитьСопоставлениеСУчетнойСистемой();
		
		Если ПроверкаСопоставления Тогда
			ПолноеСопоставление = Истина;
			Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ОжидаетПоставки;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.Отклонен Тогда
		НайденныйДок = вмс_ЛичныйКабинетПоклажедателяВызовСервер.НайтиДокументУчетнойСистемы(ЭтотОбъект.Ссылка);
		
		Если НайденныйДок <> Неопределено Тогда
			НайденныйДок.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);	
		КонецЕсли;
		
		ЭтотОбъект.УстановитьПометкуУдаления(Истина); 
		
		вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПередатьСтатусДокумента(ЭтотОбъект.Ссылка, "ПередачаНаХранение");
	ИначеЕсли Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ПринятНаСкладе Тогда
		вмс_ЛичныйКабинетПоклажедателяВызовСервер.ОтправитьДокПередачаНаХранение(ЭтотОбъект.Ссылка);
	Иначе
		вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПередатьСтатусДокумента(ЭтотОбъект.Ссылка, "ПередачаНаХранение");
	КонецЕсли;
	
КонецПроцедуры  

Процедура ОбработкаПроведения(Отказ, Режим)	
	
	Если Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ПринятНаСкладе Тогда
		
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записывать = Истина;
		Движения.вмс_ОстаткиТоваровПоклажедателя.Очистить();    
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записать(); 
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записывать = Истина;
		
		Для Каждого ТекСтрокаСписокНоменклатуры Из Товары Цикл
			Движение = Движения.вмс_ОстаткиТоваровПоклажедателя.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаСписокНоменклатуры.НоменклатураПоклажедателя;
			Движение.Количество = ТекСтрокаСписокНоменклатуры.КоличествоФакт; 
			Движение.Контрагент = Контрагент;
			Движение.Склад = Склад;
		КонецЦикла;
		
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСопоставлениеСУчетнойСистемой()
	
	Проверка = Истина;
	
	Для каждого СтрокаТЧ Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатураПоклажедателя.Номенклатура) Тогда
			Проверка = Ложь;
		Иначе
			СтрокаТЧ.Номенклатура = СтрокаТЧ.НоменклатураПоклажедателя.Номенклатура;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатураПоклажедателя.Упаковка) Тогда
			Проверка = Ложь;
		Иначе
			СтрокаТЧ.Упаковка = СтрокаТЧ.НоменклатураПоклажедателя.Упаковка;
		КонецЕсли;
		
		Если вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПроверкаИспользованияХарактеристикПоКонтрагенту(Контрагент) Тогда
			Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.НоменклатураПоклажедателя, "БезХарактеристики") Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатураПоклажедателя.Характеристика) Тогда
					Проверка = Ложь;
				Иначе
					СтрокаТЧ.Характеристика = СтрокаТЧ.НоменклатураПоклажедателя.Характеристика;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Проверка;
	
КонецФункции


#Иначе
#КонецЕсли