Функция ОбработатьШтрихкодНовая(Штрихкод) Экспорт    
	
	ДанныеШтрихкода = ПолучитьДанныеШтрихкодаИзКэша(Штрихкод);
	
	Если ДанныеШтрихкода=Неопределено Тогда
	
		ДанныеШтрихкода = вмс_ОбработкаШтрихкодовСервер.ОбработатьШтрихкодНовая(Штрихкод);
		
		ПоместитьДанныеШтрихкодаВКэш(Штрихкод, ДанныеШтрихкода);
		
	КонецЕсли;
	
	Возврат ДанныеШтрихкода;
	
КонецФункции

Функция ПолучитьДанныеШтрихкодаИзКэша(Штрихкод) Экспорт
	
	Возврат ПолучитьКэшДанныхШтрихкодов()[Штрихкод];
	
КонецФункции

Функция ПоместитьДанныеШтрихкодаВКэш(Штрихкод, ДанныеШтрихкода) Экспорт
	
	ПолучитьКэшДанныхШтрихкодов()[Штрихкод] = ДанныеШтрихкода;
	
КонецФункции

Функция ПолучитьКэшДанныхШтрихкодов() Экспорт
	
	КэшДанныхШтрихкодов = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрПриложения("КэшДанныхШтрихкодов");
	
	Если КэшДанныхШтрихкодов=Неопределено Тогда
		
		КэшДанныхШтрихкодов = Новый Соответствие;
		вмс_ОбщегоНазначенияКлиентСервер.УстановитьПараметрПриложения("КэшДанныхШтрихкодов", КэшДанныхШтрихкодов);
		
	КонецЕсли;
	
	Возврат КэшДанныхШтрихкодов;
	
КонецФункции

Функция УдалитьДанныеШтрихкодаИзКэша(Штрихкод) Экспорт
	
	ПолучитьКэшДанныхШтрихкодов().Удалить(Штрихкод);
	
КонецФункции