&НаКлиенте
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Перем ОбщегоНазначенияВызовСервера, РаботаСФормамиКлиентСервер;
	
	Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
		ОбщегоНазначенияВызовСервера = глОбщийМодуль("ОбщегоНазначенияВызовСервера");
		РаботаСФормамиКлиентСервер = глОбщийМодуль("РаботаСФормамиКлиентСервер");
		ИмяМодуляУправлениеСвойствамиВызовСервера = ОбщегоНазначенияВызовСервера.ПолучитьФактическоеИмяОбщегоМодуля("УправлениеСвойствамиСервер");
		Если РаботаСФормамиКлиентСервер.ПроверитьНаличиеСлужебногоСерверногоМетодаФормы(ВладелецФормы) Тогда
			ПрограммныйКод = "";
			ПрограммныйКод = ПрограммныйКод + ИмяМодуляУправлениеСвойствамиВызовСервера + ".СохранитьЗначенияДополнительныхРеквизитов(Форма, Форма.Объект);" + Символы.ПС;
			ПрограммныйКод = ПрограммныйКод + ИмяМодуляУправлениеСвойствамиВызовСервера + ".ОбновитьДополнительныеРеквизиты(Форма);";
			ВладелецФормы.СлужебнаяФункцияВызовСервера(ПрограммныйКод);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
