
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.Владелец = ПолучитьСсылкуНаВладельца(Запись.ТипОбъекта, Запись.УникальныйИдентификатор); 
	КонецЦикла;
	
КонецПроцедуры 

Функция ПолучитьСсылкуНаВладельца(ТипОбъекта, GUID)
	
	Если ЗначениеЗаполнено(ТипОбъекта) И ТипЗнч(ТипОбъекта) = Тип("Строка") И
	ЗначениеЗаполнено(GUID) И ТипЗнч(GUID) = Тип("УникальныйИдентификатор") Тогда
		МассивGUID = Новый Массив;
		МассивGUID.Добавить(GUID);
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ЗНАЧЕНИЕ(" + ТипОбъекта + ".ПустаяСсылка) КАК Ссылка"; 
		Попытка
			Результат = Запрос.Выполнить().Выбрать(); 
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		Результат.Следующий();
		СсылкаНаОбъект = Новый(ТипЗнч(Результат.Ссылка), МассивGUID);
		Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			Возврат СсылкаНаОбъект;
		Иначе	
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции


