
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекст();
	УстановитьЗаголовок();
	ЗаполнитьСпискиВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	ЗаписатьНаСервере();
	Оповестить("КонтурМаркировка_МобильноеУстройство_Изменено", Ссылка);
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОписаниеМобильногоУстройстваПоКонтексту()
	
	Результат = МодульОбъекта().Новый_МобильноеУстройство();
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ОписаниеМобильногоУстройства = ОписаниеМобильногоУстройстваПоКонтексту();
	
	МодульОбъекта().МобильноеУстройство_Записать(ОписаниеМобильногоУстройства);
	
	Ссылка = ОписаниеМобильногоУстройства.Ссылка;
	ВерсияДанных = ОписаниеМобильногоУстройства.ВерсияДанных;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекст()
	
	Параметры.Свойство("Ссылка", Ссылка);
	Параметры.Свойство("СсылкаДляКопирования", СсылкаДляКопирования);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ОписаниеМобильногоУстройства = МодульОбъекта().МобильноеУстройство_Прочитать(Ссылка);
	ИначеЕсли ЗначениеЗаполнено(СсылкаДляКопирования) Тогда
		ОписаниеМобильногоУстройства = МодульОбъекта().МобильноеУстройство_Прочитать(СсылкаДляКопирования);
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеМобильногоУстройства, , "Ссылка");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		СтрокаЗаголовка = СокрЛП(Ссылка);
		
	ИначеЕсли ЗначениеЗаполнено(СсылкаДляКопирования) Тогда
		
		СтрокаЗаголовка = НСтр("ru = 'Копирование'");
		
	Иначе
		
		СтрокаЗаголовка = НСтр("ru = 'Создание'");
		
	КонецЕсли;
	
	Заголовок = МодульОбъекта().ПараметрыВСтроку(НСтр(
	"ru = 'Мобильное устройство: %1'"), СтрокаЗаголовка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	СписокВыбора = Элементы.Статус.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_СтатусыМобильногоУстройства();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
	СписокВыбора = Элементы.СпособПолученияДокументов.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_СпособыПолученияДокументовМобильнымУстройством();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

// #КонецОбласти