#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем РК;
Перем ТипыВводаКоличества;
Перем ПустойЭлементВывода;
Перем ПустоеПолеОбработки;

Функция Инициализировать() Экспорт
	
	//добавим предка, чтобы не определять все методы и этапы ввода,
	//а унаследовать их от стандартного сборщика
	Если Интерфейс.МодульПодключен("СборщикДанныхСтандартный") Тогда
		СборщикДанныхСтандартный = Интерфейс.Модуль("СборщикДанныхСтандартный");
	Иначе
		СборщикДанныхСтандартный = Обработки.вмс_СерверУправляемыйМодульСборщикДанныхСтандартный.Создать();
	КонецЕсли;
	Интерфейс.ДобавитьРеальныйМодуль(СборщикДанныхСтандартный);
	
	//укажем реализуемые в этом модуле методы
	ИменаРеализуемыхМетодов =
		"УстановитьСвойстваПолейПоУмолчанию,
		|УстановитьДоступныеПоля,
		|УстановитьДополнительныеПоля,
		|ПриЗавершенииИнициализацииПолей,
		|ИнициализироватьДанные,
		|ЕстьИзменениеДанных,
		|РазобратьВходящиеОбъекты,
		|НачатьТранзакциюСборщика,
		|ЗафиксироватьТранзакциюСборщика,
		|ОтменитьТранзакциюСборщика,
		|ОбновитьДанныеТранзакцииОбработки,
		|ПослеЗавершенияТранзакцииВвода,
		|ПослеЗавершенияВвода,
		|ЗаполнитьДанныеПолей,
		|ЗаполнитьОбщиеДанныеПолей,
		|ЗаполнитьПредставлениеДанныхПолей,
		|ЗаполнитьТаблицы,
		|РезультатАнализаЗаполненияПолейДанных,
		|ОчиститьДанныеПолей,
		|СохранитьСостояниеОбработки,
		|ВосстановитьСостояниеОбработки,
		|ВыполнитьЗавершениеОперации";

	Интерфейс.УстановитьРеализациюМетодов(ИменаРеализуемыхМетодов, ЭтотОбъект);
	
	//инициализируем этапы ввода данных
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_НачалоВвода", "НачалоВвода");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ОбработкаВходящихДанных_СборщикДанныхТоваров", "ОбработкаВходящихДанных");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ОбработкаВходящихДанныхПолей", "ОбработкаВходящихДанныхПолей");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ОбработкаВходящихДанныхПолей_Контейнеры", "ОбработкаВходящихДанныхПолей");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ПроверитьВводДругогоТовара", "ЗаполнениеВведенныхДанныхПолей", "ЗаполнениеВведенныхДанныхПолей");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ОбработатьНеСохраненноеКоличество", "ОбработатьНеСохраненноеКоличество", "ЗаполнениеВведенныхДанныхПолей");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ПодобратьИнструкциюДляДанныхВвода", "ПодобратьИнструкциюДляДанныхВвода", "ЗаполнениеВведенныхДанныхПолей");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ОчиститьПоляВводаПриИзмененииИнструкции", "ОчиститьПоляВводаПриИзмененииИнструкции", "ПодобратьИнструкциюДляДанныхВвода");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ПроверкаВводаКонтейнераЦеликом", "ПроверкаВводаКонтейнераЦеликом", "ПодобратьИнструкциюДляДанныхВвода");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ПроверитьОтклонениеОтПлана", "ПроверитьОтклонениеОтПлана");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ПроверитьПревышениеКоличестваПоПлану", "ПроверкаСобранныхДанных");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_СохранениеДанных");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_КонецВвода");
	
	//инициализируем переменные модуля
	ПараметрыМодуля.Вставить("ТипыВводаКоличества", ТипыВводаКоличества);
	ПараметрыМодуля.Вставить("ДанныеСохранены", Ложь);
	ПараметрыМодуля.Вставить("ВводЗавершен", Ложь);
	ПараметрыМодуля.Вставить("АнимацияКнопкиДалееУстановлена", Истина);
	
	ПустойЭлементВывода = ПараметрыОбработки.ПустойЭлементВывода;
	ПустоеПолеОбработки = ПараметрыОбработки.ПустоеПолеОбработки;
	
	ИнициализироватьСвойстваОперации();
	
	ПараметрыМодуля.Вставить("ПоляОбработкиИнструкцийЗадания", НовыеПоляОбработкиИнструкцийЗадания());
	ПараметрыМодуля.Вставить("ПоляОбработкиИнструкцийЗаданияДляПоиска", Новый Соответствие);
	ПараметрыМодуля.Вставить("ИдентификаторИнструкцииПолейОбработки"); // идентификатор инструкции, настройки полей которой используются
	
	ИнициализироватьОбработчикиСобытийПолейОбработки();
	
КонецФункции

Функция ИнициализироватьОбработчикиСобытийПолейОбработки()
	УстановитьОбработчикиСобытийПолейОбработки(ПолеОбработки(Новый Структура("Имя, Ввод", "Серия",				Истина)),	Новый Структура("НачалоВыбора", НовыйОписаниеОповещения("ОбработчикНачалоВыбораСерии")));
	УстановитьОбработчикиСобытийПолейОбработки(ПолеОбработки(Новый Структура("Имя, Ввод", "КонтейнерПриемник",	Истина)),	Новый Структура("НачалоВыбора", НовыйОписаниеОповещения("ОбработчикНачалоВыбораКонтейнераПриемника")));
КонецФункции

//Различные варианты полей обработки
Функция НовыеПоляОбработкиИнструкцийЗадания() Экспорт
	
	ПоляОбработкиИнструкцийЗадания = Обработки.вмс_СерверУправляемыйМодульСтандартный.НовыеПоляОбработки();
	ПоляОбработкиИнструкцийЗадания.Колонки.Добавить("ИдентификаторИнструкции");
	ПоляОбработкиИнструкцийЗадания.Индексы.Добавить("ИдентификаторИнструкции");
	
	Возврат ПоляОбработкиИнструкцийЗадания;
	
КонецФункции

Функция УстановитьСвойстваПолейПоУмолчанию() Экспорт

	ТаблицаЗначенийСвойствПолейОперацииПоУмолчанию = вмс_СерверУправляемыеОперации.ТаблицаЗначенийСвойствПолейОперацииПоУмолчанию();
	РК.УстановитьЭлементыКоллекции(ПоляМодуля(), ТаблицаЗначенийСвойствПолейОперацииПоУмолчанию);

КонецФункции

Функция УстановитьДоступныеПоля() Экспорт
	
	УстановитьСвойстваПолейМодуля("Подсказка", Новый Структура("Использование", Истина));

	РеквизитыЗадания = Метаданные.Документы.вмс_ЗаданиеКладовщику.ТабличныеЧасти.Товары.Реквизиты;
	Для Каждого Реквизит Из РеквизитыЗадания Цикл
		ИмяРеквизита = Реквизит.Имя;
		Если ИмяРеквизита="Номенклатура" Тогда
			ИмяРеквизита = "Товар";
		КонецЕсли;
		
		СвойстваПоУмолчанию = Новый Структура;
		СвойстваПоУмолчанию.Вставить("Использование", Истина);
		УстановитьСвойстваПолейМодуля(ИмяРеквизита, СвойстваПоУмолчанию);
	КонецЦикла;

	ИмяТаблицыФакта = ПараметрыОбработки.ИмяТаблицыФакта;
	РеквизитыОперацииПоЯчейкам = Метаданные.Документы.вмс_ОперацияПоЯчейкам.ТабличныеЧасти[ИмяТаблицыФакта].Реквизиты;
	Для Каждого Реквизит Из РеквизитыОперацииПоЯчейкам Цикл
		ИмяРеквизита = Реквизит.Имя;
		Если ИмяРеквизита="Номенклатура" Тогда
			ИмяРеквизита = "Товар";
		КонецЕсли;

		СвойстваПоУмолчанию = Новый Структура;
		СвойстваПоУмолчанию.Вставить("ПутьКДаннымСохранения", "ОперацияПоЯчейкам." + ИмяТаблицыФакта + "." + ИмяРеквизита);
		СвойстваПоУмолчанию.Вставить("Использование", Истина);
		УстановитьСвойстваПолейМодуля(ИмяРеквизита, СвойстваПоУмолчанию);
	КонецЦикла;
	
	УстановитьСвойстваПолейМодуля("Количество, КоличествоРазмещено, КоличествоОтобрано", Новый Структура("Использование, ПутьКДаннымСохранения", Истина, "ОперацияПоЯчейкам." + ИмяТаблицыФакта + "." + "Количество"));
	УстановитьСвойстваПолейМодуля("КоличествоПлан",			Новый Структура("План, Ресурс, НачальноеЗначение, ЗначениеПоУмолчанию, ПустыеЗначения, ПутьКДаннымЗаполнения", Истина, Истина, 0, 0, 0, "Задание.Товары.КоличествоПлан"));
	УстановитьСвойстваПолейМодуля("КоличествоФактИтого",	Новый Структура("План, Ресурс, НачальноеЗначение, ЗначениеПоУмолчанию, ПустыеЗначения, ПутьКДаннымЗаполнения", Истина, Истина, 0, 0, 0, "Задание.Товары.КоличествоФактИтого"));
	
	УстановитьСвойстваПолейМодуля("Серия", Новый Структура("АвтоНачалоВыбора", Истина));
	
	//включим реквизиты полей
	Для Каждого ПолеМодуля Из ПоляМодуля() Цикл
		Если ПолеМодуля.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДаннымЗаполненияМассив = РК.ЗначениеВМассив(ПолеМодуля.ПутьКДаннымЗаполнения, ".");
		ПутьКДаннымЗаполненияРодителя = "";
		Для Каждого ЭлементПутиКДанным Из ПутьКДаннымЗаполненияМассив Цикл
			Если ПутьКДаннымЗаполненияРодителя <> "" Тогда
				ПутьКДаннымЗаполненияРодителя = ПутьКДаннымЗаполненияРодителя + ".";
			КонецЕсли;
			ПутьКДаннымЗаполненияРодителя = ПутьКДаннымЗаполненияРодителя + ЭлементПутиКДанным;
			Если ПолеМодуля.ПутьКДаннымЗаполнения=ПутьКДаннымЗаполненияРодителя Тогда
				Прервать;
			КонецЕсли;
			
			ПолеРодитель = ПолеМодуля(Новый Структура("ПутьКДаннымЗаполнения", ПутьКДаннымЗаполненияРодителя));
			Если ПолеРодитель <> ПустоеПолеОбработки И ПолеРодитель.Использование Тогда
				УстановитьСвойстваПолейМодуля(ПолеМодуля, "Использование", Истина);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецФункции

Функция УстановитьДополнительныеПоля() Экспорт

	ПоляВводаКоличеств = ПоляВводаКоличеств();
	Если НЕ ПолеМодуля("Количество").Использование Тогда
		//установим свойства обязательного поля "количество" по используемому полю количества
		Если ПоляВводаКоличеств.Количество() > 0 Тогда
			ПолеКоличества = ПоляВводаКоличеств[0];
			ПолеКоличества = ПолеМодуля(ПолеКоличества.Имя);
			Свойства = Новый Структура("Ресурс, Группа, ТипЗначения, ПутьКДаннымЗаполнения, ПутьКДаннымСохранения");
			ЗаполнитьЗначенияСвойств(Свойства, ПолеКоличества);
			УстановитьСвойстваПолейМодуля("Количество", Свойства);
		КонецЕсли;

		УстановитьСвойстваПолейМодуля("Количество", "Вывод", Ложь);
	КонецЕсли;
	УстановитьСвойстваПолейМодуля("Количество", "Использование, Сборка", Истина);

	УстановитьСвойстваПолейМодуля("КоличествоПлан, КоличествоФактИтого", Новый Структура("Использование", Истина));
	
	Если ПолеМодуля("КоличествоУчет") <> ПустоеПолеОбработки Тогда
		УстановитьСвойстваПолейМодуля("КоличествоУчет", Новый Структура("Вывод, Сборка, Ресурс, ПутьКДаннымЗаполнения, ЗначениеПоУмолчанию", Ложь, Истина, Истина, "Задание.Товары.КоличествоУчет", 0));
	КонецЕсли;
	
	//служебные поля для ввода количества
	КопируемыеСвойства = "Ввод, План, Сборка, Суффикс, ПорядокВвода";
	Для Каждого ПолеКоличества Из ПоляМодуля(Новый Структура("Группа, Использование", "Количество", Истина)) Цикл
		Группа = "Количество0";
		Свойства = Новый Структура("Ресурс, Группа, ТипЗначения, НачальноеЗначение, ЗначениеПоУмолчанию, " + КопируемыеСвойства,	Истина, Группа, Новый ОписаниеТипов("Число"), 0, 0);
		ЗаполнитьЗначенияСвойств(Свойства, ПолеКоличества, КопируемыеСвойства);
		Свойства.Вставить("Вывод", Ложь);
		УстановитьСвойстваПолейМодуля(Группа + ПолеКоличества.Суффикс, Свойства);

		Группа = "ТипВводаКоличества";
		Свойства = Новый Структура("Ресурс, Группа, НачальноеЗначение, ЗначениеПоУмолчанию, ТипЗначения, " + КопируемыеСвойства,					Истина, Группа, ТипыВводаКоличества.Установить, ТипыВводаКоличества.Установить, Новый ОписаниеТипов);
		ЗаполнитьЗначенияСвойств(Свойства, ПолеКоличества, КопируемыеСвойства);
		Свойства.Вставить("Вывод", Ложь);
		УстановитьСвойстваПолейМодуля(Группа + ПолеКоличества.Суффикс, Свойства);
		
		Группа = "ЗавершениеВводаКоличества";
		Свойства = Новый Структура("Ресурс, Группа, НачальноеЗначение, ЗначениеПоУмолчанию, ТипЗначения, " + КопируемыеСвойства,					Истина, Группа, Ложь, Ложь, Новый ОписаниеТипов("Булево"));
		ЗаполнитьЗначенияСвойств(Свойства, ПолеКоличества, КопируемыеСвойства);
		Свойства.Вставить("Вывод", Ложь);
		УстановитьСвойстваПолейМодуля(Свойства.Группа + ПолеКоличества.Суффикс, Свойства);
	КонецЦикла;
	
	Если ПоляВводаКоличеств.Количество()=0 Тогда
		Если НЕ ПараметрыМодуля.АвтоПереходКСледующейИнструкции Тогда
			//для возможности подтверждения количества, если количество не вводится
			УстановитьСвойстваПолейМодуля("ЗавершениеВводаКоличества", Новый Структура("Вывод, Ввод", Ложь, Истина));
		КонецЕсли;
	КонецЕсли;
	
	УстановитьСвойстваПолейМодуля("ИдентификаторИнструкцииЗаполнен",	Новый Структура("Вывод, План, Значение, ЗначениеПоУмолчанию, ПутьКДаннымЗаполнения",																	Ложь, Истина, Истина,	Ложь, "Задание.Товары.ИдентификаторИнструкцииЗаполнен"));
	УстановитьСвойстваПолейМодуля("ИдентификаторИнструкции",			Новый Структура("Вывод, План, Сборка, ПустыеЗначения, НачальноеЗначение, ЗначениеПоУмолчанию, ПутьКДаннымЗаполнения, ПутьКДаннымСохранения",			Ложь, Истина, Истина, Неопределено, Неопределено, 0, "Задание.Товары.ИдентификаторИнструкции",			"ОперацияПоЯчейкам." + ПараметрыОбработки.ИмяТаблицыФакта + ".ИдентификаторИнструкции"));
	УстановитьСвойстваПолейМодуля("ИдентификаторИнструкцииДляПоиска",	Новый Структура("Вывод, План, Сборка, ПустыеЗначения, НачальноеЗначение, ЗначениеПоУмолчанию, ПутьКДаннымЗаполнения, ПутьКДаннымСохранения, Значение",	Ложь, Истина,	Ложь, Неопределено, Неопределено, 0, "Задание.Товары.ИдентификаторИнструкцииДляПоиска", "", 0));

КонецФункции

Функция ПриЗавершенииИнициализацииПолей() Экспорт
	
	СборщикДанныхСтандартный.ПриЗавершенииИнициализацииПолей();
	
	ДобавитьКнопкуДалее();
	ДобавитьОбработчикиСобытийПолей();
	
	НастроитьПутиКДаннымЗаполненияПолейТаблицыПланФакт();
	ЗаполнитьПоляОбработкиИнструкцийЗаданияПоУмолчанию();
	
КонецФункции

Функция ДобавитьКнопкуДалее()

	ПрефиксСтраницОперации = Обработки.вмс_СерверУправляемыйМодульОперацияПоЯчейкамУниверсальная.ПрефиксСтраницОперации();
	ПорядокВывода = 0;
	Для Каждого Поле Из ПоляОбработки(Новый Структура("Вывод, Страница", Истина, ПрефиксСтраницОперации + "ВводДанных")) Цикл
		Если Поле.ПорядокВывода > ПорядокВывода Тогда
			ПорядокВывода = Поле.ПорядокВывода;
		КонецЕсли;
	КонецЦикла;
	
	ПорядокВывода = ПорядокВывода + 1;
	УстановитьСвойстваЭлементовВывода("КнопкаДалее",	Новый Структура("ТипЭлемента, СочетаниеКлавиш, Заголовок, РастягиватьПоГоризонтали, ГоризонтальноеПоложениеВГруппе, КнопкаПоУмолчанию", "КнопкаФормы", 13, "Далее", Истина, "Центр", Истина));
	УстановитьСвойстваЭлементовВывода("КнопкаДалее",	Новый Структура("ЦветФона, ЦветТекста, Шрифт", Новый Цвет(62, 175, 118), Новый Цвет(255, 255, 255), Новый Шрифт(,,Истина,)));
	УстановитьСвойстваЭлементовВывода("КнопкаДалее",	Новый Структура("Номер", ПорядокВывода));
	УстановитьОбработчикиСобытийЭлементовВывода("КнопкаДалее", Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикКнопкиДальше")));
	
	УстановитьСвойстваЭлементовВывода("Форма", Новый Структура("ПоведениеКлавишиEnter", "КнопкаПоУмолчанию"));
	
КонецФункции

Функция ДобавитьОбработчикиСобытийПолей()

	/////////////////////////////////////////////////////
	ОписаниеОповещенияНачалоВыбора = Неопределено;
	ПоляКонтейнеров = ПоляОбработки("Контейнер, КонтейнерИсточник, КонтейнерПриемник");
	
	Для Каждого ПолеКонтейнера Из ПоляКонтейнеров Цикл
		Если НЕ ПолеКонтейнера.Вывод Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПолеКонтейнера.События.Свойство("НачалоВыбора", ОписаниеОповещенияНачалоВыбора) Тогда
			СтандартныйМодуль.ДобавитьКомандуКонтекстногоМенюПоля(ПолеКонтейнера, "Выбрать", "Печать", ОписаниеОповещенияНачалоВыбора);
		КонецЕсли;
	КонецЦикла;
	
	/////////////////////////////////////////////////////
	СтандартныйМодуль.ДобавитьКомандуКонтекстногоМенюПоля(Новый Структура("Имя, Вывод", "Товар", Истина), "Открыть", "Открыть", НовыйОписаниеОповещения("ОбработчикКомандыОткрытьКарточкуТовара"));
	
КонецФункции

Функция ИнициализироватьДанные() Экспорт
	
	ИнициализироватьТаблицуПланФакт();
	ИнициализироватьТаблицуФакт();
	ИнициализироватьТаблицуМодификацииПолейИнструкцийЗадания();
	ИнициализироватьДанныеТранзакции();

КонецФункции

Функция ИнициализироватьДанныеТранзакции()
	
	//инструкции (строки) таблицы план-факт, созданные в транзакции
	//чтобы не копировать при начале и завершении каждой транзакции всю таблицу так, как это ресурсоемко
	//в случае отмены транзакции инструкции, созданные в ней, будут удалены
	ДанныеТранзакции.Вставить("НовыеИдентификаторыИнструкций", Новый Массив);
	
КонецФункции


Функция ИнициализироватьСвойстваОперации()
	
	Задание = ПараметрыОбработки.Задание;

	ПараметрыМодуля.Вставить("ПревышениеКоличестваПоПлану", "Запретить");
	ПараметрыМодуля.Вставить("АвтоПереходКСледующейИнструкции", Ложь);
	ПараметрыМодуля.Вставить("РазрешитьВводДанныхБезПлана", Ложь);
	ПараметрыМодуля.Вставить("СоздаватьНовуюСерию", Ложь);
	
	Если ЗначениеЗаполнено(Задание.Правило) Тогда
		Правило = Задание.Правило.ПолучитьОбъект();
		Правило.Прочитать();
		ПараметрыМодуля.СоздаватьНовуюСерию = НЕ Правило.ПодбиратьЯчейкиОтправители;
	КонецЕсли;
	
	//ТУ_КС для совместимости+
	Попытка
		Если Задание.РазрешитьПревышениеКоличества Тогда
			ПараметрыМодуля.ПревышениеКоличестваПоПлану = "Предупредить";
		КонецЕсли;
	Исключение
	КонецПопытки;
	//ТУ_КС для совместимости-

	СвойстваОперации = СвойстваОперации(Задание);
	Если СвойстваОперации.Свойство("ПревышениеКоличестваПоПлану") Тогда
		ПараметрыМодуля.ПревышениеКоличестваПоПлану = СвойстваОперации.ПревышениеКоличестваПоПлану;
	Иначе
		Если СвойстваОперации.Свойство("РазрешитьПревышениеКоличестваТовара") И СвойстваОперации.РазрешитьПревышениеКоличестваТовара=Истина Тогда
			ПараметрыМодуля.ПревышениеКоличестваПоПлану = "Предупредить";
		КонецЕсли;
	КонецЕсли;
	
	Если СвойстваОперации.Свойство("АвтоПереходКСледующейИнструкции") Тогда
		ПараметрыМодуля.АвтоПереходКСледующейИнструкции = СвойстваОперации.АвтоПереходКСледующейИнструкции=Истина;
	КонецЕсли;
		
	Если СвойстваОперации.Свойство("РазрешитьВводДанныхБезПлана") Тогда
		ПараметрыМодуля.РазрешитьВводДанныхБезПлана = СвойстваОперации.РазрешитьВводДанныхБезПлана=Истина;
	Иначе
		Если СвойстваОперации.Свойство("РазрешитьВводОтсутствующегоТовара") И СвойстваОперации.РазрешитьВводОтсутствующегоТовара=Истина Тогда
			ПараметрыМодуля.РазрешитьВводДанныхБезПлана = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции

Функция СвойстваОперации(Задание)
	
	СвойстваОперации = Новый Структура;
	Свойства = Задание.ДополнительныеРеквизиты.ВыгрузитьКолонку("Свойство");
	Если Свойства.Количество()=0 Тогда
		Возврат СвойстваОперации;
	КонецЕсли;
	
	ТаблицаРеквизитовСвойств = вмс_ОбщегоНазначенияСервер.ПолучитьРеквизитыОбъектов(Свойства, "Ссылка, Имя");
	
	Поиск = Новый Структура("Свойство");
	Для Каждого РеквизитыСвойства Из ТаблицаРеквизитовСвойств Цикл
		Поиск.Свойство = РеквизитыСвойства.Ссылка;
		ЗначениеСвойстваМассив = Задание.ДополнительныеРеквизиты.НайтиСтроки(Поиск);
		Если ЗначениеСвойстваМассив.Количество() > 0 Тогда
			СвойстваОперации.Вставить(РеквизитыСвойства.Имя, ЗначениеСвойстваМассив[0].Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СвойстваОперации;
	
КонецФункции

Функция ИнициализироватьТаблицуПланФакт()
	
	// настроим колонки таблицы
	ПоляИнструкцийМассив = Новый Массив;
	
	ТаблицаВычисленийЗначенийПолей = Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьТаблицыВычисленийЗначенийПолей(ПараметрыМодуля).ТаблицаВычисленийЗначенийПолей.Скопировать(Новый Структура("Путь", "Задание.Товары"));
	
	Для Каждого ЭлементВычисления Из ТаблицаВычисленийЗначенийПолей Цикл
		ИмяРеквизита = ЭлементВычисления.Имя;
		ПоляИнструкцийМассив.Добавить(ИмяРеквизита);
	КонецЦикла;
	
	РК.ДобавитьЭлементыКоллекции(ПоляИнструкцийМассив, "ПредставлениеТовара, Выполнен, НомерИнструкции, ИдентификаторИнструкции, ИдентификаторИнструкцииДляПоиска, КоличествоПлан, КоличествоФактИтогоВТаблице, КоличествоФактИтого, КоличествоФактЗаполнено, ИдентификаторИнструкцииЗаполненРесурс");
	Если ПараметрыОбработки.Инвентаризация Тогда
		РК.ДобавитьЭлементыКоллекции(ПоляИнструкцийМассив, "КоличествоУчет");
	КонецЕсли;
	РК.УдалитьДублиВМассиве(ПоляИнструкцийМассив);

	ТаблицаПланФакт = РК.НоваяТаблицаЗначений(ПоляИнструкцийМассив);
	ТаблицаПланФакт.Индексы.Добавить("ИдентификаторИнструкцииЗаполнен, ИдентификаторИнструкции");
	ТаблицаПланФакт.Индексы.Добавить("ИдентификаторИнструкцииДляПоиска");
	
	// настроим вывод таблицы на клиенте
	НастраиваемыеКолонкиВывода = "Контейнер, КонтейнерОтправитель, КонтейнерПриемник, Ячейка, ЯчейкаПриемник";

	ПоляВыводаНачальные = РК.ПересечениеМассивов(ПоляИнструкцийМассив, СписокПолейМодуля(Новый Структура("План, Вывод", Истина, Истина)));
	
	ПоляВывода = Новый Массив;
	Если ПоляВыводаНачальные.Найти("Товар") <> Неопределено Тогда
		ПоляВывода.Добавить("ПредставлениеТовара");
	КонецЕсли;
	
	РК.ДобавитьЭлементыКоллекции(ПоляВывода, РК.ПересечениеМассивов(ПоляВыводаНачальные, НастраиваемыеКолонкиВывода));
	
	Если ПоляВыводаНачальные.Найти("КоличествоПлан") <> Неопределено Тогда
		РК.ДобавитьЭлементыКоллекции(ПоляВывода, "КоличествоПлан");
		РК.ДобавитьЭлементыКоллекции(ПоляВывода, "КоличествоФактИтогоВТаблице");
	КонецЕсли;

	РК.УдалитьДублиВМассиве(ПоляВывода);

	ПараметрыТаблицыПланФакт = УстановитьТаблицуОбработки("ТаблицаПланФакт", ТаблицаПланФакт, Истина, ПоляВывода);
	ПараметрыТаблицыПланФакт.Вставить("ИдентификаторНовойИнструкции", 1);
	Ресурсы = Новый Структура("КоличествоПлан, КоличествоФактИтого, КоличествоФактЗаполнено, ИдентификаторИнструкцииЗаполненРесурс", 0, 0, 0, 0);
	ПараметрыТаблицыПланФакт.Ресурсы = Ресурсы;
	
КонецФункции

Функция НастроитьПутиКДаннымЗаполненияПолейТаблицыПланФакт()
	
	ПутиКДаннымЗаполненияПолей = ПрочитатьПутиКДаннымПолей("ПутьКДаннымЗаполнения", Новый Структура("Использование", Истина));
	ТаблицаПутейПолей = ПутиКДаннымЗаполненияПолей.Скопировать(Новый Структура("ПутьРеквизита, Раунд", "Задание.Товары", 1));
	ТаблицаПутейПолей.Свернуть("ИмяПоля");
	ИменаПолей = ТаблицаПутейПолей.ВыгрузитьКолонку("ИмяПоля");
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		ПутиКДаннымЗаполненияПоля = ПутиКДаннымЗаполненияПолей.НайтиСтроки(Новый Структура("ИмяПоля", ИмяПоля));
		Для Каждого ПутьКДаннымЗаполненияПоля Из ПутиКДаннымЗаполненияПоля Цикл
			ПутьКДаннымЗаполненияПоля.Поиск = ПутьКДаннымЗаполненияПоля.ИмяПоля="ИдентификаторИнструкцииДляПоиска";
		КонецЦикла;
	КонецЦикла;
	
	ЗаписатьПутиКДаннымПолей("ПутьКДаннымЗаполнения", ПутиКДаннымЗаполненияПолей);
	
КонецФункции

Функция ИнициализироватьТаблицуФакт()
	
	ИмяТаблицыФакта = ПараметрыОбработки.ИмяТаблицыФакта;
	
	ПутиКДаннымСохраненияПолей = ПрочитатьПутиКДаннымПолей("ПутьКДаннымСохранения", Новый Структура("Сборка, Ресурс", Истина, Ложь)).Скопировать(Новый Структура("ПутьРеквизита", "ОперацияПоЯчейкам." + ИмяТаблицыФакта));
	ПоляФакта = РК.ВыгрузитьЗначенияКолонкиКоллекции(ПутиКДаннымСохраненияПолей, "ИмяРеквизита");
	РК.ДобавитьЭлементыКоллекции(ПоляФакта, "ПредставлениеТовара, ИдентификаторИнструкцииЗаполнен, ИдентификаторИнструкции, ИдентификаторИнструкцииДляПоиска, КоличествоФакт");

	//
	НастраиваемыеКолонкиВывода = "Контейнер, КонтейнерОтправитель, КонтейнерПриемник, Ячейка, ЯчейкаПриемник";
	ПоляВывода = Новый Массив;
	ПутиКДаннымСохраненияПолей = ПрочитатьПутиКДаннымПолей("ПутьКДаннымСохранения", Новый Структура("Сборка, Вывод", Истина, Истина)).Скопировать(Новый Структура("ПутьРеквизита", "ОперацияПоЯчейкам." + ИмяТаблицыФакта));
	ПоляФактаВывод = РК.ВыгрузитьЗначенияКолонкиКоллекции(ПутиКДаннымСохраненияПолей, "ИмяРеквизита");
	РК.ДобавитьЭлементыКоллекции(ПоляВывода, РК.ПересечениеМассивов(ПоляФактаВывод, НастраиваемыеКолонкиВывода));
	Если ПоляФактаВывод.Найти("Товар") <> Неопределено Тогда
		РК.ДобавитьЭлементыКоллекции(ПоляВывода, "ПредставлениеТовара");
	КонецЕсли;
	Если ПоляФактаВывод.Найти("Количество") <> Неопределено Тогда
		РК.ДобавитьЭлементыКоллекции(ПоляВывода, "КоличествоФакт");
	КонецЕсли;
	
	ПутиКДаннымСохраненияПолей = ПрочитатьПутиКДаннымПолей("ПутьКДаннымСохранения", Новый Структура("Сборка, Ресурс", Истина, Ложь)).Скопировать(Новый Структура("ПутьРеквизита", "ОперацияПоЯчейкам." + ИмяТаблицыФакта));
	ПутиКДаннымСохраненияПолей.Колонки.Удалить("Поле");

	ПараметрыТаблицыФакт = УстановитьТаблицуОбработки("ТаблицаФакт", ПоляФакта, Истина, ПоляВывода);
	ПараметрыТаблицыФакт.Ресурсы = Новый Структура("КоличествоФакт", 0);
	ПараметрыТаблицыФакт.Вставить("ПутиКДаннымСохраненияПолей", ПутиКДаннымСохраненияПолей);
	
КонецФункции

Функция ИнициализироватьТаблицуМодификацииПолейИнструкцийЗадания()
	
	ТаблицаМодификацииПолейИнструкцийЗадания = РК.НоваяТаблицаЗначений("ИдентификаторИнструкции, ИмяПоля, ИмяСвойства, ЗначениеСвойства");
	ТаблицаМодификацииПолейИнструкцийЗадания.Индексы.Добавить("ИдентификаторИнструкции, ИмяПоля");
	УстановитьТаблицуОбработки("ТаблицаМодификацииПолейИнструкцийЗадания", ТаблицаМодификацииПолейИнструкцийЗадания, Ложь);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////
//
//						Настройки полей для строк задания+
//

Функция ЗаполнитьТаблицуМодификацииПолейИнструкцийЗадания(ИдентификаторыИнструкцийЗадания, МодификацияПолейИнструкцийЗаданияДляЗагрузки)
	
	Перем ОписаниеСвойстваПоля;
	
	МетаОписаниеСвойстваПоля = "ТипЗначения, МожноВключить";
	ОТБулево = Новый ОписаниеТипов("Булево");
	СвойстваПоля = Новый Структура;
	СвойстваПоля.Вставить("План",	Новый Структура(МетаОписаниеСвойстваПоля, ОТБулево, Ложь));
	СвойстваПоля.Вставить("Ввод",	Новый Структура(МетаОписаниеСвойстваПоля, ОТБулево, Ложь));
	СвойстваПоля.Вставить("Вывод",	Новый Структура(МетаОписаниеСвойстваПоля, ОТБулево, Ложь));
	СвойстваПоля.Вставить("ОбязательныйВвод", Новый Структура(МетаОписаниеСвойстваПоля, ОТБулево, Истина));
	СвойстваПоля.Вставить("ОбязательноеЗаполнение", Новый Структура(МетаОписаниеСвойстваПоля, ОТБулево, Истина));
	
	ТаблицаМодификацииПолейИнструкцийЗадания = ДанныеОбработки.Таблицы.ТаблицаМодификацииПолейИнструкцийЗадания;
	
	ОтборПоИдентификатору = Новый Структура("ИдентификаторИнструкции");
	Для Каждого ИдентификаторИнструкцииЗадания Из ИдентификаторыИнструкцийЗадания Цикл
		ОтборПоИдентификатору.ИдентификаторИнструкции = ИдентификаторИнструкцииЗадания;
		Для Каждого МодификацияПоляИнструкцииЗадания Из ТаблицаМодификацииПолейИнструкцийЗадания.НайтиСтроки(ОтборПоИдентификатору) Цикл
			ТаблицаМодификацииПолейИнструкцийЗадания.Удалить(МодификацияПоляИнструкцииЗадания);
		КонецЦикла;
		
		Если МодификацияПолейИнструкцийЗаданияДляЗагрузки=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого МодификацияПоляИнструкцииЗаданияДляЗагрузки Из МодификацияПолейИнструкцийЗаданияДляЗагрузки.НайтиСтроки(ОтборПоИдентификатору) Цикл
			Поле = ПолеМодуля(МодификацияПоляИнструкцииЗаданияДляЗагрузки.ИмяПоля);
			Если Поле=ПустоеПолеОбработки Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяСвойства = МодификацияПоляИнструкцииЗаданияДляЗагрузки.ИмяСвойства;
			Если НЕ СвойстваПоля.Свойство(ИмяСвойства, ОписаниеСвойстваПоля) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОписаниеСвойстваПоля.МожноВключить=Ложь И Поле[ИмяСвойства]=Ложь Тогда
				Продолжить;
			КонецЕсли;

			МодификацияПоляИнструкцииЗадания = ТаблицаМодификацииПолейИнструкцийЗадания.Добавить();
			ЗаполнитьЗначенияСвойств(МодификацияПоляИнструкцииЗадания, МодификацияПоляИнструкцииЗаданияДляЗагрузки);
			МодификацияПоляИнструкцииЗадания.ЗначениеСвойства = ОписаниеСвойстваПоля.ТипЗначения.ПривестиЗначение(МодификацияПоляИнструкцииЗаданияДляЗагрузки.ЗначениеСвойства);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПрочитатьМодификациюПолейИнструкцийЗадания(Задание)

	МодификацияПолейИнструкцийЗадания = Задание.НастройкаПолейСтрок.Выгрузить();
	Товары = Задание.Товары;
	УдалитьМодификации = Новый Массив;
	ПоискПоИдентификатору = Новый Структура("ИдентификаторИнструкции");
	Для Каждого МодификацияПоляИнструкцииЗадания Из МодификацияПолейИнструкцийЗадания Цикл
		Если МодификацияПоляИнструкцииЗадания.ИдентификаторИнструкции=0 Тогда
			УдалитьМодификации.Добавить(МодификацияПоляИнструкцииЗадания);
			Продолжить;
		КонецЕсли;
		
		ПоискПоИдентификатору.ИдентификаторИнструкции = МодификацияПоляИнструкцииЗадания.ИдентификаторИнструкции;
		Если Товары.НайтиСтроки(ПоискПоИдентификатору).Количество()=0 Тогда
			УдалитьМодификации.Добавить(МодификацияПоляИнструкцииЗадания);
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	РК.УдалитьЭлементыКоллекции(МодификацияПолейИнструкцийЗадания, УдалитьМодификации);
	
	Возврат МодификацияПолейИнструкцийЗадания;
	
КонецФункции

Функция РассчитатьМодификациюПолейНовыхИнструкцийЗаданий(ЗаданиеКладовщику, ДанныеДляРасчета)

	ТаблицаПланФакт = ДанныеОбработки.Таблицы.ТаблицаПланФакт;
	ЕстьКолонкаТовар = ТаблицаПланФакт.Колонки.Найти("Товар") <> Неопределено;
	
	Товары = ЗаданиеКладовщику.Товары;
	ТоварыВыгрузка = Товары.Выгрузить();
	Товары.Очистить();
	Для Каждого ЭлементДанныхДляРасчета Из ДанныеДляРасчета Цикл
		СтрокаПланФактДокументаЗадания = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПланФактДокументаЗадания, ЭлементДанныхДляРасчета);
		СтрокаПланФактДокументаЗадания.ИдентификаторИнструкции = ЭлементДанныхДляРасчета.ИдентификаторИнструкцииДляПоиска;
		Если ЕстьКолонкаТовар Тогда
			СтрокаПланФактДокументаЗадания.Номенклатура = ЭлементДанныхДляРасчета.Товар;
		КонецЕсли;
	КонецЦикла;
	
	Документы.вмс_ЗаданиеКладовщику.ЗаполнитьНастройкуПолейСтрокДокумента(ЗаданиеКладовщику);
	
	МодификацияПолейИнструкцийЗадания = ЗаданиеКладовщику.НастройкаПолейСтрок.Выгрузить();
	
	//для новых инструкций не отключать план по серии
	//при вводе серии инструкция будет заменена на заполненную
	УдалитьМодификации = Новый Массив;
	Для Каждого МодификацияПоля Из МодификацияПолейИнструкцийЗадания Цикл
		Если МодификацияПоля.ИмяПоля="Серия" И МодификацияПоля.ИмяСвойства="План" И МодификацияПоля.ЗначениеСвойства=Ложь Тогда
			УдалитьМодификации.Добавить(МодификацияПоля);
		КонецЕсли;
	КонецЦикла;
	РК.УдалитьЭлементыКоллекции(МодификацияПолейИнструкцийЗадания, УдалитьМодификации);
	
	Товары.Загрузить(ТоварыВыгрузка);

	Возврат МодификацияПолейИнструкцийЗадания;
	
КонецФункции

Функция ЗаполнитьПоляОбработкиИнструкцийЗаданияПоУмолчанию()
	
	ИдентификаторИнструкции = 0;
	РК.УдалитьЭлементыКоллекции(ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания, Новый Структура("ИдентификаторИнструкции", ИдентификаторИнструкции));
	
	Для Каждого Поле Из ПараметрыМодуля.ПоляОбработки Цикл
		
		ПолеИнструкцииПоУмолчанию = ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания.Добавить();
		ЗаполнитьЗначенияСвойств(ПолеИнструкцииПоУмолчанию, Поле);
		ПолеИнструкцииПоУмолчанию.ИдентификаторИнструкции = ИдентификаторИнструкции;
		
	КонецЦикла;
	
КонецФункции

Функция ЗаполнитьПоляОбработкиИнструкцийЗадания(ИдентификаторыИнструкций)
	
	ИдентификаторыИнструкцийМассив = РК.ЗначениеВМассив(ИдентификаторыИнструкций, , Ложь);
	
	ТаблицаМодификацииПолейИнструкцийЗадания = ДанныеОбработки.Таблицы.ТаблицаМодификацииПолейИнструкцийЗадания;
	ОтборМодификацийПоля = Новый Структура("ИдентификаторИнструкции, ИмяПоля");
	
	ПоляОбработкиИнструкцийЗадания = ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания;
	ПоляПоУмолчанию = ПоляОбработкиИнструкцийЗадания.НайтиСтроки(Новый Структура("ИдентификаторИнструкции", 0));
	
	ПоляОбработкиИнструкцийЗаданияДляПоиска = ПараметрыМодуля.ПоляОбработкиИнструкцийЗаданияДляПоиска;
	
	Для Каждого ИдентификаторИнструкции Из ИдентификаторыИнструкцийМассив Цикл
		
		Если ИдентификаторИнструкции=0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПоляОбработкиИнструкцииЗаданияДляПоиска = Новый Соответствие;
		
		РК.УдалитьЭлементыКоллекции(ПоляОбработкиИнструкцийЗадания, Новый Структура("ИдентификаторИнструкции", ИдентификаторИнструкции));
		
		ОтборМодификацийПоля.ИдентификаторИнструкции = ИдентификаторИнструкции;
		Для Каждого ПолеПоУмолчанию Из ПоляПоУмолчанию Цикл
			
			ПолеИнструкции = ПоляОбработкиИнструкцийЗадания.Добавить();
			ЗаполнитьЗначенияСвойств(ПолеИнструкции, ПолеПоУмолчанию);
			ПолеИнструкции.События = РК.СкопироватьСтруктуру(ПолеПоУмолчанию.События);
			ПолеИнструкции.ИдентификаторИнструкции = ИдентификаторИнструкции;
			
			ОтборМодификацийПоля.ИмяПоля = ПолеПоУмолчанию.Имя;
			МодификацииПоля = ТаблицаМодификацииПолейИнструкцийЗадания.НайтиСтроки(ОтборМодификацийПоля);
			Для Каждого МодификацияПоля Из МодификацииПоля Цикл
				ПолеИнструкции[МодификацияПоля.ИмяСвойства] = МодификацияПоля.ЗначениеСвойства;
			КонецЦикла;
			
			Если ПолеИнструкции.План И НЕ ПолеИнструкции.Ресурс И ПолеИнструкции.ПутьРодителяДанныхЗаполнения="Задание.Товары" Тогда
				ПоляОбработкиИнструкцииЗаданияДляПоиска[ПолеИнструкции.Имя] = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		ПоляОбработкиИнструкцийЗаданияДляПоиска[ИдентификаторИнструкции] = ПоляОбработкиИнструкцииЗаданияДляПоиска;
		
	КонецЦикла;
	
КонецФункции

Функция УстановитьПоляОбработкиДляИнструкцииЗадания(ИдентификаторИнструкции)
	
	Если ДанныеТранзакции.ИдентификаторИнструкцииПолейОбработки=ИдентификаторИнструкции Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеТранзакции.ИдентификаторИнструкцииПолейОбработки = ИдентификаторИнструкции;

	ПоляМодуля = ДанныеТранзакции.ПоляОбработки;
	
	ПоляИнструкции = ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания.НайтиСтроки(Новый Структура("ИдентификаторИнструкции", ИдентификаторИнструкции));
	
	ОтборПоля = Новый Структура("Имя");
	Для Каждого ПолеИнструкции Из ПоляИнструкции Цикл
		ОтборПоля.Имя = ПолеИнструкции.Имя;
		ПолеМодуляМассив = ПоляМодуля.НайтиСтроки(ОтборПоля);
		Если ПолеМодуляМассив.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеМодуля = ПолеМодуляМассив[0];
		ЗаполнитьЗначенияСвойств(ПолеМодуля, ПолеИнструкции, , "Значение, ЗначениеУстановлено");
	КонецЦикла;
	
	СборщикДанныхСтандартный.ЗаполнитьПоляАнализаДанных();
	
	Интерфейс.ПроанализироватьЗаполнениеПолейДанных();
	
	Возврат Истина;
	
КонецФункции

Функция ПодобратьИнструкциюДляДанныхВвода()

	ИдентификаторИнструкцииДляПоиска = ПолучитьЗначениеДанныхПоляМодуля("ИдентификаторИнструкцииДляПоиска");

	//переключим на другую инструкцию, если текущая не соответствует введенным данным
	
	Отбор = Новый Структура(ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.ЗаполненныеПоля);
	ЗаполнитьЗначенияСвойств(Отбор, ДанныеТранзакции.ВведенныеДанныеПолей);
	ИдентификаторИнструкции = НайтиИнструкцию(Отбор, ИдентификаторИнструкцииДляПоиска);
	
	Если ИдентификаторИнструкции=0 Тогда
		
		ИдентификаторИнструкции = ДобавитьДанныеИнструкцииДляДанныхВводаБезПлана();
		
	КонецЕсли;
	
	УстановитьЗначениеДанныхПоляМодуля("ИдентификаторИнструкцииДляПоиска", ИдентификаторИнструкции);
	Возврат ИдентификаторИнструкции <> 0;
	
КонецФункции

Функция ДобавитьДанныеИнструкцииДляДанныхВводаБезПлана()
	
	ДанныеОбновленияТаблицыПланФактТранзакции = ПараметрыТаблицы("ТаблицаПланФакт");
	
	ИдентификаторИнструкции = ДанныеОбновленияТаблицыПланФактТранзакции.ИдентификаторНовойИнструкции;
	ДанныеОбновленияТаблицыПланФактТранзакции.ИдентификаторНовойИнструкции = ДанныеОбновленияТаблицыПланФактТранзакции.ИдентификаторНовойИнструкции + 1;
	
	//за основу возьмем данные предыдущей инструкции
	ДанныеПолейИнструкции = РК.СкопироватьСтруктуру(ДанныеМодуля.ОбщиеДанныеПолей);
	ДанныеПолейИнструкции.КоличествоПлан = 0;
	ДанныеПолейИнструкции.КоличествоФактИтого = 0;
	
	//добавим данные текущего ввода
	ЗаполнитьЗначенияСвойств(ДанныеПолейИнструкции, ДанныеТранзакции.ПринятыеДанныеПолей);
	
	
	
	
	
	//////////////////////////////////////////////////////////////////////////////
	// Данные настройки полей инструкции
	ДанныеДляРасчетаМодификацииПолейИнструкцииЗадания = РК.СкопироватьСтруктуру(ДанныеПолейИнструкции);
	ДанныеДляРасчетаМодификацииПолейИнструкцииЗадания.Вставить("ИдентификаторИнструкцииДляПоиска", ИдентификаторИнструкции);
	
	ДанныеДляРасчетаМодификацииПолейИнструкцийЗаданий = Новый Массив;
	ДанныеДляРасчетаМодификацииПолейИнструкцийЗаданий.Добавить(ДанныеДляРасчетаМодификацииПолейИнструкцииЗадания);
	
	ИдентификаторыИнструкций = Новый Массив;
	ИдентификаторыИнструкций.Добавить(ИдентификаторИнструкции);
	
	МодификацияПолейНовыхИнструкцийЗаданий = РассчитатьМодификациюПолейНовыхИнструкцийЗаданий(ПараметрыОбработки.Задание, ДанныеДляРасчетаМодификацииПолейИнструкцийЗаданий);
	ЗаполнитьТаблицуМодификацииПолейИнструкцийЗадания(ИдентификаторыИнструкций, МодификацияПолейНовыхИнструкцийЗаданий);
	ЗаполнитьПоляОбработкиИнструкцийЗадания(ИдентификаторыИнструкций);
	
	ПолеСерияМассив = ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания.НайтиСтроки(Новый Структура("ИдентификаторИнструкции, Имя", ИдентификаторИнструкции, "Серия"));
	Если ПолеСерияМассив.Количество() > 0 Тогда
		ПолеСерия = ПолеСерияМассив[0];
		Если НЕ ПолеСерия.Ввод Тогда
			ДанныеПолейИнструкции.Серия = ПолеСерия.ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
	
	
	
	
	//////////////////////////////////////////////////////////////////////////////
	// Данные полей инструкции
	ТаблицаПланФакт = ДанныеОбработки.Таблицы.ТаблицаПланФакт;
	ДанныеОбновленияТаблицыПланФакт = ПараметрыТаблицы("ТаблицаПланФакт");
	
	ИнструкцияМассив = ТаблицаПланФакт.НайтиСтроки(Новый Структура("ИдентификаторИнструкцииДляПоиска", ИдентификаторИнструкции));
	Если ИнструкцияМассив.Количество()=0 Тогда
		Инструкция = ТаблицаПланФакт.Добавить();
	Иначе
		Инструкция = ИнструкцияМассив[0];
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Инструкция, ЗначенияПоУмолчаниюЭлементаТаблицыПланФакт());
	Инструкция.ИдентификаторИнструкцииДляПоиска = ИдентификаторИнструкции;
	ДополнительныеДанныеЭлементаТаблицы = ДополнительныеДанныеЭлементаТаблицы(ДанныеОбновленияТаблицыПланФакт, Инструкция);
	ДополнительныеДанныеЭлементаТаблицы.Идентификатор = ИдентификаторИнструкции;
	ДополнительныеДанныеЭлементаТаблицы.УдалятьПустые = Ложь;

	ДанныеПолейИнструкции = РК.УдалитьЭлементыКоллекции(РК.СкопироватьСтруктуру(ДанныеПолейИнструкции),
													"ИдентификаторИнструкции, ИдентификаторИнструкцииДляПоиска, ИдентификаторИнструкцииЗаполнен, Выполнен");
	ЗаполнитьЗначенияСвойств(Инструкция, ДанныеПолейИнструкции);
	
	ИзмененныеЭлементы = Новый Массив;
	ИзмененныеЭлементы.Добавить(ТаблицаПланФакт.Индекс(Инструкция));
	
	ЗарегистрироватьИзмененияЭлементовТаблицы(ДанныеОбновленияТаблицыПланФакт, ИзмененныеЭлементы);

	ОбновитьИзмененныеЭлементыТаблицыПланФакт(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт);
	
	ДанныеТранзакции.НовыеИдентификаторыИнструкций.Добавить(ИдентификаторИнструкции);
	
	Возврат ИдентификаторИнструкции;
	
КонецФункции

//
//						Настройки полей для строк задания-
//
////////////////////////////////////////////////////////////////////////////////////////////

Функция ЕстьИзменениеПланФакта()
	
	Если НЕ ДанныеОбработки.Таблицы.Свойство("ТаблицаПланФакт") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыТаблицыПланФакт = ПараметрыТаблицы("ТаблицаПланФакт");
	Возврат ПараметрыТаблицыПланФакт.ИзмененныеЭлементы.Количество() > 0 ИЛИ ПараметрыТаблицыПланФакт.УдаленныеЭлементы.Количество() > 0;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////
//
//						Этапы ввода+
//

#Область ЭтапыВвода

Функция ОбработчикЭтапаВводаДанных_НачалоВвода(Параметры, ДополнительныеПараметры) Экспорт
	
	СборщикДанныхСтандартный.ОбработчикЭтапаВводаДанных_НачалоВвода(Параметры, ДополнительныеПараметры);
	
	ПараметрыМодуля.ДанныеСохранены = Ложь;
	ПараметрыМодуля.ВводЗавершен = Ложь;
	ПараметрыМодуля.АнимацияКнопкиДалееУстановлена = Ложь;
	
	Интерфейс.ЗаполнитьТаблицы();
	УстановитьПоляОбработкиДляИнструкцииЗадания(0); //установим настройки полей по умолчанию
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ОбработкаВходящихДанных_СборщикДанныхТоваров(Параметры, ДополнительныеПараметры) Экспорт

	ВходящиеДанные = ДанныеТранзакции.ВходящиеДанные;
	
	Если НЕ ВходящиеДанные.Свойство("ВводитьКоличествоВОтдельнойТранзакции") Тогда
		ВходящиеДанные.Вставить("ВводитьКоличествоВОтдельнойТранзакции", Истина);
	КонецЕсли;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ОбработкаВходящихДанныхПолей(Параметры, ДополнительныеПараметры) Экспорт
	
	СборщикДанныхСтандартный.ЗаполнитьПринятыеДанныеПолей(ДанныеТранзакции.ВходящиеДанные);
	
	ОбработатьПринятыеДанныеКоличества();
	
КонецФункции

Функция ОбработатьПринятыеДанныеКоличества();
	
	ПринятыеДанныеПолей = ДанныеТранзакции.ПринятыеДанныеПолей;
	
	ВводКоличества = Ложь;
	Для Каждого ПолеВводаКоличества Из ПоляВводаКоличеств() Цикл
		
		Если НЕ ПринятыеДанныеПолей.Свойство(ПолеВводаКоличества.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоляТипВводаКоличества = "ТипВводаКоличества" + ПолеВводаКоличества.Суффикс;
		Если НЕ ПринятыеДанныеПолей.Свойство(ИмяПоляТипВводаКоличества) Тогда
			ПринятыеДанныеПолей.Вставить(ИмяПоляТипВводаКоличества, ПолучитьЗначениеСвойстваПоляМодуля(ИмяПоляТипВводаКоличества, "ЗначениеПоУмолчанию"));
		КонецЕсли;
		
		ВводКоличества = Истина;
		
	КонецЦикла;
	
	РезультатСепарации = ОтсепарироватьДанныеВводаКоличества(ПринятыеДанныеПолей);
	ДанныеТранзакции.ПринятыеДанныеБезПолейКоличества = РезультатСепарации.ПринятыеДанныеБезПолейКоличества;
	ДанныеТранзакции.ПринятыеДанныеПолейКоличества = РезультатСепарации.ПринятыеДанныеПолейКоличества;
	ДанныеТранзакции.ВводКоличества = ВводКоличества;
		
	Если ДанныеТранзакции.ВходящиеДанные.ВводитьКоличествоВОтдельнойТранзакции Тогда
		Если ДанныеТранзакции.ПринятыеДанныеПолейКоличества.Количество() > 0 И ДанныеТранзакции.ПринятыеДанныеБезПолейКоличества.Количество() > 0 Тогда
			// сначала введем основные поля без количества
			// количество введем в отдельной транзакции
			ДанныеТранзакции.ПринятыеДанныеПолей = ДанныеТранзакции.ПринятыеДанныеБезПолейКоличества;
			
			// также очистим количественные поля вводом пустых значений, чтобы к основным данным не примешались количества от прошлого ввода другого товара
			Для Каждого ПринятыеДанныеПоляКоличества Из ДанныеТранзакции.ПринятыеДанныеПолейКоличества Цикл
				ДанныеТранзакции.ПринятыеДанныеПолей.Вставить(ПринятыеДанныеПоляКоличества.Ключ, ПолучитьЗначениеСвойстваПоляМодуля(ПринятыеДанныеПоляКоличества.Ключ, "НачальноеЗначение"));
			КонецЦикла;
		Иначе
			ДанныеТранзакции.ВходящиеДанные.ВводитьКоличествоВОтдельнойТранзакции = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ОбработкаВходящихДанныхПолей_Контейнеры(Параметры, ДополнительныеПараметры) Экспорт
	
	ВходящиеДанные = ДанныеТранзакции.ВходящиеДанные;
	Если ВходящиеДанные.Свойство("ПередатьВПолеКонтейнера") И ВходящиеДанные.ПередатьВПолеКонтейнера Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ВходящиеДанные.Свойство("ВводСоставаКонтейнера") И ВходящиеДанные.ВводСоставаКонтейнера Тогда
		Возврат Ложь;
	КонецЕсли;

	ИдентификаторИнструкции = ПолучитьЗначениеДанныхПоляМодуля("ИдентификаторИнструкцииДляПоиска");
	СписокПолейВвода = ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания.Скопировать(Новый Структура("Ввод, ИдентификаторИнструкции", Истина, ИдентификаторИнструкции)).ВыгрузитьКолонку("Имя");
	ПоляВводаКонтейнеров = РК.ПересечениеМассивов(СписокПолейВвода, "Контейнер, КонтейнерПриемник");
	
	Если ПоляВводаКонтейнеров.Количество() <> 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПринятыеДанныеПолей = ДанныеТранзакции.ПринятыеДанныеПолей;

	ПринятыеПоляКонтейнера = Новый Массив;
	Для Каждого ПолеВводаКонтейнера Из ПоляВводаКонтейнеров Цикл
		Если ПринятыеДанныеПолей.Свойство(ПолеВводаКонтейнера) Тогда
			ПринятыеПоляКонтейнера.Добавить(ПолеВводаКонтейнера);
		КонецЕсли;
	КонецЦикла;

	Если ПринятыеПоляКонтейнера.Количество() <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПринятоеПолеКонтенера = ПринятыеПоляКонтейнера[0];
	Контейнер = ПринятыеДанныеПолей[ПринятоеПолеКонтенера];
	
	ПередатьВПоляКонтейнера = РК.ВычитаниеМассивов(ПоляВводаКонтейнеров, ПринятыеПоляКонтейнера);
	ПередатьВПолеКонтейнера = ПередатьВПоляКонтейнера[0];
	
	Интерфейс.ОстановитьВводДанных();
	ОО = НовыйОписаниеОповещения("ОбработчикДиалогаВводКонтейнера", , Новый Структура("ПередатьВПолеКонтейнера, Контейнер", ПередатьВПолеКонтейнера, Контейнер));
	
	Если ПередатьВПолеКонтейнера="Контейнер" Тогда
		Текст = "Переместить контейнер?";
	Иначе
		Текст = "Собрать контейнер?";
	КонецЕсли;
	
	ПоказатьДиалогНаКлиенте(ОО, Текст, "ДаНетОтмена");
	
КонецФункции

Функция ОбработчикДиалогаВводКонтейнера(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ="Да" Тогда
		Интерфейс.ОтменитьВводДанных();
		ВходящиеДанные = НовыеВходящиеДанные(Новый Структура(ДополнительныеПараметры.ПередатьВПолеКонтейнера, ДополнительныеПараметры.Контейнер));
		ВходящиеДанные.Вставить("ПередатьВПолеКонтейнера", Истина);
		ВвестиДанные(ВходящиеДанные);
	ИначеЕсли Ответ="Нет" Тогда
		Интерфейс.ВозобновитьВводДанных();
	Иначе
		Интерфейс.ОтменитьВводДанных();
	КонецЕсли;
	
КонецФункции

Функция ОтсепарироватьДанныеВводаКоличества(ПринятыеДанныеПолей)

	ПоляКоличества = Новый Массив;
	Для Каждого ПолеВводаКоличества Из ПоляВводаКоличеств() Цикл
		
		ИмяПоляКоличества = ПолеВводаКоличества.Имя;
		Если ПринятыеДанныеПолей.Свойство(ИмяПоляКоличества) Тогда
			ПоляКоличества.Добавить(ИмяПоляКоличества);
		КонецЕсли;
		
		ИмяПоляТипВводаКоличества = "ТипВводаКоличества" + ПолеВводаКоличества.Суффикс;
		Если ПринятыеДанныеПолей.Свойство(ИмяПоляТипВводаКоличества) Тогда
			ПоляКоличества.Добавить(ИмяПоляТипВводаКоличества);
		КонецЕсли;

		ИмяПоляЗавершениеВводаКоличества = "ЗавершениеВводаКоличества" + ПолеВводаКоличества.Суффикс;
		Если ПринятыеДанныеПолей.Свойство(ИмяПоляЗавершениеВводаКоличества) Тогда
			ПоляКоличества.Добавить(ИмяПоляЗавершениеВводаКоличества);
		КонецЕсли;
		
	КонецЦикла;
	
	ПринятыеДанныеБезПолейКоличества = РК.СкопироватьОбъект(ПринятыеДанныеПолей);
	ПринятыеДанныеПолейКоличества = Новый Структура;
	Для Каждого ПолеКоличества Из ПоляКоличества Цикл
		ПринятыеДанныеБезПолейКоличества.Удалить(ПолеКоличества);
		ПринятыеДанныеПолейКоличества.Вставить(ПолеКоличества, ПринятыеДанныеПолей[ПолеКоличества]);
	КонецЦикла;

	Результат = Новый Структура("ПринятыеДанныеБезПолейКоличества, ПринятыеДанныеПолейКоличества", ПринятыеДанныеБезПолейКоличества, ПринятыеДанныеПолейКоличества);
	Возврат Результат;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ПроверитьВводДругогоТовара(Параметры, ДополнительныеПараметры) Экспорт
	
	ТоварныеПоляМассив = СписокПолейМодуля(Новый Структура("Группа, Ввод", "Товар", Истина));
	ПринятыеДанныеПолей = ДанныеТранзакции.ПринятыеДанныеПолей;
	ПринятыеПоляМассив = РК.ВыгрузитьЗначенияКолонкиКоллекции(ПринятыеДанныеПолей, "Ключ");
	ПринятыеТоварныеПоляМассив = РК.ПересечениеМассивов(ТоварныеПоляМассив, ПринятыеПоляМассив);
	Если ПринятыеТоварныеПоляМассив.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПредыдущиеДанныеПолей = ДанныеМодуля.ОбщиеДанныеПолей;
	ВведенныеДанныеПолей = ДанныеТранзакции.ВведенныеДанныеПолей;
	
	//// Обработка поля "Серия"
	//Разрешить изменение серии с пустой на заполненную
	ИндексПоляСерии = ПринятыеТоварныеПоляМассив.Найти("Серия");
	Если ИндексПоляСерии <> Неопределено И НЕ ЗначениеЗаполнено(ПредыдущиеДанныеПолей["Серия"]) Тогда
		ПринятыеТоварныеПоляМассив.Удалить(ИндексПоляСерии);
		Если ПринятыеТоварныеПоляМассив.Количество()=0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	////
	
	ПринятыеТоварныеПоля = РК.МассивВСтроку(ПринятыеТоварныеПоляМассив);
	ДанныеТовара1 = Новый Структура(ПринятыеТоварныеПоля);
	ЗаполнитьЗначенияСвойств(ДанныеТовара1, ПредыдущиеДанныеПолей);

	ДанныеТовара2 = Новый Структура(ПринятыеТоварныеПоля);
	ЗаполнитьЗначенияСвойств(ДанныеТовара2, ВведенныеДанныеПолей);
	Если РК.СравнитьСтруктуры(ДанныеТовара1, ДанныеТовара2) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//введен другой товар
	//заполним поля по умолчанию
	ПроанализироватьДанныеПолей = Ложь;

	Если ПринятыеДанныеПолей.Свойство("Товар") Тогда
		Для Каждого ТоварноеПоле Из ПоляМодуля(Новый Структура("Группа", "Товар")) Цикл
			Если ПринятыеДанныеПолей.Свойство(ТоварноеПоле.Имя) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВведенныеДанныеПолей[ТоварноеПоле.Имя]=ТоварноеПоле.НачальноеЗначение Тогда
				Продолжить;
			КонецЕсли;
			
			ВведенныеДанныеПолей[ТоварноеПоле.Имя] = ТоварноеПоле.НачальноеЗначение;
			ПроанализироватьДанныеПолей = Истина;
		КонецЦикла;
	КонецЕсли;
	
	КоличествоПотеряно = Ложь;
	Для Каждого ПолеВводаКоличества Из ПоляВводаКоличеств() Цикл
		ИмяПоляКоличество = ПолеВводаКоличества.Имя;
		ИмяПоляЗавершениеВводаКоличества = "ЗавершениеВводаКоличества" + ПолеВводаКоличества.Суффикс;
		Если ВведенныеДанныеПолей[ИмяПоляКоличество]=ПолеВводаКоличества.НачальноеЗначение И ВведенныеДанныеПолей[ИмяПоляЗавершениеВводаКоличества]=Ложь Тогда
			//уже очищено
			Продолжить;
		КонецЕсли;

		Если ВведенныеДанныеПолей[ИмяПоляКоличество] <> ПолеВводаКоличества.НачальноеЗначение И
			(ВведенныеДанныеПолей["ТипВводаКоличества" + ПолеВводаКоличества.Суффикс]=ТипыВводаКоличества.Установить ИЛИ ВведенныеДанныеПолей[ИмяПоляКоличество] <> 0) Тогда
			КоличествоПотеряно = Истина;
		КонецЕсли;
		
		ВведенныеДанныеПолей[ИмяПоляКоличество] = ПолеВводаКоличества.НачальноеЗначение;
		ВведенныеДанныеПолей[ИмяПоляЗавершениеВводаКоличества] = Ложь;
		
		ПроанализироватьДанныеПолей = Истина;
	КонецЦикла;

	ДанныеВыполненияЭтапа = Параметры.Этап.ДанныеВыполненияЭтапа;
	Если КоличествоПотеряно И НЕ (ДанныеВыполненияЭтапа.Свойство("ЗапрошеноПодтверждение") И ДанныеВыполненияЭтапа.ЗапрошеноПодтверждение=Истина) Тогда
		ПоказатьДиалогНаКлиенте(НовыйОписаниеОповещения("ОбработчикВопросаПриВводеДанных"), "Вводится другой товар. Введенное количество не будет сохранено. Продолжить?", "ОКОтмена", , , , "Ошибка");
		ДанныеВыполненияЭтапа.Вставить("ЗапрошеноПодтверждение", Истина);

		// после ответа диалога вернемся в этот этап повторно (ПропускатьЭтап=Ложь)
		Интерфейс.ОстановитьВводДанных(Ложь);
		Возврат Ложь;
	КонецЕсли;
	
	Если ПроанализироватьДанныеПолей Тогда
		Интерфейс.ПроанализироватьЗаполнениеПолейДанных("ВведенныеДанныеПолей");
	КонецЕсли;
	
	Возврат ПроанализироватьДанныеПолей;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ОбработатьНеСохраненноеКоличество(Параметры, ДополнительныеПараметры) Экспорт
	
	Если НЕ ДанныеТранзакции.ВводКоличества Тогда
		
	КонецЕсли;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ПодобратьИнструкциюДляДанныхВвода(Параметры, ДополнительныеПараметры) Экспорт

	СписокВходящихПолейМассив = РК.ВыгрузитьЗначенияКолонкиКоллекции(ДанныеТранзакции.ВходящиеДанные.ДанныеПолей, "Ключ");
	СписокОсновныхПолейВводаМассив = СписокПолейМодуля(Новый Структура("Ввод, Ресурс", Истина, Ложь));
	СписокВходящихОсновныхПолейВводаМассив = РК.ПересечениеМассивов(СписокВходящихПолейМассив, СписокОсновныхПолейВводаМассив);
	Если СписокВходящихОсновныхПолейВводаМассив.Количество()=0 Тогда
		//основные поля не менялись, оставим предыдущую инструкцию
		Возврат Истина;
	КонецЕсли;
	
	Если ПодобратьИнструкциюДляДанныхВвода() Тогда
		ИдентификаторИнструкции = ПолучитьЗначениеДанныхПоляМодуля("ИдентификаторИнструкцииДляПоиска");
		УстановитьПоляОбработкиДляИнструкцииЗадания(ИдентификаторИнструкции);
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

//очистить ранее введенное поле для отображения подсказки при переходе к другой строке задания
Функция ОбработчикЭтапаВводаДанных_ОчиститьПоляВводаПриИзмененииИнструкции(Параметры, ДополнительныеПараметры) Экспорт

	ИдентификаторИнструкцииДляПоиска = ДанныеМодуля.СтатическиеДанныеПолей.ИдентификаторИнструкцииДляПоиска;
	ИдентификаторИнструкцииДляПоискаНовый = ДанныеТранзакции.СтатическиеДанныеПолей.ИдентификаторИнструкцииДляПоиска;
	
	Если ИдентификаторИнструкцииДляПоиска=ИдентификаторИнструкцииДляПоискаНовый Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВходящиеДанные = ДанныеТранзакции.ВходящиеДанные;
	Если ВходящиеДанные.Свойство("ВводСоставаКонтейнера") И ВходящиеДанные.ВводСоставаКонтейнера Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПринятыеДанныеПолей = ДанныеТранзакции.ПринятыеДанныеПолей;
	ВведенныеДанныеПолей = ДанныеТранзакции.ВведенныеДанныеПолей;
	ОбщиеДанныеПолей = ДанныеТранзакции.ОбщиеДанныеПолей;
	
	ЗаполненныеПоляВвода = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.ЗаполненныеПоляМассив;

	ЗапланированныеДанныеПолей = Новый Структура;
	Для Каждого ИмяПоля Из ЗаполненныеПоляВвода Цикл
		ЗапланированныеДанныеПолей.Вставить(ИмяПоля);
	КонецЦикла;

	Инструкция = ПолучитьИнструкциюПоИдентификатору(ИдентификаторИнструкцииДляПоискаНовый);
	Если Инструкция <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЗапланированныеДанныеПолей, Инструкция);
	КонецЕсли;
	
	ПоляДляОчистки = Новый Массив;
	
	Для Каждого ИмяПоляВвода Из ЗаполненныеПоляВвода Цикл
		Если ПринятыеДанныеПолей.Свойство(ИмяПоляВвода) Тогда
			//не очищать поля введенные только что
			Продолжить;
		КонецЕсли;
		
		Если ЗапланированныеДанныеПолей[ИмяПоляВвода]=Неопределено Тогда
			// нет в плане и в подсказке
			Продолжить;
		КонецЕсли;
		
		Если ВведенныеДанныеПолей[ИмяПоляВвода]=ЗапланированныеДанныеПолей[ИмяПоляВвода] Тогда
			Продолжить;
		КонецЕсли;
		
		ПоляДляОчистки.Добавить(ИмяПоляВвода);
	КонецЦикла;
	
	Если ПоляДляОчистки.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Интерфейс.ОчиститьДанныеПолей(ПоляДляОчистки, "ВведенныеДанныеПолей");
	Возврат Истина;
	
КонецФункции

Функция ПолучитьИнструкциюПоИдентификатору(Идентификатор)
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		ИнструкцияМассив = ДанныеОбработки.Таблицы.ТаблицаПланФакт.НайтиСтроки(Новый Структура("ИдентификаторИнструкцииДляПоиска", Идентификатор));
		Если ИнструкцияМассив.Количество() > 0 Тогда
			Возврат ИнструкцияМассив[0];
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ПроверкаВводаКонтейнераЦеликом(Параметры, ДополнительныеПараметры) Экспорт
	
	Перем Контейнер;
	
	Если НЕ (ДанныеТранзакции.ПринятыеДанныеПолей.Свойство("Контейнер", Контейнер) И ЗначениеЗаполнено(Контейнер)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПолеМодуля(Новый Структура("Имя, Ввод", "Товар", Истина))=ПустоеПолеОбработки Тогда
		// ввод контейнера целиком, без пересчета
		Возврат Ложь;
	КонецЕсли;

	ВходящиеДанные = ДанныеТранзакции.ВходящиеДанные;
	Если ВходящиеДанные.Свойство("ВводСоставаКонтейнера") И ВходящиеДанные.ВводСоставаКонтейнера=Истина Тогда
		// вводится состав контейнера
		Возврат Истина;
	КонецЕсли;
	
	Интерфейс.ОстановитьВводДанных();
	
	ОО = НовыйОписаниеОповещения("ОбработчикОтветаВводКонтейнераЦеликом", , Новый Структура("Контейнер", Контейнер));
	ПоказатьДиалогНаКлиенте(ОО, "Ввести контейнер целиком?", "ДаНетОтмена");
	
КонецФункции

Функция ОбработчикОтветаВводКонтейнераЦеликом(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ="Да" Тогда
		
		Интерфейс.ОтменитьВводДанных();
		
		ТаблицаСоставКонтейнера = ПолучитьСоставКонтейнера(ДополнительныеПараметры.Контейнер);
		ВвестиСоставКонтейнера(ТаблицаСоставКонтейнера);
		
	ИначеЕсли Ответ="Нет" Тогда
		
		Интерфейс.ВозобновитьВводДанных();
		
	Иначе
		
		Интерфейс.ОтменитьВводДанных();
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСоставКонтейнера(Контейнер)
	
	//ВходящиеПараметры = Новый Структура;
	//ВходящиеПараметры.Вставить("Контейнеры", Контейнер);
	//ВходящиеПараметры.Вставить("ИспользуемыеПоля", "Контейнер");
	//ТаблицаСоставКонтейнера = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ВходящиеПараметры);
	//ТаблицаСоставКонтейнера.Колонки.Удалить("Ячейка");
	
	//ТаблицаСоставКонтейнера = вмс_ПартионныйУчетСервер.ПолучитьВсеТоварыКонтейнеров(Контейнер);

	ИнформацияСоставаКонтейнеров = вмс_ПартионныйУчетСервер.ПолучитьИнформациюСоставаКонтейнеров(Контейнер);
	ТаблицаСоставКонтейнера = ИнформацияСоставаКонтейнеров.ТаблицаТоваровПоКонтейнерамСУчетомИерархии.Скопировать(Новый Структура("Контейнер", Контейнер));
	ТаблицаСоставКонтейнера.Колонки.КоличествоОстаток.Имя = "Количество";
	
	Возврат ТаблицаСоставКонтейнера;
	
КонецФункции

Функция ВвестиСоставКонтейнера(знач ТаблицаСоставКонтейнера)

	ТаблицаСоставКонтейнера = ТаблицаСоставКонтейнера.Скопировать();
	
	ИмяПоля = "Количество";
	ПолеКоличества = АктивноеПолеКоличества();
	Если ПолеКоличества <> Неопределено Тогда
 		Если ИмяПоля <> ПолеКоличества.Имя Тогда
			ИмяПоля = ПолеКоличества.Имя;
 			ТаблицаСоставКонтейнера.Колонки.Количество.Имя = ИмяПоля;
		КонецЕсли;
		
		ИмяПоляЗавершениеКоличества = "ЗавершениеВводаКоличества" + ПолеКоличества.Суффикс;
		ТаблицаСоставКонтейнера.Колонки.Добавить(ИмяПоляЗавершениеКоличества);
		ТаблицаСоставКонтейнера.ЗаполнитьЗначения(Истина, ИмяПоляЗавершениеКоличества);
	КонецЕсли;
	
	КолонкиТаблицы = РК.ПолучитьКолонкиКоллекции(ТаблицаСоставКонтейнера);
	
	СписокПолейВвода = ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания.Скопировать(Новый Структура("Ввод, ИдентификаторИнструкции", Истина, 0)).ВыгрузитьКолонку("Имя");
	
	ДоступныеКолонкиТаблицы = РК.ПересечениеМассивов(КолонкиТаблицы, СписокПолейВвода);
	ТаблицаСоставКонтейнера = ТаблицаСоставКонтейнера.Скопировать(, РК.МассивВСтроку(ДоступныеКолонкиТаблицы));
	
	ВходящиеДанные = НовыеВходящиеДанные(ТаблицаСоставКонтейнера);
	//ВходящиеДанные.Вставить("ВводитьКоличествоВОтдельнойТранзакции", Ложь);
	ВходящиеДанные.Вставить("ВводСоставаКонтейнера", Истина);
	
	Возврат ВвестиДанные(ВходящиеДанные);
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ПроверитьОтклонениеОтПлана(Параметры, ДополнительныеПараметры) Экспорт

	Если НЕ ПараметрыОбработки.ЕстьПлан Тогда
		//нет плана
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеТранзакции.ЗапланированныеДанныеПолей.ИдентификаторИнструкцииЗаполнен Тогда
		//найдена инструкция из задания кладовщику
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеТранзакции.ЗапланированныеДанныеПолей.ИдентификаторИнструкцииДляПоиска=ДанныеМодуля.ЗапланированныеДанныеПолей.ИдентификаторИнструкцииДляПоиска Тогда
		//та же инструкция
		Возврат Истина;
	КонецЕсли;
	
	//в данных модуля находятся предыдущие данные до начала транзакции
	//удобно для определения изменений ввода
	ЗапланированныеДанныеПолей = ДанныеМодуля.ЗапланированныеДанныеПолей;

	ИдентификаторИнструкцииДляПоиска = ЗапланированныеДанныеПолей.ИдентификаторИнструкцииДляПоиска;
	
	ПринятыеДанныеПолей = ДанныеТранзакции.ПринятыеДанныеПолей;
	СписокПринятыхПолейМассив = РК.ВыгрузитьЗначенияКолонкиКоллекции(ПринятыеДанныеПолей, "Ключ");
	ПоляПланФактаМассив = ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания.НайтиСтроки(Новый Структура("План, Ввод, Ресурс, ИдентификаторИнструкции", Истина, Истина, Ложь, 0));
	СписокПолейПланФактаМассив = РК.ВыгрузитьЗначенияКолонкиКоллекции(ПоляПланФактаМассив, "Имя");
	СписокПринятыхПолейПланФактаМассив = РК.ПересечениеМассивов(СписокПолейПланФактаМассив, СписокПринятыхПолейМассив);
	Если СписокПринятыхПолейПланФактаМассив.Количество()=0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПолеРасхожденияНайдено = Ложь;
	Для Каждого ИмяПоля Из СписокПринятыхПолейПланФактаМассив Цикл
		Если ЗапланированныеДанныеПолей[ИмяПоля]=ПринятыеДанныеПолей[ИмяПоля] Тогда
			//нет расхождений с планом по этому полю
			Продолжить;
		КонецЕсли;
		
		Если ДанныеМодуля.ОбщиеДанныеПолей[ИмяПоля]=ПринятыеДанныеПолей[ИмяПоля] Тогда
			//нет изменений по этому полю
			Продолжить;
		КонецЕсли;
		
		ПолеРасхожденияНайдено = Истина;
		Прервать;
	КонецЦикла;
	
	Если НЕ ПолеРасхожденияНайдено Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЗначениеФакта = ПринятыеДанныеПолей[ИмяПоля];
	ЗначениеПлана = ЗапланированныеДанныеПолей[ИмяПоля];
	Если НЕ ЗначениеЗаполнено(ЗначениеФакта) Тогда
		ЗначениеФакта = "<пусто>";
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЗначениеПлана) Тогда
		ЗначениеПлана = "<пусто>";
	КонецЕсли;
	
	Если ЗначениеФакта=ЗначениеПлана Тогда
		Возврат Истина;
	КонецЕсли;
	
	Поле = ПолеМодуля(ИмяПоля);
	ТекстСообщения = Поле.Синоним + " """ + ЗначениеФакта + """ не соответствует заданию.";
	Если ЗапланированныеДанныеПолей.ИдентификаторИнструкцииЗаполнен Тогда
		ТекстСообщения = ТекстСообщения + " Ожидается """ + ЗначениеПлана + """.";
	КонецЕсли;
	
	Если ПараметрыМодуля.РазрешитьВводДанныхБезПлана Тогда
		Интерфейс.ОстановитьВводДанных();
		ПоказатьДиалогНаКлиенте("ОбработчикВопросаПриВводеДанных", ТекстСообщения + " Продолжить?", "ОКОтмена", , , , "Ошибка");
	Иначе
		Интерфейс.ОтменитьВводДанных();
		ПоказатьДиалогНаКлиенте(, ТекстСообщения, , , , , "Ошибка");
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ПроверитьПревышениеКоличестваПоПлану(Параметры, ДополнительныеПараметры) Экспорт

	Если НЕ ПараметрыОбработки.ЕстьПлан Тогда
		//нет плана
		Возврат Истина;
	КонецЕсли;
	
	Если ПараметрыМодуля.ПревышениеКоличестваПоПлану="Разрешить" Тогда
		//не проверять
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхСборки.ЗаполненныеПоляМассив.Найти("Количество")=Неопределено Тогда
		//количество не введено
		Возврат Истина;
	КонецЕсли;

	СобранныеДанныеПолей = ДанныеТранзакции.СобранныеДанныеПолей;
	Если СобранныеДанныеПолей.ТипВводаКоличества=ТипыВводаКоличества.Установить Тогда
		Если ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхСборки.НеЗаполненныеПоляМассив.Количество() > 0 Тогда
			//проверка только при всех заполненных полях
			Возврат Истина;
		КонецЕсли;
		
		ИзменениеКоличества = СобранныеДанныеПолей.Количество - СобранныеДанныеПолей.Количество0;
	Иначе
		Если НЕ ВведеноКоличество() Тогда
			//проверка только при вводе количества
			Возврат Истина;
		КонецЕсли;
		
		ИзменениеКоличества = СобранныеДанныеПолей.Количество;
	КонецЕсли;
	
	Если ИзменениеКоличества <= 0 Тогда
		//нет изменения количества или уменьшение количества
		Возврат Истина;
	КонецЕсли;

	ЗапланированныеДанныеПолей = ДанныеТранзакции.ЗапланированныеДанныеПолей;
	КоличествоПлан = ЗапланированныеДанныеПолей.КоличествоПлан;
	Если КоличествоПлан=0 Тогда
		//нет плана
		Возврат Истина;
	КонецЕсли;
	
	Если ЗапланированныеДанныеПолей.КоличествоФактИтого > КоличествоПлан Тогда
		//уже было превышено, возможно было получено подтверждение на превышение
		Возврат Истина;
	КонецЕсли;
	
	НовоеКоличество = ЗапланированныеДанныеПолей.КоличествоФактИтого + ИзменениеКоличества;
	Если НовоеКоличество <= КоличествоПлан Тогда
		//нет превышения
		Возврат Истина;
	КонецЕсли;
	
	АвтоВводКоличества = ДанныеТранзакции.ВходящиеДанные.Свойство("АвтоВводКоличества") И ДанныеТранзакции.ВходящиеДанные.АвтоВводКоличества=Истина;
	ВводДробногоПлана = КоличествоПлан > Цел(КоличествоПлан) И НовоеКоличество=1;
	АвтоВводДробногоПлана = АвтоВводКоличества И ВводДробногоПлана;
	
	Если АвтоВводДробногоПлана Тогда
		//при авто вводе дробного плана количества не выводим никаких предупреждений
		//пусть пользователь вводит количество вручную
		Интерфейс.ОтменитьВводДанных();
	Иначе
		Интерфейс.ОстановитьВводДанных();

		Товар = Неопределено;
		Текст = "Будет превышено количество";
		Если ЗапланированныеДанныеПолей.Свойство("Товар", Товар) Тогда
			Текст = Текст + " для """ + Товар + """";
		КонецЕсли;
		Текст = Текст + "!";
		
		ВариантыОтвета = Новый СписокЗначений;
		
		ИдентификаторИнструкцииДляПоискаТранзакции = Неопределено;
		ИдентификаторИнструкцииДляПоиска = Неопределено;
		Если ДанныеТранзакции.СтатическиеДанныеПолей.Свойство("ИдентификаторИнструкцииДляПоиска", ИдентификаторИнструкцииДляПоискаТранзакции) И ЗначениеЗаполнено(ИдентификаторИнструкцииДляПоискаТранзакции)
			И ДанныеМодуля.СтатическиеДанныеПолей.Свойство("ИдентификаторИнструкцииДляПоиска", ИдентификаторИнструкцииДляПоиска)
			И ИдентификаторИнструкцииДляПоиска <> ИдентификаторИнструкцииДляПоискаТранзакции Тогда
			ВариантыОтвета.Добавить("Показать");
		КонецЕсли;
		
		Если ПараметрыМодуля.ПревышениеКоличестваПоПлану="Предупредить" Тогда
			Текст = Текст + " Продолжить?";
			ВариантыОтвета.Добавить("ОК");
		КонецЕсли;
		ВариантыОтвета.Добавить("Отмена");
		
		ОО = НовыйОписаниеОповещения("ОбработчикВопросаПриВводеДанных", , Новый Структура("ИдентификаторИнструкции", ИдентификаторИнструкцииДляПоискаТранзакции));
		ПоказатьДиалогНаКлиенте(ОО, Текст, ВариантыОтвета, , , , "Ошибка");
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Функция ВведеноКоличество()
	
	ПринятыеДанныеПолей = ДанныеТранзакции.ПринятыеДанныеПолей;
	
	Для Каждого ПолеВводаКоличества Из ПоляВводаКоличеств() Цикл
		
		Если ПринятыеДанныеПолей.Свойство(ПолеВводаКоличества.Имя) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ОбработчикВопросаПриВводеДанных(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ="Показать" Тогда
		Интерфейс.ОтменитьВводДанных();
		ПерейтиКСледующейПозиции(ДополнительныеПараметры.ИдентификаторИнструкции, Истина);
	ИначеЕсли Ответ="ОК" Тогда
		Интерфейс.ВозобновитьВводДанных();
	Иначе
		Интерфейс.ОтменитьВводДанных();
	КонецЕсли;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_СохранениеДанных(Параметры, ДополнительныеПараметры) Экспорт
	
	Если ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхСборки.ВсеПоляЗаполнены Тогда
		Отказ = Ложь;
		Если СохранитьДокументОперацииПоЯчейкам(Отказ) И НЕ Отказ Тогда
			ОповеститьОСохраненииДанных(Отказ);
			ПараметрыМодуля.ДанныеСохранены = Истина;
		КонецЕсли;
		
		Если Отказ Тогда
			Интерфейс.ОтменитьВводДанных();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ОповеститьОСохраненииДанных(Отказ)
	
	ПараметрыДействия = Новый Структура("Сборщик, Отказ", Интерфейс, Отказ);
	вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("СохранениеДанныхСборщика", ПараметрыДействия));
	Отказ = ПараметрыДействия.Отказ;
	
КонецФункции

Функция СохранитьДокументОперацииПоЯчейкам(Отказ=Ложь)
	
	СобранныеДанныеПолей = ДанныеТранзакции.СобранныеДанныеПолей;
	
	ПоляСборки = ПоляМодуля(Новый Структура("Сборка, Ресурс, ПутьРодителяДанныхСохранения", Истина, Ложь, "ОперацияПоЯчейкам." + ПараметрыОбработки.ИмяТаблицыФакта));
	Если ПоляСборки.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОперацияПоЯчейкам = ПолучитьДокументОперацииПоЯчейкам();

	ТаблицаДокумента = ОперацияПоЯчейкам[ПараметрыОбработки.ИмяТаблицыФакта];

	Поиск = Новый Структура;
	Для Каждого Поле Из ПоляСборки Цикл
		Поиск.Вставить(Поле.Имя);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Поиск, СобранныеДанныеПолей);
	
	ПланПоУпаковкам = ДанныеТранзакции.ЗапланированныеДанныеПолей.Свойство("Упаковка");
	ИмяКолонкиКоличество = ?(ПланПоУпаковкам, "Количество", "КоличествоБазовыхЕдиниц");

	НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Поиск);
	Если НайденныеСтроки.Количество()=0 Тогда
		СтрокаДокумента = ТаблицаДокумента.Добавить();
		Количество = 0;
	Иначе
		СтрокаДокумента = НайденныеСтроки[0];
		Количество = СтрокаДокумента[ИмяКолонкиКоличество];
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаДокумента, СобранныеДанныеПолей);
	
	Если ПараметрыОбработки.Инвентаризация Тогда
		ОперацияПоЯчейкам.Готов = Истина;
		Если СобранныеДанныеПолей.ТипВводаКоличества=ТипыВводаКоличества.Установить Тогда
			Количество = СобранныеДанныеПолей.Количество;
		Иначе
			Количество = СобранныеДанныеПолей.Количество0 + СобранныеДанныеПолей.Количество;
		КонецЕсли;

		Если Количество=0 И СтрокаДокумента.КоличествоУчет=0 Тогда
			ТаблицаДокумента.Удалить(СтрокаДокумента);
			СтрокаДокумента = Неопределено;
		Иначе
			СтрокаДокумента[ИмяКолонкиКоличество] = Количество;
		КонецЕсли;
	Иначе
		Если СобранныеДанныеПолей.ТипВводаКоличества=ТипыВводаКоличества.Установить Тогда
			КоличествоДобавить = СобранныеДанныеПолей.Количество - СобранныеДанныеПолей.Количество0;
		Иначе
			КоличествоДобавить = СобранныеДанныеПолей.Количество;
		КонецЕсли;
		
		Количество = Количество + КоличествоДобавить;
		Если Количество=0 Тогда
			ТаблицаДокумента.Удалить(СтрокаДокумента);
			СтрокаДокумента = Неопределено;
		Иначе
			СтрокаДокумента[ИмяКолонкиКоличество] = Количество;
		КонецЕсли;
	КонецЕсли;
	
	
	Если СтрокаДокумента <> Неопределено Тогда
		
		КоэффициентУпаковки = вмс_ОперацииПоЯчейкамСервер.КоэффициентУпаковки(СтрокаДокумента.Упаковка, СтрокаДокумента.Товар);
		
		Если ПланПоУпаковкам Тогда
			
			СтрокаДокумента.КоличествоБазовыхЕдиниц = СтрокаДокумента.Количество * КоэффициентУпаковки;
			
		Иначе
			
			СтрокаДокумента.Количество = СтрокаДокумента.КоличествоБазовыхЕдиниц / КоэффициентУпаковки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗаписатьДокументОперацииПоЯчейкам(ОперацияПоЯчейкам) Тогда
		Отказ = Истина;
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;

КонецФункции

Функция ОбработчикЭтапаВводаДанных_КонецВвода(Параметры, ДополнительныеПараметры) Экспорт
	
	Если ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхСборки.ВсеПоляЗаполнены Тогда
		Интерфейс.ЗаполнитьТаблицы();

		Если ПараметрыМодуля.ДанныеСохранены Тогда
			//количество перешло в сохраненные данные и будет подтягиваться в поле количества оттуда,
			//вычтем из введенного количества, чтобы не было дублирования
			ВычестьСохраненноеКоличествоИзВведенныхКоличеств();

			Если КоличествоПоПлануПревышено() Тогда
				ПерераспределитьПлановоеКоличество();
			КонецЕсли;
		КонецЕсли;
			
		ПодобратьИнструкциюДляДанныхВвода();
		Если ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.ВсеПоляЗаполнены Тогда
			//ввод завершен
			//после закрытия транзакции выполним дальнейшие действия
			ПараметрыМодуля.ВводЗавершен = Истина;
		КонецЕсли;
		
		Интерфейс.ЗаполнитьДанныеПолей();
		
	КонецЕсли;
	
КонецФункции

Функция КоличествоПоПлануПревышено()

	Если НЕ ПараметрыОбработки.ЕстьПлан Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеПолей = ДанныеТранзакции.ОбщиеДанныеПолей;
	Если НЕ ДанныеПолей.ИдентификаторИнструкцииЗаполнен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Инструкция = ПолучитьИнструкциюПоИдентификатору(ДанныеПолей.ИдентификаторИнструкцииДляПоиска);
	
	Если Инструкция.КоличествоПлан >= Инструкция.КоличествоФактИтого Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПерераспределитьПлановоеКоличество()
	
	Задание = ПараметрыОбработки.Задание;
	
	Если НЕ Документы.вмс_ЗаданиеКладовщику.ПерераспределитьПлановоеКоличество(Задание) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаПланФакт = ДанныеОбработки.Таблицы.ТаблицаПланФакт;
	ДанныеОбновленияТаблицыПланФакт = ПараметрыТаблицы("ТаблицаПланФакт");
	
	НачалоОбновленияТаблицы(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт);
	ОбновитьДанныеТаблицы(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт, ПолучитьТаблицуПлана(), "ИдентификаторИнструкцииЗаполнен, ИдентификаторИнструкции", Истина, "КоличествоПлан", ЗначенияПоУмолчаниюЭлементаТаблицыПланФакт());
	ОбновитьИзмененныеЭлементыТаблицыПланФакт(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт);
	КонецОбновленияТаблицы(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт);

	Возврат Истина;
	
КонецФункции

Функция ОчиститьКоличество()
	
	Интерфейс.ОчиститьДанныеПолей(ПоляМодуля(Новый Структура("Группа", "Количество")));
	
КонецФункции

Функция ОчиститьДанныеПолей(знач Поля=Неопределено, ИмяДанных=Неопределено) Экспорт

	Поля = ПоляМодуля(Поля);
	Если Поля <> ПоляМодуля() Тогда
		//добавим дополнительные поля количеств
		ИндексПоследнегоПоля = Поля.ВГраница();
		Для ИндексПоля=0 По ИндексПоследнегоПоля Цикл
			Поле = Поля[ИндексПоля];
			Если Поле.Группа="Количество" Тогда
				РК.ДобавитьЭлементыКоллекции(Поля, ПоляМодуля("ТипВводаКоличества" + Поле.Суффикс));
				РК.ДобавитьЭлементыКоллекции(Поля, ПоляМодуля("ЗавершениеВводаКоличества" + Поле.Суффикс));
			КонецЕсли;
		КонецЦикла;
		РК.УдалитьДублиВМассиве(Поля);
	КонецЕсли;
	
	СборщикДанныхСтандартный.ОчиститьДанныеПолей(Поля, ИмяДанных);

КонецФункции

Функция КоличествоВводится()
	
	Возврат ПоляВводаКоличеств().Количество() > 0;
	
КонецФункции

Функция КоличествоВведено()
	
	Для Каждого ПолеВводаКоличества Из ПоляВводаКоличеств() Цикл
		
		Если ДанныеТранзакции.ВходящиеДанные.ДанныеПолей.Свойство(ПолеВводаКоличества.Имя) Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если ДанныеТранзакции.ВходящиеДанные.ДанныеПолей.Свойство("ЗавершениеВводаКоличества" + ПолеВводаКоличества.Суффикс) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ОбработчикКнопкиДальше(Результат, ДополнительныеПараметры) Экспорт
	
	Если ПодтвердитьКоличество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если КоличествоЗаполнено() Тогда
		ПодтвердитьПереходКСледующейПозиции();
	Иначе
		ПерейтиКСледующейПозиции();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция КоличествоЗаполнено()

	ВведенныеДанныеПолей = ДанныеТранзакции.ВведенныеДанныеПолей;
	
	Для Каждого ПолеВводаКоличества Из ПоляВводаКоличеств() Цикл
		
		Значение = ВведенныеДанныеПолей[ПолеВводаКоличества.Имя];
		Если Значение=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Значение=0 И ВведенныеДанныеПолей["ТипВводаКоличества" + ПолеВводаКоличества.Суффикс]=ТипыВводаКоличества.Добавить Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПодтвердитьПереходКСледующейПозиции()
	
	ПоказатьДиалогНаКлиенте("ОбработчикВопросаПодтвердитьПереходКСледующейПозиции",	"Ввод данных не завершен.
																					|Пропустить эту строку задания?", "ДаНет", , , , "Ошибка");
	
КонецФункции

Функция ОбработчикВопросаПодтвердитьПереходКСледующейПозиции(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ="Да" Тогда
		ПерейтиКСледующейПозиции();
	КонецЕсли;
	
КонецФункции

Функция ПодтвердитьКоличество()
	
	НеЗаполненныеПоляМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.НеЗаполненныеПоляМассив;
	Если НеЗаполненныеПоляМассив.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Поле = ПолеМодуля(НеЗаполненныеПоляМассив[0]);
	Если Поле.Группа <> "Количество" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяПоля = Поле.Имя;

	ЗначениеПоля = Неопределено;
	ЗначениеПоляЗаполнено = ДанныеТранзакции.ВведенныеДанныеПолей.Свойство(ИмяПоля, ЗначениеПоля) ИЛИ ДанныеТранзакции.ОбщиеДанныеПолей.Свойство(ИмяПоля, ЗначениеПоля);
	Если ЗначениеПоля=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВвестиДанные(Новый Структура("ЗавершениеВводаКоличества" + Поле.Суффикс, Истина));
	Возврат Истина;
	
КонецФункции

Функция ПерейтиКСледующейПозиции(знач ИдентификаторИнструкции=Неопределено, ОчиститьВсеПоля=Ложь)
	
	НачатьТранзакциюОбработки(Интерфейс);
	Интерфейс.НачатьТранзакциюСборщика();
	
		СборщикДанныхМаркировки = СтандартныйМодуль.СборщикДанных("СборщикДанныхМаркировки");
		Если СборщикДанныхМаркировки <> Неопределено Тогда
			СборщикДанныхМаркировки.ОчиститьДанныеПолей();
		КонецЕсли;

		Если ИдентификаторИнструкции <> Неопределено Тогда
			УстановитьЗначениеДанныхПоляМодуля("ИдентификаторИнструкцииДляПоиска", ИдентификаторИнструкции);
		Иначе
			ИдентификаторИнструкции = ОпределитьСледующуюИнструкцию();
		КонецЕсли;
		
		Если ОчиститьВсеПоля Тогда
			Интерфейс.ОчиститьДанныеПолей();
		Иначе
			ОчиститьВведенныеДанныеПолейНеСоответствующиеПлану();
		КонецЕсли;
		Интерфейс.ЗаполнитьДанныеПолей();
		
	СтандартныйМодуль.ПроанализироватьЗаполнениеПолейДанныхОбработки();
	Интерфейс.ОбновитьДанныеТранзакцииОбработки();
	ЗафиксироватьТранзакциюОбработки(Интерфейс);
	
	вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ПослеЗаполненияДанныхПолей"));
	
	Если ЗначениеЗаполнено(ИдентификаторИнструкции) Тогда
		УстановитьТекущийЭлементТаблицы("ТаблицаПланФакт", ИдентификаторИнструкции);
	КонецЕсли;
	
КонецФункции

Функция ОчиститьВведенныеДанныеПолейНеСоответствующиеПлану()
	
	Интерфейс.ОчиститьДанныеПолей(, "ЗапланированныеДанныеПолей, ОбщиеДанныеПолей");
	ЗаполнитьЗначенияСвойств(ДанныеТранзакции.ОбщиеДанныеПолей, ДанныеТранзакции.СтатическиеДанныеПолей);
	Интерфейс.ПроанализироватьЗаполнениеПолейДанных("ОбщиеДанныеПолей");
	
	Интерфейс.ЗаполнитьЗапланированныеДанныеПолей();

	ВведенныеДанныеПолей = ДанныеТранзакции.ВведенныеДанныеПолей;
	ОбщиеДанныеПолей = ДанныеТранзакции.ОбщиеДанныеПолей;
	ЗаполненныеПоляОбщихДанных = ДанныеТранзакции.РезультатАнализаЗаполненияПолейОбщихДанных.ЗаполненныеПоляМассив;
	ПоляДляОчистки = Новый Массив;
	ПоляМодуляПоУмолчанию = ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания.Скопировать(Новый Структура("ИдентификаторИнструкции", 0));
	ПоляВводаПоУмолчанию = ПоляМодуляПоУмолчанию.НайтиСтроки(Новый Структура("Ввод", Истина));
	ПоляВводаИнструкции = РК.ВыгрузитьЗначенияКолонкиКоллекции(ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания.НайтиСтроки(Новый Структура("ИдентификаторИнструкции, Ввод", ОбщиеДанныеПолей.ИдентификаторИнструкцииДляПоиска, Истина)), "Имя");
	Для Каждого Поле Из ПоляВводаПоУмолчанию Цикл
		ИмяПоля = Поле.Имя;
		Если Поле.План ИЛИ ЗаполненныеПоляОбщихДанных.Найти(ИмяПоля) <> Неопределено ИЛИ ПоляВводаИнструкции.Найти(ИмяПоля)=Неопределено Тогда
			Если ВведенныеДанныеПолей[ИмяПоля] <> ОбщиеДанныеПолей[ИмяПоля] Тогда
				ПоляДляОчистки.Добавить(ИмяПоля);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПоляДляОчистки.Количество() > 0 Тогда
		Если ПоляДляОчистки.Найти("Товар") <> Неопределено Тогда
			Для Каждого ТоварноеПоле Из ПоляМодуляПоУмолчанию.НайтиСтроки(Новый Структура("Ввод, Группа", Истина, "Товар")) Цикл
				ПоляДляОчистки.Добавить(ТоварноеПоле.Имя);
			КонецЦикла;
		КонецЕсли;
		
		РК.УдалитьДублиВМассиве(ПоляДляОчистки);
		
		Интерфейс.ОчиститьДанныеПолей(ПоляДляОчистки, "ВведенныеДанныеПолей");
	Конецесли;
		
КонецФункции

#КонецОбласти

//
//						Этапы ввода-
//
////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////
//
//						Реализация методов+
//

#Область РеализацияМетодов

Функция РазобратьВходящиеОбъекты(ВходящиеДанные) Экспорт
	
	СборщикДанныхСтандартный.РазобратьВходящиеОбъекты(ВходящиеДанные, ВсеПоляВвода());
	
	ЗаполнитьКоличествоПоШтрихкодуВоВходящихДанных(ВходящиеДанные);
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьКоличествоПоШтрихкодуВоВходящихДанных(ВходящиеДанные)

	Если НЕ ВходящиеДанные.ДанныеШтрихкода.Обработан Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеПолей = ВходящиеДанные.ДанныеПолей;

	Если НЕ ДанныеПолей.Свойство("Товар") И НЕ ДанныеПолей.Свойство("Контейнер") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеПолей.Вставить("Количество", 1);
	КоличествоУпаковок = 1;
	
	Результат = ВходящиеДанные.ДанныеШтрихкода.Результат;
	
	// 3.2.5 - изменил ключ "План" на "Сборка" для того, чтобы если упаковка вводится по факту - коэффициент количества тоже не учитывался.
	Если ПолеМодуля(Новый Структура("Имя, Сборка", "Упаковка", Истина)) = ПустоеПолеОбработки Тогда
		
		// упаковки нет в плане, используем упаковку как коэффициент для ввода количества
		ЭлементУпаковка = РК.НайтиЭлементКоллекции(Результат.НайденныеОбъекты, Новый Структура("ИмяТипаОбъекта", "Упаковка"));
		
		Если ЭлементУпаковка <> Неопределено Тогда
			
			Упаковка = ЭлементУпаковка.Объект;

			Товар = Неопределено;
			Если ДанныеПолей.Свойство("Товар", Товар) Тогда
				КоличествоУпаковок = вмс_ОперацииПоЯчейкамСервер.КоэффициентУпаковки(Упаковка, Товар);
			КонецЕсли;

		КонецЕсли;
		
		//Берем любое повышающее количество: из упаковки или из штрихкода.
		ДанныеПолей.Количество = Макс(КоличествоУпаковок, Результат.Количество);
		
	КонецЕсли;
	
	ПолеКоличества = АктивноеПолеКоличества();
	Если ПолеКоличества <> Неопределено  Тогда
		Если ПолеКоличества.Имя <> "Количество" Тогда
			// уточним имя поля количество, может называться по другому
			ДанныеПолей.Вставить(ПолеКоличества.Имя, ДанныеПолей.Количество);
			ДанныеПолей.Удалить("Количество");
		КонецЕсли;
		ДанныеПолей.Вставить("ТипВводаКоличества" + ПолеКоличества.Суффикс, ТипыВводаКоличества.Добавить);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// используются все поля ввода, но поля ввода для текущей инструкции задания будут в приоритете
Функция ВсеПоляВвода()
	
	ВсеПоляВвода = ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания.Скопировать(Новый Структура("Ввод, ИдентификаторИнструкции", Истина, 0));
	ВсеПоляВвода.Сортировать("ПорядокВвода");
	
	ПоляВводаТекущие = ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания.Скопировать(Новый Структура("Ввод, ИдентификаторИнструкции", Истина, ПолучитьЗначениеДанныхПоляМодуля("ИдентификаторИнструкцииДляПоиска")));
	ПоляВводаТекущие.Сортировать("ПорядокВвода");

	ОтборПоИмени = Новый Структура("Имя");
	Для НомерПоля=0 По ПоляВводаТекущие.Количество()-1 Цикл
		ОтборПоИмени.Имя = ПоляВводаТекущие[НомерПоля].Имя;
		ПолеВводаМассив = ВсеПоляВвода.НайтиСтроки(ОтборПоИмени);
		Если ПолеВводаМассив.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеВвода = ПолеВводаМассив[0];
		ТекущийНомерПоля = ВсеПоляВвода.Индекс(ПолеВвода);
		Если ТекущийНомерПоля <> НомерПоля Тогда
			ВсеПоляВвода.Сдвинуть(ТекущийНомерПоля, НомерПоля-ТекущийНомерПоля);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВсеПоляВвода;
	
КонецФункции

Функция ВвестиДанные(ВходящиеДанные)

	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ВвестиДанные", Новый Структура("ВходящиеДанные", ВходящиеДанные)));
	
КонецФункции

Функция ВвестиДанныеПоля(ИмяПоля, ЗначениеПоля)

	Возврат СтандартныйМодуль.ВвестиДанныеПоля(ИмяПоля, ЗначениеПоля);
	
КонецФункции

Функция НачатьТранзакциюОбработки(СборщикиДанных=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("НачатьТранзакциюОбработки", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

Функция ЗафиксироватьТранзакциюОбработки(СборщикиДанных=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗафиксироватьТранзакциюОбработки", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

Функция НачатьТранзакциюСборщика() Экспорт

	Если НЕ СборщикДанныхСтандартный.НачатьТранзакциюСборщика() Тогда
		Возврат Ложь;
	КонецЕсли;

	ДанныеТранзакции.НовыеИдентификаторыИнструкций.Очистить();
	ДанныеТранзакции.Вставить("ИдентификаторИнструкцииПолейОбработки", ПараметрыМодуля.ИдентификаторИнструкцииПолейОбработки);
	ДанныеТранзакции.Вставить("ПринятыеДанныеБезПолейКоличества", Новый Структура);
	ДанныеТранзакции.Вставить("ПринятыеДанныеПолейКоличества", Новый Структура);
	ДанныеТранзакции.Вставить("ВводКоличества", Ложь);
	Возврат Истина;
	
КонецФункции

Функция ЗафиксироватьТранзакциюСборщика() Экспорт

	ИдентификаторИнструкции = ДанныеМодуля.СтатическиеДанныеПолей.ИдентификаторИнструкцииДляПоиска;
	ИдентификаторНовойИнструкции = ДанныеТранзакции.СтатическиеДанныеПолей.ИдентификаторИнструкцииДляПоиска;
	
	Если НЕ СборщикДанныхСтандартный.ЗафиксироватьТранзакциюСборщика() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбновитьТекущуюИнструкцию(ИдентификаторИнструкции, ИдентификаторНовойИнструкции);
	
	ПараметрыМодуля.ИдентификаторИнструкцииПолейОбработки = ДанныеТранзакции.ИдентификаторИнструкцииПолейОбработки;

	ДанныеТранзакции.НовыеИдентификаторыИнструкций.Очистить();
	
	Возврат Истина;
	
КонецФункции

Функция ОбновитьТекущуюИнструкцию(ИдентификаторИнструкции, ИдентификаторНовойИнструкции)
	
	ТаблицаПланФакт = ДанныеОбработки.Таблицы.ТаблицаПланФакт;
	ДанныеОбновленияТаблицыПланФакт = ПараметрыТаблицы("ТаблицаПланФакт");
	ДополнительныеДанныеЭлементов = ДанныеОбновленияТаблицыПланФакт.ДополнительныеДанныеЭлементов;
	
	Если ИдентификаторИнструкции <> 0 И ИдентификаторИнструкции <> ИдентификаторНовойИнструкции Тогда
		
		СписокЭлементовДляПроверки = Новый Массив;
		Для Каждого Инструкция Из ТаблицаПланФакт.НайтиСтроки(Новый Структура("ИдентификаторИнструкцииДляПоиска", ИдентификаторИнструкции)) Цикл
			ИндексЭлемента = ТаблицаПланФакт.Индекс(Инструкция);
			ДополнительныеДанныеЭлемента = ДополнительныеДанныеЭлементов[ИндексЭлемента];
            Если НЕ ДополнительныеДанныеЭлемента.УдалятьПустые Тогда
				ДополнительныеДанныеЭлемента.УдалятьПустые = Истина;
				СписокЭлементовДляПроверки.Добавить(ИндексЭлемента);
			КонецЕсли;
		КонецЦикла;
		
		Если СписокЭлементовДляПроверки.Количество() > 0 Тогда
			ПустыеЭлементы = ПолучитьПустыеЭлементыТаблицы(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт, СписокЭлементовДляПроверки);
			
			ИдентификаторыИнструкций = Новый Массив;
			Для Каждого ИндексЭлемента Из ПустыеЭлементы Цикл
				ИдентификаторыИнструкций.Добавить(ТаблицаПланФакт[ИндексЭлемента].ИдентификаторИнструкцииДляПоиска);
			КонецЦикла;
			
			УдалитьДанныеИнструкцийЗадания(ИдентификаторыИнструкций);
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	
	Если ИдентификаторНовойИнструкции <> 0 Тогда
		
		Для Каждого Инструкция Из ТаблицаПланФакт.НайтиСтроки(Новый Структура("ИдентификаторИнструкцииДляПоиска", ИдентификаторНовойИнструкции)) Цикл
			ИндексЭлемента = ТаблицаПланФакт.Индекс(Инструкция);
			ДополнительныеДанныеЭлемента = ДополнительныеДанныеЭлементов[ИндексЭлемента];
			ДополнительныеДанныеЭлемента.УдалятьПустые = Ложь;
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция ОтменитьТранзакциюСборщика() Экспорт
	
	СборщикДанныхСтандартный.ОтменитьТранзакциюСборщика();
	
	ОчиститьИнструкцииНеЗавершеннойТранзакцииВвода(ДанныеОбработки.Таблицы.ТаблицаПланФакт, ПараметрыТаблицы("ТаблицаПланФакт"));
	
КонецФункции

Функция ЕстьИзменениеДанных() Экспорт
	
	Возврат ЕстьИзменениеПланФакта();
	
КонецФункции

Функция ОбновитьДанныеТранзакцииОбработки() Экспорт
	
	Если НЕ СборщикДанныхСтандартный.ОбновитьДанныеТранзакцииОбработки() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбновитьСвойстваПолейТранзакцииОбработки();
	
	Возврат Истина;
	
КонецФункции

Функция ОбновитьСвойстваПолейТранзакцииОбработки()

	ПоляОбработки = ПараметрыОбработки.ДанныеТранзакции.ПоляОбработки;
	Отбор = Новый Структура("Имя");
	
	Для Каждого ПолеМодуля Из ДанныеТранзакции.ПоляОбработки Цикл
		Отбор.Имя = ПолеМодуля.Имя;
		ПолеОбработкиМассив = ПоляОбработки.НайтиСтроки(Отбор);
		Если ПолеОбработкиМассив.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеОбработки = ПолеОбработкиМассив[0];
		ЗаполнитьЗначенияСвойств(ПолеОбработки, ПолеМодуля, , "События");
		
		ПолеОбработки.События.Очистить();
		Для Каждого Событие Из ПолеМодуля.События Цикл
			ПолеОбработки.События.Вставить(Событие.Ключ, Событие.Значение);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПослеЗавершенияТранзакцииВвода() Экспорт
	
	Если ДанныеТранзакции.ВходящиеДанные.ВводитьКоличествоВОтдельнойТранзакции Тогда
		//после завершения основной транзакции, выполним транзакцию ввода количества
		ВходяшиеДанные = НовыеВходящиеДанные(ДанныеТранзакции.ПринятыеДанныеПолейКоличества);
		ВходяшиеДанные.Вставить("ВводитьКоличествоВОтдельнойТранзакции", Ложь);
		ВходяшиеДанные.Вставить("АвтоВводКоличества", Истина);
		ВвестиДанные(ВходяшиеДанные);
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПослеЗавершенияВвода() Экспорт
	
	Если НЕ Интерфейс.ВводДоступен() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДанныеТранзакции.ПринятыеДанныеПолей.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;

	ИдентификаторИнструкции = ПолучитьЗначениеДанныхПоляМодуля("ИдентификаторИнструкцииДляПоиска");
	Если ЗначениеЗаполнено(ИдентификаторИнструкции) Тогда
		УстановитьТекущийЭлементТаблицы("ТаблицаПланФакт", ИдентификаторИнструкции);
		УстановитьТекущийЭлементТаблицыФактПоИдентификаторуИнструкции(ИдентификаторИнструкции);
	КонецЕсли;

	Если НЕ ПараметрыМодуля.ВводЗавершен Тогда
		//Если НЕ ПараметрыМодуля.ДанныеСохранены И ВведеноТоварноеПоле() И НЕ ВведеноКоличественноеПоле() Тогда
		//	Если АвтоВводКоличества() Тогда
		//		Возврат Истина;
		//	КонецЕсли;
		//КонецЕсли;

		Если Интерфейс.НачатьВыборСледующегоПоля() Тогда
			Возврат Истина;
		КонецЕсли;
	Иначе
		Если ПараметрыМодуля.АвтоПереходКСледующейИнструкции И ПланПоИнструкцииЗаданияВыполнен() Тогда
			ПерейтиКСледующейПозиции();
		КонецЕсли;

		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция УстановитьТекущийЭлементТаблицыФактПоИдентификаторуИнструкции(ИдентификаторИнструкции)
	//в таблице факт идентификатор инструкции НЕ совпадает с идентификатором элемента, дополнительно получим его
	ЭлементФактаМассив = ДанныеОбработки.Таблицы.ТаблицаФакт.НайтиСтроки(Новый Структура("ИдентификаторИнструкцииДляПоиска", ИдентификаторИнструкции));
	Если ЭлементФактаМассив.Количество() > 0 Тогда
		ИдентификаторЭлемента = СтандартныйМодуль.ДополнительныеДанныеЭлементаТаблицы("ТаблицаФакт", ЭлементФактаМассив[0]).Идентификатор;
		УстановитьТекущийЭлементТаблицы("ТаблицаФакт", ИдентификаторЭлемента);
	КонецЕсли;
КонецФункции

Функция ПланПоИнструкцииЗаданияВыполнен()
	
	ОбщиеДанныеПолей = ДанныеМодуля.ОбщиеДанныеПолей;
	
	Возврат ОбщиеДанныеПолей.Свойство("КоличествоПлан") И ОбщиеДанныеПолей.КоличествоПлан <> 0 И ОбщиеДанныеПолей.Свойство("КоличествоФактИтого") И ОбщиеДанныеПолей.КоличествоПлан=ОбщиеДанныеПолей.КоличествоФактИтого;
	
КонецФункции

Функция ЗаполнитьОбщиеДанныеПолей() Экспорт
	
	СборщикДанныхСтандартный.ЗаполнитьОбщиеДанныеПолей();
	
	ЗаполнитьТекущееКоличество();
	
КонецФункции

Функция ЗаполнитьДанныеПолей() Экспорт
	
	ИдентификаторИнструкции = ПолучитьЗначениеДанныхПоляМодуля("ИдентификаторИнструкцииДляПоиска");
	УстановитьПоляОбработкиДляИнструкцииЗадания(ИдентификаторИнструкции);
	
	СборщикДанныхСтандартный.ЗаполнитьДанныеПолей();
	
КонецФункции

Функция НайтиИнструкцию(Отбор, ИдентификаторТекушейИнструкции)

	Перем НаправлениеПоиска;
	
	ТаблицаПланФакт = ДанныеОбработки.Таблицы.ТаблицаПланФакт;
	
	НачальныйИндекс = 0;
	Если ИдентификаторТекушейИнструкции <> 0 Тогда
		ТекущаяИнструкцияМассив = ТаблицаПланФакт.НайтиСтроки(Новый Структура("ИдентификаторИнструкцииДляПоиска", ИдентификаторТекушейИнструкции));
		Если ТекущаяИнструкцияМассив.Количество() > 0 Тогда
			НачальныйИндекс = ТаблицаПланФакт.Индекс(ТекущаяИнструкцияМассив[0]);
		КонецЕсли;
	КонецЕсли;
	
	КонечныйИндекс = ТаблицаПланФакт.Количество()-1;
	
	ПоляОбработкиИнструкцийЗаданияДляПоиска = ПараметрыМодуля.ПоляОбработкиИнструкцийЗаданияДляПоиска;
	ИдентификаторВыполненнойИнструкции = 0;
	ПодходитИнструкцияДляВвода = Ложь;
	ИдентификаторИнструкцииБезПлана = 0;
	ДополнительныеДанныеЭлементовТаблицы = ПараметрыТаблицы("ТаблицаПланФакт").ДополнительныеДанныеЭлементов;
	Для НаправлениеПоиска=1 По 2 Цикл
		
		Для Индекс=НачальныйИндекс По КонечныйИндекс Цикл
			ДополнительныеДанныеЭлементаТаблицы = ДополнительныеДанныеЭлементовТаблицы[Индекс];
			
			ИнструкцияЗадания = ТаблицаПланФакт[Индекс];
			Выполнен = ИнструкцияЗадания.Выполнен;
			Если Выполнен И ИдентификаторВыполненнойИнструкции <> 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ИдентификаторИнструкции = ИнструкцияЗадания.ИдентификаторИнструкцииДляПоиска;
			
			ПоляОбработкиИнструкцииЗаданияДляПоиска = ПоляОбработкиИнструкцийЗаданияДляПоиска[ИдентификаторИнструкции];
			
			ИнструкцияПодходитПоОтбору = Истина;
			Для Каждого ПолеОтбора Из Отбор Цикл
				
				Если ПоляОбработкиИнструкцииЗаданияДляПоиска[ПолеОтбора.Ключ]=Истина Тогда
					
					Если ИнструкцияЗадания[ПолеОтбора.Ключ] <> ПолеОтбора.Значение Тогда
						ИнструкцияПодходитПоОтбору = Ложь;
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ИнструкцияПодходитПоОтбору Тогда
				ИдентификаторИнструкцииЗаполнен = ИнструкцияЗадания.ИдентификаторИнструкцииЗаполнен;
				Если ИдентификаторИнструкции=ИдентификаторТекушейИнструкции Тогда
					Если ИдентификаторИнструкцииЗаполнен Тогда
						Возврат ИдентификаторИнструкции;
					КонецЕсли;
				КонецЕсли;
				
				Если Выполнен Тогда
					Если ИдентификаторВыполненнойИнструкции=0 Тогда
						ИдентификаторВыполненнойИнструкции = ИдентификаторИнструкции;
					КонецЕсли;
				ИначеЕсли НЕ ИдентификаторИнструкцииЗаполнен Тогда
					ИдентификаторИнструкцииБезПлана = ИдентификаторИнструкции;
				Иначе
					Возврат ИдентификаторИнструкции;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		КонечныйИндекс = НачальныйИндекс-1;
		НачальныйИндекс = 0; //теперь ищем сначала
		
	КонецЦикла;
	
	Если ИдентификаторВыполненнойИнструкции <> 0 Тогда
		Возврат ИдентификаторВыполненнойИнструкции;
	КонецЕсли;
	
	Если ИдентификаторИнструкцииБезПлана <> 0 Тогда
		Возврат ИдентификаторИнструкцииБезПлана;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЗаполнитьТекущееКоличество()
	
	ЗапланированныеДанныеПолей = ДанныеТранзакции.ЗапланированныеДанныеПолей;
	ОбщиеДанныеПолей = ДанныеТранзакции.ОбщиеДанныеПолей;
	ВведенныеДанныеПолей = ДанныеТранзакции.ВведенныеДанныеПолей;
	
	ПоляПоискаМассив = СписокПолейМодуля(Новый Структура("Сборка, Ресурс", Истина, Ложь));
	ПоляПоиска = РК.МассивВСтроку(ПоляПоискаМассив);
	Поиск = Новый Структура(ПоляПоиска);
	ЗаполнитьЗначенияСвойств(Поиск, ОбщиеДанныеПолей);
	НайденныеЭлементыФакта = ДанныеОбработки.Таблицы.ТаблицаФакт.НайтиСтроки(Поиск);
	Если НайденныеЭлементыФакта.Количество() > 0 Тогда
		Количество0 = НайденныеЭлементыФакта[0].КоличествоФакт;
	Иначе
		Количество0 = 0;
	КонецЕсли;
	
	КоличествоПлан = ЗапланированныеДанныеПолей.КоличествоПлан;
	КоличествоФактИтого = ЗапланированныеДанныеПолей.КоличествоФактИтого;
	
	ПоляКоличеств = ПоляМодуля(Новый Структура("Сборка, Группа", Истина, "Количество"));
	ПолеВводаКоличества = Неопределено;
	
	НеЗаполненныеПоляМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.НеЗаполненныеПоляМассив;
	ИмяПоляДляВвода = ?(НеЗаполненныеПоляМассив.Количество() > 0, НеЗаполненныеПоляМассив[0], Неопределено);
	
	Для Каждого ПолеКоличества Из ПоляКоличеств Цикл
		
		ИмяПоляКоличество = ПолеКоличества.Имя;
		ИмяПоляКоличество0 = "Количество0" + ПолеКоличества.Суффикс;
		ИмяПоляЗавершениеВводаКоличества = "ЗавершениеВводаКоличества" + ПолеКоличества.Суффикс;

		ОбщиеДанныеПолей[ИмяПоляКоличество0] = Количество0;

		Если НЕ ВведенныеДанныеПолей.Свойство(ИмяПоляЗавершениеВводаКоличества) Тогда
			//подтверждение ввода не требуется
			ОбщиеДанныеПолей[ИмяПоляЗавершениеВводаКоличества] = Истина;
		КонецЕсли;
		
		Если НЕ ПолеКоличества.Ввод Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеВводаКоличества = ПолеКоличества;
		ВведенныеДанныеПолей[ИмяПоляКоличество0] = Количество0;

		Количество = ВведенныеДанныеПолей[ИмяПоляКоличество];
		Если Количество=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗавершениеВводаКоличества = ВведенныеДанныеПолей[ИмяПоляЗавершениеВводаКоличества];

		ТипВводаКоличества = ВведенныеДанныеПолей["ТипВводаКоличества" + ПолеВводаКоличества.Суффикс];
		
		Если НЕ ЗавершениеВводаКоличества Тогда
			Если ПараметрыМодуля.АвтоПереходКСледующейИнструкции И КоличествоПлан <> 0 И ТипВводаКоличества=ТипыВводаКоличества.Добавить И ИмяПоляДляВвода=ИмяПоляКоличество Тогда
				ИзменениеКоличества = Количество;
				//Если ТипВводаКоличества=ТипыВводаКоличества.Установить Тогда
				//	ИзменениеКоличества = ИзменениеКоличества - Количество0;
				//КонецЕсли;
				
				Если КоличествоФактИтого+ИзменениеКоличества=КоличествоПлан Тогда
					//введено количество по плану
					ЗавершениеВводаКоличества = Истина;
				КонецЕсли;
			КонецЕсли;

			Если ЗавершениеВводаКоличества Тогда
				ВведенныеДанныеПолей[ИмяПоляЗавершениеВводаКоличества] = ЗавершениеВводаКоличества;
				ОбщиеДанныеПолей[ИмяПоляЗавершениеВводаКоличества] = ЗавершениеВводаКоличества;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗавершениеВводаКоличества Тогда
			//сформировать план для следующего количественного поля по текущему полю
			КоличествоПлан = Количество;
			Если ТипВводаКоличества=ТипыВводаКоличества.Добавить Тогда
				КоличествоПлан = КоличествоПлан + ВведенныеДанныеПолей[ИмяПоляКоличество0];
			КонецЕсли;
		Иначе
			//для общих данных (которые далее попадут в собранные) ввод считается завершенным при добавление любого количества
			//чтобы при вводе штуки данные сразу же сохранялись в базу
			Если ТипВводаКоличества=ТипыВводаКоличества.Добавить И Количество <> 0 Тогда
				ОбщиеДанныеПолей[ИмяПоляЗавершениеВводаКоличества] = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПолеВводаКоличества <> Неопределено Тогда
		
		ПолеКоличества = ПолеМодуля("Количество");
		Если ПолеКоличества <> ПустоеПолеОбработки И НЕ ПолеКоличества.Ввод Тогда
			//заполним поле "Количество" из другого поля количественного поля
			ОбщиеДанныеПолей.Количество0 				= ВведенныеДанныеПолей["Количество0" + ПолеВводаКоличества.Суффикс];
			ОбщиеДанныеПолей.ТипВводаКоличества			= ВведенныеДанныеПолей["ТипВводаКоличества" + ПолеВводаКоличества.Суффикс];
			ОбщиеДанныеПолей.ЗавершениеВводаКоличества	= ОбщиеДанныеПолей["ЗавершениеВводаКоличества" + ПолеВводаКоличества.Суффикс];
			
			ОбщиеДанныеПолей.Количество					= ВведенныеДанныеПолей[ПолеВводаКоличества.Имя];
		КонецЕсли;
		
	КонецЕсли;
	
	Интерфейс.ПроанализироватьЗаполнениеПолейДанных("ВведенныеДанныеПолей, ОбщиеДанныеПолей");
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьПодсказку()

	Если НЕ ПолеВыводится("Подсказка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПредставлениеДанныхПолей = ДанныеТранзакции.ПредставлениеДанныхПолей;

	Если ОжидаетсяПодтверждениеДанных() Тогда
		ПредставлениеДанныхПолей.Подсказка = "<подтвердите данные>";
		УстановитьСвойстваЭлементовВывода("Подсказка", "ЦветФона", Новый Цвет(200, 255, 200));
		Возврат Истина;
	КонецЕсли;
	
	НеЗаполненныеПоляВводаМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.НеЗаполненныеПоляМассив;
	НеЗаполненныеПоляСборкиМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхСборки.НеЗаполненныеПоляМассив;
	
	НеВведеноПолеВвода = Ложь;
	Для Каждого ИмяПоля Из НеЗаполненныеПоляСборкиМассив Цикл
		Если НеЗаполненныеПоляВводаМассив.Найти(ИмяПоля) <> Неопределено Тогда
			//еще не введено
			Продолжить;
		КонецЕсли;
		
		Если ИмяПоля="Количество" Тогда
			Если КоличествоВводится() Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Поле = ПолеМодуля(ИмяПоля);
		Если Поле.Ввод Тогда
			//ввод необязателен, но поле может быть введено
			//предложим ввести
			НеВведеноПолеВвода = Истина;
			НеЗаполненноеПоле = ИмяПоля;
		Иначе
			//поле не вводится и незаполнено, проблема в настройке заданиия кладовщику
			//это приоритетная ошибка, отобразим ее
			НеЗаполненноеПоле = ИмяПоля;
		КонецЕсли;
		
		Прервать;
	КонецЦикла;
	
	Если НеЗаполненноеПоле=Неопределено Тогда
		Если НеЗаполненныеПоляВводаМассив.Количество() > 0 Тогда
			НеЗаполненноеПоле = НеЗаполненныеПоляВводаМассив[0];
			НеВведеноПолеВвода = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НеЗаполненноеПоле=Неопределено Тогда
		ПредставлениеДанныхПолей.Подсказка = "";
		УстановитьСвойстваЭлементовВывода("Подсказка", "ЦветФона", Новый Цвет);
		Возврат Истина;
	КонецЕсли;

	Поле = ПолеМодуля(НеЗаполненноеПоле);
	
	//ПроигратьЗвукСхемы(НеЗаполненноеПоле);
	
	Если НеВведеноПолеВвода Тогда
		Если ЗначениеЗаполнено(Поле.СинонимВинительныйПадеж) Тогда
			Синоним = Поле.СинонимВинительныйПадеж;
		ИначеЕсли ЗначениеЗаполнено(Поле.Синоним) Тогда
			Синоним = Поле.Синоним;
		Иначе
			Синоним = Поле.Имя;
		КонецЕсли;
		Синоним = нрег(Синоним);
		Подсказка = "<введите " + Синоним + ">";
		ПредставлениеДанныхПолей.Подсказка = Подсказка;
		УстановитьСвойстваЭлементовВывода("Подсказка", "ЦветФона", Новый Цвет);
	Иначе
		Если ЗначениеЗаполнено(Поле.Синоним) Тогда
			Синоним = Поле.Синоним;
		Иначе
			Синоним = Поле.Имя;
		КонецЕсли;
		
		Если Поле.Пол="Мужской" Тогда
			Подсказка = "не заполнен"
		ИначеЕсли Поле.Пол="Женский" Тогда
			Подсказка = "не заполнена"
		Иначе
			Подсказка = "не заполнено"
		КонецЕсли;
		
		Синоним = нрег(Синоним);
		Подсказка = "<" + Подсказка + " " + Синоним + ">";
		ПредставлениеДанныхПолей.Подсказка = Подсказка;
		УстановитьСвойстваЭлементовВывода("Подсказка", "ЦветФона", Новый Цвет(255, 200, 200));
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОжидаетсяПодтверждениеДанных()

	НеЗаполненныеПоляВводаМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.НеЗаполненныеПоляМассив;
	ЗаполненныеПоляВводаМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.ЗаполненныеПоляМассив;
	
	Если НеЗаполненныеПоляВводаМассив.Количество() <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяПоля = НеЗаполненныеПоляВводаМассив[0];
	Если НЕ ИмяПоля="Количество" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗаполненныеПоляВводаМассив.Найти(ИмяПоля)=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Поле = ПолеМодуля(ИмяПоля);
	Если Поле.Ввод ИЛИ Поле.Вывод Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция ЗаполнитьПредставлениеДанныхПолей() Экспорт
	
	СборщикДанныхСтандартный.ЗаполнитьПредставлениеДанныхПолей();

	ЗаполнитьПодсказку();
	
	////
	ДанныеЗаполнения = ДанныеТранзакции;
	
	НеЗаполненныеПоляОбщихДанныхМассив = ДанныеЗаполнения.РезультатАнализаЗаполненияПолейОбщихДанных.НеЗаполненныеПоляМассив;
	
	ВведенныеДанныеПолей = ДанныеЗаполнения.ВведенныеДанныеПолей;
	ОбщиеДанныеПолей = ДанныеЗаполнения.ОбщиеДанныеПолей;
	ПредставлениеДанныхПолей = ДанныеЗаполнения.ПредставлениеДанныхПолей;
	
	ЗаполненныеПоляВводаМассив = ДанныеЗаполнения.РезультатАнализаЗаполненияПолейДанныхВвода.ЗаполненныеПоляМассив;

	ЦветФонаПоляНеЗаполнено = Новый Цвет(255, 100, 100);
	
	Для Каждого Поле Из ПоляВывода() Цикл
		
		ИмяПоля = Поле.Имя;
		ЭлементВывода = СтандартныйМодуль.ПолучитьЭлементВыводаДляПоляОбработки(Поле.ИмяЭлементаВывода, Поле);
		
		Если Поле.Ввод И Поле.Группа="Количество" Тогда
			
			//поле ввода количества
			Если ЗаполненныеПоляВводаМассив.Найти(ИмяПоля) <> Неопределено Тогда
				Значение = ВведенныеДанныеПолей[ИмяПоля];
				Если ВведенныеДанныеПолей["ТипВводаКоличества" + Поле.Суффикс]=ТипыВводаКоличества.Добавить Тогда
					//отобразим полное количество
					Значение = Значение + ВведенныеДанныеПолей["Количество0" + Поле.Суффикс];
				КонецЕсли;
			Иначе
				Значение = ОбщиеДанныеПолей["Количество0" + Поле.Суффикс];
			КонецЕсли;
			
			ПредставлениеДанныхПолей[ИмяПоля] = Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИмяПоля = "КоличествоПлан";
	Если ПредставлениеДанныхПолей.Свойство(ИмяПоля) И ОбщиеДанныеПолей.Свойство(ИмяПоля) И ОбщиеДанныеПолей.Свойство("КоличествоФактИтого") Тогда
		КоличествоПлан = ОбщиеДанныеПолей[ИмяПоля];
		КоличествоФактИтого = ОбщиеДанныеПолей["КоличествоФактИтого"];
		МассивСтрок = Новый Массив;
		Если ЗначениеЗаполнено(КоличествоПлан) Тогда
			МассивСтрок.Добавить("План: " + КоличествоПлан);
		Иначе
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока("<товара нет в плане>", , , Новый Цвет(255, 200, 200)));
		КонецЕсли;

		МассивСтрок.Добавить(", Факт всего: " + КоличествоФактИтого);
		ПредставлениеДанныхПолей[ИмяПоля] = Новый ФорматированнаяСтрока(МассивСтрок);
	КонецЕсли;
	
	
	УстановитьСвойстваКнопкиДальше();
	
	Возврат ПредставлениеДанныхПолей;
	
КонецФункции

Функция УстановитьСвойстваКнопкиДальше()

	КнопкаДалее = ЭлементВывода("КнопкаДалее");
	Если КнопкаДалее=ПустойЭлементВывода Тогда
		//нет такой бук.. кнопки
		Возврат Ложь;
	КонецЕсли;
	
	ОбщиеДанныеПолей = ДанныеТранзакции.ОбщиеДанныеПолей;
	Если ОбщиеДанныеПолей.Свойство("КоличествоПлан") И ОбщиеДанныеПолей.Свойство("КоличествоФактИтого")
		И ОбщиеДанныеПолей.КоличествоПлан <> 0
		И ОбщиеДанныеПолей.КоличествоПлан=ОбщиеДанныеПолей.КоличествоФактИтого Тогда
		ЦветФона = Новый Цвет(62, 175, 118);
		Если НЕ ПараметрыМодуля.АнимацияКнопкиДалееУстановлена Тогда
			УстановитьАнимациюВводЗавершен();
			СтандартныйМодуль.ЗаморозитьТаймеры(2000);
			ПараметрыМодуля.АнимацияКнопкиДалееУстановлена = Истина;
		КонецЕсли;
	Иначе
		ЦветФона = Новый Цвет(125, 125, 118);
	КонецЕсли;
	
	УстановитьСвойстваЭлементовВывода(КнопкаДалее, Новый Структура("ЦветФона", ЦветФона));
	
	Если ОжидаетсяПодтверждениеДанных() Тогда
		УстановитьСвойстваЭлементовВывода(КнопкаДалее, "Заголовок", "Подтвердить");
	Иначе
		УстановитьСвойстваЭлементовВывода(КнопкаДалее, "Заголовок", "Далее");
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция УстановитьАнимациюВводЗавершен()

	Анимация = Новый Массив;
	Анимация.Добавить(Новый Структура("Начало, Значение1", 0, "      Далее"));
	Анимация.Добавить(Новый Структура("Начало, Значение1", 1, "          Далее"));
	Анимация.Добавить(Новый Структура("Начало, Значение1", 4, "Далее"));

	Для Каждого Эффект Из Анимация Цикл
		Эффект.Вставить("Повторять", Ложь); //ТУ_КС для совместимости
		Эффект.Вставить("ПолеОбъекта", "Заголовок");
	КонецЦикла;
	
	УстановитьСвойстваЭлементовВывода("КнопкаДалее", "Анимация", Анимация);
	
КонецФункции

Функция РезультатАнализаЗаполненияПолейДанных(Поля, Данные) Экспорт

	Перем ЗначениеПоля;
	
	ВведенныеДанныеПолей = ДанныеТранзакции.ВведенныеДанныеПолей;
	ОбщиеДанныеПолей = ДанныеТранзакции.ОбщиеДанныеПолей;
	
	Результат = Обработки.вмс_СерверУправляемыйМодульСборщикДанных.НовыйРезультатАнализаЗаполненияПолейДанных();
	
	НеЗаполненныеПоляМассив = Результат.НеЗаполненныеПоляМассив;
	ЗаполненныеПоляМассив = Результат.ЗаполненныеПоляМассив;
	
	ОсновныеПоляЗаполнены = Истина;
	Для Каждого Поле Из Поля Цикл
		
		ИмяПоля = Поле.Имя;
		Если НЕ Данные.Свойство(ИмяПоля, ЗначениеПоля) Тогда
			Продолжить;
		КонецЕсли;
		
		Группа = Поле.Группа;
		Если Группа="Количество" Тогда
			
			//анализ количества не напрямую, а через служебное поле "ЗавершениеВводаКоличества"
			Продолжить;
			
		ИначеЕсли Группа="ЗавершениеВводаКоличества" Тогда
			
			ЗаполненныеПоляМассив.Добавить(ИмяПоля);
			
			ЗавершениеВводаКоличества = ЗначениеПоля;

			ИмяПоля = "Количество" + Поле.Суффикс;
			ЗначениеПоляЗаполнено = Данные.Свойство(ИмяПоля, ЗначениеПоля) ИЛИ ОбщиеДанныеПолей.Свойство(ИмяПоля, ЗначениеПоля);
			
			Если ЗначениеПоля=Неопределено Тогда
				//полностью незаполнено
				Заполнено = Ложь;
				НеЗаполнено = Истина;
			Иначе
				Заполнено = Истина;
				Если ЗавершениеВводаКоличества Тогда
					//полностью заполнено
					НеЗаполнено = Ложь;
				Иначе
					//заполнено частично
					НеЗаполнено = Истина;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			Заполнено = Поле.ПустыеЗначения.Найти(ЗначениеПоля)=Неопределено;
			НеЗаполнено = Не Заполнено;
			
			Если НеЗаполнено Тогда
				
				//уточним незаполненное значение
				Если Данные=ВведенныеДанныеПолей И НЕ Поле.ОбязательныйВвод Тогда
					//можно не вводить
					НеЗаполнено = Ложь;
				ИначеЕсли НЕ Поле.ОбязательноеЗаполнение Тогда
					//можно не заполнять
					НеЗаполнено = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Заполнено Тогда
			ЗаполненныеПоляМассив.Добавить(ИмяПоля);
		КонецЕсли;
		
		Если НеЗаполнено Тогда
			НеЗаполненныеПоляМассив.Добавить(ИмяПоля);
			Если НЕ Поле.Ресурс Тогда
				ОсновныеПоляЗаполнены = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.ОсновныеПоляЗаполнены = ОсновныеПоляЗаполнены;
	
	Обработки.вмс_СерверУправляемыйМодульСборщикДанных.ФинализироватьРезультатАнализаЗаполненияПолейДанных(Результат);

	Возврат Результат;
	
КонецФункции

Функция СохранитьСостояниеОбработки() Экспорт
	
	СборщикДанныхСтандартный.СохранитьСостояниеОбработки();
	
	СостояниеМодуля.Вставить("ПоляОбработкиИнструкцийЗадания", ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания);
	СостояниеМодуля.Вставить("ПоляОбработкиИнструкцийЗаданияДляПоиска", ПараметрыМодуля.ПоляОбработкиИнструкцийЗаданияДляПоиска);
	СостояниеМодуля.Вставить("ИдентификаторИнструкцииПолейОбработки", ПараметрыМодуля.ИдентификаторИнструкцииПолейОбработки);
	
КонецФункции

Функция ВосстановитьСостояниеОбработки() Экспорт
	
	СборщикДанныхСтандартный.ВосстановитьСостояниеОбработки();

	ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания = СостояниеМодуля.ПоляОбработкиИнструкцийЗадания;
	ПараметрыМодуля.ПоляОбработкиИнструкцийЗаданияДляПоиска = СостояниеМодуля.ПоляОбработкиИнструкцийЗаданияДляПоиска;
	ПараметрыМодуля.ИдентификаторИнструкцииПолейОбработки = СостояниеМодуля.ИдентификаторИнструкцииПолейОбработки;
	
КонецФункции

Функция ВыполнитьЗавершениеОперации() Экспорт
	
	Если ПараметрыОбработки.Инвентаризация Тогда
		ВыполнитьЗавершениеИнвентаризации();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьЗавершениеИнвентаризации()

	ТаблицаПланФакт = ДанныеОбработки.Таблицы.ТаблицаПланФакт;

	ДанныеОбновленияТаблицыПланФакт = ПараметрыТаблицы("ТаблицаПланФакт");
	ДанныеОбновленияТаблицыПланФакт.Ресурсы.Вставить("КоличествоУчет", 0);
	
	ДанныеФакта = ПолучитьТаблицуФакт(Истина, Истина);
	ЗаполнитьТаблицуПланФакт(ДанныеФакта);
	
	ОперацияПоЯчейкам = ПолучитьДокументОперацииПоЯчейкам();
	ТаблицаДокумента = ОперацияПоЯчейкам[ПараметрыОбработки.ИмяТаблицыФакта];
	Для Каждого ЭлементПланФакт Из ТаблицаПланФакт Цикл
		Если ЭлементПланФакт.КоличествоФактЗаполнено Тогда
			Продолжить;
		КонецЕсли;
		
		//дополним нулевым фактом невведенные элементы
		СтрокаДокумента = ТаблицаДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, ЭлементПланФакт);
		СтрокаДокумента.Количество = 0;
		СтрокаДокумента.КоличествоБазовыхЕдиниц = 0;
	КонецЦикла;
	
	ЗаписатьДокументОперацииПоЯчейкам(ОперацияПоЯчейкам);
	
КонецФункции

#КонецОбласти

//
//						Реализация методов-
//
////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////
//
//						Библиотека функций+
//

#Область БиблиотекаФункций

Функция ОпределитьСледующуюИнструкцию() Экспорт
	
	ТаблицаПланФакт = ДанныеОбработки.Таблицы.ТаблицаПланФакт;
	ТекущаяИнструкцияМассив = ТаблицаПланФакт.НайтиСтроки(Новый Структура("ИдентификаторИнструкцииДляПоиска", ПолучитьЗначениеДанныхПоляМодуля("ИдентификаторИнструкцииДляПоиска")));
	Если ТекущаяИнструкцияМассив.Количество() > 0 Тогда
		НомерИнструкции = ТекущаяИнструкцияМассив[0].НомерИнструкции;
	Иначе
		НомерИнструкции = 0;
	КонецЕсли;
	
	КоличествоИнструкций = ТаблицаПланФакт.Количество();
	Поиск = Новый Структура("НомерИнструкции");
	НомерИнструкции = НомерИнструкции + 1;
	Для НомерПоиска=1 По 2 Цикл
		Пока НомерИнструкции <= КоличествоИнструкций Цикл
			Поиск.НомерИнструкции = НомерИнструкции;
			ИнструкцияМассив = ТаблицаПланФакт.НайтиСтроки(Поиск);
			Если ИнструкцияМассив.Количество()=0 Тогда
				НомерИнструкции = НомерИнструкции + 1;
				Продолжить;
			КонецЕсли;
			
			Инструкция = ИнструкцияМассив[0];
			Если Инструкция.Выполнен Тогда
				НомерИнструкции = НомерИнструкции + 1;
				Продолжить;
			КонецЕсли;
			
			УстановитьЗначениеДанныхПоляМодуля("ИдентификаторИнструкцииДляПоиска", Инструкция.ИдентификаторИнструкцииДляПоиска);
			Возврат Инструкция.ИдентификаторИнструкцииДляПоиска;
		КонецЦикла;
		
		НомерИнструкции = 1; //поищем с начала таблицы
	КонецЦикла;
	
	//нет инструкций
	УстановитьЗначениеДанныхПоляМодуля("ИдентификаторИнструкцииДляПоиска", 0);
	Возврат 0;
	
КонецФункции

Функция ЗаполнитьТаблицы() Экспорт
	
	ДанныеФакт = ПолучитьТаблицуФакт();

	ЗаполнитьТаблицуПланФакт(ДанныеФакт);
	
	ЗаполнитьТаблицуФакт(ДанныеФакт);
	
	//ЗаполнитьТаблицуФактБыдлоКодер(ДанныеФакт);
	
КонецФункции

Функция ЗаполнитьТаблицуПланФакт(ДанныеФакт)

	ТаблицаПланФакт = ДанныеОбработки.Таблицы.ТаблицаПланФакт;
	ДанныеОбновленияТаблицыПланФакт = ПараметрыТаблицы("ТаблицаПланФакт");
	
	НачалоОбновленияТаблицы(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт);

	ЗначенияПоУмолчанию = ЗначенияПоУмолчаниюЭлементаТаблицыПланФакт();

	//план
	НоваяВерсияДокументаЗадания = вмс_ОбщегоНазначенияВызовСервера.ВерсияДанных(ПараметрыОбработки.СсылкаНаЗадание);
	Если ПараметрыОбработки.ВерсияДокументаЗадания <> НоваяВерсияДокументаЗадания Тогда
		Если НоваяВерсияДокументаЗадания <> "" Тогда
			ПараметрыОбработки.Задание.Прочитать();
		КонецЕсли;
		ДанныеИнструкций = ПолучитьТаблицуПлана();
		ОбновитьДанныеТаблицы(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт, ДанныеИнструкций, "ИдентификаторИнструкцииЗаполнен, ИдентификаторИнструкции", Истина, "КоличествоПлан", ЗначенияПоУмолчанию);

		ЗаполнитьТаблицуМодификацииПолейИнструкцийЗадания(ДанныеИнструкций.ВыгрузитьКолонку("ИдентификаторИнструкции"), ПрочитатьМодификациюПолейИнструкцийЗадания(ПараметрыОбработки.Задание));
	КонецЕсли;
	
	//факт
	ДанныеПланФакт = ДанныеФакт.Скопировать();
	ЗначенияКолонкиКоличествоФакт = ДанныеПланФакт.ВыгрузитьКолонку("КоличествоФакт");
	ДанныеПланФакт.Колонки.Добавить("КоличествоФактИтого");
	ДанныеПланФакт.ЗагрузитьКолонку(ЗначенияКолонкиКоличествоФакт, "КоличествоФактИтого");
	
	ДанныеПланФакт.Колонки.Добавить("КоличествоФактЗаполнено");
	ДанныеПланФакт.ЗаполнитьЗначения(1, "КоличествоФактЗаполнено");

	ОсновныеПоляПлана = ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания.Скопировать(Новый Структура("ИдентификаторИнструкции, План, Ресурс", 0, Истина, Ложь)).ВыгрузитьКолонку("Имя");
	ПоляГруппировкиМассив = РК.ПолучитьКолонкиКоллекции(ТаблицаПланФакт);
	ПоляГруппировкиМассив = РК.ПересечениеМассивов(РК.ПолучитьКолонкиКоллекции(ДанныеПланФакт), ПоляГруппировкиМассив);
	ПоляГруппировкиМассив = РК.ПересечениеМассивов(ОсновныеПоляПлана, ПоляГруппировкиМассив);
	ПоляГруппировки = РК.МассивВСтроку(ПоляГруппировкиМассив);
	
	Поиск = Новый Массив;
	Поиск.Добавить(Новый Структура("ИдентификаторИнструкцииЗаполнен, ИдентификаторИнструкции", Истина));
	Поиск.Добавить(Новый Структура("ИдентификаторИнструкцииЗаполнен, " + ПоляГруппировки, Ложь));

	ОбновитьДанныеТаблицы(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт, ДанныеПланФакт, Поиск, Истина, "КоличествоФактИтого, КоличествоФактЗаполнено", ЗначенияПоУмолчанию);
	
	//план по предыдущему количеству
	Если ПараметрыОбработки.Инвентаризация Тогда
		ЗаполнитьКоличествоУчетТаблицыПланФакт(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт, Поиск, ЗначенияПоУмолчанию);
	КонецЕсли;
	
	ОбновитьИзмененныеЭлементыТаблицыПланФакт(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт);
	
	КонецОбновленияТаблицы(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт);
	
КонецФункции

Функция ОбновитьИзмененныеЭлементыТаблицыПланФакт(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт)
	
	ИзмененныеЭлементы = ДанныеОбновленияТаблицыПланФакт.ИзмененныеЭлементы;
	Если ИзмененныеЭлементы.Количество() > 0 Тогда
		УдалитьПустыеЭлементыТаблицы(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт);
		ЗаполнитьКоличествоФактИтогоВТаблице(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт);
	КонецЕсли;
	
	НовыеЭлементы = ДанныеОбновленияТаблицыПланФакт.НовыеЭлементы;
	Если НовыеЭлементы.Количество() > 0 Тогда
		ЗаполнитьИдентификаторыИнструкцийТаблицыПланФакт(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт, НовыеЭлементы);
		ЗаполнитьПоляОбработкиИнструкцийТаблицыПланФакт(ТаблицаПланФакт, НовыеЭлементы);
		ОбновитьПредставлениеТоваровВТаблице(ТаблицаПланФакт, НовыеЭлементы);
	КонецЕсли;
	
	Если ИзмененныеЭлементы.Количество() > 0 Тогда
		УстановитьОформлениеЭлементовТаблицыПланФакт(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт);
	КонецЕсли;
	
	УдаленныеЭлементы = ДанныеОбновленияТаблицыПланФакт.УдаленныеЭлементы;
	Если УдаленныеЭлементы.Количество() > 0 Тогда
		УдалитьДанныеИнструкцийЗадания(УдаленныеЭлементы);
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьКоличествоФактИтогоВТаблице(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт)
	
	ДополнительныеДанныеЭлементов = ДанныеОбновленияТаблицыПланФакт.ДополнительныеДанныеЭлементов;
	
	Для Каждого ИндексЭлемента Из ДанныеОбновленияТаблицыПланФакт.ИзмененныеЭлементы Цикл
		ДополнительныеДанныеЭлемента = ДополнительныеДанныеЭлементов[ИндексЭлемента];
		Элемент = ТаблицаПланФакт[ИндексЭлемента];
		Элемент.КоличествоФактИтогоВТаблице = Элемент.КоличествоФактИтого;
	КонецЦикла;
	
КонецФункции

Функция УдалитьДанныеИнструкцийЗадания(знач ИдентификаторыИнструкций)
	
	Если ТипЗнч(ИдентификаторыИнструкций) <> Тип("Массив") Тогда
		ИдентификаторИнструкции = ИдентификаторыИнструкций;
		ИдентификаторыИнструкций = Новый Массив;
		ИдентификаторыИнструкций.Добавить(ИдентификаторИнструкции);
	КонецЕсли;
	
	ОтборПоИдентификатору = Новый Структура("ИдентификаторИнструкции");
	ОтборПоИдентификаторуДляПоиска = Новый Структура("ИдентификаторИнструкцииДляПоиска");
	ТаблицаМодификацииПолейИнструкцийЗадания = ДанныеОбработки.Таблицы.ТаблицаМодификацииПолейИнструкцийЗадания;
	ПоляОбработкиИнструкцийЗадания = ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания;
	ПоляОбработкиИнструкцийЗаданияДляПоиска = ПараметрыМодуля.ПоляОбработкиИнструкцийЗаданияДляПоиска;
	ТаблицаПланФакт = ДанныеОбработки.Таблицы.ТаблицаПланФакт;
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого ИдентификаторИнструкции Из ИдентификаторыИнструкций Цикл
		
		Если ИдентификаторИнструкции=0 Тогда
			ВызватьИсключение "Идентификатор инструкции не указан!"
		КонецЕсли;
		
		ОтборПоИдентификатору.ИдентификаторИнструкции = ИдентификаторИнструкции;

		Для Каждого МодификацияПоля Из ТаблицаМодификацииПолейИнструкцийЗадания.НайтиСтроки(ОтборПоИдентификатору) Цикл
			ТаблицаМодификацииПолейИнструкцийЗадания.Удалить(МодификацияПоля);
		КонецЦикла;
		
		Для Каждого ПолеИнструкции Из ПоляОбработкиИнструкцийЗадания.НайтиСтроки(ОтборПоИдентификатору) Цикл
			ПоляОбработкиИнструкцийЗадания.Удалить(ПолеИнструкции);
		КонецЦикла;
		
		ПоляОбработкиИнструкцийЗаданияДляПоиска.Удалить(ИдентификаторИнструкции);
		
		ОтборПоИдентификаторуДляПоиска.ИдентификаторИнструкцииДляПоиска = ИдентификаторИнструкции;
		ЭлементТаблицыМассив = ТаблицаПланФакт.НайтиСтроки(ОтборПоИдентификаторуДляПоиска);
		Для Каждого ЭлементТаблицы Из ЭлементТаблицыМассив Цикл
			ИндексЭлемента = ТаблицаПланФакт.Индекс(ЭлементТаблицы);
			УдаляемыеЭлементы.Добавить(ИндексЭлемента);
		КонецЦикла;
		
	КонецЦикла;
	
	УдалитьЭлементыТаблицы(ТаблицаПланФакт, ПараметрыТаблицы("ТаблицаПланФакт"), УдаляемыеЭлементы);
	
КонецФункции

Функция ЗначенияПоУмолчаниюЭлементаТаблицыПланФакт()

	ЗначенияПоУмолчанию = Новый Структура;
	ЗначенияПоУмолчанию.Вставить("НомерИнструкции", 0);
	ЗначенияПоУмолчанию.Вставить("ИдентификаторИнструкцииЗаполнен", Ложь);
	ЗначенияПоУмолчанию.Вставить("ИдентификаторИнструкции", 0);
	ЗначенияПоУмолчанию.Вставить("ИдентификаторИнструкцииДляПоиска", 0);
	ЗначенияПоУмолчанию.Вставить("Выполнен", Ложь);
	ЗначенияПоУмолчанию.Вставить("КоличествоПлан", 0);
	ЗначенияПоУмолчанию.Вставить("КоличествоФактИтогоВТаблице", 0);
	ЗначенияПоУмолчанию.Вставить("КоличествоФактИтого", 0);
	ЗначенияПоУмолчанию.Вставить("КоличествоФактЗаполнено", 0);
	Если ПараметрыОбработки.Инвентаризация Тогда
		ЗначенияПоУмолчанию.Вставить("КоличествоУчет", 0);
	КонецЕсли;
	
	Возврат ЗначенияПоУмолчанию;
	
КонецФункции

Функция ЗаполнитьКоличествоУчетТаблицыПланФакт(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт, Поиск, ЗначенияПоУмолчанию)
	
	//новый план по предыдущей операции
	ДанныеПланФакт = ПолучитьТаблицуФакт(Ложь, Истина);

	ОбновитьДанныеТаблицы(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт, ДанныеПланФакт, Поиск, Ложь, , ЗначенияПоУмолчанию);
	
	ИзмененныеЭлементы = Новый Массив;
	
	ДанныеОбновленияЭлементов = ДанныеОбновленияТаблицыПланФакт.ДополнительныеДанныеЭлементов;
	Для ИндексЭлемента=0 По ДанныеОбновленияЭлементов.Количество()-1 Цикл
		ЭлементДанных = ТаблицаПланФакт[ИндексЭлемента];
		ЭлементОбновленияДанных = ДанныеОбновленияЭлементов[ИндексЭлемента];
		
		Если ЭлементОбновленияДанных.ФлагОбработки=ДанныеОбновленияТаблицыПланФакт.ФлагОбработки Тогда
			Значение = 0;
			Для Каждого ИндексЭлементаЗагрузки Из ЭлементОбновленияДанных.ЭлементыЗагрузки Цикл
				Значение = Значение + ДанныеПланФакт[ИндексЭлементаЗагрузки].КоличествоФакт;
			КонецЦикла;
		Иначе
			Значение = ЭлементДанных.КоличествоПлан;
		КонецЕсли;
		
		Если ЭлементДанных.КоличествоУчет <> Значение Тогда
			ЭлементДанных.КоличествоУчет = Значение;
			ИзмененныеЭлементы.Добавить(ИндексЭлемента);
		КонецЕсли;
	КонецЦикла;
	
	ЗарегистрироватьИзмененияЭлементовТаблицы(ДанныеОбновленияТаблицыПланФакт, ИзмененныеЭлементы);
	
КонецФункции

Функция ЗаполнитьИдентификаторыИнструкцийТаблицыПланФакт(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт, НовыеЭлементы)
	
	Если НовыеЭлементы.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторНовойИнструкции = ДанныеОбновленияТаблицыПланФакт.ИдентификаторНовойИнструкции;
	
	ДополнительныеДанныеЭлементов = ДанныеОбновленияТаблицыПланФакт.ДополнительныеДанныеЭлементов;

	СгенерироватьИдентификаторыДляЭлементов = Новый Массив;
	//сначала обработаем инструкции из задания, потом сгенерируем идентификаторы инструкций вне плана
	Для Каждого ИндексНовогоЭлемента Из НовыеЭлементы Цикл
		НовыйЭлемент = ТаблицаПланФакт[ИндексНовогоЭлемента];
		
		НовыйЭлемент.ИдентификаторИнструкцииЗаполнен = НовыйЭлемент.ИдентификаторИнструкции <> 0;

		Если НовыйЭлемент.ИдентификаторИнструкцииЗаполнен Тогда
			НовыйЭлемент.ИдентификаторИнструкцииДляПоиска = НовыйЭлемент.ИдентификаторИнструкции;

			Если ИдентификаторНовойИнструкции <= НовыйЭлемент.ИдентификаторИнструкцииДляПоиска Тогда
				ИдентификаторНовойИнструкции = НовыйЭлемент.ИдентификаторИнструкцииДляПоиска + 1;
			КонецЕсли;
		ИначеЕсли НовыйЭлемент.ИдентификаторИнструкцииДляПоиска=0 Тогда
			СгенерироватьИдентификаторыДляЭлементов.Добавить(ИндексНовогоЭлемента);
		КонецЕсли;
	КонецЦикла;
	
	Если СгенерироватьИдентификаторыДляЭлементов.Количество() > 0 Тогда
		Для Каждого ИндексНовогоЭлемента Из СгенерироватьИдентификаторыДляЭлементов Цикл
			НовыйЭлемент = ТаблицаПланФакт[ИндексНовогоЭлемента];
			НовыйЭлемент.ИдентификаторИнструкцииДляПоиска = ИдентификаторНовойИнструкции;
			
			ИдентификаторНовойИнструкции = ИдентификаторНовойИнструкции + 1;
		КонецЦикла;
	КонецЕсли;
	
	//синхронизируем идентификаторы инструкций с идентификаторами на клиенте
	Для Каждого ИндексНовогоЭлемента Из НовыеЭлементы Цикл
		НовыйЭлемент = ТаблицаПланФакт[ИндексНовогоЭлемента];
		ДополнительныеДанныеЭлемента = ДополнительныеДанныеЭлементов[ИндексНовогоЭлемента];
		ДополнительныеДанныеЭлемента.Идентификатор = НовыйЭлемент.ИдентификаторИнструкцииДляПоиска;
	КонецЦикла;
	
	ДанныеОбновленияТаблицыПланФакт.ИдентификаторНовойИнструкции = ИдентификаторНовойИнструкции;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьПоляОбработкиИнструкцийТаблицыПланФакт(ТаблицаПланФакт, Элементы)

	Если Элементы.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторыИнструкцийБезНастройкиПолей = Новый Массив;
	ДанныеДляРасчетаМодификацииПолейИнструкцийЗаданий = Новый Массив;

	ИдентификаторыИнструкций = Новый Массив;
	
	Для Каждого ИндексНовогоЭлемента Из Элементы Цикл
		НовыйЭлемент = ТаблицаПланФакт[ИндексНовогоЭлемента];
		ИдентификаторыИнструкций.Добавить(НовыйЭлемент.ИдентификаторИнструкцииДляПоиска);
		
		Если НЕ НовыйЭлемент.ИдентификаторИнструкцииЗаполнен Тогда
			ИдентификаторыИнструкцийБезНастройкиПолей.Добавить(НовыйЭлемент.ИдентификаторИнструкцииДляПоиска);
			ДанныеДляРасчетаМодификацииПолейИнструкцийЗаданий.Добавить(НовыйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	Если ИдентификаторыИнструкцийБезНастройкиПолей.Количество() > 0 Тогда
		МодификацияПолейНовыхИнструкцийЗаданий = РассчитатьМодификациюПолейНовыхИнструкцийЗаданий(ПараметрыОбработки.Задание, ДанныеДляРасчетаМодификацииПолейИнструкцийЗаданий);
		ЗаполнитьТаблицуМодификацииПолейИнструкцийЗадания(ИдентификаторыИнструкцийБезНастройкиПолей, МодификацияПолейНовыхИнструкцийЗаданий);
	КонецЕсли;
	
	ЗаполнитьПоляОбработкиИнструкцийЗадания(ИдентификаторыИнструкций);
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьТаблицуФакт(ДанныеФакт)

	ТаблицаФакт = ДанныеОбработки.Таблицы.ТаблицаФакт;
	ДанныеОбновленияТаблицыФакт = ПараметрыТаблицы("ТаблицаФакт");

	НачалоОбновленияТаблицы(ТаблицаФакт, ДанныеОбновленияТаблицыФакт);
	
	ПоляФактаМассив = РК.ПересечениеМассивов(СписокПолейМодуля(Новый Структура("Сборка, Ресурс", Истина, Ложь)), РК.ПолучитьКолонкиКоллекции(ТаблицаФакт));
	ПоляФакта = РК.МассивВСтроку(ПоляФактаМассив);

	ОбновитьДанныеТаблицы(ТаблицаФакт, ДанныеОбновленияТаблицыФакт, ДанныеФакт, ПоляФакта, Истина, "КоличествоФакт");

	Если ДанныеОбновленияТаблицыФакт.ИзмененныеЭлементы.Количество() > 0 И ДанныеОбновленияТаблицыФакт.Ресурсы.Количество() > 0 Тогда
		УдалитьПустыеЭлементыТаблицы(ТаблицаФакт, ДанныеОбновленияТаблицыФакт);
	КонецЕсли;
	
	ЗаполнитьИдентификаторыИнструкцийТаблицыФакт(ТаблицаФакт, ДанныеОбновленияТаблицыФакт);
	
	ОбновитьПредставлениеТоваровВТаблице(ТаблицаФакт, ДанныеОбновленияТаблицыФакт.НовыеЭлементы);
	
	КонецОбновленияТаблицы(ТаблицаФакт, ДанныеОбновленияТаблицыФакт);
	
КонецФункции

Функция ЗаполнитьИдентификаторыИнструкцийТаблицыФакт(ТаблицаФакт, ДанныеОбновленияТаблицыФакт)
	
	НовыеЭлементы = ДанныеОбновленияТаблицыФакт.НовыеЭлементы;
	Если НовыеЭлементы.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеОбновленияЭлементовТаблицыФакт = ДанныеОбновленияТаблицыФакт.ДополнительныеДанныеЭлементов;
	
	НайтиИдентификаторыДляЭлементов = Новый Массив;
	Для Каждого ИндексНовогоЭлемента Из НовыеЭлементы Цикл
		
		НовыйЭлемент = ТаблицаФакт[ИндексНовогоЭлемента];
		
		НовыйЭлемент.ИдентификаторИнструкцииЗаполнен = НовыйЭлемент.ИдентификаторИнструкции <> 0;

		Если НовыйЭлемент.ИдентификаторИнструкцииДляПоиска=Неопределено Тогда
			Если НовыйЭлемент.ИдентификаторИнструкцииЗаполнен Тогда
				НовыйЭлемент.ИдентификаторИнструкцииДляПоиска = НовыйЭлемент.ИдентификаторИнструкции;
			Иначе
				НайтиИдентификаторыДляЭлементов.Добавить(НовыйЭлемент);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НайтиИдентификаторыДляЭлементов.Количество() > 0 Тогда
		
		ТаблицаПланФакт = ДанныеОбработки.Таблицы.ТаблицаПланФакт;
		ДанныеОбновленияТаблицыПланФакт = ПараметрыТаблицы("ТаблицаПланФакт");
		ДанныеОбновленияЭлементовТаблицыПланФакт = ДанныеОбновленияТаблицыПланФакт.ДополнительныеДанныеЭлементов;
		
		ПоляПланаМассив = РК.ВыгрузитьЗначенияКолонкиКоллекции(ПараметрыМодуля.ПоляОбработкиИнструкцийЗадания.НайтиСтроки(Новый Структура("ИдентификаторИнструкции, План, Ресурс", 0, Истина, Ложь)), "Имя");
		
		ПоляГруппировкиМассив = РК.ПолучитьКолонкиКоллекции(ТаблицаПланФакт);
		ПоляГруппировкиМассив = РК.ПересечениеМассивов(РК.ПолучитьКолонкиКоллекции(ТаблицаФакт), ПоляГруппировкиМассив);
		ПоляГруппировкиМассив = РК.ПересечениеМассивов(ПоляПланаМассив, ПоляГруппировкиМассив);
		РК.ВычестьМассив(ПоляГруппировкиМассив, "ИдентификаторИнструкцииДляПоиска");
		ПоляГруппировки = РК.МассивВСтроку(ПоляГруппировкиМассив);
		Отбор = Новый Структура(ПоляГруппировки);
		
		Для Каждого Элемент Из НайтиИдентификаторыДляЭлементов Цикл
			ЗаполнитьЗначенияСвойств(Отбор, Элемент);
			НайденныеСтрокиТаблицыПланФакт = ТаблицаПланФакт.НайтиСтроки(Отбор);
			Если НайденныеСтрокиТаблицыПланФакт.Количество() > 0 Тогда
				Элемент.ИдентификаторИнструкцииДляПоиска = НайденныеСтрокиТаблицыПланФакт[0].ИдентификаторИнструкцииДляПоиска;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	//Для Каждого ИндексНовогоЭлемента Из НовыеЭлементы Цикл
	//	НовыйЭлемент = ТаблицаФакт[ИндексНовогоЭлемента];
	//	ДанныеОбновленияЭлементаТаблицыФакт = ДанныеОбновленияЭлементовТаблицыФакт[ИндексНовогоЭлемента];
	//	ДанныеОбновленияЭлементаТаблицыФакт.Идентификатор = НовыйЭлемент.ИдентификаторИнструкцииДляПоиска;
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьТаблицуФактБыдлоКодер(ДанныеФакт)

	ТаблицаФакт = ДанныеОбработки.Таблицы.ТаблицаФакт;
	ТаблицаФакт.Очистить();
	Для Каждого СтрокаДанныеФакт Из ДанныеФакт Цикл
		СтрокаФакт = ТаблицаФакт.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаФакт, СтрокаДанныеФакт);
		СтрокаФакт.ПредставлениеТовара = СтрокаФакт.Товар;
	КонецЦикла;
	
КонецФункции

Функция НачалоОбновленияТаблицы(Таблица, ДанныеОбновленияТаблицы)
	
	ДанныеОбновленияТаблицы.ФлагОбработки = 0;
	ДанныеОбновленияТаблицы.ДополнительныеДанныеЭлементов.ЗаполнитьЗначения(0, "ФлагОбработки");
	
	ДанныеОбновленияТаблицы.НовыеЭлементы.Очистить();
	ДанныеОбновленияТаблицы.ИзмененныеЭлементы.Очистить();
	ДанныеОбновленияТаблицы.ИзмененныеЭлементыВСписке.Очистить();
	
КонецФункции

Функция ОчиститьИнструкцииНеЗавершеннойТранзакцииВвода(Таблица, ДанныеОбновленияТаблицы)
	
	НовыеИдентификаторыИнструкций = ДанныеТранзакции.НовыеИдентификаторыИнструкций;
	Если НовыеИдентификаторыИнструкций.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УдалитьДанныеИнструкцийЗадания(НовыеИдентификаторыИнструкций);
	
	НовыеИдентификаторыИнструкций.Очистить();
	
	Возврат Истина;
	
КонецФункции

Функция КонецОбновленияТаблицы(Таблица, ДанныеОбновленияТаблицы)
	
КонецФункции

Функция УдалитьПустыеЭлементыТаблицы(Таблица, ДанныеОбновленияТаблицы)

	УдаляемыеЭлементы = ПолучитьПустыеЭлементыДляУдаленияТаблицы(Таблица, ДанныеОбновленияТаблицы, ДанныеОбновленияТаблицы.ИзмененныеЭлементы);
	
	Если УдаляемыеЭлементы.Количество() > 0 Тогда
		УдалитьЭлементыТаблицы(Таблица, ДанныеОбновленияТаблицы, УдаляемыеЭлементы);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПустыеЭлементыДляУдаленияТаблицы(Таблица, ДанныеОбновленияТаблицы, СписокЭлементов)
	
	ПустыеЭлементыДляУдаления = ПолучитьПустыеЭлементыТаблицы(Таблица, ДанныеОбновленияТаблицы, СписокЭлементов);
	
	ДополнительныеДанныеЭлементов = ДанныеОбновленияТаблицы.ДополнительныеДанныеЭлементов;
	ИндексПустогоЭлементаДляУдаленияВСпискеПустыхЭлементовДляУдаления = ПустыеЭлементыДляУдаления.Количество();
	Пока ИндексПустогоЭлементаДляУдаленияВСпискеПустыхЭлементовДляУдаления > 0 Цикл
		ИндексПустогоЭлементаДляУдаленияВСпискеПустыхЭлементовДляУдаления = ИндексПустогоЭлементаДляУдаленияВСпискеПустыхЭлементовДляУдаления - 1;
		ИндексПустогоЭлемента = ПустыеЭлементыДляУдаления[ИндексПустогоЭлементаДляУдаленияВСпискеПустыхЭлементовДляУдаления];
		ДополнительныеДанныеЭлемента = ДополнительныеДанныеЭлементов[ИндексПустогоЭлемента];
		Если НЕ ДополнительныеДанныеЭлемента.УдалятьПустые Тогда
			ПустыеЭлементыДляУдаления.Удалить(ИндексПустогоЭлементаДляУдаленияВСпискеПустыхЭлементовДляУдаления);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПустыеЭлементыДляУдаления;
	
КонецФункции

Функция ПолучитьПустыеЭлементыТаблицы(Таблица, ДанныеОбновленияТаблицы, СписокЭлементов)

	Ресурсы = ДанныеОбновленияТаблицы.Ресурсы;
	ПустыеЭлементы = Новый Массив;
	Если Ресурсы.Количество()=0 Тогда
		Возврат ПустыеЭлементы;
	КонецЕсли;
	
	ДанныеОбновленияЭлементов = ДанныеОбновленияТаблицы.ДополнительныеДанныеЭлементов;
	
	Для Каждого ИндексЭлемента Из СписокЭлементов Цикл
		ДанныеОбновленияЭлемента = ДанныеОбновленияЭлементов[ИндексЭлемента];
		
		Элемент = Таблица[ИндексЭлемента];
		
		Пустой = Истина;
		Для Каждого Ресурс Из Ресурсы Цикл
			Если Элемент[Ресурс.Ключ] <> Ресурс.Значение Тогда
				Пустой = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Пустой Тогда
			ПустыеЭлементы.Добавить(ИндексЭлемента);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПустыеЭлементы;
	
КонецФункции

Функция ОбновитьДанныеТаблицы(Таблица, ДанныеОбновленияТаблицы, ДанныеДляЗагрузки, знач Поиск, СтандартнаяОбработкаРесурсов=Ложь, знач Ресурсы=Неопределено, знач ЗначенияПоУмолчанию=Неопределено) Экспорт
	
	ДанныеОбновленияЭлементов = ДанныеОбновленияТаблицы.ДополнительныеДанныеЭлементов;
	
	ВариантыПоиска = Новый Массив;
	Если ТипЗнч(Поиск)=Тип("Строка") Тогда
		ПоискМассив = Новый Массив;
		ПоискМассив.Добавить(Поиск);
	Иначе
		ПоискМассив = Поиск;
	КонецЕсли;

	Для Каждого Поиск Из ПоискМассив Цикл
		Если ТипЗнч(Поиск)=Тип("Структура") Тогда
			Поиск = РК.СкопироватьСтруктуру(Поиск);
		ИначеЕсли ТипЗнч(Поиск)=Тип("Массив") Тогда
			Поиск = Новый Структура;
			Для Каждого ПолеПоиска Из Поиск Цикл
				Поиск.Вставить(ПолеПоиска);
			КонецЦикла;
		Иначе
			Поиск = Новый Структура(Поиск);
		КонецЕсли;
		ВариантыПоиска.Добавить(Поиск);
	КонецЦикла;

	ДанныеОбновленияТаблицы.ИспользуетсяМетодОбновитьДанныеТаблицы = Истина;
	
	ДанныеОбновленияТаблицы.ФлагОбработки = ДанныеОбновленияТаблицы.ФлагОбработки + 1;
	ФлагОбработки = ДанныеОбновленияТаблицы.ФлагОбработки;
	
	ИзмененныеЭлементы = Новый Массив;

	Для ИндексЭлементаДанныхДляЗагрузки=0 По ДанныеДляЗагрузки.Количество()-1 Цикл
		
		ЭлементДанныхЗагрузки = ДанныеДляЗагрузки[ИндексЭлементаДанныхДляЗагрузки];
		
		НайденныеСтроки = Новый Массив;
		Для Каждого Поиск Из ВариантыПоиска Цикл
			ЗаполнитьЗначенияСвойств(Поиск, ЭлементДанныхЗагрузки);
			НайденныеСтроки = Таблица.НайтиСтроки(Поиск);
			Если НайденныеСтроки.Количество() > 0 Тогда
				//удалим игнорируемые строки из поиска
				ИндексНайденого = НайденныеСтроки.Количество();
				Пока ИндексНайденого > 0 Цикл
					ИндексНайденого = ИндексНайденого - 1;
					Элемент = НайденныеСтроки[ИндексНайденого];
					ИндексЭлемента = Таблица.Индекс(Элемент);
					ДанныеОбновленияЭлемента = ДанныеОбновленияЭлементов[ИндексЭлемента];
				КонецЦикла;
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НайденныеСтроки.Количество()=0 Тогда
			ИндексЭлемента = Таблица.Количество();
			Элемент = Таблица.Добавить();
			Если ЗначенияПоУмолчанию <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Элемент, ЗначенияПоУмолчанию);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Элемент, ЭлементДанныхЗагрузки);
			
			ДанныеОбновленияЭлемента = ДополнительныеДанныеЭлементаТаблицы(ДанныеОбновленияТаблицы, Элемент);
		Иначе
			Элемент = НайденныеСтроки[0];
			ИндексЭлемента = Таблица.Индекс(Элемент);
			
			ДанныеОбновленияЭлемента = ДанныеОбновленияЭлементов[ИндексЭлемента];
		КонецЕсли;

		Если ДанныеОбновленияЭлемента.ФлагОбработки <> ФлагОбработки Тогда
			ДанныеОбновленияЭлемента.ФлагОбработки = ФлагОбработки;
			ДанныеОбновленияЭлемента.ЭлементыЗагрузки.Очистить();
		КонецЕсли;

		ДанныеОбновленияЭлемента.ЭлементыЗагрузки.Добавить(ИндексЭлементаДанныхДляЗагрузки);
		
	КонецЦикла;
	
	Если СтандартнаяОбработкаРесурсов Тогда
		Ресурсы = РК.ЗначениеВМассив(Ресурсы, , Ложь);
		ПустыеЗначенияРесурсов = Новый Структура;
		Для Каждого Ресурс Из Ресурсы Цикл
			Если ДанныеОбновленияТаблицы.Ресурсы.Свойство(Ресурс) Тогда
				ПустыеЗначенияРесурсов.Вставить(Ресурс, ДанныеОбновленияТаблицы.Ресурсы[Ресурс]);
			КонецЕсли;
		КонецЦикла;
		
		Для ИндексЭлемента=0 По ДанныеОбновленияЭлементов.Количество()-1 Цикл
			ДанныеОбновленияЭлемента = ДанныеОбновленияЭлементов[ИндексЭлемента];
			
			Элемент = Таблица[ИндексЭлемента];
			Изменен = Ложь;
			Если ДанныеОбновленияЭлемента.ФлагОбработки=ФлагОбработки Тогда
				Для Каждого Ресурс Из Ресурсы Цикл
					Значение = 0;
					
					Для Каждого ИндексЭлементаЗагрузки Из ДанныеОбновленияЭлемента.ЭлементыЗагрузки Цикл
						Значение = Значение + ДанныеДляЗагрузки[ИндексЭлементаЗагрузки][Ресурс];
					КонецЦикла;

					Если Элемент[Ресурс] <> Значение Тогда
						Элемент[Ресурс] = Значение;
						Изменен = Истина;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Для Каждого Ресурс Из Ресурсы Цикл
					Значение = ПустыеЗначенияРесурсов[Ресурс];
					Если Элемент[Ресурс] <> Значение Тогда
						Элемент[Ресурс] = Значение;
						Изменен = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Изменен Тогда
				ИзмененныеЭлементы.Добавить(ИндексЭлемента);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

	Если ИзмененныеЭлементы.Количество() > 0 Тогда
		ЗарегистрироватьИзмененияЭлементовТаблицы(ДанныеОбновленияТаблицы, ИзмененныеЭлементы);
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция ЗарегистрироватьИзмененияЭлементовТаблицы(ДанныеОбновленияТаблицы, ИндексыЭлементов)
	
	Возврат СтандартныйМодуль.ЗарегистрироватьИзмененияЭлементовТаблицы(ДанныеОбновленияТаблицы, ИндексыЭлементов);
	
КонецФункции

Функция УдалитьЭлементыТаблицы(Таблица, ДанныеОбновленияТаблицы, знач УдаляемыеЭлементы)
	
	Если УдаляемыеЭлементы.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УдаляемыеЭлементы = СортироватьМассив(УдаляемыеЭлементы);
	
	ДанныеОбновленияЭлементов = ДанныеОбновленияТаблицы.ДополнительныеДанныеЭлементов;
	НовыеЭлементы = ДанныеОбновленияТаблицы.НовыеЭлементы;
	УдаленныеЭлементы = ДанныеОбновленияТаблицы.УдаленныеЭлементы;

	//добавление в список удаляемых на клиенте
	Для Каждого ИндексУдаляемогоЭлемента Из УдаляемыеЭлементы Цикл
		Если НовыеЭлементы.Найти(ИндексУдаляемогоЭлемента)=Неопределено Тогда
			ДанныеОбновленияЭлемента = ДанныеОбновленияЭлементов[ИндексУдаляемогоЭлемента];
			УдаленныеЭлементы.Добавить(ДанныеОбновленияЭлемента.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	//удаление элементов из таблиц, корректировка номеров элементов стоящих после удаляемых элементов
	НомерУдаляемого = УдаляемыеЭлементы.Количество();
	ИндексПоследнегоЭлемента = ДанныеОбновленияЭлементов.Количество()-1;
	Пока НомерУдаляемого > 0 Цикл
		
		ИндексУдаляемогоЭлемента = УдаляемыеЭлементы[НомерУдаляемого-1];

		Для ИндексЭлемента=ИндексУдаляемогоЭлемента+1 По ИндексПоследнегоЭлемента Цикл
			ДанныеОбновленияЭлемента = ДанныеОбновленияЭлементов[ИндексЭлемента];
			ДанныеОбновленияЭлемента.Номер = ДанныеОбновленияЭлемента.Номер - НомерУдаляемого;
		КонецЦикла;
		
		Таблица.Удалить(ИндексУдаляемогоЭлемента);
		ДанныеОбновленияЭлементов.Удалить(ИндексУдаляемогоЭлемента);
		
		НомерУдаляемого = НомерУдаляемого - 1;
		ИндексПоследнегоЭлемента = ИндексУдаляемогоЭлемента - 1;
		
	КонецЦикла;
	
	УдалитьЭлементыСписка(ДанныеОбновленияТаблицы.НовыеЭлементы, Неопределено, УдаляемыеЭлементы);
	УдалитьЭлементыСписка(ДанныеОбновленияТаблицы.ИзмененныеЭлементы, ДанныеОбновленияТаблицы.ИзмененныеЭлементыВСписке, УдаляемыеЭлементы);
	УдалитьЭлементыСписка(ДанныеОбновленияТаблицы.ИзмененныеЭлементыДляКлиента, ДанныеОбновленияТаблицы.ИзмененныеЭлементыВСпискеДляКлиента, УдаляемыеЭлементы);
	
	
КонецФункции

Функция УдалитьЭлементыСписка(Список, ИндексыЭлементовСписка, УдаляемыеЭлементы)
	
	ИндексСписка = Список.Количество()-1;
	Если ИндексСписка < 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИндексСпискаУдаляемых = УдаляемыеЭлементы.Количество()-1;
	Если ИндексСпискаУдаляемых < 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Список = СортироватьМассив(Список);
	ИндексЭлемента = Список[ИндексСписка];
	
	ИндексУдаляемогоЭлемента = УдаляемыеЭлементы[ИндексСпискаУдаляемых];
	Пока Истина Цикл
		
		Если ИндексЭлемента=ИндексУдаляемогоЭлемента Тогда
			Список.Удалить(ИндексСписка);
			Если ИндексСпискаУдаляемых=0 Тогда
				Прервать;
			КонецЕсли;
			
			ИндексСпискаУдаляемых = ИндексСпискаУдаляемых - 1;
			ИндексУдаляемогоЭлемента = УдаляемыеЭлементы[ИндексСпискаУдаляемых];
		ИначеЕсли ИндексЭлемента > ИндексУдаляемогоЭлемента Тогда
			Список[ИндексСписка] = Список[ИндексСписка] - ИндексСпискаУдаляемых - 1;
		Иначе
			Если ИндексСпискаУдаляемых=0 Тогда
				Прервать;
			КонецЕсли;
			
			ИндексСпискаУдаляемых = ИндексСпискаУдаляемых - 1;
			ИндексУдаляемогоЭлемента = УдаляемыеЭлементы[ИндексСпискаУдаляемых];
			Продолжить;
		КонецЕсли;
		
		Если ИндексСписка=0 Тогда
			Прервать;
		КонецЕсли;
		
		ИндексСписка = ИндексСписка - 1;
		ИндексЭлемента = Список[ИндексСписка];
		
	КонецЦикла;
	
	Если ИндексыЭлементовСписка <> Неопределено Тогда
		ИндексыЭлементовСписка.Очистить();
		Для ИндексСписка=0 По Список.Количество()-1 Цикл
			ИндексыЭлементовСписка[Список[ИндексСписка]] = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция СортироватьМассив(Массив)
	
	ТаблицаСортировки = Новый ТаблицаЗначений;
	ТаблицаСортировки.Колонки.Добавить("Значение");
	Для Каждого Значение Из Массив Цикл
		ТаблицаСортировки.Добавить().Значение = Значение;
	КонецЦикла;
	ТаблицаСортировки.Сортировать("Значение");
	МассивОтсортированный = ТаблицаСортировки.ВыгрузитьКолонку(0);
	Возврат МассивОтсортированный;
	
КонецФункции

Функция ОбновитьПредставлениеТоваровВТаблице(Таблица, Элементы)
	
	Если Элементы.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭлементТаблицы = Таблица[0];
	КолонкиТаблицы = РК.ВыгрузитьЗначенияКолонкиКоллекции(Таблица.Колонки, "Имя");
	
	Если Таблица=ДанныеОбработки.Таблицы.ТаблицаФакт Тогда
		ТоварныеПоля = СписокПолейМодуля(Новый Структура("Группа", "Товар"));
	Иначе
		ТоварныеПоля = СписокПолейМодуля(Новый Структура("Группа, План", "Товар", Истина));
	КонецЕсли;
	ТоварныеПоля = РК.ПересечениеМассивов(ТоварныеПоля, КолонкиТаблицы);
	
	// не добавлять в представление поля, для которых есть отдельные колонки на форме, чтобы не дублировать
	РК.ВычестьМассив(ТоварныеПоля, "Контейнер, КонтейнерОтправитель, КонтейнерПриемник, Ячейка, ЯчейкаПриемник");

	Разделитель = ", ";
	ДлинаРазделителя = СтрДлина(Разделитель);
	
	Для Каждого ИндексЭлемента Из Элементы Цикл
		ЭлементТаблицы = Таблица[ИндексЭлемента];
		
		ПредставлениеТовара = "";
		Для Каждого ТоварноеПоле Из ТоварныеПоля Цикл
			ПредставлениеТовара = ПредставлениеТовара + ЭлементТаблицы[ТоварноеПоле] + Разделитель;
		КонецЦикла;
		ПредставлениеТовара = Лев(ПредставлениеТовара, СтрДлина(ПредставлениеТовара)-ДлинаРазделителя);
		ЭлементТаблицы.ПредставлениеТовара = ПредставлениеТовара;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция УстановитьОформлениеЭлементовТаблицыПланФакт(ТаблицаПланФакт, ДанныеОбновленияТаблицыПланФакт);
	
	ЦветФонаВыполнен = Новый Цвет(200, 255, 200);
	ЦветФонаОшибка = Новый Цвет(255, 200, 200);
	ЦветФонаВРаботе = Новый Цвет(255, 255, 200);
	ЦветФонаБезПлана = Новый Цвет(200, 200, 255);
	ЦветФонаОбычный = Новый Цвет;

	ДополнительныеДанныеЭлементов = ДанныеОбновленияТаблицыПланФакт.ДополнительныеДанныеЭлементов;
	
	Для Каждого ИндексЭлемента Из ДанныеОбновленияТаблицыПланФакт.ИзмененныеЭлементы Цикл
		
		ДополнительныеДанныеЭлемента = ДополнительныеДанныеЭлементов[ИндексЭлемента];

		ЭлементТаблицы = ТаблицаПланФакт[ИндексЭлемента];

		ЭлементТаблицы.Выполнен = ЭлементТаблицы.КоличествоФактИтого=ЭлементТаблицы.КоличествоПлан;
		Если ЭлементТаблицы.Выполнен Тогда
			Если ЭлементТаблицы.КоличествоПлан=0 Тогда
				ЦветФона = ЦветФонаБезПлана;
			Иначе
				ЦветФона = ЦветФонаВыполнен;
			КонецЕсли;
		ИначеЕсли ЭлементТаблицы.КоличествоФактИтого > ЭлементТаблицы.КоличествоПлан Тогда
			ЦветФона = ЦветФонаОшибка;
		ИначеЕсли ЭлементТаблицы.КоличествоФактИтого <> 0 Тогда
			ЦветФона = ЦветФонаВРаботе;
		Иначе
			ЦветФона = ЦветФонаОбычный;
		КонецЕсли;
		
		УстановитьОформлениеЭлементаТаблицы("ТаблицаПланФакт", ЭлементТаблицы, Новый Структура("ЦветФона", ЦветФона));
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьТаблицуПлана()

	ТаблицаПлан = ПараметрыОбработки.Задание.Товары.Выгрузить();
	ТаблицаПлан.Колонки.Добавить("ИдентификаторИнструкцииЗаполнен");
	ТаблицаПлан.Колонки.Добавить("ИдентификаторИнструкцииЗаполненРесурс");
	УдалитьСтрокиПлана = Новый Массив;
	Для Каждого СтрокаПлана Из ТаблицаПлан Цикл
		Если СтрокаПлана.ИдентификаторИнструкции=0 Тогда
			УдалитьСтрокиПлана.Добавить(СтрокаПлана);
			Продолжить;
		КонецЕсли;
		
		СтрокаПлана.ИдентификаторИнструкцииЗаполнен = СтрокаПлана.ИдентификаторИнструкции <> 0;
		СтрокаПлана.ИдентификаторИнструкцииЗаполненРесурс = ?(СтрокаПлана.ИдентификаторИнструкцииЗаполнен, 1, 0);
	КонецЦикла;
	РК.УдалитьЭлементыКоллекции(ТаблицаПлан, УдалитьСтрокиПлана);
	ТаблицаПлан.Сортировать("НомерСтроки");
	
	ТаблицаПлан.Колонки.НомерСтроки.Имя = "НомерИнструкции";
	ТаблицаПлан.Колонки.Номенклатура.Имя = "Товар";
	ЗначенияКолонкиКоличества = ТаблицаПлан.ВыгрузитьКолонку("Количество");
	ТаблицаПлан.Колонки.Добавить("КоличествоПлан"); ТаблицаПлан.ЗагрузитьКолонку(ЗначенияКолонкиКоличества, "КоличествоПлан");
	ТаблицаПлан.Колонки.Добавить("КоличествоРазмещено"); ТаблицаПлан.ЗагрузитьКолонку(ЗначенияКолонкиКоличества, "КоличествоРазмещено");
	ТаблицаПлан.Колонки.Добавить("КоличествоОтобрано"); ТаблицаПлан.ЗагрузитьКолонку(ЗначенияКолонкиКоличества, "КоличествоОтобрано");
	Если ПараметрыОбработки.Инвентаризация Тогда
		ТаблицаПлан.Колонки.Добавить("КоличествоУчет"); ТаблицаПлан.ЗагрузитьКолонку(ЗначенияКолонкиКоличества, "КоличествоУчет");
	КонецЕсли;
	
	Возврат ТаблицаПлан;
	
КонецФункции

Функция ПолучитьТаблицуФакт(УчитыватьТекущиеОперации=Истина, УчитыватьНулевыеОстатки=Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ОперацияПоЯчейкам_Ссылка КАК ОперацияПоЯчейкам,
	|	&ТаблицаТовары_ПоляЗапроса КАК ПоляЗапроса,
	|	&ТаблицаТовары_Количество КАК КоличествоФакт,
	|	ОперацияПоЯчейкам.Дата КАК Дата,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам КАК ОперацияПоЯчейкам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вмс_ОперацияПоЯчейкам.Товары КАК ТаблицаТовары
	|		ПО ОперацияПоЯчейкам.Ссылка = ТаблицаТовары.Ссылка
	|ГДЕ
	|	(&СсылкаНаЗадание <> ЗНАЧЕНИЕ(Документ.вмс_ЗаданиеКладовщику.ПустаяСсылка)
	|				И ОперацияПоЯчейкам.ЗаданиеКладовщику = &СсылкаНаЗадание
	|			ИЛИ ОперацияПоЯчейкам.Ссылка = &СсылкаНаОперациюПоЯчейкам)
	|	И ОперацияПоЯчейкам.Проведен
	|	И НЕ ОперацияПоЯчейкам.Ссылка В (&ИсключитьОперации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.ОперацияПоЯчейкам КАК ОперацияПоЯчейкам,
	|	ТаблицаТовары.ПоляЗапроса КАК ПоляЗапроса,
	|	СУММА(ТаблицаТовары.КоличествоФакт) КАК КоличествоФакт,
	|	МИНИМУМ(ТаблицаТовары.Дата) КАК Дата,
	|	МИНИМУМ(ТаблицаТовары.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.ОперацияПоЯчейкам,
	|	ТаблицаТовары.ПоляЗапроса";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОперацияПоЯчейкам.Товары", "ОперацияПоЯчейкам." + ПараметрыОбработки.ИмяТаблицыФакта);
	
	ДанныеОбновленияТаблицыФакт = ПараметрыТаблицы("ТаблицаФакт");
	
	ПутиКДаннымСохраненияПолей = ДанныеОбновленияТаблицыФакт.ПутиКДаннымСохраненияПолей;
	
	Если ПолеМодуля(Новый Структура("Имя, План, Ввод", "Упаковка", Истина, Истина)) <> ПустоеПолеОбработки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТовары.Количество КАК КоличествоФакт", "ТаблицаТовары.КоличествоБазовыхЕдиниц КАК КоличествоФакт");
	КонецЕсли;
	
	Если ПараметрыОбработки.Инвентаризация Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОперацияПоЯчейкам_Ссылка", "ОперацияПоЯчейкам.Ссылка");

		Запрос.Текст = Запрос.Текст + 
		"
		|;
		|
		|"
		
		+
		
		"ВЫБРАТЬ
		|	ТаблицаТовары.ПоляЗапроса КАК ПоляЗапроса,
		|	МАКСИМУМ(ТаблицаТовары.ОперацияПоЯчейкам) КАК ОперацияПоЯчейкам
		|ПОМЕСТИТЬ ВТ_ИтогДляИнвентаризации
		|ИЗ
		|	ВТ_Итог КАК ТаблицаТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаТовары.ПоляЗапроса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТовары.ПоляЗапроса КАК ПоляЗапроса,
		|	СУММА(ТаблицаТовары.КоличествоФакт) КАК КоличествоФакт,
		|	МИНИМУМ(ТаблицаТовары.Дата) КАК Дата,
		|	МИНИМУМ(ТаблицаТовары.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	ВТ_Итог КАК ТаблицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИтогДляИнвентаризации КАК ВТ_ИтогДляИнвентаризации
		|		ПО ТаблицаТовары.ПоляЗапроса = ВТ_ИтогДляИнвентаризации.ПоляЗапроса
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаТовары.ПоляЗапроса";

		ПоляЗапросаДляСоединенияМассив = Новый Массив;
		ПоляЗапросаДляСоединенияМассив.Добавить("ТаблицаТовары.ОперацияПоЯчейкам = ВТ_ИтогДляИнвентаризации.ОперацияПоЯчейкам");
		Для Каждого ЭлементПутьКДанным Из ПутиКДаннымСохраненияПолей Цикл
			ИмяПоля = ЭлементПутьКДанным.ИмяРеквизита;
			ПоляЗапросаДляСоединенияМассив.Добавить("ТаблицаТовары." + ИмяПоля + " = ВТ_ИтогДляИнвентаризации." + ИмяПоля);
		КонецЦикла;

		Если ПоляЗапросаДляСоединенияМассив.Количество() > 0 Тогда
			ПоляЗапросаДляСоединения = РК.МассивВСтроку(ПоляЗапросаДляСоединенияМассив, Символы.ПС + Символы.Таб + "И ");
		Иначе
			ПоляЗапросаДляСоединения = "ИСТИНА";
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТовары.ПоляЗапроса = ВТ_ИтогДляИнвентаризации.ПоляЗапроса", ПоляЗапросаДляСоединения);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОперацияПоЯчейкам_Ссылка", "НЕОПРЕДЕЛЕНО");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ ВТ_Итог" + Символы.ПС, "");
	КонецЕсли;
	
	Если НЕ УчитыватьНулевыеОстатки Тогда
		Запрос.Текст = Запрос.Текст +
		"
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТаблицаТовары.КоличествоФакт) <> 0";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст +
	"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	НомерСтроки";
	
	ПоляЗапросаМассив = Новый Массив;
	Для Каждого ЭлементПутьКДанным Из ПутиКДаннымСохраненияПолей Цикл
		ПутьКДанным = ЭлементПутьКДанным.ПутьКДанным;
		ПутьКДанным = СтрЗаменить(ПутьКДанным, "ОперацияПоЯчейкам." + ПараметрыОбработки.ИмяТаблицыФакта, "ТаблицаТовары");
		ПоляЗапросаМассив.Добавить(ПутьКДанным);
	КонецЦикла;
	
	Если ПоляЗапросаМассив.Количество() > 0 Тогда
		ПоляЗапроса = РК.МассивВСтроку(ПоляЗапросаМассив, "," + Символы.ПС + Символы.Таб);
	Иначе
		ПоляЗапроса = "НЕОПРЕДЕЛЕНО КАК ПустоеПоле";
	КонецЕсли;
	
	ПланПоУпаковкам = ДанныеОбработки.ЗапланированныеДанныеПолей.Свойство("Упаковка");
	ПолеКоличества = ?(ПланПоУпаковкам, "Количество", "КоличествоБазовыхЕдиниц");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТаблицаТовары_ПоляЗапроса КАК ПоляЗапроса", ПоляЗапроса);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТаблицаТовары_Количество КАК КоличествоФакт", "ТаблицаТовары." + ПолеКоличества + " КАК КоличествоФакт");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТовары.ПоляЗапроса КАК ПоляЗапроса", ПоляЗапроса);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТовары.ПоляЗапроса", ПоляЗапроса);
	
	Запрос.УстановитьПараметр("СсылкаНаЗадание", ПараметрыОбработки.СсылкаНаЗадание);
	Запрос.УстановитьПараметр("СсылкаНаОперациюПоЯчейкам", ДанныеОбработки.СсылкаОперацииПоЯчейкам);
	Если УчитыватьТекущиеОперации Тогда
		Запрос.УстановитьПараметр("ИсключитьОперации", Новый Массив);
	Иначе
		Запрос.УстановитьПараметр("ИсключитьОперации", ДанныеОбработки.СсылкаОперацииПоЯчейкам);
	КонецЕсли;
	
	ТаблицаФакт = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаФакт;
	
КонецФункции

#КонецОбласти

//
//						Библиотека функций+
//
////////////////////////////////////////////////////////////////////////////////////////////

Функция ПоляВводаКоличеств()
	
	Возврат ПоляМодуля(Новый Структура("Ввод, Группа, Использование", Истина, "Количество", Истина));
	
КонецФункции

Функция АвтоВводКоличества()
	
	ТоварныеПоляМассив = СписокПолейМодуля(Новый Структура("Группа", "Товар"));
	НеЗаполненныеТоварныеПоля = РК.ПересечениеМассивов(ТоварныеПоляМассив, ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхСборки.НеЗаполненныеПоляМассив);
	Если НеЗаполненныеТоварныеПоля.Количество() > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПолеКоличества = АктивноеПолеКоличества();
	Если ПолеКоличества=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеПолей = Новый Структура;
	ДанныеПолей.Вставить("Количество" + ПолеКоличества.Суффикс, 1);
	ДанныеПолей.Вставить("ТипВводаКоличества" + ПолеКоличества.Суффикс, ТипыВводаКоличества.Добавить);
	ДанныеПолей.Вставить("ЗавершениеВводаКоличества" + ПолеКоличества.Суффикс, Ложь);
	
	ВходящиеДанные = НовыеВходящиеДанные(ДанныеПолей);
	ВходящиеДанные.Вставить("АвтоВводКоличества", Истина);
	
	ВвестиДанные(ВходящиеДанные);
	Возврат Истина;
	
КонецФункции

Функция ВведеноТоварноеПоле()
	
	ТоварныеПоляМассив = СписокПолейМодуля(Новый Структура("Группа", "Товар"));

	Для Каждого Поле Из ТоварныеПоляМассив Цикл
		Если ДанныеТранзакции.ПринятыеДанныеПолей.Свойство(Поле) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ВведеноКоличественноеПоле()
	
	Для Каждого Поле Из ПоляВводаКоличеств() Цикл
		Если ДанныеТранзакции.ПринятыеДанныеПолей.Свойство(Поле.Имя) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция АктивноеПолеКоличества()

	Для Каждого ИмяПоля Из ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.НеЗаполненныеПоляМассив Цикл
		Поле = ПолеМодуля(ИмяПоля);
		Если Поле.Группа="Количество" Тогда
			Возврат Поле;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ВычестьСохраненноеКоличествоИзВведенныхКоличеств()

	Если ПоляВводаКоличеств().Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СобранныеДанныеПолей = ДанныеТранзакции.СобранныеДанныеПолей;
	Если СобранныеДанныеПолей.ТипВводаКоличества=ТипыВводаКоличества.Установить Тогда
		КоличествоДобавить = СобранныеДанныеПолей.Количество - СобранныеДанныеПолей.Количество0;
	Иначе
		КоличествоДобавить = СобранныеДанныеПолей.Количество;
	КонецЕсли;
	
	ВведенныеДанныеПолей = ДанныеТранзакции.ВведенныеДанныеПолей;
	Для Каждого ПолеВводаКоличества Из ПоляВводаКоличеств() Цикл
		Если ВведенныеДанныеПолей["ТипВводаКоличества" + ПолеВводаКоличества.Суффикс]=ТипыВводаКоличества.Добавить Тогда
			Количество = ВведенныеДанныеПолей[ПолеВводаКоличества.Имя] - КоличествоДобавить;
			Если Количество=0 Тогда
				Количество = ПолеВводаКоличества.НачальноеЗначение;
			КонецЕсли;
			ВведенныеДанныеПолей[ПолеВводаКоличества.Имя] = Количество;
		Иначе
			ВведенныеДанныеПолей[ПолеВводаКоличества.Имя] = ПолеВводаКоличества.НачальноеЗначение;
			ВведенныеДанныеПолей["ЗавершениеВводаКоличества" + ПолеВводаКоличества.Суффикс] = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////
//
//						События+
//

#Область События

Функция ОбработчикНачалоВыбораСерии(Параметры, ДополнительныеПараметры) Экспорт

	ОбщиеДанныеПолей = ДанныеМодуля.ОбщиеДанныеПолей;
	
	ПолеСерия = ПолеМодуля("Серия");
	Если НЕ (ПолеСерия <> Неопределено И ПолеСерия.Ввод) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеТовара = Новый Структура;
	Для Каждого ТоварноеПоле Из ПоляМодуля(Новый Структура("Группа", "Товар")) Цикл
		ДанныеТовара.Вставить(ТоварноеПоле.Имя, ОбщиеДанныеПолей[ТоварноеПоле.Имя]);
	КонецЦикла;
	
	ПараметрыИнициализации = Новый Структура;
	ПараметрыИнициализации.Вставить("НастройкаОператора", ПараметрыОбработки.НастройкаОператора);
	ПараметрыИнициализации.Вставить("Склад", ПараметрыОбработки.Склад);
	ПараметрыИнициализации.Вставить("ДанныеТовара", ДанныеТовара);
	ПараметрыИнициализации.Вставить("СоздаватьНовуюСерию", ПараметрыМодуля.СоздаватьНовуюСерию);
	//ПараметрыИнициализации.Вставить("ТаблицаОстатков", ПолучитьТаблицуОстатковСерий(ДанныеТовара));
	вмс_СерверУправляемыеОбработки.СоздатьОбработку("Обработка.вмс_СерверУправляемыйМодульВводСерии", ПараметрыИнициализации, ПараметрыОбработки.Идентификатор, НовыйОписаниеОповещения("ПриЗакрытииФормыСерии"));

	СтандартныйМодуль.ЗаморозитьТаймеры();
	
	Возврат Истина;

КонецФункции

Функция ПолучитьТаблицуОстатковСерий(ДанныеТовара)
	
	ЗаданиеКладовщику = ПараметрыОбработки.СсылкаНаЗадание.ПолучитьОбъект();
	ЗаданиеКладовщику.Товары.Очистить();
	
	Если ДанныеТовара.Свойство("Номенклатура") Тогда
		Номенклатура = ДанныеТовара.Номенклатура;
	Иначе
		Номенклатура = ДанныеТовара.Товар;
	КонецЕсли;
	
	СтрокаТовара = ЗаданиеКладовщику.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТовара, ДанныеТовара);
	СтрокаТовара.Номенклатура = Номенклатура;
	СтрокаТовара.Серия = Справочники.вмс_СерииНоменклатуры.ПустаяСсылка();
	СтрокаТовара.Количество = 1;

	ПараметрыЗаполнения = Документы.вмс_ЗаданиеКладовщику.НовыеПараметрыЗаполненияЯчеек(ЗаданиеКладовщику);
	
	ТаблицаОстатков = вмс_ОтборСервер.ПодобратьЯчейкиОтправители(ПараметрыЗаполнения);
	ТаблицаОстатков.Колонки.СвободныйОстаток.Имя = "Остаток";
	ТаблицаОстатков.Свернуть("Серия, Ячейка", "Остаток");
	
	Возврат ТаблицаОстатков;
	
КонецФункции

Функция ПриЗакрытииФормыСерии(ВходящиеДанные, ДополнительныеПараметры) Экспорт

	СтандартныйМодуль.РазморозитьТаймеры();

	Если ВходящиеДанные <> Неопределено Тогда
		
		ВвестиДанные(ВходящиеДанные);
		
	КонецЕсли;
	
КонецФункции

Функция ОбработчикНачалоВыбораКонтейнераПриемника(Параметры, ДополнительныеПараметры) Экспорт

	ОО = НовыйОписаниеОповещения("ОбработчикЗакрытияФормыГенерацииКонтейнеров");
	вмс_СерверУправляемыеОбработки.СоздатьОбработку("Обработка.вмс_СерверУправляемыйМодульГенерацияКонтейнеров", , ПараметрыОбработки.Идентификатор, ОО);

	СтандартныйМодуль.ЗаморозитьТаймеры();
	
КонецФункции

Функция ОбработчикЗакрытияФормыГенерацииКонтейнеров(Результат, ДополнительныеПараметры) Экспорт
	
	СтандартныйМодуль.РазморозитьТаймеры();
	
КонецФункции

Функция ОбработчикКомандыОткрытьКарточкуТовара(Параметры, ДополнительныеПараметры) Экспорт

	ДанныеПолей = ДанныеОбработки.ОбщиеДанныеПолей;
	
	ПараметрыИнициализации = Новый Структура;
	ПараметрыИнициализации.Вставить("Товар", ДанныеПолей.Товар);
	Если ДанныеПолей.Свойство("Характеристика") Тогда
		ПараметрыИнициализации.Вставить("Характеристика", ДанныеПолей.Характеристика);
	КонецЕсли;
	
	//3.2.5
	//вмс_СерверУправляемыеОбработки.СоздатьОбработку("Обработка.вмс_СерверУправляемыйМодульКарточкаТовара",
	//												ПараметрыИнициализации,
	//												ПараметрыОбработки.Идентификатор,
	//												НовыйОписаниеОповещения("ОбработчикЗакрытияКарточкиТовара"));
	//												
	вмс_СерверУправляемыеОбработки.СоздатьОбработку("Обработка.вмс_СерверУправляемыйМодульОперацияПоЯчейкамКарточкаТовара",
													ПараметрыИнициализации,
													ПараметрыОбработки.Идентификатор,
													НовыйОписаниеОповещения("ОбработчикЗакрытияКарточкиТовара"));

	СтандартныйМодуль.ЗаморозитьТаймеры();
	
КонецФункции

Функция ОбработчикЗакрытияКарточкиТовара(Результат, ДополнительныеПараметры) Экспорт
	
	СтандартныйМодуль.РазморозитьТаймеры();
	
КонецФункции
#КонецОбласти

//
//						События-
//
////////////////////////////////////////////////////////////////////////////////////////////







































////////////////////////////////////////////////////////////////////////////////////////////
//
//						Объявление функций+
//

#Область ОбъявлениеФункций

Функция НовыеВходящиеДанные(Данные=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.НовыеВходящиеДанные(Данные);
	
КонецФункции

Функция УстановитьТекущийЭлементТаблицы(ИмяТаблицы, ИдентификаторЭлементаТаблицы)
	
	Возврат СтандартныйМодуль.УстановитьТекущийЭлементТаблицы(ИмяТаблицы, ИдентификаторЭлементаТаблицы);
	
КонецФункции

Функция УстановитьОбработчикиСобытийПолейОбработки(Поля=Неопределено, События)
	
	Возврат СтандартныйМодуль.УстановитьОбработчикиСобытийПолейОбработки(Поля, События);
	
КонецФункции

Функция ПолучитьДокументОперацииПоЯчейкам(Создавать=Истина)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ПолучитьДокументОперацииПоЯчейкам", Новый Структура("Создавать", Создавать)));
	
КонецФункции

Функция ЗаписатьДокументОперацииПоЯчейкам(ОперацияПоЯчейкам)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗаписатьДокументОперацииПоЯчейкам", Новый Структура("ОперацияПоЯчейкам", ОперацияПоЯчейкам)));
	
КонецФункции

Функция ТаблицаПолейМодуля(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ТаблицаПолейОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции

Функция УстановитьСвойстваПолейМодуля(Поля=Неопределено, Свойства=Неопределено, ЗначениеСвойства=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьСвойстваПолейОбработки(ПараметрыМодуля, Поля, Свойства, ЗначениеСвойства);
	
КонецФункции

Функция ПолучитьЗначениеСвойстваПоляМодуля(Поле, ИмяСвойства)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеСвойстваПоляОбработки(ПараметрыМодуля, Поле, ИмяСвойства);
	
КонецФункции

Функция ПоляВводаМодуля()

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВвода(ПараметрыМодуля);
	
КонецФункции

Функция ПолеМодуля(Отбор)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции
	
Функция ПоляМодуля(Отбор=Неопределено)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции

Функция ПолеОбработки(Отбор=Неопределено)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ПоляОбработки(Отбор=Неопределено)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция СписокПолейВвода()

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВвода(ПараметрыМодуля);
	
КонецФункции

Функция СписокПолейМодуля(Отбор=Неопределено)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции

Функция СписокПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ЭлементВывода(ОтборЭлемента)
	
	Возврат СтандартныйМодуль.ЭлементВывода(ОтборЭлемента);
	
КонецФункции

Функция УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства=Неопределено)
	
	Возврат СтандартныйМодуль.УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства);
	
КонецФункции

Функция УстановитьОформлениеЭлементаТаблицы(ИмяТаблицы, Элемент, Свойства)
	
	Возврат СтандартныйМодуль.УстановитьОформлениеЭлементаТаблицы(ИмяТаблицы, Элемент, Свойства);
	
КонецФункции

Функция ПараметрыТаблицы(ИмяТаблицы)
	
	Возврат СтандартныйМодуль.ПараметрыТаблицы(ИмяТаблицы);
	
КонецФункции

Функция УстановитьТаблицуОбработки(ИмяТаблицы, Источник, Видимость=Истина, знач ПоляВывода=Неопределено)
	
	Возврат СтандартныйМодуль.УстановитьТаблицуОбработки(ИмяТаблицы, Источник, Видимость, ПоляВывода);
	
КонецФункции

Функция УстановитьВидимостьТаблицыОбработки(ИмяТаблицы, Видимость)

	Возврат СтандартныйМодуль.УстановитьВидимостьТаблицыОбработки(ИмяТаблицы, Видимость);
	
КонецФункции

Функция УстановитьМестоположениеТаблицыОбработки(ИмяТаблицы, МестоПоложение)

	Возврат СтандартныйМодуль.УстановитьМестоположениеТаблицыОбработки(ИмяТаблицы, МестоПоложение);
	
КонецФункции

Функция ДополнительныеДанныеЭлементаТаблицы(ПараметрыТаблицы, ЭлементТаблицы)
	
	ДополнительныеДанныеЭлементаТаблицы = СтандартныйМодуль.ДополнительныеДанныеЭлементаТаблицы(ПараметрыТаблицы, ЭлементТаблицы);

	Возврат ДополнительныеДанныеЭлементаТаблицы;
	
КонецФункции

Функция УстановитьОбработчикиСобытийПолейМодуля(Поля=Неопределено, События)
	
	Для Каждого Поле Из ПоляМодуля(Поля) Цикл
		
		Для Каждого Событие Из События Цикл
			
			Поле.События.Вставить(Событие.Ключ, Событие.Значение);
			
		КонецЦикла;
		
		//установим передатчик события с элементов вывода на поля обработки
		СтандартныйМодуль.УстановитьПередаточныйОбработчикСобытийЭлементовВывода(Поле, События);
		
	КонецЦикла;
	
КонецФункции

Функция УстановитьОбработчикиСобытийЭлементовВывода(Элементы, События)
	
	Возврат СтандартныйМодуль.УстановитьОбработчикиСобытийЭлементовВывода(Элементы, События);
	
КонецФункции

Функция ПрочитатьПутиКДаннымПолей(ПолеПути, Поля=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПрочитатьПутиКДаннымПолей(ПараметрыМодуля, ПолеПути, Поля);
	
КонецФункции

Функция ЗаписатьПутиКДаннымПолей(ПолеПути, ТаблицаПутейКДаннымПолей)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ЗаписатьПутиКДаннымПолей(ПараметрыМодуля, ПолеПути, ТаблицаПутейКДаннымПолей);
	
КонецФункции

Функция ПоляВывода()

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВывода(ПараметрыМодуля);
	
КонецФункции

Функция ПолеВводится(ИмяПоля)
	
	Возврат ПолучитьЗначениеСвойстваПоляМодуля(ИмяПоля, "Ввод")=Истина;
	
КонецФункции

Функция ПолеВыводится(ИмяПоля)
	
	Возврат ПолучитьЗначениеСвойстваПоляМодуля(ИмяПоля, "Вывод")=Истина;
	
КонецФункции

Функция УстановитьЗначениеДанныхПоляМодуля(ИмяПоля, Значение)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьЗначениеДанныхПоляОбработки(ПараметрыМодуля, ИмяПоля, Значение);
	
КонецФункции

Функция ПолучитьЗначениеДанныхПоляМодуля(ИмяПоля)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеДанныхПоляОбработки(ПараметрыМодуля, ИмяПоля);
	
КонецФункции

Функция ДобавитьЭтапВводаДанных(знач ОписаниеОбработчика, знач Группа=Неопределено, знач Место=Неопределено, знач Имя=Неопределено)
	
	Если ТипЗнч(ОписаниеОбработчика)=Тип("Строка") Тогда
		ОписаниеОбработчика = НовыйОписаниеОповещения(ОписаниеОбработчика);
	КонецЕсли;
	
	Возврат Интерфейс.ДобавитьЭтапВводаДанных(ОписаниеОбработчика, Группа, Место, Имя);
	
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, знач Модуль=Неопределено, ДополнительныеПараметры=Неопределено)
	
	Если Модуль=Неопределено Тогда
		Модуль = ЭтотОбъект;
	КонецЕсли;
	
	Возврат Интерфейс.НовыйОписаниеОповещения(ИмяПроцедуры, Модуль, ДополнительныеПараметры);
	
КонецФункции

Функция Действие(Код, ПараметрыДействия=Неопределено);
	
	Возврат Интерфейс.Действие(Код, ПараметрыДействия);
	
КонецФункции

Функция УстановитьРезультатДействия(Действие, Результат=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, Результат);
	
КонецФункции

Функция ПоказатьДиалогНаКлиенте(знач ОписаниеОповещения=Неопределено, Текст, знач Кнопки=Неопределено, знач Таймаут=Неопределено, КнопкаПоУмолчанию=Неопределено, Заголовок=Неопределено, ИмяЗвука=Неопределено)
	
	Если ТипЗнч(ОписаниеОповещения)=Тип("Строка") Тогда
		ОписаниеОповещения = НовыйОписаниеОповещения(ОписаниеОповещения);
	КонецЕсли;
	
	Возврат СтандартныйМодуль.ПоказатьДиалогНаКлиенте(ОписаниеОповещения, Текст, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, ИмяЗвука);
	
КонецФункции

Функция ДобавитьДействиеНаКлиенте(КодДействия, ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ДобавитьДействиеНаКлиенте(ПараметрыОбработки, КодДействия, ПараметрыДействия);
	
КонецФункции

Функция ПроигратьЗвукСхемы(ИмяЗвука)
	
	Возврат СтандартныйМодуль.ПроигратьЗвукСхемы(ИмяЗвука);
	
КонецФункции
#КонецОбласти

//
//						Объявление функций-
//
////////////////////////////////////////////////////////////////////////////////////////////

РК = вмс_РаботаСКоллекциями;
ТипыВводаКоличества = РК.НовоеПеречисление("Установить, Добавить", "Строка");
#КонецЕсли