#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьСтатус(ИмяСтатуса, ИмяГруппы=Неопределено) Экспорт  
	
	Если ЗначениеЗаполнено(ИмяГруппы) Тогда
		Родитель = Справочники.вмс_СтатусыДокументов.НайтиПоНаименованию(ИмяГруппы, Истина);
		Если Не ЗначениеЗаполнено(Родитель) Тогда
			НоваяГруппа = Справочники.вмс_СтатусыДокументов.СоздатьГруппу();
			НоваяГруппа.Наименование = ИмяГруппы;
			НоваяГруппа.Записать();
			Родитель = НоваяГруппа.Ссылка;	
		КонецЕсли;
		Статус = Справочники.вмс_СтатусыДокументов.НайтиПоНаименованию(ИмяСтатуса, Истина, Родитель);
		Если Не ЗначениеЗаполнено(Статус) Тогда
			НовыйЭлемент = Справочники.вмс_СтатусыДокументов.СоздатьЭлемент();
			НовыйЭлемент.Заполнить(Неопределено);
			НовыйЭлемент.Наименование = ИмяСтатуса; 
			НовыйЭлемент.Родитель = Родитель;
			НовыйЭлемент.Записать(); 
			Статус = НовыйЭлемент.Ссылка;
		КонецЕсли;	
	Иначе	
		Статус = Справочники.вмс_СтатусыДокументов.НайтиПоНаименованию(ИмяСтатуса, Истина);
		Если Не ЗначениеЗаполнено(Статус) Тогда
			НовыйЭлемент = Справочники.вмс_СтатусыДокументов.СоздатьЭлемент();
			НовыйЭлемент.Заполнить(Неопределено);
			НовыйЭлемент.Наименование = ИмяСтатуса; 
			НовыйЭлемент.Записать(); 
			Статус = НовыйЭлемент.Ссылка;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Статус;
	
КонецФункции

#КонецЕсли
