Функция ПодключитьСистемуШтрихкодирования(Форма, КлавиатурнаяПанель=Неопределено) Экспорт
		
	Если Не ПодключитьСистемуШтрихкодированияЧерезГорячиеКлавиши(Форма, , , КлавиатурнаяПанель) Тогда
		ПодключитьСистемуШтрихкодированияЧерезДрайвер(Форма);
	КонецЕсли;
	
	ЗаполнитьПодменюСканирование(Форма);
	
КонецФункции
 
Функция ОтключитьСистемуШтрихкодирования(Форма) Экспорт
	
	ОтключитьСистемуШтрихкодированияЧерезДрайвер(Форма);
	ОтключитьСистемуШтрихкодированияЧерезГорячиеКлавиши(Форма);
	
КонецФункции

Функция ЗаполнитьПодменюСканирование(Форма) Экспорт
	
	Если НЕ вмс_РаботаСФормамиКлиентСервер.ПроверитьНаличиеСлужебногоСерверногоМетодаФормы(Форма) Тогда
		// не будем работать с такой формой
		Возврат Ложь;
	КонецЕсли;
	
	ИмяПодменю = "ПодменюСканирование";
	ПодменюСканирование = Форма.Элементы.Найти(ИмяПодменю);
	Если ПодменюСканирование = Неопределено Тогда
		Форма.СлужебнаяФункцияВызовСервера("Форма.Элементы.Добавить(""" + ИмяПодменю + """, Тип(""ГруппаФормы""))");
	КонецЕсли;
	
	Команды = вмс_ПодключаемыеКомандыКлиентСервер.ТаблицаКоманд();
	Команда = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Команды);
	Команда.ИмяВФорме = "ВводШтрихкодаЧерезПолеВвода";
	Команда.Картинка = БиблиотекаКартинок.вмс_Штрихкод;
	Команда.Подменю = ИмяПодменю;
	Команда.Обработчик = "вмс_РаботаСФормамиКлиент.ОткрытьФормуВводаШтрихкодаЧерезПолеВвода";
	
	Команда = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Команды);
	Команда.ИмяВФорме = "ВводШтрихкодаЧерезКамеру";
	Команда.Картинка = БиблиотекаКартинок.вмс_Фотокамера;
	Команда.Подменю = ИмяПодменю;
	Команда.Обработчик = "вмс_РаботаСФормамиКлиент.ОткрытьФормуВводаШтрихкодаЧерезСредстваМультимедиа";

	вмс_ПодключаемыеКомандыКлиент.ВывестиКоманды(Форма, Команды.Строки);
	
	Возврат Истина;
	
КонецФункции

Функция ОбработатьВнешнееСобытие(Форма, Источник, Событие, Данные) Экспорт
	
	ПараметрыПодключения = вмс_ПараметрыПриложения["СистемаШтрихкодирования"].Клиенты[Форма];
	Если ПараметрыПодключения = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыПодключения.Тип <> ПредопределенноеЗначение("Перечисление.вмс_ТипыСистемШтрихкодирования.ЧерезДрайвер") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Форма.ВводДоступен() Тогда
		Если Событие = "Штрихкод" Тогда
			ВыполнитьОбработкуОповещения(ПараметрыПодключения.ОповещениеВводШтрихкода, Данные);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОбработатьШтрихкод(Форма, Штрихкод) Экспорт
	
	КэшШтрихкодов = вмс_РаботаСКоллекциями.ПолучитьПолеСоответствия(ПолучитьКлиентскиеПеременныеОбъекта(Форма), "КэшШтрихкодов", Новый Соответствие);
	Результат = КэшШтрихкодов[Штрихкод];
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = вмс_ОбработкаШтрихкодовВызовСервера.ОбработатьШтрихкод(Штрихкод);
	КэшШтрихкодов[Штрихкод] = Результат;
	Возврат Результат;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////////////////
//
//						Обработка штрих-кода через драйвер+
//

Функция ПодключитьОборудованиеЗавершение(РезультатВыполнения, ПараметрыПодключения) Экспорт
	
	МенеджерОборудованияКлиент.ПодключитьОборудованиеЗавершениеПоУмолчанию(РезультатВыполнения, Неопределено);
	
	Если РезультатВыполнения.Результат Тогда
		вмс_ПараметрыПриложения["СистемаШтрихкодирования"].Клиенты[ПараметрыПодключения.Форма] = ПараметрыПодключения;
	КонецЕсли;
	
КонецФункции

Функция ПодключитьСистемуШтрихкодированияЧерезДрайвер(Форма, ОповещениеВводШтрихкода=Неопределено) Экспорт
		
	Если ТипЗнч(ОповещениеВводШтрихкода) <> Тип("ОписаниеОповещения") Тогда
		Если ТипЗнч(ОповещениеВводШтрихкода) = Тип("Строка") Тогда
			ИмяМетодаОбработчикаОповещения = ОповещениеВводШтрихкода;
		Иначе
			ИмяМетодаОбработчикаОповещения = "ОбработкаВводаШтрихкода";
		КонецЕсли;
		
		Попытка
			ОповещениеВводШтрихкода = Новый ОписаниеОповещения(ИмяМетодаОбработчикаОповещения, Форма);
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	ИмяСистемы = "СистемаШтрихкодированияЧерезДрайвер";
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("ИмяСистемы", ИмяСистемы);
	ПараметрыПодключения.Вставить("Форма", Форма);
	ПараметрыПодключения.Вставить("Тип", ПредопределенноеЗначение("Перечисление.вмс_ТипыСистемШтрихкодирования.ЧерезДрайвер"));
	ПараметрыПодключения.Вставить("ОповещениеВводШтрихкода", ОповещениеВводШтрихкода);
	
	ОповещениеПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект, ПараметрыПодключения);
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещениеПриПодключении, Форма.УникальныйИдентификатор,
					МенеджерОборудованияКлиент.ПреобразоватьСписокСтрокойВМассив("СканерШтрихкода"));
					
	Возврат Истина;
	
КонецФункции

Функция ОтключитьСистемуШтрихкодированияЧерезДрайвер(Форма) Экспорт
	
	ОповещениеПриОтключении = Неопределено;
	
	Если ОповещениеПриОтключении = Неопределено Тогда
		ОповещениеПриОтключении = Новый ОписаниеОповещения("ОтключитьОборудованиеЗавершениеПоУмолчанию", МенеджерОборудованияКлиент);
	КонецЕсли;
	
	//Попытка
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(ОповещениеПриОтключении, Форма.УникальныйИдентификатор, ПреобразоватьСписокСтрокойВМассив("СканерШтрихкода"));
	//Исключение
	//КонецПопытки;
	
	ОтключитьСистемуШтрихкодированияЧерезГорячиеКлавиши(Форма);
	
КонецФункции

//
//						Обработка штрих-кода через драйвер-
//
/////////////////////////////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////////////////////////////
//
//						Обработка штрих-кода через горячие клавиши+
//

Функция ПодключитьСистемуШтрихкодированияЧерезГорячиеКлавиши(Форма, Префикс="!", Суффикс="%", КлавиатурнаяПанель=Неопределено, ГруппаРазмещенияКлавиатурнойПанели=Неопределено, знач ОповещениеВводШтрихкода=Неопределено) Экспорт
	
	Если КлавиатурнаяПанель = Неопределено Тогда
		КлавиатурнаяПанель = вмс_РаботаСФормамиКлиент.НоваяКлавиатурнаяПанель(Форма, ГруппаРазмещенияКлавиатурнойПанели);
		Если КлавиатурнаяПанель = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		СобственнаяКлавиатурнаяПанель = Истина;
	Иначе
		СобственнаяКлавиатурнаяПанель = Ложь;
	КонецЕсли;
	
	СтрокаКнопок = Префикс + Суффикс + "!@#$%^&*()QWERTYUIOPASDFGHJKLZXCVBNM1234567890qwertyuiopasdfghjklzxcvbnm";
	
	вмс_РаботаСФормамиКлиент.ДобавитьКнопкиИКомандыКлавиатурнойПанели(КлавиатурнаяПанель, СтрокаКнопок);
	
	Если ТипЗнч(ОповещениеВводШтрихкода) <> Тип("ОписаниеОповещения") Тогда
		Если ТипЗнч(ОповещениеВводШтрихкода) = Тип("Строка") Тогда
			ИмяМетодаОбработчикаОповещения = ОповещениеВводШтрихкода;
		Иначе
			ИмяМетодаОбработчикаОповещения = "ОбработкаВводаШтрихкода";
		КонецЕсли;
		
		ОповещениеВводШтрихкода = Новый ОписаниеОповещения(ИмяМетодаОбработчикаОповещения, Форма);
	КонецЕсли;
	
	ИмяСистемы = "СистемаШтрихкодированияЧерезГорячиеКлавиши";
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("ИмяСистемы", ИмяСистемы);
	ПараметрыПодключения.Вставить("Форма");
	ПараметрыПодключения.Вставить("Тип", ПредопределенноеЗначение("Перечисление.вмс_ТипыСистемШтрихкодирования.ЧерезКлавиатуруИГорячиеКлавиши"));
	ПараметрыПодключения.Вставить("Префикс", Префикс);
	ПараметрыПодключения.Вставить("Суффикс", Суффикс);
	ПараметрыПодключения.Вставить("КлавиатурнаяПанель", КлавиатурнаяПанель);
	ПараметрыПодключения.Вставить("СобственнаяКлавиатурнаяПанель", СобственнаяКлавиатурнаяПанель);
	ПараметрыПодключения.Вставить("ДлинаПрефикса", СтрДлина(Префикс));
	ПараметрыПодключения.Вставить("ДлинаСуффикса", СтрДлина(Суффикс));
	ПараметрыПодключения.Вставить("СостояниеВвода", 0);
	ПараметрыПодключения.Вставить("БуфферВвода", "");
	ПараметрыПодключения.Вставить("ДлинаБуффера", 0);
	ПараметрыПодключения.Вставить("Штрихкод", "");
	ПараметрыПодключения.Вставить("ОповещениеВводШтрихкода", ОповещениеВводШтрихкода);
	
	вмс_РаботаСФормамиКлиент.КлавиатурнаяПанель_ДобавитьСлушателя(КлавиатурнаяПанель, ИмяСистемы, Новый ОписаниеОповещения("ОбработатьВводСимволаШтрихкодаПоГорячейКлавише", ЭтотОбъект, ПараметрыПодключения));
	
	вмс_ПараметрыПриложения["СистемаШтрихкодирования"].Клиенты[Форма] = ПараметрыПодключения;
	Возврат Истина;
	
КонецФункции

Функция ОтключитьСистемуШтрихкодированияЧерезГорячиеКлавиши(Форма) Экспорт
	
	ПараметрыПодключения = вмс_ПараметрыПриложения["СистемаШтрихкодирования"].Клиенты[Форма];
	Если НЕ (ПараметрыПодключения <> Неопределено И ПараметрыПодключения.Тип = ПредопределенноеЗначение("Перечисление.вмс_ТипыСистемШтрихкодирования.ЧерезКлавиатуруИГорячиеКлавиши")) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	вмс_РаботаСФормамиКлиент.КлавиатурнаяПанель_УдалитьСлушателя(ПараметрыПодключения.КлавиатурнаяПанель, ПараметрыПодключения.ИмяСистемы);
	Если ПараметрыПодключения.СобственнаяКлавиатурнаяПанель Тогда
		вмс_РаботаСФормамиКлиент.КлавиатурнаяПанель_Поломать(ПараметрыПодключения.КлавиатурнаяПанель);
	КонецЕсли;
	
	вмс_ПараметрыПриложения["СистемаШтрихкодирования"].Клиенты.Удалить(Форма);
	
	Возврат Истина;
	
КонецФункции

Функция ОбработатьВводСимволаШтрихкодаПоГорячейКлавише(БуфферВвода, СистемаШтрихкодирования) Экспорт
	
	ТекущийБуффер = СистемаШтрихкодирования.БуфферВвода + БуфферВвода;
	ДлинаТекущегоБуффера = СтрДлина(ТекущийБуффер);
	
	Сброс = Ложь;
	Если СистемаШтрихкодирования.СостояниеВвода = 0 Тогда
		
		// ожидание префикса
		Если ДлинаТекущегоБуффера <= СистемаШтрихкодирования.ДлинаПрефикса Тогда
			ЧастьПрефикса = Лев(СистемаШтрихкодирования.Префикс, ДлинаТекущегоБуффера);
			Если ЧастьПрефикса = ТекущийБуффер Тогда
				//ок
				Если ДлинаТекущегоБуффера = СистемаШтрихкодирования.ДлинаПрефикса Тогда
					СистемаШтрихкодирования.СостояниеВвода = 1;
					ТекущийБуффер = "";
					ДлинаТекущегоБуффера = 0;
				КонецЕсли;
			Иначе
				Сброс = Истина;
			КонецЕсли;
		Иначе
			Сброс = Истина;
		КонецЕсли;
		
	ИначеЕсли СистемаШтрихкодирования.СостояниеВвода = 1 Тогда
		
		Если Прав(ТекущийБуффер, СистемаШтрихкодирования.ДлинаСуффикса) = СистемаШтрихкодирования.Суффикс Тогда
			СистемаШтрихкодирования.Штрихкод = Лев(ТекущийБуффер, ДлинаТекущегоБуффера-СистемаШтрихкодирования.ДлинаСуффикса);
			ВыполнитьОбработкуОповещения(СистемаШтрихкодирования.ОповещениеВводШтрихкода, СистемаШтрихкодирования.Штрихкод);
			СистемаШтрихкодирования.СостояниеВвода = 0;
			ТекущийБуффер = "";
			ДлинаТекущегоБуффера = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Сброс Тогда
		СистемаШтрихкодирования.БуфферВвода = "";
		СистемаШтрихкодирования.ДлинаБуффера = 0;
		СистемаШтрихкодирования.СостояниеВвода = 0;
		БуфферВвода = ТекущийБуффер;
	Иначе
		СистемаШтрихкодирования.БуфферВвода = ТекущийБуффер;
		СистемаШтрихкодирования.ДлинаБуффера = ДлинаТекущегоБуффера;
		БуфферВвода = "";
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

//
//						Обработка штрих-кода через горячие клавиши-
//
/////////////////////////////////////////////////////////////////////////////////////////////////////    

/////////////////////////////////////////////////////////////////////////////////////////////////////
//
//						Вспомогательные функции+
//

// ТУ_Кошелев 20.11.23 Перенес в расширение, т.к. в 11.5 и УНФ, мб еще где, из функции убрали директиву Экспорт
// Преобразовать список строкой в массив.
// Офигенное описание
// Возвращаемое значение:
//  Массив
//
Функция ПреобразоватьСписокСтрокойВМассив(Источник) Экспорт
	
	ПромежуточнаяСтруктура = Новый Структура(Источник);
	Приемник = Новый Массив;
	
	Для Каждого КлючИЗначение Из ПромежуточнаяСтруктура Цикл
		Приемник.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Возврат Приемник;
	
КонецФункции
