&НаКлиенте
Функция ПараметрыСтартаСеанса() Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ПараметрыСтартаСеанса();
КонецФункции

// Устанавливает жирное оформление шрифта заголовков групп формы для их корректного отображения в интерфейсе 8.2.
// В интерфейсе Такси заголовки групп с обычным выделением и без выделения выводится большим шрифтом.
// В интерфейсе 8.2 такие заголовки выводятся как обычные надписи и не ассоциируются с заголовками.
// Эта функция предназначена для визуального выделения (жирным шрифтом) заголовков групп в режиме интерфейса 8.2.
//
// Параметры:
//  Форма - УправляемаяФорма - форма для изменения шрифта заголовков групп;
//  ИменаГрупп - Строка - список имен групп формы, разделенных запятыми. Если имена групп не указаны,
//                        то оформление будет применено ко всем группам на форме.
//
// Пример:
//  Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//    СтандартныеПодсистемыСервер.УстановитьОтображениеЗаголовковГрупп(ЭтотОбъект);
//
&НаКлиенте
Процедура УстановитьОтображениеЗаголовковГрупп(Форма, ИменаГрупп = "") Экспорт

	УИ_ГЕНЕРАЦИЯ_УстановитьОтображениеЗаголовковГрупп(Форма,ИменаГрупп);

КонецПроцедуры

&НаКлиенте
Функция КодОсновногоЯзыка() Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_КодОсновногоЯзыка();
КонецФункции

// См. СтандартныеПодсистемыПовтИсп.СсылкиПоИменамПредопределенных
&НаКлиенте
Функция СсылкиПоИменамПредопределенных(ПолноеИмяОбъектаМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_СсылкиПоИменамПредопределенных(ПолноеИмяОбъектаМетаданных);

КонецФункции

&НаКлиенте
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЗначенияРеквизитовОбъекта(Ссылка,Реквизиты,ВыбратьРазрешенные);

КонецФункции

// Значение реквизита, прочитанного из информационной базы по ссылке на объект.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  ИмяРеквизита       - Строка - имя получаемого реквизита.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя, и в случае,
//                                    - если есть ограничение на уровне записей, то возвращается Неопределено;
//                                    - если нет прав для работы с таблицей, то возникнет исключение.
//                              - если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//
// Возвращаемое значение:
//  Произвольный - зависит от типа значения прочитанного реквизита.
//               - если в параметр Ссылка передана пустая ссылка, то возвращается Неопределено.
//               - если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//                 то возвращается Неопределено.
//
&НаКлиенте
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита,ВыбратьРазрешенные);

КонецФункции

&НаКлиенте
Функция ДанныеСохраненногоПароляПользователяИБ(ИмяПользователя) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ДанныеСохраненногоПароляПользователяИБ(ИмяПользователя);
КонецФункции

&НаКлиенте
Процедура УстановитьПарольПользователюИБ(ИмяПользователя, Пароль) Экспорт
	УИ_ГЕНЕРАЦИЯ_УстановитьПарольПользователюИБ(ИмяПользователя,Пароль);
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьДанныеПользователяПослеЗапускаСеансаПодПользователем(ИмяПользователя,
	ДанныеСохраненногоПароляПользователяИБ) Экспорт
	УИ_ГЕНЕРАЦИЯ_ВосстановитьДанныеПользователяПослеЗапускаСеансаПодПользователем(ИмяПользователя,ДанныеСохраненногоПароляПользователяИБ);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМассивОбъектовКСравнению(Объекты) Экспорт
	УИ_ГЕНЕРАЦИЯ_ДобавитьМассивОбъектовКСравнению(Объекты);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбъектыВXMLНаСервере(МассивОбъектов, АдресФайлаВоВременномХранилище, ИдентфикаторФормы=Неопределено) Экспорт
	УИ_ГЕНЕРАЦИЯ_ВыгрузитьОбъектыВXMLНаСервере(МассивОбъектов,АдресФайлаВоВременномХранилище,ИдентфикаторФормы);
	
КонецПроцедуры

// Преобразует (сериализует) любое значение в XML-строку.
// Преобразованы в могут быть только те объекты, для которых в синтакс-помощнике указано, что они сериализуются.
// См. также ЗначениеИзСтрокиXML.
//
// Параметры:
//  Значение - Произвольный - значение, которое необходимо сериализовать в XML-строку.
//
// Возвращаемое значение:
//  Строка - XML-строка.
//
&НаКлиенте
Функция ЗначениеВСтрокуXML(Значение) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЗначениеВСтрокуXML(Значение);
КонецФункции

// Выполняет преобразование (десериализацию) XML-строки в значение.
// См. также ЗначениеВСтрокуXML.
//
// Параметры:
//  СтрокаXML - Строка - XML-строка, с сериализованным объектом..
//
// Возвращаемое значение:
//  Произвольный - значение, полученное из переданной XML-строки.
//
&НаКлиенте
Функция ЗначениеИзСтрокиXML(СтрокаXML, Тип = Неопределено) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЗначениеИзСтрокиXML(СтрокаXML,Тип);
КонецФункции

&НаКлиенте
Функция АдресОписанияМетаданныхКонфигурации() Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_АдресОписанияМетаданныхКонфигурации();
КонецФункции

#Область JSON

&НаКлиенте
Функция мПрочитатьJSON(Значение) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_мПрочитатьJSON(Значение);
КонецФункции // ПрочитатьJSON()

&НаКлиенте
Функция мЗаписатьJSON(СтруктураДанных) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_мЗаписатьJSON(СтруктураДанных);

КонецФункции // ЗаписатьJSON(
#КонецОбласти



#Область ХранилищеНастроек

////////////////////////////////////////////////////////////////////////////////
// Сохранение, чтение и удаление настроек из хранилищ.

// Сохраняет настройку в хранилище общих настроек, как метод платформы Сохранить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, сохранение пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта       - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек      - Строка           - см. синтакс-помощник платформы.
//   Настройки         - Произвольный     - см. синтакс-помощник платформы.
//   ОписаниеНастроек  - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя   - Строка           - см. синтакс-помощник платформы.
//   ОбновитьПовторноИспользуемыеЗначения - Булево - выполнить одноименный метод платформы.
//
&НаКлиенте
Процедура ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек = Неопределено,
	ИмяПользователя = Неопределено, ОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);

КонецПроцедуры

// Сохраняет несколько настроек в хранилище общих настроек, как метод платформы Сохранить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, сохранение пропускается без ошибки.
// 
// Параметры:
//   НесколькоНастроек - Массив - со значениями:
//     * Значение - Структура - со свойствами:
//         * Объект    - Строка       - см. параметр КлючОбъекта  в синтакс-помощнике платформы.
//         * Настройка - Строка       - см. параметр КлючНастроек в синтакс-помощнике платформы.
//         * Значение  - Произвольный - см. параметр Настройки    в синтакс-помощнике платформы.
//
//   ОбновитьПовторноИспользуемыеЗначения - Булево - выполнить одноименный метод платформы.
//
&НаКлиенте
Процедура ХранилищеОбщихНастроекСохранитьМассив(НесколькоНастроек, ОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт
	
	УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекСохранитьМассив(НесколькоНастроек,ОбновитьПовторноИспользуемыеЗначения);

КонецПроцедуры

// Загружает настройку из хранилища общих настроек, как метод платформы Загрузить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Кроме того, возвращает указанное значение по умолчанию, если настройки не найдены.
// Если нет права СохранениеДанныхПользователя, возвращается значение по умолчанию без ошибки.
//
// В возвращаемом значении очищаются ссылки на несуществующий объект в базе данных, а именно
// - возвращаемая ссылка заменяется на указанное значение по умолчанию;
// - из данных типа Массив ссылки удаляются;
// - у данных типа Структура и Соответствие ключ не меняется, а значение устанавливается Неопределено;
// - анализ значений в данных типа Массив, Структура, Соответствие выполняется рекурсивно.
//
// Параметры:
//   КлючОбъекта          - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек         - Строка           - см. синтакс-помощник платформы.
//   ЗначениеПоУмолчанию  - Произвольный     - значение, которое возвращается, если настройки не найдены.
//                                             Если не указано, возвращается значение Неопределено.
//   ОписаниеНастроек     - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя      - Строка           - см. синтакс-помощник платформы.
//
// Возвращаемое значение: 
//   Произвольный - см. синтакс-помощник платформы.
//
&НаКлиенте
Функция ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию = Неопределено,
	ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя)

КонецФункции

// Удаляет настройку из хранилища общих настроек, как метод платформы Удалить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, удаление пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта     - Строка, Неопределено - см. синтакс-помощник платформы.
//   КлючНастроек    - Строка, Неопределено - см. синтакс-помощник платформы.
//   ИмяПользователя - Строка, Неопределено - см. синтакс-помощник платформы.
//
&НаКлиенте
Процедура ХранилищеОбщихНастроекУдалить(КлючОбъекта, КлючНастроек, ИмяПользователя) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя);

КонецПроцедуры

// Сохраняет настройку в хранилище системных настроек, как метод платформы Сохранить
// объекта СтандартноеХранилищеНастроекМенеджер, но с поддержкой длины ключа настроек
// более 128 символов путем хеширования части, которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, сохранение пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта       - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек      - Строка           - см. синтакс-помощник платформы.
//   Настройки         - Произвольный     - см. синтакс-помощник платформы.
//   ОписаниеНастроек  - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя   - Строка           - см. синтакс-помощник платформы.
//   ОбновитьПовторноИспользуемыеЗначения - Булево - выполнить одноименный метод платформы.
//
&НаКлиенте
Процедура ХранилищеСистемныхНастроекСохранить(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек = Неопределено,
	ИмяПользователя = Неопределено, ОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеСистемныхНастроекСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);

КонецПроцедуры

// Загружает настройку из хранилища системных настроек, как метод платформы Загрузить,
// объекта СтандартноеХранилищеНастроекМенеджер, но с поддержкой длины ключа настроек
// более 128 символов путем хеширования части, которая превышает 96 символов.
// Кроме того, возвращает указанное значение по умолчанию, если настройки не найдены.
// Если нет права СохранениеДанныхПользователя, возвращается значение по умолчанию без ошибки.
//
// В возвращаемом значении очищаются ссылки на несуществующий объект в базе данных, а именно:
// - возвращаемая ссылка заменяется на указанное значение по умолчанию;
// - из данных типа Массив ссылки удаляются;
// - у данных типа Структура и Соответствие ключ не меняется, а значение устанавливается Неопределено;
// - анализ значений в данных типа Массив, Структура, Соответствие выполняется рекурсивно.
//
// Параметры:
//   КлючОбъекта          - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек         - Строка           - см. синтакс-помощник платформы.
//   ЗначениеПоУмолчанию  - Произвольный     - значение, которое возвращается, если настройки не найдены.
//                                             Если не указано, возвращается значение Неопределено.
//   ОписаниеНастроек     - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя      - Строка           - см. синтакс-помощник платформы.
//
// Возвращаемое значение: 
//   Произвольный - см. синтакс-помощник платформы.
//
&НаКлиенте
Функция ХранилищеСистемныхНастроекЗагрузить(КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию = Неопределено,
	ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ХранилищеСистемныхНастроекЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);

КонецФункции

// Удаляет настройку из хранилища системных настроек, как метод платформы Удалить,
// объекта СтандартноеХранилищеНастроекМенеджер, но с поддержкой длины ключа настроек
// более 128 символов путем хеширования части, которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, удаление пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта     - Строка, Неопределено - см. синтакс-помощник платформы.
//   КлючНастроек    - Строка, Неопределено - см. синтакс-помощник платформы.
//   ИмяПользователя - Строка, Неопределено - см. синтакс-помощник платформы.
//
&НаКлиенте
Процедура ХранилищеСистемныхНастроекУдалить(КлючОбъекта, КлючНастроек, ИмяПользователя) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеСистемныхНастроекУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя);

КонецПроцедуры

// Сохраняет настройку в хранилище настроек данных форм, как метод платформы Сохранить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, сохранение пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта       - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек      - Строка           - см. синтакс-помощник платформы.
//   Настройки         - Произвольный     - см. синтакс-помощник платформы.
//   ОписаниеНастроек  - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя   - Строка           - см. синтакс-помощник платформы.
//   ОбновитьПовторноИспользуемыеЗначения - Булево - выполнить одноименный метод платформы.
//
&НаКлиенте
Процедура ХранилищеНастроекДанныхФормСохранить(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек = Неопределено,
	ИмяПользователя = Неопределено, ОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеНастроекДанныхФормСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);

КонецПроцедуры

// Загружает настройку из хранилища настроек данных форм, как метод платформы Загрузить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Кроме того, возвращает указанное значение по умолчанию, если настройки не найдены.
// Если нет права СохранениеДанныхПользователя, возвращается значение по умолчанию без ошибки.
//
// В возвращаемом значении очищаются ссылки на несуществующий объект в базе данных, а именно
// - возвращаемая ссылка заменяется на указанное значение по умолчанию;
// - из данных типа Массив ссылки удаляются;
// - у данных типа Структура и Соответствие ключ не меняется, а значение устанавливается Неопределено;
// - анализ значений в данных типа Массив, Структура, Соответствие выполняется рекурсивно.
//
// Параметры:
//   КлючОбъекта          - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек         - Строка           - см. синтакс-помощник платформы.
//   ЗначениеПоУмолчанию  - Произвольный     - значение, которое возвращается, если настройки не найдены.
//                                             Если не указано, возвращается значение Неопределено.
//   ОписаниеНастроек     - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя      - Строка           - см. синтакс-помощник платформы.
//
// Возвращаемое значение: 
//   Произвольный - см. синтакс-помощник платформы.
//
&НаКлиенте
Функция ХранилищеНастроекДанныхФормЗагрузить(КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию = Неопределено,
	ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ХранилищеНастроекДанныхФормЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);

КонецФункции

// Удаляет настройку из хранилища настроек данных форм, как метод платформы Удалить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, удаление пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта     - Строка, Неопределено - см. синтакс-помощник платформы.
//   КлючНастроек    - Строка, Неопределено - см. синтакс-помощник платформы.
//   ИмяПользователя - Строка, Неопределено - см. синтакс-помощник платформы.
//
&НаКлиенте
Процедура ХранилищеНастроекДанныхФормУдалить(КлючОбъекта, КлючНастроек, ИмяПользователя) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеНастроекДанныхФормУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя);

КонецПроцедуры

#КонецОбласти

#Область Алгоритмы

&НаКлиенте
Функция ПолучитьСсылкуСправочникАлгоритмы(Алгоритм) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ПолучитьСсылкуСправочникАлгоритмы(Алгоритм);
КонецФункции

&НаКлиенте
Функция ВыполнитьАлгоритм(АлгоритмСсылка, ВходящиеПараметры = Неопределено, ОшибкаВыполнения = Ложь,
	СообщениеОбОшибке = "") Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ВыполнитьАлгоритм(АлгоритмСсылка,ВходящиеПараметры,ОшибкаВыполнения,СообщениеОбОшибке);
КонецФункции

#КонецОбласти

#Область Отладка

&НаКлиенте
Функция ЗаписатьДанныеДляОтладкиВСправочник(ТипОбъектаОтладки, ДанныеДляОтладки) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ЗаписатьДанныеДляОтладкиВСправочник(ТипОбъектаОтладки,ДанныеДляОтладки);
КонецФункции

&НаКлиенте
Функция СтруктураДанныхОбъектаОтладкиИзСправочникаДанныхОтладки(СсылкаНаДанные) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_СтруктураДанныхОбъектаОтладкиИзСправочникаДанныхОтладки(СсылкаНаДанные);
КонецФункции

&НаКлиенте
Функция СтруктураДанныхОбъектаОтладкиИзСистемногоХранилищаНастроек(КлючНастроек, ИдентификаторФормы=Неопределено) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_СтруктураДанныхОбъектаОтладкиИзСистемногоХранилищаНастроек(КлючНастроек,ИдентификаторФормы);
КонецФункции

&НаКлиенте
Функция СериализоватьОбъектСКДДляОтладки(СКД, НастройкиСКД, ВнешниеНаборыДанных) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_СериализоватьОбъектСКДДляОтладки(СКД,НастройкиСКД,ВнешниеНаборыДанных);

КонецФункции

&НаКлиенте
Функция СтруктураВременныхТаблицМенеджераВременныхТаблиц(МенеджерВременныхТаблиц) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_СтруктураВременныхТаблицМенеджераВременныхТаблиц(МенеджерВременныхТаблиц);
КонецФункции

//https://infostart.ru/public/1207287/
&НаКлиенте
Функция ВыполнитьСравнениеДвухТаблицЗначений(ТаблицаБазовая, ТаблицаСравнения, СписокКолонокСравнения) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ВыполнитьСравнениеДвухТаблицЗначений(ТаблицаБазовая,ТаблицаСравнения,СписокКолонокСравнения);
КонецФункции

#КонецОбласти

#Область СохранениеЧтениеДанныхКонсолей

&НаКлиенте
Функция ПодготовленныеДанныеКонсолиДляЗаписиВФайл(ИмяКонсоли, ИмяФайла, АдресДанныхСохранения,
	СтруктураОписанияСохраняемогоФайла) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ПодготовленныеДанныеКонсолиДляЗаписиВФайл(ИмяКонсоли,ИмяФайла,АдресДанныхСохранения,СтруктураОписанияСохраняемогоФайла);
	
//	Возврат НовыеДанныеСохранения;	

КонецФункции

#КонецОбласти
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОбъектМодуля()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции


&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ПараметрыСтартаСеанса()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПараметрыСтартаСеанса();
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_УстановитьОтображениеЗаголовковГрупп(Форма,ИменаГрупп)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().УстановитьОтображениеЗаголовковГрупп(Форма,ИменаГрупп);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_КодОсновногоЯзыка()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().КодОсновногоЯзыка();
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_СсылкиПоИменамПредопределенных(ПолноеИмяОбъектаМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СсылкиПоИменамПредопределенных(ПолноеИмяОбъектаМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЗначенияРеквизитовОбъекта(Ссылка,Реквизиты,ВыбратьРазрешенные)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗначенияРеквизитовОбъекта(Ссылка,Реквизиты,ВыбратьРазрешенные);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита,ВыбратьРазрешенные)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита,ВыбратьРазрешенные);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ДанныеСохраненногоПароляПользователяИБ(ИмяПользователя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ДанныеСохраненногоПароляПользователяИБ(ИмяПользователя);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_УстановитьПарольПользователюИБ(ИмяПользователя,Пароль)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().УстановитьПарольПользователюИБ(ИмяПользователя,Пароль);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ВосстановитьДанныеПользователяПослеЗапускаСеансаПодПользователем(ИмяПользователя,ДанныеСохраненногоПароляПользователяИБ)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ВосстановитьДанныеПользователяПослеЗапускаСеансаПодПользователем(ИмяПользователя,ДанныеСохраненногоПароляПользователяИБ);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ДобавитьМассивОбъектовКСравнению(Объекты)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ДобавитьМассивОбъектовКСравнению(Объекты);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ВыгрузитьОбъектыВXMLНаСервере(МассивОбъектов,АдресФайлаВоВременномХранилище,ИдентфикаторФормы)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ВыгрузитьОбъектыВXMLНаСервере(МассивОбъектов,АдресФайлаВоВременномХранилище,ИдентфикаторФормы);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЗначениеВСтрокуXML(Значение)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗначениеВСтрокуXML(Значение);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЗначениеИзСтрокиXML(СтрокаXML,Тип)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗначениеИзСтрокиXML(СтрокаXML,Тип);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_АдресОписанияМетаданныхКонфигурации()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().АдресОписанияМетаданныхКонфигурации();
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_мПрочитатьJSON(Значение)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().мПрочитатьJSON(Значение);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_мЗаписатьJSON(СтруктураДанных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().мЗаписатьJSON(СтруктураДанных);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеОбщихНастроекСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекСохранитьМассив(НесколькоНастроек,ОбновитьПовторноИспользуемыеЗначения)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеОбщихНастроекСохранитьМассив(НесколькоНастроек,ОбновитьПовторноИспользуемыеЗначения);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеОбщихНастроекЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеОбщихНастроекУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеСистемныхНастроекСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеСистемныхНастроекСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ХранилищеСистемныхНастроекЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеСистемныхНастроекЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеСистемныхНастроекУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеСистемныхНастроекУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеНастроекДанныхФормСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеНастроекДанныхФормСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ХранилищеНастроекДанныхФормЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеНастроекДанныхФормЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеНастроекДанныхФормУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеНастроекДанныхФормУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ПолучитьСсылкуСправочникАлгоритмы(Алгоритм)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПолучитьСсылкуСправочникАлгоритмы(Алгоритм);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ВыполнитьАлгоритм(АлгоритмСсылка,ВходящиеПараметры,ОшибкаВыполнения,СообщениеОбОшибке)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ВыполнитьАлгоритм(АлгоритмСсылка,ВходящиеПараметры,ОшибкаВыполнения,СообщениеОбОшибке);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЗаписатьДанныеДляОтладкиВСправочник(ТипОбъектаОтладки,ДанныеДляОтладки)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗаписатьДанныеДляОтладкиВСправочник(ТипОбъектаОтладки,ДанныеДляОтладки);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_СтруктураДанныхОбъектаОтладкиИзСправочникаДанныхОтладки(СсылкаНаДанные)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СтруктураДанныхОбъектаОтладкиИзСправочникаДанныхОтладки(СсылкаНаДанные);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_СтруктураДанныхОбъектаОтладкиИзСистемногоХранилищаНастроек(КлючНастроек,ИдентификаторФормы)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СтруктураДанныхОбъектаОтладкиИзСистемногоХранилищаНастроек(КлючНастроек,ИдентификаторФормы);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_СериализоватьОбъектСКДДляОтладки(СКД,НастройкиСКД,ВнешниеНаборыДанных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СериализоватьОбъектСКДДляОтладки(СКД,НастройкиСКД,ВнешниеНаборыДанных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_СтруктураВременныхТаблицМенеджераВременныхТаблиц(МенеджерВременныхТаблиц)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СтруктураВременныхТаблицМенеджераВременныхТаблиц(МенеджерВременныхТаблиц);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ВыполнитьСравнениеДвухТаблицЗначений(ТаблицаБазовая,ТаблицаСравнения,СписокКолонокСравнения)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ВыполнитьСравнениеДвухТаблицЗначений(ТаблицаБазовая,ТаблицаСравнения,СписокКолонокСравнения);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ПодготовленныеДанныеКонсолиДляЗаписиВФайл(ИмяКонсоли,ИмяФайла,АдресДанныхСохранения,СтруктураОписанияСохраняемогоФайла)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПодготовленныеДанныеКонсолиДляЗаписиВФайл(ИмяКонсоли,ИмяФайла,АдресДанныхСохранения,СтруктураОписанияСохраняемогоФайла);
КонецФункции
