
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("СписокЯчеек", ПараметрКоманды);   
	ОО = Новый ОписаниеОповещения("ОбработкаЗавершенияИзмененияПриоритета",ЭтотОбъект);
	ОткрытьФорму("Справочник.вмс_МестаХранения.Форма.ФормаИзмененияПриоритета", ПараметрыФормы, ,, ,,ОО,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры   


&НаКлиенте
Процедура ОбработкаЗавершенияИзмененияПриоритета(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Если Результат.Свойство("ТекстСообщения") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстСообщения);	
		КонецЕсли;	
		
	КонецЕсли;	
КонецПроцедуры
