#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьНастройкуПрограммы(ИдентификаторНастройки) Экспорт
	
	Если ТипЗнч(ИдентификаторНастройки) = Тип("СправочникСсылка.вмс_НастройкиПрограммы") Тогда
		Возврат ИдентификаторНастройки;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НастройкиПрограммы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_НастройкиПрограммы КАК НастройкиПрограммы
	|ГДЕ
	|	НастройкиПрограммы.Код = &ИдентификаторНастройки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НастройкиПрограммы.Ссылка
	|ИЗ
	|	Справочник.вмс_НастройкиПрограммы КАК НастройкиПрограммы
	|ГДЕ
	|	НастройкиПрограммы.Имя = &ИдентификаторНастройки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ИдентификаторНастройки", ИдентификаторНастройки);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ПолучитьЗначениеНастройкиПрограммы(ИдентификаторНастройки, ЗначениеПоУмолчанию=Неопределено) Экспорт
	
	Если ТипЗнч(ИдентификаторНастройки) = Тип("СправочникСсылка.вмс_НастройкиПрограммы") Тогда
		УсловиеОтбора = "НастройкиПрограммы.Ссылка = &ИдентификаторНастройки";
	Иначе
		УсловиеОтбора = "НастройкиПрограммы.Код = &ИдентификаторНастройки ИЛИ НастройкиПрограммы.Имя = &ИдентификаторНастройки";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НастройкиПрограммы.Ссылка КАК Ссылка,
	|	НастройкиПрограммы.Значение КАК Значение,
	|	НастройкиПрограммы.ИспользуетсяХранилище КАК ИспользуетсяХранилище,
	|	НастройкиПрограммы.ХранилищеНастройки КАК ХранилищеНастройки
	|ИЗ
	|	Справочник.вмс_НастройкиПрограммы КАК НастройкиПрограммы
	|ГДЕ
	|	&УсловиеОтбора";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбора", УсловиеОтбора);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ИдентификаторНастройки", ИдентификаторНастройки);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если Выборка.ИспользуетсяХранилище Тогда
		Значение = Выборка.ХранилищеНастройки.Получить();
	Иначе
		Значение = Выборка.Значение;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ПолучитьЗначенияНастроекПрограммы(ИдентификаторыНастроек) Экспорт
	
	МассивИдентификаторовНастроек = вмс_РаботаСКоллекциями.ЗначениеВМассив(ИдентификаторыНастроек);
	
	ТаблицаНастроек = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений("Настройка, Значение");
	
	Для Каждого ИдентификаторНастройки Из МассивИдентификаторовНастроек Цикл
		Значение = ПолучитьЗначениеНастройкиПрограммы(ИдентификаторНастройки);
		СтрокаНастройки = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаНастроек);
		СтрокаНастройки.Настройка = ИдентификаторНастройки;
		СтрокаНастройки.Значение = Значение;
	КонецЦикла;
	
	Возврат ТаблицаНастроек;
	
КонецФункции

Функция ЗаписатьНастройкуПрограммы(ИдентификаторНастройки, ЗначениеНастройки) Экспорт 
	
	ТаблицаНастроек = Новый ТаблицаЗначений;
	ТаблицаНастроек.Колонки.Добавить("Настройка");
	ТаблицаНастроек.Колонки.Добавить("Значение");
	
	СтрокаНастройки = ТаблицаНастроек.Добавить();
	СтрокаНастройки.Настройка = ИдентификаторНастройки;
	СтрокаНастройки.Значение = ЗначениеНастройки;
	
	// Вызываем основную функцию записи настроек
	ЗаписатьЗначенияНастроекПрограммы(ТаблицаНастроек);
	
КонецФункции

Функция ЗаписатьЗначенияНастроекПрограммы(ТаблицаНастроек) Экспорт
	МассивСтрокНастроек = вмс_РаботаСКоллекциями.ПолучитьЭлементыКоллекции(ТаблицаНастроек);
	Для Каждого СтрокаНастройки Из МассивСтрокНастроек Цикл
		НастройкаСсылка = ПолучитьНастройкуПрограммы(СтрокаНастройки.Настройка);
		Если ЗначениеЗаполнено(НастройкаСсылка) Тогда
			Настройка = НастройкаСсылка.ПолучитьОбъект();
			Настройка.Значение = СтрокаНастройки.Значение;
			Настройка.Записать();
		КонецЕсли; 
	КонецЦикла;
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если Не (Параметры.Свойство("ИспользоватьСтандартнуюФорму") И Параметры.ИспользоватьСтандартнуюФорму) Тогда
			
			Если Параметры.Свойство("Ключ") Тогда
				СсылкаНастройки = Параметры.Ключ;
			Иначе
				СсылкаНастройки = Справочники.вмс_НастройкиПрограммы.ПустаяСсылка();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СсылкаНастройки.Форма) Тогда
				ВыбраннаяФорма = СсылкаНастройки.Форма;
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Функция ЗаписатьСвойстваЭлементов(ТаблицаСвойствЭлементов) Экспорт

	вмс_РаботаСКоллекциями.ДополнитьКолонкиКоллекции(ТаблицаСвойствЭлементов, "ТипЗначения");
	
	Для Каждого СвойстваЭлемента Из ТаблицаСвойствЭлементов Цикл
		СвойстваЭлемента.ТипЗначения = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьИмяТипаОбъекта(ТипЗнч(СвойстваЭлемента.Значение));
	КонецЦикла;
	
КонецФункции

Функция ПрочитатьСвойстваЭлементов(ТаблицаСвойствЭлементов) Экспорт

	Для Каждого СвойстваЭлемента Из ТаблицаСвойствЭлементов Цикл
		СвойстваЭлемента.Значение = вмс_РаботаСXMLКлиентСервер.XMLЗначениеУлучшенная(СвойстваЭлемента.ТипЗначения, СвойстваЭлемента.Значение);
	КонецЦикла;
	
КонецФункции

#КонецЕсли
