#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ЗарегистрироватьНаОбмен() Экспорт
	
	МассивУзлов = вмс_Обмен_с_КИС_ВызовСервера.ПолучитьУзлыДляОбмена();
	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Метаданные.Справочники.вмс_МестаХранения);
	
КонецПроцедуры

Функция ПолучитьЯчейкиПоРодителю(Родитель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ячейка
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.Ссылка В ИЕРАРХИИ(&Группа)
	|	И вмс_МестаХранения.Родитель = &Родитель
	|	И вмс_МестаХранения.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ячейка");
	
КонецФункции

Функция ПолучитьЗонуПриемки(Склад, СоздатьПриОтсутствии = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	НЕ вмс_МестаХранения.ЭтоГруппа
	|	И НЕ вмс_МестаХранения.ПометкаУдаления
	|	И вмс_МестаХранения.ТипЯчейки = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаПриемки)
	|	И вмс_МестаХранения.Владелец = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		ЗонаПриемки = СоздатьЭлемент();
		ЗонаПриемки.Владелец = Склад;
		ЗонаПриемки.ТипЯчейки = Перечисления.вмс_ТипыЯчеек.ЗонаПриемки;
		ЗонаПриемки.Наименование = СтрШаблон("Зона приемки (%1)", Склад);
		ЗонаПриемки.Записать();
		Возврат ЗонаПриемки.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

Функция ПолучитьЗонуОтгрузки(Склад, СоздатьПриОтсутствии = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	НЕ вмс_МестаХранения.ЭтоГруппа
	|	И НЕ вмс_МестаХранения.ПометкаУдаления
	|	И вмс_МестаХранения.ТипЯчейки = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаОтгрузки)
	|	И вмс_МестаХранения.Владелец = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		ЗонаОтгрузки = СоздатьЭлемент();
		ЗонаОтгрузки.Владелец = Склад;
		ЗонаОтгрузки.ТипЯчейки = Перечисления.вмс_ТипыЯчеек.ЗонаОтгрузки;
		ЗонаОтгрузки.Наименование = СтрШаблон("Зона отгрузки (%1)", Склад);
		ЗонаОтгрузки.Записать();
		Возврат ЗонаОтгрузки.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

Функция ПолучитьЗонуСклада(Склад, ТипЯчейки, СоздатьПриОтсутствии = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	НЕ вмс_МестаХранения.ЭтоГруппа
	|	И НЕ вмс_МестаХранения.ПометкаУдаления
	|	И вмс_МестаХранения.ТипЯчейки = &ТипЯчейки
	|	И вмс_МестаХранения.Владелец = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТипЯчейки", ТипЯчейки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		СлужебнаяЗона = СоздатьЭлемент();
		СлужебнаяЗона.Владелец = Склад;
		СлужебнаяЗона.ТипЯчейки = ТипЯчейки;
		СлужебнаяЗона.Наименование = СтрШаблон("%1 (%2)", ТипЯчейки, Склад);
		СлужебнаяЗона.Записать();
		Возврат СлужебнаяЗона.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

//3.2.4
Функция ЗаполнитьРеквизитШтрихкод() Экспорт
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК МестоХранения
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		пОбъект = Выборка.МестоХранения.ПолучитьОбъект();
		пОбъект.ОбменДанными.Загрузка = Истина;
		пОбъект.Штрихкод = пОбъект.Код;
		пОбъект.Записать();
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
КонецФункции

#КонецЕсли

