
// #Область СлужебныйПрограммныйИнтерфейс

Функция ПутьКФормеМодуля() Экспорт
	
	Возврат ВзаимодействиеКонтурМаркировка.ПутьКФормеМодуля();
	
КонецФункции

Функция ПутьКОсновнойФормеМодуля() Экспорт
	
	Возврат ВзаимодействиеКонтурМаркировка.ПутьКОсновнойФормеМодуля();
	
КонецФункции

Функция ПараметрыСозданияМодуляКлиента(Знач ОтключитьИнициализацию = Ложь) Экспорт
	
	Возврат ВзаимодействиеКонтурМаркировка.ПараметрыСозданияМодуляКлиента(ОтключитьИнициализацию);
	
КонецФункции

// #КонецОбласти