// Адаптация: в расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ОбщийМодуль(ИмяМодуля);
КонецФункции

//{
//	Процессорные функции+
//

Функция ВызовПодпрограммы(знач ОбъектКонтекста, ТипОбъекта, ИмяМетода, знач ДанныеДляВыполненияКода, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8) Экспорт
	
	Возврат вмс_ВыполнениеПрограммногоКода.ВызовПодпрограммы(ОбъектКонтекста, ТипОбъекта, ИмяМетода, ДанныеДляВыполненияКода, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8);
	
КонецФункции

//
//	Процессорные функции-
//}

Функция ПолучитьТекстПрограммногоМодуля(ПолныйПуть) Экспорт
	
	ДанныеМодуля = ПолучитьДанныеПрограммногоМодуля(ПолныйПуть);
	
	Если ДанныеМодуля<>Неопределено Тогда
		
		Возврат ДанныеМодуля.Текст;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеПрограммногоМодуля(ПолныйПуть) Экспорт

	СсылкаНаПрограммныйМодуль = НайтиПрограммныйМодуль(ПолныйПуть);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ПрограммныеМодули.Ссылка КАК Ссылка,
	|	вмс_ПрограммныеМодули.Текст КАК Текст
	|ИЗ
	|	Справочник.вмс_ПрограммныеМодули КАК вмс_ПрограммныеМодули
	|ГДЕ
	|	вмс_ПрограммныеМодули.Ссылка = &СсылкаНаПрограммныйМодуль";
	Запрос.УстановитьПараметр("СсылкаНаПрограммныйМодуль", СсылкаНаПрограммныйМодуль);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ДанныеМодуля = Новый Структура;
	ДанныеМодуля.Вставить("Ссылка", Выборка.Ссылка);
	ДанныеМодуля.Вставить("Текст", Выборка.Текст);
	
	Возврат ДанныеМодуля;
	
КонецФункции

Функция НайтиПрограммныйМодуль(ПолныйПуть, Родитель=Неопределено) Экспорт
	
	Если ТипЗнч(ПолныйПуть)=Тип("СправочникСсылка.вмс_ПрограммныеМодули") Тогда
		Возврат ПолныйПуть;
	КонецЕсли;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	ПолныйПутьМассив = РК.ЗначениеВМассив(ПолныйПуть, "\", Ложь);
	
	Если ТипЗнч(Родитель)<>Тип("СправочникСсылка.вмс_ПрограммныеМодули") Тогда
		Родитель = Справочники.вмс_ПрограммныеМодули.ПустаяСсылка();
	КонецЕсли;
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	вмс_ПрограммныеМодули.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Родитель2
	|ИЗ
	|	Справочник.вмс_ПрограммныеМодули КАК вмс_ПрограммныеМодули
	|ГДЕ
	|	вмс_ПрограммныеМодули.Родитель В(&Родитель1)
	|	И вмс_ПрограммныеМодули.Наименование = &Наименование1";
	
	СвязкаПакетов = Символы.ПС + ";" + Символы.ПС + Символы.ПС;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель1", Родитель);
	ТекстЗапроса = "";
	ПоследнийНомерЭлемента = ПолныйПутьМассив.Количество();
	Для НомерЭлемента=1 По ПоследнийНомерЭлемента Цикл
		ИмяПараметра = "Наименование" + Формат(НомерЭлемента, "ЧГ=0");
		НаименованиеЭлемента = ПолныйПутьМассив[НомерЭлемента-1];
		Запрос.УстановитьПараметр(ИмяПараметра, НаименованиеЭлемента);
		
		ТекстПакета = ШаблонЗапроса;
		Если НомерЭлемента>1 Тогда
			ТекстЗапроса = ТекстЗапроса + СвязкаПакетов;
			ТекстПакета = СтрЗаменить(ТекстПакета, "&Родитель1", "ВЫБРАТЬ Ссылка ИЗ ВТ_Родитель" + Формат(НомерЭлемента, "ЧГ=0"));
			ТекстПакета = СтрЗаменить(ТекстПакета, "&Наименование1", "&" + ИмяПараметра);
		КонецЕсли;
		
		Если НомерЭлемента<ПоследнийНомерЭлемента Тогда
			ТекстПакета = СтрЗаменить(ТекстПакета, "ПОМЕСТИТЬ ВТ_Родитель2", "ПОМЕСТИТЬ ВТ_Родитель" + Формат(НомерЭлемента+1, "ЧГ=0"));
		Иначе
			ТекстПакета = СтрЗаменить(ТекстПакета, "ПОМЕСТИТЬ ВТ_Родитель2", "");
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + ТекстПакета;
		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ВыполнитьКод(Код) Экспорт
	
	Возврат вмс_ВыполнениеПрограммногоКода.ВыполнитьКод(Код);
	
КонецФункции

Функция ОбработатьПереходКонтекстаИсполнения(знач ПараметрыВызоваКонтекстаИсполнения) Экспорт
	
	Перем ОбщегоНазначенияКлиентСервер, РаботаСXML, РК;
	
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	РаботаСXML = глОбщийМодуль("РаботаСXMLКлиентСервер");
	РК = глОбщийМодуль("РаботаСКоллекциями");

	РезультатВызоваКонтекстаИсполнения = Новый Структура;
	РезультатВызоваКонтекстаИсполнения.Вставить("НетДанных", Ложь);
	РезультатВызоваКонтекстаИсполнения.Вставить("Успешно", Ложь);
	РезультатВызоваКонтекстаИсполнения.Вставить("ФорматРезультатаВXML", Ложь);
	РезультатВызоваКонтекстаИсполнения.Вставить("Результат");
	
	ИспользоватьКэш = ПараметрыВызоваКонтекстаИсполнения.Свойство("ИспользоватьКэш") И ПараметрыВызоваКонтекстаИсполнения.ИспользоватьКэш=Истина;
	Если ИспользоватьКэш Тогда
		ПроцессорКода = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрПриложения("ПроцессорКода");
	Иначе
		ПроцессорКода = Неопределено;
	КонецЕсли;
	
	Если ПроцессорКода=Неопределено Тогда
		ПроцессорКода = вмс_ВыполнениеПрограммногоКода.НовыйПроцессорКода();
		
		Если ИспользоватьКэш Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрПриложения("ПроцессорКода", ПроцессорКода);
		КонецЕсли;
	КонецЕсли;

	Если ПараметрыВызоваКонтекстаИсполнения.Действие="КомпиляцияКода" Тогда
		
		КомпоновщикКода = ПроцессорКода.КомпоновщикКода;
		Если ПараметрыВызоваКонтекстаИсполнения.Свойство("ДанныеКомпоновщикаКодаXML") Тогда
			ПроцессорКода.ЕстьДанныеКомпиляции = Истина;
			ДанныеКомпоновщикаКода = РаботаСXML.ПрочитатьТекстXMLУлучшенная(ПараметрыВызоваКонтекстаИсполнения.ДанныеКомпоновщикаКодаXML);
			вмс_ВыполнениеПрограммногоКода.КомпоновщикКода_ЗагрузитьДанныеКомпиляцииДирективКонтекстовИсполнения(КомпоновщикКода, ДанныеКомпоновщикаКода.ДанныеКомпиляцииДирективКонтекстаИсполнения);
			РК.УстановитьЭлементыКоллекции(КомпоновщикКода.ТаблицаПрограммныхМодулей, ДанныеКомпоновщикаКода.ТаблицаПрограммныхМодулей);
		КонецЕсли;
		
		Если НЕ ПроцессорКода.ЕстьДанныеКомпиляции Тогда
			РезультатВызоваКонтекстаИсполнения.НетДанных = Истина;
			Возврат РезультатВызоваКонтекстаИсполнения;
		КонецЕсли;
		
		Отладка = Ложь;
		Если Отладка Тогда
			ДанныеКомпоновщикаКодаXML = "";
		Иначе
			вмс_ВыполнениеПрограммногоКода.КомпоновщикКода_СкомпилироватьКонтекстИсполнения(КомпоновщикКода, ПараметрыВызоваКонтекстаИсполнения.ПрограммныеМодули, КомпоновщикКода.КонтекстИсполнения);
			
			ДанныеКомпоновщикаКода = Новый Структура;
			ДанныеКомпоновщикаКода.Вставить("ТаблицаПрограммныхМодулей", РК.ПолучитьЭлементыКоллекции(КомпоновщикКода.ТаблицаПрограммныхМодулей));
			ДанныеКомпоновщикаКода.Вставить("ДанныеКомпиляцииДирективКонтекстаИсполнения", вмс_ВыполнениеПрограммногоКода.КомпоновщикКода_ПолучитьДанныеКомпиляцииДирективКонтекстаИсполнения(КомпоновщикКода, КомпоновщикКода.КонтекстИсполнения));
			ДанныеКомпоновщикаКодаXML = РаботаСXML.XMLСтрокаИзЗначенияУлучшенная(ДанныеКомпоновщикаКода);
		КонецЕсли;
		
		РезультатВызоваКонтекстаИсполнения.Результат = ДанныеКомпоновщикаКодаXML;
		РезультатВызоваКонтекстаИсполнения.ФорматРезультатаВXML = Истина;
		РезультатВызоваКонтекстаИсполнения.Успешно = Истина;
		
	ИначеЕсли ПараметрыВызоваКонтекстаИсполнения.Действие="ИсполнениеКода" Тогда

		Если ПараметрыВызоваКонтекстаИсполнения.Свойство("ДанныеДляВыполненияКодаXML") Тогда
			ПроцессорКода.ЕстьДанныеВыполнения = Истина;
			ПроцессорКода.ДанныеДляВыполненияКода = РаботаСXML.ПрочитатьТекстXMLУлучшенная(ПараметрыВызоваКонтекстаИсполнения.ДанныеДляВыполненияКодаXML);
		КонецЕсли;
		
		Если НЕ ПроцессорКода.ЕстьДанныеВыполнения Тогда
			РезультатВызоваКонтекстаИсполнения.НетДанных = Истина;
			Возврат РезультатВызоваКонтекстаИсполнения;
		КонецЕсли;
		
		ПараметрыВызоваПодпрограммы = ПараметрыВызоваКонтекстаИсполнения.ПараметрыВызоваПодпрограммы;
		
		ПроцессорКода.ТекущиеДанныеДляВыполненияКода = ПроцессорКода.ДанныеДляВыполненияКода;
		
		ОбъектКонтекста	= ПараметрыВызоваПодпрограммы[0];
		ТипОбъекта		= ПараметрыВызоваПодпрограммы[1];
		ИмяМетода		= ПараметрыВызоваПодпрограммы[2];
		Параметр1		= ПараметрыВызоваПодпрограммы[3];
		Параметр2		= ПараметрыВызоваПодпрограммы[4];
		Параметр3		= ПараметрыВызоваПодпрограммы[5];
		Параметр4		= ПараметрыВызоваПодпрограммы[6];
		Параметр5		= ПараметрыВызоваПодпрограммы[7];
		Параметр6		= ПараметрыВызоваПодпрограммы[8];
		Параметр7		= ПараметрыВызоваПодпрограммы[9];
		Параметр8		= ПараметрыВызоваПодпрограммы[10];
		
		Если ПараметрыВызоваКонтекстаИсполнения.Форма<>Неопределено Тогда
			Форма = ПараметрыВызоваКонтекстаИсполнения.Форма;
			Форма.Переменные.КлассноеРасширение = ОбъектКонтекста;
			ОбъектКонтекста.НативныйОбъект = Форма;
		КонецЕсли;
		
		Если ПараметрыВызоваКонтекстаИсполнения.НативныйОбъектКонтекстаЗамещен Тогда
			// возвращаем обратно
			ОбъектКонтекста = ОбъектКонтекста.НативныйОбъект;
		КонецЕсли;
		
		РезультатВызоваКонтекстаИсполнения.Результат = вмс_ВыполнениеПрограммногоКода.ВызовПодпрограммы(ОбъектКонтекста, ТипОбъекта, ИмяМетода, ПроцессорКода, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8);
		РезультатВызоваКонтекстаИсполнения.Успешно = Истина;
		
	КонецЕсли;
	
	Возврат РезультатВызоваКонтекстаИсполнения;
	
КонецФункции
