

   
&НаСервере
Функция ПриОткрытииНаСервере()
	
	Если Не вмс_АдаптацияКонфигураций.ИспользуютсяХарактеристики() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
		|	вмс_ХарактеристикиНоменклатуры.Номенклатура КАК Номенклатура,
		|	вмс_ХарактеристикиНоменклатуры.Контрагент КАК Контрагент
		|ИЗ
		|	Справочник.вмс_ХарактеристикиНоменклатуры КАК вмс_ХарактеристикиНоменклатуры
		|ГДЕ
		|	вмс_ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыУчетнойСистемы = &ХарактеристикаУчетнойСистемы";
	
	Запрос.УстановитьПараметр("ХарактеристикаУчетнойСистемы", вмс_АдаптацияКонфигураций.ПустаяХарактеристика());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивНоменклатуры = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Данные = Новый Структура;
		Данные.Вставить("Ссылка", Выборка.Ссылка);   
		Данные.Вставить("Номенклатура", Выборка.Номенклатура);
		Данные.Вставить("Контрагент", Выборка.Контрагент);
		
		МассивНоменклатуры.Добавить(Данные);		
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции


Процедура ДобавитьХарактеристикиУчСистемы(Характеристика, ХарактеристикаУчСистемы)

	ХарактеристикаОбъект = Характеристика.ПолучитьОбъект();
    ХарактеристикаОбъект.ХарактеристикаНоменклатурыУчетнойСистемы = ХарактеристикаУчСистемы;
	ХарактеристикаОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	НеобработанныеХарактеристики.Очистить();
	
	Массив = ПриОткрытииНаСервере(); 
	
	Для каждого Элемент Из Массив Цикл
		НоваяСтрока = НеобработанныеХарактеристики.Добавить();
		НоваяСтрока.Характеристика = Элемент.Ссылка;    
		НоваяСтрока.Номенклатура = Элемент.Номенклатура;
		НоваяСтрока.Контрагент = Элемент.Контрагент;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Массив = ПриОткрытииНаСервере(); 
	
	Для каждого Элемент Из Массив Цикл
		НоваяСтрока = НеобработанныеХарактеристики.Добавить();
		НоваяСтрока.Характеристика = Элемент.Ссылка;
		НоваяСтрока.Номенклатура = Элемент.Номенклатура;
		НоваяСтрока.Контрагент = Элемент.Контрагент;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НеобработанныеХарактеристикиПриИзменении(Элемент)
	
	ТекДанные = Элемент.ТекущиеДанные; 
		
	ДобавитьХарактеристикиУчСистемы(ТекДанные.Характеристика, ТекДанные.ХарактеристикаУчетнойСистемы);

КонецПроцедуры


