
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СКД") Тогда
		ЗагрузитьСхемуСКДИзХранилища(Параметры.СКД);
	КонецЕсли;
	
	ОбязательныеПоля = "";
	Если Параметры.Свойство("ОбязательныеПоля") Тогда
		Если ТипЗнч(Параметры.ОбязательныеПоля) = Тип("Строка") Тогда
			ОбязательныеПоля = Параметры.ОбязательныеПоля;
		ИначеЕсли ТипЗнч(Параметры.ОбязательныеПоля) = Тип("Массив") Тогда
			ОбязательныеПоля = вмс_РаботаСКоллекциями.МассивВСтроку(Параметры.ОбязательныеПоля);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПодсказкаОбязательныеПоля.Видимость = ОбязательныеПоля <> "";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	НастройкиОбновлены = ОбновитьНастройкиСхемыСКД(); 
	Если НастройкиОбновлены Тогда
		Закрыть(АдресСхемыКомпоновкиДанных);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСхемуСКД(Команда)
	ОбновитьНастройкиСхемыСКД();
	ОО = Новый ОписаниеОповещения("СохранитьНастройкиРедактора", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаРедакторСКД",Новый Структура("СКД", АдресСхемыКомпоновкиДанных), ЭтаФорма,,,, ОО);
КонецПроцедуры

&НаСервере
Функция СохранитьНастройкиРедактора(АдресСхемыРедактора, ДополнительныеПараметры) Экспорт
	
	Если АдресСхемыРедактора = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗагрузитьСхемуСКДИзХранилища(АдресСхемыРедактора);
	ЭтаФорма.Модифицированность = Истина;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ЗагрузитьСхемуСКДИзХранилища(ПараметрАдресСхемыКомпоновкиДанных)
	Если ЭтоАдресВременногоХранилища(ПараметрАдресСхемыКомпоновкиДанных) Тогда
		СКД = ПолучитьИзВременногоХранилища(ПараметрАдресСхемыКомпоновкиДанных);
		КопияСКД = СкопироватьСериализуемыйОбъект(СКД);
		ЗагрузитьСхемуСКД(КопияСКД);
	КонецЕсли;
КонецФункции

&НаСервере
Функция ЗагрузитьСхемуСКД(СКД)
	Если ТипЗнч(СКД) = Тип("СхемаКомпоновкиДанных") Тогда
		Если АдресСхемыКомпоновкиДанных = "" Тогда
			АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
		Иначе
			ПоместитьВоВременноеХранилище(СКД, АдресСхемыКомпоновкиДанных);
		КонецЕсли;
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
		КомпоновщикНастроек.ЗагрузитьНастройки(СКД.ВариантыНастроек.Основной.Настройки);
		Элементы.ФормаЗавершитьРедактирование.Доступность = Истина;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция СкопироватьСериализуемыйОбъект(Объект)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Объект);
	ТекстXML = ЗаписьXML.Закрыть();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстXML);
	Копия = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	Возврат Копия;
	
КонецФункции

&НаСервере
Функция ОбновитьНастройкиСхемыСКД() 
	
	Результат = ПроверитьОбязательныеПоляКомпоновкиДанных(КомпоновщикНастроек.Настройки);
	
	Если Результат.Успешно = Истина Тогда
		Если ЭтоАдресВременногоХранилища(АдресСхемыКомпоновкиДанных) Тогда
			СКД = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);   
			РаботаССКД.СкопироватьНастройкиКомпоновкиДанных(СКД.ВариантыНастроек.Основной.Настройки, КомпоновщикНастроек.Настройки);
			ПоместитьВоВременноеХранилище(СКД, АдресСхемыКомпоновкиДанных);
		КонецЕсли;
	Иначе
		Поля = вмс_РаботаСКоллекциями.МассивВСтроку(Результат.ПоляКЗаполнению);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найдены обязательные поля:" + Поля;
		Сообщение.Сообщить();		
	КонецЕсли; 
	
	Возврат Результат.Успешно;
	
КонецФункции

&НаСервере
Функция ПроверитьОбязательныеПоляКомпоновкиДанных(Настройки) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ПоляКЗаполнению = Новый Массив;
	Результат = Истина;
	
	ОбязательныеПоляМассив = РК.СтрокуВМассив(ОбязательныеПоля);
	
	Для каждого Поле Из ОбязательныеПоляМассив Цикл
		Если ТипЗнч(Поле) = Тип("Строка") Тогда
			Поле = Новый ПолеКомпоновкиДанных(Поле);
		КонецЕсли;
		
		ИскомоеПоле = вмс_РаботаСКоллекциями.НайтиЭлементКоллекции(Настройки.Выбор.Элементы, Новый Структура("Поле, Использование", Поле, Истина));	
		Если ИскомоеПоле = Неопределено Тогда
			ПоляКЗаполнению.Добавить(Поле);
			Результат = Ложь;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Новый Структура("Успешно, ПоляКЗаполнению", Результат, ПоляКЗаполнению);
	
КонецФункции

&НаКлиенте
Процедура ОбработчикКомандыСохранитьВФайл(Команда)
	
	ОО = Новый ОписаниеОповещения("ПослеПодготовкиДляРаботыСФайламиСохранитьВФайл", ЭтаФорма);
	вмс_РаботаСФайламиКлиент.ПередРаботойСФайлами(ОО);
	
КонецПроцедуры

&НаКлиенте
Функция ПослеПодготовкиДляРаботыСФайламиСохранитьВФайл(Результат, ДополнительныеПараметры) Экспорт

	Адрес = ПолучитьАдресХранилищаДвоичныхДанныхТекстаXMLСКД();
	НачатьПолучениеФайлаССервера(Адрес, "СКД.xml");
	
КонецФункции

&НаСервере
Функция ПолучитьАдресХранилищаДвоичныхДанныхТекстаXMLСКД()
	
	ТекстXML = ПолучитьТекстXMLСКД();
	ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(ТекстXML);
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	Возврат Адрес;
		
КонецФункции

&НаСервере
Функция ПолучитьТекстXMLСКД()
	
	СКД = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);   
	РаботаССКД.СкопироватьНастройкиКомпоновкиДанных(СКД.ВариантыНастроек.Основной.Настройки, КомпоновщикНастроек.Настройки);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, СКД);
	ТекстXML = ЗаписьXML.Закрыть();
	
	Возврат ТекстXML;
		
КонецФункции

&НаКлиенте
Процедура ОбработчикЗагрузитьИзФайла(Команда)
	
	ОО = Новый ОписаниеОповещения("ПослеПодготовкиДляРаботыСФайламиЗагрузитьФайл", ЭтаФорма);
	вмс_РаботаСФайламиКлиент.ПередРаботойСФайлами(ОО);
	
КонецПроцедуры

&НаКлиенте
Функция ПослеПодготовкиДляРаботыСФайламиЗагрузитьФайл(Результат, ДополнительныеДанные) Экспорт
	
	ОО = Новый ОписаниеОповещения("ОбработчикЗагрузитьПослеВыбораФайла", ЭтаФорма);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Расширение = "xml";
	ДиалогВыбораФайла.Фильтр = "Файлы XML|*.xml";
	ДиалогВыбораФайла.Показать(ОО);
	
КонецФункции

&НаКлиенте
Функция ОбработчикЗагрузитьПослеВыбораФайла(МассивФайлов, ДополнительныеДанные) Экспорт
	
	Если Не ЗначениеЗаполнено(МассивФайлов) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяФайла = МассивФайлов[0];
	
	ОписанияПередаваемыхФайлов = Новый Массив;
	ОписанияПередаваемыхФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайла));
	ОО = Новый ОписаниеОповещения("ОбработчикЗагрузитьПослеПомещенияНаСервер", ЭтаФорма);
	НачатьПомещениеФайловНаСервер(ОО, , , ОписанияПередаваемыхФайлов, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Функция ОбработчикЗагрузитьПослеПомещенияНаСервер(ОписанияПомещенныхФайлов, ДополнительныеПараметры) Экспорт
	
	Если ОписанияПомещенныхФайлов.Количество()=1 Тогда
		ОписаниеПомещенногоФайла = ОписанияПомещенныхФайлов[0];
		ЗагрузитьСКДИзДвоичныхДанныхТекстаXMLВХранилище(ОписаниеПомещенногоФайла.Адрес);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗагрузитьСКДИзДвоичныхДанныхТекстаXMLВХранилище(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	ТекстXML  = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);
	ЗагрузитьСКДИзТекстаXML(ТекстXML);
	
КонецФункции


&НаСервере
Функция ЗагрузитьСКДИзТекстаXML(ТекстXML)

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстXML);
	СКД = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("СхемаКомпоновкиДанных"));
	ЧтениеXML.Закрыть();

	ЗагрузитьСхемуСКД(СКД);

КонецФункции
