


 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	
	Если НЕ вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		Склад 			= Новый ОписаниеТипов("СправочникСсылка.Склады"); // СкладыУТКАЕРП
	Иначе
		Склад			= Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");  // СкладУНФ
	КонецЕсли;
	
	РеквизитСклад 	= Новый РеквизитФормы("Склад", Склад);
	
	ДобавляемыеРеквизиты 	= Новый Массив;
	ДобавляемыеРеквизиты.Добавить(РеквизитСклад);
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
	СоздатьВсеЭлементыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьВсеЭлементыНаСервере() 
	
	Если Элементы.Найти("Склад") = Неопределено Тогда 
		НужноеМесто = Элементы.Найти("ЗаполнитьОстаткиПоСкладу");
		НовыйЭлемент = Элементы.Вставить("Склад", Тип("ПолеФормы"),Элементы.Группа1,НужноеМесто);
		НовыйЭлемент.ПутьКДанным = "Склад";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.КнопкаВыбора = Истина;
		НовыйЭлемент.УстановитьДействие("НачалоВыбора","СкладНачалоВыбора");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Добавили СО
	СтандартнаяОбработка = Ложь;
	ОО = Новый ОписаниеОповещения("ОбработчикВыбора", ЭтотОбъект);	
	ОткрытьФорму("Справочник.Склады.ФормаВыбора",,,,,, ОО); 
	
КонецПроцедуры

&НаСервере
Процедура ОбработчикВыбора(Результат, ДополнительныеПараметры) Экспорт 
	
	//Устанавливать сразу ссылку
	
	Если Результат <> Неопределено Тогда
		ЭтотОбъект.Склад = Результат;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьОстаткиПоСкладу(Команда)
	
	Если Не РазместитьОстаткиНаОднуЯчейку Тогда
		ЗаполнитьОстаткиПоСкладуНаСервере();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для размещения остатков на одну ячейку воспользуйтесь другой кнопкой или снимите галочку разместить остаки на одной ячейке!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиПоСкладуНаСервере()
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Склад) Тогда
	    ОбщегоНазначения.СообщитьПользователю("Склад не заполнен");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.Партия КАК Серия,
		|	ЗапасыОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(, СтруктурнаяЕдиница = &Склад) КАК ЗапасыОстатки";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ТоварыНаСкладахОстатки.Серия КАК Серия,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склад", ЭтотОбъект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Если РазместитьОстаткиНаОднуЯчейку Тогда
			ТаблицаРезультата = РезультатЗапроса.Выгрузить(); 
			СоздатьДокументОперацияПоЯчейкам(ТаблицаРезультата);
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Объект.Номенклатура.Очистить();	
			Пока Выборка.Следующий() Цикл
				
				СтрокаТЧ = Объект.Номенклатура.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
				
			КонецЦикла; 
		КонецЕсли;
				
	Иначе		
		ОбщегоНазначения.СообщитьПользователю("На выбранном складе остаток отсутствует");
	КонецЕсли;
	
	

КонецПроцедуры

&НаСервере
Процедура СоздатьДокументОперацияПоЯчейкам(ТаблицаРезультата) 
	
	ТипОперации = Справочники.вмс_Операции.НайтиПоНаименованию("Инвентаризация");  // Инвентаризация
	нДокумент = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
	нДокумент.Заполнить(Неопределено);
	нДокумент.Дата 		  	= ТекущаяДата();
	нДокумент.ВидОперации 	= ТипОперации;
	нДокумент.Ответственный = Пользователи.ТекущийПользователь();
	нДокумент.Готов			= Истина;
	
	Для каждого Товар Из ТаблицаРезультата Цикл 
		
		СтрокаТЧ = нДокумент.ТоварыПоИнвентаризации.Добавить();
		СтрокаТЧ.Ячейка 	= ЯчейкаДляРазмещения;
		СтрокаТЧ.Товар 		= Товар.Номенклатура;
		СтрокаТЧ.Характеристика = вмс_АдаптацияКонфигураций.ПустаяХарактеристика();
		СтрокаТЧ.Качество 	= Перечисления.вмс_КачествоТовара.Новый;	
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,Товар);
		
	КонецЦикла;
	Попытка
		нДокумент.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		нДокумент.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	Если нДокумент.Проведен Тогда
		ОбщегоНазначения.СообщитьПользователю("Создан и ПРОВЕДЕН документ - " + нДокумент.Ссылка);	
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Создан и ЗАПИСАН документ - " + нДокумент.Ссылка);	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьРаспоряжение(Команда)
	СоздатьРаспоряжениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьРаспоряжениеНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	    ОбщегоНазначения.СообщитьПользователю("Организация не заполнена");
		Возврат;
	КонецЕсли;
		
	ТекстКомментария = "Документ создан для первоначального заполнения склада товаров по ячейкам";
	
	нДокумент = Документы.вмс_ЗаданиеКладовщику.СоздатьДокумент();
	нДокумент.Заполнить(Неопределено);
	нДокумент.Дата 			= ТекущаяДата();
	нДокумент.Организация 	= Объект.Организация;
	нДокумент.Склад 		= ЭтотОбъект.Склад;
	нДокумент.Комментарий 	= ТекстКомментария;
	нДокумент.Автор			= Пользователи.АвторизованныйПользователь();	
	
	Для каждого СтрокаНоменклатуры Из Объект.Номенклатура Цикл
		 СтрокаТЧ = нДокумент.Товары.Добавить();
		 ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаНоменклатуры);
	КонецЦикла;
		
	нДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	ОбщегоНазначения.СообщитьПользователю("Документ " +  нДокумент.Ссылка + " создан и готов. Добавьте его в операцю размещения по ячейкам");
	
КонецПроцедуры

&НаКлиенте
Процедура РазместитьОстатки(Команда)
	РазместитьОстаткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура РазместитьОстаткиНаСервере()
	Если ЗначениеЗаполнено(ЯчейкаДляРазмещения) Тогда
		ЗаполнитьОстаткиПоСкладуНаСервере();
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не заполнена ячейка для размещения!");
	КонецЕсли;
КонецПроцедуры