Функция НовыйСочетаниеКлавиш(Клавиша, Alt=Ложь, Control=Ложь, Shift=Ложь) Экспорт
	
	Если ТипЗнч(Клавиша) = Тип("Клавиша") Тогда
		Возврат Новый СочетаниеКлавиш(Клавиша, Alt, Control, Shift);
	КонецЕсли;
	
	Если ТипЗнч(Клавиша) = Тип("Число") Тогда
		КодСимвола = Формат(Клавиша, "ЧН=0; ЧГ=0");
	Иначе
		КодСимвола = КодСимвола(Клавиша);
	КонецЕсли;
	
	Строка =
	"{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,
	|{0,%КодСимвола%,%Модификаторы%}
	|}";
	
	Модификаторы = Строка(?(Alt, 16, 0) + ?(Control, 8, 0) + ?(Shift, 4, 0));
	
	Строка = СтрЗаменить(Строка, "%КодСимвола%", КодСимвола);
	Строка = СтрЗаменить(Строка, "%Модификаторы%", Модификаторы);
	
	СочетаниеКлавиш = вмс_ОбщегоНазначенияВызовСервера.ЗначениеИзСтрокиВнутр_(Строка);
	
	Возврат СочетаниеКлавиш;
	
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, Модуль, ДополнительныеПараметры=Неопределено, ИмяПроцедурыОбработкиОшибки=Неопределено, МодульОбработкиОшибки=Неопределено) Экспорт
	
	ОписаниеОповещения = Новый Структура;
	ОписаниеОповещения.Вставить("ИмяПроцедуры", ИмяПроцедуры);
	ОписаниеОповещения.Вставить("Модуль", Модуль);
	ОписаниеОповещения.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ОписаниеОповещения.Вставить("ИмяПроцедурыОбработкиОшибки", ИмяПроцедурыОбработкиОшибки);
	ОписаниеОповещения.Вставить("МодульОбработкиОшибки", МодульОбработкиОшибки);
	ОписаниеОповещения.Вставить("ИмяМодуля", ПолучитьИмяОбъекта(Модуль));
	
	Возврат ОписаниеОповещения;
	
КонецФункции

Функция ПолучитьИмяОбъекта(Объект) Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта <> Тип("Строка") Тогда
		ИмяМодуля = Строка(Объект);
		Если СтрНайти(ИмяМодуля, "ВнешняяОбработкаОбъект.")=1 Тогда
			ИмяМодуля = СтрЗаменить(ИмяМодуля, "ВнешняяОбработкаОбъект.", "ВнешняяОбработка.");
			Возврат ИмяМодуля;
		КонецЕсли;
	КонецЕсли;
	
	ИмяМодуля = ПолучитьИмяТипаОбъекта(ТипОбъекта);
	
	Возврат ИмяМодуля;
	
КонецФункции

Функция ВыполнитьОбработкуОповещенияПереопределенный(ВыполняемоеОповещение, Результат=Неопределено) Экспорт
	
	Модуль = ВыполняемоеОповещение.Модуль;
	ДополнительныеПараметры = ВыполняемоеОповещение.ДополнительныеПараметры;
	
	ПрограммныйКод = "Модуль." + ВыполняемоеОповещение.ИмяПроцедуры + "(Результат, ДополнительныеПараметры)";
	Выполнить(ПрограммныйКод);
	
КонецФункции

Функция ПолучитьОписаниеМетаДанныхОбъекта(ПолноеИмя) Экспорт
	
	ОписаниеМетаданных = Неопределено;
	
	Кэш = ПолучитьПараметрыПриложения()["ОписаниеМетаданных"];
	
	// поищем в кэше
	ОписаниеМетаданных = Кэш[ПолноеИмя];

	Если ОписаниеМетаданных = Неопределено Тогда
		// пойдем на сервер (а что делать?)
		ОписаниеМетаданных = вмс_ОбщегоНазначенияВызовСервера.ПолучитьОписаниеМетаДанныхОбъекта(ПолноеИмя);
		Кэш[ПолноеИмя] = ОписаниеМетаданных;
	КонецЕсли;
	
	Возврат ОписаниеМетаданных;
	
КонецФункции

Функция ПолучитьУникальныйИдентификаторИзСтроки(Строка) Экспорт
	
	Группы = Новый Массив;
	Группы.Добавить(8);
	Группы.Добавить(4);
	Группы.Добавить(4);
	Группы.Добавить(4);
	
	Строка2 = Строка;
	Позиция = 0;
	Для Каждого Группа Из Группы Цикл
		Позиция = Позиция + Группа + 1;
		Если Сред(Строка2, Позиция, 1) <> "-" Тогда
			Строка2 = Лев(Строка2, Позиция-1) + "-" + Прав(Строка2, СтрДлина(Строка2)-Позиция+1);
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		УникальныйИдентификатор = Новый УникальныйИдентификатор(Строка2);
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки;
	
	Возврат УникальныйИдентификатор;
	
КонецФункции

Функция ЭтоИмяТипаПеречисления(ИмяТипа) Экспорт

	ИмяТипаМассив = вмс_РаботаСКоллекциями.СтрокуВМассив(ИмяТипа, ".");
	Если ИмяТипаМассив.Количество() = 2 Тогда
		Раздел = ИмяТипаМассив[0];
		Возврат Раздел = "EnumRef" ИЛИ Раздел = "Enum" ИЛИ Раздел = "ПеречислениеСсылка" ИЛИ Раздел = "Перечисление";
	КонецЕсли;

КонецФункции

Функция ПолучитьИмяМенеджераОбъектаПоИмениТипа(ИмяТипа) Экспорт

	ПозицияТочки = Найти(ИмяТипа, ".");
	Если ПозицияТочки = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Раздел = Лев(ИмяТипа, ПозицияТочки-1);
	Если Раздел = "Справочник" ИЛИ Раздел = "СправочникОбъект" Тогда
		Раздел = "Справочники";
	ИначеЕсли Раздел = "Документ" ИЛИ Раздел = "ДокументОбъект" Тогда
		Раздел = "Документы";
	ИначеЕсли Раздел = "Перечисление" Тогда
		Раздел = "Перечисления";
	ИначеЕсли Раздел = "ПланВидовХарактеристик" ИЛИ Раздел = "ПланВидовХарактеристикОбъект" Тогда
		Раздел = "ПланыВидовХарактеристик";
	ИначеЕсли Раздел = "Обработка" ИЛИ Раздел = "ОбработкаОбъект" Тогда
		Раздел = "Обработки";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	КраткоеИмяТипа = Прав(ИмяТипа, СтрДлина(ИмяТипа)-ПозицияТочки);
	
	ИмяМенеджера = Раздел + "." + КраткоеИмяТипа;
	Возврат ИмяМенеджера;
	
КонецФункции

Функция ПолучитьОписаниеМетода(ИмяОбработчика, ВозвращаетРезультат=Ложь, Параметр1=null, Параметр2=null, Параметр3=null, Параметр4=null, Параметр5=null) Экспорт
	
	ПараметрыВсе = Новый Массив;
	ПараметрыВсе.Добавить(Параметр1);
	ПараметрыВсе.Добавить(Параметр2);
	ПараметрыВсе.Добавить(Параметр3);
	ПараметрыВсе.Добавить(Параметр4);
	ПараметрыВсе.Добавить(Параметр5);
	
	КоличествоЗаполненныхПараметров = ПараметрыВсе.Количество();
	Пока КоличествоЗаполненныхПараметров > 0 Цикл
		Если ПараметрыВсе[КоличествоЗаполненныхПараметров-1] <> null Тогда
			Прервать;
		КонецЕсли;
		КоличествоЗаполненныхПараметров = КоличествоЗаполненныхПараметров - 1;
	КонецЦикла;
	
	Параметры = Новый Массив;
	Для НомерПараметра=1 По КоличествоЗаполненныхПараметров Цикл
		Параметры.Добавить(ПараметрыВсе[НомерПараметра-1]);
	КонецЦикла;
	
	ОписаниеМетода = Новый Структура;
	ОписаниеМетода.Вставить("Имя", ИмяОбработчика);
	ОписаниеМетода.Вставить("ИмяОбработчика", ИмяОбработчика);
	ОписаниеМетода.Вставить("ВозвращаетРезультат", ВозвращаетРезультат);
	ОписаниеМетода.Вставить("Параметры", Параметры);
	ОписаниеМетода.Вставить("ПредОбработка");
	ОписаниеМетода.Вставить("ПостОбработка");
	
	Возврат ОписаниеМетода;
	
КонецФункции

Функция ПолучитьСтрокуПараметровМетода(Параметры) Экспорт
	СтрокаПараметров = "";
	Если Параметры.Количество() > 0 Тогда
		Разделитель = ", ";
		НомерПараметра = Параметры.Количество();
		Пока НомерПараметра>0 Цикл
			Если Параметры[НомерПараметра-1] <> null Тогда
				Прервать;
			КонецЕсли;
			НомерПараметра = НомерПараметра - 1;
		КонецЦикла;
		КоличествоПараметров = НомерПараметра;
		
		Для НомерПараметра=1 По КоличествоПараметров Цикл
			ИндексПараметра = НомерПараметра-1;
			СтрокаПараметров = СтрокаПараметров + Разделитель;
			Если Параметры[ИндексПараметра] <> null Тогда
				ИндексПараметраСтрокой = Формат(ИндексПараметра, "ЧН=0; ЧГ=0");
				СтрокаПараметров = СтрокаПараметров + "Параметры[" + ИндексПараметраСтрокой + "]";
			КонецЕсли;
		КонецЦикла;
		СтрокаПараметров = Прав(СтрокаПараметров, СтрДлина(СтрокаПараметров)-СтрДлина(Разделитель));
	КонецЕсли;
	СтрокаПараметров = "(" + СтрокаПараметров + ")";
	Возврат СтрокаПараметров;
КонецФункции

Функция ПустойМетод() Экспорт
	// А что ты здесь ожидал увидеть?
	// Да, нужен этот метод
	// Надо, значит
КонецФункции

Функция ВыполнитьПрограммныйКод(ПрограммныйКод, Параметры=Неопределено) Экспорт
	
	Результат = Неопределено;
	Выполнить(ПрограммныйКод);
	Возврат Результат;
	
КонецФункции

Функция ЭтоМобильноеПриложение() Экспорт
	
#Если МобильноеПриложениеКлиент ИЛИ МобильноеПриложениеСервер Тогда
		Возврат Истина;
#Иначе
		Возврат Ложь;
#КонецЕсли
	
КонецФункции

Функция ПолучитьТекстИзДвоичныхДанных(ДвоичныеДанные) Экспорт
	ПотокВПамяти = Новый ПотокВПамяти;
	ЗаписьДанных = Новый ЗаписьДанных(ПотокВПамяти);
	ЗаписьДанных.Записать(ДвоичныеДанные);
	ЗаписьДанных.Закрыть();
	ПотокВПамяти.Перейти(0, ПозицияВПотоке.Начало);
	
	ЧтениеТекста = Новый ЧтениеТекста(ПотокВПамяти);
	ТекстДанных = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	ПотокВПамяти.Закрыть();
	
	Возврат ТекстДанных;
КонецФункции

Функция ПолучитьТекстИзФайла(ИмяФайла) Экспорт
	
	ЧтениеТекста = Новый ЧтениеТекста;
	ЧтениеТекста.Открыть(ИмяФайла);
	Текст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	Возврат Текст;
	
КонецФункции

Функция ФиксированныеДанные(Данные, ВызыватьИсключение = Истина) Экспорт
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Массив = Новый Массив;
		
		Для каждого Значение Из Данные Цикл
			
			Если ТипЗнч(Значение) = Тип("Структура")
			 ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
			 ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				
				Массив.Добавить(ФиксированныеДанные(Значение, ВызыватьИсключение));
			Иначе
				Если ВызыватьИсключение Тогда
					ПроверкаФиксированностиДанных(Значение, Истина);
				КонецЕсли;
				Массив.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Новый ФиксированныйМассив(Массив);
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура")
	      ИЛИ ТипЗнч(Данные) = Тип("Соответствие") Тогда
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Коллекция = Новый Структура;
		Иначе
			Коллекция = Новый Соответствие;
		КонецЕсли;
		
		Для каждого КлючИЗначение Из Данные Цикл
			Значение = КлючИЗначение.Значение;
			
			Если ТипЗнч(Значение) = Тип("Структура")
			 ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
			 ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				
				Коллекция.Вставить(
					КлючИЗначение.Ключ, ФиксированныеДанные(Значение, ВызыватьИсключение));
			Иначе
				Если ВызыватьИсключение Тогда
					ПроверкаФиксированностиДанных(Значение, Истина);
				КонецЕсли;
				Коллекция.Вставить(КлючИЗначение.Ключ, Значение);
			КонецЕсли;
		КонецЦикла;
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Возврат Новый ФиксированнаяСтруктура(Коллекция);
		Иначе
			Возврат Новый ФиксированноеСоответствие(Коллекция);
		КонецЕсли;
		
	ИначеЕсли ВызыватьИсключение Тогда
		ПроверкаФиксированностиДанных(Данные);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Процедура ПроверкаФиксированностиДанных(Данные, ДанныеВЗначенииФиксированныхТипов = Ложь)
	
	ТипДанных = ТипЗнч(Данные);
	
	Если ТипДанных = Тип("ХранилищеЗначения")
	 ИЛИ ТипДанных = Тип("ФиксированныйМассив")
	 ИЛИ ТипДанных = Тип("ФиксированнаяСтруктура")
	 ИЛИ ТипДанных = Тип("ФиксированноеСоответствие") Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ДанныеВЗначенииФиксированныхТипов Тогда
		
		Если ТипДанных = Тип("Булево")
		 ИЛИ ТипДанных = Тип("Строка")
		 ИЛИ ТипДанных = Тип("Число")
		 ИЛИ ТипДанных = Тип("Дата")
		 ИЛИ ТипДанных = Тип("Неопределено")
		 ИЛИ ТипДанных = Тип("УникальныйИдентификатор")
		 ИЛИ ТипДанных = Тип("Null")
		 ИЛИ ТипДанных = Тип("Тип")
		 ИЛИ ТипДанных = Тип("ХранилищеЗначения")
		 ИЛИ ТипДанных = Тип("ОбщийМодуль")
		 ИЛИ ТипДанных = Тип("ОбъектМетаданных")
		 ИЛИ ТипДанных = Тип("ТипЗначенияXDTO")
		 ИЛИ ТипДанных = Тип("ТипОбъектаXDTO")
		 ИЛИ вмс_ОбщегоНазначенияВызовСервера.ЭтоСсылочныйТип(ТипДанных) Тогда
			
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Ошибка в функции ФиксированныеДанные общего модуля ОбщегоНазначения.
		           |Данные типа ""%1"" не могут быть зафиксированы.'"),
		Строка(ТипДанных) );
	
КонецПроцедуры

Функция ОбщийМодуль(ИмяМодуля) Экспорт
	
	Перем ПараметрыПриложения, ОбщийМодуль;
	
	ПараметрыПриложения = ПолучитьПараметрыПриложения();
	
	ОбщиеМодули = ПараметрыПриложения["ОбщиеМодули"];
	Если ОбщиеМодули=Неопределено Тогда
		ОбщиеМодули = Новый Структура;
		ПараметрыПриложения["ОбщиеМодули"] = ОбщиеМодули;
	КонецЕсли;
	
	Если НЕ ОбщиеМодули.Свойство(ИмяМодуля, ОбщийМодуль) Тогда
		ОбщийМодульСтруктура = ПолучитьОбщиеМодули(ИмяМодуля);
		ОбщийМодульСтруктура.Свойство(ИмяМодуля, ОбщийМодуль);
		ОбщиеМодули.Вставить(ИмяМодуля, ОбщийМодуль);
	КонецЕсли;
	
	Возврат ОбщийМодуль;
	
КонецФункции

Функция ПолучитьФактическоеИмяОбщегоМодуля(ИмяМодуля) Экспорт
	
	ТаблицаОбщихМодулей = ПолучитьТаблицуОбщихМодулей(ИмяМодуля);
	СтрокиОбщихМодулей = вмс_РаботаСКоллекциями.ПолучитьЭлементыКоллекции(ТаблицаОбщихМодулей);
	Если СтрокиОбщихМодулей.Количество() > 0 Тогда
		Возврат СтрокиОбщихМодулей[0].ФактическоеИмя;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуОбщихМодулей(ИменаМодулей) Экспорт
	
	СоответствиеОбщихМодулей = СоответствиеОбщихМодулей();
	
	ПрефиксыМодулей = Новый Массив;
	ПрефиксыМодулей.Добавить("вмс_");
	ПрефиксыМодулей.Добавить("ВМС_");
	ПрефиксыМодулей.Добавить("");
	
	МассивИменМодулей = вмс_РаботаСКоллекциями.ЗначениеВМассив(ИменаМодулей);
	
	ОбщиеМодули = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений("Имя, ФактическоеИмя, Модуль");
	Для Каждого ИмяМодуля Из МассивИменМодулей Цикл
		
		Если ИмяМодуля = "ОбращенияКИСКлиентСервер" Тогда
			ОбщийМодуль = вмс_Обмен_с_КИС_КлиентСервер;
			ФактическоеИмяМодуля = "вмс_Обмен_с_КИС_КлиентСервер";
		Иначе
			ОбщийМодуль = Неопределено;
			Для Каждого ПрефиксМодуля Из ПрефиксыМодулей Цикл
				ФактическоеИмяМодуля = ПрефиксМодуля + ИмяМодуля;
				Попытка
					ОбщийМодуль = Вычислить(ФактическоеИмяМодуля);
					Прервать;
				Исключение
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		ЭлементОбщийМодуль = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(ОбщиеМодули);
		ЭлементОбщийМодуль.Имя = ИмяМодуля;
		ЭлементОбщийМодуль.ФактическоеИмя = ФактическоеИмяМодуля;
		ЭлементОбщийМодуль.Модуль = ОбщийМодуль;
		
		СоответствиеОбщихМодулей[ОбщийМодуль] = ФактическоеИмяМодуля;

	КонецЦикла;
	
	Возврат ОбщиеМодули;
	
КонецФункции

Функция ЭтоКлиент() Экспорт
	
#Если Клиент И НЕ ТолстыйКлиентОбычноеПриложение И НЕ ТолстыйКлиентУправляемоеПриложение Тогда
		Возврат Истина;
#Иначе
		Возврат Ложь;
#КонецЕсли
	
КонецФункции

Функция ЭтоБэкенд() Экспорт
	
	Возврат вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ЭтоБэкенд();
	
КонецФункции

Функция ПолучитьОбщиеМодули(ИменаМодулей) Экспорт
	
	ТаблицаОбщихМодулей = ПолучитьТаблицуОбщихМодулей(ИменаМодулей);
	СтрокиОбщихМодулей = вмс_РаботаСКоллекциями.ПолучитьЭлементыКоллекции(ТаблицаОбщихМодулей);
	ОбщиеМодули = Новый Структура;
	Для Каждого СтрокаОбщегоМодуля Из СтрокиОбщихМодулей Цикл
		
		ОбщиеМодули.Вставить(СтрокаОбщегоМодуля.Имя, СтрокаОбщегоМодуля.Модуль);
		
	КонецЦикла;
	
	Возврат ОбщиеМодули;
	
КонецФункции

Функция ПолучитьИмяТипаСсылкиИзИмениТипаОбъекта(ИмяТипа) Экспорт
	
	ИмяТипаСсылки = ИмяТипа;
	ИмяТипаСсылки = СтрЗаменить(ИмяТипаСсылки, "Catalog.", "СправочникСсылка.");
	ИмяТипаСсылки = СтрЗаменить(ИмяТипаСсылки, "Справочник.", "СправочникСсылка.");
	
	Возврат ИмяТипаСсылки;
	
КонецФункции

/////////////////////////////////////////////////////////////////
// { Мета данные объектов

Функция ПолучитьСтруктуруОписанияМетаданныхКонфигурации() Экспорт
	
	Возврат Новый Структура("
	|HTTPСервисы,
	|WebСервисы,
	|WSСсылки,
	|АвторскиеПрава,
	|АдресИнформацииОКонфигурации,
	|АдресИнформацииОПоставщике,
	|АдресКаталогаОбновлений,
	|БизнесПроцессы,
	|Боты,
	|ВариантВстроенногоЯзыка,
	|Версия,
	|ВключатьСправкуВСодержание,
	|ВнешниеИсточникиДанных,
	|ГруппыКоманд,
	|Документы,
	|ДополнительнаяФормаКонстант,
	|ДополнительныеСловариПолнотекстовогоПоиска,
	|ЖурналыДокументов,
	|Задачи,
	|Заставка,
	|Имя,
	|ИнтерфейсКлиентскогоПриложения,
	|Интерфейсы,
	|ИспользоватьОбычныеФормыВУправляемомПриложении,
	|ИспользоватьУправляемыеФормыВОбычномПриложении,
	|ИспользуемаяФункциональностьМобильногоПриложения,
	|КартинкаОсновногоРаздела,
	|КомандныйИнтерфейс,
	|КомандныйИнтерфейсОсновногоРаздела,
	|Комментарий,
	|Константы,
	|КраткаяИнформация,
	|КритерииОтбора,
	|Логотип,
	|МодульВнешнегоСоединения,
	|МодульОбычногоПриложения,
	|МодульСеанса,
	|МодульУправляемогоПриложения,
	|НавигационныеСсылкиМобильногоПриложения,
	|НазначениеРасширенияКонфигурации,
	|НазначенияИспользования,
	|НумераторыДокументов,
	|Обработки,
	|ОбщиеКартинки,
	|ОбщиеКоманды,
	|ОбщиеМакеты,
	|ОбщиеМодули,
	|ОбщиеРеквизиты,
	|ОбщиеФормы,
	|ОпределяемыеТипы,
	|ОсновнаяФормаВариантаОтчета,
	|ОсновнаяФормаВыбораПользователейСистемыВзаимодействия,
	|ОсновнаяФормаДанныхВерсииИсторииДанных,
	|ОсновнаяФормаИсторииИзмененийИсторииДанных,
	|ОсновнаяФормаКонстант,
	|ОсновнаяФормаНастроекДинамическогоСписка,
	|ОсновнаяФормаНастроекОтчета,
	|ОсновнаяФормаОтчета,
	|ОсновнаяФормаПоиска,
	|ОсновнаяФормаРазличийВерсийИсторииДанных,
	|ОсновнойИнтерфейс,
	|ОсновнойРежимЗапуска,
	|ОсновнойСтиль,
	|ОсновнойЯзык,
	|ОсновныеРоли,
	|Отчеты,
	|ПакетыXDTO,
	|ПараметрыСеанса,
	|ПараметрыФункциональныхОпций,
	|Перечисления,
	|ПланыВидовРасчета,
	|ПланыВидовХарактеристик,
	|ПланыОбмена,
	|ПланыСчетов,
	|ПоддерживатьСоответствиеОбъектамРасширяемойКонфигурацииПоВнутреннимИдентификаторам,
	|ПодпискиНаСобытия,
	|ПодписьМобильногоКлиента,
	|ПодробнаяИнформация,
	|Подсистемы,
	|Последовательности,
	|Поставщик,
	|ПрефиксИмен,
	|ПринадлежностьОбъекта,
	|РабочаяОбластьНачальнойСтраницы,
	|РегистрыБухгалтерии,
	|РегистрыНакопления,
	|РегистрыРасчета,
	|РегистрыСведений,
	|РегламентныеЗадания,
	|РежимАвтонумерацииОбъектов,
	|РежимИспользованияМодальности,
	|РежимИспользованияСинхронныхВызововРасширенийПлатформыИВнешнихКомпонент,
	|РежимОсновногоОкнаКлиентскогоПриложения,
	|РежимСовместимости,
	|РежимСовместимостиИнтерфейса,
	|РежимСовместимостиРасширенияКонфигурации,
	|РежимУправленияБлокировкойДанных,
	|РодительскиеКонфигурации,
	|Роли,
	|РолиОграниченияАвтономнойКонфигурации,
	//|СвойстваОбъектов,
	|СервисыИнтеграции,
	|Синоним,
	|СоставАвтономнойКонфигурации,
	|Справка,
	|Справочники,
	|Стили,
	|ТребуемыеРазрешенияМобильногоПриложения,
	|ФрагментКомандногоИнтерфейса,
	|ФункциональныеОпции,
	|ХранилищаНастроек,
	|ХранилищеВариантовОтчетов,
	|ХранилищеВнешнихДанныхНавигационныхСсылок,
	|ХранилищеНастроекДанныхФорм,
	|ХранилищеОбщихНастроек,
	|ХранилищеПользовательскихНастроекДинамическихСписков,
	|ХранилищеПользовательскихНастроекОтчетов,
	|ЭлементыСтиля,
	|Языки
	|");
	
КонецФункции

Функция ПолучитьСтруктуруОписанияМетаданныхОбъектов() Экспорт
	
	Поля = "
	
	|Имя,
	|Комментарий,
	|ОбъектРасширяемойКонфигурации,
	|ПринадлежностьОбъекта,
	|Синоним,
	|СтандартныеРеквизиты,
	|Автонумерация,
	|БыстрыйВыбор,
	|ВводитсяНаОсновании,
	|ВводПоСтроке,
	|ВидИерархии,
	|ВключатьСправкуВСодержание,
	|Владельцы,
	|ВыполнятьОбработкуПослеЗаписиВерсииИсторииДанных,
	|ГруппыСверху,
	|ДлинаКода,
	|ДлинаНаименования,
	|ДополнительнаяФормаГруппы,
	|ДополнительнаяФормаДляВыбора,
	|ДополнительнаяФормаДляВыбораГруппы,
	|ДополнительнаяФормаОбъекта,
	|ДополнительнаяФормаСписка,
	|ДопустимаяДлинаКода,
	|Иерархический,
	|ИспользованиеПодчинения,
	|ИспользоватьСтандартныеКоманды,
	|ИсторияВыбораПриВводе,
	|ИсторияДанных,
	|КоличествоУровней,
	|Команды,
	|КонтрольУникальности,
	|Макеты,
	|МодульМенеджера,
	|МодульОбъекта,
	|ОбновлениеПредопределенныхДанных,
	|ОбновлятьИсториюДанныхСразуПослеЗаписи,
	|ОграничиватьКоличествоУровней,
	|ОсновнаяФормаГруппы,
	|ОсновнаяФормаДляВыбора,
	|ОсновнаяФормаДляВыбораГруппы,
	|ОсновнаяФормаОбъекта,
	|ОсновнаяФормаСписка,
	|ОсновноеПредставление,
	|ПолнотекстовыйПоиск,
	|ПолнотекстовыйПоискПриВводеПоСтроке,
	|ПоляБлокировкиДанных,
	|Пояснение,
	|Предопределенные,
	|ПредставлениеОбъекта,
	|ПредставлениеСписка,
	|РасширенноеПредставлениеОбъекта,
	|РасширенноеПредставлениеСписка,
	|РежимПолученияДанныхВыбораПриВводеПоСтроке,
	|РежимУправленияБлокировкойДанных,
	|Реквизиты,
	|СерииКодов,
	|СозданиеПриВводе,
	|СпособВыбора,
	|СпособПоискаСтрокиПриВводеПоСтроке,
	|СпособРедактирования,
	|Справка,
	|ТабличныеЧасти,
	|ТипКода,
	|Формы,
	|Характеристики,
	|Движения,
	|ДлинаНомера,
	|ДопустимаяДлинаНомера,
	|ЗаписьДвиженийПриПроведении,
	|ЗаполнениеПоследовательностей,
	|Нумератор,
	|ОперативноеПроведение,
	|ПериодичностьНомера,
	|ПривилегированныйРежимПриОтменеПроведения,
	|ПривилегированныйРежимПриПроведении,
	|Проведение,
	|ТипНомера,
	|УдалениеДвижений
	
	|";
	
	Возврат Новый Структура(Поля);
	
КонецФункции

Функция ПолучитьСтруктуруОписанияМетаданныхОбщихМодулей() Экспорт
	
	Поля = "
	
	|Имя,
	|Комментарий,
	|ОбъектРасширяемойКонфигурации,
	|ПринадлежностьОбъекта,
	|Синоним,
	|ВнешнееСоединение,
	|ВызовСервера,
	|Глобальный,
	|КлиентОбычноеПриложение,
	|КлиентУправляемоеПриложение,
	|Модуль,
	|ПовторноеИспользованиеВозвращаемыхЗначений,
	|Привилегированный,
	|Сервер
	
	|";
	
	Возврат Новый Структура(Поля);
	
КонецФункции

Функция ПолучитьСтруктуруОписанияМетаданныхРеквизита() Экспорт
	
	Возврат Новый Структура("
	
	|Имя,
	|Комментарий,
	|ОбъектРасширяемойКонфигурации,
	|ПринадлежностьОбъекта,
	|Синоним,
	|БыстрыйВыбор,
	|ВыборГруппИЭлементов,
	|ВыделятьОтрицательные,
	|ЗаполнятьИзДанныхЗаполнения,
	|ЗначениеЗаполнения,
	|Индексирование,
	|Использование,
	|ИсторияВыбораПриВводе,
	|ИсторияДанных,
	|МаксимальноеЗначение,
	|Маска,
	|МинимальноеЗначение,
	|МногострочныйРежим,
	|ПараметрыВыбора,
	|Подсказка,
	|ПолнотекстовыйПоиск,
	|ПроверкаЗаполнения,
	|РасширенноеРедактирование,
	|РежимПароля,
	|СвязиПараметровВыбора,
	|СвязьПоТипу,
	|СозданиеПриВводе,
	|Тип,
	|ФормаВыбора,
	|Формат,
	|ФорматРедактирования	

	|");
	
КонецФункции

//Функция ПолучитьДанныеТипаОбъекта(знач ТипОбъекта) Экспорт
//	
//	ЭтоКлиент = ЭтоКлиент();
//	
//	ДанныеТиповОбъектов = ПолучитьПараметрыПриложения()["ДанныеТиповОбъектов"];
//	ДанныеТипаОбъекта = ДанныеТиповОбъектов[ТипОбъекта];
//	
//	Если ДанныеТипаОбъекта = Неопределено Тогда
//		ДанныеТипаОбъекта = вмс_ОбщегоНазначенияВызовСервера.ПолучитьДанныеТипаОбъекта(ТипОбъекта);
//		ИмяТипаОбъекта = ДанныеТипаОбъекта.Имя;
//		Если ИмяТипаОбъекта = ТипОбъекта Тогда
//			Попытка
//				ТипОбъекта = Тип(ИмяТипаОбъекта);
//			Исключение
//			КонецПопытки;
//		КонецЕсли;

//		ДанныеТипаОбъекта.ТипОбъекта = ТипОбъекта;
//		Если ЭтоКлиент ИЛИ НЕ ДанныеТипаОбъекта.ЕстьМетаданныеОбъекта Тогда
//			МенеджерОбъектов = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьМенеджерОбъектов(ИмяТипаОбъекта);
//			ДанныеТипаОбъекта.МенеджерОбъектов = МенеджерОбъектов;

//			СоответствиеЗначенийПоИмени = ДанныеТипаОбъекта.СоответствиеЗначенийПоИмени;
//			Если СериализаторXDTO.XMLТипЗнч(ТипОбъекта) <> Неопределено Тогда
//				Для Каждого ЗначениеПеречисления Из МенеджерОбъектов Цикл
//					ИмяЗначения = ВРЕГ(СериализаторXDTO.XMLСтрока(ЗначениеПеречисления));
//					СоответствиеЗначенийПоИмени[ИмяЗначения] = ЗначениеПеречисления;
//				КонецЦикла;
//			Иначе
//				Для Каждого ЗначениеПеречисления Из МенеджерОбъектов Цикл
//					ИмяЗначения = ВРЕГ(Строка(ЗначениеПеречисления));
//					СоответствиеЗначенийПоИмени[ИмяЗначения] = ЗначениеПеречисления;
//				КонецЦикла;
//			КонецЕсли;
//		Иначе
//			ДанныеТипаОбъекта.МенеджерОбъектов = Вычислить("вмс_ОбщегоНазначенияСервер").ПолучитьМенеджерОбъектов(ИмяТипаОбъекта);
//		КонецЕсли;
//		
//		ДанныеТиповОбъектов[ИмяТипаОбъекта] = ДанныеТипаОбъекта;
//		Если ТипОбъекта <> Неопределено Тогда
//			ДанныеТиповОбъектов[ТипОбъекта] = ДанныеТипаОбъекта;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат ДанныеТипаОбъекта;
//	
//КонецФункции

Функция ПолучитьДанныеТипаОбъекта(знач ТипОбъекта) Экспорт
	
	ДанныеТиповОбъектов = ПолучитьПараметрыПриложения()["ДанныеТиповОбъектов"];
	ДанныеТипаОбъекта = ДанныеТиповОбъектов[ТипОбъекта];
	Если ДанныеТипаОбъекта <> Неопределено Тогда
		// есть в кэше
		Возврат ДанныеТипаОбъекта;
	КонецЕсли;

	#Если Клиент И НЕ ТолстыйКлиентОбычноеПриложение И НЕ ТолстыйКлиентУправляемоеПриложение Тогда
		
		ДанныеТипаОбъекта = вмс_ОбщегоНазначенияВызовСервера.ПолучитьДанныеТипаОбъекта(ТипОбъекта);
		
	#Иначе
		
		ДанныеТипаОбъекта = вмс_ОбщегоНазначенияСервер.ПолучитьДанныеТипаОбъекта(ТипОбъекта);

	#КонецЕсли
	
	ИмяТипаОбъекта = ДанныеТипаОбъекта.Имя;
	Если ДанныеТипаОбъекта.ТипОбъекта=Неопределено Тогда
		Попытка
			ДанныеТипаОбъекта.ТипОбъекта = Тип(ИмяТипаОбъекта);
		Исключение
		КонецПопытки;
	КонецЕсли;

	ТипОбъекта = ДанныеТипаОбъекта.ТипОбъекта;
	
	МенеджерОбъектов = ДанныеТипаОбъекта.МенеджерОбъектов;
	Если МенеджерОбъектов=Неопределено Тогда
		МенеджерОбъектов = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьМенеджерОбъектов(ИмяТипаОбъекта);
		Если МенеджерОбъектов <> Неопределено Тогда
			Если вмс_РаботаСКоллекциями.ДоступенОбходКоллекции(МенеджерОбъектов) Тогда
				СоответствиеЗначенийПоИмени = ДанныеТипаОбъекта.СоответствиеЗначенийПоИмени;
				Если СериализаторXDTO_XMLТип(ТипОбъекта) <> Неопределено Тогда
					Для Каждого ЗначениеПеречисления Из МенеджерОбъектов Цикл
						ИмяЗначения = ВРЕГ(СериализаторXDTO_XMLСтрока(ЗначениеПеречисления));
						СоответствиеЗначенийПоИмени[ИмяЗначения] = ЗначениеПеречисления;
					КонецЦикла;
				Иначе
					Для Каждого ЗначениеПеречисления Из МенеджерОбъектов Цикл
						ИмяЗначения = ВРЕГ(Строка(ЗначениеПеречисления));
						СоответствиеЗначенийПоИмени[ИмяЗначения] = ЗначениеПеречисления;
					КонецЦикла;
				КонецЕсли;
				
				ДанныеТипаОбъекта.ЭтоПеречисление = Истина;
			КонецЕсли;
			ДанныеТипаОбъекта.МенеджерОбъектов = МенеджерОбъектов;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеТиповОбъектов[ИмяТипаОбъекта] = ДанныеТипаОбъекта;
	Если ТипОбъекта <> Неопределено Тогда
		ДанныеТиповОбъектов[ТипОбъекта] = ДанныеТипаОбъекта;
	КонецЕсли;

	Возврат ДанныеТипаОбъекта;
	
КонецФункции

Функция СериализаторXDTO_XMLТип(Тип) Экспорт
	
	#Если ВебКлиент Тогда
		
		Возврат вмс_ОбщегоНазначенияВызовСервера.СериализаторXDTO_XMLТип(Тип);
		
	#Иначе
		
		Возврат СериализаторXDTO.XMLТип(Тип);
		
	#КонецЕсли
	
КонецФункции

Функция СериализаторXDTO_XMLСтрока(Значение) Экспорт
	
	#Если ВебКлиент Тогда
		
		Возврат вмс_ОбщегоНазначенияВызовСервера.СериализаторXDTO_XMLСтрока(Значение);
		
	#Иначе
		
		Возврат СериализаторXDTO.XMLСтрока(Значение);
		
	#КонецЕсли
	
КонецФункции

Функция ПолучитьИмяТипаОбъекта(ТипОбъекта) Экспорт
	
	Возврат ПолучитьДанныеТипаОбъекта(ТипОбъекта).Имя;
	
КонецФункции

Функция ЭтоПеречисление(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		ИмяТипаОбъекта = Объект;
	Иначе

	КонецЕсли;
	
	Попытка
		МенеджерОбъекта = Вычислить(ИмяТипаОбъекта);
	Исключение
	КонецПопытки;
	
	Если Не вмс_РаботаСКоллекциями.ДоступенОбходКоллекции(МенеджерОбъекта) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьМенеджерОбъектов(Объект) Экспорт

	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		ИмяТипаОбъекта = Объект;
	Иначе

	КонецЕсли;
	
	Попытка
		// менеджер получаем просто по имени типа объекта
		МенеджерОбъекта = Вычислить(ИмяТипаОбъекта);
	Исключение
	КонецПопытки;
	
	Возврат МенеджерОбъекта;
	
КонецФункции

Функция ПолучитьИмяОбщегоМодуля(Модуль) Экспорт
	
	ИмяМодуля = СоответствиеОбщихМодулей()[Модуль];

	Если ИмяМодуля=Неопределено Тогда

		ИмяМодуля = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.СоответствиеВсехМодулей()[Модуль];
		
	КонецЕсли;
	
	Возврат ИмяМодуля;
	
КонецФункции

Функция СоответствиеОбщихМодулей() Экспорт

	СоответствиеОбщихМодулей = ПолучитьПараметрПриложения("СоответствиеОбщихМодулей");
	Если СоответствиеОбщихМодулей=Неопределено Тогда
		СоответствиеОбщихМодулей = Новый Соответствие;
		УстановитьПараметрПриложения("СоответствиеОбщихМодулей", СоответствиеОбщихМодулей);
	КонецЕсли;
	
	Возврат СоответствиеОбщихМодулей;
	
КонецФункции

// } Мета данные объектов
/////////////////////////////////////////////////////////////////

Функция ПолучитьПараметрПриложения(ИмяПараметра) Экспорт
	
	Перем ПараметрыПриложения;
	
	ПараметрыПриложения = ПолучитьПараметрыПриложения();
	
	Если ПараметрыПриложения <> Неопределено Тогда
		
		Возврат ПараметрыПриложения[ИмяПараметра];
		
	КонецЕсли;
	
КонецФункции

Функция УстановитьПараметрПриложения(ИмяПараметра, ЗначениеПараметра) Экспорт  
	
	Перем ПараметрыПриложения;
	
	ПараметрыПриложения = ПолучитьПараметрыПриложения();
	
	Если ПараметрыПриложения <> Неопределено Тогда
		
		ПараметрыПриложения[ИмяПараметра] = ЗначениеПараметра;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПараметрыПриложения() Экспорт
	
	Перем ПараметрыПриложения;
	
#Если Клиент И НЕ ТолстыйКлиентОбычноеПриложение И НЕ ТолстыйКлиентУправляемоеПриложение Тогда
		// Тут все просто
		// возьмем параметры из глобальной переменной
		ПараметрыПриложения = Вычислить("вмс_ПараметрыПриложения");
#Иначе
		
		// а вот на сервере есть только кэш
		Способ = 3;
		
		Если Способ=1 Тогда
			
			// берем из кэша хранилища
			ПараметрыПриложения = ПолучитьИзВременногоХранилища(ПараметрыСеанса.вмс_АдресХранилищаПараметровПриложения);
			Сериализация = Ложь;
			Если ПараметрыПриложения <> Неопределено Тогда
				Сериализация = ПараметрыПриложения["ДанныеДляОтладки"].Ссылка1 <> ПараметрыПриложения["ДанныеДляОтладки"].Ссылка2;
				Если Сериализация Тогда
					ПараметрыПриложения = Неопределено;
				КонецЕсли;
			КонецЕсли;
			
			Если ПараметрыПриложения=Неопределено Тогда
				ПараметрыПриложения = НовыеПараметрыПриложения();
				ПоместитьВоВременноеХранилище(ПараметрыПриложения, ПараметрыСеанса.вмс_АдресХранилищаПараметровПриложения);
			КонецЕсли;
			
			ДанныеДляОтладки = ПараметрыПриложения["ДанныеДляОтладки"];
			
			Если Сериализация Тогда
				ДанныеДляОтладки.ПотерялиКэш = Истина;
				ДанныеДляОтладки.ПричинаПотериКэша = "Сериализация";
			КонецЕсли;
			
			ДанныеДляОтладки.ЭтоНовые = Ложь;
			
		ИначеЕсли Способ=2 Тогда
			// обернем кэшем модуля значений повторного использования
			ПараметрыПриложения = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ПолучитьПараметрыПриложения(0);
			ДанныеДляОтладки = ПараметрыПриложения["ДанныеДляОтладки"];
			ДанныеДляОтладки.ЭтоНовые = Ложь;
		Иначе
			НомерКэширования = ПараметрыСеанса.вмс_НомерКэшированияПараметровПриложения;
			Если НомерКэширования=0 Тогда
				// нулевой пациент
				ПараметрыСеанса.вмс_НомерКэшированияПараметровПриложения = 1;
				ПараметрыПриложения = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ПолучитьПараметрыПриложения(1);
				ДанныеДляОтладки = ПараметрыПриложения["ДанныеДляОтладки"];
				ДанныеДляОтладки.ЭтоНовые = Ложь;
			Иначе
				ПараметрыПриложенияПредыдущие = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ПолучитьПараметрыПриложения(НомерКэширования);
				ДанныеДляОтладки = ПараметрыПриложенияПредыдущие["ДанныеДляОтладки"];
				Если ДанныеДляОтладки.ЭтоНовые Тогда
					// Все таки произошел обвал цепочки кэша
					// не успели перекинуть с одной руки в другую
					// сбросим номер кэширования и данные в хранилище и начнем все сначала :((
					ПоместитьВоВременноеХранилище(Неопределено, ПараметрыСеанса.вмс_АдресХранилищаПараметровПриложения);
					ОбновитьПовторноИспользуемыеЗначения();
					ПараметрыСеанса.вмс_НомерКэшированияПараметровПриложения = 1;
					ПараметрыПриложения = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ПолучитьПараметрыПриложения(1);
					ПараметрыПриложения["ДанныеДляОтладки"] = ДанныеДляОтладки;
					Если НЕ ДанныеДляОтладки.ПотерялиКэш Тогда
						ДанныеДляОтладки.ПотерялиКэш = Истина;
						ДанныеДляОтладки.ПричинаПотериКэша = "СбросКэшаМодуляПовтИсп";
					КонецЕсли;
					ДанныеДляОтладки.ЭтоНовые = Ложь;
				Иначе
					Если ТекущаяДата() - ДанныеДляОтладки.ДатаКэширования > 60 Тогда
						// Старый кэш скоро подохнет
						// пересядем на новый пока не поздно
						ПараметрыПриложения = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ПолучитьПараметрыПриложения(НомерКэширования+1);
						ПараметрыСеанса.вмс_НомерКэшированияПараметровПриложения = НомерКэширования+1;
					Иначе
						// попользуемся пока старым кэшем
						ПараметрыПриложения = ПараметрыПриложенияПредыдущие;
						
						// подкрепим также кэшем хранилища
						ПоместитьВоВременноеХранилище(ПараметрыПриложения, ПараметрыСеанса.вмс_АдресХранилищаПараметровПриложения);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

#КонецЕсли
	
	Возврат ПараметрыПриложения;
	
КонецФункции

Функция ДержательМестаДляПараметровПриложения() Экспорт
	
	Держатель = Новый Структура;
	Держатель.Вставить("ДанныеДляОтладки", НовыеПараметрыПриложения()["ДанныеДляОтладки"]);
	Держатель.Вставить("ЭтоДержательМеста", Истина);
	
	Возврат Держатель;
	
КонецФункции

Функция ЭтоДержательМестаДляПараметровПриложения(Объект) Экспорт
	
	Возврат ТипЗнч(Объект)=Тип("Структура") И Объект.Свойство("ЭтоДержательМеста") И Объект.ЭтоДержательМеста=Истина;
	
КонецФункции

Функция СброситьДанныеОтладкиСеанса() Экспорт
	
	ПараметрыПриложения = ПолучитьПараметрыПриложения();
	НовыеПараметрыПриложения = НовыеПараметрыПриложения();
	
	ЗаполнитьЗначенияСвойств(ПараметрыПриложения["ДанныеДляОтладки"], НовыеПараметрыПриложения["ДанныеДляОтладки"], , "ЭтоНовые, ДатаКэширования");
	
КонецФункции

#Область ВыполнениеАлгоритмов

Функция ВыполнитьАлгоритм(Алгоритм, ВходящиеПараметры = Неопределено, ОшибкаВыполнения = Ложь, СообщениеОбОшибке = "") Экспорт
	АлгоритмСсылка = вмс_ОбщегоНазначенияВызовСервера.ПолучитьСсылкуСправочникАлгоритмы(Алгоритм);
	Если АлгоритмСсылка = Неопределено Или Не ЗначениеЗаполнено(АлгоритмСсылка) Тогда
		СообщениеОбОшибке = "Алгоритмы : Ошибка выполнения функции(не определен сценарий " + Алгоритм + " )";
		Если ВходящиеПараметры = Неопределено Тогда
			ВходящиеПараметры = Новый Структура;
		КонецЕсли;
		ВходящиеПараметры.Вставить("Отказ", Истина);
		ВходящиеПараметры.Вставить("СообщениеОбОшибке", СообщениеОбОшибке);
		//        ЗаписатьВЖурналРегистрации(,СообщениеОбОшибке);
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Если ТипЗнч(ВходящиеПараметры) = Тип("Структура") Тогда
		Если ВходящиеПараметры.Свойство("this") Тогда
			this = ВходящиеПараметры.this;
		Иначе
			this = Новый Соответствие;
		КонецЕсли;
	Иначе
		ВходящиеПараметры = Новый Структура;
		this = Новый Соответствие;
	КонецЕсли;
	
	
	СвойстваДляРеквизитовАлгоритма = "Ссылка,ТекстАлгоритма,ВыбрасыватьИсключение,ЗаписыватьОшибкиВЖР,ВыполнятьВТранзакции, Хранилище";
	
	СвойстваАлгоритма = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначенияРеквизитовОбъекта(АлгоритмСсылка,
	СвойстваДляРеквизитовАлгоритма); 
	
	Если  ВходящиеПараметры = Неопределено Тогда
		Параметры = СвойстваАлгоритма.Хранилище.Получить();
	Иначе
		Параметры = ВходящиеПараметры;
		ПредопределенныеПараметры = СвойстваАлгоритма.Хранилище.Получить();
		Если ПредопределенныеПараметры <> Неопределено Тогда
			Для каждого КлючЗначение Из ПредопределенныеПараметры Цикл
				Если Не Параметры.Свойство(КлючЗначение.Ключ) Тогда
					Параметры.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);	
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли; 
	КонецЕсли;
	
	ИсполняемыйКод = ПреобразоватьТекстВКодАлгоритма(СвойстваАлгоритма.ТекстАлгоритма);
	
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Если СвойстваАлгоритма.ВыполнятьВТранзакции Тогда
			НачатьТранзакцию();
		КонецЕсли;
	#КонецЕсли
	Попытка
		Выполнить (ИсполняемыйКод);
		
		#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
			Если СвойстваАлгоритма.ВыполнятьВТранзакции Тогда
				ЗафиксироватьТранзакцию();
			КонецЕсли;
		#КонецЕсли
		
	Исключение
		#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
			Если СвойстваАлгоритма.ВыполнятьВТранзакции Тогда
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
			КонецЕсли;
		#КонецЕсли
		
		СообщениеОбОшибке = СообщениеОбОшибке + " Ошибка: " + ОписаниеОшибки() + ";";
		ОшибкаВыполнения = Истина;   
		#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
			
			Если СвойстваАлгоритма.ЗаписыватьОшибкиВЖР Тогда
				ЗаписьЖурналаРегистрации("WMS"
				,УровеньЖурналаРегистрации.Ошибка ,,,"" + АлгоритмСсылка + " " + СообщениеОбОшибке);
			КонецЕсли;
		#КонецЕсли 
		
		
		Если СвойстваАлгоритма.ВыбрасыватьИсключение Тогда
			ВызватьИсключение ОписаниеОшибки();
		КонецЕсли;
	КонецПопытки
	
	///	Объект = Алгоритм.ПолучитьОбъект();
	////	Возврат Объект.ВыполнитьФункцию(ДополнительныеПараметры);
КонецФункции  

#КонецОбласти

#Область СлужебныеПроцедуры

Функция НормализоватьТекст(Текст, МеткаEndOfText = Истина, СтрокаСлов = "") Экспорт
	КодАлгоритма = СтрЗаменить(Текст, Символы.Таб, " ");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, Символы.ПС, " ^ ");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "=", " = ");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "+", " + ");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "<", " < ");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, ">", " > ");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, ";", " ; ");

	Для А = 0 По Окр(Sqrt(СтрЧислоВхождений(КодАлгоритма, "  ")), 0) Цикл
		КодАлгоритма = СтрЗаменить(КодАлгоритма, "  ", " ");
	КонецЦикла;
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "< =", "<=");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "> =", ">=");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "< >", "<>");
	МассивСлов = СтрРазделить(КодАлгоритма, " ");
	СтрокаСловПоУмолчанию = "Возврат,И,Или,Не,Если,Тогда,КонецЕсли,Для,Каждого,Из,Пока,Цикл,КонецЦикла";
	МассивСлужебныхСлов = СтрРазделить(?(ПустаяСтрока(СтрокаСлов), СтрокаСловПоУмолчанию, СтрокаСлов), ",");
	Для Слово = 0 По МассивСлов.ВГраница() Цикл
		Для Каждого СлужебноеСлово Из МассивСлужебныхСлов Цикл
			Если НРег(СокрЛП(МассивСлов[Слово])) = НРег(СлужебноеСлово) Тогда
				МассивСлов[Слово] = СлужебноеСлово;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	КодАлгоритма = СтрСоединить(МассивСлов, " ");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "^", Символы.ПС);
	Если МеткаEndOfText И Найти(КодАлгоритма, "~EndOfText:") = 0 Тогда
		КодАлгоритма = КодАлгоритма + Символы.ПС + "~EndOfText:";
	КонецЕсли;
	Возврат КодАлгоритма;
КонецФункции

Функция МассивИсключаемыхСимволов() Экспорт
	мИсключая = СтрРазделить(";,+, = ,-,),(,.,[,],{,},|,/,\,>,<,$,@,#", ",");
	мИсключая.Добавить(Символы.ПС);
	мИсключая.Добавить(Символы.Таб);
	мИсключая.Добавить(Символ(32));
	мИсключая.Добавить(",");
	мИсключая.Добавить("""");
	Возврат мИсключая;
КонецФункции

Функция ПреобразоватьТекстВКодАлгоритма(Текст) Экспорт
	КодАлгоритма = НормализоватьТекст(Текст);
	мИсключая = МассивИсключаемыхСимволов();
	пЗаменаВставка(КодАлгоритма, "@ВычислитьФункцию", "_37583_АлгоритмыСервер.ВыполнитьФункцию", "[""""Результат""""]",
		мИсключая);
	пЗаменаВставка(КодАлгоритма, "@РезультатФункции", "_37583_АлгоритмыСервер.ВыполнитьФункцию", "[""Результат""]",
		мИсключая);
	пЗаменаВставка(КодАлгоритма, "@РезультатФункцииКлиент", "_37583_АлгоритмыКлиент.ВыполнитьФункцию",
		"[""Результат""]", мИсключая);
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "@ПроцедураКлиент", "_37583_АлгоритмыКлиент.ВыполнитьПроцедуру");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "@ПроцедураКлиентАсинхронно", "_37583_АлгоритмыКлиент.ВыполнитьПроцедуру");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "@ФункцияКлиент", "_37583_АлгоритмыКлиент.ВыполнитьФункцию");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "@Процедура", "_37583_АлгоритмыСервер.ВыполнитьПроцедуру");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "@Функция", "_37583_АлгоритмыСервер.ВыполнитьФункцию");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "@ПеременныеСреды", "_37583_АлгоритмыКэш.ПолучитьПараметры_37583()");
	пЗаменаВставка(КодАлгоритма, "#", "[""", """]", мИсключая);
	пЗаменаВставка(КодАлгоритма, "$$", "this[", "]", мИсключая);
	пЗаменаВставка(КодАлгоритма, "$'", "this[""""", """""]", мИсключая);
	пЗаменаВставка(КодАлгоритма, "$", "this[""", """]", мИсключая);
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "@", "Параметры.");
	КодАлгоритма = СтрЗаменить(КодАлгоритма, "Возврат ;", "Перейти ~EndOfText;");
	//КодАлгоритма = СтрЗаменить(КодАлгоритма,"Возврат ","this[""Результат""] = ");
	пЗаменаВставка(КодАлгоритма, "Возврат ", "this[""Результат""] = ", "; Перейти ~EndOfText", ";", " ");

	Возврат КодАлгоритма;
КонецФункции

Процедура пЗаменаВставка(КодАлг, Префикс, До = "", После = "", Исключая = "", Включая = "") Экспорт
	Пока Найти(КодАлг, Префикс) > 0 Цикл
		Слово = ПолучитьПервоеВхождениеСловоБезПрефикса(КодАлг, Префикс, Исключая, Включая);
		КодАлг = СтрЗаменить(КодАлг, Префикс + Слово, До + Слово + После);
	КонецЦикла;
КонецПроцедуры

Функция фЗаменаВставка(Знач КодАлг, Префикс, До = "", После = "", Исключая = "", Включая = "") Экспорт
	Пока Найти(КодАлг, Префикс) > 0 Цикл
		Слово = ПолучитьПервоеВхождениеСловоБезПрефикса(КодАлг, Префикс, Исключая, Включая);
		КодАлг = СтрЗаменить(КодАлг, Префикс + Слово, До + Слово + После);
	КонецЦикла;
	Возврат КодАлг;
КонецФункции

Функция ПолучитьПервоеВхождениеСловоБезПрефикса(Строка, Преф, Исключая = ";,+, = ,-,),(,.,[,],{,},|,/,\,>,<",
	Включая = "") Экспорт
	ДлинаПреф = СтрДлина(Преф);
	ПозПрефикс = СтрНайти(Строка, Преф) + ДлинаПреф;

	Если ТипЗнч(Включая) = Тип("Массив") Тогда
		мВключая = Включая;
	Иначе
		мВключая = СтрРазделить(Включая, ",");
	КонецЕсли;

	Если ТипЗнч(Исключая) = Тип("Массив") Тогда
		мИсключая = Исключая;
	Иначе
		мИсключая = СтрРазделить(Исключая, ",");
	КонецЕсли;

	мТерм = Новый Массив;
	Для Каждого СимволИсключая Из мИсключая Цикл
		Если мВключая.Найти(СимволИсключая) = Неопределено Тогда
			мТерм.Добавить(СтрНайти(Сред(Строка, ПозПрефикс), СимволИсключая));
		КонецЕсли;
	КонецЦикла;

	Терм = 1000000;
	Для Каждого Элемент Из мТерм Цикл
		Если Элемент > 0 И Элемент < Терм Тогда
			Терм = Элемент;
		КонецЕсли;
	КонецЦикла;

	Слово = ?(Терм < 1000000, Сред(Строка, Найти(Строка, Преф) + ДлинаПреф, Терм - 1), Сред(Строка, Найти(Строка, Преф)
		+ ДлинаПреф));
	Возврат Слово;
КонецФункции

#КонецОбласти

Функция ПолучитьТекстОбъектаXDTO(Объект) Экспорт

#Если ВебКлиент Тогда
		
		Возврат вмс_ОбщегоНазначенияВызовСервера.ПолучитьТекстОбъектаXDTO(Объект);
		
#Иначе
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Объект);
		ТекстОбъекта = ЗаписьXML.Закрыть();

		Возврат ТекстОбъекта;
		
#КонецЕсли

КонецФункции

Функция ПрочитатьТекстОбъектаXDTO(ТекстОбъекта) Экспорт

#Если ВебКлиент Тогда
		
		Возврат вмс_ОбщегоНазначенияВызовСервера.ПрочитатьТекстОбъектаXDTO(ТекстОбъекта);
		
#Иначе
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ТекстОбъекта);
		Объект = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		ЧтениеXML.Закрыть();

		Возврат Объект;
		
#КонецЕсли
	
КонецФункции

Функция ПреобразоватьЧислоВДругуюСистемуСчисления(знач Число, ИсходноеОснование=Неопределено, Основание) Экспорт
	
	Если Основание < 2 ИЛИ Основание > 16 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Цифры = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ПолучитьЦифрыШестнадцатиричнойСистемы();
	
	НовоеЧисло = "";
	
	Если ТипЗнч(Число) = Тип("Строка") Тогда
		ЧислоСтрокой = Число;
		Число = 0;
		ДлинаСтроки = СтрДлина(ЧислоСтрокой);
		МножительРазряда = 1;
		Для НомерСимвола=1 По ДлинаСтроки Цикл
			Цифра = Сред(ЧислоСтрокой, ДлинаСтроки-НомерСимвола+1, 1);
			ИндексЦифры = Цифры.Найти(Цифра);
			Число = Число + ИндексЦифры*МножительРазряда;
			МножительРазряда = МножительРазряда * ИсходноеОснование;
		КонецЦикла;
	КонецЕсли;
	
	Остаток = Число;
	Пока Остаток > 0 Цикл
		ИндексЦифры = Остаток % Основание;
		Цифра = Цифры[ИндексЦифры];
		НовоеЧисло = Цифра + НовоеЧисло;
		Остаток = Цел(Остаток / Основание);
	КонецЦикла;
	
	Возврат НовоеЧисло;
	
КонецФункции

Функция НовыеПараметрыПриложения() Экспорт

	Перем ПараметрыПриложения;
	
	СистемаШтрихкодирования = Новый Структура;
	СистемаШтрихкодирования.Вставить("Клиенты", Новый Соответствие);
	
	ТестоваяСтруктура = Новый Структура;
	ТестоваяСтруктура.Вставить("Поле1", 1);
	
	ДанныеДляОтладки = Новый Структура;
	ДанныеДляОтладки.Вставить("ДатаИнициализации", ТекущаяДата());
	ДанныеДляОтладки.Вставить("Идентификатор", Новый УникальныйИдентификатор);
	ДанныеДляОтладки.Вставить("Ссылка1", ТестоваяСтруктура);
	ДанныеДляОтладки.Вставить("Ссылка2", ТестоваяСтруктура);
	ДанныеДляОтладки.Вставить("ЭтоНовые", Истина);
	ДанныеДляОтладки.Вставить("ПотерялиКэш", Ложь);
	ДанныеДляОтладки.Вставить("ЧутьНеПотерялиКэш", Ложь);
	ДанныеДляОтладки.Вставить("ПричинаПотериКэша", "Нет");
	ДанныеДляОтладки.Вставить("ДатаКэширования");
	
	ПараметрыПриложения = Новый Соответствие;
	ПараметрыПриложения["СистемаШтрихкодирования"] = СистемаШтрихкодирования;
	
	ПараметрыПриложения["КлиентскиеПеременные"] = Новый Соответствие;
	ПараметрыПриложения["ОписаниеМетаданных"] = Новый Соответствие;
	ПараметрыПриложения["ДанныеТиповОбъектов"] = Новый Соответствие;
	ПараметрыПриложения["ИмяКомпьютера"] = "localhost";
	
	ПараметрыПриложения["ДанныеДляОтладки"] = ДанныеДляОтладки;

	Возврат ПараметрыПриложения;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////
//
//				Квази описание типов+
//	Не все типы могут быть представлены на клиенте...
//

Функция НовоеКвазиОписаниеТипов(Типы=Неопределено) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	КвазиОписаниеТипов = Новый Структура;
	КвазиОписаниеТипов.Вставить("МассивИменТипов", Новый Массив);
	КвазиОписаниеТипов.Вставить("ЭтоКвазиОписаниеТипов", Истина);
	
	Если Типы<>Неопределено Тогда
		Если ТипЗнч(Типы)=Тип("ОписаниеТипов") Тогда
			МассивТипов = Типы.Типы();
		Иначе
			МассивТипов = РК.ЗначениеВМассив(Типы, , Ложь);
		КонецЕсли;
		
		Для Каждого Тип Из МассивТипов Цикл
			КвазиОписаниеТипов.МассивИменТипов.Добавить(ПолучитьИмяТипаОбъекта(Тип));
		КонецЦикла;
	КонецЕсли;
	
	Возврат КвазиОписаниеТипов;
	
КонецФункции

Функция ЭтоКвазиОписаниеТипов(Объект) Экспорт
	
	Возврат ТипЗнч(Объект)=Тип("Структура") И Объект.Свойство("ЭтоКвазиОписаниеТипов");
	
КонецФункции

Функция ПолучитьОписаниеТиповИзКвазиОписанияТипов(КвазиОписаниеТипов) Экспорт
	
	МассивТипов = Новый Массив;
	Для Каждого ИмяТипа Из КвазиОписаниеТипов.МассивИменТипов Цикл
		Попытка
			Тип = Тип(ИмяТипа);
		Исключение
			Тип = Неопределено;
		КонецПопытки;
		
		Если Тип<>Неопределено Тогда
			МассивТипов.Добавить(Тип);
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	
	Возврат ОписаниеТипов;
	
КонецФункции

//
//				Квази описание типов-
//
/////////////////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////////////////
//
//				Замер времени+
//

Функция НачатьЗамерВремени() Экспорт
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Возврат ВремяНачала;
	
КонецФункции

Функция ЗакончитьЗамерВремени(ВремяНачала, Заголовок=Неопределено, Текст=Неопределено, Сообщить=Истина) Экспорт
	
	Время = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;
	
	ПоляЧастей = "Мера, Представление, Значение";
	
	ЧастиВремени = Новый Массив;
	ЧастиВремени.Добавить(Новый Структура(ПоляЧастей, 1, "мс"));
	ЧастиВремени.Добавить(Новый Структура(ПоляЧастей, 1000, "с"));
	ЧастиВремени.Добавить(Новый Структура(ПоляЧастей, 60, "м"));
	ЧастиВремени.Добавить(Новый Структура(ПоляЧастей, 60, "ч"));
	ЧастиВремени.Добавить(Новый Структура(ПоляЧастей, 24, "д"));
	
	ВремяОстаток = Время;
	Для НомерЧасти=0 По ЧастиВремени.Количество()-1-1 Цикл
		Мера = ЧастиВремени[НомерЧасти+1].Мера;
		ЧастиВремени[НомерЧасти].Значение = ВремяОстаток % Мера;
		ВремяОстаток = Цел(ВремяОстаток / Мера);
	КонецЦикла;
	
	ЧастиВремени[ЧастиВремени.ВГраница()].Значение = ВремяОстаток;
	
	Текст = "";
	Показывать = Ложь;
	Для НомерЧасти=0 По ЧастиВремени.ВГраница() Цикл
		
		ЧастьВремени = ЧастиВремени[ЧастиВремени.ВГраница()-НомерЧасти];
		
		Если Не Показывать Тогда
			Если ЧастьВремени.Значение <> 0 ИЛИ НомерЧасти=ЧастиВремени.ВГраница() Тогда
				Показывать = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Показывать Тогда
			Текст = Текст + ?(ЗначениеЗаполнено(Текст), " ", "");
			Текст = Текст + ЧастьВремени.Значение + " " + ЧастьВремени.Представление;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Сообщить Тогда
		Если Заголовок <> Неопределено Тогда
			Сообщить(Заголовок);
		КонецЕсли;
		Сообщить(Текст);
	КонецЕсли;
	
	Возврат Время;
	
КонецФункции

//
//				Замер времени-
//
/////////////////////////////////////////////////////////////////////////////////////////

Функция ЦветСтиля(ИмяЦветаСтиля) Экспорт

	Перем ОбщегоНазначенияВызовСервера;
	
	ОбщегоНазначенияВызовСервера = вмс_ОбщегоНазначенияВызовСервера;
	
	ЦветаСтиля = ПолучитьПараметрПриложения("ЦветаСтиля");
	
	Если ЦветаСтиля = Неопределено Тогда
		ЦветаСтиля = Новый Структура;
		УстановитьПараметрПриложения("ЦветаСтиля", ЦветаСтиля);
	КонецЕсли;
	
	ЦветСтиля = Неопределено;
	Если Не ЦветаСтиля.Свойство(ИмяЦветаСтиля, ЦветСтиля) Тогда
		ЦветСтиля = ОбщегоНазначенияВызовСервера.ЦветСтиля(ИмяЦветаСтиля);
		ЦветаСтиля.Вставить(ИмяЦветаСтиля, ЦветСтиля);
	КонецЕсли;
	
	Возврат ЦветСтиля;
	
КонецФункции

Функция ПредставлениеОбъекта(Объект) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	Если ЭтоКвазиОписаниеТипов(Объект) Тогда
		
		Если Объект.МассивИменТипов.Количество() > 0 Тогда
			Представление = РК.МассивВСтроку(Объект.МассивИменТипов);
		Иначе
			Представление = "Произвольный";
		КонецЕсли;
		
	ИначеЕсли РК.ЭтоКвазиТаблицаЗначений(Объект) Тогда
		
		Представление = "КвазиТаблицаЗначений";
		
	Иначе
		
		Представление = Строка(Объект);
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ИменаВсехПодсистем() Экспорт
	Результат = Новый Структура("Имена, Отображения");
	Результат.Имена 	  = вмс_РаботаСКоллекциями.СтрокуВМассив("вмс_ЛицензияКонтейнеры, вмс_ЛицензияМагазин, вмс_ЛицензияОХР, вмс_ЛицензияСклад");
	Результат.Отображения = вмс_РаботаСКоллекциями.СтрокуВМассив("Контейнеры, 			  Магазин, 			   ОХР, 			Адресное хранение");
	Возврат Результат;
КонецФункции

Функция ПолучитьСтруктуруСтрокиСоединения() Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	СтрокаСоединенияИнформационнойБазы = СтрокаСоединенияИнформационнойБазы();

	МассивКлючЗначение = РК.СтрокуВМассив(СтрокаСоединенияИнформационнойБазы, ";");
	
	Кавычка = """";
	
	Структура = Новый Структура;
	
	Для Каждого КлючЗначение Из МассивКлючЗначение Цикл
		
		КлючЗначениеМассив = РК.СтрокуВМассив(КлючЗначение, "=");
		Если КлючЗначениеМассив.Количество()=2 Тогда
			
			Ключ = КлючЗначениеМассив[0];
			Если Лев(Ключ, 1)=Кавычка И Прав(Ключ, 1)=Кавычка Тогда
				Ключ = Сред(Ключ, 2, СтрДлина(Ключ)-2);
			КонецЕсли;
			
			Значение = КлючЗначениеМассив[1];
			Если Лев(Значение, 1)=Кавычка И Прав(Значение, 1)=Кавычка Тогда
				Значение = Сред(Значение, 2, СтрДлина(Значение)-2);
			КонецЕсли;
			
			Структура.Вставить(Ключ, Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

Функция НовыйЗапрос(ТекстЗапроса) Экспорт
	
	Запрос = Новый Структура;
	Запрос.Вставить("Текст", ТекстЗапроса);
	Запрос.Вставить("Параметры", Новый Структура);
	
	Возврат Запрос;
	
КонецФункции

Функция ПолучитьТаблицуРезультатаЗапроса(Запрос) Экспорт
	
#Если Клиент И НЕ ТолстыйКлиентОбычноеПриложение И НЕ ТолстыйКлиентУправляемоеПриложение Тогда
		Возврат вмс_ОбщегоНазначенияВызовСервера.ПолучитьТаблицуРезультатаЗапроса(Запрос);
#Иначе
		Возврат вмс_ОбщегоНазначенияСервер.ПолучитьТаблицуРезультатаЗапроса(Запрос);
#КонецЕсли
	
КонецФункции

Функция ДанныеCOMИзДвоичныхДанных(ДвоичныеДанные) Экспорт
	КоличествоБайт = ДвоичныеДанные.Размер();
	БуфферДвоичныхДанных = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные);
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("VT_UI1");
	ПараметрыКонструктора.Добавить(КоличествоБайт);
	ДанныеCOM = Новый("COMSafeArray", ПараметрыКонструктора);
	Для НомерБайта=0 По КоличествоБайт-1 Цикл
		ДанныеCOM.SetValue(НомерБайта, БуфферДвоичныхДанных.Получить(НомерБайта));
	КонецЦикла;
	Возврат ДанныеCOM;
КонецФункции

Функция ПолучитьИмяПользователяОС() Экспорт
	
	Возврат ПолучитьИмяСистемнойПеременной("USERNAME");
	
КонецФункции

Функция ПолучитьИмяСистемнойПеременной(ИмяПеременной) Экспорт
	
	WshShell		= Новый COMОбъект("WScript.Shell"); 
    ИмяПользователя	= WshShell.ExpandEnvironmentStrings("%" + ИмяПеременной + "%");
	
	Возврат ИмяПользователя;
	
КонецФункции

Функция РазобратьПутьФайла(знач Путь) Экспорт
	
	ДлинаПути = СтрДлина(Путь);
	
	ПозицияИмени = СтрНайти(Путь, "\", НаправлениеПоиска.СКонца);

	ПозицияРасширения = СтрНайти(Путь, ".", НаправлениеПоиска.СКонца);
	Если ПозицияРасширения=0 Тогда
		ПозицияРасширения = ДлинаПути + 1;
	КонецЕсли;

	Разбор = Новый Структура;
	Разбор.Вставить("Путь",	Путь);
	Разбор.Вставить("Каталог", Лев(Путь, ПозицияИмени));
	Разбор.Вставить("Имя", Прав(Путь, ДлинаПути-ПозицияИмени));
	Разбор.Вставить("ИмяБезРасширения", Сред(Путь, ПозицияИмени+1, ПозицияРасширения-ПозицияИмени-1));
	Разбор.Вставить("Расширение", Прав(Путь, ДлинаПути-ПозицияРасширения));
	
	Возврат Разбор;
	
КонецФункции

Функция Пауза(Секунды) Экспорт
	
	ИмяПриложения = "TimeOut /T " + Формат(Секунды, "ЧГ=0");
	ЗапуститьПриложениеУлучшенный(ИмяПриложения, 0, Истина);
	
КонецФункции

Функция ЗапуститьПриложениеУлучшенный(знач ИмяПриложения, ТекущийКаталог="", ДождатьсяЗавершения=Ложь, ПолучитьВывод=Ложь, СостояниеОкна=1) Экспорт
	
	Кавычка = """";
	
	ИмяПриложения = СокрЛП(ИмяПриложения);
	Если ПолучитьВывод Тогда
		Если СтрНайти(ИмяПриложения, Кавычка)=0 Тогда
			ИмяПриложения = Кавычка + ИмяПриложения + Кавычка;
		КонецЕсли;
	КонецЕсли;
	
	Скрипт = ИмяПриложения;
	
	Если ПолучитьВывод Тогда
		ПутьКФайлуЛогов = ПолучитьИмяВременногоФайлаУлучшенная("txt");
		Скрипт = Скрипт + " > " + Кавычка + ПутьКФайлуЛогов + Кавычка;
	КонецЕсли;
	
	Скрипт = Кавычка + Скрипт + Кавычка;
	
	Команда = Скрипт;
	//Команда = """%COMSPEC%"" /c " + Команда;
	Команда = "cmd /c " + Команда;

	НативныйМетод = Истина;
	Если НативныйМетод Тогда
		
        КодВозврата = Неопределено;
		ЗапуститьПриложение(Команда, ТекущийКаталог, ДождатьсяЗавершения, КодВозврата);
		
	Иначе
		
		Сервер = Новый ComОбъект("WScript.Shell");
		
		Если ЗначениеЗаполнено(ТекущийКаталог) Тогда
			Сервер.CurrentDirectory = ТекущийКаталог;
		КонецЕсли;

		КодВозврата = Сервер.Run(Команда, СостояниеОкна, ДождатьсяЗавершения);
		
	КонецЕсли;

	Если ПолучитьВывод Тогда
		ФайлЛогов = Новый Файл(ПутьКФайлуЛогов);
		Если ФайлЛогов.Существует() Тогда
			ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлуЛогов);
			Вывод = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные, КодировкаТекста.OEM);
			УдалитьФайлы(ПутьКФайлуЛогов);
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КодВозврата", КодВозврата);
	Результат.Вставить("Вывод", Вывод);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИмяВременногоФайлаУлучшенная(Расширение) Экспорт
	
	#Если ВебКлиент Тогда
		Каталог = КаталогВременныхФайлов();
		ИмяФайла = Каталог + Новый УникальныйИдентификатор() + "." + Расширение;
	#Иначе
		ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	#КонецЕсли
	
	Возврат ИмяФайла;
	
КонецФункции
