
Функция ПолучитьКлиентскиеПеременныеОбъекта(Объект) Экспорт
	
	Возврат вмс_РаботаСКоллекциями.ПолучитьПолеСоответствия(вмс_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПриложения()["КлиентскиеПеременные"], Объект, Новый Соответствие);
	
КонецФункции

Процедура ПроверкаЗаполненияНастроекСистемы() Экспорт
	
	МассивОшибок = Новый Массив;
	
	// Проверка настройки публикации
	НастройкаПодключения = вмс_Сервер.ПолучитьНастройкуПодключения();
	
	Если ЗначениеЗаполнено(НастройкаПодключения) Тогда 
		ЗначениеРеквизита = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(НастройкаПодключения,"Значение");	
		Если ЗначениеРеквизита = "" Тогда
			МассивОшибок.Добавить("Не заполнена настройка ""Адрес публикации""");
		КонецЕсли;
	Иначе
		// Хотфикс: 3.2.3.1 - закомметировано. Настройки в модуле;
		//вмс_Сервер.СоздатьНастройкуПодключения();
		МассивОшибок.Добавить("Не заполнена настройка ""Адрес публикации""");	
	КонецЕсли; 
	// Проверка настройки публикации  
	
	// Проверка наличия пользователей 
	КоличествоПользователей = вмс_Сервер.ПолучитьКоличествоПользователейСистемы(); 
	Если КоличествоПользователей = 0 Тогда 
		МассивОшибок.Добавить("Не введено ни одного пользователя в системе");	
	КонецЕсли;
	// Проверка наличия пользователей 
	
	Если МассивОшибок.Количество() > 0 Тогда
		
		ИтоговаяСтрока = "";
		Для каждого СтрокаОшибки Из МассивОшибок Цикл		
			ИтоговаяСтрока = ИтоговаяСтрока + СтрокаОшибки + Символы.ПС;
		КонецЦикла;
		
		ПоказатьОповещениеПользователя("Настройки AS:WMS",,ИтоговаяСтрока,,СтатусОповещенияПользователя.Важное);
	КонецЕсли;

	ПодключитьОбработчикОжидания("ПроверкаЗаполненияНастроекСистемы", 3600, Истина);

КонецПроцедуры

Процедура МониторПечати() Экспорт 
	
	ИмяКомпьютера = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПриложения()["ИмяКомпьютера"];
	МассивДокументов = вмс_Печать.ОбработчикОжиданияСервераПечати(ИмяКомпьютера); 
	Для каждого ТабДокумент Из МассивДокументов Цикл 		
		ТабДокумент.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	КонецЦикла;
	
	Если вмс_Печать.ЕстьПравоПечатиДокументовСклада() Тогда
		ПодключитьОбработчикОжидания("МониторПечати",3,Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура МониторОповещенийТСД() Экспорт
	
	вмс_РаботаСОповещениямиКлиент.ПоказатьОповещениеКлиента();
	Если вмс_РаботаСОповещениями.ЕстьПравоПолучатьОповещения() Тогда 
		ПодключитьОбработчикОжидания("МониторОповещенийТСД",3,Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция вмс_ОбщийОбработчикОжидания() Экспорт
	
	вмс_МодульПриложения.ОбщийОбработчикОжидания();
	
КонецФункции