
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Если ЭтоСписокЗначений Тогда
		ЭтаФорма.ОповеститьОВыборе(СписокЗначений);
	Иначе
		ЭтаФорма.ОповеститьОВыборе(СписокЗначений.ВыгрузитьЗначения());
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	РазрешитьРедактирование = Параметры.РазрешитьРедактирование;
	
	Если ТипЗнч(Параметры.Список) = Тип("СписокЗначений") Тогда
		ЭтоСписокЗначений = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ТипЗначений")
		И ЗначениеЗаполнено(Параметры.ТипЗначений) Тогда
		СписокЗначений.ТипЗначения = Новый ОписаниеТипов(МодульОбъекта().ЗначениеВМассиве(Параметры.ТипЗначений));
	КонецЕсли;
	
	Если ЭтоСписокЗначений Тогда
		СписокЗначений = Параметры.Список;
	Иначе
		СписокЗначений.ЗагрузитьЗначения(Параметры.Список);
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("ИспользоватьПометки") Тогда
		ИспользоватьПометки = Параметры.ИспользоватьПометки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Если РазрешитьРедактирование Тогда
		Элементы.ФормаЗавершитьРедактирование.Видимость = Истина;
	Иначе
		Элементы.ФормаЗавершитьРедактирование.Видимость = Ложь;
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	МодульОбъекта().УстановитьСвойствоОбъекта(Элементы.СписокЗначенийЗначение, "КнопкаСоздания", Ложь);
	МодульОбъекта().УстановитьСвойствоОбъекта(Элементы.СписокЗначенийЗначение, "КнопкаОткрытия", Ложь);
	
	Если ЗначениеЗаполнено(Параметры.ДоступныеЗначения) Тогда
		Элементы.СписокЗначенийЗначение.СписокВыбора.ЗагрузитьЗначения(Параметры.ДоступныеЗначения);
		Элементы.СписокЗначенийЗначение.РежимВыбораИзСписка = Истина;
		Элементы.СписокЗначенийЗначение.КнопкаСпискаВыбора = Истина;
	Иначе
		Элементы.СписокЗначенийЗначение.КнопкаВыбора = Истина;
		Элементы.СписокЗначенийЗначение.КнопкаСпискаВыбора = Ложь;
		МодульОбъекта().УстановитьСвойствоОбъекта(Элементы.СписокЗначенийЗначение, "КнопкаВыпадающегоСписка", Ложь);
	КонецЕсли;
	
	Элементы.СписокЗначенийПометка.Видимость = ИспользоватьПометки;
	Элементы.СписокЗначений.ИзменятьСоставСтрок = Не ИспользоватьПометки;
	
КонецПроцедуры

// #КонецОбласти
