#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьЯчейкуОтветственногоХранения() Экспорт
	
	Если ЗначениеЗаполнено(ЯчейкаОтветственногоХранения) Тогда
		Возврат ЯчейкаОтветственногоХранения;
	КонецЕсли;
	
	ЧастиИмени = вмс_РаботаСКоллекциями.СтрокуВМассив(Оператор.Наименование, " ");
	Для НомерЧасти=1 По ЧастиИмени.Количество() Цикл
		ЧастьИмени = СтрЗаменить(ЧастиИмени[НомерЧасти-1], " ", "");
		ЧастиИмени[НомерЧасти-1] = ВРег(Лев(ЧастьИмени, 1));
	КонецЦикла;
	
	ЯчейкаОтветственногоХраненияОбъект = Справочники.вмс_МестаХранения.СоздатьЭлемент();
	ЯчейкаОтветственногоХраненияОбъект.Заполнить(Неопределено);
	ЯчейкаОтветственногоХраненияОбъект.Родитель = вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьГруппуЯчеекОтветственногоХранения();
	ЯчейкаОтветственногоХраненияОбъект.Наименование = вмс_РаботаСКоллекциями.МассивВСтроку(ЧастиИмени, ".");
	ЯчейкаОтветственногоХраненияОбъект.ТипЯчейки=Перечисления.вмс_ТипыЯчеек.Оператор;
	ЯчейкаОтветственногоХраненияОбъект.Записать();
	
	ЯчейкаОтветственногоХранения = ЯчейкаОтветственногоХраненияОбъект.Ссылка;
	Возврат ЯчейкаОтветственногоХранения;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	ПолучитьЯчейкуОтветственногоХранения();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЯчейкаОтветственногоХранения = Неопределено;
КонецПроцедуры

// ТУ_Самойленко 10.08.23 ++
Процедура СменитьПринтерПоУмолчанию(ПринтерПоУмолчанию=Неопределено, ФорматПечати=Неопределено) Экспорт	
	
	ФорматПечати = ?(ПринтерПоУмолчанию=Неопределено,ФорматПечати,ПринтерПоУмолчанию.ФорматПечати);
	
	Строки = Принтеры.НайтиСтроки(Новый Структура("ПоУмолчанию", Истина));
	
	Если ФорматПечати <> Неопределено Тогда
		Для Каждого Строка Из Строки Цикл
			Если Строка.Принтер.ФорматПечати = ФорматПечати Тогда
				Строка.ПоУмолчанию = Ложь;
			КонецЕсли;
		КонецЦикла;	
	Иначе
		Для Каждого Строка Из Строки Цикл
			Строка.ПоУмолчанию = Ложь;
		КонецЦикла;	
	КонецЕсли;
	
	Если ПринтерПоУмолчанию <> Неопределено Тогда	
		
		НовыйПоУмолчанию = Принтеры.НайтиСтроки(Новый Структура("Принтер", ПринтерПоУмолчанию));
		
		Если ЗначениеЗаполнено(НовыйПоУмолчанию) Тогда
			НовыйПоУмолчанию[0].ПоУмолчанию = Истина;	
		КонецЕсли;
		
	КонецЕсли;
	
	Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	МасштабФормы = 100;
	
КонецПроцедуры

#Иначе

#КонецЕсли