Функция ПолучитьТаблицуТоваровПоДокументам(ВходящиеПараметры) Экспорт 
	
	ДанныеСпискаТоваров = Справочники.вмс_РаспоряженияОпераций.ПолучитьСписокТоваровПоРаспоряжениям(ВходящиеПараметры);
	
	Если ДанныеСпискаТоваров.Таблица <> Неопределено Тогда
		ТаблицаТоваров = ДанныеСпискаТоваров.Таблица;

		ИмяКолонки = вмс_АдаптацияКонфигураций.ИмяКолонкиХарактеристика();
		Если ИмяКолонки <> Неопределено И ИмяКолонки <> "Характеристика" Тогда
			КолонкаХарактеристика = ТаблицаТоваров.Колонки.Найти(ИмяКолонки);
			Если КолонкаХарактеристика <> Неопределено Тогда
				КолонкаХарактеристика.Имя = "Характеристика";
			КонецЕсли;
		КонецЕсли; 
	Иначе
		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("Товар");
		ТаблицаТоваров.Колонки.Добавить("Характеристика");	
		ТаблицаТоваров.Колонки.Добавить("Количество");
	КонецЕсли; 
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция ПолучитьТаблицуПринятыхТоваров(ДокументОснование, ВидОперации, ВключаяДокументыОпераций=Неопределено, ИсключаяДокументыОпераций=Неопределено) Экспорт
	
	//24.05.2022 ТПТ2405
	// Старая функция. В мобильном приложении переделано на обработку через ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамТовары.Ссылка.ДокументОснование КАК ДокументОснование,
	|	вмс_ОперацияПоЯчейкамТовары.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамТовары.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамТовары.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамТовары.ЯчейкаПриемник КАК ЯчейкаПриемник,
	|	вмс_ОперацияПоЯчейкамТовары.Контейнер КАК Контейнер,
	|	вмс_ОперацияПоЯчейкамТовары.КонтейнерПриемник КАК КонтейнерПриемник,
	|	вмс_ОперацияПоЯчейкамТовары.КонтейнерОтправитель КАК КонтейнерОтправитель,
	|	СУММА(вмс_ОперацияПоЯчейкамТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам.Товары КАК вмс_ОперацияПоЯчейкамТовары
	|ГДЕ
	|	вмс_ОперацияПоЯчейкамТовары.Ссылка.Проведен
	|	И вмс_ОперацияПоЯчейкамТовары.Ссылка.ДокументОснование = &ДокументОснование
	|	И вмс_ОперацияПоЯчейкамТовары.Ссылка.ВидОперации = &ВидОперации
	|	И &ДопОтборы
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_ОперацияПоЯчейкамТовары.Товар,
	|	вмс_ОперацияПоЯчейкамТовары.Ячейка,
	|	вмс_ОперацияПоЯчейкамТовары.ЯчейкаПриемник,
	|	вмс_ОперацияПоЯчейкамТовары.Характеристика,
	|	вмс_ОперацияПоЯчейкамТовары.Контейнер,
	|	вмс_ОперацияПоЯчейкамТовары.КонтейнерПриемник,
	|	вмс_ОперацияПоЯчейкамТовары.КонтейнерОтправитель,
	|	вмс_ОперацияПоЯчейкамТовары.Ссылка.ДокументОснование";
	
	ДопОтборыСтрока = "";
	Если ВключаяДокументыОпераций <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВключаяДокументыОпераций", ВключаяДокументыОпераций);
		ДопОтборыСтрока = ДопОтборыСтрока + " И вмс_ОперацияПоЯчейкамТовары.Ссылка В (&ВключаяДокументыОпераций)";
	КонецЕсли; 
	
	Если ИсключаяДокументыОпераций <> Неопределено Тогда
		Запрос.УстановитьПараметр("ИсключаяДокументыОпераций", ИсключаяДокументыОпераций);
		ДопОтборыСтрока = ДопОтборыСтрока + " И НЕ вмс_ОперацияПоЯчейкамТовары.Ссылка В (&ИсключаяДокументыОпераций)";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ДопОтборы", ДопОтборыСтрока);
	
	РезультатЗапроса = Запрос.Выполнить();
	Таблица = РезультатЗапроса.Выгрузить();
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьТаблицуОтобранныхТоваровЧерезСтруктуру(ВходящиеПараметры) Экспорт
	
	ПустаяЯчейка = Справочники.вмс_МестаХранения.ПустаяСсылка();
	ПустойТовар = Справочники.Номенклатура.ПустаяСсылка();

	ПолученныеДанные = ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру(ВходящиеПараметры);
	
	НовыйФорматРезультата = ВходящиеПараметры.Свойство("НовыйФорматРезультата") И ВходящиеПараметры.НовыйФорматРезультата;
	
	Если НовыйФорматРезультата Тогда
		ТаблицаПринятыхТоваров = ПолученныеДанные.Товары;
	Иначе
		ТаблицаПринятыхТоваров = ПолученныеДанные;
	КонецЕсли;
	
	ТаблицаОтобранныхТоваров = ТаблицаПринятыхТоваров.СкопироватьКолонки();
	Для Каждого СтрокаПринятогоТовара Из ТаблицаПринятыхТоваров Цикл
		Если СтрокаПринятогоТовара.Ячейка <> ПустаяЯчейка И СтрокаПринятогоТовара.Товар <> ПустойТовар Тогда
			СтрокаОтобранногоТовара = ТаблицаОтобранныхТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОтобранногоТовара, СтрокаПринятогоТовара);
			
			Если СтрокаОтобранногоТовара.Ячейка.ТипЯчейки = Перечисления.вмс_ТипыЯчеек.ЗонаОтгрузки Тогда
				СтрокаОтобранногоТовара.Количество = -СтрокаОтобранногоТовара.Количество;
				СтрокаОтобранногоТовара.КоличествоБазовыхЕдиниц = -СтрокаОтобранногоТовара.КоличествоБазовыхЕдиниц;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НовыйФорматРезультата Тогда
		ПолученныеДанные.Товары = ТаблицаОтобранныхТоваров;
	Иначе
		ПолученныеДанные = ТаблицаОтобранныхТоваров;
	КонецЕсли;
	
	Возврат ПолученныеДанные;
	
КонецФункции

Функция УстановитьЗонуОтгрузкиОперацииОтбора(ВходящиеПараметры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкам.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам КАК вмс_ОперацияПоЯчейкам
	|ГДЕ
	|	вмс_ОперацияПоЯчейкам.Проведен
	|	И вмс_ОперацияПоЯчейкам.ДокументОснование В(&ДокументОснование)
	|	И вмс_ОперацияПоЯчейкам.ВидОперации = &ВидОперации";
	
	Запрос.УстановитьПараметр("ДокументОснование", ВходящиеПараметры.ДокументОснование);
	Запрос.УстановитьПараметр("ВидОперации", ВходящиеПараметры.ВидОперации);
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗонаОтгрузки = ВходящиеПараметры.ЗонаОтгрузки;
	
	Выборка = РезультатЗапроса.Выбрать();
	Изменены = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Изменен = Ложь;
		ОперацияПоЯчейкам = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаТовара Из ОперацияПоЯчейкам.Товары Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.ЯчейкаПриемник) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаТовара.ЯчейкаПриемник=ЗонаОтгрузки Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТовара.ЯчейкаПриемник = ЗонаОтгрузки;
			Изменен = Истина;
			Изменены = Истина;
			
		КонецЦикла;
		
		Если Изменен Тогда
			ОперацияПоЯчейкам.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Изменены;
	
КонецФункции

Функция ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру(ВходящиеПараметры) Экспорт
	
	//24.05.2022 ТПТ2405
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументыОснования", ВходящиеПараметры.ДокументОснование);
	Запрос.УстановитьПараметр("ВидыОпераций", ВходящиеПараметры.ВидОперации);
	ТекстЗапросаПоТоварам =
	"ВЫБРАТЬ
	|	ДокументыОпераций.Ссылка КАК СсылкаОперации,
	|	ДокументыОпераций.ДокументОснование КАК ДокументОснование,
	|	ДокументыОпераций.Помещение КАК Помещение,
	|	ТоварыОпераций.Товар КАК Товар,
	|	ТоварыОпераций.Характеристика КАК Характеристика,
	|	ТоварыОпераций.Ячейка КАК Ячейка,
	|	ТоварыОпераций.ЯчейкаПриемник КАК ЯчейкаПриемник,
	|	ТоварыОпераций.Контейнер КАК Контейнер,
	|	ТоварыОпераций.КонтейнерПриемник КАК КонтейнерПриемник,
	|	ТоварыОпераций.Партия КАК Партия,
	|	ТоварыОпераций.Серия КАК Серия,
	|	ТоварыОпераций.Качество КАК Качество,
	|	ТоварыОпераций.Упаковка КАК Упаковка,
	|	ТоварыОпераций.Документ КАК Документ,
	|	СУММА(ТоварыОпераций.Количество) КАК Количество,
	|	СУММА(ТоварыОпераций.КоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц
	|ПОМЕСТИТЬ ТаблицаБезАртикула
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам КАК ДокументыОпераций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вмс_ОперацияПоЯчейкам.Товары КАК ТоварыОпераций
	|		ПО ДокументыОпераций.Ссылка = ТоварыОпераций.Ссылка
	|ГДЕ
	|	ДокументыОпераций.Проведен
	|	И (ДокументыОпераций.ДокументОснование В (&ДокументыОснования)
	|			ИЛИ ДокументыОпераций.ЗаданиеКладовщику В (&ДокументыОснования))
	|	И ДокументыОпераций.ВидОперации В(&ВидыОпераций)
	|	И НЕ ДокументыОпераций.ВидСубОперации В (&ИсключитьВидыСубОпераций)
	|	И &ДопОтборы
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыОпераций.Ссылка,
	|	ДокументыОпераций.ДокументОснование,
	|	ДокументыОпераций.Помещение,
	|	ТоварыОпераций.Товар,
	|	ТоварыОпераций.Ячейка,
	|	ТоварыОпераций.ЯчейкаПриемник,
	|	ТоварыОпераций.Характеристика,
	|	ТоварыОпераций.Контейнер,
	|	ТоварыОпераций.КонтейнерПриемник,
	|	ТоварыОпераций.Партия,
	|	ТоварыОпераций.Серия,
	|	ТоварыОпераций.Качество,
	|	ТоварыОпераций.Упаковка,
	|	ТоварыОпераций.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаБезАртикула.СсылкаОперации КАК СсылкаОперации,
	|	ТаблицаБезАртикула.ДокументОснование КАК ДокументОснование,
	|	ТаблицаБезАртикула.Помещение КАК Помещение,
	|	ТаблицаБезАртикула.Товар КАК Товар,
	|	ТаблицаБезАртикула.Характеристика КАК Характеристика,
	|	ТаблицаБезАртикула.Ячейка КАК Ячейка,
	|	ТаблицаБезАртикула.ЯчейкаПриемник КАК ЯчейкаПриемник,
	|	ТаблицаБезАртикула.Контейнер КАК Контейнер,
	|	ТаблицаБезАртикула.КонтейнерПриемник КАК КонтейнерПриемник,
	|	ТаблицаБезАртикула.Партия КАК Партия,
	|	ТаблицаБезАртикула.Серия КАК Серия,
	|	ТаблицаБезАртикула.Качество КАК Качество,
	|	ТаблицаБезАртикула.Упаковка КАК Упаковка,
	|	ТаблицаБезАртикула.Документ КАК Документ,
	|	ТаблицаБезАртикула.Количество КАК Количество,
	|	ТаблицаБезАртикула.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
	|	Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	ТаблицаБезАртикула КАК ТаблицаБезАртикула
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ТаблицаБезАртикула.Товар = Номенклатура.Ссылка";
	
	ДопОтборыСтрока = "";
	
	ИсключитьВидыСубОпераций = Новый Массив;
	ИсключитьВидыСубОпераций.Добавить(вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьСсылкуНаВидОперацииПоЯчейкам("ИзменитьПаллету"));
	вмс_РаботаСКоллекциями.УдалитьПустыеСтрокиКоллекции(ИсключитьВидыСубОпераций);
	Запрос.УстановитьПараметр("ИсключитьВидыСубОпераций", ИсключитьВидыСубОпераций);
	
	Если ВходящиеПараметры.Свойство("ВключаяДокументыОпераций") И ВходящиеПараметры.ВключаяДокументыОпераций <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВключаяДокументыОпераций", ВходящиеПараметры.ВключаяДокументыОпераций);
		ДопОтборыСтрока = ДопОтборыСтрока + " И ДокументыОпераций.Ссылка В (&ВключаяДокументыОпераций)";
	КонецЕсли; 
	
	Если ВходящиеПараметры.Свойство("ИсключаяДокументыОпераций") И ВходящиеПараметры.ИсключаяДокументыОпераций <> Неопределено Тогда
		Запрос.УстановитьПараметр("ИсключаяДокументыОпераций", ВходящиеПараметры.ИсключаяДокументыОпераций);
		ДопОтборыСтрока = ДопОтборыСтрока + " И НЕ ДокументыОпераций.Ссылка В (&ИсключаяДокументыОпераций)";
	КонецЕсли;
	
	Если ВходящиеПараметры.Свойство("ИсключаяОператоров") И ВходящиеПараметры.ИсключаяОператоров <> Неопределено Тогда
		Запрос.УстановитьПараметр("ИсключаяОператоров", ВходящиеПараметры.ИсключаяОператоров);
		ДопОтборыСтрока = ДопОтборыСтрока + " И НЕ ДокументыОпераций.Ответственный В (&ИсключаяОператоров)";
	КонецЕсли;
	
	Если Не (ВходящиеПараметры.Свойство("ДетализироватьПоОперациям") И ВходящиеПараметры.ДетализироватьПоОперациям = Истина) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументыОпераций.Ссылка КАК СсылкаОперации,", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументыОпераций.Ссылка,", "");
	КонецЕсли;
	
	ТекстЗапросаПоТоварам = СтрЗаменить(ТекстЗапросаПоТоварам, "И &ДопОтборы", ДопОтборыСтрока);
	
	Запрос.Текст = ТекстЗапросаПоТоварам;
	
	НовыйФорматРезультата = ВходящиеПараметры.Свойство("НовыйФорматРезультата") И ВходящиеПараметры.НовыйФорматРезультата = Истина;
	
	ПолучитьКодыМаркировки = ВходящиеПараметры.Свойство("ПолучитьКодыМаркировки") И ВходящиеПараметры.ПолучитьКодыМаркировки = Истина;
	Если ПолучитьКодыМаркировки Тогда 
		ЗапросКодыМаркировки = Новый Запрос;
		НовыйФорматРезультата = Истина;
		ТекстЗапросаПоКодамМаркировки =
		"ВЫБРАТЬ
		|	ДокументыОпераций.Ссылка КАК СсылкаОперации,
		|	ДокументыОпераций.ДокументОснование КАК ДокументОснование,
		|	ДокументыОпераций.Помещение КАК Помещение,
		|	КодыМаркировкиОпераций.НомерСтроки КАК НомерСтроки,
		|	КодыМаркировкиОпераций.Товар КАК Товар,
		|	КодыМаркировкиОпераций.Маркировка КАК Маркировка,
		|	КодыМаркировкиОпераций.Характеристика КАК Характеристика,
		// ТУ_Васильев 25.04.25 ++
		//|	КодыМаркировкиОпераций.КонтейнерОтправитель КАК КонтейнерОтправитель,
		// ТУ_Васильев 25.04.25 --
		|	КодыМаркировкиОпераций.Серия КАК Серия,
		|	КодыМаркировкиОпераций.Качество КАК Качество
		|ПОМЕСТИТЬ ТаблицаБезАртикула
		|ИЗ
		|	Документ.вмс_ОперацияПоЯчейкам КАК ДокументыОпераций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вмс_ОперацияПоЯчейкам.КодыМаркировки КАК КодыМаркировкиОпераций
		|		ПО ДокументыОпераций.Ссылка = КодыМаркировкиОпераций.Ссылка
		|ГДЕ
		|	ДокументыОпераций.Проведен
		|	И ДокументыОпераций.ДокументОснование В(&ДокументыОснования)
		|	И ДокументыОпераций.ВидОперации В(&ВидыОпераций)
		|	И &ДопОтборы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаБезАртикула.СсылкаОперации КАК СсылкаОперации,
		|	ТаблицаБезАртикула.ДокументОснование КАК ДокументОснование,
		|	ТаблицаБезАртикула.Помещение КАК Помещение,
		|	ТаблицаБезАртикула.НомерСтроки КАК НомерСтроки,
		|	ТаблицаБезАртикула.Товар КАК Товар,
		|	ТаблицаБезАртикула.Маркировка КАК Маркировка,
		|	ТаблицаБезАртикула.Характеристика КАК Характеристика,
		// ТУ_Васильев 25.04.25 ++
		//|	ТаблицаБезАртикула.КонтейнерОтправитель КАК КонтейнерОтправитель,	
		// ТУ_Васильев 25.04.25 --
		|	ТаблицаБезАртикула.Серия КАК Серия,
		|	ТаблицаБезАртикула.Качество КАК Качество,
		|	Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	ТаблицаБезАртикула КАК ТаблицаБезАртикула
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ТаблицаБезАртикула.Товар = Номенклатура.Ссылка";
		
		ДопОтборыПоКодамМаркировкиСтрока = ДопОтборыСтрока;
		ТекстЗапросаПоКодамМаркировки = СтрЗаменить(ТекстЗапросаПоКодамМаркировки, "И &ДопОтборы", ДопОтборыПоКодамМаркировкиСтрока);
		
		// ТУ_Васильев 25.04.25 ++
		ЗапросКодыМаркировки.УстановитьПараметр("ДокументыОснования", ВходящиеПараметры.ДокументОснование);
		ЗапросКодыМаркировки.УстановитьПараметр("ВидыОпераций", ВходящиеПараметры.ВидОперации);
		// ТУ_Васильев 25.04.25 --
		
		ЗапросКодыМаркировки.Текст = ТекстЗапросаПоКодамМаркировки;
	КонецЕсли;
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	
	// Кулалаев Е.С + 14.03.2023 17:08:04
	// -----Описание-----
	// Если ориентируемся по предыдущему документу (отбор - контроль, приемка - размещение)
	// то берем только строки, которые упали на ячейку
	// ------------------ 	
	Если ВходящиеПараметры.Свойство("ОбработкаПеремещения") И ВходящиеПараметры.ОбработкаПеремещения Тогда
		вмс_РаботаСКоллекциями.УдалитьПустыеСтрокиКоллекции(ТаблицаТоваров, "ЯчейкаПриемник");
	КонецЕсли;	
	// Кулалаев Е.С -
	
	// ТУ_Самойленко 03.08.23 ++
	ГруппировкаПолей = Неопределено;
	Если ВходящиеПараметры.Свойство("ГруппировкаПолей", ГруппировкаПолей) Тогда 
		Если ГруппировкаПолей = Истина Тогда
			НИТП = вмс_РаботаСКоллекциями.МассивВСтроку(вмс_ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля());
			НИТП = НИТП + ?(вмс_ОбщегоНазначенияСервер.ИспользуютсяКонтейнеры(), ", Контейнер", ""); //Добавление поля для определения в какой контейнер ушел товар при приемке
			НИТП = НИТП + ?(вмс_ОбщегоНазначенияСервер.ИспользуютсяКонтейнеры(), ", КонтейнерПриемник", ""); //Добавление поля для определения в какой контейнер ушел товар при приемке
			НИТП = НИТП + ", Артикул";
			ТаблицаТоваров.Свернуть(НИТП, "Количество"); //Пока убрал КоличествоБазовыхЕдиниц	
		ИначеЕсли ТипЗнч(ГруппировкаПолей) = Тип("Структура") Тогда
			ПоляГруппировки = Неопределено; ПоляСуммирования = Неопределено;	
			ГруппировкаПолей.Свойство("ПоляГруппировки", ПоляГруппировки);	
			ГруппировкаПолей.Свойство("ПоляСуммирования", ПоляСуммирования);
			ТаблицаТоваров.Свернуть(ПоляГруппировки, ПоляСуммирования);
		КонецЕсли;
	КонецЕсли;
	// ТУ_Самойленко 03.08.23 --
	
	Если НовыйФорматРезультата Тогда
		Результат = Новый Структура;
		Результат.Вставить("Товары", ТаблицаТоваров);
		Если ПолучитьКодыМаркировки Тогда
			ТаблицаКодовМаркировки = ЗапросКодыМаркировки.Выполнить().Выгрузить();
			Результат.Вставить("КодыМаркировки", ТаблицаКодовМаркировки);
		КонецЕсли;
	Иначе
		Результат = ТаблицаТоваров;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОтобранныеИПроверенныеТоварыПоЗаданиям(Задания) Экспорт
	
	// Кулалаев 08.07.2025: Исправлен алгоритм для отгрузки по отбору
	// Сначала находим все документы "Отбор", потом с видом "Контроль"
	// Если есть контроль - берем его. Иначе берем отбор.
	
		ТекстЗапроса = "ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкам.Ссылка КАК ДокументТСД,
	|	вмс_ОперацияПоЯчейкам.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам КАК вмс_ОперацияПоЯчейкам
	|ГДЕ
	|	вмс_ОперацияПоЯчейкам.ВидОперации.ИмяДляПоиска В(&ИменаДляПоиска)
	|	И вмс_ОперацияПоЯчейкам.ДокументОснование В(&Задания)
	|	И вмс_ОперацияПоЯчейкам.Проведен = ИСТИНА"; 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Задания", Задания);
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ИменаДляПоиска", """Отбор"", ""Отбор2""");
	
	ДокументыОтбор = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументТСД");
	ОбщегоНазначения.СообщитьПользователю(ДокументыОтбор.Количество());
	
	Запрос.УстановитьПараметр("Задания", Задания);
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ИменаДляПоиска", """Контроль""");
	
	ДокументыКонтроль = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументТСД"); 
	ОбщегоНазначения.СообщитьПользователю(ДокументыКонтроль.Количество());	
	ОперацииПоЯчейкам = Новый Массив;
	
	Если ДокументыКонтроль.Количество() > 0 Тогда
		ОперацииПоЯчейкам = ДокументыКонтроль;
	ИначеЕсли ДокументыОтбор.Количество() > 0 Тогда
		ОперацииПоЯчейкам = ДокументыОтбор;
	КонецЕсли;

	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОбороты.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОбороты.Контейнер.Родитель КАК КонтейнерРодитель,
	|	ВЫБОР
	|		КОГДА вмс_ОперацияПоЯчейкамОбороты.Контейнер.Родитель ЕСТЬ NULL
	|				ИЛИ вмс_ОперацияПоЯчейкамОбороты.Контейнер.Родитель = ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка)
	|			ТОГДА вмс_ОперацияПоЯчейкамОбороты.Контейнер
	|		ИНАЧЕ вмс_ОперацияПоЯчейкамОбороты.Контейнер.Родитель
	|	КОНЕЦ КАК Контейнер,
	|	вмс_ОперацияПоЯчейкамОбороты.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОбороты.Ячейка КАК Ячейка,
	|	СУММА(вмс_ОперацияПоЯчейкамОбороты.КоличествоПриход) КАК Количество,
	|	вмс_ОперацияПоЯчейкамОбороты.Партия КАК Партия,
	|	вмс_ОперацияПоЯчейкамОбороты.Серия КАК Серия,
	|	вмс_ОперацияПоЯчейкамОбороты.Качество КАК Качество
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Обороты(, , Регистратор, ) КАК вмс_ОперацияПоЯчейкамОбороты
	|ГДЕ
	|	вмс_ОперацияПоЯчейкамОбороты.Регистратор В(&ОперацииПоЯчейкам)
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_ОперацияПоЯчейкамОбороты.Характеристика,
	|	вмс_ОперацияПоЯчейкамОбороты.Ячейка,
	|	вмс_ОперацияПоЯчейкамОбороты.Товар,
	|	вмс_ОперацияПоЯчейкамОбороты.Качество,
	|	вмс_ОперацияПоЯчейкамОбороты.Серия,
	|	вмс_ОперацияПоЯчейкамОбороты.Партия,
	|	ВЫБОР
	|		КОГДА вмс_ОперацияПоЯчейкамОбороты.Контейнер.Родитель ЕСТЬ NULL
	|				ИЛИ вмс_ОперацияПоЯчейкамОбороты.Контейнер.Родитель = ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка)
	|			ТОГДА вмс_ОперацияПоЯчейкамОбороты.Контейнер
	|		ИНАЧЕ вмс_ОперацияПоЯчейкамОбороты.Контейнер.Родитель
	|	КОНЕЦ,
	|	вмс_ОперацияПоЯчейкамОбороты.Контейнер.Родитель";
	
	Запрос.УстановитьПараметр("ОперацииПоЯчейкам", ОперацииПоЯчейкам);
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция ПолучитьТаблицуТоваровПоИнвентаризации(знач ДокументОперацияПоЯчейкам=Неопределено, Оператор=Неопределено) Экспорт
	
	Если ДокументОперацияПоЯчейкам = Неопределено Тогда
		ДокументОперацияПоЯчейкам = ПолучитьАктивнуюОперациюИнвентаризацииПоЯчейкам(Оператор);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументОперацияПоЯчейкам);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Ссылка КАК Ссылка,
	|	вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.НомерСтроки КАК НомерСтроки,
	|	вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Количество КАК Количество,
	|	вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.КоличествоУчет КАК КоличествоУчет,
	|	вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Ячейка КАК Ячейка
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам.ТоварыПоИнвентаризации КАК вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации
	|ГДЕ
	|	вмс_ОперацияПоЯчейкамТоварыПоИнвентаризации.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаТоваровПоИнвентаризации = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаТоваровПоИнвентаризации;
	
КонецФункции

Функция ПолучитьАктивнуюОперациюИнвентаризацииПоЯчейкам(Оператор) Экспорт
	
	ВидОперации = вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьСсылкуНаВидОперацииПоЯчейкам("Инвентаризация");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	Запрос.УстановитьПараметр("Оператор", Оператор);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкам.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам КАК вмс_ОперацияПоЯчейкам
	|ГДЕ
	|	вмс_ОперацияПоЯчейкам.Проведен
	|	И вмс_ОперацияПоЯчейкам.ВидОперации = &ВидОперации
	|	И вмс_ОперацияПоЯчейкам.Ответственный = &Оператор
	|	И НЕ вмс_ОперацияПоЯчейкам.Готов";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуМестХраненияТовараДляРазмещения(Товары, Склады=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестаХраненияНоменклатуры.МестоХранения.Владелец КАК Склад,
	|	МестаХраненияНоменклатуры.Товар КАК Товар,
	|	МестаХраненияНоменклатуры.Характеристика КАК Характеристика,
	|	МестаХраненияНоменклатуры.Приоритет КАК Приоритет,
	|	МестаХраненияНоменклатуры.МестоХранения КАК МестоХранения
	|ИЗ
	|	РегистрСведений.вмс_МестаХраненияНоменклатуры КАК МестаХраненияНоменклатуры
	|ГДЕ
	|	МестаХраненияНоменклатуры.Товар В(&Товары)
	|	И МестаХраненияНоменклатуры.МестоХранения.Владелец В(&Склады)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склад,
	|	Товар,
	|	Приоритет,
	|	МестоХранения";
	
	Если Склады = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И МестаХраненияНоменклатуры.МестоХранения.Владелец В(&Склады)", "");
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаМестХранения = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаМестХранения;
	
КонецФункции

Функция ПолучитьТаблицуПомещенийДляЗамены()
	
	РК = вмс_РаботаСКоллекциями;
	
	ОТПомещение = Новый ОписаниеТипов("СправочникСсылка.вмс_Помещения");
	
	ТаблицаПомещенийДляЗамены = Новый ТаблицаЗначений;
	ТаблицаПомещенийДляЗамены.Колонки.Добавить("Помещение", ОТПомещение);
	ТаблицаПомещенийДляЗамены.Колонки.Добавить("ПомещениеЗамена", ОТПомещение);
	
	РК.ДобавитьСтрокуТЗ(ТаблицаПомещенийДляЗамены, Справочники.вмс_Помещения.ПустаяСсылка(), Справочники.вмс_Помещения.ПолучитьПомещениеНеназначенныхЯчеек());
	
	Возврат ТаблицаПомещенийДляЗамены;
	
КонецФункции

Функция ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ВходящиеПараметры = Неопределено) Экспорт	
	
	// 24.05.2022 Кулалаев Код: ТОЯ2405
	// Новая функция получения остатков. Параметры через структуру   
	
	Если ВходящиеПараметры = Неопределено Тогда  	
		ВходящиеПараметры = Новый Структура;
	КонецЕсли;
	
	// ТУ_Смирнова 27.03.2025 задание по корректировке функции для учета характеристик при получении остатков +++
	// та же функция, но работает с переданной таблицей
	//Если ВходящиеПараметры.Свойство("Товары") И вмс_РаботаСКоллекциями.ЭтоТаблицаЗначений(ВходящиеПараметры.Товары) Тогда
	//	 Возврат ПолучитьТаблицуОстатковВЯчейкахЧерезТаблицу(ВходящиеПараметры);	
	//КонецЕсли;
	// ТУ_Смирнова 27.03.2025 задание по корректировке функции для учета характеристик при получении остатков ---
	
	Запрос = Новый Запрос;   
	
	ТекущиеДокументы = Неопределено;
	ВходящиеПараметры.Свойство("ТекущиеДокументы", ТекущиеДокументы); 
	//Если ТекущиеДокументы = Неопределено Тогда
	//	ВходящиеПараметры.Свойство("ТекущийДокумент", ТекущиеДокументы); 
	//КонецЕсли;
	
	ПустаяДата = '00010101';
	Дата = Неопределено;
	ВходящиеПараметры.Свойство("Дата", Дата);
	Если ТипЗнч(Дата) <> Тип("Дата") Тогда
		Дата = ПустаяДата;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекущиеДокументы", ТекущиеДокументы);
	Запрос.УстановитьПараметр("ТаблицаПомещенийДляЗамены", ПолучитьТаблицуПомещенийДляЗамены());
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПомещенийДляЗамены.Помещение КАК Помещение,
	|	ТаблицаПомещенийДляЗамены.ПомещениеЗамена КАК ПомещениеЗамена
	|ПОМЕСТИТЬ ВТ_ТаблицаПомещенийДляЗамены
	|ИЗ
	|	&ТаблицаПомещенийДляЗамены КАК ТаблицаПомещенийДляЗамены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапроса.Товар КАК Товар,
	|	ТаблицаЗапроса.Ячейка КАК Ячейка,
	|	&ПолеСклад КАК Склад,
	|	&ПолеКонтейнер КАК Контейнер,
	|	ТаблицаЗапроса.КоличествоОборот КАК Количество,
	|	ТаблицаЗапроса.ВесОборот КАК Вес
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Обороты(, &Дата, , &Отборы) КАК ТаблицаЗапроса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаЗапроса.Товар,
	|	ТаблицаЗапроса.Ячейка,
	|	&ПолеСклад,
	|	&ПолеКонтейнер,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапроса.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -ТаблицаЗапроса.Количество
	|		ИНАЧЕ ТаблицаЗапроса.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапроса.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -ТаблицаЗапроса.Вес
	|		ИНАЧЕ ТаблицаЗапроса.Вес
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам КАК ТаблицаЗапроса
	|ГДЕ
	|	ТаблицаЗапроса.Период <= &Дата
	|	И ТаблицаЗапроса.Регистратор В(&ТекущиеДокументы)
	|	И ТаблицаЗапроса.Активность
	|	И &Отборы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапроса.Товар КАК Товар,
	|	ТаблицаЗапроса.Ячейка КАК Ячейка,
	|	ТаблицаЗапроса.Склад КАК Склад,
	|	ТаблицаЗапроса.Контейнер КАК Контейнер,
	|	СУММА(ТаблицаЗапроса.Количество) КАК Количество,
	|	СУММА(ТаблицаЗапроса.Вес) КАК Вес,
	|	ЕСТЬNULL(ВТ_ТаблицаПомещенийДляЗамены.ПомещениеЗамена, вмс_МестаХранения.Помещение) КАК Помещение
	|ПОМЕСТИТЬ ВТ2
	|ИЗ
	|	ВТ КАК ТаблицаЗапроса
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|		ПО ТаблицаЗапроса.Ячейка = вмс_МестаХранения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаПомещенийДляЗамены КАК ВТ_ТаблицаПомещенийДляЗамены
	|		ПО (вмс_МестаХранения.Помещение = ВТ_ТаблицаПомещенийДляЗамены.Помещение)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапроса.Товар,
	|	ТаблицаЗапроса.Ячейка,
	|	ТаблицаЗапроса.Склад,
	|	ТаблицаЗапроса.Контейнер,
	|	ЕСТЬNULL(ВТ_ТаблицаПомещенийДляЗамены.ПомещениеЗамена, вмс_МестаХранения.Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапроса.Товар КАК Товар,
	|	ТаблицаЗапроса.Ячейка КАК Ячейка,
	|	ТаблицаЗапроса.Ячейка.Наименование КАК НаименованиеЯчейки,
	|	ТаблицаЗапроса.Склад КАК Склад,
	|	ТаблицаЗапроса.Контейнер КАК Контейнер,
	|	ТаблицаЗапроса.Количество КАК Количество,
	|	ТаблицаЗапроса.Вес КАК Вес,
	|	ТаблицаЗапроса.Помещение КАК Помещение,
	|	ТаблицаЗапроса.Помещение.Приоритет КАК ПриоритетПомещения
	|ИЗ
	|	ВТ2 КАК ТаблицаЗапроса
	|ГДЕ
	|	ТаблицаЗапроса.Количество > 0";
	
	ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля(); 
	
	// Кулалаев Е.С + 31.05.2023 12:26:19
	// BOX-57 Модуль учета единиц измерения в мобильной версии: Остатки по упаковкам не ведутся. Пока.
	Если ТоварныеПоляМассив.Найти("Упаковка") <> Неопределено Тогда
		вмс_РаботаСКоллекциями.ВычестьМассив(ТоварныеПоляМассив, "Упаковка");
	КонецЕсли;
	// Кулалаев Е.С -

	ИспользуемыеПоля = Неопределено;
	ВходящиеПараметры.Свойство("ИспользуемыеПоля", ИспользуемыеПоля); 
	
	Если ИспользуемыеПоля <> Неопределено Тогда
		ИспользуемыеПоляМассив = вмс_РаботаСКоллекциями.ЗначениеВМассив(ИспользуемыеПоля);
	Иначе
		ИспользуемыеПоляМассив = Новый Массив;
	КонецЕсли;

	МассивОтборов = Новый Массив; 
	Товары = Неопределено;
	ВходящиеПараметры.Свойство("Товары", Товары);
	Если Товары <> Неопределено Тогда
		
		Если вмс_РаботаСКоллекциями.ЭтоКвазиТаблицаЗначений(Товары) ИЛИ вмс_РаботаСКоллекциями.ЭтоТаблицаЗначений(Товары) Тогда
			
			// отбор по таблице товаров+
			КолонкиТоваров = вмс_РаботаСКоллекциями.ПолучитьКолонкиКоллекции(Товары);
			
			ТекстОтборовПоТаблице = "";
			Для Каждого Измерение Из Метаданные.РегистрыНакопления.вмс_ОперацияПоЯчейкам.Измерения Цикл
				
				ИмяКолонки = Измерение.Имя;
				Если КолонкиТоваров.Найти(ИмяКолонки) <> Неопределено Тогда
					
					ТекстОтборовПоТаблице = ТекстОтборовПоТаблице + ИмяКолонки + ", ";
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ТекстОтборовПоТаблице <> "" Тогда
				
				ТекстОтборовПоТаблице = Лев(ТекстОтборовПоТаблице, СтрДлина(ТекстОтборовПоТаблице)-СтрДлина(", "));
				ТекстОтборовПоТаблице = "(" + ТекстОтборовПоТаблице + ") В (ВЫБРАТЬ " + ТекстОтборовПоТаблице + " ИЗ ТаблицаОтборовЗапроса)";
				МассивОтборов.Добавить(ТекстОтборовПоТаблице);
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ТаблицаЗапроса.Товар КАК Товар,
				|	ТаблицаЗапроса.Ячейка КАК Ячейка,
				|	ТаблицаЗапроса.Контейнер КАК Контейнер
				|ПОМЕСТИТЬ ТаблицаОтборовЗапроса
				|ИЗ
				|	&ТаблицаОтборовЗапроса КАК ТаблицаЗапроса"
				+ Символы.ПС + ";" + Символы.ПС  + Символы.ПС
				+ Запрос.Текст;
				
				ТаблицаОтборовЗапроса = РегистрыНакопления.вмс_ОперацияПоЯчейкам.СоздатьНаборЗаписей().Выгрузить();
				вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(ТаблицаОтборовЗапроса, Товары);
				Запрос.УстановитьПараметр("ТаблицаОтборовЗапроса", ТаблицаОтборовЗапроса);
			КонецЕсли;
			// отбор по таблице товаров-
			
		ИначеЕсли ТипЗнч(Товары) = Тип("Структура") Тогда 
			
			ИспользуемыеВОтбореЗапросаТоварныеПоляМассив = вмс_РаботаСКоллекциями.ПересечениеМассивов(ТоварныеПоляМассив, ИспользуемыеПоляМассив);
			Для каждого ТоварноеПоле Из ИспользуемыеВОтбореЗапросаТоварныеПоляМассив Цикл
				Запрос.УстановитьПараметр(ТоварноеПоле, Товары[ТоварноеПоле]);
				МассивОтборов.Добавить(""+ТоварноеПоле+" В (&"+ТоварноеПоле+")");	
			КонецЦикла;
			
		Иначе
			
			Запрос.УстановитьПараметр("Товары", Товары);
			МассивОтборов.Добавить("Товар В (&Товары)");
			
		КонецЕсли;
		
	КонецЕсли; 
	
	ТоварныеПоляДляЗапроса = "";
	ИмяТаблицыЗапроса = "ТаблицаЗапроса";
	СвязкаПолей = "," + Символы.ПС + Символы.Таб;
	Для Каждого ИмяПоля Из ТоварныеПоляМассив Цикл
		ТоварныеПоляДляЗапроса = ТоварныеПоляДляЗапроса + СвязкаПолей + ИмяТаблицыЗапроса + "." + ИмяПоля;
	КонецЦикла;
	ТоварныеПоляДляЗапроса = Прав(ТоварныеПоляДляЗапроса, СтрДлина(ТоварныеПоляДляЗапроса)-СтрДлина(СвязкаПолей));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаЗапроса.Товар,", ТоварныеПоляДляЗапроса+",");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаЗапроса.Товар КАК Товар", ТоварныеПоляДляЗапроса);
	
	НастраиваемыеПоляМассив = вмс_РаботаСКоллекциями.ЗначениеВМассив("Контейнер, Склад");
	Для Каждого Поле Из НастраиваемыеПоляМассив Цикл
		ПолеЗапроса = "&Поле" + Поле;
		Если ИспользуемыеПоляМассив.Найти(Поле) <> Неопределено Тогда      
			// ТУ_Прошин_13.01.26 
			// Измерения склад больше нет, поэтому достаю из ячейки
			Если Поле = "Склад" Тогда  
				ТекстПоля = ИмяТаблицыЗапроса + "." + "Ячейка.Владелец"; 	
			Иначе	
				ТекстПоля = ИмяТаблицыЗапроса + "." + Поле;  
			КонецЕсли;
		Иначе
			ТекстПоля = "НЕОПРЕДЕЛЕНО";
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ПолеЗапроса, ТекстПоля);
	КонецЦикла; 
	
	// Кулалаев Е.С + 24.05.2022 12:31:14
	
	ВключатьОтрицательные = Истина; // ТУ_Кошелев 08.07.24 - Поменял чтобы отрицательные строки по умолчанию включались в информацию, если параметр не передан
	Если ВходящиеПараметры.Свойство("ВключатьОтрицательные") Тогда        
		ВключатьОтрицательные = ВходящиеПараметры.ВключатьОтрицательные;
	КонецЕсли;
	
	Если ВключатьОтрицательные = Истина Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаЗапроса.Количество > 0", "ТаблицаЗапроса.Количество <> 0"); // ТУ_Самойленко 26.04.23 Исправлено название таблицы	
	КонецЕсли;	
	// Кулалаев Е.С -	
	
	Если ВходящиеПараметры.Свойство("БезЯчеекХранения") Тогда 
		Запрос.УстановитьПараметр("ЯчейкиИсключения", ПолучитьЯчейкиОтветственногоХранения());
		МассивОтборов.Добавить("НЕ Ячейка В (&ЯчейкиИсключения)");
	КонецЕсли;
	
	// Плугина 20.09 + 
	Оператор = Неопределено;
	ВходящиеПараметры.Свойство("Оператор",Оператор);
	Если Оператор <> Неопределено Тогда 	
		ДоступныеЯчейки = Справочники.вмс_НастройкиОператора.ПолучитьДоступныеЯчейкиОператора(Оператор);
		Если ЗначениеЗаполнено(ДоступныеЯчейки) Тогда   
			Запрос.УстановитьПараметр("ДоступныеЯчейки", ДоступныеЯчейки);
			МассивОтборов.Добавить("Ячейка В (&ДоступныеЯчейки)");
		КонецЕсли; 	
	КонецЕсли;
	// Плугина 20.09 -
	
	Склады = Неопределено;
	ВходящиеПараметры.Свойство("Склады",Склады);
	Если ЗначениеЗаполнено(Склады) Тогда //Склады <> Неопределено Тогда // ТУ_Самойленко 31.08.23 
		Запрос.УстановитьПараметр("Склады", Склады);  
		// ТУ_Прошин_13.01.26+
		МассивОтборов.Добавить("Ячейка.Владелец В (&Склады)");  
		//МассивОтборов.Добавить("Склад В (&Склады)");
		// ТУ_Прошин_13.01.26
	КонецЕсли;
	
	Ячейки = Неопределено;
	ВходящиеПараметры.Свойство("Ячейки",Ячейки);
	Если Ячейки <> Неопределено Тогда
		МассивЯчеекИТиповЯчеек = вмс_РаботаСКоллекциями.ЗначениеВМассив(Ячейки);
		МассивЯчеек = Новый Массив;
		МассивТиповЯчеек = Новый Массив;
		Для каждого ЗначениеЯчейки Из МассивЯчеекИТиповЯчеек Цикл
			Если ТипЗнч(ЗначениеЯчейки) = Тип("СправочникСсылка.вмс_МестаХранения") Тогда
				МассивЯчеек.Добавить(ЗначениеЯчейки);
			ИначеЕсли ТипЗнч(ЗначениеЯчейки) = Тип("ПеречислениеСсылка.вмс_ТипыЯчеек") Тогда
				МассивТиповЯчеек.Добавить(ЗначениеЯчейки);
			КонецЕсли;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Ячейки", МассивЯчеек);
		Запрос.УстановитьПараметр("ТипыЯчеек", МассивТиповЯчеек);
		МассивОтборов.Добавить("(Ячейка В (&Ячейки) ИЛИ Ячейка.ТипЯчейки В (&ТипыЯчеек))");
	КонецЕсли;
	
	Контейнеры = Неопределено;
	ВходящиеПараметры.Свойство("Контейнеры", Контейнеры);
	Если Контейнеры <> Неопределено Тогда
		Запрос.УстановитьПараметр("Контейнеры", Контейнеры);
		МассивОтборов.Добавить("Контейнер В (&Контейнеры)");
	КонецЕсли;
	
	ТекстОтборов = вмс_РаботаСКоллекциями.МассивВСтроку(МассивОтборов, " И ");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отборы", ТекстОтборов);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	ТаблицаОстатков.Колонки.Добавить("ПолеУпорядочиванияПоНаименованию");
	
	Для Каждого СтрокаОстатка Из ТаблицаОстатков Цикл
		Префикс = "";
		Суффикс = "";
		вмс_РаботаСКоллекциями.РазложитьСтрокуНаПрефиксИЧисловойСуффикс(СтрокаОстатка.НаименованиеЯчейки, Префикс, Суффикс);
		Суффикс = Прав("000" + Суффикс, 3);
		СтрокаОстатка.ПолеУпорядочиванияПоНаименованию = Префикс + Суффикс;
	КонецЦикла;
	
	ТаблицаОстатков.Сортировать("ПриоритетПомещения, ПолеУпорядочиванияПоНаименованию");
	
	// ТУ_СКВ 26.07.23 ++
	ПоляГруппировки = Неопределено;
	ПоляСуммирования = Неопределено;
	ВходящиеПараметры.Свойство("ПоляГруппировки",ПоляГруппировки);
	ВходящиеПараметры.Свойство("ПоляСуммирования",ПоляСуммирования);
	Если ЗначениеЗаполнено(ПоляГруппировки) Тогда
		ТаблицаОстатков.Свернуть(ПоляГруппировки, ПоляСуммирования);	
	КонецЕсли;
	// ТУ_СКВ 26.07.23 -- 	
	
	Возврат ТаблицаОстатков;
	
КонецФункции  

// Удалить если нет на нее референсов, ибо негоже две одноликие функции попускать
Функция ПолучитьТаблицуОстатковВЯчейкахЧерезТаблицу(ВходящиеПараметры = Неопределено) Экспорт
	
	Возврат ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ВходящиеПараметры);
	
КонецФункции  

Функция ПолучитьТаблицуОстатковВЯчейках(Товары=Неопределено, Склады=Неопределено, Ячейки=Неопределено, Контейнеры=Неопределено, ТекущиеДокументы=Неопределено, ИспользуемыеПоля=Неопределено, ВключатьОтрицательные=Ложь) Экспорт
	
	ВходящиеПараметры = Новый Структура;
	ВходящиеПараметры.Вставить("Товары", Товары);
	ВходящиеПараметры.Вставить("Склады", Склады);
	ВходящиеПараметры.Вставить("Ячейки", Ячейки);
	ВходящиеПараметры.Вставить("Контейнеры", Контейнеры);
	ВходящиеПараметры.Вставить("ТекущиеДокументы", ТекущиеДокументы);
	ВходящиеПараметры.Вставить("ИспользуемыеПоля", ИспользуемыеПоля);
	ВходящиеПараметры.Вставить("ВключатьОтрицательные", ВключатьОтрицательные);
	
	ТаблицаОстатков = ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ВходящиеПараметры);
	
	Возврат ТаблицаОстатков;

КонецФункции

Функция ПолучитьМассивДокументовОперации(ПараметрыОперации) Экспорт
	
	ТаблицаДокументовОперации = ПолучитьТаблицуДокументовОперации(ПараметрыОперации);
	МассивДокументовОперации = ТаблицаДокументовОперации.ВыгрузитьКолонку("СсылкаОперации");
	
	Возврат МассивДокументовОперации;
	
КонецФункции

Функция ПолучитьТаблицуДокументовОперации(ПараметрыОперации) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкам.Ссылка КАК СсылкаОперации,
	|	вмс_ОперацияПоЯчейкам.Ответственный КАК Ответственный,
	|	вмс_ОперацияПоЯчейкам.Проведен КАК Проведен
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам КАК вмс_ОперацияПоЯчейкам
	|ГДЕ
	|	вмс_ОперацияПоЯчейкам.ВидОперации = &ВидОперации
	|	И вмс_ОперацияПоЯчейкам.ДокументОснование В(&Распоряжения)
	|	И вмс_ОперацияПоЯчейкам.ВидСубОперации = &ВидСубОперации";
	
	Запрос.УстановитьПараметр("ВидОперации", ПараметрыОперации.ВидОперации);
	Запрос.УстановитьПараметр("Распоряжения", ПараметрыОперации.Распоряжения);
	Запрос.УстановитьПараметр("ВидСубОперации", Справочники.вмс_Операции.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДокументовОперации = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаДокументовОперации;
	
КонецФункции

Функция ДополнитьОтборПараметрамиОперации(Запрос,Операция,Таблица)
	
	НастройкиОперации = Справочники.вмс_НастройкиОперации.НайтиПоРеквизиту("Операция",Операция);
	
	Если НЕ ЗначениеЗаполнено(НастройкиОперации) Тогда 
		Запрос.УстановитьПараметр("ДополнительныеУсловия", Истина);
		Возврат Запрос;
	КонецЕсли;
	
	ТаблицаНастроек = НастройкиОперации.СписокНастроек.Выгрузить(Новый Структура("ВидНастройки,ИспользуетсяВОперации",Перечисления.вмс_ВидыИспользованияНастроек.ИсточникДанных,Истина,));
	
	Если ЗначениеЗаполнено(ТаблицаНастроек) Тогда
		СтрокаНастроек = "";
		
		Для каждого Строка Из ТаблицаНастроек Цикл
			СтрокаНастроек = СтрокаНастроек + Таблица + "." + Строка.ПолеДанных + Перечисления.вмс_ВидыСравненияВНастройках.ПолучитьВидСравненияЗапросомПоВидуСравненияWMS(Строка.ВидСравнения) + Строка.ЗначениеНастройки + " И ";  			
		КонецЦикла; 
		
		СтрокаНастроек = СтрокаНастроек + "ИСТИНА";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеУсловия", СтрокаНастроек); 
		
	КонецЕсли;     
	
	Возврат Запрос;
	
	
	
КонецФункции

Функция ПолучитьТаблицуОстатковПоКонтейнерам(Контейнеры) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контейнеры", Контейнеры);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Контейнер КАК Контейнер,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(, Контейнер В (&Контейнеры)) КАК вмс_ОперацияПоЯчейкамОстатки";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаОстатков;
КонецФункции

Функция ПолучитьЯчейкиОтветственногоХранения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_НастройкиОператора.ЯчейкаОтветственногоХранения КАК ЯчейкаОтветственногоХранения
	|ИЗ
	|	Справочник.вмс_НастройкиОператора КАК вмс_НастройкиОператора";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("ЯчейкаОтветственногоХранения");
	
КонецФункции

// ТУ_Кошелев 20.12.24 - сделал адаптацию конфигураций (пока для УТ и УНФ); учет знаменателя для УТ; возврат количества напрямую
Функция ПолучитьКоэффициентУпаковкиПоШтрихкоду(Штрихкод) Экспорт
	
	ИмяСправочникаУпаковки = вмс_АдаптацияКонфигураций.ПолучитьИмяСправочникаУпаковки();
	ИмяКолонкиЕдиницыИзмерения = вмс_АдаптацияКонфигураций.ИмяКолонкиЕдиницаИзмерения();
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры." + ИмяКолонкиЕдиницыИзмерения + " КАК Упаковка
	|ПОМЕСТИТЬ Упаковки
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	вмс_ШтрихкодыРасширенный.Упаковка
	|ИЗ
	|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК вмс_ШтрихкодыРасширенный
	|ГДЕ
	|	вмс_ШтрихкодыРасширенный.Штрихкод = &Штрихкод
	|;";
	
	Если вмс_АдаптацияКонфигураций.ЭтоУТ() ИЛИ вмс_АдаптацияКонфигураций.ЭтоЕРП() Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|ЕСТЬNULL(ВЫБОР      
		|	КОГДА УпаковкиСправочник.Знаменатель = 0
		|	ТОГДА УпаковкиСправочник.Числитель
		|	ИНАЧЕ УпаковкиСправочник.Числитель / УпаковкиСправочник.Знаменатель
		|КОНЕЦ, 1) КАК Коэффициент                
		|ИЗ
		|	Упаковки КАК Упаковки
		|		ЛЕВОЕ СОЕДИНЕНИЕ " + ИмяСправочникаУпаковки + " КАК УпаковкиСправочник
		|		ПО Упаковки.Упаковка = УпаковкиСправочник.Ссылка";
	Иначе	
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ЕСТЬNULL(УпаковкиСправочник.Коэффициент, 1) КАК Коэффициент                
		|ИЗ
		|	Упаковки КАК Упаковки
		|		ЛЕВОЕ СОЕДИНЕНИЕ " + ИмяСправочникаУпаковки + " КАК УпаковкиСправочник
		|		ПО Упаковки.Упаковка = УпаковкиСправочник.Ссылка";
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Коэффициент;
	КонецЦикла;
	
	Возврат 1;	
КонецФункции

Функция КоэффициентУпаковки(Упаковка, Номенклатура) Экспорт
	
	Возврат вмс_АдаптацияКонфигураций.КоэффициентУпаковки(Упаковка, Номенклатура);

КонецФункции

// ТУ_Самойленко 20.03.23 ++
Функция ПолучитьТаблицуДоступныхРолейОператоров(Операторы = Неопределено, Роли = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	вмс_ГруппыРолейОператоровОператоры.Оператор КАК Оператор,
	|	вмс_ГруппыРолейОператоровОператоры.Ссылка.РольОператоров КАК РольОператора
	|ИЗ
	|	Справочник.вмс_ГруппыРолейОператоров.Операторы КАК вмс_ГруппыРолейОператоровОператоры
	|";
	
	Если ЗначениеЗаполнено(Операторы) Или ЗначениеЗаполнено(Роли) Тогда
		СтрокаОтбор = "";
		
		Если ЗначениеЗаполнено(Операторы) Тогда
			Запрос.УстановитьПараметр("Операторы", Операторы);
			Если ЗначениеЗаполнено(СтрокаОтбор) Тогда
				СтрокаОтбор = СтрокаОтбор + " И ";	
			Иначе
				СтрокаОтбор = "	";	
			КонецЕсли;
			СтрокаОтбор = СтрокаОтбор + "вмс_ГруппыРолейОператоровОператоры.Оператор В (&Операторы)";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Роли) Тогда
			Если ТипЗнч(Роли) = Тип("Строка") Тогда
				РолиМассив = вмс_РаботаСКоллекциями.СтрокуВМассив(Роли);
				Роли = Новый Массив;
				Для каждого Роль Из РолиМассив Цикл
					Роли.Добавить(Перечисления.вмс_РолиОператоров[Роль]);
				КонецЦикла;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Роли", Роли);
			Если ЗначениеЗаполнено(СтрокаОтбор) Тогда
				СтрокаОтбор = СтрокаОтбор + " И ";	
			Иначе
				СтрокаОтбор = "	";	
			КонецЕсли;
			СтрокаОтбор = СтрокаОтбор + "вмс_ГруппыРолейОператоровОператоры.Ссылка.РольОператоров В (&Роли)";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|" + СтрокаОтбор;
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
// ТУ_Самойленко 20.03.23 --

// Функция - Получить данные собираемого комплекта
//
// Параметры:
//  ВходящиеПараметры	- Структура - коллекция входных параметров 
//  		Поля коллекции:
//      Основание   - ДокументСсылка.ЗаказНаСборку - документ для получения данных
// Возвращаемое значение:
//   - ТаблицаЗначений 
//
Функция ПолучитьДанныеСобираемогоКомплекта(ВходящиеПараметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаСборку.Номенклатура КАК Товар,
	|	ЗаказНаСборку.Характеристика КАК Характеристика,
	|   ЗаказНаСборку.Упаковка КАК Упаковка,
	|	ЗаказНаСборку.Количество КАК Количество
	|ИЗ
	|	Документ.ЗаказНаСборку КАК ЗаказНаСборку
	|ГДЕ
	|	ЗаказНаСборку.Ссылка = &ДокументОснование";     
	
	Запрос.УстановитьПараметр("ДокументОснование",ВходящиеПараметры.Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
	
КонецФункции

// ТУ_Кошелев 27.02.24 ++
Функция ПолучитьСкладПоУмолчанию() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ЭтоГруппа";  
	
	ИмяСправочникаСклады = вмс_АдаптацияКонфигураций.ПолучитьИмяСправочникаСклады();
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Справочник.Склады","Справочник." +ИмяСправочникаСклады);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"НЕ Склады.ЭтоГруппа",
	?(вмс_АдаптацияКонфигураций.ИерархическийСправочник(ИмяСправочникаСклады) = Истина,
	"НЕ Склады.ЭтоГруппа",
	"ИСТИНА"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Владелец = Выборка.Ссылка;  
		Возврат Владелец;
	КонецЕсли;
КонецФункции

//////////////////////////////////////////////////////////////////////////////////
//
//						Помещения+
//

Функция ПолучитьОбработанныеПомещения(ВходящиеПараметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыОпераций.Помещение КАК Помещение
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам КАК ДокументыОпераций
	|ГДЕ
	|	ДокументыОпераций.Готов
	|	И ДокументыОпераций.Проведен
	|	И ДокументыОпераций.ДокументОснование В(&ДокументыОснования)
	|	И ДокументыОпераций.ВидОперации В(&ВидыОпераций)";
	
	Запрос.УстановитьПараметр("ДокументыОснования", ВходящиеПараметры.ДокументыОснования);
	Запрос.УстановитьПараметр("ВидыОпераций", ВходящиеПараметры.ВидыОпераций);
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбработанныеПомещения = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Помещение");
	
	Возврат ОбработанныеПомещения;
	
КонецФункции

Функция ПолучитьТаблицуПланаПоПомещениям(Знач ТаблицаОстатковЯчеек, Знач ТаблицаПлана, знач ТаблицаФакта) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ПоляОстатков = РК.ПолучитьКолонкиКоллекции(ТаблицаОстатковЯчеек);
	
	ПоляСоединения = РК.ПолучитьКолонкиКоллекции(ТаблицаПлана);
	ПоляСоединения = РК.ПересечениеМассивов(ПоляСоединения, вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля());
	ПоляСоединения = РК.ПересечениеМассивов(ПоляСоединения, ПоляОстатков);
	ДополнительныеПоля = РК.ЗначениеВМассив("Помещение");
	ПоляИтогов = РК.ЗначениеВМассив("Количество, КоличествоОстаток");
	
	ВсеПоля = Новый Массив;
	РК.ДобавитьЭлементыКоллекции(ВсеПоля, ПоляСоединения);
	РК.ДобавитьЭлементыКоллекции(ВсеПоля, ДополнительныеПоля);
	РК.ДобавитьЭлементыКоллекции(ВсеПоля, ПоляИтогов);
	
	ТаблицаПланаПоПомещениям = РК.СкопироватьКоллекцию(ТаблицаПлана, Новый Массив);
	РК.ДополнитьКолонкиКоллекции(ТаблицаПланаПоПомещениям, ВсеПоля);
	
	Отбор = Новый Структура(РК.МассивВСтроку(ПоляСоединения));
	
	// распределим отобранные товары
	ПоляФакта = РК.ПолучитьКолонкиКоллекции(ТаблицаФакта);
	НовыеПоляФакта = РК.ПересечениеМассивов(ПоляФакта, ВсеПоля);
	ТаблицаФакта = ТаблицаФакта.Скопировать(, РК.МассивВСтроку(НовыеПоляФакта));
	ТаблицаФакта.Колонки.Количество.Имя = "КоличествоОстаток";
	РК.СвернутьКоллекциюЗначений(ТаблицаФакта, , "КоличествоОстаток");
	
	ТаблицаРезультата = РК.РаспределитьРесурсыКоллекции(ТаблицаПлана, ТаблицаФакта, "Количество", "КоличествоОстаток", ПоляСоединения, "КоличествоОстаток, Помещение");
	
	ТаблицаПлана = РК.СкопироватьКоллекцию(ТаблицаПлана, Новый Массив);
	Для Каждого СтрокаТовара Из ТаблицаРезультата Цикл
		Если СтрокаТовара.Помещение <> Неопределено Тогда
			РК.ДобавитьЭлементКоллекции(ТаблицаПланаПоПомещениям, СтрокаТовара);
		Иначе
			РК.ДобавитьЭлементКоллекции(ТаблицаПлана, СтрокаТовара);
		КонецЕсли;
	КонецЦикла;
	
	// определим хватает ли товаров в помещении
	НовыеПоляОстатков = РК.ПересечениеМассивов(ПоляОстатков, ВсеПоля);
	ТаблицаОстатков = ТаблицаОстатковЯчеек.Скопировать(, РК.МассивВСтроку(НовыеПоляОстатков));
	ТаблицаОстатков.Колонки.Количество.Имя = "КоличествоОстаток";
	РК.СвернутьКоллекциюЗначений(ТаблицаОстатков, , "КоличествоОстаток");
	ТаблицаОстатков.Колонки.Добавить("Хватает");
	
	Для Каждого СтрокаТовара Из ТаблицаПлана Цикл
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаТовара);
		НайденныеОстатки = ТаблицаОстатков.НайтиСтроки(Отбор);
		Если НайденныеОстатки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОстатка = НайденныеОстатки[0];
		СтрокаОстатка.Хватает = СтрокаОстатка.КоличествоОстаток >= СтрокаТовара.Количество;
	КонецЦикла;
	
	ТаблицаОстатков.Сортировать("Хватает УБЫВ, КоличествоОстаток");
	
	РаспределятьПлановоеКоличествоПоОстаткамПомещений = Ложь;
	Если РаспределятьПлановоеКоличествоПоОстаткамПомещений Тогда
		// распределим плановое количество по остаткам
		ТаблицаРезультата = РК.РаспределитьРесурсыКоллекции(ТаблицаПлана, ТаблицаОстатков, "Количество", "КоличествоОстаток", ПоляСоединения, "КоличествоОстаток, Помещение");
		РК.ДобавитьЭлементыКоллекции(ТаблицаПланаПоПомещениям, ТаблицаРезультата);
	Иначе
		// подтянем все помещения товаров независимо от количества в плане
		Для Каждого СтрокаПлана Из РК.ПолучитьЭлементыКоллекции(ТаблицаПлана) Цикл
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаПлана);
			НайденныеОстатки = РК.НайтиЭлементыКоллекции(ТаблицаОстатков, Отбор);
			Для Каждого СтрокаОстатка Из НайденныеОстатки Цикл
				СтрокаПланаПоПомещению = ТаблицаПланаПоПомещениям.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПланаПоПомещению, СтрокаПлана);
				ЗаполнитьЗначенияСвойств(СтрокаПланаПоПомещению, СтрокаОстатка);
				СтрокаПланаПоПомещению.Количество = Мин(СтрокаПлана.Количество, СтрокаОстатка.КоличествоОстаток);
				СтрокаПланаПоПомещению.КоличествоОстаток = СтрокаПланаПоПомещению.Количество;
			КонецЦикла;
		КонецЦикла;
		
		// проверим хватает ли остатка для плана
		ТаблицаПроверки = РК.СкопироватьКоллекцию(ТаблицаПлана);
		РК.ДобавитьКолонкуКоллекции(ТаблицаПроверки, "КоличествоОстаток");
		РК.ЗаполнитьЗначенияКоллекции(ТаблицаПроверки, 0, "КоличествоОстаток");
		РК.ДобавитьЭлементыКоллекции(ТаблицаПроверки, ТаблицаОстатков);
		РК.СвернутьКоллекциюЗначений(ТаблицаПроверки, ПоляСоединения, "Количество, КоличествоОстаток");
		
		Для Каждого СтрокаПроверки Из РК.ПолучитьЭлементыКоллекции(ТаблицаПроверки) Цикл
			Если СтрокаПроверки.Количество > СтрокаПроверки.КоличествоОстаток Тогда
				// не хватает, добавим строку с пустым помещением
				СтрокаПланаПоПомещению = ТаблицаПланаПоПомещениям.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПланаПоПомещению, СтрокаПлана);
				СтрокаПлана.Количество = СтрокаПроверки.Количество - СтрокаПроверки.КоличествоОстаток;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// скорректируем данные
	ПустоеПомещение				= Справочники.вмс_Помещения.ПустаяСсылка();
	ПомещениеНеназначенныхЯчеек	= Справочники.вмс_Помещения.ПолучитьПомещениеНеназначенныхЯчеек();
	ПомещениеБезОстатка			= Справочники.вмс_Помещения.ПолучитьПомещениеБезОстатка();
	
	Для Каждого СтрокаПлана Из РК.ПолучитьЭлементыКоллекции(ТаблицаПланаПоПомещениям) Цикл
		
		Если СтрокаПлана.Помещение = ПустоеПомещение Тогда
			СтрокаПлана.Помещение = ПомещениеНеназначенныхЯчеек;
		ИначеЕсли СтрокаПлана.Помещение = Неопределено Тогда
			СтрокаПлана.Помещение = ПомещениеБезОстатка;
			СтрокаПлана.КоличествоОстаток = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПланаПоПомещениям;
	
КонецФункции

//
//						Помещения-
//
//////////////////////////////////////////////////////////////////////////////////

// Климентов++
Функция ПолучитьТаблицуТоваровВЯчейке(Товар, Ячейка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товар", Товар);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	Запрос.Текст ="ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
	|			,
	|			Товар = &Товар
	|				И Ячейка = &Ячейка) КАК вмс_ОперацияПоЯчейкамОстатки";
	
	Если Ячейка = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И МестаХраненияНоменклатуры.МестоХранения.Владелец В(&Склады)", "");
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	//ТаблицаТоваровВЯчейке = РезультатЗапроса.Выгрузить();
	Выборка= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Остатки = Выборка.Количество;	
		
	КонецЦикла;
	
	Возврат Остатки;	
	
КонецФункции
// Климентов-- 

// Самойленко++
Функция ПолучитьЯчейкуКомплектования() Экспорт
	
	ПолученнаяЯчейка = Справочники.вмс_МестаХранения.НайтиПоКоду("ЗК-0001");
	Возврат ПолученнаяЯчейка;
	
КонецФункции
// Самойленко--  

////////////////////////////////////////////////////////////////////////
//
//							Выборочная инвентаризация+
//

// ТУ_Самойленко 04.04.23 ++

Функция ПолучитьПланОператораПоИнвентаризации(Документ, Оператор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_ВыборочнаяИнвентаризацияТовары.Ячейка КАК Ячейка,
	|	вмс_ВыборочнаяИнвентаризацияТовары.Контейнер КАК Контейнер,
	|	вмс_ВыборочнаяИнвентаризацияТовары.Номенклатура КАК Товар,
	|	вмс_ВыборочнаяИнвентаризацияТовары.Характеристика КАК Характеристика,
	|	вмс_ВыборочнаяИнвентаризацияТовары.Партия КАК Партия,
	|	вмс_ВыборочнаяИнвентаризацияТовары.Серия КАК Серия,
	|	вмс_ВыборочнаяИнвентаризацияТовары.Качество КАК Качество,
	|	вмс_ВыборочнаяИнвентаризацияТовары.КоличествоПлан КАК Количество
	|ИЗ
	|	Документ.вмс_ВыборочнаяИнвентаризация.Товары КАК вмс_ВыборочнаяИнвентаризацияТовары
	|ГДЕ
	|	вмс_ВыборочнаяИнвентаризацияТовары.Ссылка = &Документ
	|	И вмс_ВыборочнаяИнвентаризацияТовары.Исполнитель = &Оператор
	|	И вмс_ВыборочнаяИнвентаризацияТовары.Номенклатура <> Неопределено";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Оператор", Оператор);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьФактОператораПоИнвентаризации(Документ, Оператор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыПоИнвентаризации.Товар КАК Товар,
	|	ТоварыПоИнвентаризации.Контейнер КАК Контейнер,
	|	ТоварыПоИнвентаризации.Характеристика КАК Характеристика,
	|	ТоварыПоИнвентаризации.Ячейка КАК Ячейка,
	|	ТоварыПоИнвентаризации.Партия КАК Партия,
	|	ТоварыПоИнвентаризации.Серия КАК Серия,
	|	ТоварыПоИнвентаризации.Качество КАК Качество,
	|	СУММА(ТоварыПоИнвентаризации.Количество) КАК Количество
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам.ТоварыПоИнвентаризации КАК ТоварыПоИнвентаризации
	|ГДЕ
	|	ТоварыПоИнвентаризации.Ссылка.ДокументОснование = &Документ
	|	И ТоварыПоИнвентаризации.Ссылка.Ответственный = &Оператор
	|	И ТоварыПоИнвентаризации.Ссылка.Проведен = ИСТИНА
	|	И ТоварыПоИнвентаризации.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыПоИнвентаризации.Серия,
	|	ТоварыПоИнвентаризации.Характеристика,
	|	ТоварыПоИнвентаризации.Ячейка,
	|	ТоварыПоИнвентаризации.Контейнер,
	|	ТоварыПоИнвентаризации.Товар,
	|	ТоварыПоИнвентаризации.Качество,
	|	ТоварыПоИнвентаризации.Партия";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Оператор", Оператор);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьФакт0ОператораПоИнвентаризации(Документ, Оператор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыПоИнвентаризации.Товар КАК Товар,
	|	ТоварыПоИнвентаризации.Контейнер КАК Контейнер,
	|	ТоварыПоИнвентаризации.Характеристика КАК Характеристика,
	|	ТоварыПоИнвентаризации.Ячейка КАК Ячейка,
	|	ТоварыПоИнвентаризации.Партия КАК Партия,
	|	ТоварыПоИнвентаризации.Серия КАК Серия,
	|	ТоварыПоИнвентаризации.Качество КАК Качество,
	|	СУММА(ТоварыПоИнвентаризации.Количество) КАК Количество
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам.ТоварыПоИнвентаризации КАК ТоварыПоИнвентаризации
	|ГДЕ
	|	ТоварыПоИнвентаризации.Ссылка.ДокументОснование = &Документ
	|	И ТоварыПоИнвентаризации.Ссылка.Ответственный = &Оператор
	|	И ТоварыПоИнвентаризации.Ссылка.Проведен = ИСТИНА
	|	И ТоварыПоИнвентаризации.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ТоварыПоИнвентаризации.Количество <> ТоварыПоИнвентаризации.Количество
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыПоИнвентаризации.Серия,
	|	ТоварыПоИнвентаризации.Характеристика,
	|	ТоварыПоИнвентаризации.Ячейка,
	|	ТоварыПоИнвентаризации.Контейнер,
	|	ТоварыПоИнвентаризации.Товар,
	|	ТоварыПоИнвентаризации.Качество,
	|	ТоварыПоИнвентаризации.Партия";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Оператор", Оператор);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьМассивИнвентаризируемыхЯчеек(Документ, Оператор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	вмс_ВыборочнаяИнвентаризацияТовары.Ячейка КАК Ячейка
	|ИЗ
	|	Документ.вмс_ВыборочнаяИнвентаризация.Товары КАК вмс_ВыборочнаяИнвентаризацияТовары
	|ГДЕ
	|	вмс_ВыборочнаяИнвентаризацияТовары.Ссылка = &Документ
	|	И вмс_ВыборочнаяИнвентаризацияТовары.Исполнитель = &Оператор
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_ВыборочнаяИнвентаризацияТовары.Ячейка
	|";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Оператор", Оператор);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("Ячейка");
	
КонецФункции

// ТУ_Самойленко 04.04.23 --

// ТУ_Самойленко 29.05.23 ++

//Функция ПолучитьДоступныеДляИнвентаризацииТовары(Документ) Экспорт
//	
//	ХранилищеДанных = Справочники.вмс_УниверсальноеХранилищеЗначений.НайтиПоРеквизиту("Хозяин", Документ);
//	Если ЗначениеЗаполнено(ХранилищеДанных) Тогда 
//		СтруктураДанных = ХранилищеДанных.Хранилище.Получить();
//	КонецЕсли;
//	
//	Результат = Новый Структура;
//	Результат.Вставить("ИспользуетсяОграничениеВводаТовара", ЗначениеЗаполнено(СтруктураДанных["Товары1"]));
//	Результат.Вставить("РазрешенныеДляВвода", Не СтруктураДанных["ИсключаяТовары1"]);
//	Результат.Вставить("МассивТоваров", СтруктураДанных["Товары1"]); 
//	
//	Возврат Результат;
//	
//КонецФункции

Функция ПолучитьЗаблокированныеЯчейки(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_ЗаблокированныеЯчейки.Ячейка КАК Ячейка,
	|	вмс_ЗаблокированныеЯчейки.ВидБлокировки КАК ВидБлокировки
	|ПОМЕСТИТЬ Заблокированные
	|ИЗ
	|	РегистрСведений.вмс_ЗаблокированныеЯчейки КАК вмс_ЗаблокированныеЯчейки 
	|ГДЕ
	|	вмс_ЗаблокированныеЯчейки.Источник <> &Источник
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_ЗаблокированныеЯчейки.Ячейка,
	|	вмс_ЗаблокированныеЯчейки.ВидБлокировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заблокированные.Ячейка КАК Ячейка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Заблокированные.ВидБлокировки = ЗНАЧЕНИЕ(Перечисление.вмс_ВидыБлокировокЯчеек.Полная)
	|					ИЛИ Заблокированные.ВидБлокировки = ЗНАЧЕНИЕ(Перечисление.вмс_ВидыБлокировокЯчеек.Отбор)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Отбор,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Заблокированные.ВидБлокировки = ЗНАЧЕНИЕ(Перечисление.вмс_ВидыБлокировокЯчеек.Полная)
	|					ИЛИ Заблокированные.ВидБлокировки = ЗНАЧЕНИЕ(Перечисление.вмс_ВидыБлокировокЯчеек.Размещение)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Размещение
	|ИЗ
	|	Заблокированные КАК Заблокированные
	|
	|СГРУППИРОВАТЬ ПО
	|	Заблокированные.Ячейка";
	Запрос.УстановитьПараметр("Источник", Пользователь);

	Возврат вмс_РаботаСКоллекциями.ЗагрузитьКвазиТаблицуЗначенийИзТаблицыЗначений(Запрос.Выполнить().Выгрузить());
	
	
КонецФункции

// ТУ_Самойленко 29.05.23 --

//
//							Выборочная инвентаризация-
//
////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////
//
//							Блокировка ячеек+
//

Функция ПолучитьЯчейкиДляОтгрузки(СписокДокументов) Экспорт
	
	Если Не ЗначениеЗаполнено(СписокДокументов) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкам.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкам.Регистратор.ДокументОснование КАК Документ
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам КАК вмс_ОперацияПоЯчейкам
	|ГДЕ
	|	вмс_ОперацияПоЯчейкам.Регистратор.ДокументОснование В(&СписокДокументов)
	|	И вмс_ОперацияПоЯчейкам.Регистратор.ВидОперации = &ВидОперации
	|	И вмс_ОперацияПоЯчейкам.Регистратор.ПометкаУдаления = ЛОЖЬ
	|	И вмс_ОперацияПоЯчейкам.Регистратор.Проведен = ИСТИНА
	|	И вмс_ОперацияПоЯчейкам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_ОперацияПоЯчейкам.Ячейка,
	|	вмс_ОперацияПоЯчейкам.Регистратор.ДокументОснование";
	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
	Запрос.УстановитьПараметр("ВидОперации", вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьСсылкуНаВидОперацииПоЯчейкам("Отбор"));  
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Возврат вмс_РаботаСКоллекциями.ЗагрузитьКвазиТаблицуЗначенийИзТаблицыЗначений(Результат);
	
КонецФункции 

//
//							Блокировка ячеек-
//
////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////
//
//							Товарные поля+
//

Функция ПолучитьНастройкуТоварныхПолей() Экспорт
	
	НастройкаТоварныхПолей = вмс_ОперацииПоЯчейкамКлиентСервер.ПолучитьСтруктуруНастройкиТоварныхПолей();

	НастройкаТоварныхПолейСохраненная = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("НастройкаТоварныхПолей");
	
	вмс_ОперацииПоЯчейкамКлиентСервер.ЗагрузитьСохраненнуюНастройкуТоварныхПолей(НастройкаТоварныхПолей, НастройкаТоварныхПолейСохраненная);
	
	Возврат НастройкаТоварныхПолей;

КонецФункции

Функция ПолучитьЗначенияПредставленийПолейДанных(ТаблицаЗапроса) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	ТаблицаДанных = РК.СкопироватьКоллекцию(ТаблицаЗапроса);
	ТоварныеПоляМассив = РК.ПолучитьКолонкиКоллекции(ТаблицаДанных);
	РК.ДобавитьКолонкуКоллекции(ТаблицаДанных, "Данные");
	
	Для Каждого СтрокаДанных Из РК.ПолучитьЭлементыКоллекции(ТаблицаДанных) Цикл
		ПредставлениеТовара = "";
		РК.ДобавитьЗначенияВСтроку(ПредставлениеТовара, СтрокаДанных.Товар.Артикул);
		РК.ДобавитьЗначенияВСтроку(ПредставлениеТовара, СтрокаДанных.Товар);
		
		ПредставлениеТоварныхПолей = "";
		Для Каждого ТоварноеПоле Из ТоварныеПоляМассив Цикл
			Если ТоварноеПоле = "Товар" Тогда
				Значение = ПредставлениеТовара;
			Иначе
				Значение = СтрокаДанных[ТоварноеПоле];
			КонецЕсли;
			
			Если Значение <> Неопределено Тогда
				РК.ДобавитьЗначенияВСтроку(ПредставлениеТоварныхПолей, Значение);
			КонецЕсли;
		КонецЦикла;
		
		Данные = Новый Структура;
		Данные.Вставить("ПредставлениеТовара", ПредставлениеТовара);
		Данные.Вставить("ПредставлениеТоварныхПолей", ПредставлениеТоварныхПолей);
		
		СтрокаДанных.Данные = Данные;
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьСКДИсточникаПредставленийТоварныхПолей() Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	СКД = Справочники.вмс_НастройкиПрограммы.ПолучитьМакет("СКДШаблонаИсточникаПредставленийТоварныхПолей");
	
	НаборДанных = СКД.НаборыДанных[0];
	
	ТоварныеПоля = вмс_ОперацииПоЯчейкамКлиентСерверПовтИсп.ТоварныеПоля();
	
	Для Каждого ТоварноеПоле Из ТоварныеПоля Цикл
		Если НаборДанных.Поля.Найти(ТоварноеПоле) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		Поле.Поле = ТоварноеПоле;
		Поле.ПутьКДанным = ТоварноеПоле;
		Поле.Заголовок = ТоварноеПоле;
	КонецЦикла;
	
	ВыбранныеПоля = СКД.НастройкиПоУмолчанию.Выбор.Элементы;
	Для Каждого ТоварноеПоле Из ТоварныеПоля Цикл
		ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ТоварноеПоле);
		НайденноеПоле = РК.НайтиЭлементКоллекции(ВыбранныеПоля, Новый Структура("Поле", ПолеКомпоновки));
		Если НайденноеПоле <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Поле = ВыбранныеПоля.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		Поле.Использование = Истина;
		Поле.Поле = ПолеКомпоновки;
	КонецЦикла;
	
	Возврат СКД;
	
КонецФункции

Функция ПолучитьЗначенияПредставленийПолейДанныхСКД(знач ТаблицаЗапроса) Экспорт
	
	РК = вмс_РаботаСКоллекциями;

	НастройкаТоварныхПолей = ПолучитьНастройкуТоварныхПолей();
	ТаблицаИспользуемыхТоварныхПолей = РК.СкопироватьКоллекцию(НастройкаТоварныхПолей.ТаблицаПолей, Новый Структура("Использование", Истина));
	РК.ДополнитьКолонкиКоллекции(ТаблицаИспользуемыхТоварныхПолей, "ПредставлениеМассив");
	Для Каждого СтрокаПоля Из РК.ПолучитьЭлементыКоллекции(ТаблицаИспользуемыхТоварныхПолей) Цикл
		СтрокаПоля.ПредставлениеМассив = РК.СтрокуВМассив(СтрокаПоля.Представление);
	КонецЦикла;
	ЭлементыТаблицыИспользуемыхТоварныхПолей = РК.ПолучитьЭлементыКоллекции(ТаблицаИспользуемыхТоварныхПолей);
	
	ТоварныеПоля = вмс_ОперацииПоЯчейкамКлиентСерверПовтИсп.ТоварныеПоля();

	Если РК.ЭтоКвазиТаблицаЗначений(ТаблицаЗапроса) Тогда
		ТаблицаЗапроса = РК.ВыгрузитьКвазиТаблицуЗначенийВИстиннуюТаблицуЗначений(ТаблицаЗапроса);
	КонецЕсли;
	РК.ДополнитьКолонкиКоллекции(ТаблицаЗапроса, ТоварныеПоля);
	
	ДанныеИсточника = ПолучитьДанныеИсточникаПредставленийТоварныхПолей(НастройкаТоварныхПолей, ТаблицаЗапроса);
	
	ПоляПоискаМассив = РК.СкопироватьОбъект(ТоварныеПоля);
	ПоляПоискаМассив = РК.ПересечениеМассивов(ПоляПоискаМассив, РК.ПолучитьКолонкиКоллекции(ДанныеИсточника));
	ПоляПоиска = РК.МассивВСтроку(ПоляПоискаМассив);
	
	ПоляТаблицыДанных = РК.СложениеМассивов(ТоварныеПоля, "Данные");
	ТаблицаДанных = РК.НоваяТаблицаЗначений(ПоляТаблицыДанных);
	
	Поиск = Новый Структура(ПоляПоиска);
	Для Каждого СтрокаЗапроса Из ТаблицаЗапроса Цикл

		ПредставлениеТоварныхПолей = "";
		
		ПредставленияТоварныхПолей = Новый Структура;

		ЗаполнитьЗначенияСвойств(Поиск, СтрокаЗапроса);
		ДанныеИсточникаПоСтрокеЗапросаМассив = ДанныеИсточника.НайтиСтроки(Поиск);
		Если ДанныеИсточникаПоСтрокеЗапросаМассив.Количество() > 0 Тогда
			ДанныеИсточникаПоСтрокеЗапроса = ДанныеИсточникаПоСтрокеЗапросаМассив[0];
			Для Каждого СтрокаПоля Из ЭлементыТаблицыИспользуемыхТоварныхПолей Цикл
				ИмяПоля = СтрокаПоля.Имя;
				ПредставлениеПоля = "";
				Для Каждого ПолеПредставления Из СтрокаПоля.ПредставлениеМассив Цикл
					Значение = ДанныеИсточникаПоСтрокеЗапроса[ПолеПредставления];
					
					Если Не ЗначениеЗаполнено(Значение) И вмс_ОбщегоНазначенияВызовСервера.ЭтоЗначениеСсылочногоТипа(Значение) Тогда
						ПредставлениеЗначения = "-";
					Иначе
						ПредставлениеЗначения = Строка(Значение);
					КонецЕсли;
					
					ПредставлениеПоля = ПредставлениеПоля + ПредставлениеЗначения;
				КонецЦикла;
				ПредставленияТоварныхПолей.Вставить(ИмяПоля, ПредставлениеПоля);
				РК.ДобавитьЗначенияВСтроку(ПредставлениеТоварныхПолей, ПредставлениеПоля);
			КонецЦикла;
		КонецЕсли;
		
		СтрокаДанных = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаЗапроса);

		ДанныеПредставлений = Новый Структура;
		ДанныеПредставлений.Вставить("ПредставленияТоварныхПолей", ПредставленияТоварныхПолей);
		ДанныеПредставлений.Вставить("ПредставлениеТоварныхПолей", ПредставлениеТоварныхПолей);
		СтрокаДанных.Данные = ДанныеПредставлений;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьДанныеИсточникаПредставленийТоварныхПолей(НастройкаТоварныхПолей, ТаблицаЗапроса)

	РК = вмс_РаботаСКоллекциями;

	СКД = вмс_ОбщегоНазначенияКлиентСервер.ПрочитатьТекстОбъектаXDTO(НастройкаТоварныхПолей.СКДИсточникаПредставленийПолей);
	
	ИсточникДоступныхНастроекКомпоновкиДанных = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	
	КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(ИсточникДоступныхНастроекКомпоновкиДанных);
	НастройкиСКД = КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();

	ВнешниеНаборыДанных = Новый Структура("ТаблицаЗапроса", ТаблицаЗапроса);
	РаботаССКД.УстановитьВыбранныеПоляПоДоступнымПолям(НастройкиСКД);
	РаботаССКД.УстановитьНастройкиДляПолученияКоллекцииЗначений(НастройкиСКД);
	ДанныеИсточника = РаботаССКД.ПолучитьДанныеСКД(СКД, НастройкиСКД, ВнешниеНаборыДанных);
	
	Возврат ДанныеИсточника;

КонецФункции

//
//							Товарные поля-
//
////////////////////////////////////////////////////////////////////////
