Функция СоздатьТоварПоклажедателя(ДанныеТовара) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// ТУ_Кошелев 09.01.25 - адаптация конфигураций для получения типа номенклатуры
	ЭтоУТ =  вмс_АдаптацияКонфигураций.ЭтоУТ();  
	ЭтоЕРП = вмс_АдаптацияКонфигураций.ЭтоЕРП();
	ЭтоУНФ = вмс_АдаптацияКонфигураций.ЭтоУНФ();
	УстановитьКатегорию = ЭтоУТ ИЛИ ЭтоУНФ;

	Если ЭтоУТ ИЛИ ЭтоЕРП Тогда
		ВидНоменклатурыТовара = Справочники.ВидыНоменклатуры.ВидНоменклатурыПоУмолчанию();
	ИначеЕсли ЭтоУНФ Тогда
		ВидНоменклатурыТовара = Справочники.КатегорииНоменклатуры.БезКатегории;
	КонецЕсли;    
	
	Если УстановитьКатегорию И ВидНоменклатурыТовара = Неопределено Тогда	
		ВидНоменклатурыТовара = ПолучитьВидНоменулатурыСТипомТовар();
		Если ВидНоменклатурыТовара = Неопределено Тогда
			Возврат Неопределено;			
		КонецЕсли;
	КонецЕсли;  
	
	НовыйТовар = Справочники.Номенклатура.СоздатьЭлемент();    
	НовыйТовар.Заполнить(Неопределено);
	
	НаименованиеТовара = Строка(ДанныеТовара.Контрагент) + "_" + СокрЛП(ДанныеТовара.Товар);  
	НовыйТовар.Наименование = НаименованиеТовара;
	НовыйТовар.НаименованиеПолное = НаименованиеТовара;
	
	// ТУ_Прошин_09.08.24+
	НовыйТовар.Родитель = ПолучитьГруппуТоваровПоклажедателя(ДанныеТовара.Контрагент);  
	// ТУ_Прошин_09.08.24-
	
	Если ЭтоУТ ИЛИ ЭтоЕРП Тогда
		НовыйТовар.ВидНоменклатуры = ВидНоменклатурыТовара;
	ИначеЕсли ЭтоУНФ Тогда
		НовыйТовар.КатегорияНоменклатуры = ВидНоменклатурыТовара;
	КонецЕсли;
	
	Если СтрДлина(СокрЛП(ДанныеТовара.Артикул)) > 0 Тогда
		НовыйТовар.Артикул = ДанныеТовара.Артикул;	
	КонецЕсли;
	//
	Если ЭтоУТ ИЛИ ЭтоЕРП Тогда
		Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(НовыйТовар);
	КонецЕсли;
	//      
	Если НЕ ЗначениеЗаполнено(НовыйТовар.ЕдиницаИзмерения) Тогда
		ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("шт");
		//Если Не ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		//
		//	//ЕдиницаИзмерения = ПолучитьСуществующуюЕдиницуИзмерения(); 	
		//
		//КонецЕсли;
		НовыйТовар.ЕдиницаИзмерения = ЕдиницаИзмерения;	
		
	КонецЕсли;
	//НовыйТовар.ЕдиницаИзмерения = ЕдиницаИзмерения; 
	НовыйТовар.Записать();
	Если СтрДлина(СокрЛП(ДанныеТовара.Штрихкод)) > 0 Тогда
		СоздатьШтрихкодТовара(НовыйТовар.Ссылка, ДанныеТовара.Штрихкод);
	КонецЕсли;
	ЗаписатьДанныеВРегистрТоварыПоклажедателей(НовыйТовар.Ссылка, ДанныеТовара);
	
	ДанныеТовара = ЗаписатьДанныеОТовареВСтруктуру(НовыйТовар);
	
	Возврат ДанныеТовара;
КонецФункции

Функция ЗаписатьДанныеОТовареВСтруктуру(Товар)
	
	ДанныеТовара = Новый Структура();
	ДанныеТовара.Вставить("Номенклатура", Товар.Ссылка);
	
	Возврат ДанныеТовара;
	
КонецФункции

Функция ПолучитьВидНоменулатурыСТипомТовар()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	НЕ ВидыНоменклатуры.ПометкаУдаления
	|	И НЕ ВидыНоменклатуры.ЭтоГруппа
	|	И ВидыНоменклатуры.ТипНоменклатуры = &ТипНоменклатурыТовар";
	
	Запрос.УстановитьПараметр("ТипНоменклатурыТовар", Перечисления.ТипыНоменклатуры.Товар);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.ВидНоменклатуры;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура СоздатьШтрихкодТовара(Товар, Штрихкод)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйШтрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();	
	НовыйШтрихкод.Заполнить(Неопределено);
	НовыйШтрихкод.Штрихкод = Штрихкод;
	НовыйШтрихкод.Номенклатура = Товар;
	НовыйШтрихкод.Записать();
	
КонецПроцедуры

Процедура ЗаписатьДанныеВРегистрТоварыПоклажедателей(Товар, ДанныеТовара)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйТовар = РегистрыСведений.вмс_ТоварыПоклажедателей.СоздатьМенеджерЗаписи();	  
	НовыйТовар.Заполнить(Неопределено);
	НовыйТовар.Товар = Товар;
	НовыйТовар.Контрагент = ДанныеТовара.Контрагент;
	НовыйТовар.Организация = ДанныеТовара.Организация;
	НовыйТовар.Записать();
	
КонецПроцедуры

Функция ПроверитьНаРольПоклажедателя() Экспорт
	ЭтоПоклажедатель = Ложь; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗапросРегистра = РегистрыСведений.вмс_СписокПоклажедателей.СоздатьНаборЗаписей();
	ЗапросРегистра.Заполнить(Неопределено);
	ЗапросРегистра.Отбор.Пользователь.Установить(Пользователи.ТекущийПользователь());
	ЗапросРегистра.Прочитать();
	
	Если ЗапросРегистра.Количество() > 0 И РольДоступна("вмс_Поклажедатель_ПолныеПрава") Тогда
		ЭтоПоклажедатель = Истина;		
	КонецЕсли;
	
	Возврат ЭтоПоклажедатель;
КонецФункции

Функция ПолучитьГруппуТоваровПоклажедателя(Контрагент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование = &Наименование
	|	И Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Наименование", Строка(Контрагент));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();   
		ГруппаКонтрагента = Выборка.Ссылка;
	Иначе
		НоваяГруппа = Справочники.Номенклатура.СоздатьГруппу();
		НоваяГруппа.Наименование = Строка(КОнтрагент);
		НоваяГруппа.Записать(); 
		ГруппаКонтрагента = НоваяГруппа.Ссылка;
	КонецЕсли;  
	
	Возврат ГруппаКонтрагента; 
	
КонецФункции

// ///Новая версия 

// // ТУ_ХабароваВВ++
#Область Настройки_подключения

Функция ПроверитьПодключениеСервер() Экспорт
	
	ДополнительныйПуть = "ping";
	
	Ответ = ВыполнитьЗапросGET(ДополнительныйПуть);//, Ложь);
	
	Если Ответ.КодСостояния = 200 Тогда
		Возврат Ответ.ПолучитьТелоКакСтроку();
	Иначе
		Возврат СтрШаблон("Ошибка проверки соединения, код состояния: %1. Текст: %2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
КонецФункции    

Функция НастройкиПодключения()
	
	НастройкаАдресЛК = вмс_Сервер.ПолучитьНастройкуАдресЛК();
	
	Если ЗначениеЗаполнено(НастройкаАдресЛК) Тогда 
		ЗначениеРеквизита = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(НастройкаАдресЛК,"Значение");
	КонецЕсли;
	
	Адрес = ЗначениеРеквизита;	
	Результат = НовыеНастройкиПодключения();
	Результат.ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	
	АдресБезПротокола = Сред(Адрес, СтрНайти(Адрес, "://") + 3);
	
	Результат.АдресСервера = Лев(АдресБезПротокола, СтрНайти(АдресБезПротокола, "/") - 1);
	Результат.ПутьНаСервере = Сред(АдресБезПротокола, СтрНайти(АдресБезПротокола, "/"));
	
	Возврат Результат;	
	
КонецФункции  

Функция НовыеНастройкиПодключения()
	
	Результат = Новый Структура;
	Результат.Вставить("АдресСервера", "");
	Результат.Вставить("ПутьНаСервере", "");
	Результат.Вставить("ЗащищенноеСоединение", Неопределено);
	
	Возврат Результат	
	
КонецФункции

Функция НовоеСоединение(НастройкиПодключения, Логин = "", Пароль = "")
	
	Возврат Новый HTTPСоединение(
	НастройкиПодключения.АдресСервера,,
	Логин, 
	Пароль,, 
	300, 
	НастройкиПодключения.ЗащищенноеСоединение);
	
КонецФункции 

#КонецОбласти

#Область HTTP_запросы

Функция Токен(НастройкиПодключения)
	
	ШаблонАдреса = "%1/sys/token";
	Адрес = СтрШаблон(ШаблонАдреса, НастройкиПодключения.ПутьНаСервере);
	
	НастройкаИдентификаторЛК = вмс_Сервер.ПолучитьНастройкуИдентификаторПользователяЛК();
	
	Если ЗначениеЗаполнено(НастройкаИдентификаторЛК) Тогда 
		Логин = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(НастройкаИдентификаторЛК,"Значение");
	КонецЕсли;
	
	НастройкаСекретЛК = вмс_Сервер.ПолучитьНастройкуСекретПользователяЛК();
	
	Если ЗначениеЗаполнено(НастройкаСекретЛК) Тогда 
		Пароль = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(НастройкаСекретЛК,"Значение");
	КонецЕсли;
	
	Соединение = НовоеСоединение(НастройкиПодключения, Логин, Пароль);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	ТелоЗапроса = "grant_type=CLIENT_CREDENTIALS";
	
	Запрос = Новый HTTPЗапрос(Адрес, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение СтрШаблон("Ошибка получения токена, код состояния: %1. Текст: %2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
	ДанныеОтвета = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку());
	
	Возврат ДанныеОтвета.id_token;
	
КонецФункции

Функция ВыполнитьЗапросGET(ДополнительныйПуть, ТребуетсяАутентификация = Истина)
	
	НастройкиПодключения = НастройкиПодключения();	
	Соединение = НовоеСоединение(НастройкиПодключения);
	
	ШаблонАдреса = "%1/api/r_s/%2";
	Адрес = СтрШаблон(ШаблонАдреса, НастройкиПодключения.ПутьНаСервере, ДополнительныйПуть);
	
	Токен = Токен(НастройкиПодключения);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));
	
	Запрос = Новый HTTPЗапрос(Адрес, Заголовки);
	
	Возврат Соединение.Получить(Запрос);
	
КонецФункции   

Функция ВыполнитьЗапросPOST(ДополнительныйПуть, Тело) 
	
	НастройкиПодключения = НастройкиПодключения();	
	Соединение = НовоеСоединение(НастройкиПодключения);
	
	ШаблонАдреса = "%1/api/r_s/%2";
	Адрес = СтрШаблон(ШаблонАдреса, НастройкиПодключения.ПутьНаСервере, ДополнительныйПуть);   
	
	Токен = Токен(НастройкиПодключения);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));
	
	Запрос = Новый HTTPЗапрос(Адрес, Заголовки);
	Запрос.УстановитьТелоИзСтроки(Тело); 
	
	Возврат Соединение.ВызватьHTTPМетод("POST", Запрос);
	
КонецФункции

#КонецОбласти  

#Область Работа_с_пользователем

Процедура ОтправитьПоклажедателяНаСервере(ОтправленныеДанные) Экспорт
	
	ДанныеКонтрагент = Новый Массив;                  
	//ДанныеПредставитель = Новый Массив;       
	
	Для каждого Данные Из ОтправленныеДанные Цикл        
		//ОтправленныеДанныеПредставитель = Новый Структура;
		//
		//ОтправленныеДанныеПредставитель.Вставить("Контрагент", Данные.Контрагент);	
		//ОтправленныеДанныеПредставитель.Вставить("Представитель", Данные.Представитель);
		
		ДанныеКонтрагент.Добавить(Данные.Контрагент);
		//ДанныеПредставитель.Добавить(ОтправленныеДанныеПредставитель);
	КонецЦикла;
	
	ДобавитьКонтрагентаВЛК(ДанныеКонтрагент);
	ДобавитьПоклажедателяВЛК(ОтправленныеДанные);
	
КонецПроцедуры 

Процедура ДобавитьКонтрагентаВЛК(КонтрагентМассив)	
	
	ДополнительныйПуть = "partners_in";
	
	Попытка
		ДанныеКонтрагент = Новый Массив;
		
		Для каждого Данные Из КонтрагентМассив Цикл   		
			ДанныеСтруктура = Новый Структура; 
			ДанныеСтруктура.Вставить("Идентификатор", Строка(Данные.УникальныйИдентификатор()));
			ДанныеСтруктура.Вставить("Наименование", Данные.Наименование);
			ДанныеСтруктура.Вставить("ИНН", Строка(Данные.ИНН));
			
			ДанныеКонтрагент.Добавить(ДанныеСтруктура);
		КонецЦикла;
		ТелоЗапроса = ЗаписатьЗначениеJSON(ДанныеКонтрагент);
		
		Ответ = ВыполнитьЗапросPOST(ДополнительныйПуть, ТелоЗапроса);
		
		Если Ответ.КодСостояния <> 200 Тогда    
			ТекстОшибки = СтрШаблон("Ошибка проверки соединения, код состояния: %1. Текст:%2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		
		Возврат;
	КонецПопытки;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Контрагенты успешно отправлены";
	Сообщение.Сообщить();
	
КонецПроцедуры

Процедура ДобавитьПоклажедателяВЛК(ПредставительМассив)
	
	ДополнительныйПуть = "persons_in";
	
	Попытка
		ДанныеПредставитель = Новый Массив;	    
		
		Для каждого Данные Из ПредставительМассив Цикл 
			Наименование = Данные.Представитель.Наименование;
			
			АдресЭлектроннойПочты = Данные.Представитель.Почта;
			Телефон = Данные.Представитель.Телефон;
			
			Отказ = Ложь;
			
			Если Не ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
				ОбщегоНазначения.СообщитьПользователю("У представителя должен быть заполнен адрес электронной почты");  
				Отказ = Истина;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Телефон) Тогда
				ОбщегоНазначения.СообщитьПользователю("У представителя должен быть заполнен телефон");  
				Отказ = Истина;
			КонецЕсли;
			
			Телефон = "+" + СтрЗаменитьПоРегулярномуВыражению(Телефон, "[^0-9]", "");
			
			Если СтрДлина(Телефон) <> 12 Тогда
				ОбщегоНазначения.СообщитьПользователю("Некорректный номер телефона у выбранного представителя");     
				Отказ = Истина;
			КонецЕсли;		
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
			ДанныеСтруктура = Новый Структура;
			ДанныеСтруктура.Вставить("Идентификатор", Строка(Данные.Представитель.УникальныйИдентификатор()));
			ДанныеСтруктура.Вставить("Наименование", Наименование);
			ДанныеСтруктура.Вставить("Контрагент", Строка(Данные.Контрагент.УникальныйИдентификатор()));
			ДанныеСтруктура.Вставить("Телефон", Телефон);
			ДанныеСтруктура.Вставить("АдресЭлектроннойПочты", АдресЭлектроннойПочты);
			ДанныеСтруктура.Вставить("Пароль", Данные.Представитель.ПервичныйПароль);	
			ДанныеСтруктура.Вставить("ИспользованиеХарактеристик", Данные.Представитель.ИспользованиеХарактеристик);	
			
			ДанныеПредставитель.Добавить(ДанныеСтруктура);
		КонецЦикла;
		
		ТелоЗапроса = ЗаписатьЗначениеJSON(ДанныеПредставитель);	
		
		Ответ = ВыполнитьЗапросPOST(ДополнительныйПуть, ТелоЗапроса);
		
		Если Ответ.КодСостояния <> 200 Тогда    
			ТекстОшибки = СтрШаблон("Ошибка проверки соединения, код состояния: %1. Текст:%2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		
		Возврат;
	КонецПопытки;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Поклажедатели успешно отправлены";
	Сообщение.Сообщить();
	
КонецПроцедуры

Процедура РедактироватьПоклажедателяВЛК(МассивРедактируемыхДанных) Экспорт
	
	ДополнительныйПуть = "edit_persons_in";
	
	Попытка
		РедактируемыеДанныеПоклажедатель = Новый Массив;
		
		Для каждого Данные Из МассивРедактируемыхДанных Цикл 
			КонтрагентГУИДСтрока = Строка(Данные.Контрагент.УникальныйИдентификатор());
			КонтрагентНаименование = Данные.Контрагент.Наименование;     
			КонтрагентИНН = Данные.Контрагент.ИНН;
			ИдентификаторГУИДСТрока = Строка(Данные.Представитель.УникальныйИдентификатор());
			Наименование = Данные.Представитель.Наименование;
			ИспользованиеХарактеристик = Данные.Представитель.ИспользованиеХарактеристик;
			
			ДанныеСтруктура = Новый Структура;
			ДанныеСтруктура.Вставить("Идентификатор", ИдентификаторГУИДСТрока);
			ДанныеСтруктура.Вставить("Наименование", Наименование);
			ДанныеСтруктура.Вставить("КонтрагентИдентификатор", КонтрагентГУИДСтрока);          
			ДанныеСтруктура.Вставить("КонтрагентИНН", КонтрагентИНН);
			ДанныеСтруктура.Вставить("КонтрагентНаименование", КонтрагентНаименование);
			ДанныеСтруктура.Вставить("ИспользованиеХарактеристик", ИспользованиеХарактеристик);	
			
			РедактируемыеДанныеПоклажедатель.Добавить(ДанныеСтруктура);
		КонецЦикла;
		
		ТелоЗапроса = ЗаписатьЗначениеJSON(РедактируемыеДанныеПоклажедатель);	
		
		Ответ = ВыполнитьЗапросPOST(ДополнительныйПуть, ТелоЗапроса);
		
		Если Ответ.КодСостояния <> 200 Тогда    
			ТекстОшибки = СтрШаблон("Ошибка проверки соединения, код состояния: %1. Текст:%2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		
		Возврат;
	КонецПопытки;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Поклажедатели успешно отредактированы";
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти

#Область Работа_с_документами

Функция НайтиДокументУчетнойСистемы(ДокПоклажедателя) Экспорт   
	
	НайденныйДок = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_СвязанныеДокументыПоклажедателя.ДокументУчетнойСистемы КАК ДокументУчетнойСистемы
		|ИЗ
		|	РегистрСведений.вмс_СвязанныеДокументыПоклажедателя КАК вмс_СвязанныеДокументыПоклажедателя
		|ГДЕ
		|	вмс_СвязанныеДокументыПоклажедателя.ДокументПоклажедателя = &ДокументПоклажедателя";
		
	Запрос.УстановитьПараметр("ДокументПоклажедателя", ДокПоклажедателя);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НайденныйДок = Выборка.ДокументУчетнойСистемы;
	КонецЕсли;
	
	Возврат НайденныйДок;
	
КонецФункции

Функция НайтиДокументПоклажедателя(ДокУчетнойСистемы) Экспорт   
	
	НайденныйДок = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_СвязанныеДокументыПоклажедателя.ДокументПоклажедателя КАК ДокументПоклажедателя
		|ИЗ
		|	РегистрСведений.вмс_СвязанныеДокументыПоклажедателя КАК вмс_СвязанныеДокументыПоклажедателя
		|ГДЕ
		|	вмс_СвязанныеДокументыПоклажедателя.ДокументУчетнойСистемы = &ДокументУчетнойСистемы";
		
	Запрос.УстановитьПараметр("ДокументПоклажедателя", ДокУчетнойСистемы);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НайденныйДок = Выборка.ДокументПоклажедателя;
	КонецЕсли;
	
	Возврат НайденныйДок;
	
КонецФункции

Процедура ОтправитьОстаткиПоКарточкам() Экспорт
	
	ТекстОшибки = "";
	ДопТекст = "Остатки по карточкам. ";
	
	Попытка
		ДополнительныйПуть = "remains_in";
		
		МассивОстатки = Новый Массив;	    
		МассивМассивовОстаткиПослеРазбиения = Новый Массив;
		МассивДляОбмена = Новый Массив;
		СтруктураДляОбмена = Новый Структура("МассивОстатки, ИндексОбмена");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ОстаткиТоваровПоклажедателяОстатки.Номенклатура КАК Номенклатура,
		|	вмс_ОстаткиТоваровПоклажедателяОстатки.Контрагент КАК Контрагент,
		|	вмс_ОстаткиТоваровПоклажедателяОстатки.Склад КАК Склад,
		|	СУММА(вмс_ОстаткиТоваровПоклажедателяОстатки.КоличествоОстаток) КАК Количество
		|ИЗ
		|	РегистрНакопления.вмс_ОстаткиТоваровПоклажедателя.Остатки КАК вмс_ОстаткиТоваровПоклажедателяОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	вмс_ОстаткиТоваровПоклажедателяОстатки.Номенклатура,
		|	вмс_ОстаткиТоваровПоклажедателяОстатки.Контрагент,
		|	вмс_ОстаткиТоваровПоклажедателяОстатки.Склад";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				КарточкаГУИДСтрока = Строка(Выборка.Номенклатура.УникальныйИдентификатор());
				СкладГУИДСтрока = Строка(Выборка.Склад.УникальныйИдентификатор());
                КонтрагентГУИДСтрока = Строка(Выборка.Контрагент.УникальныйИдентификатор());
                Количество = Выборка.Количество;

				ОстаткиСтруктура = Новый Структура;
				ОстаткиСтруктура.Вставить("Карточка", КарточкаГУИДСтрока);
				ОстаткиСтруктура.Вставить("Склад", СкладГУИДСтрока);
				ОстаткиСтруктура.Вставить("Контрагент", КонтрагентГУИДСтрока);
				ОстаткиСтруктура.Вставить("Количество", Количество);
				
				МассивОстатки.Добавить(ОстаткиСтруктура);
			КонецЦикла;
		КонецЕсли;   

		ИндексОбмена = 0;  
	Исключение
		Если ТекстОшибки = "" Тогда 
			ТекстОшибки = СтрШаблон("%1 %2", ДопТекст, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьВЖурнал("Ошибка", ТекстОшибки);
		Иначе
			ЗаписьВЖурнал("Ошибка", СтрШаблон("%1 %2", ДопТекст, ТекстОшибки));	
		КонецЕсли; 
		
		Возврат;
	КонецПопытки;
	
	Если МассивОстатки.Количество() <> 0 Тогда
		МассивМассивовОстаткиПослеРазбиения = РазбиениеМассива(МассивОстатки, 2000);
		
		Для каждого ЭлементМассива Из МассивМассивовОстаткиПослеРазбиения Цикл
			Попытка
				СтруктураДляОбмена.Вставить("МассивОстатки",ЭлементМассива);     
				СтруктураДляОбмена.Вставить("ИндексОбмена", ИндексОбмена);
				
				МассивДляОбмена.Добавить(СтруктураДляОбмена);
				
				ТелоЗапроса = ЗаписатьЗначениеJSON(МассивДляОбмена);	
				Ответ = ВыполнитьЗапросPOST(ДополнительныйПуть, ТелоЗапроса); 
				
				ИндексОбмена = ИндексОбмена + 1;
				
				Если Ответ.КодСостояния <> 200 Тогда    
					ТекстОшибки = СтрШаблон("Ошибка проверки соединения, код состояния: %1. Текст:%2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
					
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
			Исключение
				Если ТекстОшибки = "" Тогда 
					ТекстОшибки = СтрШаблон("%1 %2", ДопТекст, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьВЖурнал("Ошибка", ТекстОшибки);
				Иначе
					ЗаписьВЖурнал("Ошибка", СтрШаблон("%1 %2", ДопТекст, ТекстОшибки));	
				КонецЕсли;

				ИндексОбмена = ИндексОбмена + 1;

				Продолжить;
			КонецПопытки;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередатьСтатусДокумента(Док, ТипДок) Экспорт
	
	ТекстОшибки = "";  
	ДопТекст = СтрШаблон("Статус документа(%1)", ТипДок);
	ДополнительныйПуть = "status_in";

	Попытка
		ДанныеДокумента = Новый Массив;
		
		ДанныеДокументаСтруктура = Новый Структура; 
		ДанныеДокументаСтруктура.Вставить("ТипДокумента", ТипДок); 
		ДанныеДокументаСтруктура.Вставить("Идентификатор", Строка(Док.УникальныйИдентификатор()));
		ДанныеДокументаСтруктура.Вставить("Статус", Док.Статус.Метаданные().ЗначенияПеречисления.Получить(Перечисления[Док.Статус.Метаданные().Имя].Индекс(Док.Статус)).Имя);	
		ДанныеДокументаСтруктура.Вставить("НомерДокумента", Док.Номер);	
		
		ДанныеДокумента.Добавить(ДанныеДокументаСтруктура);
		
		ТелоЗапроса = ЗаписатьЗначениеJSON(ДанныеДокумента);	
		
		Ответ = ВыполнитьЗапросPOST(ДополнительныйПуть, ТелоЗапроса);
		
		Если Ответ.КодСостояния <> 200 Тогда
        	ТекстОшибки = ДопТекст + СтрШаблон("Ошибка проверки соединения, код состояния: %1. Текст:%2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			ВызватьИсключение ТекстОшибки; 
		КонецЕсли;                   
	Исключение
		Если ТекстОшибки = "" Тогда 
			ТекстОшибки = СтрШаблон("%1 %2", ДопТекст, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьВЖурнал("Ошибка", ТекстОшибки);
		Иначе
			ЗаписьВЖурнал("Ошибка", СтрШаблон("%1 %2", ДопТекст, ТекстОшибки));	
		КонецЕсли;	
	КонецПопытки;
		
КонецПроцедуры

Процедура ВыгрузитьДокПередачаНаХранение() Экспорт

	ТекстОшибки = "";
	ДопТекст = "Выгрузить документы: передача на хранение. ";  
	
	ДополнительныйПуть = "for_storage_out";
	
	Попытка
		Ответ = ВыполнитьЗапросGET(ДополнительныйПуть);
		Если Ответ.КодСостояния <> 200 Тогда
			ТекстОшибки = СтрШаблон("%1 Ошибка проверки соединения, код состояния: %2. Текст:%3", ДопТекст, Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			
			ВызватьИсключение ТекстОшибки; 
		КонецЕсли;
		
		ДанныеОтвета = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку());
	Исключение
		Если ТекстОшибки = "" Тогда 
			ТекстОшибки = СтрШаблон("%1 %2", ДопТекст, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьВЖурнал("Ошибка", ТекстОшибки);
		Иначе
			ЗаписьВЖурнал("Ошибка", СтрШаблон("%1 %2", ДопТекст, ТекстОшибки));	
		КонецЕсли;
		
		Возврат;
	КонецПопытки;
	
	Для Каждого ДанныеДок Из ДанныеОтвета Цикл
		Попытка
			НайденныйДокСсылка = Документы.вмс_ПередачаНаХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеДок.Идентификатор));
			НайденныйДокОбъект = НайденныйДокСсылка.ПолучитьОбъект();
			
			Если НайденныйДокОбъект = Неопределено Тогда
				ДокОбъект = Документы.вмс_ПередачаНаХранение.СоздатьДокумент();	
				ДокОбъект.Заполнить(Неопределено);
				ДокОбъект.УстановитьСсылкуНового(НайденныйДокСсылка);
			Иначе
				ДокОбъект = НайденныйДокОбъект;	
				ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			
			ДвДанныеВнешнийфайл = Base64Значение(ДанныеДок.ВнешнийФайл);
			ДокОбъект.ИмяВнешнегоФайла = ДанныеДок.ИмяВнешнегоФайла;
			ДокОбъект.ВнешнийФайл = Новый ХранилищеЗначения(ДвДанныеВнешнийфайл);

			ДвДанныеФайлДляЗаполнения = Base64Значение(ДанныеДок.ФайлДляЗаполнения);
			ДокОбъект.ИмяФайлаДляЗаполнения = ДанныеДок.ИмяФайлаДляЗаполнения;
			ДокОбъект.ФайлДляЗаполнения = Новый ХранилищеЗначения(ДвДанныеФайлДляЗаполнения);

			ДокОбъект.Статус = Перечисления["вмс_СписокСтатусовДокументовПоклажедателей"][ДанныеДок.Статус]; 
			ДокОбъект.ПометкаУдаления = ДанныеДок.ПометкаУдаления; 
			ДокОбъект.Комментарий = ДанныеДок.Комментарий;
			ДокОбъект.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеДок.Контрагент));
			ДокОбъект.Ответственный = Справочники.вмс_Поклажедатели.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеДок.Представитель));
			ДокОбъект.Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеДок.Склад));

			ДатаСтр = СтрЗаменить(ДанныеДок.Дата, "T", "");
			ДатаСтр = СтрЗаменить(ДатаСтр, "-", "");
			ДатаСтр = СтрЗаменить(ДатаСтр, ":", "");
			Вхождение = СтрНайти(ДатаСтр, ".");

			Если Вхождение <> 0 Тогда
				ПолученнаяДата = Лев(ДатаСтр, Вхождение - 1);	
			Иначе
				ПолученнаяДата = ДатаСтр;
			КонецЕсли;   
			
			ДокОбъект.Дата = Дата(ПолученнаяДата); 
			
			ДокОбъект.Товары.Очистить();
			
			Для Каждого ОписаниеСтроки Из ДанныеДок.МассивТовары Цикл
				НоваяСтрока = ДокОбъект.Товары.Добавить();
				НоваяСтрока.НоменклатураПоклажедателя = Справочники.вмс_КарточкаПоклажедателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ОписаниеСтроки.Карточка));
				НоваяСтрока.КоличествоПлан = ОписаниеСтроки.Количество;	        
				НоваяСтрока.КоличествоФакт = ОписаниеСтроки.Количество;	
				НоваяСтрока.Номенклатура = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.НоменклатураПоклажедателя, "Номенклатура");
				НоваяСтрока.Характеристика = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.НоменклатураПоклажедателя, "Характеристика");
				НоваяСтрока.Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.НоменклатураПоклажедателя, "Упаковка");
			КонецЦикла;      
			
			Если ДокОбъект.ПометкаУдаления Тогда   
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);	
				Исключение
					ТекстОшибки = СтрШаблон("%1 ГУИД: %2, от %3. %4", ДопТекст, ДанныеДок.Идентификатор, ДанныеДок.Дата, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьВЖурнал("Ошибка", ТекстОшибки);
					ТекстОшибки = ""; 
				КонецПопытки;
			Иначе 
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
				Исключение
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
					
					ТекстОшибки = СтрШаблон("%1 ГУИД: %2, от %3. %4", ДопТекст, ДанныеДок.Идентификатор, ДанныеДок.Дата, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьВЖурнал("Ошибка", ТекстОшибки);
					ТекстОшибки = ""; 
				КонецПопытки;
			КонецЕсли;
		Исключение
			ТекстОшибки = СтрШаблон("%1 ГУИД: %2, от %3. %4", ДопТекст, ДанныеДок.Идентификатор, ДанныеДок.Дата, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьВЖурнал("Ошибка", ТекстОшибки);
			ТекстОшибки = "";
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыгрузитьДокВыдачаСХранения() Экспорт

	ТекстОшибки = "";
	ДопТекст = "Выгрузить документы: выдача с хранения. ";  
	
	ДополнительныйПуть = "from_storage_out";
	
	Попытка
		Ответ = ВыполнитьЗапросGET(ДополнительныйПуть);
		Если Ответ.КодСостояния <> 200 Тогда
			ТекстОшибки = СтрШаблон("%1 Ошибка проверки соединения, код состояния: %2. Текст:%3", ДопТекст, Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			
			ВызватьИсключение ТекстОшибки; 
		КонецЕсли;
		
		ДанныеОтвета = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку());
	Исключение
		Если ТекстОшибки = "" Тогда 
			ТекстОшибки = СтрШаблон("%1 %2", ДопТекст, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьВЖурнал("Ошибка", ТекстОшибки);
		Иначе
			ЗаписьВЖурнал("Ошибка", СтрШаблон("%1 %2", ДопТекст, ТекстОшибки));	
		КонецЕсли;
		
		Возврат;
	КонецПопытки;
	
	Для Каждого ДанныеДок Из ДанныеОтвета Цикл
		Попытка
			НайденныйДокСсылка = Документы.вмс_ВыдачаСХранения.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеДок.Идентификатор));
			НайденныйДокОбъект = НайденныйДокСсылка.ПолучитьОбъект();
			
			Если НайденныйДокОбъект = Неопределено Тогда
				ДокОбъект = Документы.вмс_ВыдачаСХранения.СоздатьДокумент();
				ДокОбъект.Заполнить(Неопределено);
				ДокОбъект.УстановитьСсылкуНового(НайденныйДокСсылка);
			Иначе
				ДокОбъект = НайденныйДокОбъект;	 
				ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			
			ДвДанныеВнешнийфайл = Base64Значение(ДанныеДок.ВнешнийФайл);
			ДокОбъект.ИмяВнешнегоФайла = ДанныеДок.ИмяВнешнегоФайла;
			ДокОбъект.ВнешнийФайл = Новый ХранилищеЗначения(ДвДанныеВнешнийфайл);

			ДвДанныеФайлДляЗаполнения = Base64Значение(ДанныеДок.ФайлДляЗаполнения);
			ДокОбъект.ИмяФайлаДляЗаполнения = ДанныеДок.ИмяФайлаДляЗаполнения;
			ДокОбъект.ФайлДляЗаполнения = Новый ХранилищеЗначения(ДвДанныеФайлДляЗаполнения);
			
			ДокОбъект.Статус = Перечисления["вмс_СписокСтатусовДокументовПоклажедателей"][ДанныеДок.Статус]; 
			ДокОбъект.ПометкаУдаления = ДанныеДок.ПометкаУдаления; 
			ДокОбъект.Комментарий = ДанныеДок.Комментарий;
			ДокОбъект.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеДок.Контрагент));
			ДокОбъект.Ответственный = Справочники.вмс_Поклажедатели.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеДок.Представитель));
			ДокОбъект.Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеДок.Склад));

			ДатаСтр = СтрЗаменить(ДанныеДок.Дата, "T", "");
			ДатаСтр = СтрЗаменить(ДатаСтр, "-", "");
			ДатаСтр = СтрЗаменить(ДатаСтр, ":", "");
			Вхождение = СтрНайти(ДатаСтр, ".");

			Если Вхождение <> 0 Тогда
				ПолученнаяДата = Лев(ДатаСтр, Вхождение - 1);	
			Иначе
				ПолученнаяДата = ДатаСтр;
			КонецЕсли;   

			ДокОбъект.Дата = Дата(ПолученнаяДата); 
			
			ДокОбъект.Товары.Очистить();
			
			Для Каждого ОписаниеСтроки Из ДанныеДок.МассивТовары Цикл
				НоваяСтрока = ДокОбъект.Товары.Добавить();
				НоваяСтрока.НоменклатураПоклажедателя = Справочники.вмс_КарточкаПоклажедателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ОписаниеСтроки.Карточка));
				НоваяСтрока.КоличествоПлан = ОписаниеСтроки.Количество;	  
				НоваяСтрока.КоличествоФакт = ОписаниеСтроки.Количество;	 
				НоваяСтрока.Номенклатура = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.НоменклатураПоклажедателя, "Номенклатура");
				НоваяСтрока.Характеристика = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.НоменклатураПоклажедателя, "Характеристика");
				НоваяСтрока.Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.НоменклатураПоклажедателя, "Упаковка");
			КонецЦикла;      
			
        	Если ДокОбъект.ПометкаУдаления Тогда   
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);	
				Исключение
					ТекстОшибки = СтрШаблон("%1 ГУИД: %2, от %3. %4", ДопТекст, ДанныеДок.Идентификатор, ДанныеДок.Дата, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьВЖурнал("Ошибка", ТекстОшибки);
					ТекстОшибки = ""; 
				КонецПопытки;
			Иначе 
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
				Исключение
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
					
					ТекстОшибки = СтрШаблон("%1 ГУИД: %2, от %3. %4", ДопТекст, ДанныеДок.Идентификатор, ДанныеДок.Дата, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьВЖурнал("Ошибка", ТекстОшибки);
					ТекстОшибки = ""; 
				КонецПопытки;
			КонецЕсли;
		Исключение
			ТекстОшибки = СтрШаблон("%1 ГУИД: %2, от %3. %4", ДопТекст, ДанныеДок.Идентификатор, ДанныеДок.Дата, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьВЖурнал("Ошибка", ТекстОшибки);
			ТекстОшибки = "";
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьДокПередачаНаХранение(Док) Экспорт
	
	ТекстОшибки = "";
	ДопТекст = "Отправить документы: передача на хранение. ";

	ДополнительныйПуть = "for_storage_in";
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ПередачаНаХранениеСписокНоменклатуры.НоменклатураПоклажедателя КАК НоменклатураПоклажедателя,
		|	вмс_ПередачаНаХранениеСписокНоменклатуры.КоличествоПлан КАК КоличествоПлан,
		|	вмс_ПередачаНаХранениеСписокНоменклатуры.КоличествоФакт КАК КоличествоФакт
		|ИЗ
		|	Документ.вмс_ПередачаНаХранение.Товары КАК вмс_ПередачаНаХранениеСписокНоменклатуры
		|ГДЕ
		|	вмс_ПередачаНаХранениеСписокНоменклатуры.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		МассивСписокТЧ = Новый Массив;    
		МассивДанных = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			СтруктураСписокТЧ = Новый Структура();
			СтруктураСписокТЧ.Вставить("Карточка", Строка(Выборка.НоменклатураПоклажедателя.УникальныйИдентификатор()));
			СтруктураСписокТЧ.Вставить("КоличествоПлан", Выборка.КоличествоПлан);
			СтруктураСписокТЧ.Вставить("КоличествоФакт", Выборка.КоличествоФакт);       
			
			МассивСписокТЧ.Добавить(СтруктураСписокТЧ);
		КонецЦикла;
		
		СтуктураДанных = Новый Структура;
		СтуктураДанных.Вставить("Идентификатор", Строка(Док.УникальныйИдентификатор()));
		СтуктураДанных.Вставить("Статус", Док.Статус.Метаданные().ЗначенияПеречисления.Получить(Перечисления[Док.Статус.Метаданные().Имя].Индекс(Док.Статус)).Имя);
        СтуктураДанных.Вставить("ЕстьРасхождение", Док.ЕстьРасхождение);
		СтуктураДанных.Вставить("МассивТовары", МассивСписокТЧ);
		
		МассивДанных.Добавить(СтуктураДанных);
		
		ТелоЗапроса = ЗаписатьЗначениеJSON(МассивДанных);	
		Ответ = ВыполнитьЗапросPOST(ДополнительныйПуть, ТелоЗапроса);
		
		Если Ответ.КодСостояния <> 200 Тогда    
			ТекстОшибки = СтрШаблон("Ошибка проверки соединения, код состояния: %1. Текст:%2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Исключение
		Если ТекстОшибки = "" Тогда 
			ТекстОшибки = СтрШаблон("%1 %2", ДопТекст, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьВЖурнал("Ошибка", ТекстОшибки);
		Иначе
			ЗаписьВЖурнал("Ошибка", СтрШаблон("%1 %2", ДопТекст, ТекстОшибки));	
		КонецЕсли;	
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтправитьДокВыдачаСХранения(Док) Экспорт
	
	ТекстОшибки = "";
	ДопТекст = "Отправить документы: выдача с хранения. ";

	ДополнительныйПуть = "from_storage_in";
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_вмс_ВыдачаСХраненияСписокНоменклатуры.НоменклатураПоклажедателя КАК НоменклатураПоклажедателя,
		|	вмс_вмс_ВыдачаСХраненияСписокНоменклатуры.КоличествоПлан КАК КоличествоПлан,
		|	вмс_вмс_ВыдачаСХраненияСписокНоменклатуры.КоличествоФакт КАК КоличествоФакт
		|ИЗ
		|	Документ.вмс_ВыдачаСХранения.Товары КАК вмс_вмс_ВыдачаСХраненияСписокНоменклатуры
		|ГДЕ
		|	вмс_вмс_ВыдачаСХраненияСписокНоменклатуры.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		МассивСписокТЧ = Новый Массив;    
		МассивДанных = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			СтруктураСписокТЧ = Новый Структура();
			СтруктураСписокТЧ.Вставить("Карточка", Строка(Выборка.НоменклатураПоклажедателя.УникальныйИдентификатор()));
			СтруктураСписокТЧ.Вставить("КоличествоПлан", Выборка.КоличествоПлан);
			СтруктураСписокТЧ.Вставить("КоличествоФакт", Выборка.КоличествоФакт);       
			
			МассивСписокТЧ.Добавить(СтруктураСписокТЧ);
		КонецЦикла;
		
		СтуктураДанных = Новый Структура;
		СтуктураДанных.Вставить("Идентификатор", Строка(Док.УникальныйИдентификатор()));
		СтуктураДанных.Вставить("Статус", Док.Статус.Метаданные().ЗначенияПеречисления.Получить(Перечисления[Док.Статус.Метаданные().Имя].Индекс(Док.Статус)).Имя);
        СтуктураДанных.Вставить("ЕстьРасхождение", Док.ЕстьРасхождение);
		СтуктураДанных.Вставить("МассивТовары", МассивСписокТЧ);
		
		МассивДанных.Добавить(СтуктураДанных);

		ТелоЗапроса = ЗаписатьЗначениеJSON(МассивДанных);	
		Ответ = ВыполнитьЗапросPOST(ДополнительныйПуть, ТелоЗапроса);
		
		Если Ответ.КодСостояния <> 200 Тогда    
			ТекстОшибки = СтрШаблон("Ошибка проверки соединения, код состояния: %1. Текст:%2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Исключение
		Если ТекстОшибки = "" Тогда 
			ТекстОшибки = СтрШаблон("%1 %2", ДопТекст, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьВЖурнал("Ошибка", ТекстОшибки);
		Иначе
			ЗаписьВЖурнал("Ошибка", СтрШаблон("%1 %2", ДопТекст, ТекстОшибки));	
		КонецЕсли;	
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыгрузитьДокументыДляЗаполненияПоФайлу() Экспорт
	
	ТекстОшибки = "";
	ДопТекст = "Выгрузить документы для заполнения по файлу. "; 
	
	ДополнительныйПуть = "attached_files_out";

	Попытка
		Ответ = ВыполнитьЗапросGET(ДополнительныйПуть);
		Если Ответ.КодСостояния <> 200 Тогда
			ТекстОшибки = СтрШаблон("%1 Ошибка проверки соединения, код состояния: %2. Текст:%3", ДопТекст, Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			
			ВызватьИсключение ТекстОшибки; 
		КонецЕсли;
		
		ДанныеОтвета = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку());
	Исключение
		Если ТекстОшибки = "" Тогда 
			ТекстОшибки = СтрШаблон("%1 %2", ДопТекст, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьВЖурнал("Ошибка", ТекстОшибки);
		Иначе
			ЗаписьВЖурнал("Ошибка", СтрШаблон("%1 %2", ДопТекст, ТекстОшибки));	
		КонецЕсли;
		
		Возврат;
	КонецПопытки;
	
	МассивЗаполненныхДокументов = Новый Массив;
	
	ПолученныеДанныеОтвета = ДанныеОтвета[0];
	
	МассивЗаполненныхДокументовПередачаНаХранение = ЗаполненныеПоФайлуДокументыПередачаНаХранение(ПолученныеДанныеОтвета.МассивПередачаНаХранение);
	МассивЗаполненныхДокументовВыдачаСХранения = ЗаполненныеПоФайлуДокументыВыдачаСХранения(ПолученныеДанныеОтвета.МассивВыдачаСХранения);
	
	СтруктураЗаполненныхДокументов = Новый Структура();   
	СтруктураЗаполненныхДокументов.Вставить("МассивДокументовПередачаНаХранение", МассивЗаполненныхДокументовПередачаНаХранение);
	СтруктураЗаполненныхДокументов.Вставить("МассивДокументовВыдачаСХранения", МассивЗаполненныхДокументовВыдачаСХранения);

	МассивЗаполненныхДокументов.Добавить(СтруктураЗаполненныхДокументов);
	
	ДополнительныйПуть = "fill_documents_in";
	
	ТекстОшибки = "";
	ДопТекст = "Заполнить документы по файлу. ";
	
	Попытка
		ТелоЗапроса = ЗаписатьЗначениеJSON(МассивЗаполненныхДокументов);	
		Ответ = ВыполнитьЗапросPOST(ДополнительныйПуть, ТелоЗапроса); 
		
		Если Ответ.КодСостояния <> 200 Тогда
			ТекстОшибки = ДопТекст + СтрШаблон("Ошибка проверки соединения, код состояния: %1. Текст:%2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			ВызватьИсключение ТекстОшибки; 				
		КонецЕсли;
	Исключение
		Если ТекстОшибки = "" Тогда 
			ТекстОшибки = СтрШаблон("%1 %2", ДопТекст, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьВЖурнал("Ошибка", ТекстОшибки);
		Иначе
			ЗаписьВЖурнал("Ошибка", СтрШаблон("%1 %2", ДопТекст, ТекстОшибки));	
		КонецЕсли;
		
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Функция ЗаполненныеПоФайлуДокументыПередачаНаХранение(МассивДокументов)
	
	ДопТекст = "Заполнение документа передача на хранение. ";

	МассивЗаполненныеДокументы = Новый Массив();

	Для каждого СтрокаМассиваДокументов Из МассивДокументов Цикл  
		ТекстОшибки = "";
		ЕстьОшибка = Ложь;                       
		МассивЗаполненнаяТЧ = Новый Массив();

		Попытка
			ДвДанные = Base64Значение(СтрокаМассиваДокументов.ФайлДляЗаполнения);
			Вхождение = СтрНайти(СтрокаМассиваДокументов.ИмяФайлаДляЗаполнения, ".", НаправлениеПоиска.СКонца);
			Расширение = НРег(Сред(СтрокаМассиваДокументов.ИмяФайлаДляЗаполнения, Вхождение));
			
			Если Расширение = ".xls" ИЛИ Расширение = ".xlsx" Тогда
				ДанныеВХ = ДвДанные;
				ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла(Расширение);
				ДанныеВХ.Записать(ПутьКФайлуНаСервере);
				
				ТабДок = Новый ТабличныйДокумент;
				
				Попытка
					ТабДок.Прочитать(ПутьКФайлуНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Текст);	
				Исключение
					ТекстОшибки = ДопТекст + СтрШаблон("В документе %1 не удалось прочитать файл %2", СтрокаМассиваДокументов.Идентификатор, СтрокаМассиваДокументов.ИмяФайлаДляЗаполнения);
				КонецПопытки;
				
				Если ТекстОшибки <> ""  Тогда
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
								
				КоличествоСтрок = ТабДок.ВысотаТаблицы;
				КоличествоКолонок = ТабДок.ШиринаТаблицы;   
				
				ТабЗначений = Новый ТаблицаЗначений;
				ТабЗначений.Колонки.Добавить("Штрихкод");
				ТабЗначений.Колонки.Добавить("Артикул");
				ТабЗначений.Колонки.Добавить("Карточка");     
				ТабЗначений.Колонки.Добавить("Характеристика");    
				ТабЗначений.Колонки.Добавить("Упаковка");    
				ТабЗначений.Колонки.Добавить("Количество");    
				
				Для НомерСтроки = 1 По КоличествоСтрок Цикл	
					Если НомерСтроки = 1 Тогда  
						Если НЕ ПроверкаШапкиФайлаЗаполнения(ТабДок) Тогда
							ТекстОшибки = ДопТекст + СтрШаблон("В документе %1 в файле %2 не совпадают названия колонок с шаблоном", СтрокаМассиваДокументов.Идентификатор, СтрокаМассиваДокументов.ИмяФайлаДляЗаполнения);
							
							ВызватьИсключение ТекстОшибки; 						
						КонецЕсли;
						
						Продолжить;			
					КонецЕсли; 
					
					СтрокаТЗ = ТабЗначений.Добавить();
					СтрокаТЗ.Штрихкод = ТабДок.Область(НомерСтроки, 1).Текст;
					СтрокаТЗ.Артикул = ТабДок.Область(НомерСтроки, 2).Текст;
					СтрокаТЗ.Карточка = ТабДок.Область(НомерСтроки, 3).Текст;
					СтрокаТЗ.Характеристика = ТабДок.Область(НомерСтроки, 4).Текст;      
					СтрокаТЗ.Упаковка = ТабДок.Область(НомерСтроки, 5).Текст;
					СтрокаТЗ.Количество = ТабДок.Область(НомерСтроки, 6).Текст;
				КонецЦикла;
				
				НайденныйКонтрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаМассиваДокументов.Контрагент));
				
				Для каждого СтрокаПолученнойТЗ Из ТабЗначений Цикл  
					КарточкаСсылка = Справочники.вмс_КарточкаПоклажедателя.ПустаяСсылка();
					
					ДанныеСтрокиТЗ = Новый Структура(); 
					
					ДанныеСтрокиТЗ.Вставить("Штрихкод", ОбработатьТекст(СтрокаПолученнойТЗ.Штрихкод)); 
					ДанныеСтрокиТЗ.Вставить("Артикул", ОбработатьТекст(СтрокаПолученнойТЗ.Артикул));
					ДанныеСтрокиТЗ.Вставить("Карточка", ОбработатьТекст(СтрокаПолученнойТЗ.Карточка));
					ДанныеСтрокиТЗ.Вставить("Характеристика", ОбработатьТекст(СтрокаПолученнойТЗ.Характеристика));
					ДанныеСтрокиТЗ.Вставить("Упаковка", ОбработатьТекст(СтрокаПолученнойТЗ.Упаковка));
					ДанныеСтрокиТЗ.Вставить("Количество", ОбработатьТекст(СтрокаПолученнойТЗ.Количество));
					
					ПроверкаКолонок = СтруктураПроверокЗаполненияКолонок(ДанныеСтрокиТЗ);     
					
					Если ПроверкаКолонок.Количество Тогда
						ПроверкаКолонок.Вставить("Количество", Число(ДанныеСтрокиТЗ.Количество));
					Иначе
						ПроверкаКолонок.Вставить("Количество", 0);
					КонецЕсли;     
					
					ДанныеСтрокиТЗ.Вставить("Количество", ПроверкаКолонок.Количество);
					
					Если ПроверкаКолонок.Штрихкод = Ложь И ПроверкаКолонок.Артикул = Ложь И ПроверкаКолонок.Карточка = Ложь Тогда
						Прервать;	
					КонецЕсли;
					
					РезультатПоискаКарточки = ПоискКарточкиПоклажедателя(НайденныйКонтрагент, ДанныеСтрокиТЗ);    
					
					Если РезультатПоискаКарточки.КарточкаНайдена = Ложь Тогда 
						Если ПроверкаКолонок.Упаковка И ПроверкаКолонок.Карточка Тогда   
							РезультатСоздания = СоздатьКарточкуПоклажедателя(НайденныйКонтрагент, ДанныеСтрокиТЗ);    
							
							Если РезультатСоздания.УспешноеСоздание Тогда
								КарточкаСсылка = РезультатСоздания.Ссылка;    
								ДанныеЗаполненияТЧ = СтруктураНайденнаяКарточка(ДанныеСтрокиТЗ, КарточкаСсылка, РезультатПоискаКарточки.КомментарийКПоиску + " " + "Создана новая карточка");
							Иначе
								ДанныеЗаполненияТЧ = СтруктураНайденнаяКарточка(ДанныеСтрокиТЗ, КарточкаСсылка, РезультатПоискаКарточки.КомментарийКПоиску + " " + "Не удалось создать карточку");	
							КонецЕсли;							
						Иначе
							ДанныеЗаполненияТЧ = СтруктураНайденнаяКарточка(ДанныеСтрокиТЗ, КарточкаСсылка, РезультатПоискаКарточки.КомментарийКПоиску + " " + "Не удалось создать карточку. Отсутствуют данные обязательные для заполнения.");
						КонецЕсли;
					Иначе	
						Если РезультатПоискаКарточки.НайденоНесколько Тогда
							ДанныеЗаполненияТЧ = СтруктураНайденнаяКарточка(ДанныеСтрокиТЗ, КарточкаСсылка, РезультатПоискаКарточки.КомментарийКПоиску);
						Иначе    
							КарточкаСсылка = РезультатПоискаКарточки.КарточкаСсылка;
							ДанныеЗаполненияТЧ = СтруктураНайденнаяКарточка(ДанныеСтрокиТЗ, КарточкаСсылка, РезультатПоискаКарточки.КомментарийКПоиску);
						КонецЕсли;
					КонецЕсли;
					
					МассивЗаполненнаяТЧ.Добавить(ДанныеЗаполненияТЧ);
				КонецЦикла;	
			Иначе
				ЗаписьВЖурнал("Ошибка", СтрШаблон("В документе %1 файл для заполнения %2 не является таблицей", СтрокаМассиваДокументов.Идентификатор, СтрокаМассиваДокументов.ИмяФайлаДляЗаполнения));
				
				ЕстьОшибка = Истина;
			КонецЕсли;	
		Исключение
			Если ТекстОшибки = "" Тогда 
				ТекстОшибки = СтрШаблон("%1 %2", ДопТекст, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьВЖурнал("Ошибка", ТекстОшибки);
			Иначе
				ЗаписьВЖурнал("Ошибка", СтрШаблон("%1 %2", ДопТекст, ТекстОшибки));	
			КонецЕсли;   
			
			ЕстьОшибка = Истина;
		КонецПопытки;
		
		СтруктураЗаполненныйДокумент = Новый Структура();
		СтруктураЗаполненныйДокумент.Вставить("Идентификатор", СтрокаМассиваДокументов.Идентификатор);
		СтруктураЗаполненныйДокумент.Вставить("Контрагент", СтрокаМассиваДокументов.Контрагент);
		СтруктураЗаполненныйДокумент.Вставить("ЕстьОшибка", ЕстьОшибка);
		СтруктураЗаполненныйДокумент.Вставить("ЗаполненнаяТаблица", МассивЗаполненнаяТЧ);

        МассивЗаполненныеДокументы.Добавить(СтруктураЗаполненныйДокумент);     
	КонецЦикла;	  
	
	Возврат МассивЗаполненныеДокументы;
	
КонецФункции

Функция ЗаполненныеПоФайлуДокументыВыдачаСХранения(МассивДокументов)
	
	ДопТекст = "Заполнение документа выдача с хранения. ";

	МассивЗаполненныеДокументы = Новый Массив();

	Для каждого СтрокаМассиваДокументов Из МассивДокументов Цикл  
		ТекстОшибки = "";
		ЕстьОшибка = Ложь;                       
		МассивЗаполненнаяТЧ = Новый Массив();

		Попытка
			ДвДанные = Base64Значение(СтрокаМассиваДокументов.ФайлДляЗаполнения);
			Вхождение = СтрНайти(СтрокаМассиваДокументов.ИмяФайлаДляЗаполнения, ".", НаправлениеПоиска.СКонца);
			Расширение = НРег(Сред(СтрокаМассиваДокументов.ИмяФайлаДляЗаполнения, Вхождение));
			
			Если Расширение = ".xls" ИЛИ Расширение = ".xlsx" Тогда
				ДанныеВХ = ДвДанные;
				ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла(Расширение);
				ДанныеВХ.Записать(ПутьКФайлуНаСервере);
				
				ТабДок = Новый ТабличныйДокумент;
				
				Попытка
					ТабДок.Прочитать(ПутьКФайлуНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Текст);	
				Исключение
					ТекстОшибки = ДопТекст + СтрШаблон("В документе %1 не удалось прочитать файл %2", СтрокаМассиваДокументов.Идентификатор, СтрокаМассиваДокументов.ИмяФайлаДляЗаполнения);
				КонецПопытки;
				
				Если ТекстОшибки <> ""  Тогда
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
								
				КоличествоСтрок = ТабДок.ВысотаТаблицы;
				КоличествоКолонок = ТабДок.ШиринаТаблицы;   
				
				ТабЗначений = Новый ТаблицаЗначений;
				ТабЗначений.Колонки.Добавить("Штрихкод");
				ТабЗначений.Колонки.Добавить("Артикул");
				ТабЗначений.Колонки.Добавить("Карточка");     
				ТабЗначений.Колонки.Добавить("Характеристика");    
				ТабЗначений.Колонки.Добавить("Упаковка");    
				ТабЗначений.Колонки.Добавить("Количество");    
				
				Для НомерСтроки = 1 По КоличествоСтрок Цикл	
					Если НомерСтроки = 1 Тогда  
						Если НЕ ПроверкаШапкиФайлаЗаполнения(ТабДок) Тогда
							ТекстОшибки = ДопТекст + СтрШаблон("В документе %1 в файле %2 не совпадают названия колонок с шаблоном", СтрокаМассиваДокументов.Идентификатор, СтрокаМассиваДокументов.ИмяФайлаДляЗаполнения);
							
							ВызватьИсключение ТекстОшибки; 						
						КонецЕсли;
						
						Продолжить;			
					КонецЕсли; 
					
					СтрокаТЗ = ТабЗначений.Добавить();
					СтрокаТЗ.Штрихкод = ТабДок.Область(НомерСтроки, 1).Текст;
					СтрокаТЗ.Артикул = ТабДок.Область(НомерСтроки, 2).Текст;
					СтрокаТЗ.Карточка = ТабДок.Область(НомерСтроки, 3).Текст;
					СтрокаТЗ.Характеристика = ТабДок.Область(НомерСтроки, 4).Текст;      
					СтрокаТЗ.Упаковка = ТабДок.Область(НомерСтроки, 5).Текст;
					СтрокаТЗ.Количество = ТабДок.Область(НомерСтроки, 6).Текст;
				КонецЦикла;
				
				НайденныйКонтрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаМассиваДокументов.Контрагент));
				
				Для каждого СтрокаПолученнойТЗ Из ТабЗначений Цикл  
					КарточкаСсылка = Справочники.вмс_КарточкаПоклажедателя.ПустаяСсылка();
					
					ДанныеСтрокиТЗ = Новый Структура(); 
					
					ДанныеСтрокиТЗ.Вставить("Штрихкод", ОбработатьТекст(СтрокаПолученнойТЗ.Штрихкод)); 
					ДанныеСтрокиТЗ.Вставить("Артикул", ОбработатьТекст(СтрокаПолученнойТЗ.Артикул));
					ДанныеСтрокиТЗ.Вставить("Карточка", ОбработатьТекст(СтрокаПолученнойТЗ.Карточка));
					ДанныеСтрокиТЗ.Вставить("Характеристика", ОбработатьТекст(СтрокаПолученнойТЗ.Характеристика));
					ДанныеСтрокиТЗ.Вставить("Упаковка", ОбработатьТекст(СтрокаПолученнойТЗ.Упаковка));
					ДанныеСтрокиТЗ.Вставить("Количество", ОбработатьТекст(СтрокаПолученнойТЗ.Количество));
					
					ПроверкаКолонок = СтруктураПроверокЗаполненияКолонок(ДанныеСтрокиТЗ);     
					
					Если ПроверкаКолонок.Количество Тогда
						ПроверкаКолонок.Вставить("Количество", Число(ДанныеСтрокиТЗ.Количество));
					Иначе
						ПроверкаКолонок.Вставить("Количество", 0);
					КонецЕсли;     
					
					ДанныеСтрокиТЗ.Вставить("Количество", ПроверкаКолонок.Количество);
					
					Если ПроверкаКолонок.Штрихкод = Ложь И ПроверкаКолонок.Артикул = Ложь И ПроверкаКолонок.Карточка = Ложь Тогда
						Прервать;	
					КонецЕсли;
					
					РезультатПоискаКарточки = ПоискКарточкиПоклажедателя(НайденныйКонтрагент, ДанныеСтрокиТЗ);    
					
					Если РезультатПоискаКарточки.КарточкаНайдена = Ложь Тогда 
						Если ПроверкаКолонок.Упаковка И ПроверкаКолонок.Карточка Тогда   
							РезультатСоздания = СоздатьКарточкуПоклажедателя(НайденныйКонтрагент, ДанныеСтрокиТЗ);    
							
							Если РезультатСоздания.УспешноеСоздание Тогда
								КарточкаСсылка = РезультатСоздания.Ссылка;    
								ДанныеЗаполненияТЧ = СтруктураНайденнаяКарточка(ДанныеСтрокиТЗ, КарточкаСсылка, РезультатПоискаКарточки.КомментарийКПоиску + " " + "Создана новая карточка");
							Иначе
								ДанныеЗаполненияТЧ = СтруктураНайденнаяКарточка(ДанныеСтрокиТЗ, КарточкаСсылка, РезультатПоискаКарточки.КомментарийКПоиску + " " + "Не удалось создать карточку");	
							КонецЕсли;							
						Иначе
							ДанныеЗаполненияТЧ = СтруктураНайденнаяКарточка(ДанныеСтрокиТЗ, КарточкаСсылка, РезультатПоискаКарточки.КомментарийКПоиску + " " + "Не удалось создать карточку. Отсутствуют данные обязательные для заполнения.");
						КонецЕсли;
					Иначе	
						Если РезультатПоискаКарточки.НайденоНесколько Тогда
							ДанныеЗаполненияТЧ = СтруктураНайденнаяКарточка(ДанныеСтрокиТЗ, КарточкаСсылка, РезультатПоискаКарточки.КомментарийКПоиску);
						Иначе    
							КарточкаСсылка = РезультатПоискаКарточки.КарточкаСсылка;
							ДанныеЗаполненияТЧ = СтруктураНайденнаяКарточка(ДанныеСтрокиТЗ, КарточкаСсылка, РезультатПоискаКарточки.КомментарийКПоиску);
						КонецЕсли;
					КонецЕсли;
					
					МассивЗаполненнаяТЧ.Добавить(ДанныеЗаполненияТЧ);
				КонецЦикла;	
			Иначе
				ЗаписьВЖурнал("Ошибка", СтрШаблон("В документе %1 файл для заполнения %2 не является таблицей", СтрокаМассиваДокументов.Идентификатор, СтрокаМассиваДокументов.ИмяФайлаДляЗаполнения));
				
				ЕстьОшибка = Истина;
			КонецЕсли;	
		Исключение
			Если ТекстОшибки = "" Тогда 
				ТекстОшибки = СтрШаблон("%1 %2", ДопТекст, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьВЖурнал("Ошибка", ТекстОшибки);
			Иначе
				ЗаписьВЖурнал("Ошибка", СтрШаблон("%1 %2", ДопТекст, ТекстОшибки));	
			КонецЕсли;   
			
			ЕстьОшибка = Истина;
		КонецПопытки;
		
		СтруктураЗаполненныйДокумент = Новый Структура();
		СтруктураЗаполненныйДокумент.Вставить("Идентификатор", СтрокаМассиваДокументов.Идентификатор);
		СтруктураЗаполненныйДокумент.Вставить("Контрагент", СтрокаМассиваДокументов.Контрагент);
		СтруктураЗаполненныйДокумент.Вставить("ЕстьОшибка", ЕстьОшибка);
		СтруктураЗаполненныйДокумент.Вставить("ЗаполненнаяТаблица", МассивЗаполненнаяТЧ);

        МассивЗаполненныеДокументы.Добавить(СтруктураЗаполненныйДокумент);     
	КонецЦикла;	  
	
	Возврат МассивЗаполненныеДокументы;		
КонецФункции

#КонецОбласти   

#Область Работа_со_справочниками

Процедура ОтправитьСклады(ОтправленныеДанные) Экспорт

	ДополнительныйПуть = "warehouse_in";

	Попытка
		МассивСклад = Новый Массив;	    
		
		Для каждого ЭлементМассива Из ОтправленныеДанные Цикл
			Наименование = ЭлементМассива.Наименование;
			СсылкаГУИДСтрока = Строка(ЭлементМассива.УникальныйИдентификатор());
			
			СкладСтруктура = Новый Структура;
			СкладСтруктура.Вставить("Идентификатор", СсылкаГУИДСтрока);
			СкладСтруктура.Вставить("Наименование", Наименование);
			СкладСтруктура.Вставить("ПометкаУдаления", ЭлементМассива.ПометкаУдаления);

			МассивСклад.Добавить(СкладСтруктура);
		КонецЦикла;
		
		ТелоЗапроса = ЗаписатьЗначениеJSON(МассивСклад);	
		Ответ = ВыполнитьЗапросPOST(ДополнительныйПуть, ТелоЗапроса);
		
		Если Ответ.КодСостояния <> 200 Тогда    
			ТекстОшибки = СтрШаблон("Ошибка проверки соединения, код состояния: %1. Текст:%2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());

			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Исключение
    	Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		
		Возврат;
	КонецПопытки;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Склады успешно отправлены";
	Сообщение.Сообщить();
	
КонецПроцедуры 

Процедура ПолучитьКарточки() Экспорт

	ТекстОшибки = "";
	ДопТекст = "Получить карточки. ";	
	
	ДополнительныйПуть = "goods_out";
		
	Попытка
		Ответ = ВыполнитьЗапросGET(ДополнительныйПуть);

		Если Ответ.КодСостояния <> 200 Тогда
        	ТекстОшибки = СтрШаблон("%1 Ошибка проверки соединения, код состояния: %2. Текст:%3", ДопТекст, Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			
			ВызватьИсключение ТекстОшибки; 
		КонецЕсли;
		
		ДанныеОтвета = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку());
	Исключение
		Если ТекстОшибки = "" Тогда 
			ТекстОшибки = СтрШаблон("%1 %2", ДопТекст, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьВЖурнал("Ошибка", ТекстОшибки);
		Иначе
			ЗаписьВЖурнал("Ошибка", СтрШаблон("%1 %2", ДопТекст, ТекстОшибки));	
		КонецЕсли;
		
		Возврат;
	КонецПопытки;
		
	Если ДанныеОтвета.МассивГруппа.Количество() <> 0 Тогда
		Для каждого Группа Из ДанныеОтвета.МассивГруппа Цикл  
			Попытка
				НайденнаяГруппаСсылка = Справочники.вмс_КарточкаПоклажедателя.ПолучитьСсылку(Новый УникальныйИдентификатор(Группа.Идентификатор));
				НайденныйКонтрагентГруппы = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Группа.Контрагент));
				
				НайденнаяГруппаОбъект = НайденнаяГруппаСсылка.ПолучитьОбъект();
				
				Если НайденнаяГруппаОбъект = Неопределено Тогда
                	ГруппаОбъект = Справочники.вмс_КарточкаПоклажедателя.СоздатьГруппу(); 
					ГруппаОбъект.Заполнить(Неопределено);
					ГруппаОбъект.УстановитьСсылкуНового(НайденнаяГруппаСсылка);
				Иначе
					ГруппаОбъект = НайденнаяГруппаОбъект;
				КонецЕсли;     
				
				ГруппаОбъект.Родитель = Справочники.вмс_КарточкаПоклажедателя.НайтиПоНаименованию(НайденныйКонтрагентГруппы);    
				ГруппаОбъект.Наименование = Группа.Наименование;   
				ГруппаОбъект.ПометкаУдаления = Группа.ПометкаУдаления;
				
				ГруппаОбъект.Записать();   
			Исключение
				ТекстОшибки = СтрШаблон("%1 Массив групп. ГУИД: %2, Наименование %3. %4", ДопТекст, Группа.Идентификатор, Группа.Наименование, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьВЖурнал("Ошибка", ТекстОшибки);
				ТекстОшибки = "";
			КонецПопытки;	 
		КонецЦикла;
	КонецЕсли;
	
	ПодгруппыБезРодителя = Новый Массив;

	Если ДанныеОтвета.МассивПодгруппа.Количество() <> 0 Тогда
		Для каждого Подгруппа Из ДанныеОтвета.МассивПодгруппа Цикл 
			Попытка
				НайденнаяПодгруппаСсылка = Справочники.вмс_КарточкаПоклажедателя.ПолучитьСсылку(Новый УникальныйИдентификатор(Подгруппа.Идентификатор));
				НайденнаяПодгруппаОбъект = НайденнаяПодгруппаСсылка.ПолучитьОбъект();
				
				ПодгруппаРодительСсылка = Справочники.вмс_КарточкаПоклажедателя.ПолучитьСсылку(Новый УникальныйИдентификатор(Подгруппа.Родитель));
				
				Если ПодгруппаРодительСсылка.ПолучитьОбъект() = Неопределено Тогда
					ДанныеПодгруппы = Новый Структура;
					ДанныеПодгруппы.Вставить("Ссылка", Подгруппа.Идентификатор);  
					ДанныеПодгруппы.Вставить("Наименование", Подгруппа.Наименование); 
					ДанныеПодгруппы.Вставить("ПометкаУдаления", Подгруппа.ПометкаУдаления); 
					ДанныеПодгруппы.Вставить("Родитель", Подгруппа.Родитель);
					
					ПодгруппыБезРодителя.Добавить(ДанныеПодгруппы);    
					
					Продолжить;
				КонецЕсли;

				Если НайденнаяПодгруппаОбъект = Неопределено Тогда 
					ПодгруппаОбъект = Справочники.вмс_КарточкаПоклажедателя.СоздатьГруппу();
					ПодгруппаОбъект.Заполнить(Неопределено);
					ПодгруппаОбъект.УстановитьСсылкуНового(НайденнаяПодгруппаСсылка);
				Иначе
					ПодгруппаОбъект = НайденнаяПодгруппаОбъект;
				КонецЕсли;
				
				ПодгруппаОбъект.Наименование = Подгруппа.Наименование;     
				ПодгруппаОбъект.Родитель = ПодгруппаРодительСсылка;  
				ПодгруппаОбъект.ПометкаУдаления = Подгруппа.ПометкаУдаления;
				
				ПодгруппаОбъект.Записать();
			Исключение
				ТекстОшибки = СтрШаблон("%1 Массив подгрупп. ГУИД: %2, Наименование %3. %4", ДопТекст, Подгруппа.Идентификатор, Подгруппа.Наименование, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьВЖурнал("Ошибка", ТекстОшибки);
				ТекстОшибки = "";
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Если ПодгруппыБезРодителя.Количество() <> 0 Тогда
		Для каждого ПодгруппаБезРодителя Из ПодгруппыБезРодителя Цикл   
			Попытка
				НайденнаяПодгруппаБезРодителяСсылка = Справочники.вмс_КарточкаПоклажедателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ПодгруппаБезРодителя.Идентификатор));
				НайденнаяПодгруппаБезРодителяОбъект = НайденнаяПодгруппаБезРодителяСсылка.ПолучитьОбъект();   
				
				Если НайденнаяПодгруппаБезРодителяОбъект = Неопределено Тогда 
					ПодгруппаБезРодителяОбъект = Справочники.вмс_КарточкаПоклажедателя.СоздатьГруппу(); 
					ПодгруппаБезРодителяОбъект.УстановитьСсылкуНового(НайденнаяПодгруппаСсылка); 
				Иначе
					ПодгруппаБезРодителяОбъект = НайденнаяПодгруппаБезРодителяОбъект;
				КонецЕсли;
				
				ПодгруппаБезРодителяОбъект.Родитель = Справочники.вмс_КарточкаПоклажедателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ПодгруппаБезРодителя.Родитель)); 
				ПодгруппаБезРодителяОбъект.Наименование = ПодгруппаБезРодителя.Наименование;
				ПодгруппаБезРодителяОбъект.ПометкаУдаления = ПодгруппаБезРодителя.ПометкаУдаления;   
				
				ПодгруппаБезРодителяОбъект.Записать();
			Исключение
				ТекстОшибки = СтрШаблон("%1 Массив подгрупп без родителя. ГУИД: %2, Наименование %3. %4", ДопТекст, ПодгруппаБезРодителя.Идентификатор, ПодгруппаБезРодителя.Наименование, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьВЖурнал("Ошибка", ТекстОшибки);
				ТекстОшибки = "";
			КонецПопытки;
		КонецЦикла; 
	КонецЕсли;   
	
	Если ДанныеОтвета.МассивКарточка.Количество() <> 0 Тогда
		Для каждого Карточка Из ДанныеОтвета.МассивКарточка Цикл 
			Попытка
				НайденнаяКарточкаСсылка = Справочники.вмс_КарточкаПоклажедателя.ПолучитьСсылку(Новый УникальныйИдентификатор(Карточка.Идентификатор));
				НайденныйКонтрагентКарточки = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Карточка.Контрагент));
				НайденнаяКарточкаОбъект = НайденнаяКарточкаСсылка.ПолучитьОбъект();
				
				Если НайденнаяКарточкаОбъект = Неопределено Тогда
					КарточкаОбъект = Справочники.вмс_КарточкаПоклажедателя.СоздатьЭлемент(); 
					КарточкаОбъект.Заполнить(Неопределено);
					КарточкаОбъект.УстановитьСсылкуНового(НайденнаяКарточкаСсылка); 
				Иначе
					КарточкаОбъект = НайденнаяКарточкаОбъект; 
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Карточка.Родитель) Тогда
					КарточкаОбъект.Родитель = Справочники.вмс_КарточкаПоклажедателя.ПолучитьСсылку(Новый УникальныйИдентификатор(Карточка.Родитель));
				Иначе
					КарточкаОбъект.Родитель = Справочники.вмс_КарточкаПоклажедателя.НайтиПоНаименованию(НайденныйКонтрагентКарточки);
				КонецЕсли;  
				
				КарточкаОбъект.Контрагент = НайденныйКонтрагентКарточки;
				КарточкаОбъект.Наименование = Карточка.Наименование;
				КарточкаОбъект.Штрихкод = Карточка.Штрихкод;
				КарточкаОбъект.Артикул = Карточка.Артикул;
				КарточкаОбъект.УпаковкаПоклажедателя = Карточка.Упаковка;        
				КарточкаОбъект.БезХарактеристики = Карточка.БезХарактеристики;
				КарточкаОбъект.ПометкаУдаления = Карточка.ПометкаУдаления;
				
				Если ПроверкаИспользованияХарактеристикПоКонтрагенту(НайденныйКонтрагентКарточки) Тогда
					Если НЕ Карточка.БезХарактеристики Тогда
						КарточкаОбъект.ХарактеристикаПоклажедателя = Карточка.Характеристика;
					КонецЕсли;  
				КонецЕсли;  
				
				КарточкаОбъект.Записать();
			Исключение
				ТекстОшибки = СтрШаблон("%1 Массив карточек. ГУИД: %2, Наименование %3. %4", ДопТекст, Карточка.Идентификатор, Карточка.Наименование, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьВЖурнал("Ошибка", ТекстОшибки);
				ТекстОшибки = "";
			КонецПопытки;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры 

Функция СоздатьКарточкуПоклажедателя(Контрагент, СтруктураДанных)
	
	СтруктураВозврата = Новый Структура("УспешноеСоздание, Ссылка", Ложь, Справочники.вмс_КарточкаПоклажедателя.ПустаяСсылка());
	
	Попытка
		КарточкаОбъект = Справочники.вмс_КарточкаПоклажедателя.СоздатьЭлемент(); 
		КарточкаОбъект.Заполнить(Неопределено);
		
		КарточкаОбъект.Наименование = СтруктураДанных.Карточка;
		КарточкаОбъект.Контрагент = Контрагент;
		КарточкаОбъект.Артикул = СтруктураДанных.Артикул;
		КарточкаОбъект.Штрихкод = СтруктураДанных.Штрихкод;
		КарточкаОбъект.УпаковкаПоклажедателя = СтруктураДанных.Упаковка;
		
		Если ПроверкаИспользованияХарактеристикПоКонтрагенту(Контрагент) Тогда
			Если ЗначениеЗаполнено(СтруктураДанных.Характеристика) Тогда
				КарточкаОбъект.ХарактеристикаПоклажедателя = СтруктураДанных.Характеристика;	
			Иначе
				КарточкаОбъект.БезХарактеристики = Истина;
			КонецЕсли;
		КонецЕсли; 	
		
		КарточкаОбъект.Записать();                        
		
		СтруктураВозврата.Вставить("УспешноеСоздание", Истина);    
		СтруктураВозврата.Вставить("Ссылка", КарточкаОбъект.Ссылка);  
	Исключение               
		СтруктураВозврата.Вставить("УспешноеСоздание", Ложь);
	КонецПопытки;
	
	Возврат	СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область Прочее

Процедура ЗаписьВЖурнал(ПредставлениеУровня = "Ошибка", Комм = "") Экспорт

	СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий, ДатаСобытия");
	
	СтруктураСобытий.ИмяСобытия = "Личный кабинет: уведомление";
	СтруктураСобытий.ПредставлениеУровня = ПредставлениеУровня;	
	СтруктураСобытий.Комментарий = Комм;
	СтруктураСобытий.ДатаСобытия = ТекущаяДата();
	
	СобытияДляЖурналаРегистрации = Новый СписокЗначений();
	СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
	
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);

КонецПроцедуры

Процедура ОтправитьОстаткиНоменклатуры_Рег() Экспорт

	//НастройкаОтображенияЛК = вмс_Сервер.ПолучитьНастройкуОтображениеЛК();
	//
	//Если ЗначениеЗаполнено(НастройкаОтображенияЛК) Тогда 
	//	ЗначениеРеквизита = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(НастройкаОтображенияЛК,"Значение");	
	//	
	//	Если ЗначениеРеквизита = Истина Тогда
	//		ОтправитьОстаткиПоКарточкам();
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьНоменклатуруИДокументы_Рег() Экспорт
	
    НастройкаОтображенияЛК = вмс_Сервер.ПолучитьНастройкуОтображениеЛК();
	
	Если ЗначениеЗаполнено(НастройкаОтображенияЛК) Тогда 
		ЗначениеРеквизита = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(НастройкаОтображенияЛК,"Значение");	
		
		Если ЗначениеРеквизита = Истина Тогда
			//Справочники//
			ПолучитьКарточки(); 
			//Документы//
			ВыгрузитьДокПередачаНаХранение();
			ВыгрузитьДокВыдачаСХранения();  
			//Регистры//  
			ОтправитьОстаткиПоКарточкам();
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры

Функция ПроверкаИспользованияХарактеристикПоКонтрагенту(Контрагент) Экспорт
	
	РезультатПроверки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	вмс_Поклажедатели.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик
		|ИЗ
		|	Справочник.вмс_Поклажедатели КАК вмс_Поклажедатели
		|ГДЕ
		|	вмс_Поклажедатели.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);      
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		Если Выборка.ИспользованиеХарактеристик Тогда
			РезультатПроверки = Истина;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатПроверки;
		
КонецФункции

Функция СопоставлениеТоваровУчСистемыСТоварамиПоклажедателя(ПереданнаяТаблица) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ПереданнаяТаблица);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваровДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваровДокумента.Характеристика КАК Характеристика,
	|	ТаблицаТоваровДокумента.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_ТаблицаТоваровДокумента
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваровДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_КарточкаПоклажедателя.Ссылка КАК КарточкаПокл,
	|	вмс_КарточкаПоклажедателя.Номенклатура КАК НоменклатураУчетнойСистемы,
	|	вмс_КарточкаПоклажедателя.Характеристика КАК ХарактеристикаУчетнойСистемы,
	|	вмс_КарточкаПоклажедателя.Контрагент КАК КонтрагентПокл
	|ИЗ
	|	Справочник.вмс_КарточкаПоклажедателя КАК вмс_КарточкаПоклажедателя
	|ГДЕ
	|	(вмс_КарточкаПоклажедателя.Номенклатура, вмс_КарточкаПоклажедателя.Характеристика, вмс_КарточкаПоклажедателя.Контрагент) В
	|				(ВЫБРАТЬ
	|					ВТ_ТаблицаТоваровДокумента.Номенклатура,
	|					ВТ_ТаблицаТоваровДокумента.Характеристика,
	|					ВТ_ТаблицаТоваровДокумента.Контрагент
	|				ИЗ
	|					ВТ_ТаблицаТоваровДокумента КАК ВТ_ТаблицаТоваровДокумента)
	|	";
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция РазбиениеМассива(ИсходныйМассив, Разбиение) Экспорт
	
	МассивМассивов = Новый Массив;
	ПромежуточныйМассив = Новый Массив;
	Счетчик = 1;  
	
	Для каждого ЭлементМассива Из ИсходныйМассив Цикл
		ПромежуточныйМассив.Добавить(ЭлементМассива);
		
		Если Счетчик = Разбиение Тогда
			Счетчик = 1;
			МассивМассивов.Добавить(ПромежуточныйМассив);     
			ПромежуточныйМассив = Новый Массив;
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;
	КонецЦикла;  
	
	Если  Счетчик <> 1 Тогда
		МассивМассивов.Добавить(ПромежуточныйМассив);     	
	КонецЕсли;

	Возврат МассивМассивов;
	
КонецФункции

Функция СтруктураПроверокЗаполненияКолонок(ДаныеСтроки)
	
	СтруктураВозврата = Новый Структура("Штрихкод, Артикул, Карточка, Характеристика, Упаковка, Количество", Ложь, Ложь, Ложь, Ложь, Ложь, Ложь);
	
	Если ЗначениеЗаполнено(ДаныеСтроки.Штрихкод) Тогда
		СтруктураВозврата.Вставить("Штрихкод", Истина);
	КонецЕсли;                         
	
	Если ЗначениеЗаполнено(ДаныеСтроки.Артикул) Тогда
		СтруктураВозврата.Вставить("Артикул", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДаныеСтроки.Карточка) Тогда
		СтруктураВозврата.Вставить("Карточка", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДаныеСтроки.Характеристика) Тогда
		СтруктураВозврата.Вставить("Характеристика", Истина);
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(ДаныеСтроки.Упаковка) Тогда
		СтруктураВозврата.Вставить("Упаковка", Истина);
	КонецЕсли; 
		
	Если ЗначениеЗаполнено(ДаныеСтроки.Количество) Тогда
		СтруктураВозврата.Вставить("Количество", Истина);
	КонецЕсли;
	
	Возврат СтруктураВозврата;    
	
КонецФункции

Функция ОбработатьТекст(ТекстДляОбработки) Экспорт
	
	ОбработанныйТекст = ТекстДляОбработки;
	ОбработанныйТекст = СокрЛП(ОбработанныйТекст);
	ОбработанныйТекст = СтрЗаменить(ОбработанныйТекст, Символы.НПП, " ");
	
	Возврат ОбработанныйТекст;     
	
КонецФункции

Функция ПоискКарточкиПоклажедателя(Контрагент, СтруктураПоиска) Экспорт //На вход подается структура("Штрихкод, Артикул, Карточка, Характеристика, Упаковка, Количество") и по заполненным полям осуществляется поиск
	
	РезультатПоиска = Новый Структура("КарточкаНайдена, НайденоНесколько, КарточкаСсылка, КомментарийКПоиску", Ложь, Ложь, Справочники.вмс_КарточкаПоклажедателя.ПустаяСсылка(), "Не найден.");
	ЗаполнениеКолонок = СтруктураПроверокЗаполненияКолонок(СтруктураПоиска);
	
	ДопОтборыСтрока = ""; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_КарточкаПоклажедателя.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_КарточкаПоклажедателя КАК вмс_КарточкаПоклажедателя
	|ГДЕ
	|	вмс_КарточкаПоклажедателя.Контрагент = &Контрагент
	|	И вмс_КарточкаПоклажедателя.ПометкаУдаления = ЛОЖЬ
	|	И вмс_КарточкаПоклажедателя.ЭтоГруппа = ЛОЖЬ
	|	И &ДопОтборы";	
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Если ЗаполнениеКолонок.Карточка Тогда   
		Запрос.УстановитьПараметр("Ссылка", СтруктураПоиска.Карточка);
		
		Если ТипЗнч(СтруктураПоиска.Карточка) = Тип("СправочникСсылка.вмс_КарточкаПоклажедателя") Тогда
			ДопОтборыСтрока = ДопОтборыСтрока + " И вмс_КарточкаПоклажедателя.Ссылка = &Ссылка";
		ИначеЕсли ТипЗнч(СтруктураПоиска.Карточка) = Тип("Строка") Тогда
			ДопОтборыСтрока = ДопОтборыСтрока + " И вмс_КарточкаПоклажедателя.Наименование = &Ссылка";	
		КонецЕсли;  	
	КонецЕсли;  
	
	Если ЗаполнениеКолонок.Упаковка Тогда   
		Запрос.УстановитьПараметр("Упаковка", СтруктураПоиска.Упаковка);
		ДопОтборыСтрока = ДопОтборыСтрока + " И вмс_КарточкаПоклажедателя.УпаковкаПоклажедателя = &Упаковка";	
	КонецЕсли;            
	
	Если ЗаполнениеКолонок.Характеристика Тогда   
		Запрос.УстановитьПараметр("Характеристика", СтруктураПоиска.Характеристика);
		ДопОтборыСтрока = ДопОтборыСтрока + " И вмс_КарточкаПоклажедателя.ХарактеристикаПоклажедателя = &Характеристика";	
	КонецЕсли;
	
	Если ЗаполнениеКолонок.Штрихкод Тогда   
		Запрос.УстановитьПараметр("Штрихкод", СтруктураПоиска.Штрихкод);
		ДопОтборыСтрока = ДопОтборыСтрока + " И вмс_КарточкаПоклажедателя.Штрихкод = &Штрихкод";	
	КонецЕсли;
	
	Если ЗаполнениеКолонок.Артикул Тогда   
		Запрос.УстановитьПараметр("Артикул", СтруктураПоиска.Артикул);
		ДопОтборыСтрока = ДопОтборыСтрока + " И вмс_КарточкаПоклажедателя.Артикул = &Артикул";	
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ДопОтборы", ДопОтборыСтрока);	
	РезультатЗапросПоВсемДанным = Запрос.Выполнить(); 
	
	Если Не РезультатЗапросПоВсемДанным.Пустой() Тогда
		Выборка = РезультатЗапросПоВсемДанным.Выбрать();    
			
		Если Выборка.Количество() = 1 Тогда   
			Выборка.Следующий();
			
			РезультатПоиска.Вставить("КарточкаНайдена", Истина);	
			РезультатПоиска.Вставить("КарточкаСсылка", Выборка.Ссылка); 
			РезультатПоиска.Вставить("КомментарийКПоиску", "Найден.");
		ИначеЕсли Выборка.Количество() > 1 Тогда
			РезультатПоиска.Вставить("КарточкаНайдена", Истина);	
			РезультатПоиска.Вставить("НайденоНесколько", Истина);
			РезультатПоиска.Вставить("КомментарийКПоиску", "Найдено несколько.");
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатПоиска
	
КонецФункции

Функция СтруктураНайденнаяКарточка(ДанныеСтроки, КарточкаСсылка, КомментарийКСтроке)
	
	СтруктураВозврата = Новый Структура("КомментарийКСтроке, Количество, Карточка, КарточкаНаименование, Упаковка, Характеристика, Штрихкод, Артикул", "", 0, "", "", "", "", "", "");
	
	Если ЗначениеЗаполнено(КарточкаСсылка) Тогда
		СтруктураВозврата.Вставить("Карточка", Строка(КарточкаСсылка.УникальныйИдентификатор()));  
		СтруктураВозврата.Вставить("Упаковка", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КарточкаСсылка,"УпаковкаПоклажедателя"));  
		СтруктураВозврата.Вставить("Характеристика", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КарточкаСсылка,"ХарактеристикаПоклажедателя"));
		СтруктураВозврата.Вставить("Штрихкод", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КарточкаСсылка,"Штрихкод"));
		СтруктураВозврата.Вставить("Артикул", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КарточкаСсылка,"Артикул"));
		СтруктураВозврата.Вставить("КарточкаНаименование", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КарточкаСсылка,"Наименование"));
	Иначе
		СтруктураВозврата.Вставить("Упаковка", ДанныеСтроки.Упаковка);  
		СтруктураВозврата.Вставить("Характеристика", ДанныеСтроки.Характеристика);
		СтруктураВозврата.Вставить("Штрихкод", ДанныеСтроки.Штрихкод);
		СтруктураВозврата.Вставить("Артикул", ДанныеСтроки.Артикул);
		СтруктураВозврата.Вставить("КарточкаНаименование", ДанныеСтроки.Карточка);	
	КонецЕсли;
	
	СтруктураВозврата.Вставить("КомментарийКСтроке", КомментарийКСтроке);
	СтруктураВозврата.Вставить("Количество", ДанныеСтроки.Количество);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПроверкаШапкиФайлаЗаполнения(ТабДок)
	
	РезультатПроверки = Истина;
							
	Если ТабДок.Область(1, 1).Текст <> "Штрихкод" Тогда
		РезультатПроверки = Ложь;	
	КонецЕсли;   
	
	Если ТабДок.Область(1, 2).Текст <> "Артикул" Тогда
		РезультатПроверки = Ложь;	
	КонецЕсли;
	
	Если ТабДок.Область(1, 3).Текст <> "Карточка" Тогда
		РезультатПроверки = Ложь;	
	КонецЕсли;
	
	Если ТабДок.Область(1, 4).Текст <> "Характеристика" Тогда
		РезультатПроверки = Ложь;	
	КонецЕсли;
	
	Если ТабДок.Область(1, 5).Текст <> "Упаковка" Тогда
		РезультатПроверки = Ложь;	
	КонецЕсли;
	
	Если ТабДок.Область(1, 6).Текст <> "Количество" Тогда
		РезультатПроверки = Ложь;	
	КонецЕсли;
	
	Возврат РезультатПроверки
	
КонецФункции

Функция СписокСтатусовДокументовДляВыбора(ТипДокумента) Экспорт
	
	СписокСтатусов = Новый Массив;          
	СписокСтатусов.Добавить(Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.Новый);
	СписокСтатусов.Добавить(Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.Отклонен);

	Если ТипДокумента = "ВыдачаСХранения" Тогда
	    СписокСтатусов.Добавить(Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ОтбылСоСклада); 	
		СписокСтатусов.Добавить(Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ПереданНаСборку); 
	ИначеЕсли ТипДокумента = "ПередачаНаХранение"Тогда
		СписокСтатусов.Добавить(Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ПринятНаСкладе); 	           
		СписокСтатусов.Добавить(Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ОжидаетПоставки); 	
	КонецЕсли;

	Возврат СписокСтатусов;	

КонецФункции

#КонецОбласти
// ТУ_ХабароваВВ--

