// Возвращает таблицу значений с найденными по штрихкоду (строка) объектами
//
// Параметры:
//   Штрихкод - Строка - штрихкод для обработки
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение - результат обработки штрихкода, где:
//     * Ключ - ИмяТипаОбъекта (Строка)
//     * Значение - Структура:
//         * Штрихкод - Строка - обработанный штрихкод
//         * Ссылка - ЛюбаяСсылка - найденный объект
//         * Тип - Строка - тип объекта
//         * Распознан - Булево - флаг успешного распознавания
//
Функция ОбработатьШтрихкод(Штрихкод) Экспорт
	
	Результат = Новый Соответствие;
	
	ТаблицаОбъектов = вмс_ОбработкаШтрихкодовСервер.НайтиОбъектыПоШтрихкодам(Штрихкод);
	
	Для Каждого СтрокаОбъекта Из ТаблицаОбъектов Цикл
		Данные = вмс_ОбработкаШтрихкодовКлиентСервер.ИнициализироватьСтруктуруДанныхШтрихкода();
		Данные.Штрихкод = СтрокаОбъекта.Штрихкод;
		Данные.Ссылка = СтрокаОбъекта.Объект;
		Данные.Тип = СтрокаОбъекта.ТипОбъекта;
		Данные.Распознан = Истина;
		Результат[СтрокаОбъекта.ИмяТипаОбъекта] = Данные;
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции
