
&НаСервере
Процедура НазначитьНаСервере() 
	СписокЯчеек = Параметры.СписокЯчеек;
	Для Каждого Ячейка Из СписокЯчеек Цикл
		Если Ячейка.ЭтоГруппа Тогда
			ЯчейкиГруппы = ПолучитьЭлементыГруппы(Ячейка);
			Для Каждого Строка Из ЯчейкиГруппы Цикл 
				ЯчейкаИерархии = Строка.Ссылка;
				Если ЯчейкаИерархии.ЭтоГруппа Тогда
					Продолжить;
				Иначе		
					ОбъектЯчейки = ЯчейкаИерархии.ПолучитьОбъект();
					ОбъектЯчейки.Приоритет = Приоритет;
					ОбъектЯчейки.Записать();
				КонецЕсли;		
			КонецЦикла;
		Иначе
			ОбъектЯчейки = Ячейка.ПолучитьОбъект();
			ОбъектЯчейки.Приоритет = Приоритет;
			ОбъектЯчейки.Записать();   
		КонецЕсли;	
	КонецЦикла;
   
КонецПроцедуры

&НаКлиенте
Процедура Назначить(Команда)
	НазначитьНаСервере();       
	Результат = Новый Структура("ТекстСообщения", "Приоритет назначен!");
	Закрыть(Результат);
КонецПроцедуры
&НаСервере
Функция ПолучитьЭлементыГруппы(ГруппаЯчеек)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_МестаХранения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
		|ГДЕ
		|	вмс_МестаХранения.Родитель В ИЕРАРХИИ(&Группа)  ";
	
	Запрос.УстановитьПараметр("Группа", ГруппаЯчеек);
	
	ЯчейкиГруппы = Запрос.Выполнить().Выгрузить();
	
	Возврат ЯчейкиГруппы;

КонецФункции

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
