#Область СлужебныеПроцедурыИФункции

// Возвращает соответствие имен "функциональных" подсистем и значения Истина.
// У "функциональной" подсистемы снят флажок "Включать в командный интерфейс".
//
&НаКлиенте
Функция ИменаПодсистем() Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ИменаПодсистем();

КонецФункции

// Позволяет виртуально отключать подсистемы для целей тестирования.
// Если подсистема отключена, то функция ОбщегоНазначения.ПодсистемаСуществует вернет Ложь.
// В этой процедуре нельзя использовать функцию ОбщегоНазначения.ПодсистемСуществует, т.к. это приводит к рекурсии.
//
// Параметры:
//   ОтключенныеПодсистемы - Соответствие - в ключе указывается имя отключаемой подсистемы, 
//                                          в значении - установить в Истина.
//
&НаКлиенте
Процедура ВставитьИменаПодчиненныхПодсистем(Имена, РодительскаяПодсистема, ОтключенныеПодсистемы,
	ИмяРодительскойПодсистемы = "")

	УИ_ГЕНЕРАЦИЯ_ВставитьИменаПодчиненныхПодсистем(Имена,РодительскаяПодсистема,ОтключенныеПодсистемы,ИмяРодительскойПодсистемы);

КонецПроцедуры

&НаКлиенте
Функция КодОсновногоЯзыка() Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_КодОсновногоЯзыка();
КонецФункции

// Возвращает соответствие имен предопределенных значений ссылкам на них.
//
// Параметры:
//  ПолноеИмяОбъектаМетаданных - Строка, например, "Справочник.ВидыНоменклатуры",
//                               Поддерживаются только таблицы
//                               с предопределенными элементами:
//                               - Справочники,
//                               - Планы видов характеристик,
//                               - Планы счетов,
//                               - Планы видов расчета.
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие, Неопределено, где
//      * Ключ     - Строка - имя предопределенного,
//      * Значение - Ссылка, Null - ссылка предопределенного или Null, если объекта нет в ИБ.
//
//  Если ошибка в имени метаданных или неподходящий тип метаданного, то возвращается Неопределено.
//  Если предопределенных у метаданного нет, то возвращается пустое фиксированное соответствие.
//  Если предопределенный определен в метаданных, но не создан в ИБ, то для него в соответствии возвращается Null.
//
&НаКлиенте
Функция СсылкиПоИменамПредопределенных(ПолноеИмяОбъектаМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_СсылкиПоИменамПредопределенных(ПолноеИмяОбъектаМетаданных);

КонецФункции

&НаКлиенте
Функция ОписаниеТипаВсеСсылки() Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеТипаВсеСсылки();

КонецФункции

&НаКлиенте
Функция ОбщийМодуль(Имя) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ОбщийМодуль(Имя);
КонецФункции

&НаКлиенте
Функция ТипыОбъектовДоступныйДляРедактораОбъектовБазыДанных() Экспорт
	//Доступны к редактированию 
	//справочники,Документы,ПланыВидовХарактеристик,ПланыСчетов,ПланыВидовРасчетов, БизнесПроцессы, Задачи, планыОбмена

	Возврат УИ_ГЕНЕРАЦИЯ_ТипыОбъектовДоступныйДляРедактораОбъектовБазыДанных();
КонецФункции

&НаКлиенте
Процедура ДобавитьТипыПоВидуОбъектовМетаданных(МассивТипов, ИмяВидаОбъектовМетаданных, ИмяТипа)
	УИ_ГЕНЕРАЦИЯ_ДобавитьТипыПоВидуОбъектовМетаданных(МассивТипов,ИмяВидаОбъектовМетаданных,ИмяТипа);
КонецПроцедуры

&НаКлиенте
Функция ПолеHTMLПостроеноНаWebkit() Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ПолеHTMLПостроеноНаWebkit();
КонецФункции

#КонецОбласти
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОбъектМодуля()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции


&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ИменаПодсистем()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ИменаПодсистем();
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ВставитьИменаПодчиненныхПодсистем(Имена,РодительскаяПодсистема,ОтключенныеПодсистемы,ИмяРодительскойПодсистемы)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ВставитьИменаПодчиненныхПодсистем(Имена,РодительскаяПодсистема,ОтключенныеПодсистемы,ИмяРодительскойПодсистемы);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_КодОсновногоЯзыка()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().КодОсновногоЯзыка();
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_СсылкиПоИменамПредопределенных(ПолноеИмяОбъектаМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СсылкиПоИменамПредопределенных(ПолноеИмяОбъектаМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеТипаВсеСсылки()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеТипаВсеСсылки();
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОбщийМодуль(Имя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОбщийМодуль(Имя);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ТипыОбъектовДоступныйДляРедактораОбъектовБазыДанных()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ТипыОбъектовДоступныйДляРедактораОбъектовБазыДанных();
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ДобавитьТипыПоВидуОбъектовМетаданных(МассивТипов,ИмяВидаОбъектовМетаданных,ИмяТипа)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ДобавитьТипыПоВидуОбъектовМетаданных(МассивТипов,ИмяВидаОбъектовМетаданных,ИмяТипа);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ПолеHTMLПостроеноНаWebkit()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПолеHTMLПостроеноНаWebkit();
КонецФункции
