//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

&НаКлиентеНаСервереБезКонтекста
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Перем РаботаСФормамиКлиент;
	
	РаботаСФормамиКлиент = глОбщийМодуль("РаботаСФормамиКлиент");
	
	ОписаниеТипов = РаботаСФормамиКлиент.ПолучитьПараметрФормыНаКлиенте(ЭтаФорма, "ОписаниеТипов");
	Если ОписаниеТипов=Неопределено Тогда
		ОписаниеТипов = РаботаСФормамиКлиент.ПолучитьПараметрФормыНаКлиенте(ЭтаФорма, "КвазиОписаниеТипов");
	КонецЕсли;

	ЗаполнитьПометкиТипов(ОписаниеТипов);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуТипов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТиповПометкаПриИзменении(Элемент)
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ТекущиеДанные = Элементы.ТаблицаТипов.ТекущиеДанные;
	Пометка = ТекущиеДанные.Пометка;
	
	СтрокаТипа = ТекущиеДанные;
	Пока Истина Цикл
		СтрокаГруппы = СтрокаТипа.ПолучитьРодителя();
		Если СтрокаГруппы=Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если СтрокаТипа.Пометка Тогда
			СтрокаГруппы.КоличествоПометокПодчиненных = СтрокаГруппы.КоличествоПометокПодчиненных + 1;
		Иначе
			СтрокаГруппы.КоличествоПометокПодчиненных = СтрокаГруппы.КоличествоПометокПодчиненных - 1;
		КонецЕсли;
		СтрокаГруппы.Пометка = СтрокаГруппы.КоличествоПометокПодчиненных=СтрокаГруппы.ПолучитьЭлементы().Количество();
		СтрокаТипа = СтрокаГруппы;
	КонецЦикла;
	
	СтрокиТипов = Новый Массив;
	СтрокиТипов.Добавить(ТекущиеДанные);
	РК.ДобавитьЭлементыКоллекции(СтрокиТипов, ПолучитьВсеЭлементыДерева(ТекущиеДанные));
	Для Каждого СтрокаТипа Из СтрокиТипов Цикл
		СтрокаТипа.Пометка = Пометка;
		СтрокаТипа.КоличествоПометокПодчиненных = ?(Пометка, СтрокаТипа.ПолучитьЭлементы().Количество(), 0);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТаблицуТипов()

	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить("Строка");
	СписокТипов.Добавить("Число");
	СписокТипов.Добавить("Булево");
	СписокТипов.Добавить("Дата");
	СписокТипов.Добавить("ФорматированнаяСтрока", "Форматированная строка");
	СписокТипов.Добавить("СписокЗначений", "Список значений");
	СписокТипов.Добавить("ТаблицаЗначений", "Таблица значений");
	СписокТипов.Добавить("ДеревоЗначений", "Дерево значений");
	СписокТипов.Добавить("Цвет");
	СписокТипов.Добавить("Шрифт");
	СписокТипов.Добавить("Картинка");

	СписокТипов.Добавить(Метаданные.Справочники, "Справочники");
	СписокТипов.Добавить(Метаданные.Документы, "Документы");
	СписокТипов.Добавить(Метаданные.ПланыВидовХарактеристик, "Планы видов характеристик");
	СписокТипов.Добавить(Метаданные.Перечисления, "Перечисления");
	
	Для Каждого ЭлементТипа Из СписокТипов Цикл
		
		СтрокаТипа = ТаблицаТипов.ПолучитьЭлементы().Добавить();
		Если ЭлементТипа.Представление<>"" Тогда
			Представление = ЭлементТипа.Представление;
		Иначе
			Представление = Строка(ЭлементТипа.Значение);
		КонецЕсли;
		СтрокаТипа.Представление = Представление;
		
		Если ТипЗнч(ЭлементТипа.Значение)=Тип("КоллекцияОбъектовМетаданных") Тогда
			СтрокаГруппы = СтрокаТипа;
			СтрокаГруппы.ЭтоГруппа = Истина;
			Для Каждого ОбъектМетаданных Из ЭлементТипа.Значение Цикл
				ИмяТипа = ОбъектМетаданных.ПолноеИмя();
				ИмяТипа = СтрЗаменить(ИмяТипа, ".", "Ссылка.");
				СтрокаТипа = СтрокаГруппы.ПолучитьЭлементы().Добавить();
				СтрокаТипа.ИмяТипа = ИмяТипа;
				СтрокаТипа.Представление = ОбъектМетаданных.Синоним;
			КонецЦикла;
		Иначе
			СтрокаТипа.ИмяТипа = ЭлементТипа.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьПометкиТипов(ОписаниеТипов)
	
	Перем ОбщегоНазначенияКлиентСервер;
	
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоКвазиОписаниеТипов(ОписаниеТипов) Тогда
		КвазиОписаниеТипов = ОписаниеТипов;
	Иначе
		КвазиОписаниеТипов = ОбщегоНазначенияКлиентСервер.НовоеКвазиОписаниеТипов(ОписаниеТипов);
	КонецЕсли;
	
	ВсеСтрокиТипов = ПолучитьВсеЭлементыДерева(ТаблицаТипов);
	Для Каждого СтрокаТипа Из ВсеСтрокиТипов Цикл
		Если СтрокаТипа.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТипа.Пометка = КвазиОписаниеТипов.МассивИменТипов.Найти(СтрокаТипа.ИмяТипа) <> Неопределено;
	КонецЦикла;
	
	РассчитатьПометкиГрупп();
	
КонецФункции

&НаКлиенте
Функция РассчитатьПометкиГрупп()
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ВсеСтрокиТипов = ПолучитьВсеЭлементыДерева(ТаблицаТипов);
	Для Каждого СтрокаТипа Из ВсеСтрокиТипов Цикл
		СтрокаТипа.КоличествоПометокПодчиненных = 0;
	КонецЦикла;
	
	РК.РазвернутьЭлементыМассива(ВсеСтрокиТипов);
	
	Для Каждого СтрокаТипа Из ВсеСтрокиТипов Цикл
		
		Если СтрокаТипа.ЭтоГруппа Тогда
			СтрокаТипа.Пометка = СтрокаТипа.КоличествоПометокПодчиненных=СтрокаТипа.ПолучитьЭлементы().Количество();
		КонецЕсли;
		
		Если СтрокаТипа.Пометка Тогда
			СтрокаГруппы = СтрокаТипа.ПолучитьРодителя();
			Если СтрокаГруппы<>Неопределено Тогда
				СтрокаГруппы.КоличествоПометокПодчиненных = СтрокаГруппы.КоличествоПометокПодчиненных + 1;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРезультат()
	
	Перем ОбщегоНазначенияКлиентСервер;
	
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");

	Типы = Новый Массив;
	
	ВсеСтрокиТипов = ПолучитьВсеЭлементыДерева(ТаблицаТипов);
	Для Каждого СтрокаТипа Из ВсеСтрокиТипов Цикл
		Если СтрокаТипа.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не СтрокаТипа.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТипа.ИмяТипа="Неопределено" Тогда
			Прервать;
		КонецЕсли;
		
		Типы.Добавить(СтрокаТипа.ИмяТипа);
	КонецЦикла;
	
	КвазиОписаниеТипов = ОбщегоНазначенияКлиентСервер.НовоеКвазиОписаниеТипов(Типы);
	
	Возврат КвазиОписаниеТипов;
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = ПолучитьРезультат();
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьВсеЭлементыДерева(Дерево)
	
	ОбходЭлементов = Новый Массив;
	ОбходЭлементов.Добавить(Дерево);
	
	Для Каждого СтрокаЭлемента Из ОбходЭлементов Цикл
		Для Каждого ПодчиненныйЭлемент Из СтрокаЭлемента.ПолучитьЭлементы() Цикл
			ОбходЭлементов.Добавить(ПодчиненныйЭлемент);
		КонецЦикла;
	КонецЦикла;
	
	ОбходЭлементов.Удалить(0);
	
	Возврат ОбходЭлементов;
	
КонецФункции

&НаКлиенте
Процедура СнятьВсеПометки(Команда)
	
	Для Каждого СтрокаТипа Из ПолучитьВсеЭлементыДерева(ТаблицаТипов) Цикл
		
		СтрокаТипа.Пометка = Ложь;
		СтрокаТипа.КоличествоПометокПодчиненных = 0;
		
	КонецЦикла;
	
КонецПроцедуры
