Функция ПолучитьСтруктуруПолейВводаПоПорядкуОперации(ПорядокОперации) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПорядокОперации) Тогда
		ВызватьИсключение 
			НСтр("ru = 'Не передан порядок операции'");
	КонецЕсли;
	
	ПВХ = ПланыВидовХарактеристик.вмс_ПорядокСканированияОпераций;
	
	СтруктураПолей = Новый Структура;
	
	Если ПорядокОперации = ПВХ.Товар_Ячейка Тогда
		СтруктураПолей.Вставить("Товар","Введите товары для размещения");
		СтруктураПолей.Вставить("Ячейка","Введите ячейку");
	ИначеЕсли ПорядокОперации = ПВХ.Ячейка_Товар Тогда
		СтруктураПолей.Вставить("Ячейка","Введите ячейку");
		СтруктураПолей.Вставить("Товар","Введите товары для выбранной ячейки");
	КонецЕсли;		

	Возврат СтруктураПолей;


КонецФункции // ПолучитьСтруктуруПолейВводаПоПорядкуОперации()
