
Перем КэшНаСервере;

// #Область СведенияОВнешнейОбработке

Функция ВерсияОбработки() Экспорт
	
	Возврат "11";
	
КонецФункции

// Сведения о внешней обработке совместимые с БСП
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	МетаданныеОбработки = Метаданные();
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Ложь);
	Результат.Вставить("Наименование", МетаданныеОбработки.Синоним);
	Результат.Вставить("Информация", МетаданныеОбработки.Комментарий);
	Результат.Вставить("Команды", Новый ТаблицаЗначений);
	Результат.Вставить("Версия", ВерсияОбработки());
	Результат.Вставить("Вид", "ДополнительнаяОбработка");
	Результат.Вставить("ВерсияБСП", "1.2.1.4");
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти

// #Область КомандыВнешнейОбработки

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды = Неопределено) Экспорт
	
	ВызватьИсключение НСтр("ru = 'Команды не поддерживаются в библиотеке контроля'");
	
КонецПроцедуры

// #КонецОбласти

// #Область Перечисления

Функция Перечисление_ФичаФлаги() Экспорт
	
	КлючКэш = "ФичаФлаги";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	ДополнитьСтруктуру(Результат, Перечисление_ФичаФлагиВключения());
	ДополнитьСтруктуру(Результат, Перечисление_ФичаФлагиОтключения());
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ФичаФлагиВключения() Экспорт
	
	КлючКэш = "ФичаФлагиВключения";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("КонтрольРДПарфюмерия", "perfumery_introduction_certificateDocument_12315");
	Результат.Вставить("КонтрольРДБезалкогольныеНапитки", "softDrinks_introduction_certificateDocument_12315");
	Результат.Вставить("КонтрольРДФототовары", "electronics_introduction_certificateDocument_12315");
	Результат.Вставить("КонтрольРДШины", "tires_introduction_certificateDocument_12315");
	
	Результат.Вставить("КонтрольДатаПроизводстваНанесениеАнтисептики", "req_antiseptics_utilisation_productionDate_13021");
	Результат.Вставить("КонтрольСодержаниеСпиртаНанесениеПиво", "beer_utilisation_alcoholVolume_18827");
	Результат.Вставить("КонтрольСрокГодностиНанесениеМедИзделия", "wheelChairs_utilisation_expirationDate_17212");
	Результат.Вставить("КонтрольВесВыводИзОборотаМолокоОСУ", "req_milk_withdrawn_weight_osu_17542");
	Результат.Вставить("КонтрольПлощадкаНанесениеБезалкогольноеПиво", "nonalcoholicBeer_utilization_report_mod_17773");
	Результат.Вставить("КонтрольНомераСкважин", "req_water_wellNumbers_26885");
	
	Результат.Вставить("КонтрольВСД_КондитерскиеИзделия", "req_sweets_vsd_34340");
	Результат.Вставить("КонтрольВСД_Полуфабрикаты", "req_frozen_vsd_34340");
	Результат.Вставить("КонтрольВСД_Бакалея", "req_grocery_vsd_34340");
	
	Результат.Вставить("ПеремаркировкаБады", "bio_remarking_13918");
	Результат.Вставить("ПеремаркировкаАнтисептики", "antiseptics_remarking_13918");
	Результат.Вставить("ПеремаркировкаБезалкогольноеПиво", "nonalcoholicBeer_remarking_25766");
	
	Результат.Вставить("ВозвратВОборотРозничнаяПродажаВелосипеды", "bikes_reintroduction_retail_return_16782");
	
	Результат.Вставить("ИмпортФТСБезалкогольноеПиво", "nonalcoholicBeer_introduction_importfts_18331");
	Результат.Вставить("ИмпортФТСВетпрепараты", "vetpharma_introduction_importfts_18331");
	Результат.Вставить("ИмпортФТСКормаДляЖивотных", "petFood_introduction_importfts_18331");
	Результат.Вставить("ИмпортФТСРастительныеМасла", "vegetableOil_introduction_importfts_18331");
	Результат.Вставить("ИмпортФТСОптоволокно", "opticfiber_introduction_importfts_19661");
	Результат.Вставить("ИмпортФТСЭлектроника", "radio_introduction_importfts_19661");
	Результат.Вставить("ИмпортФТССтройМатериалы", "construction_introduction_importfts_19661");
	Результат.Вставить("ИмпортФТСБакалеяВолна2", "grocery_wave2_introduction_importfts_23293");
	Результат.Вставить("ИмпортФТСКосметикаВолна2", "chemistry_wave2_introduction_importfts_23293");
	Результат.Вставить("ИмпортФТСКосметикаВолна3", "chemistry_wave3_introduction_importfts_23293");
	Результат.Вставить("ИмпортФТСОтопительныеПриборы", "heater_introduction_importfts_19661");
	Результат.Вставить("ИмпортФТСПиротехника", "fire_introduction_importfts_19661");
	Результат.Вставить("ИмпортФТСПечатнаяПродукция", "books_introduction_importfts_19661");
	Результат.Вставить("ИмпортФТСАвтоЖидкости", "autofluids_introduction_importfts_18904");
	Результат.Вставить("ИмпортФТСКондитерскиеИзделия", "sweets_introduction_importfts_21932");
	Результат.Вставить("ИмпортФТСАвтозапчасти", "carparts_introduction_importfts_23302");
	Результат.Вставить("ИмпортФТСПолимерныеТрубы", "polymer_introduction_importfts_25737");
	Результат.Вставить("ИмпортФТСМясныеИзделия", "meat_introduction_importfts_28670");
	Результат.Вставить("ИмпортФТСНоутбукиИСмартфоны", "gadgets_introduction_importfts_29142");
	Результат.Вставить("ИмпортФТСПолуфабрикаты", "frozen_introduction_importfts_31102");
	Результат.Вставить("ИмпортФТСТоварыДляДома", "homeware_introduction_importfts_29817");
	Результат.Вставить("ИмпортФТСУдобрения", "fertilizers_introduction_importfts_32464");
	
	Результат.Вставить("ВыводИзОборотаОСУКонсервы", "conserve_withdrawn_osu_31191");
	Результат.Вставить("ВыводИзОборотаВетпрепаратыУказаниеМОД", "vetpharma_withdrawn_mod_31497");
	
	Результат.Вставить("ТипОплатыКормаДляЖивотных", "petFood_orders_paymentType_18192");
	Результат.Вставить("ТипОплатыКосметика", "chemistry_orders_paymentType_20956");
	Результат.Вставить("ТипОплатыЭлектроника", "radio_orders_paymentType_20956");
	Результат.Вставить("ТипОплатыАвтоЖидкости", "autofluids_orders_paymentType_23276");
	Результат.Вставить("ТипОплатыИгрушки", "toys_orders_paymentType_27637");
	Результат.Вставить("ТипОплатыМясныеИзделия", "meat_orders_paymentType_28670");
	Результат.Вставить("ТипОплатыПолуфабрикаты", "frozen_orders_paymentType_31102");
	Результат.Вставить("ТипОплатыНоутбукиИСмартфоны", "gadgets_orders_paymentType_31952");
	
	Результат.Вставить("СрокЖизниКодовЭлектроника30", "radio_codeTTL_30_20937");
	Результат.Вставить("СрокЖизниКодовИгрушки30", "toys_codeTTL_30_27132");
	Результат.Вставить("СрокЖизниКодовКосметика60", "chemistry_codeTTL_60_20937");
	
	Результат.Вставить("ЗаказКодовПечатнаяПродукция", "books_orders_kiz_22626");
	Результат.Вставить("ЗаказКодовПечатнаяПродукцияНаборы", "books_orders_set_22626");
	Результат.Вставить("ЗаказКодовЭлектроника", "radio_orders_kiz_22626");
	Результат.Вставить("ЗаказКодовЭлектроникаКИГУ", "radio_orders_group_22626");
	Результат.Вставить("ЗаказКодовЭлектроникаНаборы", "radio_orders_set_22626");
	Результат.Вставить("ЗаказКодовАвтоЖидкостиКИГУ", "autofluids_orders_group_18904");
	Результат.Вставить("ЗаказКодовБакалеяКИГУ", "grocery_order_group");
	Результат.Вставить("ЗаказКодовКондитерскиеИзделияКИГУ", "sweets_orders_group_21932");
	Результат.Вставить("ЗаказКодовАвтозапчастиКИГУ", "carparts_orders_group_23302");
	Результат.Вставить("ЗаказКодовАвтозапчастиНаборы", "carparts_orders_set_23302");
	Результат.Вставить("ЗаказКодовВелосипедыКИГУ", "bikes_orders_group_25136");
	Результат.Вставить("ЗаказКодовОтопительныеПриборыКИГУ", "heater_introduction_orders_group_25136");
	Результат.Вставить("ЗаказКодовПолимерныеТрубыКИГУ", "polymer_orders_group_25737");
	Результат.Вставить("ЗаказКодовМясныеИзделияКИГУ", "meat_orders_group_28670");
	Результат.Вставить("ЗаказКодовНоутбукиИСмартфоныКИГУ", "gadgets_orders_group_29142");
	Результат.Вставить("ЗаказКодовПолуфабрикатыКИГУ", "frozen_orders_group_31102");
	Результат.Вставить("ЗаказКодовПолуфабрикатыНаборы", "frozen_orders_set_31102");
	Результат.Вставить("ЗаказКодовТоварыДляДомаКИГУ", "homeware_orders_group_29817");
	Результат.Вставить("ЗаказКодовТоварыДляДомаНаборы", "homeware_orders_set_29817");
	Результат.Вставить("ЗаказКодовНоутбукиИСмартфоныНаборы", "gadgets_orders_set_32065");
	Результат.Вставить("ЗаказКодовУдобренияКИГУ", "fertilizers_orders_group_32464");
	Результат.Вставить("ЗаказКодовУдобренияНаборы", "fertilizers_orders_set_32464");
	
	Результат.Вставить("РегистрацияНаборовАвтозапчасти", "carparts_sets_registration_23302");
	Результат.Вставить("РегистрацияНаборовЭлектроника", "radio_sets_registration_31952");
	Результат.Вставить("РегистрацияНаборовНоутбукиИСмартфоны", "gadgets_sets_registration_31952");
	
	Результат.Вставить("ФормированиеАТКАвтоЖидкости", "autofluids_atk_aggregation_23637");
	Результат.Вставить("ФормированиеАТКЭлектроника", "radio_atk_aggregation_30679");
	Результат.Вставить("ФормированиеАТКНоутбукиИСмартфоны", "gadgets_atk_aggregation_30679");
	
	Результат.Вставить("Тарификация", "tariffication_24912");
	
	Результат.Вставить("КорректировкаНомерПартииМолоко", "milk_information_change_part_number_25046");
	
	Результат.Вставить("ЗагрузкаВсехПлощадок", "all_load_mod_26079");
	
	Результат.Вставить("ПлощадкиНоутбукиИСмартфоныНанесение", "gadgets_utilisation_mod_29326");
	
	Результат.Вставить("ВозвратВОборотБакалея", "grocery_reintroduction_27126");
	Результат.Вставить("ВозвратВОборотБезалкогольноеПиво", "nonalcoholicBeer_reintroduction_27126");
	Результат.Вставить("ВозвратВОборотСтроительныеМатериалы", "construction_reintroduction_27126");
	
	Результат.Вставить("МаркировкаВнеПроизводстваИлиИмпортаЭлектроника", "radio_reapply_27129");
	Результат.Вставить("МаркировкаВнеПроизводстваИлиИмпортаПиво", "beer_reapply_27129");
	Результат.Вставить("МаркировкаВнеПроизводстваИлиИмпортаВелосипеды", "bikes_reapply_27129");
	Результат.Вставить("МаркировкаВнеПроизводстваИлиИмпортаВетпрепараты", "vetpharma_reapply_27129");
	Результат.Вставить("МаркировкаВнеПроизводстваИлиИмпортаНоутбукиИСмартфоны", "gadgets_reapply_31952");
	
	Результат.Вставить("ВнутреннееПеремещениеВетпрепараты", "vetpharma_internal_movement_29257");
	
	Результат.Вставить("ВводВОборотСПричинойЭлектроника", "radio_introduction_reason_31952");
	
	Результат.Вставить("ПартионныйУчетМолокоСрокХраненияДо40Суток", "milk_up_to_40_days_reflection_rule_batch_34225");
	Результат.Вставить("ПартионныйУчетМолокоСрокХраненияСвыше40Суток", "milk_over_40_days_reflection_rule_batch_34225");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ФичаФлагиОтключения() Экспорт
	
	КлючКэш = "ФичаФлагиОтключения";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОстаткиАвтоЖидкости", "autofluids_remains_23277");
	Результат.Вставить("ОстаткиЛегпромВолна4", "clothes_remains_wave4_29595");
	Результат.Вставить("ОстаткиЗаказКодовИгрушки", "toys_orders_remains_27132");
	Результат.Вставить("ОстаткиВводВОборотИгрушки", "toys_introduction_remains_27132");
	Результат.Вставить("ОстаткиЗаказКодовАнтисептики", "antiseptics_orders_remains_13903");
	Результат.Вставить("ОстаткиВводВОборотАнтисептики", "antiseptics_introduction_remains_13903");
	Результат.Вставить("ОстаткиЗаказКодовВелосипеды", "bikes_remains_orders_16782");
	Результат.Вставить("ОстаткиВводВОборотВелосипеды", "bikes_remains_introduction_16782");
	Результат.Вставить("ОстаткиВводВОборотБадыВолна3", "bio_remains_introduction_wave3_28496");
	Результат.Вставить("ОстаткиВводВОборотКосметикаВолна4", "chemistry_remains_introduction_wave4_29492");
	Результат.Вставить("ОстаткиВводВОборотЭлектроника", "radio_remains_introduction_30678");
	Результат.Вставить("ОстаткиВводВОборотНоутбукиИСмартфоны", "gadgets_remains_introduction_30678");
	
	Результат.Вставить("ИмпортЛегпромВолна4", "clothes_import_wave4_29595");
	Результат.Вставить("ИмпортМедИзделия", "wheelChairs_introduction_import_13114");
	Результат.Вставить("ИмпортАнтисептики", "antiseptics_introduction_import_13114");
	Результат.Вставить("ИмпортБады", "bio_introduction_import_13114");
	Результат.Вставить("ИмпортБезалкогольноеПиво", "nonalcoholicBeer_introduction_import_18331");
	Результат.Вставить("ИмпортВетпрепараты", "vetpharma_introduction_import_18331");
	Результат.Вставить("ИмпортКормаДляЖивотных", "petFood_introduction_import_18331");
	Результат.Вставить("ИмпортРастительныеМасла", "vegetableOil_introduction_import_18331");
	Результат.Вставить("ИмпортИгрушки", "toys_introduction_import_19661");
	Результат.Вставить("ИмпортОптоволокно", "opticfiber_introduction_import_19661");
	Результат.Вставить("ИмпортЭлектроника", "radio_introduction_import_19661");
	Результат.Вставить("ИмпортСтроительныеМатериалы", "construction_introduction_import_19661");
	Результат.Вставить("ИмпортБакалеяВолна2", "grocery_wave2_introduction_import_23293");
	Результат.Вставить("ИмпортКосметикаВолна2", "chemistry_wave2_introduction_import_23293");
	Результат.Вставить("ИмпортКосметикаВолна3", "chemistry_wave3_introduction_import_23293");
	Результат.Вставить("ИмпортОтопительныеПриборы", "heater_introduction_import_19661");
	Результат.Вставить("ИмпортПиротехника", "fire_introduction_import_19661");
	Результат.Вставить("ИмпортПечатнаяПродукция", "books_introduction_import_19661");
	Результат.Вставить("ИмпортАвтоЖидкости", "autofluids_introduction_import_18904");
	Результат.Вставить("ИмпортКондитерскиеИзделия", "sweets_introduction_import_21932");
	Результат.Вставить("ИмпортАвтозапчасти", "carparts_introduction_import_23302");
	Результат.Вставить("ИмпортПолимерныеТрубы", "polymer_introduction_import_25737");
	Результат.Вставить("ИмпортМясныеИзделия", "meat_introduction_import_28670");
	Результат.Вставить("ИмпортНоутбукиИСмартфоны", "gadgets_introduction_import_29142");
	Результат.Вставить("ИмпортПолуфабрикаты", "frozen_introduction_import_31102");
	Результат.Вставить("ИмпортТоварыДляДома", "homeware_introduction_import_29817");
	Результат.Вставить("ИмпортУдобрения", "fertilizers_introduction_import_32464");
	
	Результат.Вставить("ВыводИзОборотаТрансгранЛегпромБеларусь", "clothes_withdrawn_eastrade_belarus_29440");
	
	Результат.Вставить("ВыводИзОборотаОСУКормаДляЖивотных", "petFood_withdrawn_osu_31191");
	Результат.Вставить("ВыводИзОборотаОСУКосметика", "chemistry_withdrawn_osu_31191");
	Результат.Вставить("ВыводИзОборотаОСУБакалея", "grocery_withdrawn_osu_32504");
	
	Результат.Вставить("КорректировкаСкладскихОстатковОСУКормаДляЖивотных", "petFood_balancecorrection_osu_31191");
	
	Результат.Вставить("НанесениеПивоСодержаниеСпиртаТолькоКеги", "beer_utilisation_alcoholVolume_tanks_18827");
	
	Результат.Вставить("МаркировкаВнеПроизводстваИлиИмпортаБадыВолна3", "bio_reapply_wave3_30144");
	
	Результат.Вставить("АвтоподборПозицииНаТСД", "autoSelect_position_tsd_21417");
	
	Результат.Вставить("ПравилоОтраженияОСУАнтисептикиВолна0", "antiseptics_reflection_rule_osu_wave0_26259");
	Результат.Вставить("ПравилоОтраженияОСУАнтисептикиВолна1", "antiseptics_reflection_rule_osu_wave1_23292");
	
	Результат.Вставить("ПравилоОтраженияОСУВода", "water_reflection_rule_osu_26489");
	Результат.Вставить("ПравилоОтраженияОСУКосметика", "chemistry_reflection_rule_osu_31191");
	Результат.Вставить("ПравилоОтраженияОСУМолоко", "milk_reflection_rule_osu_34225");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ВидыПродукции() Экспорт
	
	КлючКэш = "ВидыПродукции";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Для каждого Значение Из Метаданные.Перечисления.КонтурМаркировка_ВидыПродукции.ЗначенияПеречисления Цикл
		Результат.Вставить(Значение.Имя, Перечисления.КонтурМаркировка_ВидыПродукции[Значение.Имя]);
	КонецЦикла;
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_СтатусыОпераций() Экспорт
	
	КлючКэш = "СтатусыОпераций";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("Новый"					, "Новый");
	Результат.Вставить("ОперацияЗавершена"		, "Операция завершена");
	Результат.Вставить("ПолучениеКодовИзСервиса", "Получение кодов из сервиса");
	Результат.Вставить("ОбновлениеСтатусовКодов", "Обновление статусов кодов");
	Результат.Вставить("ОперацияОтменена"		, "Операция отменена");
	Результат.Вставить("ОжиданиеГотовности"		, "Ожидание готовности");
	
	Результат.Вставить("ОшибкаЗаполнения"		, "Ошибка заполнения");
	Результат.Вставить("ОшибкаОбработки"		, "Ошибка обработки");
	Результат.Вставить("ОшибкаОтменыОперации"	, "Ошибка отмены операции");
	Результат.Вставить("ОшибкаОбменаССервисом"  , "Ошибка обмена с сервисом");
	
	Результат.Вставить("ОтправкаВСервис"	, "Отправка в сервис");
	Результат.Вставить("ОтправленВСервис"	, "Отправлен в сервис");
	Результат.Вставить("ГотовКОтправкеВГИС"	, "Готов к отправке в ГИС МТ");
	Результат.Вставить("ТребуетсяПодписать"	, "Требуется подписать");
	Результат.Вставить("Подписан"			, "Подписан");
	
	// Заказ кодов
	Результат.Вставить("ЗаказВОбработке",                  "Заказ в обработке");
	Результат.Вставить("ПолучениеКодов"	,                  "Получение кодов");
	Результат.Вставить("НедостаточноСредств",              "Недостаточно средств");
	Результат.Вставить("ОжидаетПеремаркировку",            "Ожидает перемаркировку");
	Результат.Вставить("ОтправленНаПодтверждение",         "Отправлен на подтверждение");
	Результат.Вставить("ОжидаетКодыВложенныхТоваров",      "Ожидает коды вложенных товаров");
	Результат.Вставить("ЗакрытиеЗаказа",                   "Закрытие заказа");
	Результат.Вставить("ТребуетсяПодписатьЗакрытиеЗаказа", "Требуется подписать закрытие заказа");
	
	// Агрегация, Отчет о нанесении, Отчет о нанесении на ТСД, Наполнение наборов на ТСД
	Результат.Вставить("ОтправленНаТСД",				"Отправлен на ТСД");
	Результат.Вставить("НаполненНаТСД",					"Наполнен на ТСД");
	Результат.Вставить("ВозвращенНаТСД",				"Возвращен на ТСД");
	Результат.Вставить("КИГУНаполнены",					"КИГУ наполнены");
	Результат.Вставить("ОжиданиеЗавершенияИзменений",	"Ожидание завершения изменений");
	Результат.Вставить("РезервированиеПартий",			"Резервирование партий");
	
	// Регистрация агрегата
	Результат.Вставить("ПроверкаВозможностиРегистрацииАгрегата", "Проверка возможности регистрации агрегата");
	
	// Виртуальная агрегация
	Результат.Вставить("СозданыАгрегаты"	, "Созданы агрегаты");
	
	// Входящий УПД
	Результат.Вставить("СозданВСервисе"		, "Создан в сервисе");
	Результат.Вставить("ПроверенВГИС"		, "Проверен в ГИС МТ");
	
	// Печать кодов
	Результат.Вставить("КодыНапечатаны", "Коды напечатаны");
	Результат.Вставить("КодыВыгружены", "Коды выгружены в файл");
	
	// Отчет о нанесении
	Результат.Вставить("ОтправленВГИС"      , "Отправлен в ГИС МТ");
	Результат.Вставить("ОтправляетсяВГИС"   , "Отправляется в ГИС МТ");
	Результат.Вставить("ЗарегистрированВГИС", "Зарегистрирован в ГИС МТ");
	Результат.Вставить("ПринятЧастично"     , "Частично принят ГИС МТ");
	
	Результат.Вставить("ОжиданиеСтатусаКодовНанесен", "Ожидание статуса кодов: Нанесен");
	
	Результат.Вставить("НеУдалосьРаспознатьКоды", "Не удалось распознать коды");
	Результат.Вставить("ОбнаруженоДублированиеВАгрегатах", "Обнаружено дублирование в агрегатах");
	
	// Уведомления о приемке
	Результат.Вставить("ОтправленВАрхив",                      "Отправлен в архив"); // Archived
	Результат.Вставить("ЗапросСФайломОтправленВГИС",           "Запрос с файлом отправлен в ГИС МТ"); // SentForApprove
	Результат.Вставить("ПолученУспешныйОтветОтГИС",            "Получен успешный ответ от ГИС МТ"); // Approved
	Результат.Вставить("ОтГИСПолученоСообщениеОбОшибке",       "От ГИС МТ получено сообщение об ошибке"); // ApprovedFailed
	Результат.Вставить("ОтправкаЗапросаСФайломВГИС",           "Отправка запроса с файлом в ГИС МТ"); // CrptSending
	Результат.Вставить("ОшибкаОтправкиЗапросаСФайломВГИС",     "Ошибка отправки запроса с файлом в ГИС МТ"); // CrptSendingError
	Результат.Вставить("ВПриемкеОтказано",                     "В приемке отказано"); // Cancelled
	Результат.Вставить("ДокументОПриемкеОжидаетПодтверждения", "Документ о приемке ожидает подтверждения"); // WaitAcceptance
	
	// Возврат в оборот
	Результат.Вставить("ОбрабатываетсяВГИС", "Обрабатывается в ГИС МТ");
	
	// Отмена вывода из оборота
	Результат.Вставить("ОжиданиеОтменыВыводаИзОборота", "Ожидание отмены вывода из оборота");
	
	// Формирование АТК
	Результат.Вставить("ПолучениеАТК", "Получение АТК");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_СтатусыКодов() Экспорт
	
	КлючКэш = "СтатусыКодов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("Выпущен"			, "Выпущен");
	Результат.Вставить("Нанесен"			, "Нанесен");
	Результат.Вставить("НанесенНеОплачен"	, "Нанесен не оплачен");
	Результат.Вставить("Списан"				, "Списан");
	Результат.Вставить("Продан"				, "Продан");
	Результат.Вставить("ВыбылИзОборота"		, "Выбыл из оборота");
	Результат.Вставить("ВозвращенВОборот"	, "Возвращен в оборот");
	Результат.Вставить("ВведенВОборот"		, "Введен в оборот");
	Результат.Вставить("Разагрегирован"		, "Разагрегирован");
	Результат.Вставить("НеОпределен"		, "Не определен");
	Результат.Вставить("НеНайден"			, "Не найден в ГИС МТ");
	Результат.Вставить("НетДоступа"			, "Нет доступа в ГИС МТ");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ТипыОпераций() Экспорт
	
	КлючКэш = "ТипыОпераций";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Интерактивные операции
	Результат = Новый Структура;
	Результат.Вставить("ЗаказКодов",                  "Заказ кодов");
	Результат.Вставить("ВводВОборот",                 "Ввод в оборот");
	Результат.Вставить("АгрегацияКодов",              "Агрегация кодов (виртуальная)");
	Результат.Вставить("РегистрацияАгрегатов",        "Регистрация агрегатов в ГИС МТ");
	Результат.Вставить("РасформированиеАгрегатов",    "Расформирование агрегатов");
	Результат.Вставить("НаполнениеАгрегатовНаТСД",    "Наполнение агрегатов на ТСД");
	Результат.Вставить("ПечатьКодов",                 "Печать кодов");
	Результат.Вставить("ОтчетОНанесении",             "Отчет о нанесении");
	Результат.Вставить("ОтчетОНанесенииНаТСД",        "Отчет о нанесении на ТСД");
	Результат.Вставить("ВходящийУПД",                 "Входящий УПД");
	Результат.Вставить("ПодборКодовНаТСД",            "Подбор кодов на ТСД");
	Результат.Вставить("ПодборТоваровИКодовНаТСД",    "Подбор товаров и кодов на ТСД");
	Результат.Вставить("СообщениеОбОтгрузке",         "Сообщение об отгрузке");
	Результат.Вставить("ВыводИзОборота",              "Вывод из оборота");
	Результат.Вставить("ОтменаВыводаИзОборота",       "Отмена вывода из оборота");
	Результат.Вставить("ОтчетОВыбытии",               "Отчет о выбытии");
	Результат.Вставить("ОтчетОВыбытииНаТСД",          "Отчет о выбытии на ТСД");
	Результат.Вставить("Перемаркировка",              "Перемаркировка");
	Результат.Вставить("НаполнениеНаборовНаТСД",      "Наполнение наборов на ТСД");
	Результат.Вставить("РегистрацияНаборов",          "Регистрация наборов");
	Результат.Вставить("УведомлениеОПриемке",         "Уведомление о приемке");
	Результат.Вставить("ФормированиеКИГУ",            "Формирование КИГУ");
	Результат.Вставить("НаполнениеКИГУНаТСД",         "Наполнение КИГУ на ТСД");
	Результат.Вставить("РегистрацияКИГУ",             "Регистрация КИГУ");
	Результат.Вставить("ВозвратВОборот",              "Возврат в оборот");
	Результат.Вставить("ВозвратВОборотНаТСД",         "Возврат в оборот на ТСД");
	Результат.Вставить("ДобавлениеВАгрегат",          "Добавление в агрегат");
	Результат.Вставить("ИзъятиеИзАгрегата",           "Изъятие из агрегата");
	Результат.Вставить("ФормированиеАТК",             "Формирование АТК");
	Результат.Вставить("РасформированиеАТК",          "Расформирование АТК");
	Результат.Вставить("ДобавлениеВАТК",              "Добавление в АТК");
	Результат.Вставить("ИзъятиеИзАТК",                "Изъятие из АТК");
	Результат.Вставить("КорректировкаСведенийОКодах", "Корректировка сведений о кодах");
	Результат.Вставить("РасформированиеНаборов",      "Расформирование наборов");
	Результат.Вставить("УведомлениеОСостоянииКодов",  "Уведомление о состоянии кодов");
	Результат.Вставить("РезервированиеПартий",        "Резервирование партий");
	
	// Служебные операции
	Результат.Вставить("РезервированиеОднойПартии",                    "Резервирование одной партии");
	Результат.Вставить("РегистрацияПакетаАгрегатов",                   "Регистрация пакета агрегатов");
	Результат.Вставить("РасформированиеАгрегатаВГИС",                  "Расформирование агрегата в ГИС МТ");
	Результат.Вставить("НаполнениеОдногоАгрегатаНаТСД",                "Наполнение одного агрегата на ТСД");
	Результат.Вставить("НаполнениеПакетаАгрегатовНаТСД",               "Наполнение пакета агрегатов на ТСД");
	Результат.Вставить("РегистрацияСтрокиОтчетаОНанесении",            "Регистрация строки отчета о нанесении");
	Результат.Вставить("РегистрацияСтрокиВводаВОборот",                "Регистрация строки ввода в оборот");
	Результат.Вставить("РегистрацияСтрокиНаборов",                     "Регистрация строки наборов");
	Результат.Вставить("РегистрацияСтрокиКорректировкиСведенийОКодах", "Регистрация строки корректировки сведений о кодах");
	Результат.Вставить("РегистрацияСтрокиПеремаркировки",              "Регистрация строки перемаркировки");
	Результат.Вставить("РегистрацияСтрокиКИГУ",                        "Регистрация строки КИГУ");
	Результат.Вставить("РегистрацияСтрокиУведомленияОСостоянииКодов",  "Регистрация строки уведомления о состоянии кодов");
	
	// Устаревшие операции
	Результат.Вставить("СверкаНаПриемке",               "Сверка на приемке");
	Результат.Вставить("СвободныйОстаток",              "Свободный остаток");
	Результат.Вставить("РезервДокументаУчета",          "Резерв документа учета");
	Результат.Вставить("ОбновлениеСтатусовКодов",       "Обновление статусов кодов");
	Результат.Вставить("РегистрацияОдногоАгрегатаВГИС", "Регистрация одного агрегата в ГИС МТ");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ТипыОплатыКодов() Экспорт
	
	КлючКэш = "ТипыОплатыКодов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПоЭмиссии", "Оплата по эмиссии");
	Результат.Вставить("ПоНанесению", "Оплата по нанесению");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ТипыНаборов() Экспорт
	
	КлючКэш = "ТипыНаборов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("Мультитоварный", "Мультитоварный");
	Результат.Вставить("Монотоварный", "Монотоварный");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ТипыОтгрузок() Экспорт
	
	КлючКэш = "ТипыОтгрузок";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ТрансграничнаяТорговля", "Трансграничная торговля");
	Результат.Вставить("ОтгрузкаСВыводомИзОборота", "Отгрузка с выводом из оборота");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ТипыСроковГодности() Экспорт
	
	КлючКэш = "ТипыСроковГодности";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("СрокГодностиМеньше72", "Срок годности меньше 72 часов");
	Результат.Вставить("СрокГодностиБольше72", "Срок годности больше 72 часов");
	Результат.Вставить("СрокГодностиБольше72СУсловием", "Срок годности больше 72 часов с условием");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ТипыКодовМаркировки() Экспорт
	
	КлючКэш = "ТипыКодовМаркировки";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Для каждого Значение Из Метаданные.Перечисления.КонтурМаркировка_ТипыКодовМаркировки.ЗначенияПеречисления Цикл
		Результат.Вставить(Значение.Имя, Перечисления.КонтурМаркировка_ТипыКодовМаркировки[Значение.Имя]);
	КонецЦикла;
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ТипыПроизводственныхЗаказов() Экспорт
	
	КлючКэш = "ТипыПроизводственныхЗаказов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("СобственноеПроизводство", "Собственное производство");
	Результат.Вставить("КонтрактноеПроизводство", "Контрактное производство");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_СостоянияКодов() Экспорт
	
	КлючКэш = "СостоянияКодов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОтгрузкаНаЭкспорт", "Запланирована отгрузка на экспорт");
	Результат.Вставить("ОтменаОтгрузкиНаЭкспорт", "Отмена отгрузки на экспорт");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_СпособыВводаВОборот() Экспорт
	
	КлючКэш = "СпособыВводаВОборот";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПроизводствоРФ"		, "Производство в РФ");
	Результат.Вставить("Остатки"			, "Маркировка остатков");
	Результат.Вставить("Импорт"				, "Импорт в РФ");
	Результат.Вставить("ИмпортФТС"			, "Импорт (ФТС)");
	Результат.Вставить("Трансгран"			, "Трансграничная торговля");
	Результат.Вставить("ПроизводствоЕАЭС"	, "Контрактное производство в ЕАЭС");
	Результат.Вставить("СПричиной"			, "С причиной");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_СпособыВыпускаТоваров() Экспорт
	
	КлючКэш = "СпособыВыпускаТоваров";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПроизводствоРФ", "Производство в РФ");
	Результат.Вставить("Импорт", "Импорт в РФ");
	Результат.Вставить("Остатки", "Маркировка остатков");
	Результат.Вставить("Перемаркировка", "Перемаркировка");
	Результат.Вставить("МаркировкаВнеПроизводстваИлиИмпорта", "Маркировка вне производства или импорта");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ПричиныВыбытияКодов() Экспорт
	
	КлючКэш = "ПричиныВыбытияКодов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("Брак"						, "Брак");
	Результат.Вставить("ИстекСрокГодности"			, "Истек срок годности");
	Результат.Вставить("ЛабораторныеОбразцы"		, "Лабораторные образцы");
	Результат.Вставить("ОтзывСРынка"				, "Отзыв с рынка");
	Результат.Вставить("Рекламации"					, "Рекламации");
	Результат.Вставить("ТестированиеПродукта"		, "Тестирование продукта");
	Результат.Вставить("ДемонстрационныеОбразцы"	, "Демонстрационные образцы");
	Результат.Вставить("УтратаТоваров"				, "Утрата товаров");
	Результат.Вставить("УничтожениеТоваров"			, "Уничтожение товаров");
	Результат.Вставить("ЛиквидацияПредприятия"		, "Ликвидация предприятия");
	Результат.Вставить("КонфискацияТоваров"			, "Конфискация товаров");
	Результат.Вставить("ДругиеПричины"				, "Другие причины");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ПричиныВыводаИзОборота() Экспорт
	
	КлючКэш = "ПричиныВыводаИзОборота";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("Прочее",									"Прочее");
	Результат.Вставить("РозничнаяПродажа",							"Розничная продажа");
	Результат.Вставить("ЭкспортЕАЭС",								"Экспорт в страны ЕАЭС");
	Результат.Вставить("ЭкспортЗаПределыЕАЭС",						"Экспорт за пределы стран ЕАЭС");
	Результат.Вставить("ДистанционныйСпособПродажи",				"Дистанционный способ продажи");
	Результат.Вставить("Утрата",									"Утрата или повреждение");
	Результат.Вставить("Уничтожение",								"Уничтожение");
	Результат.Вставить("Конфискация",								"Конфискация");
	Результат.Вставить("ДляСобственныхНужд",						"Использование для собственных нужд предприятия");
	Результат.Вставить("ВозвратФизическомуЛицу",					"Возврат физическому лицу");
	Результат.Вставить("ДляПроизводственныхЦелей",					"Использование для производственных целей");
	Результат.Вставить("ПродажаПоГосКонтракту",						"Продажа по государственному (муниципальному) контракту");
	Результат.Вставить("ИстечениеСрокаГодности",					"Истечение срока годности");
	Результат.Вставить("БезвозмезднаяПередача",						"Безвозмездная передача");
	Результат.Вставить("Утилизация",								"Утилизация");
	Результат.Вставить("Фасовка",									"Фасовка");
	Результат.Вставить("ПродажаЧерезВендинговыйАппарат",			"Продажа через вендинговый аппарат");
	Результат.Вставить("КорректировкаСкладскихОстатков",			"Корректировка складских остатков");
	Результат.Вставить("ПродажаПоОбразцам",							"Продажа по образцам");
	Результат.Вставить("ИспользованиеДляМедицинскогоПрименения",	"Использование для медицинского применения");
	Результат.Вставить("ИспользованиеДляВетеринарногоПрименения",	"Использование для ветеринарного применения");
	Результат.Вставить("ПродажаПоСделкеСГосударственнойТайной",		"Продажа по сделке с государственной тайной");
	Результат.Вставить("ОтзывСРынка",								"Отзыв с рынка");
	Результат.Вставить("ПересортицаПоКодам",						"Пересортица по кодам");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ПричиныВыводаИзОборотаПриОтгрузке() Экспорт
	
	КлючКэш = "ПричиныВыводаИзОборотаПриОтгрузке";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("БезвозмезднаяПередача"		, "Безвозмездная передача");
	Результат.Вставить("ПриобретениеГосПредприятием", "Приобретение гос. предприятием");
	Результат.Вставить("ДляСобственныхНужд"			, "Использование для собственных нужд");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ПричиныВозвратаВОборот() Экспорт
	
	КлючКэш = "ПричиныВозвратаВОборот";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДистанционныйСпособПродажи",
		"Возврат при дистанционном способе продажи");
	Результат.Вставить("РозничнаяРеализация",
		"Возврат при розничной реализации");
	Результат.Вставить("БезПоследующейРеализации",
		"Возврат товара, выведенного из оборота в целях, не связанных с их последующей реализацией");
	Результат.Вставить("Гостайна",
		"Возврат товара, выведенного из оборота для продажи по сделке с государственной тайной");
	Результат.Вставить("Вендинг",
		"Возврат товара, выведенного из оборота для продажи через вендинговый аппарат");
	Результат.Вставить("ОтКонечногоПокупателя",
		"Возврат товара, возвращенного покупателем, приобретавшим его в целях, не связанных с последующей реализацией");
	Результат.Вставить("ПроизводственныеЦели",
		"Возврат товара, выведенного из оборота для производственных целей");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ПричиныПеремаркировки() Экспорт
	
	КлючКэш = "ПричиныПеремаркировки";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИспорченоЛибоУтеряноСИСКМ", "Испорчено либо утеряно СИ с КМ");
	Результат.Вставить("ВозвратОтРозничногоПокупателя", "Возврат от розничного покупателя");
	Результат.Вставить("ВозвратВСлучаеДистанционнойПродажи", "Возврат в случае дистанционной продажи");
	Результат.Вставить("ВозвратОтКонечногоПокупателяЮрЛицаИП", "Возврат от конечного покупателя (юр.лица/ИП)");
	Результат.Вставить("РеализацияТоваровПриобретённыхВИныхЦелях", "Реализация товаров, приобретённых в иных целях");
	Результат.Вставить("ВозвратРанееЭкспортированногоВЕАЭС"	, "Возврат ранее экспортированного в ЕАЭС");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ВидыПервичныхДокументов() Экспорт
	
	КлючКэш = "ВидыПервичныхДокументов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("КассовыйЧек",						"Кассовый чек");
	Результат.Вставить("КассовыйЧекКоррекции",				"Кассовый чек коррекции");
	Результат.Вставить("ТоварныйЧек",						"Товарный чек");
	Результат.Вставить("ТоварнаяНакладная",					"Товарная накладная");
	Результат.Вставить("УПД",								"Универсальный передаточный документ");
	Результат.Вставить("ТаможеннаяДекларация",				"Таможенная декларация");
	Результат.Вставить("АктУничтожения",					"Акт уничтожения");
	Результат.Вставить("Прочее",							"Прочее");
	Результат.Вставить("ЭлектронныйCертификат",				"Электронный сертификат");
	Результат.Вставить("АкПротезноОртопедическогоИзделия", 	"Акт протезно-ортопедического изделия");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ВидыТранспортныхДокументов() Экспорт
	
	КлючКэш = "ВидыТранспортныхДокументов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТТН", "Товарно-транспортная накладная");
	Результат.Вставить("ЭПД", "Электронный перевозочный документ");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ВидыРазрешительныхДокументов() Экспорт
	
	КлючКэш = "ВидыРазрешительныхДокументов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("СертификатСоответствия", "Сертификат соответствия");
	Результат.Вставить("ДекларацияСоответствия", "Декларация соответствия");
	Результат.Вставить("СвидетельствоГосРегистрации", "Свидетельство о государственной регистрации");
	Результат.Вставить("РегистрационноеУдостоверение", "Регистрационное удостоверение");
	Результат.Вставить("РегистрационноеУдостоверениеВетПрепарата", "Регистрационное удостоверение вет. препарата");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ВидыКорректируемыхСведений() Экспорт
	
	КлючКэш = "ВидыКорректируемыхСведений";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("СпособВыпускаТоваров",    "Способ выпуска товаров");
	Результат.Вставить("ДатаПроизводства",        "Дата производства");
	Результат.Вставить("СрокГодности",            "Срок годности");
	Результат.Вставить("ВариативныйСрокГодности", "Вариативный срок годности");
	Результат.Вставить("ИдентификаторВСД",        "Идентификатор ВСД");
	Результат.Вставить("КодТНВЭД",                "Код ТН ВЭД");
	Результат.Вставить("РазрешительныйДокумент",  "Разрешительный документ");
	Результат.Вставить("ЛицензияНаНедра",         "Лицензия на недра");
	Результат.Вставить("ФактическийВес",          "Фактический вес");
	Результат.Вставить("НомерПартии",             "Номер партии");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ХарактеристикиСрокаИспользованияТовара() Экспорт
	
	КлючКэш = "ХарактеристикиСрокаИспользованияТовара";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("СрокСлужбы",   "СРОК СЛУЖБЫ");
	Результат.Вставить("СрокГодности", "СРОК ГОДНОСТИ");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_РолиДокументовУчета() Экспорт
	
	КлючКэш = "РолиДокументовУчета";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Отгрузка",              "Отгрузка");
	Результат.Вставить("Производство",          "Производство");
	Результат.Вставить("ВнутреннееПеремещение", "Внутреннее перемещение");
	Результат.Вставить("КорректировкаОтгрузки", "Корректировка отгрузки");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ПравилаОтраженияВЭДО() Экспорт
	
	КлючКэш = "ПравилаОтраженияВЭДО";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Для каждого Значение Из Метаданные.Перечисления.КонтурМаркировка_ПравилаОтраженияВЭДО.ЗначенияПеречисления Цикл
		Результат.Вставить(Значение.Имя, Перечисления.КонтурМаркировка_ПравилаОтраженияВЭДО[Значение.Имя]);
	КонецЦикла;
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ТипыЗаказаКодов() Экспорт
	
	КлючКэш = "ТипыЗаказаКодов";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("РасформированиеНабора", "Маркировка товаров расформированного набора");
	Результат.Вставить("РазделениеТовара", "Разделение товара");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция Перечисление_ТипыОтчетаОНанесении() Экспорт
	
	КлючКэш = "ТипыОтчетаОНанесении";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("РасформированиеНабора", "Маркировка товаров расформированного набора");
	Результат.Вставить("РазделениеТовара", "Разделение товара");
	Результат.Вставить("ОтчетОНанесении", "Отчет о нанесении");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // Перечисления

// #Область ТребованияТоварныхГрупп

Функция ВидПродукцииТребуетТипОплатыКодов(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	ПодходящиеТГ = Новый Массив;
	ПодходящиеТГ.Добавить(ВидыПродукции.Вода);
	ПодходящиеТГ.Добавить(ВидыПродукции.Пиво);
	ПодходящиеТГ.Добавить(ВидыПродукции.Бады);
	ПодходящиеТГ.Добавить(ВидыПродукции.Молоко);
	ПодходящиеТГ.Добавить(ВидыПродукции.Антисептики);
	ПодходящиеТГ.Добавить(ВидыПродукции.МедицинскиеИзделия);
	ПодходящиеТГ.Добавить(ВидыПродукции.Морепродукты);
	ПодходящиеТГ.Добавить(ВидыПродукции.Велосипеды);
	ПодходящиеТГ.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	ПодходящиеТГ.Добавить(ВидыПродукции.Консервы);
	ПодходящиеТГ.Добавить(ВидыПродукции.РастительныеМасла);
	ПодходящиеТГ.Добавить(ВидыПродукции.Ветпрепараты);
	ПодходящиеТГ.Добавить(ВидыПродукции.БезалкогольноеПиво);
	ПодходящиеТГ.Добавить(ВидыПродукции.Бакалея);
	ПодходящиеТГ.Добавить(ВидыПродукции.СтроительныеМатериалы);
	ПодходящиеТГ.Добавить(ВидыПродукции.КондитерскиеИзделия);
	
	ИзменитьМассивПоФичаФлагу(ПодходящиеТГ, ВидыПродукции.КормаДляЖивотных, ФичаФлаги.ТипОплатыКормаДляЖивотных);
	ИзменитьМассивПоФичаФлагу(ПодходящиеТГ, ВидыПродукции.Косметика, ФичаФлаги.ТипОплатыКосметика);
	ИзменитьМассивПоФичаФлагу(ПодходящиеТГ, ВидыПродукции.Электроника, ФичаФлаги.ТипОплатыЭлектроника);
	ИзменитьМассивПоФичаФлагу(ПодходящиеТГ, ВидыПродукции.МаслаИАвтомобильныеЖидкости, ФичаФлаги.ТипОплатыАвтоЖидкости);
	ИзменитьМассивПоФичаФлагу(ПодходящиеТГ, ВидыПродукции.Игрушки, ФичаФлаги.ТипОплатыИгрушки);
	ИзменитьМассивПоФичаФлагу(ПодходящиеТГ, ВидыПродукции.МясныеИзделия, ФичаФлаги.ТипОплатыМясныеИзделия);
	ИзменитьМассивПоФичаФлагу(ПодходящиеТГ, ВидыПродукции.Полуфабрикаты, ФичаФлаги.ТипОплатыПолуфабрикаты);
	ИзменитьМассивПоФичаФлагу(ПодходящиеТГ, ВидыПродукции.НоутбукиИСмартфоны, ФичаФлаги.ТипОплатыНоутбукиИСмартфоны);
	
	Возврат МассивСодержитЗначение(ПодходящиеТГ, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииТребуетРазрешительныйДокумент(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	КонтрольПарфюмерия = ФичаФлагВключен(ФичаФлаги.КонтрольРДПарфюмерия);
	КонтрольБА = ФичаФлагВключен(ФичаФлаги.КонтрольРДБезалкогольныеНапитки);
	КонтрольФототовары = ФичаФлагВключен(ФичаФлаги.КонтрольРДФототовары);
	КонтрольШины = ФичаФлагВключен(ФичаФлаги.КонтрольРДШины);
	
	Контроли = Новый Соответствие;
	Контроли.Вставить(ВидыПродукции.Вода, Истина);
	Контроли.Вставить(ВидыПродукции.Парфюмерия, КонтрольПарфюмерия);
	Контроли.Вставить(ВидыПродукции.Молоко, Истина);
	Контроли.Вставить(ВидыПродукции.Обувь, Истина);
	Контроли.Вставить(ВидыПродукции.Легпром, Истина);
	Контроли.Вставить(ВидыПродукции.БезалкогольныеНапитки, КонтрольБА);
	Контроли.Вставить(ВидыПродукции.Фототовары, КонтрольФототовары);
	Контроли.Вставить(ВидыПродукции.Шины, КонтрольШины);
	Контроли.Вставить(ВидыПродукции.Игрушки, Истина);
	Контроли.Вставить(ВидыПродукции.Пиво, Истина);
	
	Возврат (Контроли[ВидПродукции] = Истина);
	
КонецФункции

Функция ВидПродукцииТребуетСуммуНДСПриВводеВОборот(ВидПродукции) Экспорт
	
	Возврат (ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Пиво);
	
КонецФункции

Функция ВидПродукцииПоддерживаетУкороченныйФорматКодов(ВидПродукции) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляУкороченногоФорматаКодов(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииПоддерживаетПризнакПеременногоКоличестваВКарточкеТовара(ВидПродукции) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляУказанияПеременногоКоличестваВКарточкеТовара(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииПоддерживаетКоличествоВСтруктуреКодаОтчетаОНанесении(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляУказанияКоличестваВСтруктуреКодаОтчетаОНанесении(ТипОтчетаОНанесении), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииТребуетДатуПроизводстваВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	ПодходящиеВидыПродукции = ДопустимыеВидыПродукцииДляДатыПроизводстваВОтчетеОНанесении(ТипОтчетаОНанесении);
	
	УдалитьЗначениеИзМассива(ПодходящиеВидыПродукции, ВидыПродукции.Вода);
	УдалитьЗначениеИзМассива(ПодходящиеВидыПродукции, ВидыПродукции.Молоко);
	УдалитьЗначениеИзМассива(ПодходящиеВидыПродукции, ВидыПродукции.Антисептики);
	УдалитьЗначениеИзМассива(ПодходящиеВидыПродукции, ВидыПродукции.Оптоволокно);
	
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетДатуПроизводстваВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	ПодходящиеВидыПродукции = ДопустимыеВидыПродукцииДляДатыПроизводстваВОтчетеОНанесении(ТипОтчетаОНанесении);
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетДатуПроизводстваВОтчетеОНанесенииДляКИНКИГУ(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	ПодходящиеТГ = ДопустимыеВидыПродукцииДляДатыПроизводстваВОтчетеОНанесенииКИНКИГУ(ТипОтчетаОНанесении);
	
	Возврат МассивСодержитЗначение(ПодходящиеТГ, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетПлощадкуВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляПлощадокВОтчетеОНанесении(ТипОтчетаОНанесении), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетПлощадкуВВыводеИзОборота(ВидПродукции, ПричинаВыводаИзОборота) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ПричиныВывода = Перечисление_ПричиныВыводаИзОборота();
	
	Если ВидПродукции = ВидыПродукции.Пиво
		И ПричинаВыводаИзОборота = ПричиныВывода.ПродажаПоГосКонтракту Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляПлощадок(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииТребуетПлощадкуВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении)
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	ДопустимыеТГ = ДопустимыеВидыПродукцииДляПлощадокВОтчетеОНанесении(ТипОтчетаОНанесении);
	УдалитьЗначениеИзМассива(ДопустимыеТГ, ВидыПродукции.Бады);
	
	ИзменитьМассивПоФичаФлагу(ДопустимыеТГ, ВидыПродукции.БезалкогольноеПиво, ФичаФлаги.КонтрольПлощадкаНанесениеБезалкогольноеПиво);
	
	Возврат МассивСодержитЗначение(ДопустимыеТГ, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетОСУ(ВидПродукции) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляОСУ(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетВнутреннееПеремещение(ВидПродукции) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляВнутреннегоПеремещения(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииПоддерживаетПартионныйУчет(ВидПродукции) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляПартионногоУчета(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииПоддерживаетНоминальноеКоличество(ВидПродукции) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляУказанияНоминальногоКоличества(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетУказаниеФактическогоСодержанияСпирта(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	ТипыОтчетаОНанесении = Перечисление_ТипыОтчетаОНанесении();
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	ПодходящиеВидыПродукции = Новый Массив;
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Пиво);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Косметика);
	
	Если ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РасформированиеНабора Тогда
		УдалитьЗначениеИзМассива(ПодходящиеВидыПродукции, ВидыПродукции.Косметика);
	КонецЕсли;
	
	Результат = (ПодходящиеВидыПродукции.Найти(ВидПродукции) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ВидПродукцииДопускаетУказаниеРазрешительнойДокументации(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Исключения = Новый Массив;
	Исключения.Добавить(ВидыПродукции.Бады);
	Исключения.Добавить(ВидыПродукции.Ветпрепараты);
	
	Возврат Не МассивСодержитЗначение(Исключения, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетКорректировкуСведенийОКодах(ВидПродукции) Экспорт
	
	ПодходящиеВидыПродукции = ДопустимыеВидыПродукцииДляКорректировкиСведенийОКодах();
	
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетОтменуВыводаИзОборота(ВидПродукции, ОбъемноСортовойУчет) Экспорт
	
	ДопустимыеВидыПродукции = ДопустимыеВидыПродукцииДляВыводаИзОборота(ОбъемноСортовойУчет);
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетНомерПартииВОтчетеОНанесении(ВидПродукции) Экспорт
	
	Если ВидПродукцииТребуетУказатьНомерПартииИлиНомерСерииИлиЗСН(ВидПродукции) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ВидПродукцииПоддерживаетПартионныйУчет(ВидПродукции) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ВидПродукцииДопускаетРезервированиеПартийВОтчетеОНанесении(ВидПродукции) Экспорт
	
	Если ВидПродукцииПоддерживаетПартионныйУчет(ВидПродукции) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ВидПродукцииДопускаетНомерСерииВОтчетеОНанесении(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	ДопустимыеВидыПродукции = Новый Массив;
	ДопустимыеВидыПродукции.Добавить(ВидыПродукции.Ветпрепараты);
	ДопустимыеВидыПродукции.Добавить(ВидыПродукции.МедицинскиеИзделия);
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ТипыОтчетовОНанесении = Перечисление_ТипыОтчетаОНанесении();
	
	ПодходящиеВидыПродукции = Новый Массив;
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Молоко);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Бады);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Пиво);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Вода);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.МедицинскиеИзделия);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Морепродукты);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Косметика);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Консервы);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Ветпрепараты);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.РастительныеМасла);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.КормаДляЖивотных);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.БезалкогольноеПиво);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Игрушки);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Антисептики);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.СтроительныеМатериалы);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Бакалея);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Пиротехника);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.КондитерскиеИзделия);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.МясныеИзделия);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Полуфабрикаты);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Удобрения);
	
	Если ТипОтчетаОНанесении = ТипыОтчетовОНанесении.РасформированиеНабора Тогда
		УдалитьЗначениеИзМассива(ПодходящиеВидыПродукции, ВидыПродукции.Косметика);
		УдалитьЗначениеИзМассива(ПодходящиеВидыПродукции, ВидыПродукции.Игрушки);
	КонецЕсли;
	
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетДатуПроизводстваПриВводеВОборот(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Исключения = Новый Массив;
	ПодходящиеВидыПродукции = ВсеВидыПродукции(Исключения);
	
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетУведомлениеОСостоянииКодов(ВидПродукции)
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляУведомленияОСостоянииКодов(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииТребуетЛицензиюНаНедра(ВидПродукции, СпособВводаВОборот) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	СпособыВвода = Перечисление_СпособыВводаВОборот();
	
	Результат = Ложь;
	Если ВидПродукции = ВидыПродукции.Вода
		И СпособВводаВОборот = СпособыВвода.ПроизводствоРФ Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВидПродукцииТребуетУказатьТипСрокаГодности(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	ПодходящиеВидыПродукции = Новый Массив;
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Молоко);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.РастительныеМасла);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Бакалея);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.КондитерскиеИзделия);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.МясныеИзделия);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Полуфабрикаты);
	
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииПоддерживаетВыводИзОборотаПоОСУ(ВидПродукции) Экспорт
	
	ВидыПродукцииВыводПоОСУ = ДопустимыеВидыПродукцииДляВыводаИзОборотаОСУ();
	Результат = МассивСодержитЗначение(ВидыПродукцииВыводПоОСУ, ВидПродукции);
	
	Возврат Результат;
	
КонецФункции

Функция ВидПродукцииПоддерживаетОтчетОНанесении(ВидПродукции) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляОтчетаОНанесении(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииПоддерживаетВСД(ВидПродукции) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляВСД(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииТребуетВСД(ВидПродукции)
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляКонтроляВСД(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетАльтернативныйСрокГодности(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	НужныеТГ = Новый Массив;
	
	НужныеТГ.Добавить(ВидыПродукции.Молоко);
	НужныеТГ.Добавить(ВидыПродукции.РастительныеМасла);
	НужныеТГ.Добавить(ВидыПродукции.Бакалея);
	НужныеТГ.Добавить(ВидыПродукции.КондитерскиеИзделия);
	НужныеТГ.Добавить(ВидыПродукции.МясныеИзделия);
	НужныеТГ.Добавить(ВидыПродукции.Полуфабрикаты);
	
	Возврат МассивСодержитЗначение(НужныеТГ, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетВариативныеНаборы(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	НужныеТГ = Новый Массив;
	
	НужныеТГ.Добавить(ВидыПродукции.Электроника);
	
	Возврат МассивСодержитЗначение(НужныеТГ, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииТребуетУказатьНомерПартииИлиНомерСерииИлиЗСН(ВидПродукции)
	
	Возврат (ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.МедицинскиеИзделия);
	
КонецФункции

Функция ВидПродукцииТребуетНомерСерииВОтчетеОНанесении(ВидПродукции) Экспорт
	
	Возврат (ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Ветпрепараты);
	
КонецФункции

Функция ВидПродукцииТребуетУказанияКоличестваВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	ДопустимыеВидыПродукции = Новый Массив;
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ТипыОтчетаОНанесении = Перечисление_ТипыОтчетаОНанесении();
	
	ДопустимыеВидыПродукции.Добавить(ВидыПродукции.Пиво);
	ДопустимыеВидыПродукции.Добавить(ВидыПродукции.БезалкогольноеПиво);
	ДопустимыеВидыПродукции.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	ДопустимыеВидыПродукции.Добавить(ВидыПродукции.Электроника);
	ДопустимыеВидыПродукции.Добавить(ВидыПродукции.МясныеИзделия);
	ДопустимыеВидыПродукции.Добавить(ВидыПродукции.КормаДляЖивотных);
	ДопустимыеВидыПродукции.Добавить(ВидыПродукции.Полуфабрикаты);
	
	Если ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РасформированиеНабора Тогда
		УдалитьЗначениеИзМассива(ДопустимыеВидыПродукции, ВидыПродукции.Электроника);
	КонецЕсли;
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииПоддерживаетЗСН(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Возврат (ВидПродукции = ВидыПродукции.МедицинскиеИзделия);
	
КонецФункции

Функция ВидПродукцииПоддерживаетСодержаниеСпирта(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	ПодходящиеВидыПродукции = Новый Массив;
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Пиво);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.БезалкогольноеПиво);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Косметика);
	
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииТребуетСрокГодностиВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляСрокаГодностиВОтчетеОНанесении(ТипОтчетаОНанесении), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииТребуетСрокГодностиВОтчетеОНанесенииДляКИНКИГУ(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	ПодходящиеВидыПродукции = Новый Массив;
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.СтроительныеМатериалы);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Пиротехника);
	
	Возврат (ПодходящиеВидыПродукции.Найти(ВидПродукции) <> Неопределено);
	
КонецФункции

Функция ВидПродукцииТребуетСрокГодностиПоХарактеристикеСрокаИспользования(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	ПодходящиеВидыПродукции = Новый Массив;
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Игрушки);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.МедицинскиеИзделия);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Косметика);
	
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииТребуетУказатьДатуПроизводстваВоВводеВОборот(ВидПродукции, СпособВводаВОборот) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	СпособыВвода = Перечисление_СпособыВводаВОборот();
	
	Если СпособВводаВОборот = СпособыВвода.ПроизводствоРФ Тогда
		
		Исключения = Новый Массив;
		Исключения.Добавить(ВидыПродукции.Шины);
		Исключения.Добавить(ВидыПродукции.Легпром);
		Результат = Не МассивСодержитЗначение(Исключения, ВидПродукции);
	
	ИначеЕсли СпособВводаВОборот = СпособыВвода.ИмпортФТС Тогда
		
		Результат = (ВидПродукции = ВидыПродукции.Молоко);
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВидПродукцииТребуетДатуПроизводстваВОтчетеОНанесенииДляКИНКИГУ(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	ПодходящиеВидыПродукции = Новый Массив;
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.СтроительныеМатериалы);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Пиротехника);
	
	Возврат (ПодходящиеВидыПродукции.Найти(ВидПродукции) <> Неопределено);
	
КонецФункции

Функция ВидПродукцииТребуетСодержаниеСпиртаВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	ПодходящиеВидыПродукции = ДопустимыеВидыПродукцииДляСодержаниеСпиртаВОтчетеОНанесении(ТипОтчетаОНанесении);
	
	Результат = (ПодходящиеВидыПродукции.Найти(ВидПродукции) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ВидПродукцииТребуетУказатьСодержаниеСпиртаТолькоДляКег(ВидПродукции) Экспорт
	
	Результат = Ложь;
	
	Если ВидПродукции = Перечисление_ВидыПродукции().Пиво
		И ФичаФлагВключен(Перечисление_ФичаФлаги().НанесениеПивоСодержаниеСпиртаТолькоКеги) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВидПродукцииДопускаетУказаниеНомераИДатыДокументаВОтчетеОНанесении(ВидПродукции) Экспорт
	
	Возврат (ВидПродукции = Перечисление_ВидыПродукции().Пиво);
	
КонецФункции

Функция ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесенииДляКИГУ(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	ПодходящиеВидыПродукции = ДопустимыеВидыПродукцииДляСрокаГодностиВОтчетеОНанесенииКИГУ(ТипОтчетаОНанесении);
	
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесенииДляКИН(ВидПродукции, ТипОтчетаОНанесении) Экспорт
	
	ПодходящиеВидыПродукции = ДопустимыеВидыПродукцииДляСрокаГодностиВОтчетеОНанесенииКИН(ТипОтчетаОНанесении);
	
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетУказаниеТипаЗаказаКодов(ВидПродукции, СпособВыпускаТоваров) Экспорт
	
	ПодходящиеВидыПродукции = ДопустимыеВидыПродукцииДляУказанияТипаЗаказаКодов(СпособВыпускаТоваров);
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетТипЗаказаКодов(ТипЗаказаКодов, ВидПродукции)

	ПодходящиеВидыПродукции = ДопустимыеТипыЗаказаКодов(ВидПродукции);
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ТипЗаказаКодов);
	
КонецФункции

Функция ВидПродукцииДопускаетТипОтчетаОНанесении(ТипОтчетаОНанесении, ТипОперации, ВидПродукции)

	ПодходящиеВидыПродукции = ДопустимыеТипыОтчетаОНанесении(ВидПродукции, ТипОперации);
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ТипОтчетаОНанесении);
	
КонецФункции

Функция ВидПродукцииДопускаетУказаниеТипаОтчетаОНанесении(ВидПродукции) Экспорт
	
	ПодходящиеВидыПродукции = ДопустимыеВидыПродукцииДляУказанияТипаОтчетаОНанесении();
	Возврат МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетВидРазрешительногоДокумента(ВидДокумента, ВидПродукции)
	
	ВидыРД = Перечисление_ВидыРазрешительныхДокументов();
	
	ДопустимыеВиды = Новый Массив;
	ДопустимыеВиды.Добавить(ВидыРД.ДекларацияСоответствия);
	
	Если ВидПродукцииДопускаетСертификатСоответствия(ВидПродукции) Тогда
		ДопустимыеВиды.Добавить(ВидыРД.СертификатСоответствия);
	КонецЕсли;
	
	Если ВидПродукцииДопускаетСвидетельствоГосРегистрации(ВидПродукции) Тогда
		ДопустимыеВиды.Добавить(ВидыРД.СвидетельствоГосРегистрации);
	КонецЕсли;
	
	Возврат МассивСодержитЗначение(ДопустимыеВиды, ВидДокумента);
	
КонецФункции

Функция ВидПродукцииДопускаетСертификатСоответствия(ВидПродукции)
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Исключения = Новый Массив;
	Исключения.Добавить(ВидыПродукции.Пиво);
	Исключения.Добавить(ВидыПродукции.Морепродукты);
	Исключения.Добавить(ВидыПродукции.КормаДляЖивотных);
	
	Возврат Не МассивСодержитЗначение(Исключения, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетСвидетельствоГосРегистрации(ВидПродукции)
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Исключения = Новый Массив;
	Исключения.Добавить(ВидыПродукции.Пиво);
	Исключения.Добавить(ВидыПродукции.Бакалея);
	Исключения.Добавить(ВидыПродукции.Велосипеды);
	Исключения.Добавить(ВидыПродукции.Пиротехника);
	Исключения.Добавить(ВидыПродукции.КормаДляЖивотных);
	Исключения.Добавить(ВидыПродукции.ПечатнаяПродукция);
	Исключения.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Исключения.Добавить(ВидыПродукции.ОтопительныеПриборы);
	
	Возврат Не МассивСодержитЗначение(Исключения, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетСпособВводаИмпорт(ВидПродукции)
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	НужныеТГ = Новый Массив;
	
	НужныеТГ.Добавить(ВидыПродукции.Косметика);
	НужныеТГ.Добавить(ВидыПродукции.Бакалея);
	
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.МедицинскиеИзделия, ФичаФлаги.ИмпортМедИзделия);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Антисептики, ФичаФлаги.ИмпортАнтисептики);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Бады, ФичаФлаги.ИмпортБады);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Легпром, ФичаФлаги.ИмпортЛегпромВолна4);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.БезалкогольноеПиво, ФичаФлаги.ИмпортБезалкогольноеПиво);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Ветпрепараты, ФичаФлаги.ИмпортВетпрепараты);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.КормаДляЖивотных, ФичаФлаги.ИмпортКормаДляЖивотных);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.РастительныеМасла, ФичаФлаги.ИмпортРастительныеМасла);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Игрушки, ФичаФлаги.ИмпортИгрушки);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Оптоволокно, ФичаФлаги.ИмпортОптоволокно);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Электроника, ФичаФлаги.ИмпортЭлектроника);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.СтроительныеМатериалы, ФичаФлаги.ИмпортСтроительныеМатериалы);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.ОтопительныеПриборы, ФичаФлаги.ИмпортОтопительныеПриборы);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Пиротехника, ФичаФлаги.ИмпортПиротехника);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.ПечатнаяПродукция, ФичаФлаги.ИмпортПечатнаяПродукция);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.МаслаИАвтомобильныеЖидкости, ФичаФлаги.ИмпортАвтоЖидкости);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.КондитерскиеИзделия, ФичаФлаги.ИмпортКондитерскиеИзделия);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Автозапчасти, ФичаФлаги.ИмпортАвтозапчасти);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.ПолимерныеТрубы, ФичаФлаги.ИмпортПолимерныеТрубы);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.МясныеИзделия, ФичаФлаги.ИмпортМясныеИзделия);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.НоутбукиИСмартфоны, ФичаФлаги.ИмпортНоутбукиИСмартфоны);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Полуфабрикаты, ФичаФлаги.ИмпортПолуфабрикаты);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.ТоварыДляДомаИИнтерьера, ФичаФлаги.ИмпортТоварыДляДома);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Удобрения, ФичаФлаги.ИмпортУдобрения);
	
	Возврат МассивСодержитЗначение(НужныеТГ, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетСпособВводаИмпортФТС(ВидПродукции)
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	НужныеТГ = Новый Массив;
	НужныеТГ.Добавить(ВидыПродукции.Вода);
	НужныеТГ.Добавить(ВидыПродукции.Пиво);
	НужныеТГ.Добавить(ВидыПродукции.Шины);
	НужныеТГ.Добавить(ВидыПродукции.Обувь);
	НужныеТГ.Добавить(ВидыПродукции.Молоко);
	НужныеТГ.Добавить(ВидыПродукции.Легпром);
	НужныеТГ.Добавить(ВидыПродукции.Парфюмерия);
	НужныеТГ.Добавить(ВидыПродукции.Фототовары);
	НужныеТГ.Добавить(ВидыПродукции.Косметика);
	НужныеТГ.Добавить(ВидыПродукции.Игрушки);
	НужныеТГ.Добавить(ВидыПродукции.Морепродукты);
	НужныеТГ.Добавить(ВидыПродукции.Велосипеды);
	НужныеТГ.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	НужныеТГ.Добавить(ВидыПродукции.Консервы);
	НужныеТГ.Добавить(ВидыПродукции.МедицинскиеИзделия);
	НужныеТГ.Добавить(ВидыПродукции.Антисептики);
	НужныеТГ.Добавить(ВидыПродукции.Бады);
	НужныеТГ.Добавить(ВидыПродукции.Бакалея);
	
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.БезалкогольноеПиво, ФичаФлаги.ИмпортФТСБезалкогольноеПиво);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Ветпрепараты, ФичаФлаги.ИмпортФТСВетпрепараты);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.КормаДляЖивотных, ФичаФлаги.ИмпортФТСКормаДляЖивотных);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.РастительныеМасла, ФичаФлаги.ИмпортФТСРастительныеМасла);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Оптоволокно, ФичаФлаги.ИмпортФТСОптоволокно);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Электроника, ФичаФлаги.ИмпортФТСЭлектроника);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.СтроительныеМатериалы, ФичаФлаги.ИмпортФТССтройМатериалы);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.ОтопительныеПриборы, ФичаФлаги.ИмпортФТСОтопительныеПриборы);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Пиротехника, ФичаФлаги.ИмпортФТСПиротехника);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.ПечатнаяПродукция, ФичаФлаги.ИмпортФТСПечатнаяПродукция);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.МаслаИАвтомобильныеЖидкости, ФичаФлаги.ИмпортФТСАвтоЖидкости);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.КондитерскиеИзделия, ФичаФлаги.ИмпортФТСКондитерскиеИзделия);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Автозапчасти, ФичаФлаги.ИмпортФТСАвтозапчасти);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.ПолимерныеТрубы, ФичаФлаги.ИмпортФТСПолимерныеТрубы);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.МясныеИзделия, ФичаФлаги.ИмпортФТСМясныеИзделия);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.НоутбукиИСмартфоны, ФичаФлаги.ИмпортФТСНоутбукиИСмартфоны);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Полуфабрикаты, ФичаФлаги.ИмпортФТСПолуфабрикаты);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.ТоварыДляДомаИИнтерьера, ФичаФлаги.ИмпортФТСТоварыДляДома);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Удобрения, ФичаФлаги.ИмпортФТСУдобрения);
	
	Возврат МассивСодержитЗначение(НужныеТГ, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетСпособВводаОстатки(ВидПродукции)
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	НужныеТГ = Новый Массив;
	НужныеТГ.Добавить(ВидыПродукции.Шины);
	
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Антисептики, ФичаФлаги.ОстаткиВводВОборотАнтисептики);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Легпром, ФичаФлаги.ОстаткиЛегпромВолна4);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Велосипеды, ФичаФлаги.ОстаткиВводВОборотВелосипеды);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.МаслаИАвтомобильныеЖидкости, ФичаФлаги.ОстаткиАвтоЖидкости);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Игрушки, ФичаФлаги.ОстаткиВводВОборотИгрушки);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Косметика, ФичаФлаги.ОстаткиВводВОборотКосметикаВолна4);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Бады, ФичаФлаги.ОстаткиВводВОборотБадыВолна3);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.Электроника, ФичаФлаги.ОстаткиВводВОборотЭлектроника);
	ИзменитьМассивПоФичаФлагу(НужныеТГ, ВидыПродукции.НоутбукиИСмартфоны, ФичаФлаги.ОстаткиВводВОборотНоутбукиИСмартфоны);
	
	Возврат МассивСодержитЗначение(НужныеТГ, ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетСпособВыпускаМаркировкаВнеПроизводстваИлиИмпорта(ВидПродукции)
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляМаркировкиВнеПроизводстваИлиИмпорта(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетСообщениеОбОтгрузкеБеларусь(ВидПродукции)
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыПродукцииДляСообщенияОбОтгрузкеБеларусь(), ВидПродукции);
	
КонецФункции

Функция ВидПродукцииДопускаетСообщениеОбОтгрузкеКазахстан(ВидПродукции)
	
	Возврат (ВидПродукции = Перечисление_ВидыПродукции().Обувь);
	
КонецФункции

Функция ВидПродукцииДопускаетПричинуПеремаркировкиИспорченоЛибоУтеряноСИСКМ(ВидПродукции)
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	НужныеТГ = Новый Массив;
	НужныеТГ.Добавить(ВидыПродукции.МедицинскиеИзделия);
	НужныеТГ.Добавить(ВидыПродукции.Антисептики);
	НужныеТГ.Добавить(ВидыПродукции.Бады);
	НужныеТГ.Добавить(ВидыПродукции.Ветпрепараты);
	НужныеТГ.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	НужныеТГ.Добавить(ВидыПродукции.БезалкогольноеПиво);
	НужныеТГ.Добавить(ВидыПродукции.Косметика);
	НужныеТГ.Добавить(ВидыПродукции.СтроительныеМатериалы);
	НужныеТГ.Добавить(ВидыПродукции.Игрушки);
	
	Возврат МассивСодержитЗначение(НужныеТГ, ВидПродукции);
	
КонецФункции

Функция ТоварТребуетЛицензиюНаНедра(Товар)
	
	ОписаниеТовара = Товар_Прочитать(Товар);
	
	Если ОписаниеТовара.ВидПродукции <> Перечисление_ВидыПродукции().Вода Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат (Не ОписаниеТовара.ДопРеквизиты.НеДобываетсяИзПодземныхВод);
	
КонецФункции

Функция ТоварДопускаетЗаказКодовНаОстатки(Товар) Экспорт
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	РазрешеныОстаткиЛегпром = ФичаФлагВключен(ФичаФлаги.ОстаткиЛегпромВолна4);
	РазрешеныОстаткиАнтисептики = ФичаФлагВключен(ФичаФлаги.ОстаткиЗаказКодовАнтисептики);
	РазрешеныОстаткиАвтоЖидкости = ФичаФлагВключен(ФичаФлаги.ОстаткиАвтоЖидкости);
	
	Результат =
	РазрешеныОстаткиЛегпром И ЭтоТоварЛегпромаВолна4(Товар)
	Или РазрешеныОстаткиАнтисептики И ЭтоТоварАнтисептиков(Товар)
	Или РазрешеныОстаткиАвтоЖидкости И ЭтоТоварАвтоЖидкостей(Товар);
	
	Возврат Результат;
	
КонецФункции

Функция ТоварПодлежитПартионномуУчету(Товар) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Ложь;
	
	Если Товар.ВидПродукции = ВидыПродукции.Молоко Тогда
		СрокХраненияДо40Суток = ДопРеквизит_Прочитать(Товар, "СрокХраненияДо40Суток", Ложь);
		Результат = ФичаФлагВключен(ФичаФлаги.ПартионныйУчетМолокоСрокХраненияДо40Суток)
		ИЛИ (ФичаФлагВключен(ФичаФлаги.ПартионныйУчетМолокоСрокХраненияСвыше40Суток) И Не СрокХраненияДо40Суток);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ХарактеристикаСрокаИспользованияТребуетСрокГодности(Товар) Экспорт
	
	Результат = Ложь;
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	ХарактеристикиСрока = Перечисление_ХарактеристикиСрокаИспользованияТовара();
	ОписаниеТовара = Товар_Прочитать(Товар);
	
	Если ОписаниеТовара.ТипКодаМаркировки = ТипыКодовМаркировки.ЕдиницаТовара
		И ОписаниеТовара.ДопРеквизиты.ХарактеристикаСрокаИспользования = ХарактеристикиСрока.СрокГодности Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТипКодаМаркировкиДопускаетПеремаркировку(ТипКодаМаркировки)
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	Исключения = Новый Массив;
	Исключения.Добавить(ТипыКодовМаркировки.Набор);
	Исключения.Добавить(ТипыКодовМаркировки.ГрупповаяУпаковка);
	
	Возврат Не МассивСодержитЗначение(Исключения, ТипКодаМаркировки);
	
КонецФункции

Функция ТипКодаМаркировкиДопускаетМаркировкуВнеПроизводстваИлиИмпорта(ТипКодаМаркировки)
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	Возврат ТипКодаМаркировки = ТипыКодовМаркировки.ЕдиницаТовара;
	
КонецФункции

Функция ТипКодаМаркировкиДопускаетУказаниеНомераПартииВОтчетеОНанесении(ТипКодаМаркировки) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеТипыКодовМаркировкиДляУказанияПартийВОтчетеОНанесении(), ТипКодаМаркировки);
	
КонецФункции

Функция СпособВводаВОборотТребуетРД(СпособВводаВОборот, ВидПродукции)
	
	СпособыВвода = Перечисление_СпособыВводаВОборот();
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	ДопустимыеСпособыВводаВОборот = Новый Массив;
	ДопустимыеСпособыВводаВОборот.Добавить(СпособыВвода.Трансгран);
	
	Если ВидПродукции <> ВидыПродукции.Пиво Тогда
		ДопустимыеСпособыВводаВОборот.Добавить(СпособыВвода.ПроизводствоРФ);
	КонецЕсли;
	
	Если ВидПродукции <> ВидыПродукции.Игрушки
		И ВидПродукции <> ВидыПродукции.Пиво Тогда
		ДопустимыеСпособыВводаВОборот.Добавить(СпособыВвода.Импорт);
		ДопустимыеСпособыВводаВОборот.Добавить(СпособыВвода.ПроизводствоЕАЭС);
	КонецЕсли;
	
	Возврат МассивСодержитЗначение(ДопустимыеСпособыВводаВОборот, СпособВводаВОборот);
	
КонецФункции

Функция СпособВводаВОборотТребуетТНВЭД(СпособВводаВОборот) Экспорт
	
	СпособыВвода = Перечисление_СпособыВводаВОборот();
	
	ПодходящиеСпособы = Новый Массив;
	ПодходящиеСпособы.Добавить(СпособыВвода.Импорт);
	ПодходящиеСпособы.Добавить(СпособыВвода.Трансгран);
	ПодходящиеСпособы.Добавить(СпособыВвода.ПроизводствоРФ);
	ПодходящиеСпособы.Добавить(СпособыВвода.ПроизводствоЕАЭС);
	
	Возврат МассивСодержитЗначение(ПодходящиеСпособы, СпособВводаВОборот);
	
КонецФункции

Функция СпособВводаВОборотТребуетКПППлощадки(СпособВводаВОборот)
	
	Результат = Ложь;
	
	СпособыВвода = Перечисление_СпособыВводаВОборот();
	Если СпособВводаВОборот = СпособыВвода.ИмпортФТС
		Или СпособВводаВОборот = СпособыВвода.Трансгран Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПричинаВыводаИзОборотаТребуетУказатьЦену(ПричинаВыводаИзОборота, ЕстьИННПолучателя) Экспорт
	
	ПричиныВывода = Перечисление_ПричиныВыводаИзОборота();
	
	ДопустимыеПричины = Новый Массив;
	ДопустимыеПричины.Добавить(ПричиныВывода.РозничнаяПродажа);
	ДопустимыеПричины.Добавить(ПричиныВывода.ДистанционныйСпособПродажи);
	ДопустимыеПричины.Добавить(ПричиныВывода.ПродажаЧерезВендинговыйАппарат);
	ДопустимыеПричины.Добавить(ПричиныВывода.Фасовка);
	ДопустимыеПричины.Добавить(ПричиныВывода.ПродажаПоОбразцам);
	
	Если ЕстьИННПолучателя Тогда
		ДопустимыеПричины.Добавить(ПричиныВывода.ДляСобственныхНужд);
		ДопустимыеПричины.Добавить(ПричиныВывода.ДляПроизводственныхЦелей);
	КонецЕсли;
	
	Возврат МассивСодержитЗначение(ДопустимыеПричины, ПричинаВыводаИзОборота);
	
КонецФункции

Функция ПричинаВыводаИзОборотаДопускаетУказаниеЦены(ПричинаВыводаИзОборота) Экспорт
	
	ПричиныВывода = Перечисление_ПричиныВыводаИзОборота();
	
	ДопустимыеПричины = Новый Массив;
	ДопустимыеПричины.Добавить(ПричиныВывода.ДляСобственныхНужд);
	ДопустимыеПричины.Добавить(ПричиныВывода.ДляПроизводственныхЦелей);
	ДопустимыеПричины.Добавить(ПричиныВывода.БезвозмезднаяПередача);
	
	Возврат МассивСодержитЗначение(ДопустимыеПричины, ПричинаВыводаИзОборота);
	
КонецФункции

Функция ПричинаВыводаИзОборотаДопускаетИННПолучателя(ПричинаВыводаИзОборота) Экспорт
	
	ПричиныВывода = Перечисление_ПричиныВыводаИзОборота();
	
	ДопустимыеПричины = Новый Массив;
	ДопустимыеПричины.Добавить(ПричиныВывода.ДляСобственныхНужд);
	ДопустимыеПричины.Добавить(ПричиныВывода.ДляПроизводственныхЦелей);
	
	Возврат МассивСодержитЗначение(ДопустимыеПричины, ПричинаВыводаИзОборота);
	
КонецФункции

Функция ПричинаВыводаИзОборотаТребуетИННПолучателя(ПричинаВыводаИзОборота) Экспорт
	
	ПричиныВывода = Перечисление_ПричиныВыводаИзОборота();
	
	Если ПричинаВыводаИзОборота = ПричиныВывода.ЭкспортЕАЭС
		Или ПричинаВыводаИзОборота = ПричиныВывода.БезвозмезднаяПередача Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПричинаВыводаИзОборотаТребуетПервичныйДокумент(ПричинаВыводаИзОборота) Экспорт
	
	Причины = Перечисление_ПричиныВыводаИзОборота();
	
	ПодходящиеПричины = Новый Массив;
	ПодходящиеПричины.Добавить(Причины.РозничнаяПродажа);
	ПодходящиеПричины.Добавить(Причины.ЭкспортЗаПределыЕАЭС);
	ПодходящиеПричины.Добавить(Причины.Утрата);
	ПодходящиеПричины.Добавить(Причины.Уничтожение);
	ПодходящиеПричины.Добавить(Причины.Конфискация);
	ПодходящиеПричины.Добавить(Причины.ДляСобственныхНужд);
	ПодходящиеПричины.Добавить(Причины.ВозвратФизическомуЛицу);
	ПодходящиеПричины.Добавить(Причины.Прочее);
	ПодходящиеПричины.Добавить(Причины.ДляПроизводственныхЦелей);
	ПодходящиеПричины.Добавить(Причины.ИстечениеСрокаГодности);
	ПодходящиеПричины.Добавить(Причины.БезвозмезднаяПередача);
	ПодходящиеПричины.Добавить(Причины.Утилизация);
	ПодходящиеПричины.Добавить(Причины.КорректировкаСкладскихОстатков);
	ПодходящиеПричины.Добавить(Причины.ИспользованиеДляМедицинскогоПрименения);
	ПодходящиеПричины.Добавить(Причины.ИспользованиеДляВетеринарногоПрименения);
	ПодходящиеПричины.Добавить(Причины.ПересортицаПоКодам);
	ПодходящиеПричины.Добавить(Причины.ОтзывСРынка);
	
	Возврат МассивСодержитЗначение(ПодходящиеПричины, ПричинаВыводаИзОборота);
	
КонецФункции

Функция ПричинаВыводаИзОборотаДопускаетПервичныйДокумент(ПричинаВыводаИзОборота) Экспорт
	
	ПричиныВывода = Перечисление_ПричиныВыводаИзОборота();
	
	ДопустимыеПричины = Новый Массив;
	ДопустимыеПричины.Добавить(ПричиныВывода.Фасовка);
	ДопустимыеПричины.Добавить(ПричиныВывода.ДистанционныйСпособПродажи);
	ДопустимыеПричины.Добавить(ПричиныВывода.ПродажаЧерезВендинговыйАппарат);
	ДопустимыеПричины.Добавить(ПричиныВывода.ПродажаПоОбразцам);
	
	Возврат МассивСодержитЗначение(ДопустимыеПричины, ПричинаВыводаИзОборота);
	
КонецФункции

Функция ПричинаВыводаИзОборотаТребуетКПППлощадки(ПричинаВыводаИзОборота, ВидПродукции, ИНН)
	
	ДопустимыеПричины = Новый Массив;
	
	ПричиныВыводаИзОборота = Перечисление_ПричиныВыводаИзОборота();
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Если Не ЭтоИП(ИНН) Тогда
		
		Если ЭтоНикотиносодержащаяПродукция(ВидПродукции) Тогда
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.ЭкспортЕАЭС);
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.ЭкспортЗаПределыЕАЭС);
		КонецЕсли;
		
		Если ВидПродукции = ВидыПродукции.Пиво Тогда
			
			Для Каждого КлючЗначение Из ПричиныВыводаИзОборота Цикл
				Если КлючЗначение.Значение = ПричиныВыводаИзОборота.ПродажаПоГосКонтракту Тогда
					Продолжить;
				КонецЕсли;
				ДопустимыеПричины.Добавить(КлючЗначение.Значение);
			КонецЦикла;
			
		КонецЕсли;
		
		Если ВидПродукции = ВидыПродукции.Ветпрепараты
			И ФичаФлагВключен(ФичаФлаги.ВыводИзОборотаВетпрепаратыУказаниеМОД) Тогда
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.БезвозмезднаяПередача);
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.Прочее);
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.ИспользованиеДляВетеринарногоПрименения);
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.ДляПроизводственныхЦелей);
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.ДляСобственныхНужд);
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.ИстечениеСрокаГодности);
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.Конфискация);
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.Уничтожение);
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.Утилизация);
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.Утрата);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивСодержитЗначение(ДопустимыеПричины, ПричинаВыводаИзОборота);
	
КонецФункции

Функция ПричинаВыводаИзОборотаТребуетФИАСПлощадки(ПричинаВыводаИзОборота, ВидПродукции, ИНН)
	
	ПричиныВыводаИзОборота = Перечисление_ПричиныВыводаИзОборота();
	ДопустимыеПричины = Новый Массив;
	
	Если ЭтоНикотиносодержащаяПродукция(ВидПродукции) Тогда
		
		Если ЭтоИП(ИНН) Тогда
			
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.ЭкспортЕАЭС);
			ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.ЭкспортЗаПределыЕАЭС);
			
		КонецЕсли;
		
		ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.РозничнаяПродажа);
		ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.Уничтожение);
		ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.Конфискация);
		ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.Прочее);
		ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.Утилизация);
		ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.ОтзывСРынка);
		ДопустимыеПричины.Добавить(ПричиныВыводаИзОборота.Утрата);
		
	КонецЕсли;
	
	Возврат МассивСодержитЗначение(ДопустимыеПричины, ПричинаВыводаИзОборота);
	
КонецФункции

Функция ПричинаВозвратаВОборотТребуетПервичныйДокумент(ПричинаВозвратаВОборот, ТоварОплачен) Экспорт
	
	Причины = Перечисление_ПричиныВозвратаВОборот();
	
	ПодходящиеПричиныВозврата = Новый Массив;
	ПодходящиеПричиныВозврата.Добавить(Причины.БезПоследующейРеализации);
	ПодходящиеПричиныВозврата.Добавить(Причины.РозничнаяРеализация);
	
	Если ТоварОплачен Тогда
		ПодходящиеПричиныВозврата.Добавить(Причины.ДистанционныйСпособПродажи);
	КонецЕсли;
	
	Результат = (ПодходящиеПричиныВозврата.Найти(ПричинаВозвратаВОборот) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ПричинаВозвратаВОборотДопускаетУказаниеРазрешительнойДокументации(ПричинаВозвратаВОборот) Экспорт
	
	ПричиныВозврата = Перечисление_ПричиныВозвратаВОборот();
	
	НеДопустимыеПричины = Новый Массив;
	НеДопустимыеПричины.Добавить(ПричиныВозврата.Гостайна);
	НеДопустимыеПричины.Добавить(ПричиныВозврата.Вендинг);
	НеДопустимыеПричины.Добавить(ПричиныВозврата.БезПоследующейРеализации);
	
	Возврат Не МассивСодержитЗначение(НеДопустимыеПричины, ПричинаВозвратаВОборот);
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляДатыПроизводстваВОтчетеОНанесенииКИНКИГУ(ТипОтчетаОНанесении) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = ДопустимыеВидыПродукцииДляДатыПроизводстваВОтчетеОНанесении(ТипОтчетаОНанесении);
	
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Молоко);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.БезалкогольныеНапитки);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Пиво);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.БезалкогольноеПиво);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.ПолимерныеТрубы);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.ТоварыДляДомаИИнтерьера);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляДатыПроизводстваВОтчетеОНанесении(ТипОтчетаОНанесении) Экспорт
	
	ТипыОтчетаОНанесении = Перечисление_ТипыОтчетаОНанесении();
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.МедицинскиеИзделия);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.Ветпрепараты);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.Вода);
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.Игрушки);
	Результат.Добавить(ВидыПродукции.Велосипеды);
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.Электроника);
	Результат.Добавить(ВидыПродукции.Оптоволокно);
	Результат.Добавить(ВидыПродукции.ОтопительныеПриборы);
	Результат.Добавить(ВидыПродукции.Бакалея);
	Результат.Добавить(ВидыПродукции.СтроительныеМатериалы);
	Результат.Добавить(ВидыПродукции.Пиротехника);
	Результат.Добавить(ВидыПродукции.ПечатнаяПродукция);
	Результат.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	Результат.Добавить(ВидыПродукции.КондитерскиеИзделия);
	Результат.Добавить(ВидыПродукции.Автозапчасти);
	Результат.Добавить(ВидыПродукции.ПолимерныеТрубы);
	Результат.Добавить(ВидыПродукции.МясныеИзделия);
	Результат.Добавить(ВидыПродукции.НоутбукиИСмартфоны);
	Результат.Добавить(ВидыПродукции.ТоварыДляДомаИИнтерьера);
	Результат.Добавить(ВидыПродукции.Полуфабрикаты);
	Результат.Добавить(ВидыПродукции.Удобрения);
	
	Если ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РасформированиеНабора Тогда
		УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Электроника);
		УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Косметика);
		УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Игрушки);
	КонецЕсли;
	
	Если ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РазделениеТовара Тогда
		УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Электроника);
	КонецЕсли;
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Антисептики, ФичаФлаги.КонтрольДатаПроизводстваНанесениеАнтисептики);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляУкороченногоФорматаКодов()
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.Оптоволокно);
	Результат.Добавить(ВидыПродукции.Электроника);
	Результат.Добавить(ВидыПродукции.СтроительныеМатериалы);
	Результат.Добавить(ВидыПродукции.Бакалея);
	Результат.Добавить(ВидыПродукции.ОтопительныеПриборы);
	Результат.Добавить(ВидыПродукции.Игрушки);
	Результат.Добавить(ВидыПродукции.Пиротехника);
	Результат.Добавить(ВидыПродукции.КондитерскиеИзделия);
	Результат.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	Результат.Добавить(ВидыПродукции.Автозапчасти);
	Результат.Добавить(ВидыПродукции.ПолимерныеТрубы);
	Результат.Добавить(ВидыПродукции.МясныеИзделия);
	Результат.Добавить(ВидыПродукции.НоутбукиИСмартфоны);
	Результат.Добавить(ВидыПродукции.Полуфабрикаты);
	Результат.Добавить(ВидыПродукции.ТоварыДляДомаИИнтерьера);
	Результат.Добавить(ВидыПродукции.Удобрения);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляУказанияПеременногоКоличестваВКарточкеТовара()
	
	ВидыПродукции = Перечисление_ВидыПродукции();

	Результат = ДопустимыеВидыПродукцииДляУказанияКоличестваВСтруктуреКодаОтчетаОНанесении();
	
	ДобавитьЗначениеВМассив(Результат, ВидыПродукции.КондитерскиеИзделия);
	ДобавитьЗначениеВМассив(Результат, ВидыПродукции.ПолимерныеТрубы);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляУказанияКоличестваВСтруктуреКодаОтчетаОНанесении(ТипОтчетаОНанесении = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ТипыОтчетаОНанесении = Перечисление_ТипыОтчетаОНанесении();
	
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.Электроника);
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.МясныеИзделия);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.Полуфабрикаты);
	
	Если ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РасформированиеНабора Тогда
		УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Электроника);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляУказанияНоминальногоКоличества()
	
	Результат = Новый Массив;
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.Электроника);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляПлощадок() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Исключения = Новый Массив;
	Исключения.Добавить(ВидыПродукции.Оптоволокно);
	Исключения.Добавить(ВидыПродукции.ОтопительныеПриборы);
	Исключения.Добавить(ВидыПродукции.Пиротехника);
	Исключения.Добавить(ВидыПродукции.ПечатнаяПродукция);
	Исключения.Добавить(ВидыПродукции.Автозапчасти);
	
	Возврат ВсеВидыПродукции(Исключения);
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляПлощадокВОтчетеОНанесении(ТипОтчетаОНанесении)
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	ВидыПродукции = Перечисление_ВидыПродукции();
	ТипыОтчетаОНанесении = Перечисление_ТипыОтчетаОНанесении();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.СтроительныеМатериалы);
	Результат.Добавить(ВидыПродукции.Электроника);
	
	Если ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РасформированиеНабора
		Или ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РазделениеТовара Тогда
		УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Электроника);
	КонецЕсли;
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.НоутбукиИСмартфоны, ФичаФлаги.ПлощадкиНоутбукиИСмартфоныНанесение);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляЗагрузкиПлощадок() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.АльтернативныйТабак);
	Результат.Добавить(ВидыПродукции.НикотиносодержащаяПродукция);
	Результат.Добавить(ВидыПродукции.Табак);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.СтроительныеМатериалы);
	Результат.Добавить(ВидыПродукции.Электроника);
	Результат.Добавить(ВидыПродукции.НоутбукиИСмартфоны);
	
	Если ФичаФлагВключен(ФичаФлаги.ЗагрузкаВсехПлощадок) Тогда
		ДополнитьМассив(Результат, ДопустимыеВидыПродукцииДляПлощадок(), Истина);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляОСУ() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.Бакалея);
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Вода, ФичаФлаги.ПравилоОтраженияОСУВода);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Косметика, ФичаФлаги.ПравилоОтраженияОСУКосметика);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Молоко, ФичаФлаги.ПравилоОтраженияОСУМолоко);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляВСД()
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.МясныеИзделия);
	Результат.Добавить(ВидыПродукции.КондитерскиеИзделия);
	Результат.Добавить(ВидыПродукции.Полуфабрикаты);
	Результат.Добавить(ВидыПродукции.Бакалея);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляКонтроляВСД()
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = ДопустимыеВидыПродукцииДляВСД();
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.КондитерскиеИзделия, ФичаФлаги.КонтрольВСД_КондитерскиеИзделия);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Полуфабрикаты, ФичаФлаги.КонтрольВСД_Полуфабрикаты);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Бакалея, ФичаФлаги.КонтрольВСД_Бакалея);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыНикотинсодержащейПродукции()
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Табак);
	Результат.Добавить(ВидыПродукции.АльтернативныйТабак);
	Результат.Добавить(ВидыПродукции.НикотиносодержащаяПродукция);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляВнутреннегоПеремещения()
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Пиво);
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Ветпрепараты, ФичаФлаги.ВнутреннееПеремещениеВетпрепараты);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляСообщенияОбОтгрузке(ТипОтгрузки, ОбъемноСортовойУчет) Экспорт
	
	ТипыОтгрузок = Перечисление_ТипыОтгрузок();
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = Новый Массив;
	
	Если ТипОтгрузки = ТипыОтгрузок.ОтгрузкаСВыводомИзОборота Тогда
		
		Результат.Добавить(ВидыПродукции.Вода);
		Результат.Добавить(ВидыПродукции.Велосипеды);
		Результат.Добавить(ВидыПродукции.МедицинскиеИзделия);
		Результат.Добавить(ВидыПродукции.Парфюмерия);
		Результат.Добавить(ВидыПродукции.Обувь);
		Результат.Добавить(ВидыПродукции.Легпром);
		Результат.Добавить(ВидыПродукции.Шины);
		
	КонецЕсли;
	
	Если ТипОтгрузки = ТипыОтгрузок.ТрансграничнаяТорговля Тогда
		
		Если ОбъемноСортовойУчет Тогда
			Результат.Добавить(ВидыПродукции.Молоко);
		Иначе
			Результат.Добавить(ВидыПродукции.Обувь);
			Результат.Добавить(ВидыПродукции.Легпром);
			Результат.Добавить(ВидыПродукции.Шины);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляСообщенияОбОтгрузкеПоОСУ() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.КонтурМаркировка_ВидыПродукции.Молоко);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляСообщенияОбОтгрузкеБеларусь()
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Обувь);
	Результат.Добавить(ВидыПродукции.Шины);
	Результат.Добавить(ВидыПродукции.Легпром);
	Результат.Добавить(ВидыПродукции.Молоко);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляТрансформацииАгрегата() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Обувь);
	Результат.Добавить(ВидыПродукции.Легпром);
	Результат.Добавить(ВидыПродукции.Шины);
	Результат.Добавить(ВидыПродукции.Парфюмерия);
	Результат.Добавить(ВидыПродукции.Фототовары);
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.Велосипеды);
	Результат.Добавить(ВидыПродукции.Вода);
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.МедицинскиеИзделия);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.Ветпрепараты);
	Результат.Добавить(ВидыПродукции.Игрушки);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.Электроника);
	Результат.Добавить(ВидыПродукции.Оптоволокно);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	Результат.Добавить(ВидыПродукции.Бакалея);
	Результат.Добавить(ВидыПродукции.ПечатнаяПродукция);
	Результат.Добавить(ВидыПродукции.СтроительныеМатериалы);
	Результат.Добавить(ВидыПродукции.Автозапчасти);
	Результат.Добавить(ВидыПродукции.КондитерскиеИзделия);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляФормированияАТК() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Обувь);
	Результат.Добавить(ВидыПродукции.Легпром);
	Результат.Добавить(ВидыПродукции.Шины);
	Результат.Добавить(ВидыПродукции.Парфюмерия);
	Результат.Добавить(ВидыПродукции.Фототовары);
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.МедицинскиеИзделия);
	Результат.Добавить(ВидыПродукции.Вода);
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.Ветпрепараты);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.Велосипеды);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.Бакалея);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.СтроительныеМатериалы);
	Результат.Добавить(ВидыПродукции.Игрушки);
	Результат.Добавить(ВидыПродукции.КондитерскиеИзделия);
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.МаслаИАвтомобильныеЖидкости, ФичаФлаги.ФормированиеАТКАвтоЖидкости);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Электроника, ФичаФлаги.ФормированиеАТКЭлектроника);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.НоутбукиИСмартфоны, ФичаФлаги.ФормированиеАТКНоутбукиИСмартфоны);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляСодержаниеСпиртаВОтчетеОНанесении(ТипОтчетаОНанесении)
	
	ТипыОтчетаОНанесении = Перечисление_ТипыОтчетаОНанесении();
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Пиво, ФичаФлаги.КонтрольСодержаниеСпиртаНанесениеПиво);
	
	Если ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РасформированиеНабора Тогда
		УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Косметика);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляСрокаГодностиВОтчетеОНанесении(ТипОтчетаОНанесении) Экспорт
	
	ТипыОтчетаОНанесении = Перечисление_ТипыОтчетаОНанесении();
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.Ветпрепараты);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.Игрушки);
	Результат.Добавить(ВидыПродукции.Вода);
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.Бакалея);
	Результат.Добавить(ВидыПродукции.СтроительныеМатериалы);
	Результат.Добавить(ВидыПродукции.Пиротехника);
	Результат.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	Результат.Добавить(ВидыПродукции.КондитерскиеИзделия);
	Результат.Добавить(ВидыПродукции.МясныеИзделия);
	Результат.Добавить(ВидыПродукции.Полуфабрикаты);
	Результат.Добавить(ВидыПродукции.Удобрения);
	
	Если ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РасформированиеНабора Тогда
		УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Косметика);
		УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Игрушки);
	КонецЕсли;
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.МедицинскиеИзделия, ФичаФлаги.КонтрольСрокГодностиНанесениеМедИзделия);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляСрокаГодностиВОтчетеОНанесенииКИГУ(ТипОтчетаОНанесении) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = ДопустимыеВидыПродукцииДляСрокаГодностиВОтчетеОНанесении(ТипОтчетаОНанесении);
	
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Молоко);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.БезалкогольныеНапитки);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Пиво);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.БезалкогольноеПиво);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Морепродукты);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляСрокаГодностиВОтчетеОНанесенииКИН(ТипОтчетаОНанесении) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = ДопустимыеВидыПродукцииДляСрокаГодностиВОтчетеОНанесении(ТипОтчетаОНанесении);
	
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Молоко);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.БезалкогольныеНапитки);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Пиво);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.БезалкогольноеПиво);
	УдалитьЗначениеИзМассива(Результат, ВидыПродукции.Морепродукты);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляУказанияТипаОтчетаОНанесении()
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Электроника);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.Игрушки);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляУказанияТипаЗаказаКодов(СпособВыпускаТоваров) Экспорт
	
	СпособыВыпускаТоваров = Перечисление_СпособыВыпускаТоваров();
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	
	Если СпособВыпускаТоваров = СпособыВыпускаТоваров.МаркировкаВнеПроизводстваИлиИмпорта Тогда
		
		Результат.Добавить(ВидыПродукции.Электроника);
		Результат.Добавить(ВидыПродукции.Косметика);
		Результат.Добавить(ВидыПродукции.Игрушки);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляЗаказаКодов(СпособВыпускаТоваров, ТипКодаМаркировки) Экспорт
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	ВидыПродукции = Перечисление_ВидыПродукции();
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	СпособыВыпускаТоваров = Перечисление_СпособыВыпускаТоваров();
	
	Если СпособВыпускаТоваров = СпособыВыпускаТоваров.Перемаркировка Тогда
		Результат = ДопустимыеВидыПродукцииДляЗаказаКодовПодПеремаркировку();
	ИначеЕсли СпособВыпускаТоваров = СпособыВыпускаТоваров.МаркировкаВнеПроизводстваИлиИмпорта Тогда
		Результат = ДопустимыеВидыПродукцииДляМаркировкиВнеПроизводстваИлиИмпорта();
	ИначеЕсли ТипКодаМаркировки = ТипыКодовМаркировки.Набор Тогда
		Результат = ДопустимыеВидыПродукцииДляЗаказаНаборов();
	ИначеЕсли ТипКодаМаркировки = ТипыКодовМаркировки.ГрупповаяУпаковка Тогда
		Результат = ДопустимыеВидыПродукцииДляЗаказаКИГУ();
	Иначе
		
		Исключения = Новый Массив;
		
		Исключения.Добавить(ВидыПродукции.Табак);
		Исключения.Добавить(ВидыПродукции.НикотиносодержащаяПродукция);
		Исключения.Добавить(ВидыПродукции.АльтернативныйТабак);
		
		Если Не ФичаФлагВключен(ФичаФлаги.ЗаказКодовПечатнаяПродукция) Тогда
			Исключения.Добавить(ВидыПродукции.ПечатнаяПродукция);
		КонецЕсли;
		
		Если Не ФичаФлагВключен(ФичаФлаги.ЗаказКодовЭлектроника) Тогда
			Исключения.Добавить(ВидыПродукции.Электроника);
		КонецЕсли;
		
		Результат = ВсеВидыПродукции(Исключения);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляПеремаркировки() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Велосипеды);
	Результат.Добавить(ВидыПродукции.Парфюмерия);
	Результат.Добавить(ВидыПродукции.МедицинскиеИзделия);
	Результат.Добавить(ВидыПродукции.Обувь);
	Результат.Добавить(ВидыПродукции.Легпром);
	Результат.Добавить(ВидыПродукции.Вода);
	Результат.Добавить(ВидыПродукции.Фототовары);
	Результат.Добавить(ВидыПродукции.Шины);
	Результат.Добавить(ВидыПродукции.Ветпрепараты);
	Результат.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.СтроительныеМатериалы);
	Результат.Добавить(ВидыПродукции.Игрушки);
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Бады, ФичаФлаги.ПеремаркировкаБады);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Антисептики, ФичаФлаги.ПеремаркировкаАнтисептики);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.БезалкогольноеПиво, ФичаФлаги.ПеремаркировкаБезалкогольноеПиво);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляЗаказаКодовПодПеремаркировку()
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Велосипеды);
	Результат.Добавить(ВидыПродукции.Парфюмерия);
	Результат.Добавить(ВидыПродукции.МедицинскиеИзделия);
	Результат.Добавить(ВидыПродукции.Обувь);
	Результат.Добавить(ВидыПродукции.Легпром);
	Результат.Добавить(ВидыПродукции.Вода);
	Результат.Добавить(ВидыПродукции.Фототовары);
	Результат.Добавить(ВидыПродукции.Шины);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.Ветпрепараты);
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.БезалкогольноеПиво, ФичаФлаги.ПеремаркировкаБезалкогольноеПиво);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляМаркировкиВнеПроизводстваИлиИмпорта()
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Игрушки);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	Результат.Добавить(ВидыПродукции.СтроительныеМатериалы);
	Результат.Добавить(ВидыПродукции.НоутбукиИСмартфоны);
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Бады, ФичаФлаги.МаркировкаВнеПроизводстваИлиИмпортаБадыВолна3);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Электроника, ФичаФлаги.МаркировкаВнеПроизводстваИлиИмпортаЭлектроника);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Пиво, ФичаФлаги.МаркировкаВнеПроизводстваИлиИмпортаПиво);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Велосипеды, ФичаФлаги.МаркировкаВнеПроизводстваИлиИмпортаВелосипеды);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Ветпрепараты, ФичаФлаги.МаркировкаВнеПроизводстваИлиИмпортаВетпрепараты);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.НоутбукиИСмартфоны, ФичаФлаги.МаркировкаВнеПроизводстваИлиИмпортаНоутбукиИСмартфоны);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляЗаказаНаборов() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.Легпром);
	Результат.Добавить(ВидыПродукции.Парфюмерия);
	Результат.Добавить(ВидыПродукции.Фототовары);
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.МедицинскиеИзделия);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.Игрушки);
	Результат.Добавить(ВидыПродукции.Бакалея);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.Пиротехника);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.КондитерскиеИзделия);
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.ПечатнаяПродукция, ФичаФлаги.ЗаказКодовПечатнаяПродукцияНаборы);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Электроника, ФичаФлаги.ЗаказКодовЭлектроникаНаборы);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Автозапчасти, ФичаФлаги.ЗаказКодовАвтозапчастиНаборы);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Полуфабрикаты, ФичаФлаги.ЗаказКодовПолуфабрикатыНаборы);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.ТоварыДляДомаИИнтерьера, ФичаФлаги.ЗаказКодовТоварыДляДомаНаборы);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.НоутбукиИСмартфоны, ФичаФлаги.ЗаказКодовНоутбукиИСмартфоныНаборы);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Удобрения, ФичаФлаги.ЗаказКодовУдобренияНаборы);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляЗаказаКИГУ() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Вода);
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.Игрушки);
	Результат.Добавить(ВидыПродукции.МедицинскиеИзделия);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.ВетПрепараты);
	Результат.Добавить(ВидыПродукции.Пиротехника);
	Результат.Добавить(ВидыПродукции.Оптоволокно);
	Результат.Добавить(ВидыПродукции.СтроительныеМатериалы);
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Электроника, ФичаФлаги.ЗаказКодовЭлектроникаКИГУ);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.МаслаИАвтомобильныеЖидкости, ФичаФлаги.ЗаказКодовАвтоЖидкостиКИГУ);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Бакалея, ФичаФлаги.ЗаказКодовБакалеяКИГУ);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.КондитерскиеИзделия, ФичаФлаги.ЗаказКодовКондитерскиеИзделияКИГУ);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Автозапчасти, ФичаФлаги.ЗаказКодовАвтозапчастиКИГУ);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.ПолимерныеТрубы, ФичаФлаги.ЗаказКодовПолимерныеТрубыКИГУ);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Велосипеды, ФичаФлаги.ЗаказКодовВелосипедыКИГУ);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.ОтопительныеПриборы, ФичаФлаги.ЗаказКодовОтопительныеПриборыКИГУ);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.МясныеИзделия, ФичаФлаги.ЗаказКодовМясныеИзделияКИГУ);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.НоутбукиИСмартфоны, ФичаФлаги.ЗаказКодовНоутбукиИСмартфоныКИГУ);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Полуфабрикаты, ФичаФлаги.ЗаказКодовПолуфабрикатыКИГУ);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.ТоварыДляДомаИИнтерьера, ФичаФлаги.ЗаказКодовТоварыДляДомаКИГУ);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Удобрения, ФичаФлаги.ЗаказКодовУдобренияКИГУ);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляЗаказаКомплектов() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Легпром);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляВыбытияКодов() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.Вода);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Антисептики);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляВводаВОборот() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Исключения = Новый Массив;
	Исключения.Добавить(ВидыПродукции.Табак);
	Исключения.Добавить(ВидыПродукции.НикотиносодержащаяПродукция);
	Исключения.Добавить(ВидыПродукции.АльтернативныйТабак);
	
	Возврат ВсеВидыПродукции(Исключения);
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляВозвратаВОборот() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Вода);
	Результат.Добавить(ВидыПродукции.Парфюмерия);
	Результат.Добавить(ВидыПродукции.МедицинскиеИзделия);
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.Обувь);
	Результат.Добавить(ВидыПродукции.Легпром);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.Фототовары);
	Результат.Добавить(ВидыПродукции.Шины);
	Результат.Добавить(ВидыПродукции.Велосипеды);
	Результат.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	Результат.Добавить(ВидыПродукции.Ветпрепараты);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.Косметика);
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Бакалея, ФичаФлаги.ВозвратВОборотБакалея);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.БезалкогольноеПиво, ФичаФлаги.ВозвратВОборотБезалкогольноеПиво);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.СтроительныеМатериалы, ФичаФлаги.ВозвратВОборотСтроительныеМатериалы);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеПричиныВозвратаВОборот(ВидПродукции) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидПродукции", ВидПродукции);
	Отбор.Вставить("ПУ", Истина);
	
	Результат = Новый Массив;
	Для Каждого Стр Из ДопустимыеПричиныВозвратаВОборотПоВидамПродукции().НайтиСтроки(Отбор) Цикл
		Результат.Добавить(Стр.ПричинаВозвратаВОборот);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеПричиныВозвратаВОборотПоВидамПродукции()
	
	КлючКэш = "ДопустимыеПричиныВозвратаВОборотПоВидамПродукции";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ПричиныВозвратаВОборот = Перечисление_ПричиныВозвратаВОборот();
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВидПродукции", ОписаниеТипа_ВидПродукции());
	Результат.Колонки.Добавить("ПричинаВозвратаВОборот", ОписаниеТипа_Строка());
	Результат.Колонки.Добавить("ПУ", ОписаниеТипа_Булево());
	
	СтрокаПричиныВозвратаВОборот = 1;
	КолонкаВидаПродукции = 1;
	
	ТабДок = МакетОбработки("ПричиныВозвратаВОборот");
	
	Для Строка = 2 По ТабДок.ВысотаТаблицы Цикл
		
		ВидПродукцииСтр = СокрЛП(ТабДок.ПолучитьОбласть(Строка, КолонкаВидаПродукции).Область().Текст);
		
		Для Колонка = 2 По ТабДок.ШиринаТаблицы Цикл
			
			ПричинаВозвратаВОборотСтр = СокрЛП(ТабДок.ПолучитьОбласть(СтрокаПричиныВозвратаВОборот, Колонка).Область().Текст);
			
			Стр = Результат.Добавить();
			Стр.ВидПродукции = ВидыПродукции[ВидПродукцииСтр];
			Стр.ПричинаВозвратаВОборот = ПричиныВозвратаВОборот[ПричинаВозвратаВОборотСтр];
			
			Значение = СокрЛП(ТабДок.ПолучитьОбласть(Строка, Колонка).Область().Текст);
			
			Если Значение = "ПУ" Тогда
				Стр.ПУ = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Результат.Индексы.Добавить("ВидПродукции, ПУ");
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляВыводаИзОборота(ОбъемноСортовойУчет) Экспорт
	
	Если ОбъемноСортовойУчет Тогда
		Возврат ДопустимыеВидыПродукцииДляВыводаИзОборотаОСУ();
	Иначе
		Возврат ДопустимыеВидыПродукцииДляВыводаИзОборотаПУ();
	КонецЕсли;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляВыводаИзОборотаОСУ() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.КормаДляЖивотных, ФичаФлаги.ВыводИзОборотаОСУКормаДляЖивотных);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Консервы, ФичаФлаги.ВыводИзОборотаОСУКонсервы);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Косметика, ФичаФлаги.ВыводИзОборотаОСУКосметика);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Бакалея, ФичаФлаги.ВыводИзОборотаОСУБакалея);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляВыводаИзОборотаПУ()
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Исключения = Новый Массив;
	Исключения.Добавить(ВидыПродукции.Оптоволокно);
	Исключения.Добавить(ВидыПродукции.ОтопительныеПриборы);
	Исключения.Добавить(ВидыПродукции.ПечатнаяПродукция);
	Исключения.Добавить(ВидыПродукции.Автозапчасти);
	Исключения.Добавить(ВидыПродукции.ПолимерныеТрубы);
	Исключения.Добавить(ВидыПродукции.МясныеИзделия);
	Исключения.Добавить(ВидыПродукции.Удобрения);
	
	Возврат ВсеВидыПродукции(Исключения);
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляОперацийАгрегации() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Исключения = Новый Массив;
	Исключения.Добавить(ВидыПродукции.Табак);
	Исключения.Добавить(ВидыПродукции.НикотиносодержащаяПродукция);
	Исключения.Добавить(ВидыПродукции.АльтернативныйТабак);
	Исключения.Добавить(ВидыПродукции.Удобрения);
	
	Возврат ВсеВидыПродукции(Исключения);
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляРегистрацииНаборов(ТипНабора) Экспорт
	
	ТипыНаборов = Перечисление_ТипыНаборов();
	
	Если ТипНабора = ТипыНаборов.Мультитоварный Тогда
		Результат = ДопустимыеВидыПродукцииДляРегистрацииМультитоварныхНаборов();
	Иначе
		Результат = ДопустимыеВидыПродукцииДляРегистрацииМонотоварныхНаборов();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляРегистрацииМонотоварныхНаборов() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.Легпром);
	Результат.Добавить(ВидыПродукции.Парфюмерия);
	Результат.Добавить(ВидыПродукции.Фототовары);
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.МедицинскиеИзделия);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.Игрушки);
	Результат.Добавить(ВидыПродукции.Бакалея);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.Пиротехника);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.ПечатнаяПродукция);
	Результат.Добавить(ВидыПродукции.КондитерскиеИзделия);
	
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Автозапчасти, ФичаФлаги.РегистрацияНаборовАвтозапчасти);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.Электроника, ФичаФлаги.РегистрацияНаборовЭлектроника);
	ИзменитьМассивПоФичаФлагу(Результат, ВидыПродукции.НоутбукиИСмартфоны, ФичаФлаги.РегистрацияНаборовНоутбукиИСмартфоны);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляРегистрацииМультитоварныхНаборов() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Легпром);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.Электроника);
	Результат.Добавить(ВидыПродукции.Молоко);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляРегистрацииКИГУ() Экспорт
	
	Возврат ДопустимыеВидыПродукцииДляЗаказаКИГУ();
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляУведомленияОСостоянииКодов() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Пиво);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляКорректировкиСведенийОКодах() Экспорт
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.Вода);
	Результат.Добавить(ВидыПродукции.Парфюмерия);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.МедицинскиеИзделия);
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.Обувь);
	Результат.Добавить(ВидыПродукции.Легпром);
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.Фототовары);
	Результат.Добавить(ВидыПродукции.Шины);
	Результат.Добавить(ВидыПродукции.Ветпрепараты);
	Результат.Добавить(ВидыПродукции.Велосипеды);
	Результат.Добавить(ВидыПродукции.Бакалея);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	Результат.Добавить(ВидыПродукции.Автозапчасти);
	Результат.Добавить(ВидыПродукции.СтроительныеМатериалы);
	Результат.Добавить(ВидыПродукции.Игрушки);
	Результат.Добавить(ВидыПродукции.МясныеИзделия);
	Результат.Добавить(ВидыПродукции.Электроника);
	Результат.Добавить(ВидыПродукции.НоутбукиИСмартфоны);
	Результат.Добавить(ВидыПродукции.КондитерскиеИзделия);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляОтчетаОНанесении() Экспорт
	
	ВидыПродукции = Перечисления.КонтурМаркировка_ВидыПродукции;
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Молоко);
	Результат.Добавить(ВидыПродукции.Вода);
	Результат.Добавить(ВидыПродукции.Пиво);
	Результат.Добавить(ВидыПродукции.Бады);
	Результат.Добавить(ВидыПродукции.Антисептики);
	Результат.Добавить(ВидыПродукции.МедицинскиеИзделия);
	Результат.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	Результат.Добавить(ВидыПродукции.Морепродукты);
	Результат.Добавить(ВидыПродукции.Консервы);
	Результат.Добавить(ВидыПродукции.Косметика);
	Результат.Добавить(ВидыПродукции.Ветпрепараты);
	Результат.Добавить(ВидыПродукции.РастительныеМасла);
	Результат.Добавить(ВидыПродукции.Игрушки);
	Результат.Добавить(ВидыПродукции.КормаДляЖивотных);
	Результат.Добавить(ВидыПродукции.БезалкогольноеПиво);
	Результат.Добавить(ВидыПродукции.Велосипеды);
	Результат.Добавить(ВидыПродукции.Оптоволокно);
	Результат.Добавить(ВидыПродукции.Электроника);
	Результат.Добавить(ВидыПродукции.СтроительныеМатериалы);
	Результат.Добавить(ВидыПродукции.Бакалея);
	Результат.Добавить(ВидыПродукции.ОтопительныеПриборы);
	Результат.Добавить(ВидыПродукции.Пиротехника);
	Результат.Добавить(ВидыПродукции.ПечатнаяПродукция);
	Результат.Добавить(ВидыПродукции.МаслаИАвтомобильныеЖидкости);
	Результат.Добавить(ВидыПродукции.КондитерскиеИзделия);
	Результат.Добавить(ВидыПродукции.Автозапчасти);
	Результат.Добавить(ВидыПродукции.ПолимерныеТрубы);
	Результат.Добавить(ВидыПродукции.МясныеИзделия);
	Результат.Добавить(ВидыПродукции.НоутбукиИСмартфоны);
	Результат.Добавить(ВидыПродукции.ТоварыДляДомаИИнтерьера);
	Результат.Добавить(ВидыПродукции.Полуфабрикаты);
	Результат.Добавить(ВидыПродукции.Удобрения);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыКорректируемыхСведенийОКодах(ВидПродукции) Экспорт
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	ВидыПродукции = Перечисление_ВидыПродукции();
	ВидыКорректируемыхСведений = Перечисление_ВидыКорректируемыхСведений();
	
	Если ЗначениеЗаполнено(ВидПродукции) Тогда
		
		Результат = Новый Массив;
		Отбор = Новый Структура("ВидПродукции, Доступно", ВидПродукции, Истина);
		Для Каждого Стр Из ДопустимыеВидыКорректируемыхСведенийПоВидамПродукции().НайтиСтроки(Отбор) Цикл
			Результат.Добавить(Стр.ВидКорректируемыхСведений);
		КонецЦикла;
		
		Если ВидПродукции = ВидыПродукции.Молоко
			И Не ФичаФлагВключен(ФичаФлаги.КорректировкаНомерПартииМолоко) Тогда
			УдалитьЗначениеИзМассива(Результат, ВидыКорректируемыхСведений.НомерПартии);
		КонецЕсли;
		
	Иначе
		Результат = МассивЗначенийИзСтруктуры(ВидыКорректируемыхСведений);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыКорректируемыхСведенийПоВидамПродукции()
	
	КлючКэш = "ДопустимыеВидыКорректируемыхСведенийПоВидамПродукции";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ВидыСведений = Перечисление_ВидыКорректируемыхСведений();
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВидПродукции", ОписаниеТипа_ВидПродукции());
	Результат.Колонки.Добавить("ВидКорректируемыхСведений", ОписаниеТипа_Строка());
	Результат.Колонки.Добавить("Доступно", ОписаниеТипа_Булево());
	
	СтрокаВидаКорректируемыхСведений = 1;
	КолонкаВидаПродукции = 1;
	
	ТабДок = МакетОбработки("ВидыКорректируемыхСведений");
	
	Для Строка = 2 По ТабДок.ВысотаТаблицы Цикл
		
		ВидПродукцииСтр = СокрЛП(ТабДок.ПолучитьОбласть(Строка, КолонкаВидаПродукции).Область().Текст);
		
		Для Колонка = 2 По ТабДок.ШиринаТаблицы Цикл
			
			ВидСведенийСтр = СокрЛП(ТабДок.ПолучитьОбласть(СтрокаВидаКорректируемыхСведений, Колонка).Область().Текст);
			
			Стр = Результат.Добавить();
			Стр.ВидПродукции = ВидыПродукции[ВидПродукцииСтр];
			Стр.ВидКорректируемыхСведений = ВидыСведений[ВидСведенийСтр];
			
			Значение = СокрЛП(ТабДок.ПолучитьОбласть(Строка, Колонка).Область().Текст);
			
			Если Значение = "+" Тогда
				Стр.Доступно = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Результат.Индексы.Добавить("ВидПродукции, Доступно");
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПродукцииДляПартионногоУчета() Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Результат = Новый Массив;
	Результат.Добавить(ВидыПродукции.Молоко);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеСпособыВводаВОборот(ВидПродукции) Экспорт
	
	СпособыВвода = Перечисление_СпособыВводаВОборот();
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	
	Если ВидПродукции <> ВидыПродукции.Пиво Тогда
		Результат.Добавить(СпособыВвода.ПроизводствоРФ);
	КонецЕсли;
	
	Результат.Добавить(СпособыВвода.Трансгран);
	
	Если ВидПродукцииДопускаетСпособВводаИмпорт(ВидПродукции)  Тогда
		Результат.Добавить(СпособыВвода.Импорт);
	КонецЕсли;
	
	Если ВидПродукцииДопускаетСпособВводаИмпортФТС(ВидПродукции) Тогда
		Результат.Добавить(СпособыВвода.ИмпортФТС);
	КонецЕсли;
	
	Если ВидПродукцииДопускаетСпособВводаОстатки(ВидПродукции) Тогда
		Результат.Добавить(СпособыВвода.Остатки);
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Электроника
		И ФичаФлагВключен(ФичаФлаги.ВводВОборотСПричинойЭлектроника) Тогда
		Результат.Добавить(СпособыВвода.СПричиной);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеСпособыВыпускаТоваров(ВидПродукции, ТипКодаМаркировки) Экспорт
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	ВидыПродукции = Перечисление_ВидыПродукции();
	СпособыВыпуска = Перечисление_СпособыВыпускаТоваров();
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	Результат = Новый Массив;
	Результат.Добавить(СпособыВыпуска.ПроизводствоРФ);
	Результат.Добавить(СпособыВыпуска.Импорт);
	
	Если ТипКодаМаркировкиДопускаетПеремаркировку(ТипКодаМаркировки)
		И МассивСодержитЗначение(ДопустимыеВидыПродукцииДляЗаказаКодовПодПеремаркировку(), ВидПродукции) Тогда
		Результат.Добавить(СпособыВыпуска.Перемаркировка);
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Игрушки Тогда
		ИзменитьМассивПоФичаФлагу(Результат, СпособыВыпуска.Остатки, ФичаФлаги.ОстаткиЗаказКодовИгрушки);
	КонецЕсли;
	
	Если ТипКодаМаркировкиДопускаетМаркировкуВнеПроизводстваИлиИмпорта(ТипКодаМаркировки)
		И ВидПродукцииДопускаетСпособВыпускаМаркировкаВнеПроизводстваИлиИмпорта(ВидПродукции) Тогда
		Результат.Добавить(СпособыВыпуска.МаркировкаВнеПроизводстваИлиИмпорта);
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Антисептики Тогда
		ИзменитьМассивПоФичаФлагу(Результат, СпособыВыпуска.Остатки, ФичаФлаги.ОстаткиЗаказКодовАнтисептики);
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Легпром Тогда
		ИзменитьМассивПоФичаФлагу(Результат, СпособыВыпуска.Остатки, ФичаФлаги.ОстаткиЛегпромВолна4);
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Велосипеды Тогда
		ИзменитьМассивПоФичаФлагу(Результат, СпособыВыпуска.Остатки, ФичаФлаги.ОстаткиЗаказКодовВелосипеды);
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.МаслаИАвтомобильныеЖидкости Тогда
		ИзменитьМассивПоФичаФлагу(Результат, СпособыВыпуска.Остатки, ФичаФлаги.ОстаткиАвтоЖидкости);
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеСтатусыВложенныхКодовМультитоварныхНаборов()
	
	СтатусыКодов = Перечисление_СтатусыКодов();
	
	Результат = Новый Массив;
	Результат.Добавить(СтатусыКодов.ВведенВОборот);
	Результат.Добавить(СтатусыКодов.Нанесен);
	Результат.Добавить(СтатусыКодов.НеНайден);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеСпособыВыпускаТоваровДляКорректировки() Экспорт
	
	СпособыВыпуска = Перечисление_СпособыВыпускаТоваров();
	
	Результат = Новый Массив;
	Результат.Добавить(СпособыВыпуска.ПроизводствоРФ);
	Результат.Добавить(СпособыВыпуска.Импорт);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеТипыСроковГодности(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ТипыСроковГодности = Перечисление_ТипыСроковГодности();
	
	Результат = Новый Массив;
	
	Если ВидПродукции = ВидыПродукции.Молоко Тогда
		Результат.Добавить(ТипыСроковГодности.СрокГодностиМеньше72);
	КонецЕсли;
	
	Результат.Добавить(ТипыСроковГодности.СрокГодностиБольше72);
	Результат.Добавить(ТипыСроковГодности.СрокГодностиБольше72СУсловием);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеТипыКодовМаркировки(СпособВыпускаТоваров, ВидПродукции) Экспорт
	
	СпособыВыпуска = Перечисление_СпособыВыпускаТоваров();
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	Результат = Новый Массив;
	Результат.Добавить(ТипыКодовМаркировки.ЕдиницаТовара);
	
	Если СпособВыпускаТоваров <> СпособыВыпуска.МаркировкаВнеПроизводстваИлиИмпорта
		И ДопустимыеВидыПродукцииДляЗаказаКомплектов().Найти(ВидПродукции) <> Неопределено Тогда
		Результат.Добавить(ТипыКодовМаркировки.Комплект);
	КонецЕсли;
	
	Если СпособВыпускаТоваров <> СпособыВыпуска.МаркировкаВнеПроизводстваИлиИмпорта
		И ДопустимыеВидыПродукцииДляЗаказаНаборов().Найти(ВидПродукции) <> Неопределено Тогда
		Результат.Добавить(ТипыКодовМаркировки.Набор);
	КонецЕсли;
	
	Если СпособВыпускаТоваров <> СпособыВыпуска.Перемаркировка
		И СпособВыпускаТоваров <> СпособыВыпуска.МаркировкаВнеПроизводстваИлиИмпорта
		И ДопустимыеВидыПродукцииДляЗаказаКИГУ().Найти(ВидПродукции) <> Неопределено Тогда
		Результат.Добавить(ТипыКодовМаркировки.ГрупповаяУпаковка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеТипыКодовМаркировкиДляПартионногоУчета() Экспорт
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	Результат = Новый Массив;
	Результат.Добавить(ТипыКодовМаркировки.Набор);
	Результат.Добавить(ТипыКодовМаркировки.ЕдиницаТовара);
	Результат.Добавить(ТипыКодовМаркировки.ГрупповаяУпаковка);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеТипыКодовМаркировкиДляУказанияПартийВОтчетеОНанесении() Экспорт
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	Результат = Новый Массив;
	Результат.Добавить(ТипыКодовМаркировки.ЕдиницаТовара);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеОбщиеТипыУпаковокДляПартионногоУчета() Экспорт
	
	ОбщиеТипыУпаковок = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок;
	
	Результат = Новый Массив;
	Результат.Добавить(ОбщиеТипыУпаковок.Набор);
	Результат.Добавить(ОбщиеТипыУпаковок.ЕдиницаТовара);
	Результат.Добавить(ОбщиеТипыУпаковок.ГрупповаяУпаковка);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеПричиныВыводаИзОборота(ВидПродукции, ОбъемноСортовойУчет) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ПричиныВывода = Перечисление_ПричиныВыводаИзОборота();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидПродукции", ВидПродукции);
	
	Если ОбъемноСортовойУчет Тогда
		Отбор.Вставить("ОСУ", Истина);
	Иначе
		Отбор.Вставить("ПУ", Истина);
	КонецЕсли;
	
	Результат = Новый Массив;
	Для Каждого Стр Из ДопустимыеПричиныВыводаИзОборотаПоВидамПродукции().НайтиСтроки(Отбор) Цикл
		Результат.Добавить(Стр.ПричинаВыводаИзОборота);
	КонецЦикла;
	
	Если ВидПродукции = ВидыПродукции.КормаДляЖивотных И ОбъемноСортовойУчет Тогда
		ИзменитьМассивПоФичаФлагу(Результат
		, ПричиныВывода.КорректировкаСкладскихОстатков, ФичаФлаги.КорректировкаСкладскихОстатковОСУКормаДляЖивотных);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеПричиныВыводаИзОборотаПоВидамПродукции()
	
	КлючКэш = "ДопустимыеПричиныВыводаИзОборотаПоВидамПродукции";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ПричиныВывода = Перечисление_ПричиныВыводаИзОборота();
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВидПродукции", ОписаниеТипа_ВидПродукции());
	Результат.Колонки.Добавить("ПричинаВыводаИзОборота", ОписаниеТипа_Строка());
	Результат.Колонки.Добавить("ОСУ", ОписаниеТипа_Булево());
	Результат.Колонки.Добавить("ПУ", ОписаниеТипа_Булево());
	
	СтрокаПричиныВывода = 1;
	КолонкаВидаПродукции = 1;
	
	ТабДок = МакетОбработки("ПричиныВыводаИзОборота");
	
	Для Строка = 2 По ТабДок.ВысотаТаблицы Цикл
		
		ВидПродукцииСтр = СокрЛП(ТабДок.ПолучитьОбласть(Строка, КолонкаВидаПродукции).Область().Текст);
		
		Для Колонка = 2 По ТабДок.ШиринаТаблицы Цикл
			
			ПричинаВыводаСтр = СокрЛП(ТабДок.ПолучитьОбласть(СтрокаПричиныВывода, Колонка).Область().Текст);
			
			Стр = Результат.Добавить();
			Стр.ВидПродукции = ВидыПродукции[ВидПродукцииСтр];
			Стр.ПричинаВыводаИзОборота = ПричиныВывода[ПричинаВыводаСтр];
			
			Значение = СокрЛП(ТабДок.ПолучитьОбласть(Строка, Колонка).Область().Текст);
			
			Если Значение = "ОСУ" Тогда
				Стр.ОСУ = Истина;
			КонецЕсли;
			
			Если Значение = "ПУ" Тогда
				Стр.ПУ = Истина;
			КонецЕсли;
			
			Если Значение = "ОСУ/ПУ" Тогда
				Стр.ОСУ = Истина;
				Стр.ПУ = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Результат.Индексы.Добавить("ВидПродукции, ОСУ");
	Результат.Индексы.Добавить("ВидПродукции, ПУ");
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеПричиныВыбытияКодов(ВидПродукции) Экспорт
	
	Результат = Новый Массив;
	
	ПричиныВыбытия = Перечисление_ПричиныВыбытияКодов();
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Если ВидПродукции = ВидыПродукции.Молоко Тогда
		Результат.Добавить(ПричиныВыбытия.Брак);
		Результат.Добавить(ПричиныВыбытия.ЛабораторныеОбразцы);
	Иначе
		Результат = МассивЗначенийИзСтруктуры(ПричиныВыбытия);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеПричиныПеремаркировки(ВидПродукции) Экспорт
	
	ПричиныПеремаркировки = Перечисление_ПричиныПеремаркировки();
	
	Если ВидПродукцииДопускаетПричинуПеремаркировкиИспорченоЛибоУтеряноСИСКМ(ВидПродукции) Тогда
		
		Результат = Новый Массив;
		Результат.Добавить(ПричиныПеремаркировки.ИспорченоЛибоУтеряноСИСКМ);
		
	Иначе
		Результат = МассивЗначенийИзСтруктуры(ПричиныПеремаркировки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПервичногоДокумента(ПричинаВыводаИзОборота) Экспорт
	
	ПричиныВывода = Перечисление_ПричиныВыводаИзОборота();
	ВидыДокументов = Перечисление_ВидыПервичныхДокументов();
	
	Результат = Новый Массив;
	
	Если ПричинаВыводаИзОборота = ПричиныВывода.РозничнаяПродажа Тогда
		Результат.Добавить(ВидыДокументов.КассовыйЧек);
		Результат.Добавить(ВидыДокументов.ТоварныйЧек);
	КонецЕсли;
		
	Если ПричинаВыводаИзОборота = ПричиныВывода.ПродажаПоОбразцам
		Или ПричинаВыводаИзОборота = ПричиныВывода.ДистанционныйСпособПродажи Тогда
		Результат.Добавить(ВидыДокументов.УПД);
		Результат.Добавить(ВидыДокументов.КассовыйЧек);
		Результат.Добавить(ВидыДокументов.ТоварныйЧек);
		Результат.Добавить(ВидыДокументов.ТоварнаяНакладная);
	КонецЕсли;
		
	Если ПричинаВыводаИзОборота = ПричиныВывода.Конфискация Тогда
		Результат.Добавить(ВидыДокументов.УПД);
		Результат.Добавить(ВидыДокументов.ТоварнаяНакладная);
	КонецЕсли;
		
	Если ПричинаВыводаИзОборота = ПричиныВывода.Уничтожение Тогда
		Результат.Добавить(ВидыДокументов.АктУничтожения);
	КонецЕсли;
	
	Если ПричинаВыводаИзОборота = ПричиныВывода.ЭкспортЗаПределыЕАЭС Тогда
		Результат.Добавить(ВидыДокументов.ТаможеннаяДекларация);
	КонецЕсли;
	
	Если ПричинаВыводаИзОборота = ПричиныВывода.БезвозмезднаяПередача Тогда
		Результат.Добавить(ВидыДокументов.ТоварнаяНакладная);
	КонецЕсли;
	
	Если ПричинаВыводаИзОборота = ПричиныВывода.ДляПроизводственныхЦелей Тогда
		Результат.Добавить(ВидыДокументов.ЭлектронныйCертификат);
		Результат.Добавить(ВидыДокументов.АкПротезноОртопедическогоИзделия);
	КонецЕсли;
	
	ИсключенияДляВидаПрочее = Новый Массив;
	ИсключенияДляВидаПрочее.Добавить(ПричиныВывода.ЭкспортЕАЭС);
	ИсключенияДляВидаПрочее.Добавить(ПричиныВывода.ПродажаПоГосКонтракту);
	ИсключенияДляВидаПрочее.Добавить(ПричиныВывода.ПродажаПоСделкеСГосударственнойТайной);
	Если Не МассивСодержитЗначение(ИсключенияДляВидаПрочее, ПричинаВыводаИзОборота) Тогда
		Результат.Добавить(ВидыДокументов.Прочее);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеВидыПервичныхДокументовДляВозвратаВОборот(ПричинаВозвратаВОборот) Экспорт
	
	ВидыДокументов = Перечисление_ВидыПервичныхДокументов();
	ПричиныВозвратаВОборот = Перечисление_ПричиныВозвратаВОборот();
	
	Результат = Новый Массив;
	
	Если ПричинаВозвратаВОборот = ПричиныВозвратаВОборот.ДистанционныйСпособПродажи
		Или ПричинаВозвратаВОборот = ПричиныВозвратаВОборот.РозничнаяРеализация Тогда
		Результат.Добавить(ВидыДокументов.КассовыйЧек);
		Результат.Добавить(ВидыДокументов.ТоварныйЧек);
	КонецЕсли;
	
	Результат.Добавить(ВидыДокументов.Прочее);
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеТипыПроизводственныхЗаказов(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ТипыПроизводственныхЗаказов = Перечисление_ТипыПроизводственныхЗаказов();
	
	Результат = Новый Массив;
	Результат.Добавить(ТипыПроизводственныхЗаказов.СобственноеПроизводство);
	
	Если ВидПродукции <> ВидыПродукции.Оптоволокно Тогда
		Результат.Добавить(ТипыПроизводственныхЗаказов.КонтрактноеПроизводство);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеСтраныДляВыводаИзОборота(ВидПродукции, ПричинаВыводаИзОборота) Экспорт
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	ВидыПродукции = Перечисление_ВидыПродукции();
	ПричиныВывода = Перечисление_ПричиныВыводаИзОборота();
	
	КодыДопустимыхСтран = КодыСтранЕАЭС();
	
	Если ПричинаВыводаИзОборота = ПричиныВывода.ЭкспортЕАЭС Тогда
		
		Исключения = Новый Массив;
		Исключения.Добавить(ВидыПродукции.Шины);
		Исключения.Добавить(ВидыПродукции.Обувь);
		Если Не ФичаФлагВключен(ФичаФлаги.ВыводИзОборотаТрансгранЛегпромБеларусь) Тогда
			Исключения.Добавить(ВидыПродукции.Легпром);
		КонецЕсли;
		
		Если МассивСодержитЗначение(Исключения, ВидПродукции) Тогда
			КодБеларуси = "112";
			УдалитьЗначениеИзМассива(КодыДопустимыхСтран, КодБеларуси);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СписокСтранМира(КодыДопустимыхСтран);
	
КонецФункции

Функция ДопустимыеСтраныДляСообщенияОбОтгрузке(ВидПродукции) Экспорт
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	ДопустимыеКоды = Новый Массив;
	
	Если ВидПродукцииДопускаетСообщениеОбОтгрузкеБеларусь(ВидПродукции) Тогда
		ДопустимыеКоды.Добавить("112");
	КонецЕсли;
	
	Если ВидПродукцииДопускаетСообщениеОбОтгрузкеКазахстан(ВидПродукции) Тогда
		ДопустимыеКоды.Добавить("398");
	КонецЕсли;
	
	Возврат СписокСтранМира(ДопустимыеКоды);
	
КонецФункции

Функция ДопустимыеТипыЗаказаКодов(ВидПродукции) Экспорт
	
	ТипыЗаказаКодов = Перечисление_ТипыЗаказаКодов();
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	
	Если ВидПродукции = ВидыПродукции.Электроника Тогда
		ДобавитьЗначениеВМассив(Результат, ТипыЗаказаКодов.РасформированиеНабора);
		ДобавитьЗначениеВМассив(Результат, ТипыЗаказаКодов.РазделениеТовара);
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Игрушки
		Или ВидПродукции = ВидыПродукции.Косметика Тогда
		ДобавитьЗначениеВМассив(Результат, ТипыЗаказаКодов.РасформированиеНабора);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеТипыОтчетаОНанесении(ВидПродукции, ТипОперации) Экспорт
	
	ТипыОтчетаОНанесении = Перечисление_ТипыОтчетаОНанесении();
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	Результат = Новый Массив;
	Результат.Добавить(ТипыОтчетаОНанесении.ОтчетОНанесении);
	
	Если ВидПродукции = ВидыПродукции.Электроника Тогда
		ДобавитьЗначениеВМассив(Результат, ТипыОтчетаОНанесении.РасформированиеНабора);
		ДобавитьЗначениеВМассив(Результат, ТипыОтчетаОНанесении.РазделениеТовара);
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Игрушки
		Или ВидПродукции = ВидыПродукции.Косметика Тогда
		ДобавитьЗначениеВМассив(Результат, ТипыОтчетаОНанесении.РасформированиеНабора);
	КонецЕсли;
	
	Если ТипОперации = Перечисление_ТипыОпераций().ОтчетОНанесенииНаТСД Тогда
		УдалитьЗначениеИзМассива(Результат, ТипыОтчетаОНанесении.РазделениеТовара);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыеПравилаОтраженияВЭДО(ВидПродукции) Экспорт
	
	ПравилаОтражения = Перечисление_ПравилаОтраженияВЭДО();
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПравилаОтражения.ПУ);
	
	Если ВидПродукцииДопускаетОСУ(ВидПродукции) Тогда
		Результат.Добавить(ПравилаОтражения.ОСУ);
	КонецЕсли;
	
	Если ВидПродукцииПоддерживаетПартионныйУчет(ВидПродукции) Тогда
		Результат.Добавить(ПравилаОтражения.ПартионныйУчет);
	КонецЕсли;
	
	Результат.Добавить(ПравилаОтражения.НеОтражать);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // ТребованияТоварныхГрупп

// #Область ПроверкаЗаполненияДокументаУчета

Функция ДокументУчета_ПроверитьЗаполнениеПолей(ОписаниеДокумента) Экспорт
	
	Результат = Новый Массив;
	
	ОбновитьТребуемоеДействие = Ложь;
	Отбор = Новый Структура("КлючСтрокиДокумента");
	Для Каждого СтрДок Из ОписаниеДокумента.ТоварыДокумента Цикл
		
		Если СтрДок.НеПодлежитМаркировке Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрДок.КоличествоУпаковок) Тогда
			
			КоличествоПодобрано = 0;
			Отбор.КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
			Для Каждого СтрТов Из ОписаниеДокумента.ТоварыМаркировки.НайтиСтроки(Отбор) Цикл
				КоличествоПодобрано = КоличествоПодобрано + СтрТов.КоличествоУпаковок;
			КонецЦикла;
			
			Если СтрДок.КоличествоУпаковок <> КоличествоПодобрано Тогда
				ТекстОшибки = НСтр("ru = 'Не подобран товар маркировки для номенклатуры %1'");
				Ошибка = Новый_ОшибкаЗаполнения("Номенклатура", "ТоварыДокумента", СтрДок.НомерСтроки);
				Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, СтрДок.Номенклатура);
				Результат.Добавить(Ошибка);
				ОбновитьТребуемоеДействие = Истина;
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(СтрДок.Количество) Тогда
				ТекстОшибки = НСтр("ru = 'Не указано количество упаковок для номенклатуры %1'");
				Ошибка = Новый_ОшибкаЗаполнения("КоличествоУпаковок", "ТоварыДокумента", СтрДок.НомерСтроки);
				Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, СтрДок.Номенклатура);
				Результат.Добавить(Ошибка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Склад = ОписаниеДокумента.Склад;
	Организация = ОписаниеДокумента.Организация;
	СкладЗаполнен = ЗначениеЗаполнено(Склад);
	ОрганизацияЗаполнена = ЗначениеЗаполнено(Организация);
	
	Если Не ОрганизацияЗаполнена Тогда
		Ошибка = Новый_ОшибкаЗаполнения("Организация");
		Ошибка.ТекстОшибки = НСтр("ru = 'Не указана организация!'");
		Результат.Добавить(Ошибка);
	КонецЕсли;
	
	Если Не СкладЗаполнен Тогда
		Ошибка = Новый_ОшибкаЗаполнения("Склад");
		Ошибка.ТекстОшибки = НСтр("ru = 'Не указан склад!'");
		Результат.Добавить(Ошибка);
	КонецЕсли;
	
	Если ОрганизацияЗаполнена И СкладЗаполнен И Склад.Организация <> Организация Тогда
		Ошибка = Новый_ОшибкаЗаполнения("Склад");
		ТекстОшибки = НСтр("ru = 'Выбранный склад принадлежит другой организации: %1'");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, Склад.Организация);
		Результат.Добавить(Ошибка);
	КонецЕсли;
	
	Если ДокументУчета_ЕстьРольКорректировкаОтгрузки(ОписаниеДокумента) Тогда
		Если Не ЗначениеЗаполнено(ОписаниеДокумента.ДопРеквизиты.ВидКорректировки) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("ВидКорректировки");
			Ошибка.ТекстОшибки = НСтр("ru = 'Укажите вид корректировки'");
			Результат.Добавить(Ошибка);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ОписаниеДокумента.ДопРеквизиты.ИсправляемыйДокумент) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("ИсправляемыйДокумент");
			Ошибка.ТекстОшибки = НСтр("ru = 'Укажите исправляемый документ'");
			Результат.Добавить(Ошибка);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбновитьТребуемоеДействие Тогда
		МодульМаркировки().ДокументУчета_ОбновитьТребуемоеДействие(ОписаниеДокумента.Ссылка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДокументУчета_ПроверитьТоварыМаркировки(ОписаниеДокумента) Экспорт
	
	Результат = Новый Массив;
	
	ЭтоВнутреннееПеремещение = ДокументУчета_ТипуДокументаДоступнаРоль(
	ОписаниеДокумента.ТипДокумента, Перечисление_РолиДокументовУчета().ВнутреннееПеремещение);
	ОСУРазрешенАнтисептикиГруппаПлатности1 = ФичаФлагВключен(Перечисление_ФичаФлаги().ПравилоОтраженияОСУАнтисептикиВолна0);
	
	ПараметрыПроверки = Новый_ПараметрыПроверкиТоваровДокумента();
	ПараметрыПроверки.РолиДоступенПартионныйУчет = МодульМаркировки().ДокументУчета_ЕстьРолиДляПартионногоУчета(ОписаниеДокумента.Ссылка);
	ПараметрыПроверки.ЭтоВнутреннееПеремещение = ЭтоВнутреннееПеремещение;
	ПараметрыПроверки.ОСУРазрешенАнтисептикиГруппаПлатности1 = ОСУРазрешенАнтисептикиГруппаПлатности1;
	
	
	КэшТоваров = Новый Соответствие;
	Отбор = Новый Структура("КлючСтрокиДокумента");
	Для Каждого СтрДок Из ОписаниеДокумента.ТоварыДокумента Цикл
		Отбор.КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
		ТоварыСтроки = ОписаниеДокумента.ТоварыМаркировки.НайтиСтроки(Отбор);
		ОшибкиСтроки = ДокументУчета_ПроверитьСтрокуТовара(СтрДок, ТоварыСтроки, ПараметрыПроверки, КэшТоваров);
		ДополнитьМассив(Результат, ОшибкиСтроки);
	КонецЦикла;
	
	ОшибкиПроверкиФорматаНомераПартии = ДокументУчета_ПроверитьФорматНомераПартии(ОписаниеДокумента);
	ДополнитьМассив(Результат, ОшибкиПроверкиФорматаНомераПартии, Истина, Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ДокументУчета_ПроверитьСтрокуТовара(СтрокаДокумента, ТоварыСтроки, ПараметрыПроверки, КэшТоваров)
	
	// BSLLS:CognitiveComplexity-off
	ПравилаОтраженияВЭДО = Перечисление_ПравилаОтраженияВЭДО();
	
	Результат = Новый Массив;
	
	ОшибкиНеРазрешенОСУ = Новый Массив;
	ОшибкиНеРазрешенПартионныйУчет = Новый Массив;
	ОшибкиНеДоступноВнутреннееПеремещение = Новый Массив;
	ОшибкиНеЗаполненНомерПартии = Новый Массив;
	ОшибкиНеЗаполненВесПартии = Новый Массив;
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Для Каждого Стр Из ТоварыСтроки Цикл
		
		ОписаниеТовара = Товар_Прочитать(Стр.Товар, КэшТоваров);
		ВидПродукции = ОписаниеТовара.ВидПродукции;
		GTIN = ОписаниеТовара.GTIN;
		
		Если СтрокаДокумента.ОтражениеВЭДО = ПравилаОтраженияВЭДО.ОСУ Тогда
			
			Если Не ВидПродукцииДопускаетОСУ(ВидПродукции) Тогда
				ОшибкиНеРазрешенОСУ.Добавить(GTIN);
			КонецЕсли;
			
			Если Не Товар_ПоддерживаетОСУВДокументе(ОписаниеТовара, ПараметрыПроверки) Тогда
				ОшибкиНеРазрешенОСУ.Добавить(GTIN);
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаДокумента.ОтражениеВЭДО = ПравилаОтраженияВЭДО.ПартионныйУчет
			И ПараметрыПроверки.РолиДоступенПартионныйУчет Тогда
			
			Если Не ВидПродукцииПоддерживаетПартионныйУчет(ВидПродукции) Тогда
				ОшибкиНеРазрешенПартионныйУчет.Добавить(GTIN);
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.НомерПартии) Тогда
				ОшибкиНеЗаполненНомерПартии.Добавить(GTIN);
			КонецЕсли;
			
			Если Стр.Товар.ПеременныйВес И Не ЗначениеЗаполнено(Стр.Количество) Тогда
				ОшибкиНеЗаполненВесПартии.Добавить(GTIN);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыПроверки.ЭтоВнутреннееПеремещение
			И Не ВидПродукцииДопускаетВнутреннееПеремещение(ВидПродукции) Тогда
			ОшибкиНеДоступноВнутреннееПеремещение.Добавить(ВидПродукции);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОшибкиНеРазрешенОСУ) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("Номенклатура", "ТоварыДокумента", СтрокаДокумента.НомерСтроки);
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения_НеРазрешенОСУ()
		, СоединитьСтроку(ОшибкиНеРазрешенОСУ, ", "));
		Результат.Добавить(Ошибка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОшибкиНеРазрешенПартионныйУчет) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("Номенклатура", "ТоварыДокумента", СтрокаДокумента.НомерСтроки);
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения_НеРазрешенПартионныйУчет()
		, СоединитьСтроку(ОшибкиНеРазрешенПартионныйУчет, ", "));
		Результат.Добавить(Ошибка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОшибкиНеДоступноВнутреннееПеремещение) Тогда
		СвернутьМассивЛок(ОшибкиНеДоступноВнутреннееПеремещение);
		Ошибка = Новый_ОшибкаЗаполнения("Номенклатура", "ТоварыДокумента", СтрокаДокумента.НомерСтроки);
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения_ОшибкаВнутреннееПеремещение()
		, СоединитьСтроку(ОшибкиНеДоступноВнутреннееПеремещение, ", "));
		Результат.Добавить(Ошибка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОшибкиНеЗаполненНомерПартии) Тогда
		СвернутьМассивЛок(ОшибкиНеЗаполненНомерПартии);
		Ошибка = Новый_ОшибкаЗаполнения("Номенклатура", "ТоварыДокумента", СтрокаДокумента.НомерСтроки);
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения_НеЗаполненНомерПартии()
		, СоединитьСтроку(ОшибкиНеЗаполненНомерПартии, ", "));
		Результат.Добавить(Ошибка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОшибкиНеЗаполненВесПартии) Тогда
		СвернутьМассивЛок(ОшибкиНеЗаполненВесПартии);
		Ошибка = Новый_ОшибкаЗаполнения("Номенклатура", "ТоварыДокумента", СтрокаДокумента.НомерСтроки);
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения_НеЗаполненВесПартии()
		, СоединитьСтроку(ОшибкиНеЗаполненВесПартии, ", "));
		Результат.Добавить(Ошибка);
	КонецЕсли;
	
	Возврат Результат;
	
	// BSLLS:CognitiveComplexity-on
	
КонецФункции

Функция ДокументУчета_ЕстьРольКорректировкаОтгрузки(ДокументУчетаИлиОписание) Экспорт
	
	ТипДокумента = ДокументУчетаИлиОписание.ТипДокумента;
	РольКорректировка = Перечисление_РолиДокументовУчета().КорректировкаОтгрузки;
	
	Возврат ДокументУчета_ТипуДокументаДоступнаРоль(ТипДокумента, РольКорректировка);
	
КонецФункции

Функция ДокументУчета_ТипуДокументаДоступнаРоль(ТипДокумента, Роль) Экспорт
	
	КлючКэш = "ТипуДокументаДоступнаРоль: " + ТипДокумента + ", " + Роль;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = МодульМаркировки().ДокументУчета_ТипуДокументаДоступнаРоль(ТипДокумента, Роль);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ДокументУчета_ПроверитьНедопустимыеАнтисептикиОСУ(ОписаниеДокумента) Экспорт
	
	ОтборКлючСтроки = Новый Структура("КлючСтрокиДокумента");
	ОтборОСУ = Новый Структура("ОтражениеВЭДО", Перечисление_ПравилаОтраженияВЭДО().ОСУ);
	Ошибка = НСтр("ru='Для антисептиков передача кодов в УПД в объемно-сортовом учете допустима только для товаров, введенных в оборот до 01.09.2025'");
	
	Для Каждого СтрДок Из ОписаниеДокумента.ТоварыДокумента.НайтиСтроки(ОтборОСУ) Цикл
		ОтборКлючСтроки.КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
		Для Каждого СтрТов Из ОписаниеДокумента.ТоварыМаркировки.НайтиСтроки(ОтборКлючСтроки) Цикл
			Если ЭтоТоварАнтисептикиГруппаПлатности1(СтрТов.Товар) Тогда
				Возврат Ошибка;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ДокументУчета_ПроверитьФорматНомераПартии(ОписаниеДокумента) Экспорт
	
	ОшибкиЗаполнения = Новый Массив;
	
	ФорматПартии = ФорматНомераПартии();
	ПравилаОтражения = Перечисление_ПравилаОтраженияВЭДО();
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	ДопустимыеВидыПродукции = ДопустимыеВидыПродукцииДляПартионногоУчета();
	ДопустимыеТипыКодов = ДопустимыеТипыКодовМаркировкиДляПартионногоУчета();
	
	ТекстОшибкиДлинаБольшеДопустимой = НСтр("ru = 'Длина номера партии не должна превышать %1 символов'");
	ТекстОшибкиДлинаБольшеДопустимой = ПараметрыВСтроку(ТекстОшибкиДлинаБольшеДопустимой, ФорматПартии.МаксимальнаяДлина);
	
	ТекстОшибкиДлинаМеньшеДопустимой = НСтр("ru = 'Длина номера партии не должна быть меньше %1 символов'");
	ТекстОшибкиДлинаМеньшеДопустимой = ПараметрыВСтроку(ТекстОшибкиДлинаМеньшеДопустимой, ФорматПартии.МинимальнаяДлина);
	
	ТекстОшибкиЕстьНедопустимыеСимволы = НСтр("ru = 'Номер партии содержит недопустимые символы'");
	
	ТекстОшибкиНекорректныйGTIN = НСтр("ru = 'В номере партии указан некорректный GTIN'");
	ТекстОшибкиНеСоответствуетGTIN = НСтр("ru = 'GTIN в номере партии не соответствует товару'");
	
	ТекстОшибкиНекорректнаяДатаПроизвод = НСтр("ru = 'В номере партии указана некорректная дата производства'");
	
	Для Каждого СтрТов Из ОписаниеДокумента.ТоварыМаркировки Цикл
		
		Если Не ЗначениеЗаполнено(СтрТов.Товар)
			Или Не ЗначениеЗаполнено(СтрТов.НомерПартии) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрДок = ОписаниеДокумента.ТоварыДокумента.Найти(СтрТов.КлючСтрокиДокумента, "КлючСтрокиДокумента");
		Если СтрДок = Неопределено Или СтрДок.ОтражениеВЭДО <> ПравилаОтражения.ПартионныйУчет Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не МассивСодержитЗначение(ДопустимыеТипыКодов, СтрТов.Товар.ТипКодаМаркировки)
			Или Не МассивСодержитЗначение(ДопустимыеВидыПродукции, СтрТов.Товар.ВидПродукции) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоКИГУ = (ЗначениеЗаполнено(СтрТов.Товар) И СтрТов.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.ГрупповаяУпаковка);
		НомерСтроки = СтрДок.НомерСтроки;
		СтруктураПартии = СтруктураНомераПартии(СтрТов.НомерПартии);
		
		Если СтруктураПартии.ДлинаБольшеДопустимой Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "ТоварыМаркировки", НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибкиДлинаБольшеДопустимой;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если СтруктураПартии.ДлинаМеньшеДопустимой Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "ТоварыМаркировки", НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибкиДлинаМеньшеДопустимой;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если СтруктураПартии.ЕстьНедопустимыеСимволы Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "ТоварыМаркировки", НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибкиЕстьНедопустимыеСимволы;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если СтруктураПартии.НекорректнаяДатаПроизводства Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "ТоварыМаркировки", НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибкиНекорректнаяДатаПроизвод;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если СтруктураПартии.НекорректныйGTIN Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "ТоварыМаркировки", НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибкиНекорректныйGTIN;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если Не ЭтоКИГУ И ЗначениеЗаполнено(СтруктураПартии.GTIN) И СтрТов.Товар.GTIN <> СтруктураПартии.GTIN Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "ТоварыМаркировки", НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибкиНеСоответствуетGTIN;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОшибкиЗаполнения;
	
КонецФункции

Функция ДокументУчета_ПроверитьТоварыПодлежатПартионномуУчету(ОписаниеДокумента) Экспорт
	
	Результат = "";
	
	РолиДокументов = Перечисление_РолиДокументовУчета();
	Если Не ДокументУчета_ТипуДокументаДоступнаРоль(ОписаниеДокумента.ТипДокумента, РолиДокументов.Отгрузка)
		И Не ДокументУчета_ТипуДокументаДоступнаРоль(ОписаниеДокумента.ТипДокумента, РолиДокументов.КорректировкаОтгрузки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОтборКлючСтроки = Новый Структура("КлючСтрокиДокумента");
	ОтборОСУ = Новый Структура("ОтражениеВЭДО", Перечисление_ПравилаОтраженияВЭДО().ОСУ);
	
	Для Каждого СтрДок Из ОписаниеДокумента.ТоварыДокумента.НайтиСтроки(ОтборОСУ) Цикл
		ОтборКлючСтроки.КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
		Для Каждого СтрТов Из ОписаниеДокумента.ТоварыМаркировки.НайтиСтроки(ОтборКлючСтроки) Цикл
			Если ТоварПодлежитПартионномуУчету(СтрТов.Товар) Тогда
				Результат = ТекстПодсказки_ТоварПодлежитПартионномуУчету(СтрТов.Товар);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ПараметрыПроверкиТоваровДокумента() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЭтоВнутреннееПеремещение", Ложь);
	Результат.Вставить("РолиДоступенПартионныйУчет", Ложь);
	Результат.Вставить("ОСУРазрешенАнтисептикиГруппаПлатности1", Ложь);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // ПроверкаЗаполненияДокументаУчета

// #Область ПроверкиОпераций

// Проверяет, что указанные типы являются либо служебными, либо интерактивными
//
// Параметры:
//  СписокОпераций - ТаблицаЗначений - колонки:
//   * ТипОперации - Строка - см. функцию Перечисление_ТипыОпераций();
//   * Операция    - СправочникСсылка.КонтурМаркировка_Операции - операция;
//
Процедура Операции_ПроверитьЧтоВсеИзвестны(СписокОпераций) Экспорт
	
	СлужебныеТипы = ТипыСлужебныхОпераций();
	ИнтерактивныеТипы = ТипыИнтерактивныхОпераций();
	
	Для Каждого Стр Из СписокОпераций Цикл
		Если Не МассивСодержитЗначение(СлужебныеТипы, Стр.ТипОперации)
			И Не МассивСодержитЗначение(ИнтерактивныеТипы, Стр.ТипОперации) Тогда
			ТекстОшибки = НСтр("ru = 'Обнаружен неизвестный тип операции: %1'");
			ВызватьИсключение ПараметрыВСтроку(ТекстОшибки, Стр.Операция);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет, что все операции в списке завершены
//
// Параметры:
//  СписокОпераций - ТаблицаЗначений - колонки:
//   * Статус - Строка - см. функцию Перечисление_СтатусыОпераций();
//   * Операция - СправочникСсылка.КонтурМаркировка_Операции - операция;
//
Процедура Операции_ПроверитьЧтоВсеЗавершены(СписокОпераций) Экспорт
	
	ЗавершенныеСтатусы = ЗавершенныеСтатусыОпераций();
	
	Для Каждого Стр Из СписокОпераций Цикл
		Если Не МассивСодержитЗначение(ЗавершенныеСтатусы, Стр.Статус) Тогда
			ТекстОшибки = НСтр("ru = 'Обнаружена незавершенная операция: %1'");
			ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, Стр.Операция);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти

// #Область ПроверкаЗаполненияОперации

Функция Операция_Проверить(ОписаниеОперации) Экспорт
	
	Результат = Новый Массив;
	
	Операция_Проверить_ЗаказКодов(ОписаниеОперации, Результат);
	Операция_Проверить_ПечатьКодов(ОписаниеОперации, Результат);
	Операция_Проверить_ОтчетОНанесении(ОписаниеОперации, Результат);
	Операция_Проверить_ВводВОборот(ОписаниеОперации, Результат);
	Операция_Проверить_ВыводИзОборота(ОписаниеОперации, Результат);
	Операция_Проверить_ВозвратВОборот(ОписаниеОперации, Результат);
	Операция_Проверить_Перемаркировка(ОписаниеОперации, Результат);
	Операция_Проверить_РегистрацияНаборов(ОписаниеОперации, Результат);
	Операция_Проверить_НаполнениеНаборовНаТСД(ОписаниеОперации, Результат);
	Операция_Проверить_НаполнениеАгрегатовНаТСД(ОписаниеОперации, Результат);
	Операция_Проверить_РегистрацияАгрегатов(ОписаниеОперации, Результат);
	Операция_Проверить_ТрансформацияАгрегатов(ОписаниеОперации, Результат);
	Операция_Проверить_РасформированиеАгрегатов(ОписаниеОперации, Результат);
	Операция_Проверить_ФормированиеАТК(ОписаниеОперации, Результат);
	Операция_Проверить_ТрансформацияАТК(ОписаниеОперации, Результат);
	Операция_Проверить_РасформированиеАТК(ОписаниеОперации, Результат);
	Операция_Проверить_КорректировкаСведенийОКодах(ОписаниеОперации, Результат);
	Операция_Проверить_ОтчетОВыбытии(ОписаниеОперации, Результат);
	Операция_Проверить_ФормированиеКИГУ(ОписаниеОперации, Результат);
	Операция_Проверить_НаполнениеКИГУНаТСД(ОписаниеОперации, Результат);
	Операция_Проверить_РегистрацияКИГУ(ОписаниеОперации, Результат);
	Операция_Проверить_СообщениеОбОтгрузке(ОписаниеОперации, Результат);
	Операция_Проверить_ПодборКодовНаТСД(ОписаниеОперации, Результат);
	Операция_Проверить_УведомлениеОСостоянииКодов(ОписаниеОперации, Результат);
	Операция_Проверить_РезервированиеПартий(ОписаниеОперации, Результат);
	
	Операция_ПроверитьВидПродукцииДляОперацийАгрегации(ОписаниеОперации, Результат);
	
	Возврат Результат;
	
КонецФункции

Процедура Операция_Проверить_ЗаказКодов(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().ЗаказКодов Тогда
		Возврат;
	КонецЕсли;
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	СпособыВыпуска = Перечисление_СпособыВыпускаТоваров();
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	Если ЗначениеЗаполнено(ОписаниеОперации.ДопРеквизиты.СервисПровайдер) Тогда
		Операция_ПроверитьВидПродукцииСервисПровайдера(ОписаниеОперации, ОшибкиЗаполнения);
	Иначе
		Операция_ПроверитьВидПродукцииДляЗаказаКодов(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Операция_ПроверитьТипЗаказаКодов(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьТипКодаМаркировкиВШапкеИВТоварах(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьСпособВыпускаТоваров(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьТипКодаМаркировки(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьТипОплатыКодов(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьДопустимоеКоличествоУпаковокВЗаказе(ОписаниеОперации, ОшибкиЗаполнения);
	
	Если ОписаниеОперации.ВидПродукции = ВидыПродукции.Легпром
		И ОписаниеОперации.ДопРеквизиты.СпособВыпускаТоваров = СпособыВыпуска.Остатки
		И ОписаниеОперации.ДопРеквизиты.ТипКодаМаркировки <> ТипыКодовМаркировки.Набор Тогда
		Операция_ПроверитьТоварыЛегпрома_Остатки(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_ЗаказКодов(ОписаниеОперации);
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_ПечатьКодов(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().ПечатьКодов Тогда
		Возврат;
	КонецЕсли;
	
	ОбязательныеРеквизиты = Новый_ОбязательныеРеквизитыОперации();
	ОбязательныеРеквизиты.ПоляШапки.Добавить("Организация");
	
	Если ОписаниеОперации.ДопРеквизиты.ПечататьТоварныеЭтикетки Тогда
		ОбязательныеРеквизиты.ПоляШапки.Добавить("ШаблонТоварнойЭтикетки");
	КонецЕсли;
	Если ОписаниеОперации.ДопРеквизиты.ПечататьГрупповыеЭтикетки Тогда
		ОбязательныеРеквизиты.ПоляШапки.Добавить("ШаблонГрупповойЭтикетки");
	КонецЕсли;
	Если ОписаниеОперации.ДопРеквизиты.ПечататьЭтикеткиНаборов Тогда
		ОбязательныеРеквизиты.ПоляШапки.Добавить("ШаблонЭтикеткиНабора");
	КонецЕсли;
	Если ОписаниеОперации.ДопРеквизиты.ПечататьТранспортныеЭтикетки Тогда
		ОбязательныеРеквизиты.ПоляШапки.Добавить("ШаблонТранспортнойЭтикетки");
	КонецЕсли;
	
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_ОтчетОНанесении(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если Не ЭтоОтчетОНанесении(ОписаниеОперации.ТипОперации) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидПродукцииТребуетУказанияКоличестваВОтчетеОНанесении(ОписаниеОперации.ВидПродукции, ОписаниеОперации.ДопРеквизиты.ТипОтчетаОНанесении) Тогда
		
		Если ОписаниеОперации.ДопРеквизиты.ИспользоватьНоминальноеКоличество Тогда
			Операция_ПроверитьНоминальноеКоличествоВТоварах(ОписаниеОперации, ОшибкиЗаполнения);
		КонецЕсли;
		
		Операция_ПроверитьКоличествоВТоварахОперации(ОписаниеОперации, ОшибкиЗаполнения);
		
	КонецЕсли;
	
	Операция_ПроверитьТипОтчетаОНанесении(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьВидПродукцииДляОтчетаОНанесении(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьДатуСрокаГодности(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьДатуПроизводства(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьАльтернативныеСрокиГодности(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьСодержаниеСпирта(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьДатуИНомерПервичногоДокумента(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьНомерСерии(ОписаниеОперации, ОшибкиЗаполнения);
	
	Если ВидПродукцииТребуетУказатьНомерПартииИлиНомерСерииИлиЗСН(ОписаниеОперации.ВидПродукции) Тогда
		Операция_ПроверитьНомерПартииИНомерСерииИЗаводскиеСерийныеНомера(ОписаниеОперации, ОшибкиЗаполнения);
	Иначе
		Если ВидПродукцииПоддерживаетПартионныйУчет(ОписаниеОперации.ВидПродукции) Тогда
			Операция_ПроверитьНомерПартии(ОписаниеОперации, ОшибкиЗаполнения);
			Операция_ПроверитьФорматНомераПартии_ПартионныйУчет(ОписаниеОперации, ОшибкиЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_ОтчетОНанесении(ОписаниеОперации);
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_Перемаркировка(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	Если ОписаниеОперации.ТипОперации <> ТипыОпераций.Перемаркировка Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьНаличиеКодовМаркировки(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьРазрешительныйДокумент(ОписаниеОперации, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_Перемаркировка();
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_РегистрацияНаборов(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().РегистрацияНаборов Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьВидПродукцииДляРегистрацииНаборов(ОписаниеОперации, ОшибкиЗаполнения);
	
	Если ВидПродукцииДопускаетВариативныеНаборы(ОписаниеОперации.ВидПродукции) Тогда
		Операция_ПроверитьКоличествоВложенийДляРегистрацииВариативныхНаборов(ОписаниеОперации, ОшибкиЗаполнения);
	Иначе
		Операция_ПроверитьКоличествоВложенийДляРегистрацииНаборов(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ОписаниеОперации.ДопРеквизиты.ТипНабора = Перечисление_ТипыНаборов().Мультитоварный Тогда
		Операция_ПроверитьВложенияРегистрацииМультитоварныхНаборов(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Операция_ПроверитьНомерПартии(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьФорматНомераПартии_ПартионныйУчет(ОписаниеОперации, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_НаполнениеНаборовНаТСД(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().НаполнениеНаборовНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьНомерПартии(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьФорматНомераПартии_ПартионныйУчет(ОписаниеОперации, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_РегистрацияКИГУ(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().РегистрацияКИГУ Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьВидПродукцииДляРегистрацииКИГУ(ОписаниеОперации.ВидПродукции, ОшибкиЗаполнения);
	
	ТекстОшибкиКоличество = НСтр("ru = 'Количество кодов не соответствует составу групповой упаковки:
	|%1'");
	
	ТекстОшибкиНомерПартии = НСтр("ru = 'Различаются номера партий кодов, входящих в групповую упаковку:
	|%1'");
	
	ДоступенПартионныйУчет = ВидПродукцииПоддерживаетПартионныйУчет(ОписаниеОперации.ВидПродукции);
	
	КэшТоваров = Новый Соответствие;
	МодульМаркировки = МодульМаркировки();
	
	Для Каждого СтрТовара Из ОписаниеОперации.Товары Цикл
		
		ТаблицаКодов = МодульМаркировки.КодыОпераций_Прочитать(ОписаниеОперации.Ссылка, СтрТовара.КлючСтрокиОперации);
		МодульМаркировки.ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
		
		ТаблицаКИГУ = ТаблицаКодов.Скопировать(, "КлючКода, КодМаркировки, НомерПартии");
		
		МодульМаркировки.ТаблицаКодов_ДобавитьКлючиВложенныхКодов(ТаблицаКодов);
		МодульМаркировки.ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
		
		ТаблицаКодов.Индексы.Добавить("КлючАгрегата, НомерПартии");
		
		Товар = Товар_Прочитать(СтрТовара.Товар, КэшТоваров);
		КоличествоВложений = Товар.КоличествоВложений;
		
		КодыСОшибкамиКоличество = Новый Массив;
		КодыСОшибкамиНомерПартии = Новый Массив;
		Для Каждого СтрКИГУ Из ТаблицаКИГУ Цикл
			
			ВложенныеКоды = ТаблицаКодов.НайтиСтроки(Новый Структура("КлючАгрегата", СтрКИГУ.КлючКода));
			
			Если ВложенныеКоды.Количество() <> КоличествоВложений Тогда
				КодыСОшибкамиКоличество.Добавить(СтрКИГУ.КодМаркировки);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВложенныеКоды) Тогда
				
				ОтборПоПартии = Новый Структура("КлючАгрегата, НомерПартии", СтрКИГУ.КлючКода, ВложенныеКоды[0].НомерПартии);
				ВложенныеКодыПартии = ТаблицаКодов.НайтиСтроки(ОтборПоПартии);
				
				Если ВложенныеКоды.Количество() <> ВложенныеКодыПартии.Количество() Тогда
					КодыСОшибкамиНомерПартии.Добавить(СтрКИГУ.КодМаркировки);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(КодыСОшибкамиКоличество) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", СтрТовара.НомерСтроки);
			Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибкиКоличество, СписокКодовДляТекстаОшибки(КодыСОшибкамиКоличество));
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодыСОшибкамиНомерПартии) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", СтрТовара.НомерСтроки);
			Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибкиНомерПартии, СписокКодовДляТекстаОшибки(КодыСОшибкамиНомерПартии));
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизитыРегистрацииКИГУ();
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_НаполнениеКИГУНаТСД(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().НаполнениеКИГУНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьВидПродукцииДляРегистрацииКИГУ(ОписаниеОперации.ВидПродукции, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизитыНаполненияКИГУНаТСД();
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_РасформированиеАгрегатов(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().РасформированиеАгрегатов Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьНаличиеКодовМаркировки(ОписаниеОперации, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_ТрансформацияАгрегатов(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	Если ОписаниеОперации.ТипОперации <> ТипыОпераций.ДобавлениеВАгрегат
		И ОписаниеОперации.ТипОперации <> ТипыОпераций.ИзъятиеИзАгрегата Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОписаниеОперации.ДопРеквизиты.КлючКода) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("КодыМаркировки");
		Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить код агрегата'");
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	Операция_ПроверитьНаличиеКодовМаркировки(ОписаниеОперации, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_ТрансформацияАгрегатов();
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_ФормированиеАТК(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().ФормированиеАТК Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьНаличиеКодовМаркировки(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьВидПродукцииВШапкеИВТоварах(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьГруппуТНВЭДВШапкеИВТоварах(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьВидПродукцииДляФормированияАТК(ОписаниеОперации, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_ФормированиеАТК();
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_ФормированиеКИГУ(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	Если ОписаниеОперации.ТипОперации <> ТипыОпераций.ФормированиеКИГУ Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьКодыДляНаполненияКИГУ(ОписаниеОперации, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_ФормированиеКИГУ();
	Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_ПодборКодовНаТСД(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	Если ОписаниеОперации.ТипОперации <> ТипыОпераций.ПодборКодовНаТСД
		И ОписаниеОперации.ТипОперации <> ТипыОпераций.ПодборТоваровИКодовНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	ПоляШапки = Новый Массив;
	ПоляТоваров = Новый Массив;
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_ПодборКодовНаТСД(ОписаниеОперации);
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_РасформированиеАТК(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().РасформированиеАТК Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьНаличиеКодовМаркировки(ОписаниеОперации, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_РасформированиеАТК();
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_ТрансформацияАТК(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	Если ОписаниеОперации.ТипОперации <> ТипыОпераций.ДобавлениеВАТК
		И ОписаниеОперации.ТипОперации <> ТипыОпераций.ИзъятиеИзАТК Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОписаниеОперации.ДопРеквизиты.КлючКода) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("КодыМаркировки");
		Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить АТК'");
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	Операция_ПроверитьНаличиеКодовМаркировки(ОписаниеОперации, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_ТрансформацияАТК();
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_ВозвратВОборот(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	Если ОписаниеОперации.ТипОперации <> ТипыОпераций.ВозвратВОборот
		И ОписаниеОперации.ТипОперации <> ТипыОпераций.ВозвратВОборотНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	ПричиныВозвратаВОборот = Перечисление_ПричиныВозвратаВОборот();
	
	Операция_ПроверитьПричинуВозвратаВОборот(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьРазрешительныйДокумент(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьВидПервичногоДокументаДляВозвратаВОборот(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьПричинуВозвратаВОборотДляВложенныхТоваровНаборов(ОписаниеОперации, ОшибкиЗаполнения);
	
	Если ОписаниеОперации.ДопРеквизиты.ПричинаВозвратаВОборот = ПричиныВозвратаВОборот.ГосТайна Тогда
		Операция_ПроверитьИдентификаторГосКонтрактаГосТайна(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_ВозвратВОборот(ОписаниеОперации);
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_СообщениеОбОтгрузке(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	Если ОписаниеОперации.ТипОперации <> ТипыОпераций.СообщениеОбОтгрузке Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьВидПродукцииДляСообщенияОбОтгрузке(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьСтрануПолучателяДляСообщенияОбОтгрузке(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьGLNПолучателя(ОписаниеОперации, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_СообщениеОбОтгрузке(ОписаниеОперации);
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_ОтчетОВыбытии(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	Если ОписаниеОперации.ТипОперации <> ТипыОпераций.ОтчетОВыбытии
		И ОписаниеОперации.ТипОперации <> ТипыОпераций.ОтчетОВыбытииНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ПричинаВыбытияКодов = ОписаниеОперации.ДопРеквизиты.ПричинаВыбытияКодов;
	
	Операция_ПроверитьПричинуВыбытияКодов(ВидПродукции, ПричинаВыбытияКодов, ОшибкиЗаполнения);
	Операция_ПроверитьВидПродукцииДляВыбытияКодов(ВидПродукции, ОшибкиЗаполнения);
	
	Операция_ПроверитьПричинуВыбытияВложенныхТоваровНаборов(ОписаниеОперации, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_ОтчетОВыбытии();
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_НаполнениеАгрегатовНаТСД(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().НаполнениеАгрегатовНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьНаличиеАгрегатов(ОписаниеОперации, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_РегистрацияАгрегатов(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().РегистрацияАгрегатов Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьНаличиеКодовМаркировки(ОписаниеОперации, ОшибкиЗаполнения);
	
	ДопустимоеКоличествоКодов = ДопустимоеКоличествоКодовВКИТУ();
	ТекущееКоличествоКодов = МодульМаркировки().КодыОпераций_МаксимальноеКоличествоКодовВКИТУ(ОписаниеОперации.Ссылка);
	ТекстОшибки = НСтр("ru = 'В одном агрегате не может быть больше %1 кодов'");
	
	Если ТекущееКоличествоКодов > ДопустимоеКоличествоКодов Тогда
		Ошибка = Новый_ОшибкаЗаполнения();
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ДопустимоеКоличествоКодов);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_Проверить_КорректировкаСведенийОКодах(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	ВидыСведений = Перечисление_ВидыКорректируемыхСведений();
	
	Если ОписаниеОперации.ТипОперации <> ТипыОпераций.КорректировкаСведенийОКодах Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьНаличиеКодовМаркировки(ОписаниеОперации, ОшибкиЗаполнения);
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	ВидКорректируемыхСведений = ДопРеквизиты.ВидКорректируемыхСведений;
	
	Если ВидКорректируемыхСведений = ВидыСведений.ИдентификаторВСД Тогда
		Операция_ПроверитьТоварыПодлежатВетеринарномуКонтролю(ОписаниеОперации, ОшибкиЗаполнения);
		Операция_ПроверитьФорматИдентификатораВСД(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.ФактическийВес Тогда
		Операция_ПроверитьТоварыИмеютПеременныйВес(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.ВариативныйСрокГодности Тогда
		Операция_ПроверитьТоварыИмеютУсловияХранения(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.КодТНВЭД Тогда
		Операция_ПроверитьДлинуКодаТНВЭД(ОписаниеОперации, ОшибкиЗаполнения);
		Операция_ПроверитьТипЭмиссииКодовМаркировкиТНВЭД(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.ДатаПроизводства Тогда
		Операция_ПроверитьДатуПроизводства(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.СрокГодности Тогда
		Операция_ПроверитьТоварыТипСрокаГодности(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.ВариативныйСрокГодности Тогда
		Операция_ПроверитьАльтернативныеСрокиГодности(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.РазрешительныйДокумент Тогда
		Операция_ПроверитьРазрешительныйДокумент(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.ЛицензияНаНедра Тогда
		Операция_ПроверитьЛицензиюНаНедра(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.НомерПартии Тогда
		Операция_ПроверитьНомерПартии(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Операция_ПроверитьВидПродукцииВШапкеИВТоварах(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьТипыУпаковокКодовДляВидаКорректируемыхСведений(ОписаниеОперации, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_КорректировкаСведенийОКодах(ОписаниеОперации);
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_ВводВОборот(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	ВидыПродукции = Перечисление_ВидыПродукции();
	СпособыВвода = Перечисление_СпособыВводаВОборот();
	ТипыЗаказов = Перечисление_ТипыПроизводственныхЗаказов();
	
	Если ОписаниеОперации.ТипОперации <> ТипыОпераций.ВводВОборот Тогда
		Возврат;
	КонецЕсли;
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	СпособВводаВОборот = ДопРеквизиты.СпособВводаВОборот;
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	
	Операция_ПроверитьСпособВводаВОборот(СпособВводаВОборот, ВидПродукции, ОшибкиЗаполнения);
	Операция_ПроверитьВидПродукцииДляВводаВОборот(ВидПродукции, ОшибкиЗаполнения);
	
	Если СпособВводаВОборот <> СпособыВвода.Остатки Тогда
		Операция_ПроверитьДлинуКодаТНВЭД(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Операция_ПроверитьФорматИдентификатораВСД(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьЗаполнениеИдентификатораВСД(ОписаниеОперации, ОшибкиЗаполнения);
	
	Если СпособВводаВОборот = СпособыВвода.ИмпортФТС Тогда
		Операция_ПроверитьНомерТаможеннойДекларации(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Пиво
		И СпособВводаВОборотТребуетКПППлощадки(СпособВводаВОборот) Тогда
		Операция_ПроверитьПлощадкаКПП(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если СпособВводаВОборот = СпособыВвода.Трансгран Тогда
		Операция_ПроверитьСуммуНДС(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Вода
		И СпособВводаВОборот = СпособыВвода.ПроизводствоРФ Тогда
		Операция_ПроверитьЛицензиюНаНедра(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если СпособВводаВОборот = СпособыВвода.ПроизводствоРФ
		И ДопРеквизиты.ТипПроизводственногоЗаказа = ТипыЗаказов.КонтрактноеПроизводство Тогда
		Операция_ПроверитьИННСобственникаТоваров(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если СпособВводаВОборот = СпособыВвода.ИмпортФТС
		Или СпособВводаВОборот = СпособыВвода.ПроизводствоРФ Тогда
		Операция_ПроверитьДатуПроизводства(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Легпром Тогда
		Если СпособВводаВОборот = СпособыВвода.Остатки Тогда
			Операция_ПроверитьТоварыЛегпрома_Остатки(ОписаниеОперации, ОшибкиЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Бакалея Тогда
		Если СпособВводаВОборот = СпособыВвода.Импорт Тогда
			Операция_ПроверитьТоварыБакалеи_Импорт(ОписаниеОперации, ОшибкиЗаполнения);
		КонецЕсли;
		Если СпособВводаВОборот = СпособыВвода.ИмпортФТС Тогда
			Операция_ПроверитьТоварыБакалеи_ИмпортФТС(ОписаниеОперации, ОшибкиЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Косметика Тогда
		Если СпособВводаВОборот = СпособыВвода.Импорт Тогда
			Операция_ПроверитьТоварыКосметики_Импорт(ОписаниеОперации, ОшибкиЗаполнения);
		КонецЕсли;
		Если СпособВводаВОборот = СпособыВвода.ИмпортФТС Тогда
			Операция_ПроверитьТоварыКосметики_ИмпортФТС(ОписаниеОперации, ОшибкиЗаполнения);
		КонецЕсли;
		Если СпособВводаВОборот = СпособыВвода.Остатки Тогда
			Операция_ПроверитьТоварыКосметики_Остатки(ОписаниеОперации, ОшибкиЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Бады
		И СпособВводаВОборот = СпособыВвода.Остатки Тогда
		Операция_ПроверитьТоварыБады_Остатки(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если СпособВводаВОборот <> СпособыВвода.Остатки Тогда
		Операция_ПроверитьРазрешительныйДокумент(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если СпособВводаВОборот = СпособыВвода.Трансгран Тогда
		Операция_ПроверитьДатуИмпорта(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_ВводВОборот(ОписаниеОперации);
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_ВыводИзОборота(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	Если ОписаниеОперации.ТипОперации <> ТипыОпераций.ВыводИзОборота Тогда
		Возврат;
	КонецЕсли;
	
	Операция_ПроверитьВидПервичногоДокументаДляВыводаИзОборота(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьВидПродукцииДляВыводаИзОборота(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьПричинуВыводаИзОборота(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьСтрануПолучателяДляВыводаИзОборота(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьВесДляВыводаИзОборота(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьФорматНомераПартии(ОписаниеОперации, ОшибкиЗаполнения);
	
	ПричиныВыводаИзОборота = Перечисление_ПричиныВыводаИзОборота();
	ПричинаВыводаИзОборота = ОписаниеОперации.ДопРеквизиты.ПричинаВыводаИзОборота;
	
	Если ПричинаВыводаИзОборота = ПричиныВыводаИзОборота.ПродажаПоГосКонтракту Тогда
		Операция_ПроверитьИдентификаторГосКонтракта(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	Если ПричинаВыводаИзОборота = ПричиныВыводаИзОборота.ПродажаПоСделкеСГосударственнойТайной Тогда
		Операция_ПроверитьИдентификаторГосКонтрактаГосТайна(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	ИННОрганизации = ЗначениеРеквизитаОбъектаЛок(ОписаниеОперации.Организация, "ИНН");
	
	Если ПричинаВыводаИзОборотаТребуетКПППлощадки(ПричинаВыводаИзОборота, ОписаниеОперации.ВидПродукции, ИННОрганизации) Тогда
		Операция_ПроверитьПлощадкаКПП(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ПричинаВыводаИзОборотаТребуетФИАСПлощадки(ПричинаВыводаИзОборота, ОписаниеОперации.ВидПродукции, ИННОрганизации) Тогда
		Операция_ПроверитьПлощадкаФИАС(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
	Операция_ПроверитьПричинуВыводаИзОборотаВложенныхТоваровНаборов(ОписаниеОперации, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_ВыводИзОборота(ОписаниеОперации);
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_УведомлениеОСостоянииКодов(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().УведомлениеОСостоянииКодов Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОперации.ВидПродукции)
		И Не ВидПродукцииДопускаетУведомлениеОСостоянииКодов(ОписаниеОперации.ВидПродукции) Тогда
		ТекстОшибки = НСтр("ru = 'Уведомление о состоянии кодов недоступно для вида продукции ""%1""'");
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ОписаниеОперации.ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	Операция_ПроверитьПлощадкаКПП(ОписаниеОперации, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_УведомлениеОСостоянииКодов(ОписаниеОперации);
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_Проверить_РезервированиеПартий(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().РезервированиеПартий Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОперации.ВидПродукции)
		И Не ВидПродукцииПоддерживаетПартионныйУчет(ОписаниеОперации.ВидПродукции) Тогда
		ТекстОшибки = НСтр("ru = 'Резервирование партий недоступно для вида продукции ""%1""'");
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ОписаниеОперации.ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	Операция_ПроверитьФорматНомераПартии_ПартионныйУчет(ОписаниеОперации, ОшибкиЗаполнения);
	
	ОбязательныеРеквизиты = Операция_ОбязательныеРеквизиты_РезервированиеПартий(ОписаниеОперации);
	Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_ПроверитьОбязательныеРеквизитыШапки(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения)
	
	ПоляШапки = ОбязательныеРеквизиты.ПоляШапки;
	Если Не ЗначениеЗаполнено(ПоляШапки) Тогда
		Возврат;
	КонецЕсли;
	
	СвернутьМассивЛок(ПоляШапки);
	
	ТекстОшибки = НСтр("ru = 'Необходимо заполнить %1'");
	
	Для Каждого ИмяПоля Из ПоляШапки Цикл
		
		Если ОписаниеОперации.Свойство(ИмяПоля)
			И ЗначениеЗаполнено(ОписаниеОперации[ИмяПоля]) Тогда
			Продолжить;
		КонецЕсли;
		Если ОписаниеОперации.ДопРеквизиты.Свойство(ИмяПоля)
			И ЗначениеЗаполнено(ОписаниеОперации.ДопРеквизиты[ИмяПоля]) Тогда
			Продолжить;
		КонецЕсли;
		
		Ошибка = Новый_ОшибкаЗаполнения(ИмяПоля);
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ИмяПоля);
		ОшибкиЗаполнения.Добавить(Ошибка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьОбязательныеРеквизитыТоваров(ОписаниеОперации, ОбязательныеРеквизиты, ОшибкиЗаполнения)
	
	ПоляТоваров = ОбязательныеРеквизиты.ПоляТоваров;
	Если Не ЗначениеЗаполнено(ПоляТоваров) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОписаниеОперации.Товары) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("Товары");
		Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить товары'");
		ОшибкиЗаполнения.Добавить(Ошибка);
		Возврат;
	КонецЕсли;
	
	СвернутьМассивЛок(ПоляТоваров);
	УдалитьЗначениеИзМассива(ПоляТоваров, "Товары");
	
	ТекстОшибки = НСтр("ru = 'Необходимо заполнить %1'");
	
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		Для каждого ИмяПоля Из ПоляТоваров Цикл
			Если Не ЗначениеЗаполнено(Стр[ИмяПоля]) Тогда
				Ошибка = Новый_ОшибкаЗаполнения(ИмяПоля, "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ИмяПоля);
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПродукцииСервисПровайдера(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	СервисПровайдер = ОписаниеОперации.ДопРеквизиты.СервисПровайдер;
	
	Если Не ЗначениеЗаполнено(СервисПровайдер) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ВидПродукцииДоступенСервисПровайдеру(СервисПровайдер, ВидПродукции) Тогда
		ТекстОшибки = ПараметрыВСтроку(НСтр("ru = 'Вид продукции ""%1"" недоступен для cервис-провайдера'"), ВидПродукции);
		Ошибка = Новый_ОшибкаЗаполнения("СервисПровайдер");
		Ошибка.ТекстОшибки = ТекстОшибки;
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПродукцииДляЗаказаКодов(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ТипКодаМаркировки = ОписаниеОперации.ДопРеквизиты.ТипКодаМаркировки;
	СпособВыпускаТоваров = ОписаниеОперации.ДопРеквизиты.СпособВыпускаТоваров;
	ДопустимыеВиды = ДопустимыеВидыПродукцииДляЗаказаКодов(СпособВыпускаТоваров, ТипКодаМаркировки);
	
	Если ДопустимыеВиды.Найти(ВидПродукции) = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Заказ кодов недоступен для вида продукции ""%1""'");
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьТипКодаМаркировкиВШапкеИВТоварах(ОписаниеОперации, ОшибкиЗаполнения)
	
	ШаблонОшибки = НСтр("ru = 'В карточке товара ""%1"" указан другой тип кода маркировки'");
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Стр.Товар.ТипКодаМаркировки <> ОписаниеОперации.ДопРеквизиты.ТипКодаМаркировки Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ПараметрыВСтроку(ШаблонОшибки, Стр.Товар);
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьСпособВыпускаТоваров(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если Не ЗначениеЗаполнено(ОписаниеОперации.ВидПродукции)
		Или Не ЗначениеЗаполнено(ОписаниеОперации.ДопРеквизиты.СпособВыпускаТоваров) Тогда
		Возврат;
	КонецЕсли;
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	СпособыВыпуска = Перечисление_СпособыВыпускаТоваров();
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ТипКодаМаркировки = ОписаниеОперации.ДопРеквизиты.ТипКодаМаркировки;
	СпособВыпускаТоваров = ОписаниеОперации.ДопРеквизиты.СпособВыпускаТоваров;
	ЕстьДокументУчета = ЗначениеЗаполнено(ОписаниеОперации.ДокументУчета);
	
	ДоступныеСпособы = ДопустимыеСпособыВыпускаТоваров(ВидПродукции, ТипКодаМаркировки);
	
	Если ВидПродукции = ВидыПродукции.Бады
		И СпособВыпускаТоваров = СпособыВыпуска.МаркировкаВнеПроизводстваИлиИмпорта Тогда
		
		Операция_ПроверитьТоварыБады_ВнеПроизводстваИмпорта(ОписаниеОперации, ОшибкиЗаполнения);
		
	Иначе
		
		Если Не МассивСодержитЗначение(ДоступныеСпособы, СпособВыпускаТоваров) Тогда
			ТекстСообщения = НСтр("ru = 'Способ выпуска товаров ""%1"" недоступен для вида продукции ""%2""'");
			Ошибка = Новый_ОшибкаЗаполнения("СпособВыпускаТоваров");
			Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, СпособВыпускаТоваров, ВидПродукции);
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьТипКодаМаркировки(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ТипКодаМаркировки = ОписаниеОперации.ДопРеквизиты.ТипКодаМаркировки;
	
	Если Не ЗначениеЗаполнено(ВидПродукции)
		Или Не ЗначениеЗаполнено(ТипКодаМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	СпособВыпускаТоваров = ОписаниеОперации.ДопРеквизиты.СпособВыпускаТоваров;
	СпособыВыпускаТоваров = Перечисление_СпособыВыпускаТоваров();
	
	Если СпособВыпускаТоваров = СпособыВыпускаТоваров.МаркировкаВнеПроизводстваИлиИмпорта
		И ВидПродукцииДопускаетСпособВыпускаМаркировкаВнеПроизводстваИлиИмпорта(ВидПродукции) Тогда
		
		Если ТипКодаМаркировки <> ТипыКодовМаркировки.ЕдиницаТовара Тогда
			ТекстСообщения = НСтр("ru = 'Тип кода маркировки ""%1"" недоступен для способа выпуска товаров ""%2""'");
			Ошибка = Новый_ОшибкаЗаполнения("ТипКодаМаркировки");
			Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, ТипКодаМаркировки, СпособВыпускаТоваров);
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЕсли;
	
	ДоступныеТипы = ДопустимыеТипыКодовМаркировки(СпособВыпускаТоваров, ВидПродукции);
	
	Если ДоступныеТипы.Найти(ТипКодаМаркировки) = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Тип кода маркировки ""%1"" недоступен для вида продукции ""%2""'");
		Ошибка = Новый_ОшибкаЗаполнения("ТипКодаМаркировки");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, ТипКодаМаркировки, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьТипОплатыКодов(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ВидыПродукции = Перечисление_ВидыПродукции();
	ТипОплатыКодов = ОписаниеОперации.ДопРеквизиты.ТипОплатыКодов;
	ТипыОплатыКодов = Перечисление_ТипыОплатыКодов();
	СпособВыпускаТоваров = ОписаниеОперации.ДопРеквизиты.СпособВыпускаТоваров;
	СпособыВыпускаТоваров = Перечисление_СпособыВыпускаТоваров();
	
	Если СпособВыпускаТоваров = СпособыВыпускаТоваров.МаркировкаВнеПроизводстваИлиИмпорта
		И ВидПродукцииДопускаетСпособВыпускаМаркировкаВнеПроизводстваИлиИмпорта(ВидПродукции) Тогда
		
		Если ТипОплатыКодов <> ТипыОплатыКодов.ПоЭмиссии Тогда
			ТекстСообщения = НСтр("ru = 'Тип оплаты кодов ""%1"" недоступен для способа выпуска товаров ""%2""'");
			Ошибка = Новый_ОшибкаЗаполнения("ТипОплатыКодов");
			Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, ТипОплатыКодов, СпособВыпускаТоваров);
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьТипЗаказаКодов(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	
	СпособВыпускаТоваров = ДопРеквизиты.СпособВыпускаТоваров;
	ТипЗаказаКодов = ДопРеквизиты.ТипЗаказаКодов;
	КлючКода = ДопРеквизиты.КлючКода;
	
	Если Не ЗначениеЗаполнено(ТипЗаказаКодов) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = НСтр("ru='Вид продукции %1 не допускает указание типа заказа кодов %2'");
	Если Не ВидПродукцииДопускаетТипЗаказаКодов(ТипЗаказаКодов, ВидПродукции) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ВидПродукции, ТипЗаказаКодов);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	ТекстОшибки = НСтр("ru='Не указан код маркировки для типа заказа %1'");
	Если Не ЗначениеЗаполнено(КлючКода) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("КодМаркировки");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ТипЗаказаКодов);
		ОшибкиЗаполнения.Добавить(Ошибка);
		Возврат;
	КонецЕсли;
	
	МодульМаркировки = МодульМаркировки();
	ТипыЗаказаКодов = Перечисление_ТипыЗаказаКодов();
	
	ТаблицаКодов = МодульМаркировки.Новый_ТаблицаКодов();
	ТаблицаКодов.Добавить().КлючКода = КлючКода;
	
	МодульМаркировки.ТаблицаКодов_ДобавитьКлючиВложенныхКодов(ТаблицаКодов);
	МодульМаркировки.ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	Операция_ПроверитьКодМаркировки(ОписаниеОперации, ТаблицаКодов, ОшибкиЗаполнения);
	
	Если ТипЗаказаКодов = ТипыЗаказаКодов.РасформированиеНабора Тогда
		Операция_ПроверитьТовары_МаркировкаТоваровРасформированногоНабора(ОписаниеОперации, ТаблицаКодов, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ТипЗаказаКодов = ТипыЗаказаКодов.РазделениеТовара Тогда
		Операция_ПроверитьТовары_РазделениеТовара(ОписаниеОперации, ТаблицаКодов, ОшибкиЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьКодМаркировки(ОписаниеОперации, ТаблицаКодов, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	ЭтоОтчетОНанесении = ЭтоОтчетОНанесении(ОписаниеОперации.ТипОперации);
	
	Если Не ЭтоОтчетОНанесении И Не ОписаниеОперации.ТипОперации = ТипыОпераций.ЗаказКодов Тогда
		Возврат;
	КонецЕсли;
	
	ТипыОтчетаОНанесении = Перечисление_ТипыОтчетаОНанесении();
	ТипыЗаказаКодов = Перечисление_ТипыЗаказаКодов();
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	ТипЗаказаКодов = ДопРеквизиты.ТипЗаказаКодов;
	ТипОтчетаОНанесении = ДопРеквизиты.ТипОтчетаОНанесении;
	
	ЭтоМаркировкаРасформированногоНабора = (ТипЗаказаКодов = ТипыЗаказаКодов.РасформированиеНабора
		Или ТипОтчетаОНанесении = ТипыЗаказаКодов.РасформированиеНабора);
	ЭтоРазделениеТовара = (ТипЗаказаКодов = ТипыЗаказаКодов.РазделениеТовара
		Или ТипОтчетаОНанесении = ТипыЗаказаКодов.РазделениеТовара);
	
	СтрКода = ТаблицаКодов.Найти(ДопРеквизиты.КлючКода, "КлючКода");
	
	ТекстОшибки = НСтр("ru='Вид продукции кода маркировки %1 не соответствует виду продукции операции'");
	Если СтрКода.ВидПродукции <> ОписаниеОперации.ВидПродукции Тогда
		Ошибка = Новый_ОшибкаЗаполнения("КодМаркировки");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, СтрКода.ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
		Возврат;
	КонецЕсли;
	
	Если ЭтоМаркировкаРасформированногоНабора Тогда
		
		ТекстОшибки = НСтр("ru='Маркировка товаров расформированного набора доступна только для кодов набора'");
		Если СтрКода.ОбщийТипУпаковки <> Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.Набор Тогда
			Ошибка = Новый_ОшибкаЗаполнения("КодМаркировки");
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
			Возврат;
		КонецЕсли;
		
		ТекстОшибки = НСтр("ru='Не найдены вложенные коды набора'");
		Если ЭтоОтчетОНанесении И ТаблицаКодов.Количество() = 1 Тогда
			Ошибка = Новый_ОшибкаЗаполнения("КодМаркировки");
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоРазделениеТовара Тогда
		
		ТекстОшибки = НСтр("ru='Разделение товара доступно только для кодов единиц товара'");
		Если СтрКода.ОбщийТипУпаковки <> Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ЕдиницаТовара Тогда
			Ошибка = Новый_ОшибкаЗаполнения("КодМаркировки");
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		ТекстОшибки = НСтр("ru='Разделение товара доступно только для товаров с переменным количеством'");
		Если Не СтрКода.Товар.ПеременныйВес Тогда
			Ошибка = Новый_ОшибкаЗаполнения("КодМаркировки");
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		ТекстОшибки = НСтр("ru='Для разделения товара требуется полный код маркировки'");
		Если Не СтрКода.ЕстьПолныйКод Тогда
			Ошибка = Новый_ОшибкаЗаполнения("КодМаркировки");
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьТовары_МаркировкаТоваровРасформированногоНабора(ОписаниеОперации, ТаблицаКодов, ОшибкиЗаполнения)
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	КлючКода = ДопРеквизиты.КлючКода;
	
	ОтборАгрегата = Новый Структура("КлючАгрегата", КлючКода);
	
	ТаблицаВложенныхКодов = ТаблицаКодов.Скопировать(ОтборАгрегата, "Товар");
	ТаблицаВложенныхКодов.Колонки.Добавить("КоличествоКодов", ОписаниеТипа_Число());
	ТаблицаВложенныхКодов.ЗаполнитьЗначения(1, "КоличествоКодов");
	ТаблицаВложенныхКодов.Свернуть("Товар", "КоличествоКодов");
	
	ТекстОшибки = НСтр("ru='Количество кодов не соответствует составу расформированного набора: %1'");
	Для Каждого Стр Из ТаблицаВложенныхКодов Цикл
		
		СтрОперации = ОписаниеОперации.Товары.Найти(Стр.Товар, "Товар");
		
		Если Не ЗначениеЗаполнено(СтрОперации) 
			Или (СтрОперации.КоличествоУпаковок <> Стр.КоличествоКодов) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товары");
			Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, Стр.Товар);
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТовары_РазделениеТовара(ОписаниеОперации, ТаблицаКодов, ОшибкиЗаполнения)
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	ОписаниеКода = ТаблицаКодов.Найти(ДопРеквизиты.КлючКода, "КлючКода");
	
	ТекстОшибки = НСтр("ru='Товар должен совпадать с товаром разделяемого кода %1'");
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Стр.Товар <> ОписаниеКода.Товар Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, Стр.Товар);
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьДопустимоеКоличествоУпаковокВЗаказе(ОписаниеОперации, ОшибкиЗаполнения)
	
	ДопустимоеКоличествоКодов = Операция_ДопустимоеКоличествоКодов(ОписаниеОперации.ТипОперации);
	ТекстОшибки = ПараметрыВСтроку(НСтр("ru = 'Количество упаковок не должно превышать %1'"), ДопустимоеКоличествоКодов);
	
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Стр.КоличествоУпаковок > ДопустимоеКоличествоКодов Тогда
			Ошибка = Новый_ОшибкаЗаполнения("КоличествоУпаковок", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТоварыЛегпрома_Остатки(ОписаниеОперации, ОшибкиЗаполнения)
	
	РазрешеныОстаткиЛегпром = ФичаФлагВключен(Перечисление_ФичаФлаги().ОстаткиЛегпромВолна4);
	
	Если РазрешеныОстаткиЛегпром Тогда
		ТекстОшибки = НСтр(
		"ru = 'Для кодов маркировки со способом выпуска ""Маркировка остатков""
		|будет доступен ввод в оборот только по товарам из списка расширения ППРФ № 2129 от 25.12.2025'");
	Иначе
		ТекстОшибки = НСтр("ru = 'Маркировка остатков легпрома недоступна'");
	КонецЕсли;
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Не РазрешеныОстаткиЛегпром Или Не ЭтоТоварЛегпромаВолна4(Стр.Товар) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТоварыБакалеи_ИмпортФТС(ОписаниеОперации, ОшибкиЗаполнения)
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	РазрешенИмпортФТСВолна2 = ФичаФлагВключен(ФичаФлаги.ИмпортФТСБакалеяВолна2);
	
	ГруппаПлатности_2 = 2;
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если Стр.Товар.ВидПродукции <> ВидыПродукции.Бакалея Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаПлатности = Товар_ГруппаПлатности(Стр.Товар);
		
		Если ГруппаПлатности = ГруппаПлатности_2 И Не РазрешенИмпортФТСВолна2 Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Для бакалейной продукции (Соусы и специи) необходимо использовать способ ввода в оборот Импорт РФ'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТоварыБакалеи_Импорт(ОписаниеОперации, ОшибкиЗаполнения)
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	ВидыПродукции = Перечисление_ВидыПродукции();
	РазрешенИмпортВолна2 = ФичаФлагВключен(ФичаФлаги.ИмпортБакалеяВолна2);
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если Стр.Товар.ВидПродукции <> ВидыПродукции.Бакалея Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаПлатности = Товар_ГруппаПлатности(Стр.Товар);
		ГруппаПлатности_2 = 2;
		
		Если ГруппаПлатности = ГруппаПлатности_2 Тогда
			
			Если Не РазрешенИмпортВолна2 Тогда
				Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = НСтр("ru = 'Для бакалейной продукции (Соусы и специи) необходимо использовать способ ввода в оборот Импорт с ФТС'");
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
		Иначе
			
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Для бакалейной продукции необходимо использовать способ ввода в оборот Импорт с ФТС'");
			ОшибкиЗаполнения.Добавить(Ошибка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТоварыКосметики_ИмпортФТС(ОписаниеОперации, ОшибкиЗаполнения)
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	РазрешенИмпортФТСВолна2 = ФичаФлагВключен(ФичаФлаги.ИмпортФТСКосметикаВолна2);
	РазрешенИмпортФТСВолна3 = ФичаФлагВключен(ФичаФлаги.ИмпортФТСКосметикаВолна3);
	
	ГруппаПлатности_2 = 2;
	ГруппаПлатности_3 = 3;
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если Стр.Товар.ВидПродукции <> ВидыПродукции.Косметика Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаПлатности = Товар_ГруппаПлатности(Стр.Товар);
		
		Если ГруппаПлатности = ГруппаПлатности_2 И Не РазрешенИмпортФТСВолна2 Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Для косметики и бытовой химии (Средства для волос, бритья, дезодоранты) необходимо использовать способ ввода в оборот Импорт РФ'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если ГруппаПлатности = ГруппаПлатности_3 И Не РазрешенИмпортФТСВолна3 Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Для косметики и бытовой химии (декоративная косметика, средства для ухода за полостью рта) необходимо использовать способ ввода в оборот Импорт РФ'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТоварыКосметики_Импорт(ОписаниеОперации, ОшибкиЗаполнения)
	
	ФичаФлаги = Перечисление_ФичаФлаги();
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	РазрешенИмпортВолна2 = ФичаФлагВключен(ФичаФлаги.ИмпортКосметикаВолна2);
	РазрешенИмпортВолна3 = ФичаФлагВключен(ФичаФлаги.ИмпортКосметикаВолна3);
	
	ГруппаПлатности_2 = 2;
	ГруппаПлатности_3 = 3;
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если Стр.Товар.ВидПродукции <> ВидыПродукции.Косметика Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаПлатности = Товар_ГруппаПлатности(Стр.Товар);
		
		Если ГруппаПлатности = ГруппаПлатности_2 Тогда
			
			Если Не РазрешенИмпортВолна2 Тогда
				Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = НСтр("ru = 'Для косметики и бытовой химии (Средства для волос, бритья, дезодоранты) необходимо использовать способ ввода в оборот Импорт с ФТС'");
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
		ИначеЕсли ГруппаПлатности = ГруппаПлатности_3 Тогда
			
			Если Не РазрешенИмпортВолна3 Тогда
				Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = НСтр("ru = 'Для косметики и бытовой химии (декоративная косметика, средства для ухода за полостью рта) необходимо использовать способ ввода в оборот Импорт с ФТС'");
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
		Иначе
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Для косметики и бытовой химии необходимо использовать способ ввода в оборот Импорт с ФТС'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТоварыКосметики_Остатки(ОписаниеОперации, ОшибкиЗаполнения)
	
	РазрешеныОстатки = ФичаФлагВключен(Перечисление_ФичаФлаги().ОстаткиВводВОборотКосметикаВолна4);
	
	Если РазрешеныОстатки Тогда
		ТекстОшибки = НСтр(
		"ru = 'Для кодов маркировки со способом выпуска ""Маркировка остатков""
		|будет доступен ввод в оборот только по товарам из списка расширения ППРФ № 808 от 31.05.2025'");
	Иначе
		ТекстОшибки = НСтр("ru = 'Маркировка остатков ""Косметика, бытовая химия и товары личной гигиены"" недоступна'");
	КонецЕсли;
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если Не РазрешеныОстатки Или Не ЭтоТоварКосметикиВолна4(Стр.Товар) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТоварыБады_Остатки(ОписаниеОперации, ОшибкиЗаполнения)
	
	РазрешеныОстатки = ФичаФлагВключен(Перечисление_ФичаФлаги().ОстаткиВводВОборотБадыВолна3);
	
	Если РазрешеныОстатки Тогда
		ТекстОшибки = НСтр(
		"ru = 'Для кодов маркировки со способом выпуска ""Маркировка остатков""
		|будет доступен ввод в оборот только по товарам из списка расширения ППРФ № 811 от 31.05.2025'");
	Иначе
		ТекстОшибки = НСтр("ru = 'Маркировка остатков ""БАДы и специализированное питание"" недоступна'");
	КонецЕсли;
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если Не РазрешеныОстатки Или Не ЭтоТоварБАДыВолна3(Стр.Товар) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТоварыБады_ВнеПроизводстваИмпорта(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	СпособВыпускаТоваров = ОписаниеОперации.ДопРеквизиты.СпособВыпускаТоваров;
	РазрешеноВнеПроизводства = ФичаФлагВключен(Перечисление_ФичаФлаги().МаркировкаВнеПроизводстваИлиИмпортаБадыВолна3);
	
	Если РазрешеноВнеПроизводства Тогда
		ТекстОшибки = НСтр("ru = 'Способ выпуска товаров ""%1"" доступен только для товаров, указанных в ППРФ № 811 от 31.05.2025'");
		ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, СпособВыпускаТоваров);
	Иначе
		ТекстОшибки = НСтр("ru = 'Способ выпуска товаров ""%1"" недоступен для вида продукции ""%2""'");
		ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, СпособВыпускаТоваров, ВидПродукции);
	КонецЕсли;
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если Не РазрешеноВнеПроизводства Или Не ЭтоТоварБАДыВолна3(Стр.Товар) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПродукцииДляОтчетаОНанесении(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = НСтр("ru = 'Отчет о нанесении недоступен для вида продукции ""%1""'");
	
	Если ДопустимыеВидыПродукцииДляОтчетаОНанесении().Найти(ВидПродукции) = Неопределено Тогда
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьТипОтчетаОНанесении(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОтчетаОНанесении = Перечисление_ТипыОтчетаОНанесении();
	
	ТипОперации = ОписаниеОперации.ТипОперации;
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	ТипОтчетаОНанесении = ДопРеквизиты.ТипОтчетаОНанесении;
	КлючКода = ДопРеквизиты.КлючКода;
	
	Если ЭтоТипОтчетаОНанесенииПоУмолчанию(ТипОтчетаОНанесении) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = НСтр("ru='Вид продукции %1 не допускает указание типа отчета о нанесении %2'");
	Если Не ВидПродукцииДопускаетТипОтчетаОНанесении(ТипОтчетаОНанесении, ТипОперации, ВидПродукции) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ВидПродукции, ТипОтчетаОНанесении);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	ТекстОшибки = ПараметрыВСтроку(НСтр("ru='Не указан код маркировки для типа отчета %1'"), ТипОтчетаОНанесении);
	Если Не ЗначениеЗаполнено(КлючКода) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("КодМаркировки");
		Ошибка.ТекстОшибки = ТекстОшибки;
		ОшибкиЗаполнения.Добавить(Ошибка);
		Возврат;
	КонецЕсли;
	
	МодульМаркировки = МодульМаркировки();
	
	ТаблицаКодов = МодульМаркировки.Новый_ТаблицаКодов();
	ТаблицаКодов.Добавить().КлючКода = КлючКода;
	
	МодульМаркировки.ПолныеКоды_Прочитать(ТаблицаКодов);
	
	МодульМаркировки.ТаблицаКодов_ДобавитьКлючиВложенныхКодов(ТаблицаКодов);
	МодульМаркировки.ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	Операция_ПроверитьКодМаркировки(ОписаниеОперации, ТаблицаКодов, ОшибкиЗаполнения);
	
	Если ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РасформированиеНабора Тогда
		Операция_ПроверитьТовары_МаркировкаТоваровРасформированногоНабора(ОписаниеОперации, ТаблицаКодов, ОшибкиЗаполнения);
	КонецЕсли;
	
	Если ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РазделениеТовара Тогда
		Операция_ПроверитьТовары_РазделениеТовара(ОписаниеОперации, ТаблицаКодов, ОшибкиЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьНоминальноеКоличествоВТоварах(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	ТекстОшибки = НСтр("ru = 'Не заполнено номинальное значение в карточке товара'");
	
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		
		ОписаниеТовара = Товар_Прочитать(Стр.Товар);
		ДопРеквизиты = ОписаниеТовара.ДопРеквизиты;
		
		ПроверитьНоминальноеКоличество = ОписаниеТовара.ПеременныйВес
									И ВидПродукцииПоддерживаетНоминальноеКоличество(ОписаниеТовара.ВидПродукции)
									И Стр.Количество = 0;
		
		Если ПроверитьНоминальноеКоличество И Не ЗначениеЗаполнено(ДопРеквизиты.НоминальноеКоличество) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьКоличествоВТоварахОперации(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	МодульМаркировки = МодульМаркировки();
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ТипОтчетаОНанесении = ОписаниеОперации.ДопРеквизиты.ТипОтчетаОНанесении;
	
	ИспользоватьНоминальноеКоличество = ОписаниеОперации.ДопРеквизиты.ИспользоватьНоминальноеКоличество;
	ВидПродукцииСПеременнойХарактеристикой = ВидПродукцииПоддерживаетКоличествоВСтруктуреКодаОтчетаОНанесении(ВидПродукции, ТипОтчетаОНанесении);
	
	ТекстОшибки = НСтр("ru = 'Необходимо заполнить значение переменной характеристики во всех кодах маркировки'");
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		ОписаниеТовара = Товар_Прочитать(Стр.Товар);
		
		Если Не ВидПродукцииСПеременнойХарактеристикой
			Или Не ОписаниеТовара.ПеременныйВес Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.Количество) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Количество", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
			Продолжить;
		КонецЕсли;
		
		ТаблицаКодов = МодульМаркировки.КодыОпераций_Прочитать(ОписаниеОперации.Ссылка, Стр.КлючСтрокиОперации);
		МодульМаркировки.КодыМаркировки_Прочитать(ТаблицаКодов);
		
		Операция_ПроверитьПеременнуюХарактеристикуВКодахМаркировки(ТаблицаКодов, Стр, ИспользоватьНоминальноеКоличество, ОшибкиЗаполнения);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьПеременнуюХарактеристикуВКодахМаркировки(ТаблицаКодов, СтрОперации, ИспользоватьНоминальноеКоличество, ОшибкиЗаполнения)
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	ОписаниеТовара = Товар_Прочитать(СтрОперации.Товар);
	ДопРеквизиты = ОписаниеТовара.ДопРеквизиты;
	
	ОшибкаПустоеКоличество = НСтр("ru = 'Необходимо заполнить значение переменной характеристики в кодах маркировки: %1'");
	ОшибкаНекорректныйДиапазон = НСтр("ru = 'В кодах маркировки значение переменной характеристики находится за пределами допустимого интервала: %1'");
	
	ЭтоРЭПСХарактеристикой = (ОписаниеТовара.ВидПродукции = ВидыПродукции.Электроника И ОписаниеТовара.ПеременныйВес);
	РазрешеноПустоеКоличество = (ИспользоватьНоминальноеКоличество И ЗначениеЗаполнено(ДопРеквизиты.НоминальноеКоличество));
	
	КоличествоМин = ДопРеквизиты.КоличествоМин;
	КоличествоМакс = ДопРеквизиты.КоличествоМакс;
	Если Не ЗначениеЗаполнено(КоличествоМакс) Тогда
		КоличествоМакс = ДопРеквизиты.НоминальноеКоличество;
	КонецЕсли;
	
	КодыCПустымКоличеством = Новый Массив;
	КодыСНевернымКоличеством = Новый Массив;
	Для каждого СтрКода Из ТаблицаКодов Цикл
		
		Количество = СтрКода.Количество;
		Если Не ЗначениеЗаполнено(Количество) И РазрешеноПустоеКоличество Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Количество) Тогда
			КодыCПустымКоличеством.Добавить(СтрКода.КодМаркировки);
		ИначеЕсли ЭтоРЭПСХарактеристикой И ЗначениеЗаполнено(КоличествоМакс) Тогда
			Если Количество > КоличествоМакс Или Количество < КоличествоМин Тогда
				КодыСНевернымКоличеством.Добавить(СтрКода.КодМаркировки);
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КодыCПустымКоличеством) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("Количество", "Товары", СтрОперации.НомерСтроки);
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ОшибкаПустоеКоличество, СписокКодовДляТекстаОшибки(КодыCПустымКоличеством));
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодыСНевернымКоличеством) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("Количество", "Товары", СтрОперации.НомерСтроки);
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ОшибкаНекорректныйДиапазон, СписокКодовДляТекстаОшибки(КодыСНевернымКоличеством));
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьДатуСрокаГодности(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ТипСрокаГодности = ОписаниеОперации.ДопРеквизиты.ТипСрокаГодности;
	ТипОтчетаОНанесении = ОписаниеОперации.ДопРеквизиты.ТипОтчетаОНанесении;
	
	Если Не ВидПродукцииТребуетСрокГодностиВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении)
		Или ТипСрокаГодности = Перечисление_ТипыСроковГодности().СрокГодностиБольше72СУсловием Тогда
		Возврат;
	КонецЕсли;
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	ТребуетсяДляКИНКИГУ = ВидПродукцииТребуетСрокГодностиВОтчетеОНанесенииДляКИНКИГУ(ВидПродукции);
	ДопускаетсяДляКИГУ = ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесенииДляКИГУ(ОписаниеОперации.ВидПродукции, ТипОтчетаОНанесении);
	ДопускаетсяДляКИН = ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесенииДляКИН(ОписаниеОперации.ВидПродукции, ТипОтчетаОНанесении);
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		Если ЗначениеЗаполнено(Стр.ДатаСрокаГодности)
			И НачалоДня(Стр.ДатаСрокаГодности) < НачалоДня(ТекущаяДата()) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("ДатаСрокаГодности", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Срок годности не должен заканчиваться раньше текущей даты'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
	// Проверка, что дата срока годности заполнена, где требуется
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если ЗначениеЗаполнено(Стр.ДатаСрокаГодности) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВидПродукцииТребуетСрокГодностиПоХарактеристикеСрокаИспользования(ВидПродукции)
			И Не ХарактеристикаСрокаИспользованияТребуетСрокГодности(Стр.Товар) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.Комплект
			Или Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.ЕдиницаТовара
			Или ТребуетсяДляКИНКИГУ Тогда
			Ошибка = Новый_ОшибкаЗаполнения("ДатаСрокаГодности", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить срок годности'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
	// Проверка, что дата срока годности не заполнена, где не требуется
	Если Не ДопускаетсяДляКИГУ Или Не ДопускаетсяДляКИН Тогда
		Для Каждого Стр Из ОписаниеОперации.Товары Цикл
			
			Если Не ЗначениеЗаполнено(Стр.ДатаСрокаГодности) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ДопускаетсяДляКИГУ И Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.ГрупповаяУпаковка Тогда
				ТекстОшибки = НСтр("ru = 'Для групповых упаковок параметр ""Годен до"" не должен заполняться'");
			ИначеЕсли Не ДопускаетсяДляКИН И Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.Набор Тогда
				ТекстОшибки = НСтр("ru = 'Для наборов параметр ""Годен до"" не должен заполняться'");
			Иначе
				Продолжить;
			КонецЕсли;
			
			Ошибка = Новый_ОшибкаЗаполнения("ДатаСрокаГодности", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьДатуПроизводства(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	// Проверка, что дата производства не больше текущей даты
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	Если НачалоДня(ОписаниеОперации.ДопРеквизиты.ДатаПроизводства) > ТекущаяДата Тогда
		Ошибка = Новый_ОшибкаЗаполнения("ДатаПроизводства");
		Ошибка.ТекстОшибки = НСтр("ru = 'Дата производства не может быть позже текущей даты'");
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		Если НачалоДня(Стр.ДатаПроизводства) > ТекущаяДата Тогда
			Ошибка = Новый_ОшибкаЗаполнения("ДатаПроизводства", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Дата производства не может быть позже текущей даты'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
	ТипОперации = ОписаниеОперации.ТипОперации;
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	СпособВводаВОборот = ОписаниеОперации.ДопРеквизиты.СпособВводаВОборот;
	ТипОтчетаОНанесении = ОписаниеОперации.ДопРеквизиты.ТипОтчетаОНанесении;
	
	Если ЭтоОтчетОНанесении(ТипОперации)
		И Не ВидПродукцииТребуетДатуПроизводстваВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипОперации = ТипыОпераций.ВводВОборот
		И Не ВидПродукцииТребуетУказатьДатуПроизводстваВоВводеВОборот(ВидПродукции, СпособВводаВОборот) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяДляКИНКИГУ = Ложь;
	ДопускаетсяДляКИНКИГУ = Истина;
	Если ЭтоОтчетОНанесении(ТипОперации) Тогда
		ТребуетсяДляКИНКИГУ = ВидПродукцииТребуетДатуПроизводстваВОтчетеОНанесенииДляКИНКИГУ(ВидПродукции, ТипОтчетаОНанесении);
		ДопускаетсяДляКИНКИГУ = ВидПродукцииДопускаетДатуПроизводстваВОтчетеОНанесенииДляКИНКИГУ(ВидПродукции, ТипОтчетаОНанесении);
	КонецЕсли;
	
	// Проверка, что дата производства заполнена, где требуется
	Если Не ЗначениеЗаполнено(ОписаниеОперации.ДопРеквизиты.ДатаПроизводства) Тогда
		Для каждого Стр Из ОписаниеОперации.Товары Цикл
			Если ЗначениеЗаполнено(Стр.ДатаПроизводства) Тогда
				Продолжить;
			КонецЕсли;
			Если Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.ЕдиницаТовара
				Или Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.Комплект
				Или ТребуетсяДляКИНКИГУ Тогда
				Ошибка = Новый_ОшибкаЗаполнения("ДатаПроизводства", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить дату производства'");
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Проверка, что дата производства не заполнена, где не требуется
	Если Не ДопускаетсяДляКИНКИГУ Тогда
		Для Каждого Стр Из ОписаниеОперации.Товары Цикл
			
			Если Не ЗначениеЗаполнено(Стр.ДатаПроизводства) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.ГрупповаяУпаковка Тогда
				ТекстОшибки = НСтр("ru = 'Для групповых упаковок дату производства нельзя указывать'");
			ИначеЕсли Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.Набор Тогда
				ТекстОшибки = НСтр("ru = 'Для наборов дату производства нельзя указывать'");
			Иначе
				Продолжить;
			КонецЕсли;
			
			Ошибка = Новый_ОшибкаЗаполнения("ДатаСрокаГодности", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьАльтернативныеСрокиГодности(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыСрокаГодности = Перечисление_ТипыСроковГодности();
	ВидыСведений = Перечисление_ВидыКорректируемыхСведений();
	ТипОтчетаОНанесении = Перечисление_ТипыОтчетаОНанесении();
	
	Если (ОписаниеОперации.ДопРеквизиты.ТипСрокаГодности <> ТипыСрокаГодности.СрокГодностиБольше72СУсловием
		И ОписаниеОперации.ДопРеквизиты.ВидКорректируемыхСведений <> ВидыСведений.ВариативныйСрокГодности)
		Или Не ВидПродукцииДопускаетАльтернативныйСрокГодности(ОписаниеОперации.ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	ДопускаетсяДляКИГУ = ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесенииДляКИГУ(ОписаниеОперации.ВидПродукции, ТипОтчетаОНанесении);
	ДопускаетсяДляКИН = ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесенииДляКИН(ОписаниеОперации.ВидПродукции, ТипОтчетаОНанесении);
	
	// Проверка, что дата альтернативного срока годности больше текущей даты
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		Для каждого Элемент Из Стр.АльтернативныеСрокиГодности Цикл
			Если ЗначениеЗаполнено(Элемент.Значение)
				И НачалоДня(Элемент.Значение) < НачалоДня(ТекущаяДата()) Тогда
				Ошибка = Новый_ОшибкаЗаполнения("АльтернативныйСрокГодности", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = НСтр("ru = 'Срок годности не должен заканчиваться раньше текущей даты'");
				ОшибкиЗаполнения.Добавить(Ошибка);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Проверка, что альтернативный срок годности заполнен где требуется
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.Комплект
			Или Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.ЕдиницаТовара Тогда
			Для Каждого Элемент Из Стр.АльтернативныеСрокиГодности Цикл
				Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
					Ошибка = Новый_ОшибкаЗаполнения("АльтернативныйСрокГодности", "Товары", Стр.НомерСтроки);
					Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить все варианты срока годности'");
					ОшибкиЗаполнения.Добавить(Ошибка);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Проверка, что альтернативный срок годности не заполнен где не требуется
	Если Не ДопускаетсяДляКИГУ Или Не ДопускаетсяДляКИН Тогда
		Для Каждого Стр Из ОписаниеОперации.Товары Цикл
			
			Если Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.ГрупповаяУпаковка И Не ДопускаетсяДляКИГУ Тогда
				ТекстОшибки = НСтр("ru = 'Для групповых упаковок не допускается заполнение вариантов срока годности'");
			ИначеЕсли Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.Набор И Не ДопускаетсяДляКИН Тогда
				ТекстОшибки = НСтр("ru = 'Для наборов не допускается заполнение вариантов срока годности'");
			Иначе
				Продолжить;
			КонецЕсли;
			
			Для каждого Элемент Из Стр.АльтернативныеСрокиГодности Цикл
				Если ЗначениеЗаполнено(Элемент.Значение) Тогда
					Ошибка = Новый_ОшибкаЗаполнения("АльтернативныйСрокГодности", "Товары", Стр.НомерСтроки);
					Ошибка.ТекстОшибки = ТекстОшибки;
					ОшибкиЗаполнения.Добавить(Ошибка);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьСодержаниеСпирта(ОписаниеОперации, ОшибкиЗаполнения)
	
	Товары = ОписаниеОперации.Товары;
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ТипОтчетаОНанесении = ОписаниеОперации.ДопРеквизиты.ТипОтчетаОНанесении;
	
	Требуется = ВидПродукцииТребуетСодержаниеСпиртаВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении);
	Допускается = ВидПродукцииДопускаетУказаниеФактическогоСодержанияСпирта(ВидПродукции, ТипОтчетаОНанесении);
	ТолькоДляКег = ВидПродукцииТребуетУказатьСодержаниеСпиртаТолькоДляКег(ВидПродукции);
	
	Если Не Требуется И Не Допускается Тогда
		Возврат;
	КонецЕсли;
	
	КэшТоваров = Новый Соответствие;
	
	Для Каждого Стр Из Товары Цикл
		
		ОписаниеТовара = Товар_Прочитать(Стр.Товар, КэшТоваров);
		
		Если ДлинаДробнойЧасти(Стр.СодержаниеСпирта) > 1 Тогда
			ТекстОшибки = НСтр("ru = 'Фактическое содержание спирта не должно содержать больше одного знака после запятой'");
			Ошибка = Новый_ОшибкаЗаполнения("СодержаниеСпирта", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если ТолькоДляКег И Не ОписаниеТовара.ДопРеквизиты.ЭтоКег Тогда
			Продолжить;
		КонецЕсли;
		
		Если Требуется И Не ЗначениеЗаполнено(Стр.СодержаниеСпирта) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("СодержаниеСпирта", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить фактическое содержание спирта'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьДатуИНомерПервичногоДокумента(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если Не ВидПродукцииДопускаетУказаниеНомераИДатыДокументаВОтчетеОНанесении(ОписаниеОперации.ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибкиНомер = НСтр("ru = 'Необходимо заполнить Номер первичного документа со способом выпуска Производство РФ'");
	ТекстОшибкиДата = НСтр("ru = 'Необходимо заполнить Дату первичного документа со способом выпуска Производство РФ'");
	
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Стр.ЭтоПроизводствоРФ Тогда
			Если Не ЗначениеЗаполнено(Стр.НомерДокумента)
				И Не ЗначениеЗаполнено(ОписаниеОперации.ДопРеквизиты.НомерДокумента) Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерДокумента", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиНомер;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Стр.ДатаДокумента)
				И Не ЗначениеЗаполнено(ОписаниеОперации.ДопРеквизиты.ДатаДокумента) Тогда
				Ошибка = Новый_ОшибкаЗаполнения("ДатаДокумента", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиДата;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьНомерСерии(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если Не ВидПродукцииТребуетНомерСерииВОтчетеОНанесении(ОписаниеОперации.ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОписаниеОперации.ДопРеквизиты.НомерСерии) Тогда
		Для Каждого Стр Из ОписаниеОперации.Товары Цикл
			Если Не ЗначениеЗаполнено(Стр.НомерСерии) Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерСерии", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить Номер серии'");
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Операция_ПроверитьФорматНомераПартии(ОписаниеОперации, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_ПроверитьНомерПартииИНомерСерииИЗаводскиеСерийныеНомера(ОписаниеОперации, ОшибкиЗаполнения)
	
	НомерСерии = ОписаниеОперации.ДопРеквизиты.НомерСерии;
	НомерПартии = ОписаниеОперации.ДопРеквизиты.НомерПартии;
	КоличествоЗСН = МодульМаркировки().КодыОпераций_КоличествоЗаводскихСерийныхНомеров(ОписаниеОперации.Ссылка);
	
	ТекстОшибки = НСтр("ru = 'Необходимо заполнить заводской серийный номер товара'");
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Товар = Товар_Прочитать(Стр.Товар);
		Если Не Товар.ДопРеквизиты.ИспользоватьЗаводскойСН Тогда
			Продолжить;
		КонецЕсли;
		
		СтрЗСН = КоличествоЗСН.Найти(Стр.КлючСтрокиОперации, "КлючСтрокиОперации");
		Если СтрЗСН = Неопределено Или СтрЗСН.КоличествоЗСН < Стр.КоличествоУпаковок Тогда
			Ошибка = Новый_ОшибкаЗаполнения("КоличествоЗСН", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(НомерПартии) И Не ЗначениеЗаполнено(НомерСерии) Тогда
		
		ТекстОшибки = НСтр(
		"ru = 'Необходимо заполнить хотя бы одно поле: Номер партии, Номер серии или Заводской серийный номер в структуре кода маркировки'");
		
		Для Каждого Стр Из ОписаниеОперации.Товары Цикл
			
			Если ЗначениеЗаполнено(Стр.НомерПартии)
				Или ЗначениеЗаполнено(Стр.НомерСерии) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрЗСН = КоличествоЗСН.Найти(Стр.КлючСтрокиОперации, "КлючСтрокиОперации");
			Если СтрЗСН = Неопределено Или СтрЗСН.КоличествоЗСН < Стр.КоличествоУпаковок Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибки;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Операция_ПроверитьФорматНомераПартии(ОписаниеОперации, ОшибкиЗаполнения);
	Операция_ПроверитьФорматНомераСерии(ОписаниеОперации, ОшибкиЗаполнения);
	
КонецПроцедуры

Процедура Операция_ПроверитьНомерПартии(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	ПроверяемыйТипКода = ТипыКодовМаркировки.Набор;
	Если ЭтоОтчетОНанесении(ОписаниеОперации.ТипОперации) Тогда
		ПроверяемыйТипКода = ТипыКодовМаркировки.ЕдиницаТовара;
	КонецЕсли;
	
	Если ОписаниеОперации.ДопРеквизиты.РезервироватьПартии
		И Не ЗначениеЗаполнено(ОписаниеОперации.ДопРеквизиты.НомерПартии) Тогда
		Для каждого Стр Из ОписаниеОперации.Товары.НайтиСтроки(Новый Структура("НомерПартии", "")) Цикл
			Если Стр.Товар.ТипКодаМаркировки = ПроверяемыйТипКода Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить номер партии'");
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОписаниеОперации.ТипОперации = ТипыОпераций.КорректировкаСведенийОКодах Тогда
		Для каждого Стр Из ОписаниеОперации.Товары Цикл
			Если Стр.Товар.ТипКодаМаркировки <> ТипыКодовМаркировки.ЕдиницаТовара Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = НСтр("ru = 'Изменение номера партии доступно только для единиц товара'");
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьФорматНомераПартии(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ВидПродукцииПоддерживаетПартионныйУчет(ОписаниеОперации.ВидПродукции) Тогда
		Операция_ПроверитьФорматНомераПартии_ПартионныйУчет(ОписаниеОперации, ОшибкиЗаполнения);
	Иначе
		Операция_ПроверитьФорматНомераПартии_ВнеПартионногоУчета(ОписаниеОперации, ОшибкиЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьФорматНомераПартии_ВнеПартионногоУчета(ОписаниеОперации, ОшибкиЗаполнения)
	
	// Допустимые символы
	СпецСимволы = " .,-/";
	ДопустимыеСимволы = ВсеБуквыКириллицы() + ВсеБуквыЛатиницы() + ВсеЦифры() + СпецСимволы;
	ДопустимаяДлинаНомера = 30;
	
	НомерПартии = ОписаниеОперации.ДопРеквизиты.НомерПартии;
	ТекстОшибкиПревышениеДлины = НСтр("ru = 'Длина номера партии не должна превышать %1 символов'");
	ТекстОшибкиПревышениеДлины = ПараметрыВСтроку(ТекстОшибкиПревышениеДлины, ДопустимаяДлинаНомера);
	ТекстОшибкиНедопустимыеСимволы = НСтр("ru = 'Номер партии содержит недопустимые символы'");
	
	Если СтрДлина(НомерПартии) > ДопустимаяДлинаНомера Тогда
		Ошибка = Новый_ОшибкаЗаполнения("НомерПартии");
		Ошибка.ТекстОшибки = ТекстОшибкиПревышениеДлины;
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	Если Не СтрокаСодержитТолькоДопустимыеСимволы(НомерПартии, ДопустимыеСимволы) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("НомерПартии");
		Ошибка.ТекстОшибки = ТекстОшибкиНедопустимыеСимволы;
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		Если СтрДлина(Стр.НомерПартии) > ДопустимаяДлинаНомера Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибкиПревышениеДлины;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		Если Не СтрокаСодержитТолькоДопустимыеСимволы(Стр.НомерПартии, ДопустимыеСимволы) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибкиНедопустимыеСимволы;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура Операция_ПроверитьФорматНомераПартии_ПартионныйУчет(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	ПроверяемыйТипКода = ТипыКодовМаркировки.Набор;
	Если ЭтоОтчетОНанесении(ОписаниеОперации.ТипОперации) Тогда
		ПроверяемыйТипКода = ТипыКодовМаркировки.ЕдиницаТовара;
	КонецЕсли;
	
	ФорматПартии = ФорматНомераПартии();
	НомерПартииШапка = ОписаниеОперации.ДопРеквизиты.НомерПартии;
	СтруктураПартииШапка = СтруктураНомераПартии(НомерПартииШапка);
	ДатаПроизводстваШапка = ОписаниеОперации.ДопРеквизиты.ДатаПроизводства;
	
	ТекстОшибкиДлинаБольшеДопустимой = НСтр("ru = 'Длина номера партии не должна превышать %1 символов'");
	ТекстОшибкиДлинаБольшеДопустимой = ПараметрыВСтроку(ТекстОшибкиДлинаБольшеДопустимой, ФорматПартии.МаксимальнаяДлина);
	
	ТекстОшибкиДлинаМеньшеДопустимой = НСтр("ru = 'Длина номера партии не должна быть меньше %1 символов'");
	ТекстОшибкиДлинаМеньшеДопустимой = ПараметрыВСтроку(ТекстОшибкиДлинаМеньшеДопустимой, ФорматПартии.МинимальнаяДлина);
	
	ТекстОшибкиЕстьНедопустимыеСимволы = НСтр("ru = 'Номер партии содержит недопустимые символы'");
	
	ТекстОшибкиНекорректныйGTIN = НСтр("ru = 'В номере партии указан некорректный GTIN'");
	ТекстОшибкиНеСоответствуетGTIN = НСтр("ru = 'GTIN в номере партии не соответствует товару'");
	ТекстОшибкиНеСоответствуетGTINВПартииШапки = НСтр("ru = 'GTIN в номере партии в шапке не соответствует товару'");
	
	ТекстОшибкиНекорректнаяДатаПроизвод = НСтр("ru = 'В номере партии указана некорректная дата производства'");
	ТекстОшибкиДатаПроизводНеСоответствуетПартииШапки = НСтр("ru = 'Дата производства не соответствует дате производства в номере партии в шапке'");
	ТекстОшибкиДатаПроизводНеСоответствуетОтчету = НСтр("ru = 'Дата производства в номере партии на соответствует дате производства в отчете'");
	ТекстОшибкиДатаПроизводНеСоответствуетСтроке = НСтр("ru = 'Дата производства в номере партии на соответствует дате производства в строке отчета'");
	
	Если ЗначениеЗаполнено(НомерПартииШапка) Тогда
		
		Если СтруктураПартииШапка.ДлинаБольшеДопустимой Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии");
			Ошибка.ТекстОшибки = ТекстОшибкиДлинаБольшеДопустимой;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если СтруктураПартииШапка.ДлинаМеньшеДопустимой Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии");
			Ошибка.ТекстОшибки = ТекстОшибкиДлинаМеньшеДопустимой;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если СтруктураПартииШапка.ЕстьНедопустимыеСимволы Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии");
			Ошибка.ТекстОшибки = ТекстОшибкиЕстьНедопустимыеСимволы;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если СтруктураПартииШапка.НекорректнаяДатаПроизводства Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии");
			Ошибка.ТекстОшибки = ТекстОшибкиНекорректнаяДатаПроизвод;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаПроизводстваШапка)
			И ЗначениеЗаполнено(СтруктураПартииШапка.ДатаПроизводства)
			И СтруктураПартииШапка.ДатаПроизводства <> ДатаПроизводстваШапка Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерПартии");
			Ошибка.ТекстОшибки = ТекстОшибкиДатаПроизводНеСоответствуетОтчету;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если Стр.Товар.ТипКодаМаркировки <> ПроверяемыйТипКода Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.НомерПартии) Тогда
			
			СтруктураПартии = СтруктураНомераПартии(Стр.НомерПартии);
			
			Если СтруктураПартии.ДлинаБольшеДопустимой Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиДлинаБольшеДопустимой;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
			Если СтруктураПартии.ДлинаМеньшеДопустимой Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиДлинаМеньшеДопустимой;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
			Если СтруктураПартии.ЕстьНедопустимыеСимволы Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиЕстьНедопустимыеСимволы;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
			Если СтруктураПартии.НекорректнаяДатаПроизводства Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиНекорректнаяДатаПроизвод;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Стр.ДатаПроизводства)
				И ЗначениеЗаполнено(СтруктураПартии.ДатаПроизводства)
				И СтруктураПартии.ДатаПроизводства <> Стр.ДатаПроизводства Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиДатаПроизводНеСоответствуетСтроке;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.ДатаПроизводства)
				И ЗначениеЗаполнено(ДатаПроизводстваШапка)
				И ЗначениеЗаполнено(СтруктураПартии.ДатаПроизводства)
				И СтруктураПартии.ДатаПроизводства <> ДатаПроизводстваШапка Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиДатаПроизводНеСоответствуетОтчету;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
			Если СтруктураПартии.НекорректныйGTIN Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиНекорректныйGTIN;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Стр.Товар)
				И ЗначениеЗаполнено(СтруктураПартии.GTIN)
				И Стр.Товар.GTIN <> СтруктураПартии.GTIN Тогда
				Ошибка = Новый_ОшибкаЗаполнения("НомерПартии", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиНеСоответствуетGTIN;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(Стр.ДатаПроизводства)
				И ЗначениеЗаполнено(СтруктураПартииШапка.ДатаПроизводства)
				И Стр.ДатаПроизводства <> СтруктураПартииШапка.ДатаПроизводства Тогда
				Ошибка = Новый_ОшибкаЗаполнения("ДатаПроизводства", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиДатаПроизводНеСоответствуетПартииШапки;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Стр.Товар)
				И ЗначениеЗаполнено(СтруктураПартииШапка.GTIN)
				И Стр.Товар.GTIN <> СтруктураПартииШапка.GTIN Тогда
				Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиНеСоответствуетGTINВПартииШапки;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьФорматНомераСерии(ОписаниеОперации, ОшибкиЗаполнения)
	
	// Допустимые символы
	СпецСимволы = " .,-/";
	ДопустимыеСимволы = ВсеБуквыКириллицы() + ВсеБуквыЛатиницы() + ВсеЦифры() + СпецСимволы;
	ДопустимаяДлинаНомера = 30;
	
	НомерСерии = ОписаниеОперации.ДопРеквизиты.НомерСерии;
	ТекстОшибкиПревышениеДлины = НСтр("ru = 'Длина номера серии не должна превышать %1 символов'");
	ТекстОшибкиПревышениеДлины = ПараметрыВСтроку(ТекстОшибкиПревышениеДлины, ДопустимаяДлинаНомера);
	ТекстОшибкиНедопустимыеСимволы = НСтр("ru = 'Номер серии содержит недопустимые символы'");
	
	Если СтрДлина(НомерСерии) > ДопустимаяДлинаНомера Тогда
		Ошибка = Новый_ОшибкаЗаполнения("НомерСерии");
		Ошибка.ТекстОшибки = ТекстОшибкиПревышениеДлины;
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	Если Не СтрокаСодержитТолькоДопустимыеСимволы(НомерСерии, ДопустимыеСимволы) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("НомерСерии");
		Ошибка.ТекстОшибки = ТекстОшибкиНедопустимыеСимволы;
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		Если СтрДлина(Стр.НомерСерии) > ДопустимаяДлинаНомера Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерСерии", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибкиПревышениеДлины;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		Если Не СтрокаСодержитТолькоДопустимыеСимволы(Стр.НомерСерии, ДопустимыеСимволы) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерСерии", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибкиНедопустимыеСимволы;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьПричинуВозвратаВОборот(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ПричинаВозвратаВОборот = ОписаниеОперации.ДопРеквизиты.ПричинаВозвратаВОборот;
	
	Если Не ЗначениеЗаполнено(ПричинаВозвратаВОборот) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопустимыеПричиныВозвратаВОборот(ВидПродукции).Найти(ПричинаВозвратаВОборот) = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Недопустимая причина возврата в оборота ""%1"" для вида продукции ""%2""'");
		Ошибка = Новый_ОшибкаЗаполнения("ПричинаВозвратаВОборот");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ПричинаВозвратаВОборот, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьПричинуВозвратаВОборотДляВложенныхТоваровНаборов(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	ПричинаВозвратаВОборот = ОписаниеОперации.ДопРеквизиты.ПричинаВозвратаВОборот;
	
	Если Не ЗначениеЗаполнено(ПричинаВозвратаВОборот) Тогда
		Возврат;
	КонецЕсли;
	
	МодульМаркировки = МодульМаркировки();
	ТекстОшибки = НСтр("ru = 'Для набора или его вложений недоступна выбранная причина возврата в оборот.
							|Расформируйте набор и верните вложения в оборот по отдельности'");
	
	КэшТоваров = Новый Соответствие;
	Для Каждого СтрТовара Из ОписаниеОперации.Товары Цикл
		
		Если Не МодульМаркировки.ЭтоМультитоварныйНабор(СтрТовара.Товар, КэшТоваров) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ВидПродукции Из МодульМаркировки.Товар_ВидыПродукцииСоставаНабора(СтрТовара.Товар) Цикл
			
			Если ДопустимыеПричиныВозвратаВОборот(ВидПродукции).Найти(ПричинаВозвратаВОборот) = Неопределено Тогда
				Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", СтрТовара.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибки;
				ОшибкиЗаполнения.Добавить(Ошибка);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьРазрешительныйДокумент(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	ВидыСведений = Перечисление_ВидыКорректируемыхСведений();
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	Товары = ОписаниеОперации.Товары;
	ТипОперации = ОписаниеОперации.ТипОперации;
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	СпособВводаВОборот = ДопРеквизиты.СпособВводаВОборот;
	ВидКорректируемыхСведений = ДопРеквизиты.ВидКорректируемыхСведений;
	
	СпособВводаТребуетРД = СпособВводаВОборотТребуетРД(СпособВводаВОборот, ВидПродукции);
	ВидПродукцииТребуетРД = ВидПродукцииТребуетРазрешительныйДокумент(ВидПродукции);
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	
	Для Каждого Стр Из Товары Цикл
		
		Если ТипОперации = ТипыОпераций.ВводВОборот
			И СпособВводаВОборот <> Перечисление_СпособыВводаВОборот().ИмпортФТС Тогда
			
			ТребуетсяЗаполнитьРД = ВидПродукцииТребуетРД И СпособВводаТребуетРД
			И Не Товар_ОтсутствуютТребованияРД(Стр.Товар)
			И Не Товар_АвтоприкреплениеСведений(Стр.Товар)
			И Стр.Товар.ТипКодаМаркировки <> ТипыКодовМаркировки.ГрупповаяУпаковка;
			
		ИначеЕсли ТипОперации = ТипыОпераций.КорректировкаСведенийОКодах Тогда
			ТребуетсяЗаполнитьРД = (ВидКорректируемыхСведений = ВидыСведений.РазрешительныйДокумент);
		Иначе
			ТребуетсяЗаполнитьРД = Ложь;
		КонецЕсли;
		
		РазрешительныйДокумент = Стр.РазрешительныйДокумент;
		Если Не ЗначениеЗаполнено(РазрешительныйДокумент) Тогда
			Если ТребуетсяЗаполнитьРД Тогда
				Ошибка = Новый_ОшибкаЗаполнения();
				Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить разрешительный документ'");
				Ошибка.ИмяПоля = "РазрешительныйДокумент";
				Ошибка.ИмяТаблицы = "Товары";
				Ошибка.НомерСтроки = Стр.НомерСтроки;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
		Иначе
			
			Если Не ВидПродукцииДопускаетВидРазрешительногоДокумента(РазрешительныйДокумент.ВидДокумента, ВидПродукции) Тогда
				Ошибка = Новый_ОшибкаЗаполнения();
				Ошибка.ТекстОшибки = НСтр("ru = 'Указан некорректный вид разрешительного документа'");
				Ошибка.ИмяПоля = "РазрешительныйДокумент";
				Ошибка.ИмяТаблицы = "Товары";
				Ошибка.НомерСтроки = Стр.НомерСтроки;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
			Если НачалоДня(РазрешительныйДокумент.ДатаОформления) > ТекущаяДата Тогда
				Ошибка = Новый_ОшибкаЗаполнения();
				Ошибка.ТекстОшибки = НСтр("ru = 'Дата оформления разрешительного документа не может быть позже текущей даты'");
				Ошибка.ИмяПоля = "РазрешительныйДокумент";
				Ошибка.ИмяТаблицы = "Товары";
				Ошибка.НомерСтроки = Стр.НомерСтроки;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПервичногоДокументаДляВозвратаВОборот(ОписаниеОперации, ОшибкиЗаполнения)
	
	ПричинаВозвратаВОборот = ОписаниеОперации.ДопРеквизиты.ПричинаВозвратаВОборот;
	ВидПервичногоДокумента = ОписаниеОперации.ДопРеквизиты.ВидПервичногоДокумента;
	
	Если Не ЗначениеЗаполнено(ВидПервичногоДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопустимыеВидыПервичныхДокументовДляВозвратаВОборот(ПричинаВозвратаВОборот).Найти(ВидПервичногоДокумента) = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Недопустимый вид первичного документа ""%1""'");
		Ошибка = Новый_ОшибкаЗаполнения("ВидПервичногоДокумента");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, ВидПервичногоДокумента);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПродукцииВШапкеИВТоварах(ОписаниеОперации, ОшибкиЗаполнения)
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Стр.Товар.ВидПродукции <> ОписаниеОперации.ВидПродукции Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Вид продукции товара должен соответствовать значению, указанному в шапке'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьГруппуТНВЭДВШапкеИВТоварах(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если Не ЗначениеЗаполнено(ОписаниеОперации.ДопРеквизиты.ГруппаТНВЭД) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Стр.Товар.ВидПродукции <> ОписаниеОперации.ВидПродукции Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Группа ТН ВЭД товара должна соответствовать значению, указанному в шапке'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПродукцииДляФормированияАТК(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопустимыеВидыПродукцииДляФормированияАТК().Найти(ВидПродукции) = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Формирование АТК недоступно для вида продукции ""%1""'");
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьПричинуВыбытияКодов(ВидПродукции, ПричинаВыбытияКодов, ОшибкиЗаполнения)
	
	Если Не ЗначениеЗаполнено(ПричинаВыбытияКодов) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопустимыеПричиныВыбытияКодов(ВидПродукции).Найти(ПричинаВыбытияКодов) = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Причина выбытия кодов ""%1"" недоступна для вида продукции ""%2""'");
		Ошибка = Новый_ОшибкаЗаполнения("ПричинаВыбытияКодов");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, ПричинаВыбытияКодов, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьПричинуВыбытияВложенныхТоваровНаборов(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	ПричинаВыбытияКодов = ОписаниеОперации.ДопРеквизиты.ПричинаВыбытияКодов;
	
	Если Не ЗначениеЗаполнено(ПричинаВыбытияКодов) Тогда
		Возврат;
	КонецЕсли;
	
	МодульМаркировки = МодульМаркировки();
	ТекстОшибки = НСтр("ru = 'Для набора или его вложений недоступна выбранная причина списания.
	|Расформируйте набор и спишите вложения по отдельности'");
	
	КэшТоваров = Новый Соответствие;
	Для Каждого СтрТовара Из ОписаниеОперации.Товары Цикл
		
		Если Не МодульМаркировки.ЭтоМультитоварныйНабор(СтрТовара.Товар, КэшТоваров) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ВидПродукции Из МодульМаркировки.Товар_ВидыПродукцииСоставаНабора(СтрТовара.Товар) Цикл
			
			Если ДопустимыеПричиныВыбытияКодов(ВидПродукции).Найти(ПричинаВыбытияКодов) = Неопределено Тогда
				Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", СтрТовара.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибки;
				ОшибкиЗаполнения.Добавить(Ошибка);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПродукцииДляВыбытияКодов(ВидПродукции, ОшибкиЗаполнения)
	
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопустимыеВидыПродукцииДляВыбытияКодов().Найти(ВидПродукции) = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Выбытие кодов недоступно для вида продукции ""%1""'");
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПродукцииДляРегистрацииКИГУ(ВидПродукции, ОшибкиЗаполнения)
	
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ПодходящиеВидыПродукции = ДопустимыеВидыПродукцииДляРегистрацииКИГУ();
	
	Если Не МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции) Тогда
		ТекстСообщения = НСтр("ru = 'Регистрация КИГУ недоступна для вида продукции ""%1""'");
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьКодыДляНаполненияКИГУ(ОписаниеОперации, ОшибкиЗаполнения)
	
	МодульМаркировки = МодульМаркировки();
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		ТаблицаКодов = МодульМаркировки.КодыОпераций_Прочитать(ОписаниеОперации.Ссылка, Стр.КлючСтрокиОперации);
		МодульМаркировки.ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
		
		Отбор = Новый Структура("ОбщийТипУпаковки", Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ЕдиницаТовара);
		СтрокиВложенныхТоваров = ТаблицаКодов.НайтиСтроки(Отбор);
		
		КоличествоКодовВложенногоТовара = СтрокиВложенныхТоваров.Количество();
		
		Если КоличествоКодовВложенногоТовара = 0 Тогда
			Ошибка = Новый_ОшибкаЗаполнения("КоличествоКодовВложенногоТовара", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо подобрать коды вложенного товара для наполнения КИГУ'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		Иначе
			
			КоличествоВложений = Стр.КоличествоУпаковок * Стр.Товар.КоличествоВложений;
			Если КоличествоКодовВложенногоТовара < КоличествоВложений Тогда
				Ошибка = Новый_ОшибкаЗаполнения("КоличествоКодовВложенногоТовара", "Товары", Стр.НомерСтроки);
				Ошибка.ТекстОшибки = НСтр("ru = 'Недостаточно кодов вложенного товара для наполнения КИГУ'");
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьНаличиеАгрегатов(ОписаниеОперации, ОшибкиЗаполнения)
	
	СтатусыОпераций = Перечисление_СтатусыОпераций();
	ОсновнойСтатус = ОписаниеОперации.Статусы.ОсновнойСтатус;
	
	Если ОсновнойСтатус <> СтатусыОпераций.СозданыАгрегаты
		И Не МодульМаркировки().КодыОпераций_ЕстьКоды(ОписаниеОперации.Ссылка) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("Агрегаты");
		Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо добавить агрегаты'");
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПродукцииДляСообщенияОбОтгрузке(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если Не ЗначениеЗаполнено(ОписаниеОперации.ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ТипОтгрузки = ОписаниеОперации.ДопРеквизиты.ТипОтгрузки;
	ОбъемноСортовойУчет = ОписаниеОперации.ДопРеквизиты.ОбъемноСортовойУчет;
	ДопустимыеВиды = ДопустимыеВидыПродукцииДляСообщенияОбОтгрузке(ТипОтгрузки, ОбъемноСортовойУчет);
	
	Если ДопустимыеВиды.Найти(ВидПродукции) = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Сообщение об отгрузке недоступно для вида продукции ""%1""'");
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьСтрануПолучателяДляСообщенияОбОтгрузке(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	КодСтраныПолучателя = ОписаниеОперации.ДопРеквизиты.КодСтраныПолучателя;
	
	Если Не ЗначениеЗаполнено(КодСтраныПолучателя) Тогда
		Возврат;
	КонецЕсли;
	
	ДопустимыеСтраны = ДопустимыеСтраныДляСообщенияОбОтгрузке(ВидПродукции);
	
	Если ДопустимыеСтраны.НайтиПоЗначению(КодСтраныПолучателя) = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Сообщение об отгрузке с видом продукции ""%1"" недоступно для страны ""%2""'");
		Ошибка = Новый_ОшибкаЗаполнения("КодСтраныПолучателя");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ВидПродукции, НаименованиеСтраны(КодСтраныПолучателя));
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьGLNПолучателя(ОписаниеОперации, ОшибкиЗаполнения)
	
	GLNПолучателя = ОписаниеОперации.ДопРеквизиты.GLNПолучателя;
	Если Не ЗначениеЗаполнено(GLNПолучателя) Тогда
		Возврат;
	КонецЕсли;
	
	ОжидаемаяДлинаGLNПолучателя = 13;
	
	Если СтрДлина(GLNПолучателя) < ОжидаемаяДлинаGLNПолучателя Тогда
		ТекстОшибки = НСтр("ru = 'GLN получателя ""%1"" должен содержать 13 символов'");
		Ошибка = Новый_ОшибкаЗаполнения("GLNПолучателя");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, GLNПолучателя);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	Если Не ВСтрокеТолькоЦифры(GLNПолучателя) Тогда
		ТекстОшибки = НСтр("ru = 'GLN получателя ""%1"" должен содержать только цифры'");
		Ошибка = Новый_ОшибкаЗаполнения("GLNПолучателя");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, GLNПолучателя);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПродукцииДляОперацийАгрегации(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ТипОперации = ОписаниеОперации.ТипОперации;
	
	Если Не ЗначениеЗаполнено(ВидПродукции)
		Или Не ЭтоОперацияАгрегации(ТипОперации) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопустимыеВидыПродукцииДляОперацийАгрегации().Найти(ВидПродукции) = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Вид продукции ""%1"" недоступен для операции ""%2""'");
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ВидПродукции, ТипОперации);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьТоварыПодлежатВетеринарномуКонтролю(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТекстОшибки = НСтр("ru = 'Изменение ВСД доступно только для товара, подлежащего ветеринарному контролю'");
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Не Стр.Товар.ПодлежитВетеринарномуКонтролю Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьФорматИдентификатораВСД(ОписаниеОперации, ОшибкиЗаполнения)
	
	ИдентификаторВСД = ОписаниеОперации.ДопРеквизиты.ИдентификаторВСД;
	ТекстОшибки = НСтр("ru = 'Идентификатор ВСД имеет некорректный формат'");
	
	Если ЗначениеЗаполнено(ИдентификаторВСД)
		И Не ИдентификаторВСДСоответствуетФормату(ИдентификаторВСД) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("ИдентификаторВСД");
		Ошибка.ТекстОшибки = ТекстОшибки;
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		Если ЗначениеЗаполнено(Стр.ИдентификаторВСД)
			И Не ИдентификаторВСДСоответствуетФормату(Стр.ИдентификаторВСД) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("ИдентификаторВСД", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТоварыИмеютПеременныйВес(ОписаниеОперации, ОшибкиЗаполнения)
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Не Стр.Товар.ПеременныйВес Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Изменение фактического веса доступно только для товара с переменным весом'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТоварыИмеютУсловияХранения(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТекстОшибки = НСтр("ru = 'Изменение вариантов срока годности доступно только для товара с условиями хранения'");
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Не ЗначениеЗаполнено(Стр.АльтернативныеСрокиГодности) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура Операция_ПроверитьТоварыТипСрокаГодности(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыСроковГодности = Перечисление_ТипыСроковГодности();
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Стр.Товар.ТипСрокаГодности = ТипыСроковГодности.СрокГодностиБольше72СУсловием Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Изменение срока годности доступно только для товара без условий хранения'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура Операция_ПроверитьДлинуКодаТНВЭД(ОписаниеОперации, ОшибкиЗаполнения)
	
	МинимальнаяДлинаКодаТНВЭД = 10;
	
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		Если ЗначениеЗаполнено(Стр.КодТНВЭД) И СтрДлина(Стр.КодТНВЭД) < МинимальнаяДлинаКодаТНВЭД Тогда
			Ошибка = Новый_ОшибкаЗаполнения("КодТНВЭД", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Код ТНВЭД имеет некорректный формат'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТипЭмиссииКодовМаркировкиТНВЭД(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТекстОшибки = НСтр("ru = 'Некорректный способ выпуска товаров."
	+ " ""ТН ВЭД"" невозможно изменить у КИ со способом выпуска ""Импорт в РФ""'");
	ИмпортВРФ = Перечисление_СпособыВыпускаТоваров().Импорт;
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если МодульМаркировки().КодыОпераций_ЕстьКодыСоСпособамиВыпуска(ОписаниеОперации.Ссылка, ИмпортВРФ, Стр.КлючСтрокиОперации) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = ТекстОшибки;
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьЛицензиюНаНедра(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ОписаниеОперации.ДопРеквизиты.СпособВводаВОборот <> Перечисление_СпособыВводаВОборот().ПроизводствоРФ
		И ОписаниеОперации.ТипОперации <> Перечисление_ТипыОпераций().КорректировкаСведенийОКодах Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если Не ТоварТребуетЛицензиюНаНедра(Стр.Товар) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.НомерЛицензииНаНедра) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомерЛицензииНаНедра", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Номер лицензии на пользование недрами должен быть заполнен'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.ДатаЛицензииНаНедра) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("ДатаЛицензииНаНедра", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Дата лицензии на пользование недрами должна быть заполнена'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.НомераСкважин)
			И ФичаФлагВключен(Перечисление_ФичаФлаги().КонтрольНомераСкважин) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("НомераСкважин", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Номера скважин должны быть заполнены'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьТипыУпаковокКодовДляВидаКорректируемыхСведений(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидКорректируемыхСведений = ОписаниеОперации.ДопРеквизиты.ВидКорректируемыхСведений;
	Если Не ЗначениеЗаполнено(ВидКорректируемыхСведений) Тогда
		Возврат;
	КонецЕсли;
	
	МодульМаркировки = МодульМаркировки();
	ПодходящиеТипыУпаковок = МодульМаркировки.Операция_КорректировкаСведенийОКодах_ПодходящиеТипыУпаковок(ВидКорректируемыхСведений);
	
	Если МодульМаркировки.КодыОпераций_ЕстьДругиеОбщиеТипыУпаковок(ОписаниеОперации.Ссылка, ПодходящиеТипыУпаковок) Тогда
		ТекстОшибки = НСтр("ru = 'Корректировка вида сведений ""%1"" допустима только для кодов с типом упаковки %2'");
		ТипыУпаковокСтрокой = СоединитьСтроку(ПодходящиеТипыУпаковок, ", ");
		Ошибка = Новый_ОшибкаЗаполнения("КодыМаркировки");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ВидКорректируемыхСведений, ТипыУпаковокСтрокой);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьСпособВводаВОборот(СпособВводаВОборот, ВидПродукции, ОшибкиЗаполнения)
	
	Если Не ЗначениеЗаполнено(ВидПродукции)
		Или Не ЗначениеЗаполнено(СпособВводаВОборот) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопустимыеСпособыВводаВОборот(ВидПродукции).Найти(СпособВводаВОборот) = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Способ ввода в оборот ""%1"" недоступен для вида продукции ""%2""'");
		Ошибка = Новый_ОшибкаЗаполнения("СпособВводаВОборот");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, СпособВводаВОборот, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПродукцииДляВводаВОборот(ВидПродукции, ОшибкиЗаполнения)
	
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопустимыеВидыПродукцииДляВводаВОборот().Найти(ВидПродукции) = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Ввод в оборот недоступен для вида продукции ""%1""'");
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьЗаполнениеИдентификатораВСД(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если ЗначениеЗаполнено(ОписаниеОперации.ДопРеквизиты.ИдентификаторВСД) Тогда
		
		Если МодульМаркировки().КодыОпераций_ЕстьАгрегаты(ОписаниеОперации.Ссылка) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("ИдентификаторВСД");
			Ошибка.ТекстОшибки = НСтр("ru = 'Идентификатор ВСД для агрегатов можно заполнить только в товарах'");
			ОшибкиЗаполнения.Добавить(Ошибка);
			Возврат;
		КонецЕсли;
		
		Если Операция_ТоварыСодержатИдентификаторВСД(ОписаниеОперации) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("ИдентификаторВСД");
			Ошибка.ТекстОшибки = НСтр("ru = 'Идентификатор ВСД нужно заполнить либо в шапке, либо в товарах'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Операция = ОписаниеОперации.Ссылка;
	ТребуетсяВСД = ВидПродукцииТребуетВСД(ОписаниеОперации.ВидПродукции);
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если ЗначениеЗаполнено(Стр.ИдентификаторВСД) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.Товар) И Стр.Товар.ПодлежитВетеринарномуКонтролю И ТребуетсяВСД Тогда
			ОшибкаПустойВСД = Истина;
		ИначеЕсли КодыОпераций_ЕстьМультитоварныеАгрегаты(Операция, Стр.КлючСтрокиОперации) Тогда
			ОшибкаПустойВСД = Операция_ТоварыВАгрегатахТребуютВСД(Операция, Стр.КлючСтрокиОперации);
		Иначе
			ОшибкаПустойВСД = Ложь;
		КонецЕсли;
		
		Если ОшибкаПустойВСД Тогда
			Ошибка = Новый_ОшибкаЗаполнения("ИдентификаторВСД", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить Идентификатор ВСД'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьНомерТаможеннойДекларации(ОписаниеОперации, ОшибкиЗаполнения)
	
	НомерДекларации = ОписаниеОперации.ДопРеквизиты.НомерДекларации;
	Если Не ЗначениеЗаполнено(НомерДекларации) Тогда
		Возврат;
	КонецЕсли;
	
	ДекларацияСоответствуетФормату = Истина;
	
	СтруктураДекларации = СтруктураТаможеннойДекларации(НомерДекларации);
	Если СтрДлина(СтруктураДекларации.КодТаможни) <> 8 Тогда
		ДекларацияСоответствуетФормату = Ложь;
	КонецЕсли;
	Если СтрДлина(СтруктураДекларации.ПорядковыйНомер) <> 7 Тогда
		ДекларацияСоответствуетФормату = Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтруктураДекларации.ДатаДекларации)
		Или СтруктураДекларации.ДатаДекларации > ТекущаяДата() Тогда
		ДекларацияСоответствуетФормату = Ложь;
	КонецЕсли;
	
	Если Не ДекларацияСоответствуетФормату Тогда
		Ошибка = Новый_ОшибкаЗаполнения("НомерДекларации");
		Ошибка.ТекстОшибки = НСтр("ru = 'Номер декларации имеет некорректный формат'");
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьПлощадкаКПП(ОписаниеОперации, ОшибкиЗаполнения)
	
	Площадка = ОписаниеОперации.ДопРеквизиты.Площадка;
	
	Если ЗначениеЗаполнено(Площадка)
		И Не ЗначениеЗаполнено(Площадка.КПП) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("Площадка");
		Ошибка.ТекстОшибки = НСтр("ru = 'В указанной площадке не заполнен КПП'");
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьПлощадкаФИАС(ОписаниеОперации, ОшибкиЗаполнения)
	
	Площадка = ОписаниеОперации.ДопРеквизиты.Площадка;
	
	Если ЗначениеЗаполнено(Площадка)
		И Не ЗначениеЗаполнено(Площадка.ИдентификаторФИАС) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("Площадка");
		Ошибка.ТекстОшибки = НСтр("ru = 'В указанной площадке не заполнен идентификатор ФИАС'");
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьСуммуНДС(ОписаниеОперации, ОшибкиЗаполнения)
	
	НеОблагаетсяНДС = ОписаниеОперации.ДопРеквизиты.НеОблагаетсяНДС;
	ТребуетсяСуммаНДС = ВидПродукцииТребуетСуммуНДСПриВводеВОборот(ОписаниеОперации.ВидПродукции);
	
	Для Каждого Стр Из ОписаниеОперации.Товары Цикл
		
		Если ЗначениеЗаполнено(Стр.СуммаНДС) И Стр.СуммаНДС >= Стр.Цена Тогда
			Ошибка = Новый_ОшибкаЗаполнения("СуммаНДС", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Сумма НДС должна быть меньше цены'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если ТребуетсяСуммаНДС И НеОблагаетсяНДС = Ложь И Не ЗначениеЗаполнено(Стр.СуммаНДС) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("СуммаНДС", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить сумму НДС'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьИННСобственникаТоваров(ОписаниеОперации, ОшибкиЗаполнения)
	
	ПроизводительИНН = ОписаниеОперации.ДопРеквизиты.ПроизводительИНН;
	СобственникТовараИНН = ОписаниеОперации.ДопРеквизиты.СобственникТовараИНН;
	
	Если Не ЗначениеЗаполнено(СобственникТовараИНН) Тогда
		Возврат;
	КонецЕсли;
	
	Если СобственникТовараИНН = ПроизводительИНН Тогда
		Ошибка = Новый_ОшибкаЗаполнения("СобственникТовараИНН");
		Ошибка.ТекстОшибки = НСтр("ru = 'Собственник товара (ИНН) и Производитель (ИНН) не могут быть одинаковыми'");
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		Если ЗначениеЗаполнено(Стр.Товар.ВладелецКарточкиТовара)
			И Стр.Товар.ВладелецКарточкиТовара.ИНН <> СобственникТовараИНН Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Собственник товара (ИНН) отличается от указанного в шапке'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьДатуИмпорта(ОписаниеОперации, ОшибкиЗаполнения)
	
	МинимальноеКоличествоМесяцев = 60;
	МаксимальноеКоличествоМесяцев = 12;
	
	МинимальнаяДатаИмпорта = ДобавитьМесяц(ТекущаяДата(), -МинимальноеКоличествоМесяцев);
	МаксимальнаяДатаИмпорта = ДобавитьМесяц(ТекущаяДата(), МаксимальноеКоличествоМесяцев);
	ДатаИмпорта = ОписаниеОперации.ДопРеквизиты.ДатаИмпорта;
	
	Если ДатаИмпорта < МинимальнаяДатаИмпорта Или ДатаИмпорта > МаксимальнаяДатаИмпорта Тогда
		Ошибка = Новый_ОшибкаЗаполнения("ДатаИмпорта");
		Ошибка.ТекстОшибки = НСтр("ru = 'Указана некорректная дата импорта'");
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПервичногоДокументаДляВыводаИзОборота(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПервичногоДокумента = ОписаниеОперации.ДопРеквизиты.ВидПервичногоДокумента;
	ПричинаВыводаИзОборота = ОписаниеОперации.ДопРеквизиты.ПричинаВыводаИзОборота;
	
	Если Не ЗначениеЗаполнено(ВидПервичногоДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопустимыеВидыПервичногоДокумента(ПричинаВыводаИзОборота).Найти(ВидПервичногоДокумента) = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Вид первичного документа ""%1"" недоступен для причины вывода из оборота ""%2""'");
		Ошибка = Новый_ОшибкаЗаполнения("СпособВыпускаТоваров");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, ВидПервичногоДокумента, ПричинаВыводаИзОборота);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьВидПродукцииДляВыводаИзОборота(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ОбъемноСортовойУчет = ОписаниеОперации.ДопРеквизиты.ОбъемноСортовойУчет;
	
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопустимыеВидыПродукцииДляВыводаИзОборота(ОбъемноСортовойУчет).Найти(ВидПродукции) = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Вывод из оборота недоступен для вида продукции ""%1""'");
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьПричинуВыводаИзОборота(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ОбъемноСортовойУчет = ОписаниеОперации.ДопРеквизиты.ОбъемноСортовойУчет;
	ПричинаВыводаИзОборота = ОписаниеОперации.ДопРеквизиты.ПричинаВыводаИзОборота;
	
	Если Не ЗначениеЗаполнено(ПричинаВыводаИзОборота) Тогда
		Возврат;
	КонецЕсли;
	
	ДопустимыеПричины = ДопустимыеПричиныВыводаИзОборота(ВидПродукции, ОбъемноСортовойУчет);
	
	Если ДопустимыеПричины.Найти(ПричинаВыводаИзОборота) = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Недопустимая причина вывода из оборота ""%1""'");
		Ошибка = Новый_ОшибкаЗаполнения("ПричинаВыводаИзОборота");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ПричинаВыводаИзОборота);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьПричинуВыводаИзОборотаВложенныхТоваровНаборов(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	ПричинаВыводаИзОборота = ОписаниеОперации.ДопРеквизиты.ПричинаВыводаИзОборота;
	
	Если Не ЗначениеЗаполнено(ПричинаВыводаИзОборота) Тогда
		Возврат;
	КонецЕсли;
	
	МодульМаркировки = МодульМаркировки();
	ОбъемноСортовойУчет = ОписаниеОперации.ДопРеквизиты.ОбъемноСортовойУчет;
	
	ТекстОшибкиОСУ = НСтр("ru = 'Для набора или его вложений недоступен вывод из оборота по ОСУ.
							|Расформируйте набор и выведите вложения из оборота по отдельности'");
	ТекстОшибкиПричина = НСтр("ru = 'Для набора или его вложений недоступна выбранная причина вывода из оборота.
								|Расформируйте набор и выведите вложения из оборота по отдельности'");
	
	КэшТоваров = Новый Соответствие;
	Для Каждого СтрТовара Из ОписаниеОперации.Товары Цикл
		
		Если Не МодульМаркировки.ЭтоМультитоварныйНабор(СтрТовара.Товар, КэшТоваров) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ВидПродукции Из МодульМаркировки.Товар_ВидыПродукцииСоставаНабора(СтрТовара.Товар) Цикл
			
			ДопустимыеПричины = ДопустимыеПричиныВыводаИзОборота(ВидПродукции, ОбъемноСортовойУчет);
			Если ДопустимыеПричины.Найти(ПричинаВыводаИзОборота) = Неопределено Тогда
				Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", СтрТовара.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиПричина;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
			Если ОбъемноСортовойУчет
				И ДопустимыеВидыПродукцииДляВыводаИзОборота(ОбъемноСортовойУчет).Найти(ВидПродукции) = Неопределено Тогда
				Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", СтрТовара.НомерСтроки);
				Ошибка.ТекстОшибки = ТекстОшибкиОСУ;
				ОшибкиЗаполнения.Добавить(Ошибка);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьСтрануПолучателяДляВыводаИзОборота(ОписаниеОперации, ОшибкиЗаполнения)
	
	КодСтраныПолучателя = ОписаниеОперации.ДопРеквизиты.КодСтраныПолучателя;
	
	Если Не ЗначениеЗаполнено(КодСтраныПолучателя) Тогда
		Возврат;
	КонецЕсли;
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	ПричинаВыводаИзОборота = ОписаниеОперации.ДопРеквизиты.ПричинаВыводаИзОборота;
	ДопустимыеСтраны = ДопустимыеСтраныДляВыводаИзОборота(ВидПродукции, ПричинаВыводаИзОборота);
	
	Если ДопустимыеСтраны.НайтиПоЗначению(КодСтраныПолучателя) = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Вывод из оборота по причине ""%1"" недоступен для страны ""%2""'");
		Ошибка = Новый_ОшибкаЗаполнения("КодСтраныПолучателя");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, ПричинаВыводаИзОборота, НаименованиеСтраны(КодСтраныПолучателя));
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьВесДляВыводаИзОборота(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если Не ОписаниеОперации.ДопРеквизиты.ОбъемноСортовойУчет
		Или ОписаниеОперации.ВидПродукции <> Перечисление_ВидыПродукции().Молоко Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ФичаФлагВключен(Перечисление_ФичаФлаги().КонтрольВесВыводИзОборотаМолокоОСУ) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Стр Из ОписаниеОперации.Товары Цикл
		Если Не ЗначениеЗаполнено(Стр.Количество) И Стр.Товар.ПеременныйВес Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Количество", "Товары", Стр.НомерСтроки);
			Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить вес товара'");
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьИдентификаторГосКонтракта(ОписаниеОперации, ОшибкиЗаполнения)
	
	ИдентификаторГосКонтракта = ОписаниеОперации.ДопРеквизиты.ИдентификаторГосКонтракта;
	Если Не ЗначениеЗаполнено(ИдентификаторГосКонтракта) Тогда
		Возврат;
	КонецЕсли;
	
	СоответствуетФормату = Истина;
	
	ДопустимаяДлинаИдентификатора = 255;
	Если СтрДлина(ИдентификаторГосКонтракта) > ДопустимаяДлинаИдентификатора Тогда
		СоответствуетФормату = Ложь;
	КонецЕсли;
	ДопустимыеСимволы = ВсеБуквыКириллицы() + ВсеБуквыЛатиницы() + ВсеЦифры() + ВсеСпецСимволы();
	Если Не СтрокаСодержитТолькоДопустимыеСимволы(ИдентификаторГосКонтракта, ДопустимыеСимволы) Тогда
		СоответствуетФормату = Ложь;
	КонецЕсли;
	
	Если Не СоответствуетФормату Тогда
		Ошибка = Новый_ОшибкаЗаполнения("ИдентификаторГосКонтракта");
		Ошибка.ТекстОшибки = НСтр("ru = 'Идентификатор гос. контракта имеет некорректный формат'");
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьИдентификаторГосКонтрактаГосТайна(ОписаниеОперации, ОшибкиЗаполнения)
	
	ИдентификаторГосКонтракта = ОписаниеОперации.ДопРеквизиты.ИдентификаторГосКонтракта;
	Если Не ЗначениеЗаполнено(ИдентификаторГосКонтракта) Тогда
		Возврат;
	КонецЕсли;
	
	СоответствуетФормату = Истина;
	
	ДопустимаяДлинаИдентификатора = 25;
	Если СтрДлина(ИдентификаторГосКонтракта) > ДопустимаяДлинаИдентификатора Тогда
		СоответствуетФормату = Ложь;
	КонецЕсли;
	
	ДопустимыеСимволы = "123";
	ПозицияПроверяемогоСимвола = 13;
	ПроверяемыйСимвол = Сред(ИдентификаторГосКонтракта, ПозицияПроверяемогоСимвола, 1);
	
	Если Не СтрокаСодержитТолькоДопустимыеСимволы(ПроверяемыйСимвол, ДопустимыеСимволы)
		Или Не СтрокаСодержитТолькоДопустимыеСимволы(ИдентификаторГосКонтракта, ВсеЦифры()) Тогда
		СоответствуетФормату = Ложь;
	КонецЕсли;
	
	Если Не СоответствуетФормату Тогда
		Ошибка = Новый_ОшибкаЗаполнения("ИдентификаторГосКонтракта");
		Ошибка.ТекстОшибки =  НСтр("ru = 'Идентификатор гос. контракта имеет некорректный формат'");
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьНаличиеКодовМаркировки(ОписаниеОперации, ОшибкиЗаполнения)
	
	Если Не МодульМаркировки().КодыОпераций_ЕстьКоды(ОписаниеОперации.Ссылка) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("КодыМаркировки");
		Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо заполнить операцию кодами'");
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Функция Операция_ТоварыСодержатИдентификаторВСД(ОписаниеОперации)
	
	Отбор = Новый Структура("ИдентификаторВСД", "");
	Возврат (ОписаниеОперации.Товары.Количество() > ОписаниеОперации.Товары.НайтиСтроки(Отбор).Количество());
	
КонецФункции

Функция Операция_ЕстьТоварыБезGTIN(Товары)
	
	Для Каждого Стр Из Товары Цикл
		Если Не ЗначениеЗаполнено(Стр.Товар) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция Операция_ЕстьЕдиницыТоваров(Товары)
	
	ТипыКодовМаркировки = Перечисление_ТипыКодовМаркировки();
	
	Для Каждого Стр Из Товары Цикл
		Если Стр.Товар.ТипКодаМаркировки = ТипыКодовМаркировки.ЕдиницаТовара Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция Операция_ТоварыВАгрегатахТребуютВСД(Операция, КлючСтрокиОперации) Экспорт
	
	МодульМаркировки = МодульМаркировки();
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	МодульМаркировки.КодыОпераций_ВТ_Прочитать(Операция, МенеджерВТ, КлючСтрокиОперации);
	МодульМаркировки.ТаблицаКодов_ВТ_ЗаменитьТранспортныеУпаковкиНаВложенныеКоды(МенеджерВТ);
	МодульМаркировки.ТаблицаКодов_ВТ_ЗаменитьАТКНаВложенныеКоды(МенеджерВТ);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИнформацияОКодах.Товар КАК Товар
	|ИЗ
	|	ТаблицаКодов КАК ТаблицаКодов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_КодыМаркировки КАК КодыМаркировки
	|		ПО ТаблицаКодов.КлючКода = КодыМаркировки.КлючКода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ИнформацияОКодах КАК ИнформацияОКодах
	|		ПО (КодыМаркировки.КлючИнформацииОКоде = ИнформацияОКодах.КлючИнформацииОКоде)
	|ГДЕ
	|	ИнформацияОКодах.Товар.ПодлежитВетеринарномуКонтролю
	|	И ИнформацияОКодах.Товар.ВидПродукции В(&ДопустимыеВидыПродукции)");
	Запрос.УстановитьПараметр("ДопустимыеВидыПродукции", ДопустимыеВидыПродукцииДляКонтроляВСД());
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция КодыОпераций_ЕстьМультитоварныеАгрегаты(Операция, КлючСтрокиОперации = Неопределено) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьМультитоварныеАгрегаты
	|ИЗ
	|	РегистрСведений.КонтурМаркировка_КоличествоКодовОпераций КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ИнформацияОКодах КАК ИнформацияОКодах
	|		ПО Т.КлючИнформацииОКоде = ИнформацияОКодах.КлючИнформацииОКоде
	|ГДЕ
	|	&КлючСтрокиОперации
	|	И Т.Операция = &Операция
	|	И ИнформацияОКодах.ТипУпаковки = &Мультитоварная
	|	И ИнформацияОКодах.ОбщийТипУпаковки = &ТранспортнаяУпаковка";
	
	Если КлючСтрокиОперации = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КлючСтрокиОперации", "ИСТИНА");
	Иначе
		ТекстУсловия = "Т.КлючСтрокиОперации = &КлючСтрокиОперации";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КлючСтрокиОперации", ТекстУсловия);
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("КлючСтрокиОперации", КлючСтрокиОперации);
	Запрос.УстановитьПараметр("Мультитоварная", Перечисления.КонтурМаркировка_ТипыУпаковок.МультитоварнаяУпаковка);
	Запрос.УстановитьПараметр("ТранспортнаяУпаковка", Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ТранспортнаяУпаковка);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура Операция_ПроверитьВидПродукцииДляРегистрацииНаборов(ОписаниеОперации, ОшибкиЗаполнения)
	
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ТипНабора = ОписаниеОперации.ДопРеквизиты.ТипНабора;
	ДопустимыеВидыПродукции = ДопустимыеВидыПродукцииДляРегистрацииНаборов(ТипНабора);
	
	Если ТипНабора = Перечисление_ТипыНаборов().Мультитоварный Тогда
		ТекстСообщения = НСтр("ru = 'Регистрация мультитоварных наборов недоступна для вида продукции ""%1""'");
	Иначе
		ТекстСообщения = НСтр("ru = 'Регистрация наборов недоступна для вида продукции ""%1""'");
	КонецЕсли;
	
	Если Не МассивСодержитЗначение(ДопустимыеВидыПродукции, ВидПродукции) Тогда
		Ошибка = Новый_ОшибкаЗаполнения("ВидПродукции");
		Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстСообщения, ВидПродукции);
		ОшибкиЗаполнения.Добавить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Операция_ПроверитьКоличествоВложенийДляРегистрацииНаборов(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТекстОшибки = НСтр("ru = 'Количество кодов не соответствует составу набора:
	|%1'");
	
	КэшТоваров = Новый Соответствие;
	МодульМаркировки = МодульМаркировки();
	
	Для Каждого СтрТовара Из ОписаниеОперации.Товары Цикл
		
		ТаблицаКодов = МодульМаркировки.КодыОпераций_Прочитать(ОписаниеОперации.Ссылка, СтрТовара.КлючСтрокиОперации);
		МодульМаркировки.ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
		
		ТаблицаНаборов = ТаблицаКодов.Скопировать(, "КлючКода, КодМаркировки");
		
		МодульМаркировки.ТаблицаКодов_ДобавитьКлючиВложенныхКодов(ТаблицаКодов);
		МодульМаркировки.ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
		
		Товар = Товар_Прочитать(СтрТовара.Товар, КэшТоваров);
		КоличествоВложений = 0;
		Для Каждого СоставНабора Из Товар.СоставНабора Цикл
			КоличествоВложений = КоличествоВложений + СоставНабора.КоличествоВложений;
		КонецЦикла;
		
		ТаблицаКодов.Индексы.Добавить("КлючАгрегата");
		
		КодыСОшибками = Новый Массив;
		Для Каждого СтрНабора Из ТаблицаНаборов Цикл
			ВложенныеКоды = ТаблицаКодов.НайтиСтроки(Новый Структура("КлючАгрегата", СтрНабора.КлючКода));
			Если ВложенныеКоды.Количество() <> КоличествоВложений Тогда
				КодыСОшибками.Добавить(СтрНабора.КодМаркировки);
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(КодыСОшибками) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", СтрТовара.НомерСтроки);
			Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, СписокКодовДляТекстаОшибки(КодыСОшибками));
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура Операция_ПроверитьКоличествоВложенийДляРегистрацииВариативныхНаборов(ОписаниеОперации, ОшибкиЗаполнения)
	
	ТекстОшибки = НСтр("ru = 'Недостаточные вложения набора:
	|%1'");
	
	КэшТоваров = Новый Соответствие;
	МодульМаркировки = МодульМаркировки();
	
	Для Каждого СтрТовара Из ОписаниеОперации.Товары Цикл
		
		ТаблицаКодов = МодульМаркировки.КодыОпераций_Прочитать(ОписаниеОперации.Ссылка, СтрТовара.КлючСтрокиОперации);
		МодульМаркировки.ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
		
		ТаблицаНаборов = ТаблицаКодов.Скопировать(, "КлючКода, КодМаркировки");
		
		МодульМаркировки.ТаблицаКодов_ДобавитьКлючиВложенныхКодов(ТаблицаКодов);
		МодульМаркировки.ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
		
		Товар = Товар_Прочитать(СтрТовара.Товар, КэшТоваров);
		ВложенныеТовары = Новый Массив;
		Для Каждого СоставНабора Из Товар.СоставНабора Цикл
			ВложенныеТовары.Добавить(СоставНабора.ВложенныйТовар);
		КонецЦикла;
		
		ТаблицаКодов.Индексы.Добавить("КлючАгрегата, Товар");
		
		КодыСОшибками = Новый Массив;
		Для Каждого СтрНабора Из ТаблицаНаборов Цикл
			Для каждого ВложенныйТовар Из ВложенныеТовары Цикл
				ВложенныеКоды = ТаблицаКодов.НайтиСтроки(Новый Структура("КлючАгрегата, Товар", СтрНабора.КлючКода, ВложенныйТовар));
				Если ВложенныеКоды.Количество() = 0 Тогда
					КодыСОшибками.Добавить(СтрНабора.КодМаркировки);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(КодыСОшибками) Тогда
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", СтрТовара.НомерСтроки);
			Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, СписокКодовДляТекстаОшибки(КодыСОшибками));
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Операция_ПроверитьВложенияРегистрацииМультитоварныхНаборов(ОписаниеОперации, ОшибкиЗаполнения)
	
	МодульМаркировки = МодульМаркировки();
	ДопустимыеСтатусыВложенныхКодов = ДопустимыеСтатусыВложенныхКодовМультитоварныхНаборов();
	
	Для Каждого СтрТовара Из ОписаниеОперации.Товары Цикл
		
		ТаблицаНаборов = МодульМаркировки.КодыОпераций_Прочитать(ОписаниеОперации.Ссылка, СтрТовара.КлючСтрокиОперации);
		МодульМаркировки.КодыМаркировки_Прочитать(ТаблицаНаборов);
		
		КодыСОшибкамиВидаПродукции = Новый Массив;
		КодыСОшибкамиСтатусовВложений = Новый Массив;
		
		Для Каждого СтрНабора Из ТаблицаНаборов Цикл
			
			ТаблицаКодов = МодульМаркировки.КодыМаркировки_ТаблицаВложенныхКодов(СтрНабора.КлючКода);
			Если Не ЗначениеЗаполнено(ТаблицаКодов) Тогда
				Продолжить;
			КонецЕсли;
			
			МодульМаркировки.ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
			
			Если ТаблицаКодов.Найти(СтрТовара.Товар.ВидПродукции, "ВидПродукции") = Неопределено Тогда
				КодыСОшибкамиВидаПродукции.Добавить(СтрНабора.КодМаркировки);
			КонецЕсли;
			
			Для Каждого Статус Из МодульМаркировки.ТаблицаЗначений_ВыгрузитьКолонку(ТаблицаКодов, "Статус", Истина) Цикл
				Если Не МассивСодержитЗначение(ДопустимыеСтатусыВложенныхКодов, Статус) Тогда
					КодыСОшибкамиСтатусовВложений.Добавить(СтрНабора.КодМаркировки);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(КодыСОшибкамиВидаПродукции) Тогда
			ТекстОшибки = НСтр("ru = 'Вид продукции вложений не соответствует виду продукции набора:
			|%1'");
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", СтрТовара.НомерСтроки);
			Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, СписокКодовДляТекстаОшибки(КодыСОшибкамиВидаПродукции));
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодыСОшибкамиСтатусовВложений) Тогда
			ТекстОшибки = НСтр("ru = 'Коды вложений находятся в недопустимых статусах:
			|%1'");
			Ошибка = Новый_ОшибкаЗаполнения("Товар", "Товары", СтрТовара.НомерСтроки);
			Ошибка.ТекстОшибки = ПараметрыВСтроку(ТекстОшибки, СписокКодовДляТекстаОшибки(КодыСОшибкамиСтатусовВложений));
			ОшибкиЗаполнения.Добавить(Ошибка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция Операция_ДопустимоеКоличествоКодов(ТипОперации) Экспорт
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	// BSLLS:MagicNumber-off
	
	Варианты = Новый Соответствие;
	Варианты.Вставить(ТипыОпераций.ЗаказКодов					, 2000000);
	Варианты.Вставить(ТипыОпераций.ВводВОборот					, 40000);
	Варианты.Вставить(ТипыОпераций.ОтчетОНанесении				, 30000);
	Варианты.Вставить(ТипыОпераций.КорректировкаСведенийОКодах	, 30000);
	Варианты.Вставить(ТипыОпераций.Перемаркировка				, 30000);
	Варианты.Вставить(ТипыОпераций.ФормированиеКИГУ				, 30000);
	Варианты.Вставить(ТипыОпераций.РегистрацияКИГУ				, 30000);
	Варианты.Вставить(ТипыОпераций.РегистрацияНаборов			, 30000);
	Варианты.Вставить(ТипыОпераций.УведомлениеОСостоянииКодов	, 30000);
	Варианты.Вставить(ТипыОпераций.ФормированиеАТК				, 100000);
	
	// BSLLS:MagicNumber-on
	
	Возврат ЗначениеСоответствия(Варианты, ТипОперации, 0);
	
КонецФункции

Функция ДопустимоеКоличествоКодовВКИТУ() Экспорт
	
	Возврат 29999;
	
КонецФункции

Функция ВидПродукцииДоступенСервисПровайдеру(СервисПровайдер, ВидПродукции)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.ВидПродукции КАК ВидПродукции
	|ИЗ
	|	Справочник.КонтурМаркировка_СервисПровайдеры.ВидыПродукции КАК Т
	|ГДЕ
	|	Т.Ссылка = &СервисПровайдер
	|	И Т.ВидПродукции = &ВидПродукции");
	Запрос.УстановитьПараметр("СервисПровайдер", СервисПровайдер);
	Запрос.УстановитьПараметр("ВидПродукции", ВидПродукции);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ИдентификаторВСДСоответствуетФормату(ИдентификаторВСД)
	
	Попытка
		КаноническийИдентификатор = КаноническийИдентификаторИзСтроки(ИдентификаторВСД);
		Результат = Истина;
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Разбирает номер декларации на части
//
// Параметры:
//  НомерДекларации - Строка - номер декларации;
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * КодТаможни - Строка - код таможни;
//   * ДатаДекларации - Дата - дата декларации;
//   * ПорядковыйНомер - Строка - порядковый номер декларации;
//
Функция СтруктураТаможеннойДекларации(НомерДекларации) Экспорт
	
	ЧастиНомера = РазделитьСтроку(НомерДекларации, "/");
	
	Результат = Новый Структура;
	Результат.Вставить("КодТаможни");
	Результат.Вставить("ДатаДекларации");
	Результат.Вставить("ПорядковыйНомер");
	
	ДопустимоеКоличествоЧастей = 3;
	Если ЧастиНомера.Количество() <> ДопустимоеКоличествоЧастей Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.КодТаможни = ЧастиНомера[0];
	Результат.ДатаДекларации = ДатаТаможеннойДекларацииИзСтроки(ЧастиНомера[1]);
	Результат.ПорядковыйНомер = ЧастиНомера[2];
	
	Возврат Результат;
	
КонецФункции

// Разбирает номер партии на части
//
// Параметры:
//  НомерПартии - Строка - номер партии;
// 
// Возвращаемое значение:
//  Структура - содержит поля:
//   * НомерПартии                  - Строка - входящий параметр, номер партии;
//   * GTIN                         - Строка - код товара;
//   * ДатаПроизводства             - Дата   - дата производства;
//   * СерийныйНомер                - Строка - серийный номер;
//   * ДлинаБольшеДопустимой        - Булево - Истина, если длина номера партии больше допустимой;
//   * ДлинаМеньшеДопустимой        - Булево - Истина, если длина номера партии меньше допустимой;
//   * ЕстьНедопустимыеСимволы      - Булево - Истина, если номер партии содержит недопустимые символы;
//   * НекорректныйGTIN             - Булево - Истина, если GTIN не соответствует формату;
//   * НекорректнаяДатаПроизводства - Булево - Истина, если дата производства не соответствует формату;
//
Функция СтруктураНомераПартии(НомерПартии)
	
	ДлинаНомера = СтрДлина(НомерПартии);
	ФорматПартии = ФорматНомераПартии();
	
	Результат = Новый Структура;
	Результат.Вставить("GTIN", "");
	Результат.Вставить("ДатаПроизводства", '00010101');
	Результат.Вставить("СерийныйНомер", "");
	Результат.Вставить("НомерПартии", НомерПартии);
	Результат.Вставить("НекорректныйGTIN", Ложь);
	Результат.Вставить("НекорректнаяДатаПроизводства", Ложь);
	
	Результат.Вставить("ДлинаМеньшеДопустимой", ЗначениеЗаполнено(НомерПартии) И ДлинаНомера < ФорматПартии.МинимальнаяДлина);
	Результат.Вставить("ДлинаБольшеДопустимой", ДлинаНомера > ФорматПартии.МаксимальнаяДлина);
	Результат.Вставить("ЕстьНедопустимыеСимволы", Не СтрокаСодержитТолькоДопустимыеСимволы(НомерПартии, ФорматПартии.ДопустимыеСимволы));
	
	Если Не ЗначениеЗаполнено(НомерПартии)
		Или Результат.ДлинаМеньшеДопустимой
		Или Результат.ДлинаБольшеДопустимой
		Или Результат.ЕстьНедопустимыеСимволы Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтруктураНомераПартии_Заполнить_GTIN(Результат, ФорматПартии);
	СтруктураНомераПартии_Заполнить_ДатаПроизводства(Результат, ФорматПартии);
	СтруктураНомераПартии_Заполнить_СерийныйНомер(Результат, ФорматПартии);
	
	Возврат Результат;
	
КонецФункции

Функция ФорматНомераПартии()
	
	КлючКэш = "ФорматНомераПартии";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДлинаGTIN = 14;
	ДлинаДатаПроизводства = 6;
	МинимальнаяДлина = 21;
	МаксимальнаяДлина = 32;
	ДопустимыеСимволы = ВсеБуквыЛатиницы() + ВсеЦифры() + "/.,-";
	
	Результат = Новый Структура;
	Результат.Вставить("ДлинаGTIN", ДлинаGTIN);
	Результат.Вставить("ДлинаДатаПроизводства", ДлинаДатаПроизводства);
	Результат.Вставить("МинимальнаяДлина", МинимальнаяДлина);
	Результат.Вставить("МаксимальнаяДлина", МаксимальнаяДлина);
	Результат.Вставить("ДопустимыеСимволы", ДопустимыеСимволы);
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Процедура СтруктураНомераПартии_Заполнить_GTIN(СтруктураНомера, ФорматПартии)
	
	GTIN = Лев(СтруктураНомера.НомерПартии, ФорматПартии.ДлинаGTIN);
	
	Если ВСтрокеТолькоЦифры(GTIN) Тогда
		СтруктураНомера.GTIN = GTIN;
	Иначе
		СтруктураНомера.НекорректныйGTIN = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура СтруктураНомераПартии_Заполнить_ДатаПроизводства(СтруктураНомера, ФорматПартии)
	
	ПозицияДатаПроизводства = ФорматПартии.ДлинаGTIN + 1;
	ДатаПроизводстваСтрокой = Сред(СтруктураНомера.НомерПартии, ПозицияДатаПроизводства, ФорматПартии.ДлинаДатаПроизводства);
	
	Если Не ЗначениеЗаполнено(ДатаПроизводстваСтрокой) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ВСтрокеТолькоЦифры(ДатаПроизводстваСтрокой) Тогда
		СтруктураНомера.НекорректнаяДатаПроизводства = Истина;
		Возврат;
	КонецЕсли;
	
	ПозицияГода = 1;
	ПозицияМесяца = 3;
	ПозицияДня = 5;
	ДлинаНомера = 2;
	
	НомерГода = ЧислоИзСтроки(Сред(ДатаПроизводстваСтрокой, ПозицияГода, ДлинаНомера));
	НомерМесяца = ЧислоИзСтроки(Сред(ДатаПроизводстваСтрокой, ПозицияМесяца, ДлинаНомера));
	НомерДня = ЧислоИзСтроки(Сред(ДатаПроизводстваСтрокой, ПозицияДня, ДлинаНомера));
	
	Если ЗначениеЗаполнено(НомерГода) И ЗначениеЗаполнено(НомерМесяца) И ЗначениеЗаполнено(НомерДня) Тогда
		Попытка
			СтруктураНомера.ДатаПроизводства = Дата(НачалоВека() + НомерГода, НомерМесяца, НомерДня);
		Исключение
			СтруктураНомера.НекорректнаяДатаПроизводства = Истина;
		КонецПопытки;
	Иначе
		СтруктураНомера.НекорректнаяДатаПроизводства = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура СтруктураНомераПартии_Заполнить_СерийныйНомер(СтруктураНомера, ФорматПартии)
	
	ПозицияСерийныйНомер = ФорматПартии.ДлинаGTIN + ФорматПартии.ДлинаДатаПроизводства + 1;
	
	СтруктураНомера.СерийныйНомер = Сред(СтруктураНомера.НомерПартии, ПозицияСерийныйНомер);
	
КонецПроцедуры

// #КонецОбласти // ПроверкаЗаполненияОперации

// #Область ОбязательныеРеквизитыОпераций

Функция Операция_ОбязательныеРеквизиты_ЗаказКодов(ОписаниеОперации)
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	
	ПоляШапки = Результат.ПоляШапки;
	ПоляТоваров = Результат.ПоляТоваров;
	
	СпособыВыпуска = Перечисление_СпособыВыпускаТоваров();
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	ПоляШапки.Добавить("СпособВыпускаТоваров");
	ПоляШапки.Добавить("ТипКодаМаркировки");
	
	ПоляТоваров.Добавить("Товар");
	ПоляТоваров.Добавить("КоличествоУпаковок");
	
	СпособВыпускаТоваров = ОписаниеОперации.ДопРеквизиты.СпособВыпускаТоваров;
	
	Если СпособВыпускаТоваров = СпособыВыпуска.Перемаркировка Тогда
		ПоляТоваров.Добавить("КодТНВЭД");
	КонецЕсли;
	
	Если ВидПродукцииТребуетТипОплатыКодов(ОписаниеОперации.ВидПродукции) Тогда
		ПоляШапки.Добавить("ТипОплатыКодов");
	КонецЕсли;
	
	Если (СпособВыпускаТоваров = СпособыВыпуска.Остатки
		Или СпособВыпускаТоваров = СпособыВыпуска.Перемаркировка)
		И ОписаниеОперации.ДопРеквизиты.КарточкиТоваровПринадлежатДругойОрганизации Тогда
		ПоляШапки.Добавить("СобственникТовараИНН");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_ОтчетОНанесении(ОписаниеОперации)
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	ПоляТоваров = Результат.ПоляТоваров;
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ТипИспользования");
	
	Если ВидПродукцииТребуетПлощадкуВОтчетеОНанесении(ОписаниеОперации.ВидПродукции, ДопРеквизиты.ТипОтчетаОНанесении) Тогда
		ПоляШапки.Добавить("Площадка");
	КонецЕсли;
	
	Если ВидПродукцииТребуетУказатьТипСрокаГодности(ОписаниеОперации.ВидПродукции)
		И Операция_ЕстьЕдиницыТоваров(ОписаниеОперации.Товары) Тогда
		ПоляШапки.Добавить("ТипСрокаГодности");
	КонецЕсли;
	
	Если ОписаниеОперации.ТипОперации = Перечисление_ТипыОпераций().ОтчетОНанесенииНаТСД Тогда
		ПоляТоваров.Добавить("Товары");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_ОтчетОВыбытии()
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	ПоляШапки.Добавить("ПричинаВыбытияКодов");
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_ВводВОборот(ОписаниеОперации)
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	ПоляТоваров = Результат.ПоляТоваров;
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	СпособыВвода = Перечисление_СпособыВводаВОборот();
	ТипыЗаказов = Перечисление_ТипыПроизводственныхЗаказов();
	
	Организация = ОписаниеОперации.Организация;
	ВидПродукции = ОписаниеОперации.ВидПродукции;
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	ПроизводительИНН = ДопРеквизиты.ПроизводительИНН;
	СпособВводаВОборот = ДопРеквизиты.СпособВводаВОборот;
	ТоварыЗакрытогоСегмента = ДопРеквизиты.ТоварыЗакрытогоСегмента;
	ТипПроизводственногоЗаказа = ДопРеквизиты.ТипПроизводственногоЗаказа;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	ПоляШапки.Добавить("СпособВводаВОборот");
	
	ПоляТоваров.Добавить("КоличествоУпаковок");
	
	Если СпособВводаВОборот <> СпособыВвода.ИмпортФТС
		И Не КодыОпераций_ЕстьМультитоварныеАгрегаты(ОписаниеОперации.Ссылка) Тогда
		ПоляТоваров.Добавить("Товар");
	КонецЕсли;
	
	Если СпособВводаВОборот = СпособыВвода.ПроизводствоРФ Тогда
		ПоляШапки.Добавить("ТипПроизводственногоЗаказа");
		Если ТипПроизводственногоЗаказа = ТипыЗаказов.КонтрактноеПроизводство Тогда
			ПоляШапки.Добавить("ПроизводительИНН");
			Если ЗначениеЗаполнено(ПроизводительИНН)
				И ПроизводительИНН = Организация.ИНН Тогда
				ПоляШапки.Добавить("СобственникТовараИНН");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СпособВводаВОборот = СпособыВвода.ИмпортФТС Тогда
		ПоляШапки.Добавить("НомерДекларации");
		Если ВидПродукции = ВидыПродукции.Пиво Тогда
			ПоляШапки.Добавить("Площадка");
		КонецЕсли;
		Если ТоварыЗакрытогоСегмента Тогда
			ПоляТоваров.Добавить("КодТНВЭД");
			ПоляТоваров.Добавить("КодСтраныПроизводителя");
		КонецЕсли;
	КонецЕсли;
	
	Если СпособВводаВОборот = СпособыВвода.Импорт Тогда
		ПоляШапки.Добавить("ДатаДекларации");
		ПоляШапки.Добавить("НомерДекларации");
		ПоляШапки.Добавить("КодТаможни");
		ПоляШапки.Добавить("ПринятоеРешение");
	КонецЕсли;
	
	Если СпособВводаВОборот = СпособыВвода.Трансгран Тогда
		
		ПоляШапки.Добавить("КодСтраныЭкспортера");
		ПоляШапки.Добавить("НаименованиеЭкспортера");
		ПоляШапки.Добавить("НомерНалогоплательщикаОтправителя");
		ПоляШапки.Добавить("ДатаИмпорта");
		ПоляШапки.Добавить("НомерДокумента");
		ПоляШапки.Добавить("ДатаДокумента");
		
		Если ВидПродукции = ВидыПродукции.Пиво Тогда
			ПоляШапки.Добавить("Площадка");
			ПоляТоваров.Добавить("Цена");
			ПоляТоваров.Добавить("СуммаАкциза");
		КонецЕсли;
		
	КонецЕсли;
	
	Если СпособВводаВОборотТребуетТНВЭД(СпособВводаВОборот) Тогда
		ПоляТоваров.Добавить("КодТНВЭД");
	КонецЕсли;
	
	Если СпособВводаВОборот = СпособыВвода.СПричиной Тогда
		ПоляШапки.Добавить("ПричинаВводаВОборот");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_ВыводИзОборота(ОписаниеОперации)
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	ПоляТоваров = Результат.ПоляТоваров;
	
	ВидыДокументов = Перечисление_ВидыПервичныхДокументов();
	ПричиныВыводаИзОборота = Перечисление_ПричиныВыводаИзОборота();
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	ПричинаВыводаИзОборота = ДопРеквизиты.ПричинаВыводаИзОборота;
	ВидПервичногоДокумента = ДопРеквизиты.ВидПервичногоДокумента;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	ПоляШапки.Добавить("ПричинаВыводаИзОборота");
	
	Если ДопРеквизиты.ОбъемноСортовойУчет Тогда
		ПоляТоваров.Добавить("Товар");
	КонецЕсли;
	
	Если ПричинаВыводаИзОборотаТребуетПервичныйДокумент(ПричинаВыводаИзОборота) Тогда
		ПоляШапки.Добавить("ВидПервичногоДокумента");
		ПоляШапки.Добавить("НомерДокумента");
		ПоляШапки.Добавить("ДатаДокумента");
	КонецЕсли;
	
	Если ПричинаВыводаИзОборотаДопускаетПервичныйДокумент(ПричинаВыводаИзОборота)
		И ЗначениеЗаполнено(ВидПервичногоДокумента) Тогда
		ПоляШапки.Добавить("НомерДокумента");
		ПоляШапки.Добавить("ДатаДокумента");
	КонецЕсли;
	
	Если ПричинаВыводаИзОборотаТребуетИННПолучателя(ПричинаВыводаИзОборота) Тогда
		ПоляШапки.Добавить("ИННПолучателя");
	КонецЕсли;
	
	ЕстьИННПолучателя = ЗначениеЗаполнено(ДопРеквизиты.ИННПолучателя);
	Если ПричинаВыводаИзОборотаТребуетУказатьЦену(ПричинаВыводаИзОборота, ЕстьИННПолучателя)
		И ПричинаВыводаИзОборота <> ПричиныВыводаИзОборота.БезвозмезднаяПередача Тогда
		ПоляТоваров.Добавить("Цена");
	КонецЕсли;
	
	Если ВидПервичногоДокумента = ВидыДокументов.Прочее Тогда
		ПоляШапки.Добавить("НаименованиеПервичногоДокумента");
	КонецЕсли;
	
	Если ПричинаВыводаИзОборота = ПричиныВыводаИзОборота.Прочее Тогда
		ПоляШапки.Добавить("НаименованиеПричиныВыводаИзОборота");
	КонецЕсли;
	
	Если ПричинаВыводаИзОборота = ПричиныВыводаИзОборота.ПродажаПоГосКонтракту
		Или ПричинаВыводаИзОборота = ПричиныВыводаИзОборота.ПродажаПоСделкеСГосударственнойТайной Тогда
		ПоляШапки.Добавить("ИдентификаторГосКонтракта");
	КонецЕсли;
	
	Если ПричинаВыводаИзОборота = ПричиныВыводаИзОборота.ЭкспортЕАЭС Тогда
		ПоляШапки.Добавить("КодСтраныПолучателя");
	КонецЕсли;
	
	ИННОрганизации = ЗначениеРеквизитаОбъектаЛок(ОписаниеОперации.Организация, "ИНН");
	Если ПричинаВыводаИзОборотаТребуетКПППлощадки(ПричинаВыводаИзОборота, ОписаниеОперации.ВидПродукции, ИННОрганизации)
		Или ПричинаВыводаИзОборотаТребуетФИАСПлощадки(ПричинаВыводаИзОборота, ОписаниеОперации.ВидПродукции, ИННОрганизации) Тогда
		ПоляШапки.Добавить("Площадка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_ВозвратВОборот(ОписаниеОперации)
	
	ПричиныВозврата = Перечисление_ПричиныВозвратаВОборот();
	ВидыПервичныхДокументов = Перечисление_ВидыПервичныхДокументов();
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ПричинаВозвратаВОборот");
	
	ТоварОплачен = ОписаниеОперации.ДопРеквизиты.ТоварОплачен;
	ПричинаВозвратаВОборот = ОписаниеОперации.ДопРеквизиты.ПричинаВозвратаВОборот;
	ВидПервичногоДокумента = ОписаниеОперации.ДопРеквизиты.ВидПервичногоДокумента;
	
	Если ПричинаВозвратаВОборотТребуетПервичныйДокумент(ПричинаВозвратаВОборот, ТоварОплачен) Тогда
		ПоляШапки.Добавить("ВидПервичногоДокумента");
		ПоляШапки.Добавить("НомерДокумента");
		ПоляШапки.Добавить("ДатаДокумента");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидПервичногоДокумента) Тогда
		ПоляШапки.Добавить("НомерДокумента");
		ПоляШапки.Добавить("ДатаДокумента");
	КонецЕсли;
	
	Если ВидПервичногоДокумента = ВидыПервичныхДокументов.Прочее Тогда
		ПоляШапки.Добавить("НаименованиеПервичногоДокумента");
	КонецЕсли;
	
	Если ПричинаВозвратаВОборот = ПричиныВозврата.Гостайна Тогда
		ПоляШапки.Добавить("ИдентификаторГосКонтракта");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_Перемаркировка()
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ПричинаПеремаркировки");
	ПоляШапки.Добавить("ДатаПеремаркировки");
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_ПодборКодовНаТСД(ОписаниеОперации)
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	ПоляТоваров = Результат.ПоляТоваров;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	
	ПоляТоваров.Добавить("КоличествоУпаковок");
	
	Если Операция_ЕстьТоварыБезGTIN(ОписаниеОперации.Товары) Тогда
		ПоляШапки.Добавить("ВидПродукции");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_СообщениеОбОтгрузке(ОписаниеОперации)
	
	ТипыОтгрузок = Перечисление_ТипыОтгрузок();
	ПричиныВыводаИзОборота = Перечисление_ПричиныВыводаИзОборотаПриОтгрузке();
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	ПоляТоваров = Результат.ПоляТоваров;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ТипОтгрузки");
	ПоляШапки.Добавить("ДатаОтгрузки");
	ПоляШапки.Добавить("НомерДокумента");
	ПоляШапки.Добавить("ДатаДокумента");
	ПоляШапки.Добавить("ИННПолучателя");
	ПоляШапки.Добавить("ВидПродукции");
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	Если ДопРеквизиты.ТипОтгрузки = ТипыОтгрузок.ТрансграничнаяТорговля Тогда
		ПоляШапки.Добавить("КодСтраныПолучателя");
		ПоляШапки.Добавить("GLNПолучателя");
		Если ДопРеквизиты.ОбъемноСортовойУчет Тогда
			ПоляШапки.Добавить("НаименованиеПолучателя");
		КонецЕсли;
	КонецЕсли;
	
	Если ДопРеквизиты.ТипОтгрузки = ТипыОтгрузок.ОтгрузкаСВыводомИзОборота Тогда
		ПоляШапки.Добавить("ДатаВыводаИзОборота");
		ПоляШапки.Добавить("ПричинаВыводаИзОборота");
	КонецЕсли;
	
	Если ДопРеквизиты.ПричинаВыводаИзОборота = ПричиныВыводаИзОборота.ПриобретениеГосПредприятием Тогда
		ПоляШапки.Добавить("ИдентификаторГосКонтракта");
	КонецЕсли;
	
	ПоляТоваров.Добавить("КоличествоУпаковок");
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_ТрансформацияАгрегатов()
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_ФормированиеАТК()
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	ПоляШапки.Добавить("ГруппаТНВЭД");
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_ФормированиеКИГУ()
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляТоваров = Результат.ПоляТоваров;
	
	ПоляТоваров.Добавить("Товар");
	ПоляТоваров.Добавить("КоличествоУпаковок");
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_РасформированиеАТК()
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_ТрансформацияАТК()
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_КорректировкаСведенийОКодах(ОписаниеОперации)
	
	ВидыСведений = Перечисление_ВидыКорректируемыхСведений();
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	ПоляТоваров = Результат.ПоляТоваров;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	ПоляШапки.Добавить("ВидКорректируемыхСведений");
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	Если ДопРеквизиты.ВидКорректируемыхСведений = ВидыСведений.ДатаПроизводства Тогда
		ПоляТоваров.Добавить("ДатаПроизводства");
	КонецЕсли;
	
	Если ДопРеквизиты.ВидКорректируемыхСведений = ВидыСведений.СрокГодности Тогда
		ПоляТоваров.Добавить("ДатаСрокаГодности");
	КонецЕсли;
	
	Если ДопРеквизиты.ВидКорректируемыхСведений = ВидыСведений.ИдентификаторВСД Тогда
		ПоляТоваров.Добавить("ИдентификаторВСД");
	КонецЕсли;
	
	Если ДопРеквизиты.ВидКорректируемыхСведений = ВидыСведений.КодТНВЭД Тогда
		ПоляТоваров.Добавить("КодТНВЭД");
	КонецЕсли;
	
	Если ДопРеквизиты.ВидКорректируемыхСведений = ВидыСведений.ФактическийВес Тогда
		ПоляТоваров.Добавить("Количество");
	КонецЕсли;
	
	Если ДопРеквизиты.ВидКорректируемыхСведений = ВидыСведений.СпособВыпускаТоваров Тогда
		ПоляТоваров.Добавить("СпособВыпускаТоваров");
	КонецЕсли;
	
	Если ДопРеквизиты.ВидКорректируемыхСведений = ВидыСведений.РазрешительныйДокумент
		Или ДопРеквизиты.ВидКорректируемыхСведений = ВидыСведений.ЛицензияНаНедра Тогда
		ПоляТоваров.Добавить("ТипКорректировкиСведенийОКодах");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_УведомлениеОСостоянииКодов(ОписаниеОперации)
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	ПоляТоваров = Результат.ПоляТоваров;
	
	СостоянияКодов = Перечисление_СостоянияКодов();
	ВидыДокументов = Перечисление_ВидыПервичныхДокументов();
	ВидыТранспортныхДокументов = Перечисление_ВидыТранспортныхДокументов();
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	СостояниеКодов = ДопРеквизиты.СостояниеКодов;
	ВидТранспортногоДокумента = ДопРеквизиты.ВидТранспортногоДокумента;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	
	Если СостояниеКодов = СостоянияКодов.ОтгрузкаНаЭкспорт Тогда
		
		ПоляШапки.Добавить("Площадка");
		ПоляШапки.Добавить("ДатаОтгрузки");
		ПоляШапки.Добавить("ИННПолучателя");
		ПоляШапки.Добавить("НаименованиеПолучателя");
		ПоляШапки.Добавить("КодСтраныПолучателя");
		ПоляШапки.Добавить("ВидТранспортногоДокумента");
		
		Если ВидТранспортногоДокумента = ВидыТранспортныхДокументов.ТТН Тогда
			ПоляШапки.Добавить("ГосномерТранспортногоСредства");
			ПоляШапки.Добавить("НомерДокумента");
			ПоляШапки.Добавить("ДатаДокумента");
		КонецЕсли;
		
		Если ВидТранспортногоДокумента = ВидыТранспортныхДокументов.ЭПД Тогда
			ПоляШапки.Добавить("ИдентификаторЭПД");
		КонецЕсли;
		
	КонецЕсли;
	
	ПоляТоваров.Добавить("Товар");
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизиты_РезервированиеПартий(ОписаниеОперации)
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	ПоляТоваров = Результат.ПоляТоваров;
	
	СостоянияКодов = Перечисление_СостоянияКодов();
	ВидыДокументов = Перечисление_ВидыПервичныхДокументов();
	ВидыТранспортныхДокументов = Перечисление_ВидыТранспортныхДокументов();
	
	ДопРеквизиты = ОписаниеОперации.ДопРеквизиты;
	СостояниеКодов = ДопРеквизиты.СостояниеКодов;
	ВидТранспортногоДокумента = ДопРеквизиты.ВидТранспортногоДокумента;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	
	ПоляТоваров.Добавить("НомерПартии");
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизитыРегистрацииКИГУ()
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	
	Возврат Результат;
	
КонецФункции

Функция Операция_ОбязательныеРеквизитыНаполненияКИГУНаТСД()
	
	Результат = Новый_ОбязательныеРеквизитыОперации();
	ПоляШапки = Результат.ПоляШапки;
	ПоляТоваров = Результат.ПоляТоваров;
	
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("Склад");
	ПоляШапки.Добавить("ВидПродукции");
	
	ПоляТоваров.Добавить("Товар");
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ОбязательныеРеквизитыОперации()
	
	Результат = Новый Структура;
	Результат.Вставить("ПоляШапки", Новый Массив);
	Результат.Вставить("ПоляТоваров", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // ОбязательныеРеквизитыОпераций

// #Область ОпределенияОпераций

Функция ТипыСлужебныхОпераций() Экспорт
	
	КлючКэш = "ТипыСлужебныхОпераций";
	Результат = Кэш_Прочитать(КлючКэш);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	Результат = Новый Массив;
	Результат.Добавить(ТипыОпераций.СвободныйОстаток);
	Результат.Добавить(ТипыОпераций.РезервДокументаУчета);
	Результат.Добавить(ТипыОпераций.ОбновлениеСтатусовКодов);
	Результат.Добавить(ТипыОпераций.РегистрацияОдногоАгрегатаВГИС);
	Результат.Добавить(ТипыОпераций.РегистрацияПакетаАгрегатов);
	Результат.Добавить(ТипыОпераций.РасформированиеАгрегатаВГИС);
	Результат.Добавить(ТипыОпераций.НаполнениеОдногоАгрегатаНаТСД);
	Результат.Добавить(ТипыОпераций.НаполнениеПакетаАгрегатовНаТСД);
	Результат.Добавить(ТипыОпераций.РегистрацияСтрокиОтчетаОНанесении);
	Результат.Добавить(ТипыОпераций.РегистрацияСтрокиНаборов);
	Результат.Добавить(ТипыОпераций.РегистрацияСтрокиКорректировкиСведенийОКодах);
	Результат.Добавить(ТипыОпераций.РегистрацияСтрокиПеремаркировки);
	Результат.Добавить(ТипыОпераций.РегистрацияСтрокиКИГУ);
	Результат.Добавить(ТипыОпераций.РегистрацияСтрокиУведомленияОСостоянииКодов);
	Результат.Добавить(ТипыОпераций.РегистрацияСтрокиВводаВОборот);
	Результат.Добавить(ТипыОпераций.ОтменаВыводаИзОборота);
	Результат.Добавить(ТипыОпераций.РезервированиеОднойПартии);
	
	Результат = Новый ФиксированныйМассив(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ТипыИнтерактивныхОпераций() Экспорт
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	Результат = Новый Массив;
	Результат.Добавить(ТипыОпераций.ЗаказКодов);
	Результат.Добавить(ТипыОпераций.ВводВОборот);
	Результат.Добавить(ТипыОпераций.АгрегацияКодов);
	Результат.Добавить(ТипыОпераций.РегистрацияАгрегатов);
	Результат.Добавить(ТипыОпераций.РасформированиеАгрегатов);
	Результат.Добавить(ТипыОпераций.НаполнениеАгрегатовНаТСД);
	Результат.Добавить(ТипыОпераций.ПечатьКодов);
	Результат.Добавить(ТипыОпераций.ОтчетОНанесенииНаТСД);
	Результат.Добавить(ТипыОпераций.ОтчетОНанесении);
	Результат.Добавить(ТипыОпераций.ПодборКодовНаТСД);
	Результат.Добавить(ТипыОпераций.ПодборТоваровИКодовНаТСД);
	Результат.Добавить(ТипыОпераций.СообщениеОбОтгрузке);
	Результат.Добавить(ТипыОпераций.ВыводИзОборота);
	Результат.Добавить(ТипыОпераций.ОтчетОВыбытии);
	Результат.Добавить(ТипыОпераций.ОтчетОВыбытииНаТСД);
	Результат.Добавить(ТипыОпераций.Перемаркировка);
	Результат.Добавить(ТипыОпераций.НаполнениеНаборовНаТСД);
	Результат.Добавить(ТипыОпераций.ФормированиеКИГУ);
	Результат.Добавить(ТипыОпераций.НаполнениеКИГУНаТСД);
	Результат.Добавить(ТипыОпераций.РегистрацияКИГУ);
	Результат.Добавить(ТипыОпераций.ВозвратВОборот);
	Результат.Добавить(ТипыОпераций.ВозвратВОборотНаТСД);
	Результат.Добавить(ТипыОпераций.ДобавлениеВАгрегат);
	Результат.Добавить(ТипыОпераций.ИзъятиеИзАгрегата);
	Результат.Добавить(ТипыОпераций.ФормированиеАТК);
	Результат.Добавить(ТипыОпераций.РасформированиеАТК);
	Результат.Добавить(ТипыОпераций.ДобавлениеВАТК);
	Результат.Добавить(ТипыОпераций.ИзъятиеИзАТК);
	Результат.Добавить(ТипыОпераций.РегистрацияНаборов);
	Результат.Добавить(ТипыОпераций.КорректировкаСведенийОКодах);
	Результат.Добавить(ТипыОпераций.РасформированиеНаборов);
	Результат.Добавить(ТипыОпераций.УведомлениеОСостоянииКодов);
	Результат.Добавить(ТипыОпераций.ОтменаВыводаИзОборота);
	Результат.Добавить(ТипыОпераций.ВходящийУПД);
	Результат.Добавить(ТипыОпераций.РезервированиеПартий);
	
	Возврат Результат;
	
КонецФункции

Функция ЗавершенныеСтатусыОпераций() Экспорт
	
	СтатусыОпераций = Перечисление_СтатусыОпераций();
	
	Результат = Новый Массив;
	Результат.Добавить(СтатусыОпераций.ОперацияЗавершена);
	Результат.Добавить(СтатусыОпераций.ОперацияОтменена);
	Результат.Добавить(СтатусыОпераций.ПринятЧастично);
	Результат.Добавить(СтатусыОпераций.ОшибкаОбработки);
	Результат.Добавить(СтатусыОпераций.ОшибкаЗаполнения);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВозвратВОборот(ТипОперации) Экспорт
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(ТипыОпераций.ВозвратВОборот);
	ПодходящиеТипы.Добавить(ТипыОпераций.ВозвратВОборотНаТСД);
	
	Возврат МассивСодержитЗначение(ПодходящиеТипы, ТипОперации);
	
КонецФункции

Функция ЭтоОтчетОНанесении(ТипОперации) Экспорт
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(ТипыОпераций.ОтчетОНанесении);
	ПодходящиеТипы.Добавить(ТипыОпераций.ОтчетОНанесенииНаТСД);
	
	Возврат МассивСодержитЗначение(ПодходящиеТипы, ТипОперации);
	
КонецФункции

Функция ЭтоТипОтчетаОНанесенииПоУмолчанию(ТипОтчетаОНанесении) Экспорт
	
	Возврат (Не ЗначениеЗаполнено(ТипОтчетаОНанесении) Или ТипОтчетаОНанесении = Перечисление_ТипыОтчетаОНанесении().ОтчетОНанесении);
	
КонецФункции

Функция ЭтоОперацияАгрегации(ТипОперации)
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(ТипыОпераций.АгрегацияКодов);
	ПодходящиеТипы.Добавить(ТипыОпераций.РегистрацияАгрегатов);
	ПодходящиеТипы.Добавить(ТипыОпераций.НаполнениеАгрегатовНаТСД);
	
	Возврат МассивСодержитЗначение(ПодходящиеТипы, ТипОперации);
	
КонецФункции

Функция ЭтоТрансформацияАгрегата(ТипОперации) Экспорт
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(ТипыОпераций.ИзъятиеИзАгрегата);
	ПодходящиеТипы.Добавить(ТипыОпераций.ДобавлениеВАгрегат);
	
	Возврат МассивСодержитЗначение(ПодходящиеТипы, ТипОперации);
	
КонецФункции

Функция ЭтоТрансформацияАТК(ТипОперации) Экспорт
	
	ТипыОпераций = Перечисление_ТипыОпераций();
	
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(ТипыОпераций.ИзъятиеИзАТК);
	ПодходящиеТипы.Добавить(ТипыОпераций.ДобавлениеВАТК);
	
	Возврат МассивСодержитЗначение(ПодходящиеТипы, ТипОперации);
	
КонецФункции

Функция ЭтоИнтерактивнаяОперация(ТипОперации) Экспорт
	
	Возврат МассивСодержитЗначение(ТипыИнтерактивныхОпераций(), ТипОперации);
	
КонецФункции

// #КонецОбласти // ОпределенияОпераций

// #Область Товары

Функция Товар_Прочитать(Ссылка, КэшРезультатов = Неопределено)
	
	Возврат МодульМаркировки().Товар_Прочитать(Ссылка, КэшРезультатов);
	
КонецФункции

Функция Товар_ГруппаПлатности(Товар)
	
	Возврат ДопРеквизит_Прочитать(Товар, "ГруппаПлатности", 0);
	
КонецФункции

Функция Товар_ПоддерживаетОСУВДокументе(ОписаниеТовара, ПараметрыПроверки) Экспорт
	
	Результат = Истина;
	
	ВидПродукции = ОписаниеТовара.ВидПродукции;
	ВидыПродукции = Перечисление_ВидыПродукции();
	
	Если ВидПродукции = ВидыПродукции.Пиво Тогда
		Результат = ПараметрыПроверки.ЭтоВнутреннееПеремещение;
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Антисептики Тогда
		Результат = Товар_ПоддерживаетОСУАнтисептики(ОписаниеТовара, ПараметрыПроверки.ОСУРазрешенАнтисептикиГруппаПлатности1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Товар_ПоддерживаетОСУАнтисептики(ОписаниеТовара, ОСУРазрешенАнтисептикиГруппаПлатности1)
	
	Результат = Ложь;
	
	ГруппаПлатности_1 = 1;
	ГруппаПлатности_2 = 2;
	
	ГруппаПлатности_1_ПоддерживаетОСУ = ОписаниеТовара.ДопРеквизиты.ГруппаПлатности = ГруппаПлатности_1
	И ОСУРазрешенАнтисептикиГруппаПлатности1;
	ГруппаПлатности_2_ПоддерживаетОСУ = ОписаниеТовара.ДопРеквизиты.ГруппаПлатности = ГруппаПлатности_2
	И ФичаФлагВключен(Перечисление_ФичаФлаги().ПравилоОтраженияОСУАнтисептикиВолна1);
	
	Если ГруппаПлатности_1_ПоддерживаетОСУ Или ГруппаПлатности_2_ПоддерживаетОСУ Тогда
		
		ОтражениеВЭДО = МодульМаркировки().МаркируемыеТоварныеГруппы_ОтражениеВЭДО(ОписаниеТовара.ВидПродукции);
		
		Результат = (ЗначениеЗаполнено(ОтражениеВЭДО)
		И ОтражениеВЭДО = Перечисление_ПравилаОтраженияВЭДО().ОСУ)
		Или Не ЗначениеЗаполнено(ОтражениеВЭДО);
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Товар_ОтсутствуютТребованияРД(Товар) Экспорт
	
	Возврат ДопРеквизит_Прочитать(Товар, "ОтсутствуютТребованияРД", Ложь);
	
КонецФункции

Функция Товар_АвтоприкреплениеСведений(Товар)
	
	Если Товар.ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Пиво Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ДопРеквизит_Прочитать(Товар, "АвтоприкреплениеСведений", Ложь);
	
КонецФункции

Функция ЭтоТоварАнтисептиков(Товар)
	
	Возврат (Товар.ВидПродукции = Перечисление_ВидыПродукции().Антисептики);
	
КонецФункции

Функция ЭтоТоварАвтоЖидкостей(Товар)
	
	Возврат (Товар.ВидПродукции = Перечисление_ВидыПродукции().МаслаИАвтомобильныеЖидкости);
	
КонецФункции

Функция ЭтоНикотиносодержащаяПродукция(ВидПродукции) Экспорт
	
	Возврат МассивСодержитЗначение(ДопустимыеВидыНикотинсодержащейПродукции(), ВидПродукции);
	
КонецФункции

Функция ЭтоТоварБАДыВолна3(Товар)
	
	ВидПродукции = Перечисление_ВидыПродукции().БАДы;
	ГруппаПлатности = 3;
	
	Возврат (Товар.ВидПродукции = ВидПродукции И Товар_ГруппаПлатности(Товар) = ГруппаПлатности);
	
КонецФункции

Функция ЭтоТоварЛегпромаВолна4(Товар)
	
	ГруппаПлатности = 4;
	ВидПродукции = Перечисление_ВидыПродукции().Легпром;
	
	Возврат (Товар.ВидПродукции = ВидПродукции И Товар_ГруппаПлатности(Товар) = ГруппаПлатности);
	
КонецФункции

Функция ЭтоТоварКосметикиВолна4(Товар)
	
	ГруппаПлатности = 4;
	ВидПродукции = Перечисление_ВидыПродукции().Косметика;
	
	Возврат (Товар.ВидПродукции = ВидПродукции И Товар_ГруппаПлатности(Товар) = ГруппаПлатности);
	
КонецФункции

Функция ЭтоТоварАнтисептикиГруппаПлатности1(Товар)
	
	ГруппаПлатности = 1;
	ВидПродукции = Перечисление_ВидыПродукции().Антисептики;
	
	Возврат (Товар.ВидПродукции = ВидПродукции И Товар_ГруппаПлатности(Товар) = ГруппаПлатности);
	
КонецФункции

// #КонецОбласти // Товары

// #Область ДопРеквизиты

Функция ДопРеквизиты_Прочитать(Объект) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.ИмяРеквизита КАК ИмяРеквизита,
	|	Т.Значение КАК Значение,
	|	Т.ЗначениеКлюч КАК ЗначениеКлюч,
	|	Т.ЗначениеСсылка КАК ЗначениеСсылка,
	|	Т.ТипКлючаЗначения КАК ТипКлючаЗначения
	|ИЗ
	|	РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК Т
	|ГДЕ
	|	Т.Объект = &Объект");
	Запрос.УстановитьПараметр("Объект", Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Структура;
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ЗначениеСсылка) Тогда
			Значение = Выборка.ЗначениеСсылка;
		ИначеЕсли ЗначениеЗаполнено(Выборка.ЗначениеКлюч) Тогда
			Если ЗначениеЗаполнено(Выборка.ТипКлючаЗначения) Тогда
				Значение = МодульОбщегоНазначения().СсылкаПоИдентификатору(Выборка.ЗначениеКлюч, Выборка.ТипКлючаЗначения);
			Иначе
				Значение = Выборка.ЗначениеКлюч;
			КонецЕсли;
		Иначе
			Значение = Выборка.Значение;
		КонецЕсли;
		
		Результат.Вставить(Выборка.ИмяРеквизита, Значение);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДопРеквизит_Прочитать(Объект, ИмяРеквизита, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Значение КАК Значение,
	|	Т.ЗначениеКлюч КАК ЗначениеКлюч,
	|	Т.ЗначениеСсылка КАК ЗначениеСсылка,
	|	Т.ТипКлючаЗначения КАК ТипКлючаЗначения
	|ИЗ
	|	РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК Т
	|ГДЕ
	|	Т.Объект = &Объект
	|	И Т.ИмяРеквизита = &ИмяРеквизита");
	Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита);
	Запрос.УстановитьПараметр("Объект", Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = ЗначениеПоУмолчанию;
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ЗначениеСсылка) Тогда
			Результат = Выборка.ЗначениеСсылка;
		ИначеЕсли ЗначениеЗаполнено(Выборка.ЗначениеКлюч) Тогда
			Если ЗначениеЗаполнено(Выборка.ТипКлючаЗначения) Тогда
				Результат = МодульОбщегоНазначения().СсылкаПоИдентификатору(Выборка.ЗначениеКлюч, Выборка.ТипКлючаЗначения);
			Иначе
				Результат = Выборка.ЗначениеКлюч;
			КонецЕсли;
		Иначе
			Результат = Выборка.Значение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти

// #Область // ФичаФлаги

// Проверяет что фича-флаг включен
//
// Параметры:
//  ФичаФлаг - Строка - см. Перечисление_ФичаФлаги();
// 
// Возвращаемое значение:
//  Булево - Истина, если фича-флаг включен
//
Функция ФичаФлагВключен(ФичаФлаг) Экспорт
	
	КлючКэш = "ФичаФлагВключен: " + ФичаФлаг;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ФичаФлагиВключения = Перечисление_ФичаФлагиВключения();
	ФичаФлагиОтключения = Перечисление_ФичаФлагиОтключения();
	
	Результат = Ложь;
	
	Если ЕстьЗначениеВСтруктуре(ФичаФлагиВключения, ФичаФлаг) Тогда
		Результат = ОтложеннуюФункциюМожноИспользовать(ФичаФлаг);
	КонецЕсли;
	
	Если ЕстьЗначениеВСтруктуре(ФичаФлагиОтключения, ФичаФлаг) Тогда
		Результат = Не ВременнуюФункциюНужноОтключить(ФичаФлаг);
	КонецЕсли;
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

// Добавляет или удаляет значение в массиве в зависимости от того включен фича-флаг или выключен
//
// Параметры:
//  Массив   - Массив - массив значений;
//  Значение - Произвольный - значение, которое нужно добавить или удалить в массиве;
//  ФичаФлаг - Строка - см. Перечисление_ФичаФлаги();
//
Процедура ИзменитьМассивПоФичаФлагу(Массив, Значение, ФичаФлаг) Экспорт
	
	Если ФичаФлагВключен(ФичаФлаг) Тогда
		ДобавитьЗначениеВМассив(Массив, Значение);
	Иначе
		УдалитьЗначениеИзМассива(Массив, Значение);
	КонецЕсли;
	
КонецПроцедуры

Функция ВременнуюФункциюНужноОтключить(ИмяФункции) Экспорт
	
	ДатаОтключения = СвойствоСтруктуры(СписокВременныхФункций().ДатыОтключения, ИмяФункции, '00010101');
	
	Возврат (ТекущаяДатаСеанса() >= ДатаОтключения);
	
КонецФункции

Функция ОтложеннуюФункциюМожноИспользовать(ИмяФункции) Экспорт
	
	ДатаВключения = СвойствоСтруктуры(СписокОтложенныхФункций().ДатыВключения, ИмяФункции, '00010101');
	
	Возврат (ТекущаяДатаСеанса() >= ДатаВключения);
	
КонецФункции

Функция СписокВременныхФункций()
	
	КлючКэш = "СписокВременныхФункций";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = МодульМаркировки().СписокВременныхФункций();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция СписокОтложенныхФункций()
	
	КлючКэш = "СписокОтложенныхФункций";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = МодульМаркировки().СписокОтложенныхФункций();
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // ВременныеИОтложенныеФункции

// #Область КлассификаторСтран

// Классификатор из макета
// 
// Возвращаемое значение:
//  ТаблицаЗначений - классификатор стран мира:
//   * Наименование - Строка - Наименование (пример: РОССИЯ);
//   * КодАльфа2 - Строка - КодАльфа2 (пример: RU);
//   * КодАльфа3 - Строка - КодАльфа3 (пример: RUS);
//   * Код - Строка - Код (пример: 643);
//   * НаименованиеПолное - Строка - НаименованиеПолное (пример: Российская Федерация);
//   * УчастникЕАЭС - Булево - УчастникЕАЭС (пример: Истина);
//   * Неактуальный - Булево - Неактуальный (пример: Ложь);
//   * МеждународноеНаименование - Строка - Международное наименование (пример: The Russian Federation);
//
Функция КлассификаторСтран() Экспорт
	
	КлючКэш = "КлассификаторСтран";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	КлассификаторXML = МакетОбработки("КлассификаторСтран").ПолучитьТекст();
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(КлассификаторXML);
	Результат = СериализаторXDTO.ПрочитатьXML(Чтение);
	
	Для каждого Стр Из Результат Цикл
		Если Не ЗначениеЗаполнено(Стр.НаименованиеПолное) Тогда
			Стр.НаименованиеПолное = Стр.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Сортировать("Наименование");
	Результат.Индексы.Добавить("Код");
	Результат.Индексы.Добавить("КодАльфа2");
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция НаименованияСтранМира() Экспорт
	
	КлючКэш = "НаименованияСтранМира";
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = КлассификаторСтран().ВыгрузитьКолонку("Наименование");
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция СписокСтранМира(КодыСтран = Неопределено) Экспорт
	
	Результат = Новый СписокЗначений;
	
	Для Каждого Стр Из КлассификаторСтран() Цикл
		Если КодыСтран = Неопределено Или МассивСодержитЗначение(КодыСтран, Стр.Код) Тогда
			Результат.Добавить(Стр.Код, Стр.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СписокСтранЕАЭС() Экспорт
	
	Возврат СписокСтранМира(КодыСтранЕАЭС());
	
КонецФункции

Функция КодыСтранЕАЭС() Экспорт
	
	Отбор = Новый Структура("УчастникЕАЭС", Истина);
	
	Результат = Новый Массив;
	Для Каждого Стр Из КлассификаторСтран().НайтиСтроки(Отбор) Цикл
		Результат.Добавить(Стр.Код);
	КонецЦикла;
	
	УдалитьЗначениеИзМассива(Результат, "643");
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеСтраны(КодСтраны) Экспорт
	
	Стр = КлассификаторСтран().Найти(КодСтраны, "Код");
	
	Результат = "";
	Если Стр <> Неопределено Тогда
		Результат = Стр.Наименование;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеСтраныПоКодАльфа2(КодАльфа2) Экспорт
	
	Стр = КлассификаторСтран().Найти(КодАльфа2, "КодАльфа2");
	
	Результат = "";
	Если Стр <> Неопределено Тогда
		Результат = Стр.Наименование;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // КлассификаторСтран

// #Область СлужебныеПроцедурыИФункции

Функция МодульМаркировки()
	
	Возврат ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
КонецФункции

Функция НастройкиМодуля()
	
	Возврат МодульМаркировки().НастройкиМодуля();
	
КонецФункции

// Определяет ИП по длине ИНН
//
// Параметры:
//  ИНН - Строка - ИНН
// 
// Возвращаемое значение:
//  Булево - Истина, если ИНН принадлежит ИП
//
Функция ЭтоИП(ИНН) Экспорт
	
	ДлинаИП = 12;
	
	Возврат СтрДлина(ИНН) = ДлинаИП;
	
КонецФункции

Функция ВсеВидыПродукции(Знач Исключения = Неопределено) Экспорт
	
	КлючКэш = "ВсеВидыПродукции";
	Если ЗначениеЗаполнено(Исключения) Тогда
		КлючКэш = КлючКэш + " за исключением: " + СоединитьСтроку(Исключения, ", ");
	КонецЕсли;
	Результат = Кэш_Прочитать(КлючКэш);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Исключения = Неопределено Тогда
		Исключения = Новый Массив;
	КонецЕсли;
	
	Исключения.Добавить(Перечисления.КонтурМаркировка_ВидыПродукции.Алкоголь);
	Исключения.Добавить(Перечисления.КонтурМаркировка_ВидыПродукции.КабельнаяПродукция);
	Исключения.Добавить(Перечисления.КонтурМаркировка_ВидыПродукции.ЭлектронныеСистемыДоставкиНикотина);
	Исключения.Добавить(Перечисления.КонтурМаркировка_ВидыПродукции.ПромышленноеОборудование);
	Исключения.Добавить(Перечисления.КонтурМаркировка_ВидыПродукции.ДетскоеПитание);
	Исключения.Добавить(Перечисления.КонтурМаркировка_ВидыПродукции.КормовыеДобавки);
	Исключения.Добавить(Перечисления.КонтурМаркировка_ВидыПродукции.НатуральныйМех);
	
	Результат = Новый Массив;
	Для каждого Значение Из Метаданные.Перечисления.КонтурМаркировка_ВидыПродукции.ЗначенияПеречисления Цикл
		ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции[Значение.Имя];
		Если ЗначениеЗаполнено(Исключения) И МассивСодержитЗначение(Исключения, ВидПродукции) Тогда
			Продолжить;
		КонецЕсли;
		Результат.Добавить(ВидПродукции);
	КонецЦикла;
	
	Результат = Новый ФиксированныйМассив(Результат);
	
	Кэш_Поместить(КлючКэш, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция МакетОбработки(ИмяМакета)
	
	Макеты = ЭтотОбъект.Метаданные().Макеты;
	
	Если Макеты.Найти(ИмяМакета) = Неопределено Тогда
		ВызватьИсключение ПараметрыВСтроку(НСтр(
		"ru = 'В составе обработки не найден макет ""%1""'"), ИмяМакета);
	КонецЕсли;
	
	Результат = ЭтотОбъект.ПолучитьМакет(ИмяМакета);
	
	Возврат Результат;
	
КонецФункции

Функция ДатаТаможеннойДекларацииИзСтроки(ДатаДекларацииСтрокой)
	
	Результат = '00010101';
	ДопустимаяДлинаСтроки = 6;
	
	Если СтрДлина(ДатаДекларацииСтрокой) <> ДопустимаяДлинаСтроки
		Или Не ВСтрокеТолькоЦифры(ДатаДекларацииСтрокой) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПозицияДня = 1;
	ПозицияМесяца = 3;
	ПозицияГода = 5;
	ДлинаНомера = 2;
	
	НомерДня = ЧислоИзСтроки(Сред(ДатаДекларацииСтрокой, ПозицияДня, ДлинаНомера));
	НомерМесяца = ЧислоИзСтроки(Сред(ДатаДекларацииСтрокой, ПозицияМесяца, ДлинаНомера));
	НомерГода = ЧислоИзСтроки(Сред(ДатаДекларацииСтрокой, ПозицияГода, ДлинаНомера));
	
	Если ЗначениеЗаполнено(НомерГода)
		И ЗначениеЗаполнено(НомерМесяца)
		И ЗначениеЗаполнено(НомерДня) Тогда
		Результат = Дата(НачалоВека() + НомерГода, НомерМесяца, НомерДня);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует текст с первыми пятью кодами маркировки через запятую,
// если кодов больше, например 8, то добавляет текст "и еще 3"
//
// Параметры:
//  КодыМаркировки - Массив, ТаблицаЗначений - таблица содержит колонку КодМаркировки
// 
// Возвращаемое значение:
//  Строка - текст со списком кодов
//
Функция СписокКодовДляТекстаОшибки(КодыМаркировки) Экспорт
	
	МаксимумКодовВСообщении = 5;
	МассивКодов = Новый Массив;
	ВсегоКодов = КодыМаркировки.Количество();
	
	Для Сч = 1 По Мин(ВсегоКодов, МаксимумКодовВСообщении) Цикл
		
		Элемент = КодыМаркировки[Сч - 1];
		
		Если ТипЗнч(Элемент) = Тип("Строка") Тогда
			КодМаркировки = Элемент;
		Иначе
			КодМаркировки = Элемент.КодМаркировки;
		КонецЕсли;
		
		МассивКодов.Добавить(УдалитьНедопустимыеСимволыXML(КодМаркировки));
		
	КонецЦикла;
	
	Результат = СоединитьСтроку(МассивКодов, ", ");
	
	Если ВсегоКодов > МаксимумКодовВСообщении Тогда
		ЕщеКодов = ВсегоКодов - МаксимумКодовВСообщении;
		СтрокаЕщеКодов = НСтр("ru = 'и еще %1'");
		Результат = Результат + " " + ПараметрыВСтроку(СтрокаЕщеКодов, ЕщеКодов);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ОшибкаЗаполнения(ИмяПоля = "", ИмяТаблицы = "", НомерСтроки = 0) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ИмяПоля", ИмяПоля);
	Результат.Вставить("ИмяТаблицы", ИмяТаблицы);
	Результат.Вставить("НомерСтроки", НомерСтроки);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеТипа_Булево() Экспорт
	
	Возврат Новый ОписаниеТипов("Булево");
	
КонецФункции

Функция ОписаниеТипа_Число(ПараметрыЧисла = Неопределено) Экспорт
	
	Возврат Новый ОписаниеТипов("Число",,, ПараметрыЧисла);
	
КонецФункции

Функция ОписаниеТипа_Число_Положит_10() Экспорт
	
	ЧислоРазрядов = 10;
	ЧислоРазрядовДробнойЧасти = 0;
	
	ПараметрыЧисла = Новый КвалификаторыЧисла(ЧислоРазрядов, ЧислоРазрядовДробнойЧасти, ДопустимыйЗнак.Неотрицательный);
	
	Возврат ОписаниеТипа_Число(ПараметрыЧисла);
	
КонецФункции

Функция ОписаниеТипа_Число_Положит_15_6() Экспорт
	
	ЧислоРазрядов = 15;
	ЧислоРазрядовДробнойЧасти = 6;
	
	ПараметрыЧисла = Новый КвалификаторыЧисла(ЧислоРазрядов, ЧислоРазрядовДробнойЧасти, ДопустимыйЗнак.Неотрицательный);
	
	Возврат ОписаниеТипа_Число(ПараметрыЧисла);
	
КонецФункции

Функция ОписаниеТипа_Строка(Знач ДлинаСтроки = Неопределено) Экспорт
	
	Если ДлинаСтроки = Неопределено Тогда
		ДлинаСтроки = 1024;
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(ДлинаСтроки));
	
КонецФункции

Функция ОписаниеТипа_Строка50() Экспорт
	
	Длина = 50;
	
	Возврат ОписаниеТипа_Строка(Длина);
	
КонецФункции

Функция ОписаниеТипа_Строка100() Экспорт
	
	Длина = 100;
	
	Возврат ОписаниеТипа_Строка(Длина);
	
КонецФункции

Функция ОписаниеТипа_ВидПродукции() Экспорт
	
	Возврат Новый ОписаниеТипов("ПеречислениеСсылка.КонтурМаркировка_ВидыПродукции");
	
КонецФункции

Функция ТекстСообщения_ОшибкаВнутреннееПеремещение() Экспорт
	
	Возврат НСтр("ru = 'Внутреннее перемещение недоступно для вида продукции: %1'");
	
КонецФункции

Функция ТекстСообщения_НеРазрешенОСУ() Экспорт
	
	Возврат НСтр("ru = 'Запрещена отгрузка товара в объемно-сортовом учете, GTIN: %1'");
	
КонецФункции

Функция ТекстСообщения_НеРазрешенПартионныйУчет() Экспорт
	
	Возврат НСтр("ru = 'Запрещена отгрузка товара в партионном учете, GTIN: %1'");
	
КонецФункции

Функция ТекстСообщения_НеЗаполненНомерПартии() Экспорт
	
	Возврат НСтр("ru = 'Требуется заполнить номер партии для товаров: %1'");
	
КонецФункции

Функция ТекстСообщения_НеЗаполненВесПартии() Экспорт
	
	Возврат НСтр("ru = 'Требуется заполнить вес партии для товаров: %1'");
	
КонецФункции

Функция ТекстПодсказки_ТоварПодлежитПартионномуУчету(Товар)
	
	ВидыПродукции = Перечисление_ВидыПродукции();
	ФичаФлаги = Перечисление_ФичаФлаги();
	
	ТекстПодсказки = "ru = """
	+ "Товары %1 подлежат партионному учету. Выберите Отражение в ЭДО """"Партионный учет"""" "
	+ "и укажите номера партий или продолжите работу без учета партий по ОСУ""";
	ШаблонТекста = НСтр(ТекстПодсказки, "ru");
	ДопТекст = Новый Массив;
	
	Если Товар.ВидПродукции = ВидыПродукции.Молоко Тогда
		ДопТекст.Добавить(НСтр("ru='молочной продукции'"));
		Если Не ФичаФлагВключен(ФичаФлаги.ПартионныйУчетМолокоСрокХраненияДо40Суток) Тогда
			ДопТекст.Добавить(НСтр("ru='со сроком хранения свыше 40 суток'"));
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыВСтроку(ШаблонТекста, СоединитьСтроку(ДопТекст, " "));
	
КонецФункции

// #КонецОбласти // СлужебныеПроцедурыИФункции

// #Область МетодыОбщегоНазначения

Функция МодульОбщегоНазначения()
	
	Возврат Вычислить("ОбщегоНазначенияКонтурМаркировка");
	
КонецФункции

// Проверяет что значение заполнено,
// мутабельное значение считается заполненным
//
// Параметры:
//  Значение - Произвольное - значение, которое нужно проверить
// 
// Возвращаемое значение:
//  Булево - Истина, если значение есть
//
Функция ЕстьЗначение(Значение)
	
	Попытка
		Результат = ЗначениеЗаполнено(Значение);
	Исключение
		Результат = Истина; // Мутабельное значение
		Ошибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначенияРеквизитовОбъектаЛок(Ссылка, Реквизиты) Экспорт
	
	Результат = Новый Структура;
	
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		СтруктураРеквизитов = Новый Структура(Реквизиты);
	ИначеЕсли ЭтоСтруктура(Реквизиты) Тогда
		СтруктураРеквизитов = Реквизиты;
	ИначеЕсли ЭтоМассив(Реквизиты) Тогда
		СтруктураРеквизитов = Новый Структура;
		Для каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(Реквизит);
		КонецЦикла;
	Иначе
		ВызватьИсключение ПараметрыВСтроку(
		НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"),
		ТипЗнч(Реквизиты));
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекстПолей = "";
	Разделитель = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			ИмяПоля = СокрЛП(КлючИЗначение.Значение);
		Иначе
			ИмяПоля = СокрЛП(КлючИЗначение.Ключ);
		КонецЕсли;
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		ТекстПолей = ТекстПолей + Разделитель + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
		Разделитель = ",";
	КонецЦикла;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ТекстПолей КАК ТекстПолей
	|ИЗ
	|	&ИмяТаблицы
	|ГДЕ
	|	Ссылка = &Ссылка";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстПолей КАК ТекстПолей", ТекстПолей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицы", Ссылка.Метаданные().ПолноеИмя());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеРеквизитаОбъектаЛок(Ссылка, ИмяРеквизита)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СтруктураРеквизита = ЗначенияРеквизитовОбъектаЛок(Ссылка, ИмяРеквизита);
		Если ЗначениеЗаполнено(СтруктураРеквизита) Тогда
			Результат = СтруктураРеквизита[ИмяРеквизита];
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет что значение есть в структуре
//
// Параметры:
//  Структура - Структура - структура, в котором нужно найти значение;
//  Значение - Произвольный - значение, которое нужно найти в массиве;
// 
// Возвращаемое значение:
//  Булево - Истина, если значение есть в массиве
//
Функция ЕстьЗначениеВСтруктуре(Структура, Значение)
	
	Для Каждого КлючИЗначение Из Структура Цикл
		Если КлючИЗначение.Значение = Значение Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Безопасно читает свойство структуры
// 
// Параметры:
//  Структура - Структура - структура;
//  Ключ      - Строка  - ключ;
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается,
//                                   если в структуре нет такого ключа;
// 
// Возвращаемое значение:
//   Произвольный - значение свойства
//
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Возврат МодульОбщегоНазначения().СвойствоОбъекта(Структура, Ключ, ЗначениеПоУмолчанию);
	
КонецФункции

// Безопасно читает по ключу значение соответствия
// или значение по умолчанию, если в соответствии нет такого ключа
// 
// Параметры:
//  Соответствие        - Соответствие - соответствие источник;
//  Ключ                - Произвольный - ключ соответствия;
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае,
//                                       если в соответствии нет указанного ключа;
// 
// Возвращаемое значение:
//  Произвольный - значение из соответствия или ЗначениеПоУмолчанию
//
Функция ЗначениеСоответствия(Соответствие, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Попытка
		Результат = Соответствие[Ключ];
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Если Результат = Неопределено Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Дополняет структуру или соответсвие приемник из данных источника
//
// Параметры:
//  Приемник - Структура, Соответствие
//  Источник - Структура, Соответствие
//
Процедура ДополнитьСтруктуру(Приемник, Источник)
	
	Для Каждого КлючИЗначение Из Источник Цикл
		Приемник.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

// Безопасно заполняет поля структуры значениями из другой структуры
// Пустые значения источника при этом игнорируются
//
// Параметры:
//  Приемник - Структура - структура, которую надо заполнить;
//  Источник - Структура, ФиксированнаяСтруктура - структура, из которой надо взять значения;
//  СписокСвойств    - Строка - (необязательный) список имен свойств, разделенный запятыми,
//                     которые необходимо заполнить, ошибки не будет если таких свойств нет;
//  ИсключаяСвойства - Строка - (необязательный) список имен свойств, разделенный запятыми,
//                     которые заполнять не нужно, ошибки не будет если таких свойств нет;
//  Рекурсивно - Булево - (необязательный) Истина, если необходимо заполнить вложенные структуры;
//
Процедура ЗаполнитьПоляСтруктуры(Приемник, Источник, СписокСвойств = "", ИсключаяСвойства = "", Рекурсивно = Ложь)
	
	Если Не ЭтоСтруктура(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеСвойства = РазделитьСтроку(НРег(СписокСвойств));
	ИсключаемыеСвойства = РазделитьСтроку(НРег(ИсключаяСвойства));
	
	ЕстьЗаполняемыеСвойства = ЗначениеЗаполнено(ЗаполняемыеСвойства);
	ЕстьИсключаемыеСвойства = ЗначениеЗаполнено(ИсключаемыеСвойства);
	
	Для каждого Элемент Из Источник Цикл
		
		Ключ = Элемент.Ключ;
		Значение = Элемент.Значение;
		
		Если Не Приемник.Свойство(Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЕстьЗначение(Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЕстьЗаполняемыеСвойства
			И ЗаполняемыеСвойства.Найти(НРег(Ключ)) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЕстьИсключаемыеСвойства
			И ИсключаемыеСвойства.Найти(НРег(Ключ)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Рекурсивно И ЭтоСтруктура(Значение) И ЭтоСтруктура(Приемник[Ключ]) Тогда
			ЗаполнитьПоляСтруктуры(Приемник[Ключ], Значение, СписокСвойств, ИсключаяСвойства, Рекурсивно);
		Иначе
			Приемник[Ключ] = Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыВСтроку(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено)
	
	Возврат МодульОбщегоНазначения().ПараметрыВСтроку(ШаблонСтроки
	, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5);
	
КонецФункции

// Соединяет части в одну строку с указанным разделителем
// По аналогии с методом платформы СтрСоединить
// 
// Параметры:
//  ЧастиСтроки - Массив - части строки;
//  Разделитель - Строка - (необязательный) разделитель строк;
//
// Возвращаемое значение:
//  Строка - строка состоящая из всех частей
//
Функция СоединитьСтроку(ЧастиСтроки, Разделитель = "")
	
	Возврат МодульОбщегоНазначения().СоединитьСтроку(ЧастиСтроки, Разделитель);
	
КонецФункции

// Разделяет текст на части по указанному разделителю
//
// Параметры:
//  Строка - Строка - разделяемый текст;
//  Разделитель - Строка - (необязательный) значение разделителя;
//  ВключатьПустые - Булево - Истина, если пустые части нужно включить в результат;
// 
// Возвращаемое значение:
//  Массив - содержит части текста
//
Функция РазделитьСтроку(Строка, Разделитель = ",", ВключатьПустые = Ложь)
	
	Возврат МодульОбщегоНазначения().РазделитьСтроку(Строка, Разделитель, ВключатьПустые);
	
КонецФункции

// Определяет, является ли значение массивом
// или фиксированным массивом
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить
// 
// Возвращаемое значение:
//  Булево - Истина, если переданое значение является структрой или фиксированной структурой
//
Функция ЭтоМассив(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Массив")
		Или ТипЗначения = Тип("ФиксированныйМассив") Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение структурой
// или фиксированной структурой
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить
// 
// Возвращаемое значение:
//  Булево - Истина, если переданое значение является структрой или фиксированной структурой
//
Функция ЭтоСтруктура(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура")
		Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение в массиве
//
// Параметры:
//  Значение - Произвольный - значение
//
// Возвращаемое значение:
//  Массив
Функция ЗначениеВМассиве(Значение)
	
	Если ЭтоМассив(Значение) Тогда
		Результат = Значение;
	Иначе
		Результат = Новый Массив;
		Результат.Добавить(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет что значение есть в массиве
//
// Параметры:
//  Массив - Массив - массив, в котором нужно найти значение;
//  Значение - Произвольный - значение, которое нужно найти в массиве;
// 
// Возвращаемое значение:
//  Булево - Истина, если значение есть в массиве
//
Функция МассивСодержитЗначение(Массив, Значение)
	
	Возврат Массив.Найти(Значение) <> Неопределено;
	
КонецФункции

// Выгружает значения структуры в массив
//
// Параметры:
//  Структура - Структура - структура
// 
// Возвращаемое значение:
//  Массив
//
Функция МассивЗначенийИзСтруктуры(Структура)
	
	Результат = Новый Массив;
	
	Для каждого Элемент Из Структура Цикл
		Результат.Добавить(Элемент.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Дополняет массив значениями из другого массива
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения;
//  МассивИсточник - Массив - массив, из которого нужно взять значения;
//  ТолькоНовыеЗначения - Булево - (необязательный) Истина, если в приемник нужно добавить только новые значения;
//  ДобавлятьПустыеЗначения - Булево - (необязательный) Ложь, если пустые значения в приемник добавлять не нужно;
//
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник
	, ТолькоНовыеЗначения = Ложь
	, ДобавлятьПустыеЗначения = Истина)
	
	Если ТолькоНовыеЗначения Тогда
		
		ЗначенияПриемника = Новый Соответствие;
		Для Каждого Значение Из МассивПриемник Цикл
			ЗначенияПриемника.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если Не ДобавлятьПустыеЗначения
				И Не ЗначениеЗаполнено(Значение) Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначенияПриемника[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				ЗначенияПриемника.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет значение в массив, если его там еще нет
//
// Параметры:
//  Массив - Массив - массив, в который нужно добавить значение;
//  Значение - Значение - значение, которое нужно добавить;
//
Процедура ДобавитьЗначениеВМассив(Массив, Значение)
	
	Если Не МассивСодержитЗначение(Массив, Значение) Тогда
		Массив.Добавить(Значение);
	КонецЕсли;
	
КонецПроцедуры

// Удаляет значение из массива, если оно в нем есть
//
// Параметры:
//  Массив - Массив - массив, из которого нужно удалить значение;
//  Значение - Значение - значение, которое нужно удалить;
//
Процедура УдалитьЗначениеИзМассива(Массив, Значение)
	
	ИндексЗначения = Массив.Найти(Значение);
	Пока ИндексЗначения <> Неопределено Цикл
		Массив.Удалить(ИндексЗначения);
		ИндексЗначения = Массив.Найти(Значение);
	КонецЦикла;
	
КонецПроцедуры

// Оставляет в массиве только уникальные значения
//
// Параметры:
//  Массив - Массив - массив;
//  УдалитьПустыеЗначения - Булево - (необязательный) Истина, если нужно удалить пустые значения;
//
Процедура СвернутьМассивЛок(Массив, УдалитьПустыеЗначения = Ложь)
	
	Результат = Новый Массив;
	
	ДополнитьМассив(Результат, Массив, Истина, Не УдалитьПустыеЗначения);
	
	Массив = Результат;
	
КонецПроцедуры

Функция СтрокаПустогоИдентификатора()
	
	Возврат "00000000-0000-0000-0000-000000000000";
	
КонецФункции

Функция ВерсияПлатформыНиже(Версия)
	
	Возврат МодульОбщегоНазначения().ВерсияПлатформыНиже(Версия);
	
КонецФункции

Функция НачалоВека()
	
	Возврат 2000;
	
КонецФункции

Функция ЧислоИзСтроки(Строка) Экспорт
	
	Если Не ЗначениеЗаполнено(Строка) Тогда
		Возврат 0;
	КонецЕсли;
	
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	ДлинаСтроки = СтрДлина(Строка);
	ЧислоСтрокой = "";
	ЕстьРазделитель = Ложь;
	
	Для Сч = 1 По ДлинаСтроки Цикл
		Символ = Сред(Строка, Сч, 1);
		Если Не ЕстьРазделитель И (Символ = "," Или Символ = ".") Тогда
			ЧислоСтрокой = ЧислоСтрокой + Символ;
			ЕстьРазделитель = Истина;
			Продолжить;
		КонецЕсли;
		КодСимвола = КодСимвола(Символ);
		Если КодСимвола >= КодСимвола0
			И КодСимвола <= КодСимвола9 Тогда
			ЧислоСтрокой = ЧислоСтрокой + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Результат = ОписаниеТипа_Число().ПривестиЗначение(ЧислоСтрокой);
	
	Возврат Результат;
	
КонецФункции

Функция ВсеЦифры() Экспорт
	
	Возврат "0123456789";
	
КонецФункции

Функция ВсеБуквыКириллицы() Экспорт
	
	// BSLLS:Typo-off
	Возврат "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	// BSLLS:Typo-on
	
КонецФункции

Функция ВсеБуквыЛатиницы() Экспорт
	
	Возврат "abcdefghijklmnopqrstuvwxyz";
	
КонецФункции

Функция ВсеСпецСимволы() Экспорт
	
	Возврат "%&'""()*+,-_./:;<=>?!";
	
КонецФункции

Функция УдалитьНедопустимыеСимволыXML(Строка)
	
	Результат = Строка(Строка);
	
	Пока Истина Цикл
		Поз = НайтиНедопустимыеСимволыXML(Результат);
		Если Поз = 0 Тогда
			Прервать;
		КонецЕсли;
		Результат = Лев(Результат, Поз - 1) + Сред(Результат, Поз + 1);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция КаноническийИдентификаторИзСтроки(Строка)
	
	Если Не ЗначениеЗаполнено(Строка)  Тогда
		Возврат СтрокаПустогоИдентификатора();
	КонецЕсли;
	
	ЗначимаяЧастьСтроки = СтрЗаменить(Строка, "-", "");
	ДлинаИдентификатора = 36;
	
	// BSLLS:MagicNumber-off
	Блок1 = Сред(ЗначимаяЧастьСтроки, 1, 8);
	Блок2 = Сред(ЗначимаяЧастьСтроки, 9, 4);
	Блок3 = Сред(ЗначимаяЧастьСтроки, 13, 4);
	Блок4 = Сред(ЗначимаяЧастьСтроки, 17, 4);
	Блок5 = Сред(ЗначимаяЧастьСтроки, 21, 12);
	// BSLLS:MagicNumber-on
	
	Результат = ПараметрыВСтроку("%1-%2-%3-%4-%5", Блок1, Блок2, Блок3, Блок4, Блок5);
	
	ЗначимаяЧастьРезультата = СтрЗаменить(Результат, "-", "");
	
	Если СтрДлина(Результат) < ДлинаИдентификатора Или ЗначимаяЧастьРезультата <> ЗначимаяЧастьСтроки Тогда
		ВызватьИсключение ПараметрыВСтроку(НСтр(
		"ru = 'Не удалось сформировать канонический идентификатор из строки: %1'"), Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВСтрокеТолькоЦифры(Строка)
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Если ДлинаСтроки = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Результат = Истина;
	
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	
	Для Сч = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Строка, Сч);
		
		Если КодСимвола < КодСимвола0
			Или КодСимвола > КодСимвола9 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаСодержитТолькоДопустимыеСимволы(Строка, ДопустимыеСимволы) Экспорт
	
	Для Позиция = 1 По СтрДлина(Строка) Цикл
		ТекущийСимвол = НРег(Сред(Строка, Позиция, 1));
		Если Найти(ДопустимыеСимволы, ТекущийСимвол) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ДлинаДробнойЧасти(Число) Экспорт
	
	ДробнаяЧасть = Число - Цел(Число);
	
	Если Не ЗначениеЗаполнено(ДробнаяЧасть) Тогда
		Возврат 0;
	КонецЕсли;
	
	НольИЗапятая = 2;
	
	Возврат СтрДлина(ДробнаяЧасть) - НольИЗапятая;
	
КонецФункции

// #КонецОбласти // МетодыОбщегоНазначения

// #Область КэшНаСервере

Функция Кэш_Прочитать(Ключ)
	
	Если КэшНаСервере = Неопределено Тогда
		КэшНаСервере = Новый Соответствие;
	КонецЕсли;
	
	Результат = КэшНаСервере[Ключ];
	
	Возврат Результат;
	
КонецФункции

Процедура Кэш_Очистить() Экспорт
	
	Если ЗначениеЗаполнено(КэшНаСервере) Тогда
		КэшНаСервере.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура Кэш_Поместить(Ключ, Значение)
	
	Если КэшНаСервере = Неопределено Тогда
		КэшНаСервере = Новый Соответствие;
	КонецЕсли;
	
	КэшНаСервере.Вставить(Ключ, Значение);
	
КонецПроцедуры

// #КонецОбласти
