
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	УстановитьУсловноеОформление();
	НастроитьЭлементыОграниченияПоТарифу();
	
	МодульОбъекта().Метрика_ОткрытиеФормыСостоянияМаркировки(УникальныйИдентификатор, Организация, ТипБаннера, ВызывающийМодуль);
	МодульОбъекта().Метрика_Функциональность_ОткрытиеФормыСостоянияМаркировки(Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСостояниеМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы = Ложь)
	
	Если Модифицированность И Не ЗавершениеРаботы Тогда
		Модифицированность = Ложь;
		Оповестить("КонтурМаркировка_ОбновитьСведенияОМаркировке", Документы1С.ВыгрузитьЗначения());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_ЗапущенОбменССервисом" Тогда
		ПроверитьСостояниеОбменаССервисом();
		ОбновитьСсылкуТребуетсяПодписать();
	КонецЕсли;
	
	СобытияОбновленияМаркировки = Новый Массив;
	СобытияОбновленияМаркировки.Добавить("КонтурМаркировка_Операция_Изменен");
	СобытияОбновленияМаркировки.Добавить("КонтурМаркировка_ДокументУчета_Изменен");
	СобытияОбновленияМаркировки.Добавить("КонтурМаркировка_ДокументУчета_Удален");
	СобытияОбновленияМаркировки.Добавить("КонтурМаркировка_ДокументУчета_Перезаполнен");
	Если МодульКлиента().МассивСодержитЗначение(СобытияОбновленияМаркировки, ИмяСобытия) Тогда
		ОбновитьСостояниеМаркировки();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ЗапуститьОбменССервисом();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСостояниеМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура Поддержка(Команда)
	
	МодульКлиента().ОткрытьЦентрПоддержки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправить(Команда)
	
	МодульКлиента().ОткрытьФормуПодписанияИОтправки(ЭтаФорма, Организация, ВсеДокументыУчета());
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СсылкаПодробнееОТарифахНажатие(Элемент)
	
	МодульКлиента().ОткрытьИнформациюОТарифах();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеМаркировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СостояниеМаркировки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		ОткрытьФормуДокументаУчета(ТекущиеДанные);
	Иначе
		Если Поле.Имя = "СостояниеМаркировкиТребуемоеДействиеПредставление" И ТекущиеДанные.ЭтоГиперссылка Тогда
			ОбработатьТребуемоеДействиеСостояния(Родитель, ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область НастройкаЭлементовФормы

&НаСервере
Процедура НастроитьЭлементыОграниченияПоТарифу()
	
	ОписаниеТарифа = МодульОбъекта().Тариф(Организация);
	
	ПоказатьБаннерОЗавершенииПодписки(ОписаниеТарифа);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерОЗавершенииПодписки(ОписаниеТарифа)
	
	ТекДата = НачалоДня(ТекущаяДатаСеанса());
	ДатаОкончания = ОписаниеТарифа.ДатаОкончания;
	КоличествоДней = 40;
	ПериодПредупреждения = КоличествоДней * МодульОбъекта().СекундВСутках();
	ДатаНачалаПредупреждения = ДатаОкончания - ПериодПредупреждения;
	
	Если Не ЗначениеЗаполнено(ДатаОкончания)
		Или ТекДата < ДатаНачалаПредупреждения Тогда
		Элементы.ГруппаИнформацияОТарифе.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ТипБаннера = "";
	
	Если ТекДата > ДатаОкончания Тогда
		
		ЦветБаннера = МодульОбъекта().ЦветБаннераОплаченныйПериодЗакончился();
		// BSLLS:LineLength-off
		ТекстБаннера = НСтр("ru = 'Закончился оплаченный период. Чтобы восстановить доступ к сервису выберите тариф, оплатите на сайте и продолжайте пользоваться Контур.Маркировкой.'");
		// BSLLS:LineLength-on
		ТипБаннера = НСтр("ru = 'Баннер период закончился'");
		
	Иначе
		
		ЦветБаннера = МодульОбъекта().ЦветБаннераОплаченныйПериодЗаканчивается();
		// BSLLS:LineLength-off
		ТекстБаннера = НСтр("ru = 'Оплаченный период заканчивается %1. Выберите тариф, оплатите на сайте и продолжайте пользоваться Контур.Маркировкой.'");
		ТекстБаннера = МодульОбъекта().ПараметрыВСтроку(ТекстБаннера, Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"));
		// BSLLS:LineLength-on
		ТипБаннера = НСтр("ru = 'Баннер период заканчивается'");
		
	КонецЕсли;
	
	Если Не МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
		Элементы.ГруппаИнформацияОТарифе.ЦветФона = ЦветБаннера;
	КонецЕсли;
	
	Элементы.ТекстИнформацииПоПодписке.Заголовок = ТекстБаннера;
	Элементы.ГруппаИнформацияОТарифе.Видимость = Истина;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ДопИнформацияСтатусов = МодульОбъекта().Перечисление_ДопИнформацияСтатусовПроверкиКодовДокумента();
	
	ПутьКДанным = Элементы.СостояниеМаркировки.ПутьКДанным;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ПутьКДанным + "ТребуемоеДействиеПредставление");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", МодульОбъекта().ЦветГиперСсылки());
	Условие = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКДанным + ".ЭтоГиперссылка");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ПутьКДанным + "ТребуемоеДействиеПредставление");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	Условие = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКДанным + ".ВыполняетсяПроверка");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ПутьКДанным + "Состояние");
	Условие = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКДанным + ".ЭтоПредупреждение");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ПутьКДанным + "Статус");
	Условие = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКДанным + ".Статус");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = ДопИнформацияСтатусов.ЕстьОшибкиКодов;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	МодульОбъекта().СвернутьМассивЛок(Параметры.Документы1С);
	
	Для Каждого Документ1С Из Параметры.Документы1С Цикл
		
		Если Не МодульОбъекта().ДокументДопустимВМаркировке(Документ1С) Тогда
			Продолжить;
		КонецЕсли;
		
		Документы1С.Добавить(Документ1С);
		
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Организация = МодульОбъекта().Организация_НайтиПоДокументу1С(Документ1С);
		КонецЕсли;
		
	КонецЦикла;
	
	Параметры.Свойство("ВызывающийМодуль", ВызывающийМодуль);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостояниеМаркировки()
	
	Если Не ЗначениеЗаполнено(Документы1С) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапомнитьТекущуюСтрокуСостоянияМаркировки();
	
	Дерево = РеквизитФормыВЗначение("СостояниеМаркировки");
	МодульОбъекта().СостояниеМаркировки_Заполнить(Дерево, Документы1С.ВыгрузитьЗначения(), Организация);
	ЗначениеВРеквизитФормы(Дерево, "СостояниеМаркировки");
	
	ОбновитьМодифицированностьСостоянияМаркировки();
	
	УстановитьТекущуюСтрокуСостоянияМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеМаркировки()
	
	ЗаполнитьСостояниеМаркировки();
	РазвернутьДеревоСостоянияМаркировки();
	ОбновитьСсылкуТребуетсяПодписать();
	НастроитьЭлементыОграниченияПоТарифу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеМаркировкиПослеВыполненияКоманды(Результат, ДопПараметры = Неопределено) Экспорт
	
	ОбновитьСостояниеМаркировки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтрокуСостоянияМаркировки()
	
	Стр = СостояниеМаркировки_НайтиСтроку(ТекущийДокументУчета, ТекущееСостояние, ТекущаяОперация);
	
	Если Стр <> Неопределено Тогда
		Элементы.СостояниеМаркировки.ТекущаяСтрока = Стр.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьТекущуюСтрокуСостоянияМаркировки()
	
	ТекущаяОперация = Неопределено;
	ТекущееСостояние = Неопределено;
	ТекущийДокументУчета = Неопределено;
	
	ТекущаяСтрока = Элементы.СостояниеМаркировки.ТекущаяСтрока;
	Если Не ЗначениеЗаполнено(ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = СостояниеМаркировки.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаДокумента = ТекущиеДанные.ПолучитьРодителя();
	
	Если СтрокаДокумента = Неопределено Тогда
		ТекущийДокументУчета = ТекущиеДанные.ДокументУчета;
	Иначе
		ТекущаяОперация = ТекущиеДанные.Операция;
		ТекущееСостояние = ТекущиеДанные.Состояние;
		ТекущийДокументУчета = СтрокаДокумента.ДокументУчета;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьМодифицированностьСостоянияМаркировки()
	
	Дерево = РеквизитФормыВЗначение("СостояниеМаркировки");
	НовоеСостояниеМаркировки = ЗначениеВСтрокуВнутр(Дерево);
	
	Если ЕстьСтароеСостояниеМаркировки
		И НовоеСостояниеМаркировки <> СтароеСостояниеМаркировки Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	СтароеСостояниеМаркировки = НовоеСостояниеМаркировки;
	ЕстьСтароеСостояниеМаркировки = ЗначениеЗаполнено(Дерево.Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбменССервисом()
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	МассивДокументов = ВсеДокументыУчета();
	
	Если МодульКлиента().ОчередьОбмена_ЕстьФайлыДляПодписи(Организация, МассивДокументов) Тогда
		МодульКлиента().ОткрытьФормуПодписанияИОтправки(ЭтаФорма, Организация, МассивДокументов);
		ОбновитьСсылкуТребуетсяПодписать();
	Иначе
		МодульКлиента().ЗапуститьОбменПоОрганизации(ЭтаФорма, Организация, МассивДокументов);
		ПроверитьСостояниеОбменаССервисом();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОбновлениеСтатусовИПроверкуКодов(ДокументУчета)
	
	Если Не МодульОбъекта().КодыДокументов_ЕстьКоды(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыНаПроверкеКодов.Добавить(ДокументУчета);
	
	МодульОбъекта().ЗапуститьОбновлениеСтатусовКодовДокумента(ДокументУчета);
	
	ОбновитьСостояниеПроверкиКодов(ДокументУчета, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыКодовИВыполнитьПроверку(ДокументУчета)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьОбновлениеСтатусовИПроверкуКодов(ДокументУчета);
	
	ПроверитьСостояниеОбновленияСтатусовКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСостояниеОбменаССервисом()
	
	ОбменССервисомВыполняется = МодульКлиента().ОбменССервисомВыполняется(УникальныйИдентификатор);
	
	МодульКлиента().НастроитьКнопкуОбменаССервисом(Элементы.Кнопка_ВыполнитьОбмен, ОбменССервисомВыполняется);
	
	Если ОбменССервисомВыполняется Тогда
		ЗапуститьОбработчик("ПроверитьСостояниеОбменаССервисом");
	Иначе
		ОбновитьСостояниеМаркировки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСостояниеОбновленияСтатусовКодов()
	
	Если ОбновлениеСтатусовКодовВыполняется() Тогда
		ЗапуститьОбработчик("ПроверитьСостояниеОбновленияСтатусовКодов");
	Иначе
		ПроверитьСостояниеПроверкиКодов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСостояниеПроверкиКодов()
	
	Если ПроверкаКодовВыполняется() Тогда
		ЗапуститьОбработчик("ПроверитьСостояниеПроверкиКодов");
	Иначе
		ОбновитьСостояниеМаркировки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбработчик(Обработчик)
	
	ИнтервалОжидания = 5;
	ПодключитьОбработчикОжидания(Обработчик, ИнтервалОжидания, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСсылкуТребуетсяПодписать()
	
	КоличествоОперацийТребуетсяПодписать = 0;
	
	МассивДокументов = ВсеДокументыУчета();
	Если ЗначениеЗаполнено(МассивДокументов) Тогда
		КоличествоОперацийТребуетсяПодписать = МодульОбъекта().ОчередьОбмена_КоличествоОперацийТребуетсяПодписать(Организация, МассивДокументов);
	КонецЕсли;
	
	МодульОбъекта().НастроитьСсылкуТребуетсяПодписать(Элементы.Ссылка_ТребуетсяПодписать, КоличествоОперацийТребуетсяПодписать);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеПроверкиКодов(ДокументУчета, ПроверкаВыполняется)
	
	Состояния = МодульОбъекта().Перечисление_СостоянияМаркировки();
	Действия = МодульОбъекта().Перечисление_ТребуемыеДействияСостоянийМаркировки();
	
	ДопустимыеСостояния = Новый Массив;
	ДопустимыеСостояния.Добавить(Состояния.ОжидаетсяПроверка);
	ДопустимыеСостояния.Добавить(Состояния.РезультатПроверки);
	СтрСост = СостояниеМаркировки_НайтиСтроку(ДокументУчета, ДопустимыеСостояния);
	
	Если СтрСост = Неопределено Тогда
		ДокументыНаПроверкеКодов.Удалить(ДокументыНаПроверкеКодов.НайтиПоЗначению(ДокументУчета));
		Возврат;
	КонецЕсли;
	
	СтрСост.ВыполняетсяПроверка = ПроверкаВыполняется;
	Если СтрСост.ВыполняетсяПроверка Тогда
		СтрСост.ТребуемоеДействиеСостояния = Действия.ВыполняетсяПроверкаКодов;
	Иначе
		СтрСост.ТребуемоеДействиеСостояния = Действия.ВыполнитьПроверку;
		ДокументыНаПроверкеКодов.Удалить(ДокументыНаПроверкеКодов.НайтиПоЗначению(ДокументУчета));
	КонецЕсли;
	
	СтрСост.ТребуемоеДействиеПредставление = СтрСост.ТребуемоеДействиеСостояния;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьТребуемоеДействиеСостояния(СтрокаДокумента, ТекущиеДанные)
	
	Если ТекущиеДанные.ВыполняетсяПроверка Тогда
		Возврат;
	КонецЕсли;
	
	ТребуемыеДействия = МодульКлиента().Перечисление_ТребуемыеДействияСостоянийМаркировки();
	ДействияМетрик = МодульКлиента().Перечисление_ДействияМетрики();
	
	Операция = ТекущиеДанные.Операция;
	Документ1С = СтрокаДокумента.Документ1С;
	ДокументУчета = СтрокаДокумента.ДокументУчета;
	ТребуемоеДействие = ТекущиеДанные.ТребуемоеДействиеСостояния;
	
	Действие = "";
	
	Если ЗначениеЗаполнено(Операция) Тогда
		
		ПослеЗакрытия = ОбработчикОповещенияОбновитьСостояниеМаркировки();
		МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма, ПослеЗакрытия);
		
		Действие = ДействияМетрик.ОткрытьОперацию;
		
	ИначеЕсли ТребуемоеДействие = ТребуемыеДействия.ВыполняетсяПроверкаКодов Тогда
		
		Возврат;
		
	ИначеЕсли ТребуемоеДействие = ТребуемыеДействия.НаполнитьКодами Тогда
		
		НаполнитьДокументУчетаКодами(ДокументУчета);
		
		Действие = ДействияМетрик.НаполнитьКодами;
		
	ИначеЕсли ТребуемоеДействие = ТребуемыеДействия.НачатьРаботу Тогда
		
		Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
			ДокументУчета = МодульКлиента().ДокументУчета_НайтиИлиСоздать(Документ1С, ЭтаФорма);
		КонецЕсли;
		
		Если Не ПроверитьДокументУчетаНаСервере(ДокументУчета) Тогда
			ДействиеПриОткрытии = "ПроверитьЗаполнениеПолей";
			ПослеЗакрытия = ОбработчикОповещенияОбновитьСостояниеМаркировки();
			МодульКлиента().ОткрытьФормуДокументаУчета(ДокументУчета, ЭтаФорма, ПослеЗакрытия, ДействиеПриОткрытии);
		Иначе
			СоздатьДокументУчетаИНачатьРаботу(Документ1С);
			ОбновитьСостояниеМаркировки();
		КонецЕсли;
		
		Действие = ДействияМетрик.НачатьРаботу;
		
	ИначеЕсли ТребуемоеДействие = ТребуемыеДействия.ОтчитатьсяОНанесении Тогда
		
		ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ОтчетОНанесении;
		МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, ДокументУчета,,, ЭтаФорма);
		
		Действие = ДействияМетрик.ОтчитатьсяОНанесении;
		
	ИначеЕсли ТребуемоеДействие = ТребуемыеДействия.ВвестиВОборот Тогда
		
		ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ВводВОборот;
		МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, ДокументУчета,,, ЭтаФорма);
		
		Действие = ДействияМетрик.ВвестиВОборот;
		
	ИначеЕсли ТребуемоеДействие = ТребуемыеДействия.НапечататьЭтикетки Тогда
		
		ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ПечатьКодов;
		МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, ДокументУчета,,, ЭтаФорма);
		
		Действие = ДействияМетрик.НапечататьЭтикетки;
		
	ИначеЕсли ТребуемоеДействие = ТребуемыеДействия.ЗавершитьРаботу Тогда
		
		Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗавершитьРаботуСДокументом(ДокументУчета) Тогда
			ОбновитьСостояниеМаркировки();
		Иначе
			ДействиеПриОткрытии = "ПроверитьВозможностьЗавершитьРаботу";
			ПослеЗакрытия = ОбработчикОповещенияОбновитьСостояниеМаркировки();
			МодульКлиента().ОткрытьФормуДокументаУчета(ДокументУчета, ЭтаФорма, ПослеЗакрытия, ДействиеПриОткрытии);
		КонецЕсли;
		
		Действие = ДействияМетрик.ЗавершитьРаботу;
		
	ИначеЕсли ТребуемоеДействие = ТребуемыеДействия.УказатьРольДокумента Тогда
		
		Настройка = НастройкиДокументовУчета_НайтиПоТипуДокумента(ДокументУчета);
		ПослеЗакрытия = ОбработчикОповещенияОбновитьСостояниеМаркировки();
		МодульКлиента().ОткрытьФормуНастройкиДокумента(Настройка, ЭтаФорма, ПослеЗакрытия);
		
		Действие = ДействияМетрик.УказатьРольДокумента;
		
	ИначеЕсли ТребуемоеДействие = ТребуемыеДействия.ПроверитьВозможностиТарифа Тогда
		
		МодульКлиента().ОткрытьСтраницуТарифовОрганизации(Организация);
		
		Действие = ДействияМетрик.ПроверитьВозможностиТарифа;
		
	ИначеЕсли ТребуемоеДействие = ТребуемыеДействия.СопоставитьКоды
		Или ТребуемоеДействие = ТребуемыеДействия.СопоставитьТовары
		Или ТребуемоеДействие = ТребуемыеДействия.СменитьОтражениеВЭДО
		Или ТребуемоеДействие = ТребуемыеДействия.УказатьИсправляемыйДокумент Тогда
		
		ПослеЗакрытия = ОбработчикОповещенияОбновитьСостояниеМаркировки();
		МодульКлиента().ОткрытьФормуДокументаУчета(ДокументУчета, ЭтаФорма, ПослеЗакрытия);
		
		Если ТребуемоеДействие = ТребуемыеДействия.СопоставитьКоды Тогда
			Действие = ДействияМетрик.СопоставитьКоды;
		ИначеЕсли  ТребуемоеДействие = ТребуемыеДействия.СопоставитьТовары Тогда
			Действие = ДействияМетрик.СопоставитьТовары;
		ИначеЕсли ТребуемоеДействие = ТребуемыеДействия.СменитьОтражениеВЭДО Тогда
			Действие = ДействияМетрик.СменитьОтражениеВЭДО;
		Иначе
			Действие = ДействияМетрик.УказатьИсправляемыйДокумент;
		КонецЕсли;
		
	ИначеЕсли ТребуемоеДействие = ТребуемыеДействия.ВыполнитьПроверку Тогда
		
		ОбновитьСтатусыКодовИВыполнитьПроверку(ДокументУчета);
		
		Действие = ДействияМетрик.ВыполнитьПроверкуКодов;
		
	Иначе
		
		ТекстОшибки = НСтр("ru = 'Неизвестное требуемое действие состояния маркировки: %1'");
		ВызватьИсключение МодульКлиента().ПараметрыВСтроку(ТекстОшибки, ТребуемоеДействие);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Действие) Тогда
		
		Представление = Неопределено;
		ТипОперации = Неопределено;
		
		Если ЗначениеЗаполнено(Операция) Тогда
			
			ТипОперации = МодульКлиента().ЗначениеРеквизитаОбъектаЛок(Операция, "ТипОперации");
			
			Если ТекущиеДанные.Статус = МодульКлиента().Перечисление_СтатусыОпераций().ОшибкаОбработки Тогда
				Представление = "Ожидается исправление ошибки";
			КонецЕсли;
			
		КонецЕсли;
		
		МодульКлиента().Метрика_ПоведениеСостоянияМаркировки(Действие, УникальныйИдентификатор, ТипОперации, Представление);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоСостоянияМаркировки()
	
	СтрокиРодителя = СостояниеМаркировки.ПолучитьЭлементы();
	Для Каждого Стр Из СтрокиРодителя Цикл
		ИдентификаторСтроки = Стр.ПолучитьИдентификатор();
		Элементы.СостояниеМаркировки.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДокументаУчета(СтрокаДокумента)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументУчета = СтрокаДокумента.ДокументУчета;
	Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
		ДокументУчета = МодульКлиента().ДокументУчета_НайтиИлиСоздать(СтрокаДокумента.Документ1С, ЭтаФорма);
	КонецЕсли;
	
	ТекущаяОперация = Неопределено;
	ТекущееСостояние = Неопределено;
	ТекущийДокументУчета = ДокументУчета;
	
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		ТекущийДокументУчета = ДокументУчета;
		ПослеЗакрытия = ОбработчикОповещенияОбновитьСостояниеМаркировки();
		МодульКлиента().ОткрытьФормуДокументаУчета(ДокументУчета, ЭтаФорма, ПослеЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументУчетаИНачатьРаботу(Документ1С)
	
	НачатьРаботу = Истина;
	МодульОбъекта().ДокументУчета_Создать(Документ1С, НачатьРаботу);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособНаполненияПослеВыбора(Результат, ДокументУчета) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СпособНаполнения = Результат;
	СпособыНаполнения = Перечисление_СпособыНаполненияДокументовУчета();
	
	Если СпособНаполнения = СпособыНаполнения.ТСД Тогда
		
		ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ПодборКодовНаТСД;
		МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, ДокументУчета,,, ЭтаФорма);
		
	ИначеЕсли СпособНаполнения = СпособыНаполнения.ТабличныйДокумент Тогда
		
		ОткрытьФормуЗагрузкиКодов(ДокументУчета);
		
	ИначеЕсли СпособНаполнения = СпособыНаполнения.Сканер Тогда
		
		РежимСканера = Истина;
		ОткрытьФормуЗагрузкиКодов(ДокументУчета, РежимСканера);
		
	ИначеЕсли СпособНаполнения = СпособыНаполнения.СвободныйОстаток Тогда
		
		ПодобратьНовыеКодыИзЗаказов(ДокументУчета);
		ОбновитьСостояниеМаркировки();
		
	ИначеЕсли СпособНаполнения = СпособыНаполнения.ИсправляемыйДокумент Тогда
		
		ЗаполнитьКодамиИзИсправляемогоДокумента(ДокументУчета);
		ОбновитьСостояниеМаркировки();
		
	ИначеЕсли СпособНаполнения = СпособыНаполнения.ЗаказКодов Тогда
		
		ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ЗаказКодов;
		МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, ДокументУчета,,, ЭтаФорма);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьНовыеКодыИзЗаказов(ДокументУчета)
	
	МодульОбъекта().ДокументУчета_ПодобратьНовыеКодыИзЗаказов(ДокументУчета);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодамиИзИсправляемогоДокумента(ДокументУчета)
	
	МодульОбъекта().ДокументУчета_ЗаполнитьКодамиИзИсправляемогоДокумента(ДокументУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьДокументУчетаКодами(ДокументУчета)
	
	
	ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("СпособНаполненияПослеВыбора", ЭтаФорма, ДокументУчета);
	
	ЗаголовокФормы = НСтр("ru = 'Способ наполнения'");
	ВариантыЗначений = ВариантыНаполненияДокумента(ДокументУчета);
	
	МодульКлиента().ОткрытьФормуВыбораВарианта(ЭтаФорма, ЗаголовокФормы, ВариантыЗначений, ПослеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗагрузкиКодов(ДокументУчета, РежимСканера = Ложь)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ПослеЗакрытия = МодульКлиента().ОписаниеОбработчикаОповещения("НаполнитьКодамиИзТабличногоДокументаПослеЗакрытия", ЭтаФорма, ДокументУчета);
	
	МодульКлиента().ОткрытьФормуЗагрузкиКодов(ЭтаФорма, ПослеЗакрытия, РежимСканера);
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзТабличногоДокументаПослеЗакрытия(Результат, ДокументУчета) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если НаполнитьКодамиИзТабличногоДокументаНаСервере(ДокументУчета, Результат) Тогда
		ОбновитьСостояниеМаркировки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбновлениеСтатусовКодовВыполняется()
	
	Результат = Ложь;
	
	Для каждого Элемент Из ДокументыНаПроверкеКодов Цикл
		Если МодульОбъекта().ОбновлениеСтатусовКодовДокументаВыполняется(Элемент.Значение) Тогда
			Результат = Истина;
		Иначе
			МодульОбъекта().ЗапуститьПроверкуКодовДокумента(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверкаКодовВыполняется()
	
	Результат = Ложь;
	
	Для каждого Элемент Из ДокументыНаПроверкеКодов Цикл
		ПроверкаВыполняется = МодульОбъекта().ПроверкаКодовДокументаВыполняется(Элемент.Значение);
		Результат = Макс(Результат, ПроверкаВыполняется);
		ОбновитьСостояниеПроверкиКодов(Элемент.Значение, ПроверкаВыполняется);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗавершитьРаботуСДокументом(ДокументУчета)
	
	Результат = Ложь;
	
	Если ЕстьВозможностьЗавершитьРаботу(ДокументУчета) Тогда
		МодульОбъекта().ЗавершитьРаботуСДокументом(ДокументУчета);
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЕстьВозможностьЗавершитьРаботу(ДокументУчета)
	
	ЕстьОшибки = Ложь;
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если МодульОбъекта().ДокументУчета_ЕстьОперации(ДокументУчета, ТипыОпераций.ПечатьКодов) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	ОписаниеДокумента = МодульОбъекта().ПрочитатьДокументУчета(ДокументУчета);
	
	Если ЗначениеЗаполнено(МодульОбъекта().ДокументУчета_ПроверитьЗаполнениеПолей(ОписаниеДокумента)) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МодульОбъекта().ДокументУчета_ПроверитьТоварыМаркировки(ОписаниеДокумента)) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если МодульОбъекта().ДокументУчета_ЕстьРольКорректировкаОтгрузки(ОписаниеДокумента)
		И Не МодульОбъекта().ДокументУчета_ПроверитьСопоставлениеКодов(ДокументУчета) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Функция НастройкиДокументовУчета_НайтиПоТипуДокумента(ДокументУчета)
	
	ТипДокумента = МодульОбъекта().ЗначениеРеквизитаОбъектаЛок(ДокументУчета, "ТипДокумента");
	Возврат МодульОбъекта().НастройкиДокументовУчета_НайтиПоТипуДокумента(ТипДокумента, Ложь);
	
КонецФункции

&НаСервере
Функция ПроверитьДокументУчетаНаСервере(ДокументУчета)
	
	Результат = Истина;
	
	ОшибкиЗаполнения = МодульОбъекта().ПроверитьЗаполнениеДокументаУчета(ДокументУчета);
	
	Если ЗначениеЗаполнено(ОшибкиЗаполнения) Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НаполнитьКодамиИзТабличногоДокументаНаСервере(ДокументУчета, Результат)
	
	Возврат МодульОбъекта().КодыДокументов_ДобавитьИзТабличногоДокумента_Сканера(ДокументУчета, Результат);
	
КонецФункции

&НаСервере
Функция ВсеДокументыУчета()
	
	Результат = Новый Массив;
	
	Для каждого Стр Из СостояниеМаркировки.ПолучитьЭлементы() Цикл
		Если ЗначениеЗаполнено(Стр.ДокументУчета) Тогда
			Результат.Добавить(Стр.ДокументУчета);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВариантыНаполненияДокумента(ДокументУчета)
	
	СпособыНаполнения = Перечисление_СпособыНаполненияДокументовУчета();
	
	Результат = Новый Массив;
	Результат.Добавить(СпособыНаполнения.ТСД);
	Результат.Добавить(СпособыНаполнения.ТабличныйДокумент);
	Результат.Добавить(СпособыНаполнения.Сканер);
	Результат.Добавить(СпособыНаполнения.СвободныйОстаток);
	Результат.Добавить(СпособыНаполнения.ЗаказКодов);
	
	Если МодульКлиента().ДокументУчета_ЕстьРольКорректировкаОтгрузки(ДокументУчета) Тогда
		Результат.Добавить(СпособыНаполнения.ИсправляемыйДокумент);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОбработчикОповещенияОбновитьСостояниеМаркировки()
	
	Возврат МодульКлиента().ОписаниеОбработчикаОповещения("ОбновитьСостояниеМаркировкиПослеВыполненияКоманды", ЭтаФорма);
	
КонецФункции

&НаСервере
Функция СостояниеМаркировки_НайтиСтроку(ДокументУчета, ДопустимыеСостояния, Операция = Неопределено)
	
	Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Состояния = Неопределено;
	Если ЗначениеЗаполнено(ДопустимыеСостояния) Тогда
		Состояния = МодульОбъекта().ЗначениеВМассиве(ДопустимыеСостояния);
	КонецЕсли;
	
	Для каждого СтрДок Из СостояниеМаркировки.ПолучитьЭлементы() Цикл
		
		Если СтрДок.ДокументУчета <> ДокументУчета Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Операция)
			И Не ЗначениеЗаполнено(Состояния) Тогда
			Возврат СтрДок;
		КонецЕсли;
		
		Для каждого СтрСост Из СтрДок.ПолучитьЭлементы() Цикл
			
			Если ЗначениеЗаполнено(Операция)
				И СтрСост.Операция <> Операция Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Состояния)
				И Не МодульОбъекта().МассивСодержитЗначение(Состояния, СтрСост.Состояние) Тогда
				Продолжить;
			КонецЕсли;
			
			Возврат СтрСост;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция Перечисление_СпособыНаполненияДокументовУчета()
	
	Результат = Новый Структура();
	
	Результат.Вставить("ТСД", "на ТСД");
	Результат.Вставить("Сканер", "с помощью сканера");
	Результат.Вставить("ТабличныйДокумент", "из табличного документа");
	Результат.Вставить("СвободныйОстаток", "со свободного остатка");
	Результат.Вставить("ИсправляемыйДокумент", "из исправляемого документа");
	Результат.Вставить("ЗаказКодов", "заказать новые коды");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// #КонецОбласти // СлужебныеПроцедурыИФункции
