
Функция ТаблицаЗначенийСвойствПолейОперацииПоУмолчанию() Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("Данные", Новый Структура);
	Обработки.вмс_СерверУправляемыйМодульСтандартный.ИнициализироватьДанныеОбработки(Параметры);
	ПоляОперации = Параметры.ПоляОбработки;
	
	РеквизитыШапкиЗадания = Метаданные.Документы.вмс_ЗаданиеКладовщику.СтандартныеРеквизиты;
	Для Каждого Реквизит Из РеквизитыШапкиЗадания Цикл
		ИмяРеквизита = Реквизит.Имя;
		УстановитьСвойстваПолейОперации(Параметры, ИмяРеквизита, Новый Структура("ПутьКДаннымЗаполнения, Синоним, ТипЗначения", "Задание." + ИмяРеквизита, Реквизит.Синоним, Реквизит.Тип));
	КонецЦикла;

	РеквизитыШапкиЗадания = Метаданные.Документы.вмс_ЗаданиеКладовщику.Реквизиты;
	Для Каждого Реквизит Из РеквизитыШапкиЗадания Цикл
		ИмяРеквизита = Реквизит.Имя;
		УстановитьСвойстваПолейОперации(Параметры, ИмяРеквизита, Новый Структура("ПутьКДаннымЗаполнения, Синоним, ТипЗначения", "Задание." + ИмяРеквизита, Реквизит.Синоним, Реквизит.Тип));
	КонецЦикла;

	РеквизитыЗадания = Метаданные.Документы.вмс_ЗаданиеКладовщику.ТабличныеЧасти.Товары.Реквизиты;
	Для Каждого Реквизит Из РеквизитыЗадания Цикл
		ИмяРеквизита = Реквизит.Имя;
		Если ИмяРеквизита="Номенклатура" Тогда
			ИмяРеквизита = "Товар";
		КонецЕсли;
		УстановитьСвойстваПолейОперации(Параметры, ИмяРеквизита, Новый Структура("ПутьКДаннымЗаполнения, Синоним, ТипЗначения", "Задание.Товары." + ИмяРеквизита, Реквизит.Синоним, Реквизит.Тип));
	КонецЦикла;

	РеквизитыОперацииПоЯчейкам = Метаданные.Документы.вмс_ОперацияПоЯчейкам.ТабличныеЧасти.Товары.Реквизиты;
	Для Каждого Реквизит Из РеквизитыОперацииПоЯчейкам Цикл
		ИмяРеквизита = Реквизит.Имя;
		Если ИмяРеквизита="Номенклатура" Тогда
			ИмяРеквизита = "Товар";
		КонецЕсли;
		УстановитьСвойстваПолейОперации(Параметры, ИмяРеквизита, Новый Структура("ПутьКДаннымСохранения, Синоним, ТипЗначения", "ОперацияПоЯчейкам.Товары." + ИмяРеквизита, Реквизит.Синоним, Реквизит.Тип));
	КонецЦикла;
	
	УстановитьСвойстваПолейОперации(Параметры, "Товар",					Новый Структура("Синоним, СинонимВинительныйПадеж, СинонимРодительныйПадеж, Пол", "Товар", "Товар", "Товара", "Мужской"));
	УстановитьСвойстваПолейОперации(Параметры, "Характеристика",		Новый Структура("Синоним, СинонимВинительныйПадеж, СинонимРодительныйПадеж, Пол", "Характеристика", "Характеристику", "Характеристики", "Женский"));
	УстановитьСвойстваПолейОперации(Параметры, "Серия",					Новый Структура("Синоним, СинонимВинительныйПадеж, СинонимРодительныйПадеж, Пол", "Серия", "Серию", "Серии", "Женский"));
	УстановитьСвойстваПолейОперации(Параметры, "Ячейка",				Новый Структура("Синоним, СинонимВинительныйПадеж, СинонимРодительныйПадеж, Пол", "Ячейка отбора", "Ячейку отбора", "Ячейки отбора", "Женский"));
	УстановитьСвойстваПолейОперации(Параметры, "ЯчейкаПриемник",		Новый Структура("Синоним, СинонимВинительныйПадеж, СинонимРодительныйПадеж, Пол", "Ячейка размещения", "Ячейку размещения", "Ячейки размещения", "Женский"));
	УстановитьСвойстваПолейОперации(Параметры, "Контейнер",				Новый Структура("Синоним, СинонимВинительныйПадеж, СинонимРодительныйПадеж, Пол", "Контейнер", "Контейнер", "Контейнера", "Мужской"));
	УстановитьСвойстваПолейОперации(Параметры, "КонтейнерОтправитель",	Новый Структура("Синоним, СинонимВинительныйПадеж, СинонимРодительныйПадеж, Пол", "Контейнер-отправитель", "Контейнер-отправитель", "Контейнера-отправителя", "Мужской"));
	УстановитьСвойстваПолейОперации(Параметры, "КонтейнерПриемник",		Новый Структура("Синоним, СинонимВинительныйПадеж, СинонимРодительныйПадеж, Пол", "Контейнер-приемник", "Контейнер-приемник", "Контейнера-приемника", "Мужской"));
	УстановитьСвойстваПолейОперации(Параметры, "КоличествоОтобрано",	Новый Структура("Синоним, СинонимВинительныйПадеж, ТипЗначения", "Отобрать", "сколько отобрать", Новый ОписаниеТипов("Число")));
	УстановитьСвойстваПолейОперации(Параметры, "КоличествоРазмещено",	Новый Структура("Синоним, СинонимВинительныйПадеж, ТипЗначения", "Разместить", "сколько разместить", Новый ОписаниеТипов("Число")));
	УстановитьСвойстваПолейОперации(Параметры, "Количество",			Новый Структура("Синоним, СинонимВинительныйПадеж", "Количество", "Количество"));
	
	УстановитьСвойстваПолейОперации(Параметры, "Маркировка",			Новый Структура("Синоним, ТипЗначения, Использование, Ввод, Сборка, ПутьКДаннымЗаполнения", "Маркировка", Новый ОписаниеТипов("Строка"), Истина, Истина, Истина, "Задание.КодыМаркировки.Маркировка"));
	УстановитьСвойстваПолейОперации(Параметры, "Артикул",				Новый Структура("Синоним, ТипЗначения, ПутьКДаннымЗаполнения", "Артикул", Новый ОписаниеТипов("Строка"), "Задание.Товары.Товар.Артикул"));
	
	УстановитьСвойстваПолейОперации(Параметры, "Товар, Характеристика, Серия, Маркировка, Контейнер, Качество", "Группа", "Товар");
	
	ПутьКДаннымЗаполнения = ПолучитьЗначениеСвойстваПоляОперации(Параметры, "Количество", "ПутьКДаннымЗаполнения");
	ПутьКДаннымСохранения = ПолучитьЗначениеСвойстваПоляОперации(Параметры, "Количество", "ПутьКДаннымСохранения");
	СвойстваПолей = Новый Структура("Ресурс, Группа, ПутьКДаннымЗаполнения, ПутьКДаннымСохранения", Истина, "Количество", ПутьКДаннымЗаполнения, ПутьКДаннымСохранения);
	Для Каждого ПолеКоличества Из ПоляОперации(Параметры, "КоличествоОтобрано, КоличествоРазмещено, Количество") Цикл
		СвойстваПолей.Вставить("Суффикс", Прав(ПолеКоличества.Имя, СтрДлина(ПолеКоличества.Имя)-СтрДлина(СвойстваПолей.Группа)));
		УстановитьСвойстваПолейОперации(Параметры, ПолеКоличества, СвойстваПолей);
	КонецЦикла;
	
	Для Каждого Поле Из ПоляОперации Цикл
		Если НЕ ЗначениеЗаполнено(Поле.ПоложениеЗаголовка) Тогда
			Поле.ПоложениеЗаголовка = "Авто";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Поле.Страница) Тогда
			Поле.Страница = ПрефиксСтраницОперации() + "ВводДанных"; //станица по умолчанию
		КонецЕсли;
		
		Если Поле.ТипЗначения <> Неопределено Тогда
			Значение = Поле.ТипЗначения.ПривестиЗначение();
		Иначе
			Значение = Неопределено;
		КонецЕсли;
		
		Если Поле.ПустыеЗначения.Найти(Значение)=Неопределено Тогда
			Поле.ПустыеЗначения.Добавить(Значение);
		КонецЕсли;
		
		Поле.НачальноеЗначение = Значение;
		Поле.ЗначениеПоУмолчанию = Значение;

		ЗаполнитьСписокВыбораПоля(Поле);
	КонецЦикла;
	
	//чтобы отличать "0" от незаполненного значения так, как може потребоваться обнулить количество вводом нуля
	УстановитьСвойстваПолейОперации(Параметры, "КоличествоОтобрано, КоличествоРазмещено, Количество", Новый Структура("НачальноеЗначение, ЗначениеПоУмолчанию, ПустыеЗначения", Неопределено, Неопределено, Неопределено));
	УстановитьСвойстваПолейОперации(Параметры, "Характеристика", Новый Структура("НачальноеЗначение, ЗначениеПоУмолчанию, ПустыеЗначения", Неопределено, Неопределено, Неопределено));
	
	УстановитьСвойстваПолейОперации(Параметры, , "Использование", Ложь);

	Возврат ПоляОперации;
	
КонецФункции

Функция ЗаполнитьСписокВыбораПоля(Поле)
	
	Поле.СписокВыбора = Неопределено;
	
	Если НЕ (ТипЗнч(Поле.ТипЗначения)=Тип("ОписаниеТипов") И Поле.ТипЗначения.Типы().Количество()=1) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Тип = Поле.ТипЗначения.Типы()[0];
	МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
	Если МетаданныеТипа <> Неопределено И Метаданные.Перечисления.Содержит(МетаданныеТипа) Тогда
		Менеджер = Перечисления[МетаданныеТипа.Имя];
		Поле.СписокВыбора = Новый СписокЗначений;
		Для Каждого ЗначениеПеречисления Из МетаданныеТипа.ЗначенияПеречисления Цикл
			Поле.СписокВыбора.Добавить(Менеджер[ЗначениеПеречисления.Имя], ЗначениеПеречисления.Синоним);
		КонецЦикла;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции


Функция УстановитьСвойстваПолейОперации(Параметры, Поля, Свойства, Значение=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьСвойстваПолейОбработки(Параметры, Поля, Свойства, Значение);
	
КонецФункции

Функция ПоляОперации(Параметры, Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(Параметры, Отбор);
	
КонецФункции

Функция ПолучитьЗначениеСвойстваПоляОперации(Параметры, Поле, ИмяСвойства)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеСвойстваПоляОбработки(Параметры, Поле, ИмяСвойства);
	
КонецФункции

Функция ПрефиксСтраницОперации() Экспорт
	
	Возврат "ГлавнаяПанельСтраница";
	
КонецФункции
