#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
Перем РК;

Функция Инициализировать() Экспорт
	
	// Добавим предка, чтобы не определять все методы и этапы ввода,
	//а унаследовать их от стандартного сборщика
	Если Интерфейс.МодульПодключен("СборщикДанныхСтандартный") Тогда
		СборщикДанныхСтандартный = Интерфейс.Модуль("СборщикДанныхСтандартный");
	Иначе
		СборщикДанныхСтандартный = Обработки.вмс_СерверУправляемыйМодульСборщикДанныхСтандартный.Создать();
	КонецЕсли;
	Интерфейс.ДобавитьРеальныйМодуль(СборщикДанныхСтандартный);
	
	// Укажем реализуемые в этом модуле методы
	ИменаРеализуемыхМетодов =
	"ВыполнитьДействие,
	|УстановитьДоступныеПоля,
	|УстановитьДополнительныеПоля,
	|ИнициализироватьДанные,
	|ЗаполнитьВведенныеДанныеПолей,
	|ЗаполнитьОбщиеДанныеПолейДополнительно,
	|ЗаполнитьПредставлениеДанныхПолей,
	|РазобратьВходящиеОбъекты,
	|СохранениеДанныхСборщика";
	
	Интерфейс.УстановитьРеализациюМетодов(ИменаРеализуемыхМетодов, ЭтотОбъект);
	
	// Инициализируем этапы ввода данных
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_НачалоВвода", "НачалоВвода");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ОбработкаВходящихДанныхПолей", "ОбработкаВходящихДанныхПолей");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ПроверкаСобранныхДанных", "ПроверкаСобранныхДанных");
	// 3.2.4
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ПроверитьОбязательныйВводМаркировки", "ПроверкаСобранныхДанных");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ПроверитьДублированиеМаркировкиНаВводе", "ПроверкаСобранныхДанных");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_ПроверитьОтклонениеОтПлана", "ПроверкаСобранныхДанных");
	ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_СохранениеДанных");
	
	// Инициализируем переменные модуля
	ПараметрыМодуля.Вставить("ДанныеСохранены", Ложь);
	ПараметрыМодуля.Вставить("ПоляДанныхМаркировки", Новый Массив);

	// Инициализируем план по маркам
	ТаблицаКодовМаркировки = ПараметрыОбработки.Задание.КодыМаркировки.Выгрузить();
	УстановитьТаблицуОбработки("ТаблицаКодовМаркировки", ТаблицаКодовМаркировки, Ложь);
	ПараметрыМодуля.Вставить("ЕстьПлан", ТаблицаКодовМаркировки.Количество() > 0);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////
//
//						Реализация методов+
//

#Область РеализацияМетодов

Функция ВыполнитьДействие(Действие) Экспорт
	
	Код = Действие.Код;
	
	Если Код="ПередОткрытиемФормыВводаКоличества" Тогда
		
		ДействиеПередОткрытиемФормыВводаКоличества(Действие);
		
	КонецЕсли;
	
	Если Действие.Обработано Тогда
		Возврат Действие.Результат;
	КонецЕсли;
	
	Возврат СборщикДанныхСтандартный.ВыполнитьДействие(Действие);

КонецФункции

Функция ДействиеПередОткрытиемФормыВводаКоличества(Действие)
	
	МаркируемыйТовар = ДанныеМодуля.СобранныеДанныеПолей.МаркируемыйТовар;
	Если МаркируемыйТовар=Ложь Тогда
		// не обрабатываем
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыДействия = Действие.Параметры;
	ПараметрыДействия.Отказ = Истина;
	
	Если МаркируемыйТовар=Истина Тогда
		ПоказатьДиалогНаКлиенте(, "Требуется отсканировать марку товара");
	КонецЕсли;
	
	Возврат УстановитьРезультатДействия(Действие, ПараметрыДействия);
	
КонецФункции

Функция УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства=Неопределено)
	
	Возврат СтандартныйМодуль.УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства);
	
КонецФункции

Функция УстановитьДоступныеПоля() Экспорт
	
	РеквизитыОперацииПоЯчейкам = Метаданные.Документы.вмс_ОперацияПоЯчейкам.ТабличныеЧасти.КодыМаркировки.Реквизиты;
	Для Каждого Реквизит Из РеквизитыОперацииПоЯчейкам Цикл
		ИмяРеквизита = Реквизит.Имя;
		ИмяПоля = ИмяРеквизита;
		Если ИмяПоля <> "Количество" Тогда
			// ТУ_КС+
			Если ИмяПоля="Серия" Тогда
				ТипЗначенияПоля = Новый ОписаниеТипов("СправочникСсылка.вмс_СерииНоменклатуры");
			Иначе
				ТипЗначенияПоля = Реквизит.Тип;
			КонецЕсли;
			// ТУ_КС-
			УстановитьСвойстваПолейМодуля(ИмяПоля, Новый Структура("ПутьКДаннымСохранения, Синоним, ТипЗначения", "ОперацияПоЯчейкам.КодыМаркировки." + ИмяРеквизита, Реквизит.Синоним, ТипЗначенияПоля));
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция УстановитьДополнительныеПоля() Экспорт
	
	УстановитьСвойстваПолейМодуля("Маркировка", Новый Структура("ОбязательноеЗаполнение", Истина));
	
	СвойстваПоля = Новый Структура("Сборка, Вывод, ЗначениеПоУмолчанию", Истина, Ложь, Неопределено);
	УстановитьСвойстваПолейМодуля("МаркируемыйТовар", СвойстваПоля);
	//УстановитьСвойстваПолейОбработки("МаркируемыйТовар", СвойстваПоля);
	
	УстановитьСвойстваПолейМодуля("КоличествоМаркировки", Новый Структура("Ресурс, Ввод, Сборка, Группа, ОбязательноеЗаполнение, Вывод", Истина, Истина, Истина, "Количество", Истина, Ложь));
	
	//3.2.5
	СвойстваПоля = Новый Структура("Сборка, Ввод, Вывод, ЗначениеПоУмолчанию, ПутьРодителяДанныхСохранения", Истина, Истина, Ложь, Неопределено, "ОперацияПоЯчейкам.КодыМаркировки");
	УстановитьСвойстваПолейМодуля("ПолныйКодМаркировки", СвойстваПоля);
	
КонецФункции

Функция ИнициализироватьДанные() Экспорт
	
КонецФункции

Функция РазобратьВходящиеОбъекты(ВходящиеДанные) Экспорт
	
	ДанныеШтрихкода = ВходящиеДанные.ДанныеШтрихкода;
	
	ВходящиеОбъекты = ВходящиеДанные.ВходящиеОбъекты;
	Если ВходящиеОбъекты.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = ДанныеШтрихкода.Результат;
	ВводМаркировки = ДанныеШтрихкода.Обработан И (Результат.ДанныеМаркировки.ИдентифицируетЭкземпляр ИЛИ Результат.ДанныеМаркировки.ЭтоТранспортныйКод);
	
	ПоляДанныхМаркировки = ПараметрыМодуля.ПоляДанныхМаркировки;
	
	Если ВводМаркировки Тогда
		ПоляДанныхМаркировки.Очистить();
	КонецЕсли;
	
	ДанныеПолей = ВходящиеДанные.ДанныеПолей;
	
	ПоляВвода = ПоляВвода();
	
	ЗаполненныеПоляМассив = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.ЗаполненныеПоляМассив;
	
	Для Каждого Объект Из ВходящиеОбъекты Цикл
		
		ТипОбъекта = ТипЗнч(Объект);
		
		ПоляПоТипу = Новый Массив;
		Для Каждого ПолеВвода Из ПоляВвода Цикл
			Если ТипЗнч(ПолеВвода.ТипЗначения)=Тип("ОписаниеТипов") И ПолеВвода.ТипЗначения.Типы().Найти(ТипОбъекта) <> Неопределено Тогда
				Если ПолеВвода.Имя="Серия" И НЕ ЗначениеЗаполнено(Объект) Тогда
					Продолжить;
				КонецЕсли;
				ПоляПоТипу.Добавить(ПолеВвода);
			КонецЕсли;
		КонецЦикла;
		
		Если ПоляПоТипу.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПоляПоТипу.Количество() > 1 Тогда
			Для Каждого ПолеВвода Из ПоляПоТипу Цикл
				ИмяПоля = ПолеВвода.Имя;
				Если ЗаполненныеПоляМассив.Найти(ИмяПоля)=Неопределено Тогда
					// Оставим первое незаполненное поле
					ПоляПоТипу.Очистить();
					ПоляПоТипу.Добавить(ПолеВвода);
					ЗаполненныеПоляМассив.Добавить(ИмяПоля);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ПолеВвода = ПоляПоТипу[ПоляПоТипу.Количество()-1];
		ИмяПоля = ПолеВвода.Имя;
		ДанныеПолей.Вставить(ИмяПоля, Объект);
		
		Если ВводМаркировки Тогда
			ПоляДанныхМаркировки.Добавить(ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
	Если ВводМаркировки Тогда
		ДанныеПолей.Вставить("Маркировка", Результат.ШтрихкодНормализованныйПредставление);
		ДанныеПолей.Вставить("КоличествоМаркировки", Результат.ДанныеМаркировки.Количество);
		//3.2.5
		ДанныеПолей.Вставить("ПолныйКодМаркировки", Результат.ШтрихкодBase64);
		
		ПоляКоличества = ПоляОбработки(Новый Структура("Ввод, Группа", Истина, "Количество"));
		Для Каждого ПолеКоличества Из ПоляКоличества Цикл
			ДанныеПолей.Вставить(ПолеКоличества.Имя, Результат.ДанныеМаркировки.Количество);
			ДанныеПолей.Вставить("ТипВводаКоличества" + ПолеКоличества.Суффикс, "Добавить");
			ДанныеПолей.Вставить("ЗавершениеВводаКоличества" + ПолеКоличества.Суффикс, Ложь);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьВведенныеДанныеПолей(ПринятыеДанныеПолей) Экспорт
	
	ПоляДанныхМаркировки = ПараметрыМодуля.ПоляДанныхМаркировки;
	
	Для Каждого ПринятыеДанныеПоля Из ПринятыеДанныеПолей Цикл
		
		Если ПоляДанныхМаркировки.Найти(ПринятыеДанныеПоля.Ключ) <> Неопределено Тогда
			//изменилось ключевое поле
			Интерфейс.ОчиститьДанныеПолей("Маркировка", "ВведенныеДанныеПолей");
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СборщикДанныхСтандартный.ЗаполнитьВведенныеДанныеПолей(ПринятыеДанныеПолей);
	
КонецФункции

Функция ЗаполнитьОбщиеДанныеПолейДополнительно() Экспорт
	
	Товар = ДанныеТранзакции.ОбщиеДанныеПолей.Товар;
	Если ЗначениеЗаполнено(Товар) Тогда
		ДанныеТранзакции.ОбщиеДанныеПолей.МаркируемыйТовар = МаркируемыйТовар(Товар);
	Иначе
		ДанныеТранзакции.ОбщиеДанныеПолей.МаркируемыйТовар = Неопределено;
	КонецЕсли;
	
КонецФункции

Функция МаркируемыйТовар(Товар)

	Возврат ЗначениеЗаполнено(Товар) И вмс_АдаптацияКонфигураций.ОпределитьМаркируемыеТовары(Товар).Количество() > 0;

КонецФункции

Функция ЗаполнитьПредставлениеДанныхПолей() Экспорт
	
	РедактированиеКоличестваВручную = ДанныеМодуля.СобранныеДанныеПолей.МаркируемыйТовар=Ложь;
	
	Для Каждого ПолеВводаКоличества Из ПоляОбработки(Новый Структура("Ввод, Вывод, Группа", Истина, Истина, "Количество")) Цикл
		
		УстановитьСвойстваЭлементовВывода(ПолеВводаКоличества.ИмяЭлементаВывода, Новый Структура("РедактированиеТекста", РедактированиеКоличестваВручную));
		
	КонецЦикла;
	
КонецФункции

Функция СохранениеДанныхСборщика(Сборщик, Отказ) Экспорт
	
	Если Сборщик.Имя="СборщикДанныхТоваров" Тогда
		Если ДанныеТранзакции.ОбщиеДанныеПолей.МаркируемыйТовар=Истина Тогда
			// 3.2.5
			Если ПроверитьЗаполнениеПолейСборки(Сборщик) Тогда
				Если СохранитьДокументОперацииПоЯчейкам(Отказ) И НЕ Отказ Тогда
					// очистим данные транзакции основной обработки
					Обработки.вмс_СерверУправляемыйМодульСтандартный.ОчиститьДанныеПолей(ПараметрыОбработки, "Маркировка");
					ПараметрыМодуля.ДанныеСохранены = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ПараметрыМодуля.ДанныеСохранены И НЕ Отказ Тогда
				Отказ = Истина;
				ПоказатьДиалогНаКлиенте(, "Не удалось сохранить данные маркировки");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// 3.2.5
// проверим заполнние полей с учетом настройки полей ведущего сборщика товаров
Функция ПроверитьЗаполнениеПолейСборки(СборщикДанныхТоваров)
	
	ПоляМодуляМастер = ?(СборщикДанныхТоваров.ДанныеТранзакции.Активна, СборщикДанныхТоваров.ДанныеТранзакции.ПоляОбработки, СборщикДанныхТоваров.ПараметрыМодуля.ПоляОбработки);
	
	МодифицируемыеСвойства = "Ввод, ОбязательноеЗаполнение";
	ПоляМодуля = СборщикДанныхСтандартный.ПоляАнализаДанных()["СобранныеДанныеПолей"].Поля;
	ПоляМодуляИсходные = РК.НоваяТаблицаЗначений("Имя, " + МодифицируемыеСвойства);
	
	ПоляМодифицированные = Новый Массив;
	ПоискПоИмени = Новый Структура("Имя");
	Для Каждого ПолеМодуля Из ПоляМодуля Цикл
		ПоискПоИмени.Имя = ПолеМодуля.Имя;
		ПолеМодуляМастерМассив = ПоляМодуляМастер.НайтиСтроки(ПоискПоИмени);
		Если ПолеМодуляМастерМассив.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеМодуляИсходные = ПоляМодуляИсходные.Добавить();
		ЗаполнитьЗначенияСвойств(ПолеМодуляИсходные, ПолеМодуля);
		
		ПолеМодуляМастер = ПолеМодуляМастерМассив[0];
		ЗаполнитьЗначенияСвойств(ПолеМодуля, ПолеМодуляМастер, МодифицируемыеСвойства);
		ПоляМодифицированные.Добавить(Новый Структура("ПолеМодуля, ПолеМодуляИсходные", ПолеМодуля, ПолеМодуляИсходные));
	КонецЦикла;
	
	Интерфейс.ПроанализироватьЗаполнениеПолейДанных("СобранныеДанныеПолей");
	
	Для Каждого ЭлементПолеМодуля Из ПоляМодифицированные Цикл
		ЗаполнитьЗначенияСвойств(ЭлементПолеМодуля.ПолеМодуля, ЭлементПолеМодуля.ПолеМодуляИсходные, МодифицируемыеСвойства);
	КонецЦикла;
	
	АктивныеДанные = ?(ДанныеТранзакции.Активна, ДанныеТранзакции, ДанныеМодуля);
	
	Возврат АктивныеДанные.РезультатАнализаЗаполненияПолейДанныхСборки.ВсеПоляЗаполнены;

КонецФункции

Функция ВвестиДанныеПоля(ИмяПоля, ЗначениеПоля)

	Возврат СтандартныйМодуль.ВвестиДанныеПоля(ИмяПоля, ЗначениеПоля);
	
КонецФункции

Функция НовыеВходящиеДанные(Данные=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.НовыеВходящиеДанные(Данные);
	
КонецФункции

Функция ВвестиДанные(ВходящиеДанные)

	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ВвестиДанные", Новый Структура("ВходящиеДанные", ВходящиеДанные)));
	
КонецФункции

#КонецОбласти

//
//						Реализация методов-
//
////////////////////////////////////////////////////////////////////////////////////////////

Функция ОбработчикЭтапаВводаДанных_НачалоВвода(Параметры, ДополнительныеПараметры) Экспорт
	
	СборщикДанныхСтандартный.ОбработчикЭтапаВводаДанных_НачалоВвода(Параметры, ДополнительныеПараметры);
	
	ПараметрыМодуля.ДанныеСохранены = Ложь;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ОбработкаВходящихДанныхПолей(Параметры, ДополнительныеПараметры) Экспорт
	
	ПринятыеДанныеПолей = СборщикДанныхСтандартный.ЗаполнитьПринятыеДанныеПолей(ДанныеТранзакции.ВходящиеДанные);
	Если ПринятыеДанныеПолей.Количество()=0 Тогда
		//нет полей для обработки
		Интерфейс.ЗакончитьТранзакциюСборщика();
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ПроверкаСобранныхДанных(Параметры, ДополнительныеПараметры) Экспорт
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ПроверитьОбязательныйВводМаркировки(Параметры, ДополнительныеПараметры) Экспорт
	
	// 3.2.4
	
	СобранныеДанныеПолей = ДанныеТранзакции.СобранныеДанныеПолей;
	
	МаркируемыйТовар = СобранныеДанныеПолей.МаркируемыйТовар=Истина;
	МаркировкаВведена = ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхСборки.ЗаполненныеПоляМассив.Найти("Маркировка") <> Неопределено;
	
	Если МаркируемыйТовар И НЕ МаркировкаВведена Тогда
		
		мТоварныеПоля = СписокПолейМодуля(Новый Структура("Группа", "Товар"));
		ПредставлениеТовара = Новый Массив;
		
		Для каждого ТоварноеПоле Из мТоварныеПоля Цикл
			ПредставлениеТовара.Добавить(ДанныеТранзакции.ОбщиеДанныеПолей[ТоварноеПоле]);
		КонецЦикла;
		
		ПредставлениеТовара = СтрСоединить(ПредставлениеТовара, ", ");
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДанныеОТоваре", ПредставлениеТовара);
		СтандартныйМодуль.ПоказатьФормуДиалога(НовыйОписаниеОповещения("ОбработчикЗакрытияФормыВводаМаркировки"), "ОбщаяФорма.ФормаВводаМаркировки", ПараметрыФормы);
		Интерфейс.ОтменитьВводДанных();
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОбработчикЗакрытияФормыВводаМаркировки(Маркировка, ДополнительныеПараметры) Экспорт
	
	Если Маркировка=Неопределено Тогда
		Возврат Ложь;
	Иначе
		ВвестиДанные(Маркировка);
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ПроверитьДублированиеМаркировкиНаВводе(Параметры, ДополнительныеПараметры) Экспорт
	
	СобранныеДанныеПолей = ДанныеТранзакции.СобранныеДанныеПолей;
	Если ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхСборки.ЗаполненныеПоляМассив.Найти("Маркировка")=Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	МаркаДоступна = вмс_ОбработкаМаркировкиСервер.ПроверитьВозможностьИспользованияМаркировки(СобранныеДанныеПолей.Маркировка, ПараметрыОбработки.Задание);
	
	Если Не МаркаДоступна Тогда
		Интерфейс.ОтменитьВводДанных();
		ПоказатьДиалогНаКлиенте(, "Марку уже сканировали!", , , , , "Ошибка");
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_ПроверитьОтклонениеОтПлана(Параметры, ДополнительныеПараметры) Экспорт
	
	Если НЕ ПараметрыМодуля.ЕстьПлан Тогда
		// нет плана
		Возврат Истина;
	КонецЕсли;

	СобранныеДанныеПолей = ДанныеТранзакции.СобранныеДанныеПолей;
	Если ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхСборки.ЗаполненныеПоляМассив.Найти("Маркировка")=Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеТранзакции.ОбщиеДанныеПолей.МаркируемыйТовар <> Истина Тогда
		// для немаркируемого товара не проверям
		Возврат Истина;
	КонецЕсли;
	
	Маркировка = СобранныеДанныеПолей.Маркировка;
	
	Если ДанныеОбработки.Таблицы.ТаблицаКодовМаркировки.НайтиСтроки(Новый Структура("Маркировка", Маркировка)).Количество() > 0 Тогда
		// марка найдена в плане
		Возврат Истина;
	КонецЕсли;
	
	ПоказатьДиалогНаКлиенте(, "Марки нет в плане!", , , , , "Ошибка");
	Интерфейс.ОтменитьВводДанных();
	
	Возврат Ложь;
	
КонецФункции

Функция ОбработчикЭтапаВводаДанных_СохранениеДанных(Параметры, ДополнительныеПараметры) Экспорт
	
КонецФункции

Функция СохранитьДокументОперацииПоЯчейкам(Отказ=Ложь)
	
	СобранныеДанныеПолей = ДанныеТранзакции.СобранныеДанныеПолей;
	Количество = СобранныеДанныеПолей.КоличествоМаркировки;
	
	ОперацияПоЯчейкам = ПолучитьДокументОперацииПоЯчейкам();
	ТаблицаДокумента = ОперацияПоЯчейкам.КодыМаркировки;
	ПоляПоискаМассив = СписокПолейМодуля(Новый Структура("Сборка, Ресурс, ПутьРодителяДанныхСохранения", Истина, Ложь, "ОперацияПоЯчейкам.КодыМаркировки"));
	ПоляПоиска = РК.МассивВСтроку(ПоляПоискаМассив);
	Поиск = Новый Структура(ПоляПоиска);
	
	//3.2.5 - Сохранение полного кода маркировки.
	СохранятьПолныйКодМаркировки = ПараметрыОбработки.ПравилоЗаполнения.СохранятьПолныйКодМаркировки;
	Если Не СохранятьПолныйКодМаркировки Тогда
		ИсключаемыеПоля = "ПолныйКодМаркировки";
	КонецЕсли;
	//-
	
	ЗаполнитьЗначенияСвойств(Поиск, СобранныеДанныеПолей, ,ИсключаемыеПоля);
	НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Поиск);
	Если НайденныеСтроки.Количество()=0 Тогда
		СтрокаДокумента = ТаблицаДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, Поиск);
	Иначе
		СтрокаДокумента = НайденныеСтроки[0];
	КонецЕсли;
	
	СтрокаДокумента.Количество = Количество;
	
	Если СтрокаДокумента.Количество=0 Тогда
		ТаблицаДокумента.Удалить(СтрокаДокумента);
	КонецЕсли;
	
	Если НЕ ЗаписатьДокументОперацииПоЯчейкам(ОперацияПоЯчейкам) Тогда
		Отказ = Истина;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////
//
//						Объявление функций+
//

#Область ОбъявлениеФункций

Функция ПолучитьДокументОперацииПоЯчейкам(Создавать=Истина)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ПолучитьДокументОперацииПоЯчейкам", Новый Структура("Создавать", Создавать)));
	
КонецФункции

Функция ЗаписатьДокументОперацииПоЯчейкам(ОперацияПоЯчейкам)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗаписатьДокументОперацииПоЯчейкам", Новый Структура("ОперацияПоЯчейкам", ОперацияПоЯчейкам)));
	
КонецФункции

Функция ТаблицаПолейМодуля(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ТаблицаПолейОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции

Функция УстановитьСвойстваПолейМодуля(Поля=Неопределено, Свойства=Неопределено, ЗначениеСвойства=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьСвойстваПолейОбработки(ПараметрыМодуля, Поля, Свойства, ЗначениеСвойства);
	
КонецФункции

Функция ПолучитьЗначениеСвойстваПоляМодуля(Поле, ИмяСвойства)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеСвойстваПоляОбработки(ПараметрыМодуля, Поле, ИмяСвойства);
	
КонецФункции

Функция ПоляВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВывода(ПараметрыМодуля);
	
КонецФункции

Функция ПоляВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВвода(ПараметрыМодуля);
	
КонецФункции

Функция ПолеМодуля(Отбор)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции

Функция ПоляМодуля(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции

Функция ПолеОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ПоляОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция УстановитьСвойстваПолейОбработки(Поля=Неопределено, Свойства=Неопределено, Значение=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьСвойстваПолейОбработки(ПараметрыОбработки, Поля, Свойства, Значение);
	
КонецФункции

Функция СписокПолейВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВвода(ПараметрыМодуля);
	
КонецФункции

Функция СписокПолейМодуля(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейОбработки(ПараметрыМодуля, Отбор);
	
КонецФункции

Функция СписокПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция УстановитьОформлениеЭлементаТаблицы(ИмяТаблицы, Элемент, Свойства)
	
	Возврат СтандартныйМодуль.УстановитьОформлениеЭлементаТаблицы(ИмяТаблицы, Элемент, Свойства);
	
КонецФункции

Функция УстановитьПоляВыводаТаблицы(ИмяТаблицы, ПоляВывода)
	
	Возврат СтандартныйМодуль.УстановитьПоляВыводаТаблицы(ИмяТаблицы, ПоляВывода);
	
КонецФункции

Функция ОбновитьДанныеТаблицы(ИмяТаблицы, ДанныеДляЗагрузки, ПоляГруппировки, Отбор=Неопределено, ТипОчистки="Удалять", ПустыеДанныеПолей=Неопределено)
	
	Возврат СтандартныйМодуль.ОбновитьДанныеТаблицы(ИмяТаблицы, ДанныеДляЗагрузки, ПоляГруппировки, Отбор, ТипОчистки, ПустыеДанныеПолей);
	
КонецФункции

Функция ПрочитатьПутиКДаннымПолей(ПолеПути, Поля=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПрочитатьПутиКДаннымПолей(ПараметрыМодуля, ПолеПути, Поля);
	
КонецФункции

Функция ЗаписатьПутиКДаннымПолей(ПолеПути, ТаблицаПутейКДаннымПолей)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ЗаписатьПутиКДаннымПолей(ПараметрыМодуля, ПолеПути, ТаблицаПутейКДаннымПолей);
	
КонецФункции

Функция ПолеВводится(ИмяПоля)
	
	Возврат ПолучитьЗначениеСвойстваПоляМодуля(ИмяПоля, "Ввод")=Истина;
	
КонецФункции

Функция ПолеВыводится(ИмяПоля)
	
	Возврат ПолучитьЗначениеСвойстваПоляМодуля(ИмяПоля, "Вывод")=Истина;
	
КонецФункции

Функция УстановитьЗначениеДанныхПоляМодуля(ИмяПоля, Значение)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьЗначениеДанныхПоляОбработки(ПараметрыМодуля, ИмяПоля, Значение);
	
КонецФункции

Функция ПолучитьЗначениеДанныхПоляМодуля(ИмяПоля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеДанныхПоляОбработки(ПараметрыМодуля, ИмяПоля);
	
КонецФункции

Функция УстановитьТаблицуОбработки(ИмяТаблицы, Источник, Видимость=Истина, знач ПоляВывода=Неопределено)
	
	Возврат СтандартныйМодуль.УстановитьТаблицуОбработки(ИмяТаблицы, Источник, Видимость, ПоляВывода);
	
КонецФункции

Функция ДобавитьЭтапВводаДанных(знач ОписаниеОбработчика, знач Группа=Неопределено, знач Место=Неопределено, знач Имя=Неопределено)
	
	Если ТипЗнч(ОписаниеОбработчика)=Тип("Строка") Тогда
		ОписаниеОбработчика = НовыйОписаниеОповещения(ОписаниеОбработчика);
	КонецЕсли;
	
	Возврат Интерфейс.ДобавитьЭтапВводаДанных(ОписаниеОбработчика, Группа, Место, Имя);
	
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, знач Модуль=Неопределено, ДополнительныеПараметры=Неопределено)
	
	Если Модуль=Неопределено Тогда
		Модуль = ЭтотОбъект;
	КонецЕсли;
	
	Возврат Интерфейс.НовыйОписаниеОповещения(ИмяПроцедуры, Модуль, ДополнительныеПараметры);
	
КонецФункции

Функция Действие(Код, ПараметрыДействия=Неопределено);
	
	Возврат Интерфейс.Действие(Код, ПараметрыДействия);
	
КонецФункции

Функция УстановитьРезультатДействия(Действие, Результат=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, Результат);
	
КонецФункции

Функция ПоказатьДиалогНаКлиенте(ОписаниеОповещения=Неопределено, Текст, знач Кнопки=Неопределено, знач Таймаут=Неопределено, КнопкаПоУмолчанию=Неопределено, Заголовок=Неопределено, ИмяЗвука=Неопределено)
	
	Возврат СтандартныйМодуль.ПоказатьДиалогНаКлиенте(ОписаниеОповещения, Текст, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, ИмяЗвука);
	
КонецФункции

#КонецОбласти

//
//						Объявление функций-
//
////////////////////////////////////////////////////////////////////////////////////////////

РК = вмс_РаботаСКоллекциями;

	
	
#КонецЕсли

