// ИСПОЛЬЗУЕТСЯ ДЛЯ ХРАНЕНИЯ КОДА

//#Область ОписаниеПеременных

//&НаКлиенте
//Перем ПеременныеКлиент, СерверныеПеременные;

//#КонецОбласти                                    

//#Область СобытияФормы 

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

//	СерверныеПеременные = ОперацииПоЯчейкамВызовСервера.ПолучитьСерверныеПеременныеДляОперации();  
//        
//    Элементы.ТоварыНоменклатура.ТолькоПросмотр = Истина;
//	Элементы.ТоварыКоличествоПлан.ТолькоПросмотр = Истина;
//	
//	Элементы.СтраницаЗавершить.Картинка = БиблиотекаКартинок.вмс_ОформлениеЗнакФлажок;
//	
//	//Для каждого КомандаКонтекстногоМеню Из Элементы.ТоварыКонтекстноеМеню.ПодчиненныеЭлементы Цикл
//	//	КомандаКонтекстногоМеню.Видимость = Ложь;
//	//КонецЦикла;

//	//НовыйЭлемент = Элементы.Добавить("КомандаПечатьЭтикетки", Тип("КнопкаФормы"),Элементы.ТоварыКонтекстноеМеню);
//	//НовыйЭлемент.ИмяКоманды = "КомандаПечатьЭтикетки";
//	 
//	 УстановитьУсловноеОформелние();
//	
//КонецПроцедуры 

//&НаСервере
//Процедура УстановитьУсловноеОформелние() 

//	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
//	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,204,153));
//	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Товары");
//	
//	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КоличествоФакт");
//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
//	ЭлементОтбора.ПравоеЗначение = 0;
//	
//	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КоличествоФакт");
//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
//	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КоличествоПлан");
//	
//	////////////////////////////////////////////////////////////////////////////////////////////////
//	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
//	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(153,255,153)); 
//	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Товары");
//	
//	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КоличествоФакт");
//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КоличествоПлан");
//	
//	////////////////////////////////////////////////////////////////////////////////////////////////
//	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
//	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,102,102));
//	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Товары");
//	
//	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КоличествоФакт");
//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
//	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КоличествоПлан");
//	
//КонецПроцедуры
// 
//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	
//	ОбработкаШтрихкодовКлиент.ПодключитьСистемуШтрихкодирования(ЭтаФорма); //Подключение через типовую библиотеку подключаемого оборудования
//	РаботаСФормамиКлиент.ПриОткрытии(ЭтаФорма, Отказ);  
//	
//	ТоварныеПоляМассив = ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля();
//	ТоварныеПоля = РаботаСКоллекциями.МассивВСтроку(ТоварныеПоляМассив);
//	ПеременныеКлиент = РаботаСФормамиКлиент.ПолучитьПараметрыФормыНаКлиенте(ЭтаФорма);
//	ПеременныеКлиент.Вставить("ТоварныеПоляМассив", ТоварныеПоляМассив);
//	ПеременныеКлиент.Вставить("ТоварныеПоля", ТоварныеПоля);
//	ПеременныеКлиент.Вставить("ИспользоватьПрисвоениеШтрихкода", ПолучитьСвойствоОперации("ИспользоватьПрисвоениеШтрихкода") = Истина);
//	
//	Если ЗначениеЗаполнено(ПеременныеКлиент.Основание) Тогда		
//		ПакетМетодов = Новый Массив;	
//		ПакетМетодов.Добавить(ОперацииПоЯчейкамКлиентСервер.ПолучитьОписаниеМетодаОсновнойБД_ПолучитьТоварыПоДокументам(ПеременныеКлиент.Основание.Ссылка, "ТоварыПоОснованию", ПеременныеКлиент.ВидОперации));
//		ПакетМетодов.Добавить(ОперацииПоЯчейкамКлиентСервер.ПолучитьОписаниеМетодаОсновнойБД_ПолучитьТаблицуПринятыхТоваров(ПеременныеКлиент.Основание.Ссылка, ПеременныеКлиент.ВидОперации,,,"ПринятыеТовары",,
//		"Товар, Характеристика, Серия, Качество"));
//		ПакетРезультатов = ОбращенияКИСКлиентСервер.ВыполнитьПакетМетодовОсновнойБД(ПакетМетодов);
//		
//		Если ПакетРезультатов <> Неопределено Тогда
//			
//			ДанныеПоЗапросам = Новый Соответствие;
//			
//			Для Каждого ПакетРезультата Из ПакетРезультатов Цикл   
//				Результат = ПакетРезультата.Результат;
//				ДанныеПоЗапросам[ПакетРезультата.Имя] = Результат;
//			КонецЦикла;  
//			
//			МассивТоваров = ДанныеПоЗапросам["ТоварыПоОснованию"].Строки;	
//			МассивПринятыхТоваров = ДанныеПоЗапросам["ПринятыеТовары"].Строки; 
//			Для каждого Строка Из МассивТоваров Цикл 
//				НовыйТовар = Товары.Добавить(); 
//				НовыйТовар.Товар = Строка.Товар; 
//				//НовыйТовар.Характеристика = Строка.Характеристика;
//				НовыйТовар.КоличествоФакт = ПолучитьКоличествоПринятогоТовара(Строка.Товар,МассивПринятыхТоваров);
//				НовыйТовар.Количество = НовыйТовар.КоличествоФакт;		
//				
//				НовыйТовар.КоличествоПлан = Строка.Количество;			
//				НовыйТовар.ТоварПредставление = "" + НовыйТовар.Товар;
//				Если ЗначениеЗаполнено(НовыйТовар.Характеристика) Тогда 
//					НовыйТовар.ТоварПредставление = НовыйТовар.ТоварПредставление + Символы.ПС + "•Хар-ка: "+ НовыйТовар.Характеристика; 
//				КонецЕсли; 		
//			КонецЦикла;
//			
//			
//		КонецЕсли;
//	КонецЕсли;
//	
//	ПрограммнаяНастройкаФормы();
//	
//КонецПроцедуры

////&НаКлиенте
//Процедура ГруппаСтраницПриСменеСтраницы(Элемент, ТекущаяСтраница)	
//	Если ТекущаяСтраница.Имя = "СтраницаЗавершить" Тогда  
//		Если Товары.Количество() <> 0 Тогда	    
//			
//				ОбработкаВопроса = Новый ОписаниеОповещения("ОбработчикВопросаДействиеСОперацией", ЭтаФорма, Неопределено);
//				
//				СписокОтветов = Новый СписокЗначений; 
//				СписокОтветов.Добавить(Неопределено, "Отмена");
//				Если ПеременныеКлиент.Основание <> Неопределено  Тогда
//					СписокОтветов.Добавить(Ложь, "Сохранить"); 	
//				КонецЕсли;
//				                                                               
//				СписокОтветов.Добавить(Истина, "Закончить");
//				ПоказатьВопрос(ОбработкаВопроса, "Выберите действие с операцией", СписокОтветов);
//							
//			//ЗавершитьОперацию(ПеременныеКлиент);
//			//ОперацииПоЯчейкамКлиент.ЗавершениеОперацииНовая(ЭтаФорма);
//			//ЭтаФорма.Закрыть();
//		Иначе 
//			ЭтаФорма.ТекущийЭлемент = Элементы.ТаварыТаб;
//			РаботаСоЗвукомКлиент.ЗвукОшибка();
//			ПоказатьПредупреждение(, "Таблица пустая")
//		КонецЕсли;
//	КонецЕсли; 
//		
//КонецПроцедуры  

//&НаКлиенте
//Функция ОбработчикВопросаДействиеСОперацией(Ответ, ПараметрыЗавершения) Экспорт
//	
//	Если Ответ <> Неопределено Тогда 
//		ЗавершитьОперацию(ПеременныеКлиент, Ответ);
//		РаботаСФормамиКлиент.ОткрытьФормуИзМакета(ФормаЗавершения());
//	КонецЕсли; 
//	
//КонецФункции

//&НаКлиенте
//Процедура ПриЗакрытии(ЗавершениеРаботы)
//	РаботаСФормамиКлиент.ПриЗакрытии(ЭтаФорма);	
//КонецПроцедуры

//&НаКлиенте
//Процедура КомандаПечатьЭтикетки(Команда)

//	ДанныеПечати = Новый Структура;
//	ДанныеПечати.Вставить("Товар", Элементы.Товары.ТекущиеДанные.Товар);
//	ПечатьКлиент.НачатьПечатьЭтикетки(ДанныеПечати);

//КонецПроцедуры

//&НаКлиенте
//Процедура ТоварыКоличествоПриИзменении(Элемент)
//    
//    ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
//    
//    Если ТекущиеДанные.Количество > ТекущиеДанные.КоличествоПлан И ЗначениеЗаполнено(ПеременныеКлиент.Основание) Тогда
//    	ОбщегоНазначенияКлиент.СообщитьПользователю("Превышено количество товара по плану: " + ТекущиеДанные.Товар);
//    КонецЕсли;

//КонецПроцедуры

//#КонецОбласти

//#Область УниверсальныеСлужебныеФункции

//&НаКлиенте
//Процедура Подключаемый_ВыполнитьКоманду(Команда)
//	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, Неопределено);
//КонецПроцедуры

////Для того, чтобы получить серверную форму, например, для добавления новых элементов формы
//&НаСервере
//Функция СлужебнаяФункцияВызовСервера(ПрограммныйКод, ДополнительныеПараметры=Неопределено) Экспорт
//	Возврат ОбщегоНазначенияВызовСервера.СлужебнаяФункцияВызовСервераНаФорме(ЭтаФорма, ПрограммныйКод, ДополнительныеПараметры);
//КонецФункции

//#КонецОбласти

//#Область СлужебныеПроцедуры 

//&НаСервере
//Функция ПровестиДокументОперацииПоЯчейкам(ПеременныеКлиент, ЗавершитьОперацию)
//	
//	Документ = Неопределено;       
//		
//	Если Товары.Количество()<>0  Тогда
//		Документ = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
//		Документ.Заполнить(Неопределено);
//		Документ.Ответственный = вмс_РаботаСПользователямиСервер.ТекущийОтветственный();
//		Документ.ВидОперации = ПеременныеКлиент.ВидОперации;
//		Документ.ВремяНачалаОперации = ТекущаяДата();
//			
//		Если ЗначениеЗаполнено(ПеременныеКлиент.Основание) Тогда	
//			Документ.ДокументОснование = ПеременныеКлиент.Основание.Ссылка;			
//		КонецЕсли;		
//		
//		Документ.Дата = ТекущаяДата();
//		Документ.Готов = ЗавершитьОперацию;
//		Для каждого СтрТовары Из Товары  Цикл
//		
//			Если СтрТовары.КоличествоФакт = 0 Тогда
//				Продолжить;
//			КонецЕсли;
//		
//			НовыйТовар = Документ.Товары.Добавить();	
//			НовыйТовар.Товар = СтрТовары.Товар;
//			//НовыйТовар.Серия = СтрТовары.Серия;
//			//НовыйТовар.Характеристика = СтрТовары.Характеристика;
//			//НовыйТовар.Упаковка = СтрТовары.Упаковка;
//			НовыйТовар.Количество = СтрТовары.КоличествоФакт;
//		КонецЦикла; 
//		
//		Документ.ВремяОкончанияОперации = ТекущаяДата();
//		
//		Попытка
//			Документ.Записать(РежимЗаписиДокумента.Проведение);
//		Исключение
//			Документ.Записать();
//		КонецПопытки;
//		
//	КонецЕсли;
//	
//	Возврат Документ.Ссылка;
//	
//КонецФункции

//&НаСервере
//Процедура ЗавершитьОперацию(ПеременныеКлиент, ЗавершитьОперацию)	
//	
//	ДокументТСД = ПровестиДокументОперацииПоЯчейкам(ПеременныеКлиент,ЗавершитьОперацию);
//	
//	ПакетМетодов = Новый Массив;
//	ПакетМетодов.Добавить(ОбращенияКИСКлиентСервер.ПолучитьОписаниеМетодаОсновнойБД_ВыполнитьОбмен());
//	Если ЗначениеЗаполнено(ПеременныеКлиент.Основание.Ссылка) Тогда
//		Если ЗавершитьОперацию Тогда
//			ПакетМетодов.Добавить(ОбращенияКИСКлиентСервер.ПолучитьОписаниеМетода("вмс_ОперацииПоЯчейкамВызовСервера.ЗавершитьОперациюПоДокументу", Истина, ПеременныеКлиент.Основание.Ссылка, ПеременныеКлиент.ВидОперации, РаботаСПользователямиСервер.ТекущийОтветственный(), Неопределено, ДокументТСД));
//		Иначе
//			//ПакетМетодов.Добавить(ОбращенияКИСКлиентСервер.ПолучитьОписаниеМетода("вмс_ОперацииПоЯчейкамВызовСервера.ЗавершитьОперациюПоДокументу", Истина, ПеременныеКлиент.Основание.Ссылка, ПеременныеКлиент.ВидОперации, РаботаСПользователямиСервер.ТекущийОтветственный(), Неопределено, ДокументТСД));
//			ПакетМетодов.Добавить(ОперацииПоЯчейкамКлиентСервер.ПолучитьОписаниеМетодаОсновнойБД_СохранитьОперациюПоДокументу(ПеременныеКлиент.Основание, ПеременныеКлиент.ВидОперации, РаботаСПользователямиСервер.ТекущийОтветственный(), Неопределено));
//		КонецЕсли;
//	Иначе
//		ПакетМетодов.Добавить(ОбращенияКИСКлиентСервер.ПолучитьОписаниеМетода("вмс_ОперацииПоЯчейкамВызовСервера.ЗавершитьОперациюПоДокументу", Истина, Неопределено , ПеременныеКлиент.ВидОперации, РаботаСПользователямиСервер.ТекущийОтветственный(), Неопределено, ДокументТСД));
//	КонецЕсли;
//		
//	ПакетРезультатов = ОбращенияКИСКлиентСервер.ВыполнитьПакетМетодовОсновнойБД(ПакетМетодов);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПрограммнаяНастройкаФормы()
//	
//	Элементы.ТоварыНоменклатура.АвтоВысотаЯчейки = Истина;
//	
//КонецПроцедуры 

//&НаСервере
//Функция ФормаЗавершения()
//	Возврат Справочники.вмс_ИнтерфейсыТСД.НайтиПоНаименованию("Успешное завершение операции");
//КонецФункции

//&НаКлиенте
//Функция ПолучитьСвойствоОперации(ИмяСвойства)
//	
//	Возврат ОперацииПоЯчейкамКлиент.ПолучитьСвойствоОперации(ЭтаФорма, ИмяСвойства);

//КонецФункции

//&НаСервере
//Функция ПолучитьИсточникДанных(ТЗ)  
//	Колонки = Товары.Выгрузить().Колонки;
//	Для каждого Колонка Из Колонки Цикл
//		РаботаСКоллекциями.ДобавитьКолонкуКоллекции(ТЗ, Колонка.Имя,,Колонка.Заголовок,Колонка.Ширина);
//	КонецЦикла;
//	
//	Для каждого Строка Из Товары Цикл
//		СтрокаКакБыТаблицы = РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(ТЗ);
//		ЗаполнитьЗначенияСвойств(СтрокаКакБыТаблицы, Строка);		
//	КонецЦикла;
//КонецФункции

//&НаКлиенте
//Функция ПолучитьКоличествоПринятогоТовара(Товар, МассивПринятыхТоваров)
//	Количество = 0;	
//	Для каждого ПринятыйТовар Из МассивПринятыхТоваров Цикл
//	
//		Если Товар = ПринятыйТовар.Товар Тогда
//		
//			КоличествоФакт = КоличествоФакт + ПринятыйТовар.Количество;	
//		
//		КонецЕсли;	
//	
//	КонецЦикла;

//	Возврат Количество;

//КонецФункции

//#Область Штрихкоды

//&НаКлиенте
//Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) 
//	Если ВводДоступен() Тогда
//		Если Источник = "ПодключаемоеОборудование" Тогда			
//			Данные = Параметр[0];
//			Если ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "ScanDataBase64"  Тогда
//				ОбработкаВводаШтрихкода(Данные,Неопределено);   
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;	
//КонецПроцедуры 

//&НаКлиенте
//Функция ОбработкаВводаШтрихкода(Штрихкод, ДополнительныеПараметры = Неопределено) Экспорт    
//	
//	ОписаниеМетода = ОбращенияКИСКлиентСервер.ПолучитьОписаниеМетода("вмс_ОбработкаШтрихкодовВызовСервера.ОбработатьШтрихкод",Истина, Штрихкод);
//	Результат = ОбращенияКИСВызовСервера.ВыполнитьМетодОсновнойБД(ОписаниеМетода);
//	//Результат = ОбработкаШтрихкодовКлиент.ОбработатьШтрихкодНовая(ЭтаФорма, Штрихкод);
//	
//	Если Результат.Количество() <> 0 Тогда
//						
//		НайденныйТовар = Товары.НайтиСтроки(Новый Структура("Товар",  Результат.Получить("Номенклатура").Ссылка));
//		Если НайденныйТовар.Количество() = 1 Тогда
//			НайденныйТовар[0].КоличествоФакт = НайденныйТовар[0].КоличествоФакт + 1; 
//			
//			Если НайденныйТовар[0].КоличествоФакт > НайденныйТовар[0].КоличествоПлан Тогда
//    			ОбщегоНазначенияКлиент.СообщитьПользователю("Превышено количество товара по плану: " + НайденныйТовар[0].Товар);
//   			КонецЕсли;
//			
//		ИначеЕсли НайденныйТовар.Количество() = 0 Тогда
//			СтрТовар = Товары.Добавить();
//			СтрТовар.Товар =  Результат.Получить("Номенклатура").Ссылка;
//			ЛогированиеВызовСервера.НовыйЛог("" + ТипЗнч(СтрТовар.Товар) + " " + СтрТовар.Товар);
//			СтрТовар.Штрихкод = Результат.Получить("Номенклатура").Штрихкод;
////			СтрТовар.Характеристика = Результат.Получить("ХарактеристикиНоменклатур").Ссылка; 
////			СтрТовар.Серия = Результат.Получить("Серия").Ссылка;
////			СтрТовар.Упаковка = Результат.Получить("Упаковка").Ссылка;
//			СтрТовар.КоличествоФакт = 1;
//			СтрТовар.ТоварПредставление = "" + СтрТовар.Товар; // + Символы.ПС + "•Хар-ка: "+ СтрТовар.Характеристика;
//			ОбщегоНазначенияКлиент.СообщитьПользователю("Превышено количество товара по плану: " + СтрТовар.Товар);		
//		КонецЕсли;
//		 
//	Иначе
//		//РаботаСоЗвукомКлиент.ЗвукОшибка();
//		//ПоказатьПредупреждение(, "Товар не найден");
//		
//		//Если Не ШтрихкодРазпознан Тогда
//		РаботаСоЗвукомКлиент.ЗвукНераспознано(); 
//		// ТУ_Прошин_05.07.23++  
//		//Если ПараметрыКлиент.ИспользоватьПрисвоениеШтрихкода Тогда
//		НачатьПрисвоениеШтрихкодаНоменклатуре(Штрихкод);    
//		//Иначе
//		//	ПоказатьПредупреждение(,"Штрихкод отсутствует в базе: " + Штрихкод);
//		//КонецЕсли;
//		// ТУ_Прошин_05.07.23--
//		Возврат Ложь;
// 

//		
//	КонецЕсли;
//	
//КонецФункции 

//&НаКлиенте
//Функция ОбработатьПрисвоениеШтрихкодаТовару(Результат, ДополнительныеПараметры) Экспорт
//	Если Результат = Истина Тогда
//		ОбработкаШтрихкодовКлиент.УдалитьШтрихкодыИзКэша(ЭтаФорма, ДополнительныеПараметры.ШтрихкодДляПрисвоения);
//		ПовторитьВводШтрихкода = ДополнительныеПараметры.ПовторитьВводШтрихкода;
//		Если ПовторитьВводШтрихкода <> Неопределено Тогда
//			ОбработкаШтрихкодовКлиент.УдалитьШтрихкодыИзКэша(ЭтаФорма, ДополнительныеПараметры.УдалитьШтрихкодИзКэша);
//			ОбработкаВводаШтрихкода(ПовторитьВводШтрихкода);
//		КонецЕсли;
//	КонецЕсли;
//КонецФункции

// &НаКлиенте
//Функция НачатьПрисвоениеШтрихкодаНоменклатуре(Штрихкод)
//	
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("ПовторитьВводШтрихкода", Штрихкод);
//	ДополнительныеПараметры.Вставить("УдалитьШтрихкодИзКэша", Штрихкод);
//	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьПрисвоениеШтрихкодаТовару", ЭтаФорма, ДополнительныеПараметры);
//	
//	ШтрихкодДляПрисвоения = Штрихкод;
//		
//	ДополнительныеПараметры.Вставить("ШтрихкодДляПрисвоения", ШтрихкодДляПрисвоения);
//	ТаблицаТоваров = РаботаСКоллекциями.НоваяКоллекцияЗначений(ПеременныеКлиент.ТоварныеПоляМассив);
//	Товары2 = Товары;
//	РаботаСКоллекциями.ДобавитьЭлементыКоллекции(ТаблицаТоваров, Товары2);
//	ПрисвоениеШтрихкодаКлиент.ОбработатьНеизвестныйШтрихкод(ШтрихкодДляПрисвоения, ПеременныеКлиент.Основание.Ссылка, ТаблицаТоваров, ЭтаФорма, ОписаниеОповещения);
//	
//КонецФункции



//#КонецОбласти



//#КонецОбласти