
Функция ЗагрузитьДокументHTMLИзТекста(ТекстHTML) Экспорт
	
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(ТекстHTML);
	ПостроительDOM = Новый ПостроительDOM;
	Возврат ПостроительDOM.Прочитать(ЧтениеHTML);
	
КонецФункции

Функция ПолучитьТекстДокументаHTML(ДокументHTML) Экспорт
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьHTML = Новый ЗаписьHTML;
	ЗаписьHTML.УстановитьСтроку();
	ЗаписьDOM.Записать(ДокументHTML, ЗаписьHTML);
	ТекстHTML = ЗаписьHTML.Закрыть();
	Возврат ТекстHTML;
	
КонецФункции

Функция ПолучитьТекстДанныхHTML(ДанныеHTML) Экспорт
	
	Возврат ПолучитьТекстДокументаHTML(ДанныеHTML.ДокументHTML);
	
КонецФункции

Функция ВставитьБинарныеДанныеКартинокВТекстHTML(ПолноеИмяФайла)
	
	ЧтениеТекста = Новый ЧтениеТекста(ПолноеИмяФайла);
	ТекстHTML = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	ИмяФайла = "";
	ПутьФайла = "";
	вмс_РаботаСФайламиКлиентСервер.ПолучитьИмяИПутьФайла(ПолноеИмяФайла, ИмяФайла, ПутьФайла);
	
	ДокументHTML = ЗагрузитьДокументHTMLИзТекста(ТекстHTML);
	Для Каждого Картинка Из ДокументHTML.Картинки Цикл
		ИмяФайлаКартинки = Картинка.ПолучитьАтрибут("src");
		РасширениеКартинки = вмс_РаботаСФайламиКлиентСервер.ПолучитьРасширениеФайла(ИмяФайлаКартинки);
		ПолноеИмяФайлаКартинки = ПутьФайла + ИмяФайлаКартинки;
		ДвоичныеДанныеКартинки = Новый ДвоичныеДанные(ПолноеИмяФайлаКартинки);
		Base64ДанныеКартинки = Base64Строка(ДвоичныеДанныеКартинки);
		Картинка.УстановитьАтрибут("src", "data:image/" + РасширениеКартинки + ";base64," + Base64ДанныеКартинки);
	КонецЦикла;
	
	ТекстHTML = ПолучитьТекстДокументаHTML(ДокументHTML);
	
	Возврат ТекстHTML;
	
КонецФункции

Функция ДополнитьПутиКартинокВТекстеHTML(ПолноеИмяФайла)
	
	ЧтениеТекста = Новый ЧтениеТекста(ПолноеИмяФайла);
	ТекстHTML = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	ИмяФайла = "";
	ПутьФайла = "";
	вмс_РаботаСФайламиКлиентСервер.ПолучитьИмяИПутьФайла(ПолноеИмяФайла, ИмяФайла, ПутьФайла);
	
	ДокументHTML = ЗагрузитьДокументHTMLИзТекста(ТекстHTML);
	Для Каждого Картинка Из ДокументHTML.Картинки Цикл
		ИмяФайлаКартинки = Картинка.ПолучитьАтрибут("src");
		ПолноеИмяФайлаКартинки = ПутьФайла + ИмяФайлаКартинки;
		Картинка.УстановитьАтрибут("src", "file://" + ПолноеИмяФайлаКартинки);
	КонецЦикла;
	
	ТекстHTML = ПолучитьТекстДокументаHTML(ДокументHTML);
	
	Возврат ТекстHTML;
	
КонецФункции

Функция ПолучитьДанныеHTMLИзТабличногоДокумента(ТабличныйДокумент) Экспорт
	
	ПолноеИмяФайла = ПолучитьИмяВременногоФайла("html");
	ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.HTML4);
	
	ЧтениеТекста = Новый ЧтениеТекста(ПолноеИмяФайла);
	ТекстHTML = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	ИмяФайла = "";
	ПутьФайла = "";
	вмс_РаботаСФайламиКлиентСервер.ПолучитьИмяИПутьФайла(ПолноеИмяФайла, ИмяФайла, ПутьФайла);
	
	ДокументHTML = ЗагрузитьДокументHTMLИзТекста(ТекстHTML);
	Картинки = Новый Соответствие;
	Для Каждого Картинка Из ДокументHTML.Картинки Цикл
		ИмяФайлаКартинки = Картинка.ПолучитьАтрибут("src");
		РасширениеКартинки = вмс_РаботаСФайламиКлиентСервер.ПолучитьРасширениеФайла(ИмяФайлаКартинки);
		ПолноеИмяФайлаКартинки = ПутьФайла + ИмяФайлаКартинки;
		ДвоичныеДанныеКартинки = Новый ДвоичныеДанные(ПолноеИмяФайлаКартинки);
		Картинки[ИмяФайлаКартинки] = Новый Структура("Имя, ДвоичныеДанные, Расширение", ИмяФайлаКартинки, ДвоичныеДанныеКартинки, РасширениеКартинки);
	КонецЦикла;
	
	//очистка
	КаталогДокумента = "";
	вмс_РаботаСФайламиКлиентСервер.ПолучитьРасширениеФайла(ПолноеИмяФайла, КаталогДокумента);
	КаталогДокумента = КаталогДокумента + "_files";
	УдалитьФайлы(ПолноеИмяФайла);
	УдалитьФайлы(КаталогДокумента);
	
	//РЕЗУЛЬТАТ!!!
	ДанныеHTML = Новый Структура("ДокументHTML, Картинки", ДокументHTML, Картинки);
	Возврат ДанныеHTML;
	
КонецФункции
