&НаКлиенте
Перем ПеременныеКлиент;

&НаКлиенте
Процедура Тест1()
	Таблица1 = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений();
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица1, "Товар");
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица1, "Количество", Новый ОписаниеТипов("Число"));
	
	НоваяСтрока = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица1);
	НоваяСтрока.Товар = "Товар1";
	НоваяСтрока.Количество = 1;
	
	НоваяСтрока = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица1);
	НоваяСтрока.Товар = "Товар2";
	НоваяСтрока.Количество = 1;
	
	НоваяСтрока = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица1);
	НоваяСтрока.Товар = "Товар2";
	НоваяСтрока.Количество = 5;
	
	НоваяСтрока = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица1);
	НоваяСтрока.Товар = "Товар3";
	НоваяСтрока.Количество = 5;
	
	НоваяСтрока = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица1);
	НоваяСтрока.Товар = "Товар1";
	НоваяСтрока.Количество = 2;
	
	НоваяСтрока = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица1);
	НоваяСтрока.Товар = "Товар1";
	НоваяСтрока.Количество = 1;
	
	НайденныеСтроки = вмс_РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(Таблица1, Новый Структура("Товар", "Товар1"));
	Таблица2 = вмс_РаботаСКоллекциями.СкопироватьКвазиТаблицуЗначений(Таблица1, НайденныеСтроки);
	
	Таблица3 = вмс_РаботаСКоллекциями.СкопироватьКвазиТаблицуЗначений(Таблица1);
	вмс_РаботаСКоллекциями.ДобавитьИндексыКвазиТаблицыЗначений(Таблица3, "Товар");
	вмс_РаботаСКоллекциями.ИндексироватьКвазиТаблицу(Таблица3);
	вмс_РаботаСКоллекциями.СвернутьКвазиТаблицуЗначений(Таблица3, , "Количество");
	
	Тест1НаСервере(Таблица1);
КонецПроцедуры

&НаСервере
Процедура Тест1НаСервере(КвазиТаблица)
	Таблица = вмс_РаботаСКоллекциями.ВыгрузитьКвазиТаблицуЗначенийВИстиннуюТаблицуЗначений(КвазиТаблица);
	Таблица.Свернуть("Товар", "Количество");
	КвазиТаблица2 = вмс_РаботаСКоллекциями.ЗагрузитьКвазиТаблицуЗначенийИзТаблицыЗначений(Таблица);
КонецПроцедуры

&НаКлиенте
Процедура Тест2()
КонецПроцедуры

&НаСервере
Процедура Тест3(Параметр, Параметр2)
	
	//Массив = Новый Массив;
	//
	//Вариант = 2;
	//Если Вариант = 1 Тогда
	//	ИмяПоля = "";
	//	Массив.Добавить(7);
	//	Массив.Добавить(6);
	//	Массив.Добавить(5);
	//	Массив.Добавить(9);
	//	Массив.Добавить(9);
	//	Массив.Добавить(8);
	//	Массив.Добавить(7);
	//	Массив.Добавить(4);
	//	Массив.Добавить(2);
	//	Массив.Добавить(4);
	//	Количество = Массив.Количество();
	//Иначе
	//	ИмяПоля = "Поле1";
	//	Количество = 100;
	//	ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел(1);
	//	Для Номер=1 По Количество Цикл
	//		Число = ГенераторСлучайныхЧисел.СлучайноеЧисло(1, Количество);
	//		Строка = Новый Структура(ИмяПоля, Число);
	//		Массив.Добавить(Строка);
	//	КонецЦикла;
	//КонецЕсли; 
	//
	//Середина = Цел(Количество/2) - 1;
	//Массив2 = вмс_РаботаСКоллекциями.СкопироватьМассив(Массив);
	//вмс_РаботаСКоллекциями.СортироватьКоллекцию(Массив2, ИмяПоля, 0, Середина, Ложь);
	//вмс_РаботаСКоллекциями.СортироватьКоллекцию(Массив2, ИмяПоля, Середина+1, Количество-1, Истина);
	//
	//вмс_РаботаСКоллекциями.СортироватьКоллекцию(Массив2, ИмяПоля);
	//вмс_РаботаСКоллекциями.СортироватьКоллекцию(Массив2, ИмяПоля);
	
	Таблица = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений("Поле1, Поле2");
	
	Строка = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица);
	Строка.Поле1 = 3;
	Строка.Поле2 = 1;
	
	Строка = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица);
	Строка.Поле1 = 3;
	Строка.Поле2 = 4;
	
	Строка = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица);
	Строка.Поле1 = 3;
	Строка.Поле2 = 2;
	
	Строка = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица);
	Строка.Поле1 = 2;
	Строка.Поле2 = 3;
	
	Строка = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица);
	Строка.Поле1 = 2;
	Строка.Поле2 = 4;
	
	Строка = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица);
	Строка.Поле1 = 2;
	Строка.Поле2 = 1;
	
	Строка = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица);
	Строка.Поле1 = 3;
	Строка.Поле2 = 3;
	
	Строка = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица);
	Строка.Поле1 = 1;
	Строка.Поле2 = 55;
	
	Таблица2 = вмс_РаботаСКоллекциями.ВыгрузитьКвазиТаблицуЗначенийВИстиннуюТаблицуЗначений(Таблица);
	Таблица2.Сортировать("Поле1, Поле2");
	
	вмс_РаботаСКоллекциями.ДобавитьИндексыКвазиТаблицыЗначений(Таблица, "Поле1, Поле2");
	вмс_РаботаСКоллекциями.ДобавитьИндексыКвазиТаблицыЗначений(Таблица, "Поле1");
	вмс_РаботаСКоллекциями.ДобавитьИндексыКвазиТаблицыЗначений(Таблица, "Поле2");
	вмс_РаботаСКоллекциями.СортироватьКвазиТаблицуЗначений(Таблица, "Поле1, Поле2");
	НайденныеСтроки = вмс_РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(Таблица, Новый Структура("Поле1, Поле2", 2, 4));
	НайденныеСтроки = вмс_РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(Таблица, Новый Структура("Поле2", 1));
	
	
	ОбщийЭлемент = Новый Структура;
	ОбщийЭлемент.Вставить("Поле", 1);
	
	КонтейнерСоСсылками = Новый Структура;
	КонтейнерСоСсылками.Вставить("Поле1", ОбщийЭлемент);
	КонтейнерСоСсылками.Вставить("Поле2", ОбщийЭлемент);
	
	ОбщийЭлемент.Поле = ОбщийЭлемент.Поле + 1;
	
	Параметр = КонтейнерСоСсылками;
	Параметр2 = ОбщийЭлемент;
КонецПроцедуры

&НаСервере
Процедура Тест4()
	
	Таблица1 = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений();
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица1, "Товар");
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица1, "Характеристика");
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица1, "Количество", Новый ОписаниеТипов("Число"));
	
	Для НомерТовара=1 По 10 Цикл
		Для НомерХарактеристики=1 По 10 Цикл
			НоваяСтрока = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица1);
			НоваяСтрока.Товар = "Товар" + НомерТовара;
			НоваяСтрока.Характеристика = "Характеристика" + НомерХарактеристики;
		КонецЦикла;
	КонецЦикла;
	
	Индексировать = Истина;
	Если Индексировать Тогда
		вмс_РаботаСКоллекциями.ДобавитьИндексыКвазиТаблицыЗначений(Таблица1, "Товар");
		вмс_РаботаСКоллекциями.ИндексироватьКвазиТаблицу(Таблица1);
	КонецЕсли; 
	
	Отбор = Новый Структура("Товар, Характеристика", "Товар2", "Характеристика5");
	
	ЗамерВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	НайденныеСтроки1 = вмс_РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(Таблица1, Отбор);
	ЗамерВремени = ТекущаяУниверсальнаяДатаВМиллисекундах() - ЗамерВремени;
	ОбщегоНазначения.СообщитьПользователю("Время1 = " + ЗамерВремени);
	
	Таблица2 = вмс_РаботаСКоллекциями.ВыгрузитьКвазиТаблицуЗначенийВИстиннуюТаблицуЗначений(Таблица1);
	ЗамерВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	НайденныеСтроки2 = Таблица2.НайтиСтроки(Отбор);
	ЗамерВремени = ТекущаяУниверсальнаяДатаВМиллисекундах() - ЗамерВремени;
	ОбщегоНазначения.СообщитьПользователю("Время2 = " + ЗамерВремени);
	
	Пока Таблица1.Строки.Количество() > 0 Цикл
		вмс_РаботаСКоллекциями.УдалитьСтрокиКвазиТаблицыЗначений(Таблица1, Таблица1.Строки[0]);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ЭлементИндексаКвазиТаблицыЗначений()
	ЭлементИндекса = Новый Структура;
	ЭлементИндекса.Вставить("Родитель");
	ЭлементИндекса.Вставить("Ключ");
	ЭлементИндекса.Вставить("Индексы", Новый Соответствие);
	Возврат ЭлементИндекса;
КонецФункции

&НаСервере
Процедура Тест5(Параметр)
	
	Строка = Новый Структура;
	Строка.Вставить("Поле1", 1);
	Строки = Новый Массив;
	Строки.Добавить(Строка);
	
	ЭлементИндекса = ЭлементИндексаКвазиТаблицыЗначений();
	
	ИндексыСтрок = Новый Соответствие;
	ИндексыСтрок[Строка] = ЭлементИндекса;
	
	Индексы = Новый Структура;
	Индексы.Вставить("ИндексыСтрок", ИндексыСтрок);
	
	Таблица = Новый Структура;
	Таблица.Вставить("ИндексыСтрок", ИндексыСтрок);
	Таблица.Вставить("СтруктураИндексов", ЭлементИндекса);
	Таблица.Вставить("Строки", Строки);
	
	Таблица = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений("Поле1, Поле2");
	НоваяСтрока = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица);
	НоваяСтрока.Поле1 = "А";
	НоваяСтрока.Поле2 = "1";
	вмс_РаботаСКоллекциями.ДобавитьИндексыКвазиТаблицыЗначений(Таблица, "Поле1");
	вмс_РаботаСКоллекциями.ИндексироватьКвазиТаблицу(Таблица);
	Параметр = Таблица;
	
КонецПроцедуры

&НаСервере
Процедура Тест6(Параметр,Параметр2)
	
КонецПроцедуры

&НаСервере
Процедура Тест7()
	Таблица = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений("Поле1, Поле2");
	Строка = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица);
	Строка.Поле1 = "А";
	Строка.Поле2 = "1";
	
	Строка = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица);
	Строка.Поле1 = "А";
	Строка.Поле2 = "2";
	
	ПредставлениеТаблицы = ЗначениеВСтрокуВнутр(Таблица.Строки);
	
	Строки = ЗначениеИзСтрокиВнутр(ПредставлениеТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура Тест8()
	
	КлавиатурнаяПанель = вмс_РаботаСФормамиКлиент.НоваяКлавиатурнаяПанель(ЭтаФорма);
	вмс_РаботаСФормамиКлиент.ДобавитьКнопкиИКомандыКлавиатурнойПанели(КлавиатурнаяПанель, "#01");
	вмс_РаботаСФормамиКлиент.ДобавитьКнопкиИКомандыКлавиатурнойПанели(КлавиатурнаяПанель, "!@2");
	вмс_РаботаСФормамиКлиент.ДобавитьКнопкиИКомандыКлавиатурнойПанели(КлавиатурнаяПанель, "aA");
	вмс_РаботаСФормамиКлиент.КлавиатурнаяПанель_ДобавитьСлушателя(КлавиатурнаяПанель, "Прослушка", Новый ОписаниеОповещения("ОбработкаПрослушки", ЭтаФорма));
	ПеременныеКлиент.Вставить("КлавиатурнаяПанель", КлавиатурнаяПанель);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПрослушки(Ввод, ДополнительныеПараметры) Экспорт
	Подсказка = Подсказка + Ввод;
КонецПроцедуры

&НаСервере
Процедура Тест9НаСервере(Таблица)
КонецПроцедуры

&НаКлиенте
Процедура Тест9()
	
	ПоляТаблицы = "Поле1, Поле2, Поле3";
	Таблица = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений(ПоляТаблицы);
	вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ПоляТаблицы, 1, 1));
	вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ПоляТаблицы, 1, 2));
	вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ПоляТаблицы, 2, 1, 1));
	вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ПоляТаблицы, 2, 1, 2));
	вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ПоляТаблицы, 2, 1, 3));
	вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ПоляТаблицы, 2, 2));
	вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ПоляТаблицы, 2, 3));
	вмс_РаботаСКоллекциями.ДобавитьИндексыКвазиТаблицыЗначений(Таблица, ПоляТаблицы);
	
	СИ = вмс_РаботаСКоллекциями.МенеджерИндексирования_ПодобратьИндекс(Таблица.МенеджерИндексирования, ПоляТаблицы);
	ЭлементИндекса = вмс_РаботаСКоллекциями.НайтиЭлементИндекса(СИ, Новый Структура("Поле1, Поле2", 2, 1));
	вмс_РаботаСКоллекциями.ОчиститьЭлементИндекса(СИ, ЭлементИндекса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикАнимирования()
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПеременныеКлиент = Новый Структура;
КонецПроцедуры

&НаСервере
Процедура Тест10НаСервере()

	GUID = Новый УникальныйИдентификатор("b3548c53-ecc7-11e4-92f1-0050568b35ac");
	
	Запрос = Новый Запрос;
	ПараметрыЗапроса = Запрос.Параметры;
	ПараметрыЗапроса.Вставить("Ссылка", Справочники.ФизическиеЛица.ПолучитьСсылку(GUID));
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка,
	|	ФизическиеЛица.Наименование КАК Наименование,
	|   Пользователи.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО (ФизическиеЛица.Ссылка = Пользователи.ФизическоеЛицо)
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &Ссылка
	|	И ФизическиеЛица.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.Текст = ТекстЗапроса;
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	вмс_Сервер.ПреобразоватьСсылкиВКвазиСсылкиВТаблице(Таблица);
	
	МассивПользователей = Таблица.ВыгрузитьКолонку("Пользователь");
	вмс_Обмен_с_КИС_ВызовСервера.ПреобразоватьКвазиСсылкиВСсылкиВМассиве(МассивПользователей);
	
КонецПроцедуры

&НаСервере
Процедура Тест11НаСервере()

	Таблица2 = Новый ТаблицаЗначений;
	Таблица2.Колонки.Добавить("Поле1");
	Таблица2.Колонки.Добавить("Поле2");
	
	Строка = Таблица2.Добавить();
	Строка.Поле1 = "пп";
	Строка.Поле2 = "ппп";
	
	Таблица1 = Новый ТаблицаЗначений;
	Таблица1.Колонки.Добавить("Поле1");
	Таблица1.Колонки.Добавить("Поле2");
	
	Строка = Таблица1.Добавить();
	Строка.Поле1 = "1";
	Строка.Поле2 = "2";
	
	Строка = Таблица1.Добавить();
	Строка.Поле1 = Таблица2;
	Строка.Поле2 = "3";
	
	СсылкиНаЗначения = вмс_РаботаСКоллекциями.РазложитьСтруктуруДанныхВМассивСсылокНаЗначения(Таблица1)

КонецПроцедуры

&НаСервере
Процедура Тест12()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номер", "ТД00-000003");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ПриобретениеТоваровУслуг.Номер КАК Номер,
	|	ПриобретениеТоваровУслуг.Дата КАК Дата,
	|	ПриобретениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ПриобретениеТоваровУслуг.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Количество КАК Количество
	|	) КАК Товары
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Номер = &Номер";
	
	РезультатЗапроса = Запрос.Выполнить();
	Таблица = РезультатЗапроса.Выгрузить();
	
	вмс_Сервер.ПреобразоватьСсылкиВКвазиСсылкиВДанных(Таблица);

КонецПроцедуры

&НаКлиенте
Процедура Тест13()

	Штрихкод = "2000000000121";
	Результат = вмс_ОбработкаШтрихкодовВызовСервера.ОбработатьШтрихкод(Штрихкод);
	вмс_Сервер.ПреобразоватьСсылкиВКвазиСсылкиВДанных(Результат);
	
КонецПроцедуры

&НаСервере
Процедура Тест14()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Колонка", Новый ОписаниеТипов("Строка"));
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Колонка = "1";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Колонка = "2";
	
	вмс_РаботаСКоллекциями.ИзменитьТипКолонкиТаблицыЗначений(Таблица, "Колонка");
	
КонецПроцедуры

&НаКлиенте
Процедура Тест15()
	
	Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу);
		Текст = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();
	КонецЕсли;
	
	ТекстОтвета = Тест15НаСервере(Текст);
	
	ЗаписьТекста = Новый ЗаписьТекста;
	ЗаписьТекста.Открыть("D:\КС\WMS\ДанныеОбменаОтвет.txt");
	ЗаписьТекста.Записать(ТекстОтвета);
	ЗаписьТекста.Закрыть();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОтвета);
	
КонецПроцедуры

&НаСервере
Функция Тест15НаСервере(Текст)

	//СсылкаУзел = ПланыОбмена.МобильныйОбмен.НайтиПоНаименованию("МБ");
	//Узел = СсылкаУзел.ПолучитьОбъект();
	//Узел.НомерПринятого = 50;
	//Узел.Записать();
	
	ТекстОтвета = вмс_Обмен_с_КИС_Сервер.ВыполнитьОбмен(Текст);
	
	Возврат ТекстОтвета;
	
КонецФункции

&НаСервере
Функция Тест16НаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_НастройкиОператора.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_НастройкиОператора КАК вмс_НастройкиОператора";
	ТекстВыгрузки = вмс_Обмен_с_КИС_Сервер.ВыгрузитьОбъектыПоЗапросу(Запрос);
	Возврат ТекстВыгрузки;
КонецФункции

&НаКлиенте
Функция Тест16()
	
	ТекстВыгрузки = Тест16НаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстВыгрузки);
	
КонецФункции

&НаСервере
Функция Тест17НаСервере()
	Узел = ПланыОбмена.МобильныйОбмен.НайтиПоКоду("2");
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел, 1);
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	Пока ВыборкаИзменений.Следующий() Цикл
		ОбъектОбмена = ВыборкаИзменений.Получить();
		ЗаписатьXML(ЗаписьXML, ОбъектОбмена);
	КонецЦикла;
	ТекстXML = ЗаписьXML.Закрыть();
КонецФункции

&НаСервере
Функция Тест18()
	
	Товар1 = Справочники.Номенклатура.НайтиПоНаименованию("Кондиционер ELEKTA");
	Характеристика1 = вмс_АдаптацияКонфигураций.ПустаяХарактеристика();
	
	Товар2 = Справочники.Номенклатура.НайтиПоНаименованию("Шляпа", Истина);
	Характеристика2 = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию("", Истина);
	Серия2 = Справочники.СерииНоменклатуры.НайтиПоНаименованию("00000003 от 20.03.23 до 31.03.23");
	
	МассивОбъектов = Новый Массив;
	//МассивОбъектов.Добавить(Товар1);
	МассивОбъектов.Добавить(Новый Структура("Товар, Характеристика, Серия", Товар2, Характеристика2, Серия2));
	//МассивОбъектов.Добавить(Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию("35, Бежевый, 5, натуральная кожа"));
	ТаблицаШтрихкодов = вмс_ОбработкаШтрихкодовСервер.ПолучитьШтрихкодыОбъектов(МассивОбъектов);
КонецФункции

&НаСервере
Процедура Тест19()
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписатьXML(ЗаписьXML, Справочники.вмс_МестаХранения.НайтиПоКоду("000000001"));
	Текст = ЗаписьXML.Закрыть();
КонецПроцедуры

&НаСервере
Процедура Тест20()
	СсылкаНаДокумент = Документы.ПриобретениеТоваровУслуг.НайтиПоНомеру("ТД00-000007", '20170101');
	МассивТоваров = СсылкаНаДокумент.Товары.ВыгрузитьКолонку("Номенклатура");
	//Запрос = вмс_ОперацииПоЯчейкамСервер.ПолучитьЗапросТоваровПоДокументам(СсылкаНаДокумент);
	//Таблица = вмс_ОбработкаШтрихкодовВызовСервера.ПолучитьШтрихкодыОбъектовПоЗапросу(Запрос);
	Таблица = вмс_ОбработкаШтрихкодовСервер.ПолучитьШтрихкодыОбъектов(МассивТоваров);
	ТаблицаНоменклатуры = Таблица.Скопировать(Новый Структура("ИмяТипаОбъекта", "Номенклатура"));
	ТаблицаНоменклатуры.Свернуть("Объект");
КонецПроцедуры

&НаСервере
Функция Тест21()
	МассивШтрихкодов = Новый Массив;
	МассивШтрихкодов.Добавить("2000000007793");
	МассивШтрихкодов.Добавить("2000000000084");
	МассивШтрихкодов.Добавить("ZX000000002");
	МассивШтрихкодов.Добавить("USERc58c98bb-c3e6-11e4-946e-bcaec56cc144");
	ТаблицаОбъектов = вмс_ОбработкаШтрихкодовСервер.НайтиОбъектыПоШтрихкодам(МассивШтрихкодов);
КонецФункции

&НаСервере
Функция Тест22()
	
	Перем Объект;
	
	Ссылка = Документы.вмс_ОперацияПоЯчейкам.НайтиПоНомеру("000000001");
	Объект = Ссылка.ПолучитьОбъект();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	вмс_Обмен_с_КИС_Сервер.ЗаписатьОбъектВXML(ЗаписьXML, Объект);
	Текст1 = ЗаписьXML.Закрыть();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписатьXML(ЗаписьXML, Объект);
	Текст2 = ЗаписьXML.Закрыть();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Текст2);
	ЧтениеXML.Прочитать();
	Объект2 = вмс_Обмен_с_КИС_Сервер.ПолучитьОбъектИзXML(ЧтениеXML);
		
КонецФункции

&НаСервере
Функция Тест23()
	
	//ОписаниеДанных = Новый Структура;
	//ОписаниеДанных.Вставить("РежимОтображения");
	//ОписаниеДанных.Вставить("Элементы", Новый Массив);
	//ОписаниеДанных.Элементы.Добавить(Новый Структура("Отбор, Поля"));
	//ОписаниеДанных.Элементы[0].Отбор = Новый Структура("Элементы");
	//ОписаниеДанных.Элементы[0].Отбор.Элементы = Новый Массив;
	//ОписаниеДанных.Элементы[0].Отбор.Элементы.Добавить(Новый Структура("ЛевоеЗначение, ПравоеЗначение, ТипГруппы, Элементы"));
	//ОписаниеДанных.Элементы[0].Отбор.Элементы[0].Элементы = ОписаниеДанных.Элементы[0].Отбор.Элементы;
	//ОписаниеДанных.Элементы[0].Поля = Новый Структура("Элементы");
	//ОписаниеДанных.Элементы[0].Поля.Элементы = Новый Массив;
	//ОписаниеДанных.Элементы[0].Поля.Элементы.Добавить(Новый Структура("Поле"));
	
	ОписаниеДанныхСтрока = "(РежимОтображения,Элементы[(Использование,Отбор(Элементы[(Использование, Представление, Родитель(), ЛевоеЗначение, ВидСравнения, ПравоеЗначение, ТипГруппы, Элементы[%r])]),Поля(Элементы[(Использование,Поле)]),Оформление(Элементы[(Использование,Параметр,Значение)]))])";
	Слепок = вмс_РаботаСКоллекциями.СделатьСлепокДанных(УсловноеОформление, ОписаниеДанныхСтрока);
	Хранилище = Новый ХранилищеЗначения(Слепок);

	Структ3 = Новый Структура;
	Структ3.Вставить("Значение", 1);
	
	Структ2 = Новый Структура;
	
	Структ1 = Новый Структура;
	Структ1.Вставить("Поле1", "аа");
	Структ1.Вставить("Поле2", Структ2);
	Структ1.Вставить("Поле3", Структ3);
	Структ1.Вставить("Поле3_2", Структ3);
	
	Структ2.Вставить("Поле2", Структ1);
	
	Структ1Копия = вмс_РаботаСКоллекциями.СкопироватьОбъект(Структ1, Истина);
	
КонецФункции

&НаСервере
Функция Тест24()
	
	//ОписаниеДанных = "(Поле1:123,ПолеСМассивом[1,(Реквизит1:2),3],Поле2(Поле3,Поле4(а:рпф,б:ффр,в,д:1),Поле5),Поле6)";
	ОписаниеДанных = 
	"
	|(
	|	Поле1[%r1],
	|	Поле2[1,(т1,т2:7),3],
	|	Поле3(а,б:1,в),
	|	Поле4:""""""ап"""" 12"",
	|	Поле5
	|)";
	Парсер = вмс_РаботаСКоллекциями.НовыйТекстовыйПарсер();
	Данные = вмс_РаботаСКоллекциями.ТекстовыйПарсер_РазпарситьСтроку(Парсер, ОписаниеДанных);

	ОписаниеДанных = 
	"
	|{
	|	Поле1[%r1],
	|	Поле2[1,(т1,т2:7),3],
	|	Поле3(а,б:1,в),
	|	Поле4:""""""ап"""" 12"",
	|	Поле5
	|}";
	Парсер = вмс_РаботаСКоллекциями.НовыйТекстовыйПарсер();
	вмс_РаботаСКоллекциями.ТекстовыйПарсер_ДобавитьЛогическийБлок(Парсер, "{", "}", Тип("Соответствие"));
	Данные = вмс_РаботаСКоллекциями.ТекстовыйПарсер_РазпарситьСтроку(Парсер, ОписаниеДанных);
	
	ОписаниеДанных = "а,б,в:15";
	Данные = вмс_РаботаСКоллекциями.ТекстовыйПарсер_РазпарситьСтроку(Парсер, ОписаниеДанных);

	ОписаниеДанных = "[а,б,в]";
	Данные = вмс_РаботаСКоллекциями.ТекстовыйПарсер_РазпарситьСтроку(Парсер, ОписаниеДанных);
	
	//ПараметрыСтроки1 = вмс_РаботаСКоллекциями.ТекстовыйПарсер_ПолучитьПараметрыИзСтроки("Документ.[ИмяДокумента]", "Документ.РеализацияТоваровУслуг");
	//ПараметрыСтроки2 = вмс_РаботаСКоллекциями.ТекстовыйПарсер_ПолучитьПараметрыИзСтроки("[ИмяДокумента].РеализацияТоваровУслуг", "Документ.РеализацияТоваровУслуг");
	//ПараметрыСтроки3 = вмс_РаботаСКоллекциями.ТекстовыйПарсер_ПолучитьПараметрыИзСтроки("[ИмяДокумента].Поступление", "Документ.РеализацияТоваровУслуг");
	//ПараметрыСтроки4 = вмс_РаботаСКоллекциями.ТекстовыйПарсер_ПолучитьПараметрыИзСтроки("[ИмяДокумента]", "Документ.РеализацияТоваровУслуг");
	//ПараметрыСтроки5 = вмс_РаботаСКоллекциями.ТекстовыйПарсер_ПолучитьПараметрыИзСтроки("[ИмяДокумента1].[ИмяДокумента2]", "Документ.РеализацияТоваровУслуг");
	//ПараметрыСтроки6 = вмс_РаботаСКоллекциями.ТекстовыйПарсер_ПолучитьПараметрыИзСтроки("[ИмяДокумента1].*ТоваровУслуг", "Документ.РеализацияТоваровУслуг");
	//ПараметрыСтроки7 = вмс_РаботаСКоллекциями.ТекстовыйПарсер_ПолучитьПараметрыИзСтроки("[ИмяДокумента1].*ТоваровУслуг", "Документ.ПоступлениеТоваровУслуг");
	//ПараметрыСтроки8 = вмс_РаботаСКоллекциями.ТекстовыйПарсер_ПолучитьПараметрыИзСтроки("[ИмяДокумента1].*ТоваровУслуг", "Документ.ПоступлениеТоваров");

КонецФункции

&НаСервере
Функция Тест25()
	
	МассиОбъектов = Новый Массив;
	//МассиОбъектов.Добавить(Справочники.ФизическиеЛица.НайтиПоНаименованию("Авдеева Аделина Павловна"));
	//МассиОбъектов.Добавить(Справочники.ФизическиеЛица.НайтиПоНаименованию("Александров Петр Константинович"));
	//МассиОбъектов.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Кондиционер FIRMSTAR 12М"));
	МассиОбъектов.Добавить(Справочники.вмс_Контейнеры.НайтиПоНаименованию("Партия 1"));
	МассиОбъектов.Добавить(Документы.ПриобретениеТоваровУслуг.НайтиПоНомеру("ТД00-000003", '20210101'));
	//МассиОбъектов.Добавить("ааааа");
	
	ДополнительныеПараметры = Новый Структура("ИспользоватьДополнительныеРеквизиты", Ложь);
	ТаблицаРеквизитов = вмс_ОбщегоНазначенияСервер.ПолучитьРеквизитыОбъектов(МассиОбъектов, "Номер, Проведен, Наименование, Лот1, Контрагент.Наименование, Номер.Наименование, Склад.Наименование, Склад.Подразделение.Наименование", ДополнительныеПараметры);

КонецФункции

&НаСервере
Функция Тест26НаСервере(ДанныеФормы)
	
	ДокументОснование = Документы.ПриобретениеТоваровУслуг.НайтиПоНомеру("ТД00-000003", '20180101');
	ВидОперации = вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьСсылкуНаВидОперацииПоЯчейкам("Приемка");
	
	НовыйДокумент = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ОХР_РегистрацияОпераций"));
	НовыйДокумент.ЗаполнитьПоОперацииПоЯчейкамПоОснованию(ДокументОснование, ВидОперации);
	
	ЗначениеВДанныеФормы(НовыйДокумент, ДанныеФормы);
	
КонецФункции

&НаКлиенте
Функция Тест26()
	
	ФормаОХР = ПолучитьФорму("Документ.ОХР_РегистрацияОпераций.ФормаОбъекта", , ЭтаФорма);
	ДанныеФормы = ФормаОХР.Объект;
	Тест26НаСервере(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, ФормаОХР.Объект);
	ФормаОХР.Открыть();

КонецФункции

&НаСервере
Функция Тест27()
	
	Контейнер = Справочники.вмс_Контейнеры.НайтиПоРеквизиту("Штрихкод", "PAR00000000000000000000000000000000000000000000000001");
	ДополнительныеПараметры = Новый Структура("ТолькоТовары", Истина);
	ТаблицаСостава = вмс_ПартионныйУчетСервер.ПолучитьТаблицуСоставаПоКонтейнерам(Контейнер, ДополнительныеПараметры);

КонецФункции

&НаСервере
Функция Тест28()
	
	РаботаСКоллекциями = вмс_РаботаСКоллекциями;
	РаботаСXMLКлиентСервер = вмс_РаботаСXMLКлиентСервер;
	
	СуперКонтейнер = Справочники.вмс_Контейнеры.ПолучитьСуперКонтейнер();
	ЗонаПриемки = Справочники.вмс_МестаХранения.НайтиПоКоду("000000001");
	ОперацияПриемка = Справочники.вмс_Операции.НайтиПоКоду("000000001");
	
	ИменаКолонок = "Поле1, Поле2, Поле3";
	Таблица = РаботаСКоллекциями.НоваяКвазиТаблицаЗначений();
	РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Поле1", Новый ОписаниеТипов("Число, Строка"));
	РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Поле2", Новый ОписаниеТипов("Число"));
	РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Поле3");
	РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ИменаКолонок, 1, 1, 1));
	РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ИменаКолонок, 1, 2, 1));
	РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ИменаКолонок, 2, 1, 1));
	РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ИменаКолонок, 2, 2, "1"));
	РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ИменаКолонок, 2, 3, 4));
	РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ИменаКолонок, 2, 1, СуперКонтейнер));
	РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ИменаКолонок, 2, 2, СуперКонтейнер.ПолучитьОбъект()));
	РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ИменаКолонок, 2, 3, ОперацияПриемка.ПолучитьОбъект()));
	РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Таблица, Новый Структура(ИменаКолонок, 2, 4, Новый УдалениеОбъекта(ОперацияПриемка)));
	РаботаСКоллекциями.ДобавитьИндексыКвазиТаблицыЗначений(Таблица, ИменаКолонок);
	
	НайденныеСтроки1 = РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(Таблица, Новый Структура(ИменаКолонок, 2, 2, 1));
	
	РаботаСКоллекциями.УдалитьКолонкуКвазиТаблицы(Таблица, "Поле2");
	ИменаКолонок = "Поле1, Поле3";
	НайденныеСтроки2 = РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(Таблица, Новый Структура(ИменаКолонок, 2, 4));
	
	Стр1 = Новый Структура("Поле1, Поле2", 1, 2);
	Стр2 = Новый Структура("Поле1, Поле2", Стр1, Стр1);
	Стр1.Поле1 = Стр2;
	
	Текст = РаботаСXMLКлиентСервер.XMLСтрокаИзЗначенияССохранениемСсылочнойЦелостности(Таблица);
	Таблица2 = РаботаСXMLКлиентСервер.ПрочитатьТекстXMLССохранениемСсылочнойЦелостности(Текст);
	НайденныеСтроки2 = РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(Таблица, Новый Структура(ИменаКолонок, 2, 4));
	НайденныеСтроки3 = РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(Таблица, Новый Структура("Поле1", 2));
	
КонецФункции

&НаСервере
Функция Тест30()
	
	Перем РаботаСXMLКлиентСервер;
	
	РаботаСXMLКлиентСервер = вмс_РаботаСXMLКлиентСервер;
	ОперацииПоЯчейкамВызовСервера = вмс_ОперацииПоЯчейкамВызовСервера;
	
	///////////////////////////////////////////////////////////
	Значение2 = Новый Структура;
	Значение2.Вставить("РРР", "ОООО");
	
	///////////////////////////////////////////////////////////
	Значение = Новый ТаблицаЗначений;
	Значение.Колонки.Добавить("Поле1", Новый ОписаниеТипов("Строка, СправочникСсылка.вмс_МестаХранения"));
	Значение.Колонки.Добавить("Поле2", , "Поле 2", 30);
	Стр = Значение.Добавить();
	Стр.Поле1 = "ввв";
	Стр.Поле2 = 2;
	
	Стр = Значение.Добавить();
	Стр.Поле1 = ОперацииПоЯчейкамВызовСервера.ПолучитьЗонуПриемки();
	Стр.Поле2 = "Это зона приемки!";
	
	Стр = Значение.Добавить();
	Стр.Поле1 = "кгк";
	Стр.Поле2 = Значение2;
	
	Стр = Значение.Добавить();
	Стр.Поле1 = "кгк";
	Стр.Поле2 = ОперацииПоЯчейкамВызовСервера.ПолучитьЗонуПриемки().ПолучитьОбъект();
	
	///////////////////////////////////////////////////////////
	Значение = Новый Массив;
	Значение.Добавить(ОперацииПоЯчейкамВызовСервера.ПолучитьЗонуПриемки());
	Значение.Добавить(ОперацииПоЯчейкамВызовСервера.ПолучитьЗонуПриемки().ПолучитьОбъект());
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение);
	ТекстXML = ЗаписьXML.Закрыть();
	
	ТекстXML = РаботаСXMLКлиентСервер.XMLСтрокаИзЗначенияУлучшенная(Значение);
	
	ПолученноеЗначение = РаботаСXMLКлиентСервер.ПрочитатьТекстXMLУлучшенная(ТекстXML);
	
КонецФункции

&НаСервере
Функция Тест29()
	
	вмс_ОбновлениеИнформационнойБазыWMS.ЗагрузитьПредопределенныеЭлементыОбъектов();
	
КонецФункции

&НаСервере
Функция Тест31()
	
	ТочкаОстановы = 0;
	
КонецФункции

&НаКлиенте
Функция Тест32()
	
	Перем РаботаСXMLКлиентСервер;
	
	РаботаСXMLКлиентСервер = вмс_РаботаСXMLКлиентСервер;

	Значение = БиблиотекаКартинок.ДобавитьВИзбранное;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	//@skip-check undefined-variable
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение);
	Текст = ЗаписьXML.Закрыть();
	
	ПутьФайлаОбработки = "D:\КС\WMS\ДополнительнаяОбработкаОперации\ДополнительнаяОбработкаОперации.xml";
	ДанныеОбработки = вмс_РаботаСФормамиКлиентСервер.ЗагрузитьДанныеФормыОбработкиИзФайлов(ПутьФайлаОбработки);
	ФормаШаблон = ПолучитьФорму("ОбщаяФорма.вмс_ФормаШаблон");
	ФормаШаблон.Загрузить(ДанныеОбработки);
	ФормаШаблон.Открыть();
	
КонецФункции

&НаСервере
Функция Тест33()
	
	Распоряжения = Новый Массив;
	Распоряжения.Добавить(Документы.РеализацияТоваровУслуг.НайтиПоНомеру("ТД00-000001", '20210101'));
	Распоряжения.Добавить(Документы.ПриобретениеТоваровУслуг.НайтиПоНомеру("ТД00-000001", '20220101'));
	Распоряжения.Добавить(Документы.РеализацияТоваровУслуг.НайтиПоНомеру("ТД00-000003", '20180101'));
	
	ДанныеСпискаТоваров = Справочники.вмс_РаспоряженияОпераций.ПолучитьСписокТоваровПоРаспоряжениям(Распоряжения);
	Таблица = ДанныеСпискаТоваров.Таблица;
	
КонецФункции

&НаКлиенте
Функция Тест34()

	КоличествоПовторов = 10000;
	
	Время = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Для НомерПовтора=1 По КоличествоПовторов Цикл
		СтруктураОписания = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОписанияМетаданныхОбъектовПовтИсп();
		СтруктураОписания.Языки = "1";
	КонецЦикла;
	Время1 = ТекущаяУниверсальнаяДатаВМиллисекундах() - Время;
	
	Время = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Для НомерПовтора=1 По КоличествоПовторов Цикл
		СтруктураОписания = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОписанияМетаданныхОбъектов();
		СтруктураОписания.Языки = "1";
	КонецЦикла;
	Время2 = ТекущаяУниверсальнаяДатаВМиллисекундах() - Время;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(Время1);
	ОбщегоНазначенияКлиент.СообщитьПользователю(Время2);

КонецФункции

&НаКлиенте
Функция Тест35()
	
	ОписаниеКонфигурации = вмс_ОбщегоНазначенияВызовСервера.ПолучитьОписаниеМетаданныхОбъекта("");
	ОписаниеСправочника = вмс_ОбщегоНазначенияВызовСервера.ПолучитьОписаниеМетаданныхОбъекта("Справочник.Номенклатура");
	ОписаниеДокумента = вмс_ОбщегоНазначенияВызовСервера.ПолучитьОписаниеМетаданныхОбъекта("Документ.РеализацияТоваровУслуг");
	
КонецФункции

&НаСервере
Функция Тест36()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Справочники.Номенклатура.НайтиПоКоду("000000025  "));
	МассивЭлементов.Добавить(Справочники.вмс_Контейнеры.НайтиПоНаименованию("Партия 1"));
	
	ТаблицаБлизости1 = вмс_ОбщегоНазначенияСервер.ПолучитьТаблицуБлизостиЭлементов1(МассивЭлементов);
	ТаблицаБлизости2 = вмс_ОбщегоНазначенияСервер.ПолучитьТаблицуБлизостиЭлементов2(МассивЭлементов, 4);
	
КонецФункции

&НаСервере
Функция Тест37()

	ДоступныеРеквизиты = вмс_ОбщегоНазначенияСервер.НайтиДоступныеРеквизитыОбъекта("Справочник.Номенклатура", "Марка.Наименование");

КонецФункции

&НаСервере
Функция Тест38()

	Документ = Документы.ПриобретениеТоваровУслуг.НайтиПоНомеру("ТД00-000003", '20230101');
	
	ПараметрДокументы = Новый Массив;
	ПараметрДокументы.Добавить(Документ);
	
	ПараметрыФункции = Новый Структура;
	ПараметрыФункции.Вставить("ПараметрДокументы", ПараметрДокументы);
	
	ТаблицаТоваров = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуТоваровПоДокументам(ПараметрыФункции);

КонецФункции

&НаСервере
Функция Тест39()

	Товар = Справочники.Номенклатура.НайтиПоНаименованию("Сок апельсиновый 0,5 л");
	
	ВидПартии = вмс_ПартионныйУчетСервер.ПолучитьВидПартииДляМоноТовара(Товар);

КонецФункции

&НаСервере
Функция Тест40()

	ФизЛицо = Справочники.ФизическиеЛица.НайтиПоНаименованию("Бахшиев Павел Иннокентьевич");
	ПочтоваяРассылка = Справочники.вмс_ПочтовыеРассылки.НайтиПоКоду("000000001");
	Справочники.вмс_ПочтовыеРассылки.Отправить(ПочтоваяРассылка);
	Справочники.вмс_ПочтовыеРассылки.Отправить(ПочтоваяРассылка, ФизЛицо);
	ОбщегоНазначения.СообщитьПользователю("Отправлено письмо");

КонецФункции

&НаСервере
Функция Тест41НаСервере()
	ОбъектыНазначения = Новый Массив;
	ОбъектыНазначения.Добавить(Справочники.ФизическиеЛица.НайтиПоНаименованию("Авдеева Аделина Павловна"));
	
	ПечатнаяФорма = Справочники.вмс_ПечатныеФормы.НайтиПоКоду("000000002");
	
	ПараметрыИсточника = Новый Структура;
	ПараметрыИсточника.Вставить("ОбъектыНазначения", ОбъектыНазначения);
	ПараметрыИсточника.Вставить("ИдентификаторКоманды", "Бейджик");
	ТабличныйДокумент = вмс_Печать.ПечатьПоВнешнемуИсточнику(ПечатнаяФорма, ПараметрыИсточника);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Функция Тест41()
	
	ТабличныйДокумент = Тест41НаСервере();
	ДанныеHTML = вмс_РаботаСHTML.ПолучитьДанныеHTMLИзТабличногоДокумента(ТабличныйДокумент);
	
КонецФункции

&НаСервере
функция ПолучитьРезультатПоискаТовара(СтрокаПоиска) Экспорт

	МассивСтрокПоиска = вмс_РаботаСКоллекциями.СтрокуВМассив(СтрокаПоиска, " ");
	КоличествоПоисков = МассивСтрокПоиска.Количество();
	
	СвязкаЗапросов = Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС;
	СвязкаПакетов = Символы.ПС + ";" + Символы.ПС + Символы.ПС;
	
	ТаблицаПоиска = Новый ТаблицаЗначений;
	ТаблицаПоиска.Колонки.Добавить("НомерПоиска", Новый ОписаниеТипов("Число"));
	ТаблицаПоиска.Колонки.Добавить("СтрокаПоиска", Новый ОписаниеТипов("Строка"));
	
	Для НомерПоиска=1 По КоличествоПоисков Цикл
		СтрокаПоиска = ТаблицаПоиска.Добавить();
		СтрокаПоиска.НомерПоиска = НомерПоиска;
		СтрокаПоиска.СтрокаПоиска = "%" + МассивСтрокПоиска[НомерПоиска-1] + "%";
	КонецЦикла;
	
	ТекстЗапроса = "";
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ТаблицаПоиска.НомерПоиска КАК НомерПоиска,
	|	ТаблицаПоиска.СтрокаПоиска КАК СтрокаПоиска
	|ПОМЕСТИТЬ ТаблицаПоиска
	|ИЗ
	|	&ТаблицаПоиска КАК ТаблицаПоиска" + СвязкаПакетов;
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//							Поиск товаров
	//
	
	МассивПолейПоиска = Новый Массив; 
	МассивПолейПоиска.Добавить("Наименование");
	МассивПолейПоиска.Добавить("Код");
	МассивПолейПоиска.Добавить("Артикул");
	ТекстШаблонаПоискПоПолю =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ТаблицаПоиска.НомерПоиска КАК НомерПоиска
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	ТаблицаПоиска КАК ТаблицаПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Номенклатура.Наименование ПОДОБНО ТаблицаПоиска.СтрокаПоиска";
	ТекстЗапросаПоТоварам = "";
	Для Каждого ПолеПоиска Из МассивПолейПоиска Цикл
		ТекстПоискПоПолю = ТекстШаблонаПоискПоПолю;
		ТекстПоискПоПолю = СтрЗаменить(ТекстПоискПоПолю, "Номенклатура.Наименование", "Номенклатура." + ПолеПоиска);
		Если ТекстЗапросаПоТоварам <> "" Тогда
			ТекстЗапросаПоТоварам = ТекстЗапросаПоТоварам + СвязкаЗапросов;
			ТекстПоискПоПолю = СтрЗаменить(ТекстПоискПоПолю, Символы.ПС + "ПОМЕСТИТЬ ВТ_Товары", "");
		КонецЕсли;
		ТекстЗапросаПоТоварам = ТекстЗапросаПоТоварам + ТекстПоискПоПолю;
	КонецЦикла;
	
	ТекстЗапросаПоТоварам = ТекстЗапросаПоТоварам + СвязкаПакетов;
	ТекстЗапросаПоТоварам = ТекстЗапросаПоТоварам +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Товары.Товар КАК Товар,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Товары2
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ВТ_Товары.ВидНоменклатуры = ХарактеристикиНоменклатуры.Владелец
	|				ИЛИ ВТ_Товары.Товар = ХарактеристикиНоменклатуры.Владелец)";
	

	/////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//							Поиск характеристик
	//
	
	ТекстЗапросаПоХарактеристикам =
	"ВЫБРАТЬ
	|	ВТ_Товары.Товар КАК Товар,
	|	ВТ_Товары.Характеристика КАК Характеристика,
	|	ТаблицаПоиска.НомерПоиска КАК НомерПоиска
	|ИЗ
	|	ТаблицаПоиска КАК ТаблицаПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Товары2 КАК ВТ_Товары
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВТ_Товары.Характеристика.Наименование ПОДОБНО ТаблицаПоиска.СтрокаПоиска";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//							Общий запрос
	//
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаПоТоварам + СвязкаПакетов;
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ВТ_Товары2.Товар КАК Товар,
	|	ВТ_Товары2.Характеристика КАК Характеристика,
	|	ВТ_Товары1.НомерПоиска КАК НомерПоиска
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_Товары2 КАК ВТ_Товары2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары1
	|		ПО ВТ_Товары2.Товар = ВТ_Товары1.Товар" + СвязкаЗапросов;
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаПоХарактеристикам + СвязкаПакетов;
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ВТ.Товар КАК Товар,
	|	ВТ.Характеристика КАК Характеристика
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Товар,
	|	ВТ.Характеристика
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ.НомерПоиска) = &КоличествоПоисков";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КоличествоПоисков", КоличествоПоисков);
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//							РЕЗУЛЬТАТ!!!
	//
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаПоиска", ТаблицаПоиска);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();

	Возврат ТаблицаРезультата;
	
КонецФункции

&НаСервере
Функция Тест42()
	
	ТаблицаРезультата = ПолучитьРезультатПоискаТовара("доводчик 065 Серебро");
	
КонецФункции

&НаСервере
Функция Тест43()

	Объекты = Новый Массив;
	Объекты.Добавить(Справочники.вмс_Операции.НайтиПоКоду("000000001"));
	Объекты.Добавить(Справочники.вмс_Операции.НайтиПоКоду("000000002"));
	Объекты.Добавить(Справочники.вмс_МестаХранения.НайтиПоКоду("000000018"));
	
	ТаблицаРеквизитов = вмс_ОбщегоНазначенияСервер.ПолучитьРеквизитыОбъектов(Объекты, "Ссылка, Владелец.Наименование, Владелец.Код, Владелец.ЭтоГруппа, Проведен, ИспользоватьУслугиХранения");
	
КонецФункции

&НаСервере
Функция Тест44()

	Товар1 = Справочники.Номенклатура.НайтиПоНаименованию("Кондиционер ELEKTA");
	Товар2 = Справочники.Номенклатура.НайтиПоНаименованию("Шляпа", Истина);
	Товар3 = Справочники.Номенклатура.НайтиПоНаименованию("Кондиционер FIRMSTAR 12М");

	Товары = Новый Массив;
	Товары.Добавить(Товар1);
	Товары.Добавить(Товар2);
	Товары.Добавить(Товар3);
	
	ТаблицаИспользованияСерий = вмс_СерииТоваровСервер.ИспользованиеУчетаСерийПоТоварам(Товары);
	
КонецФункции

&НаСервере
Функция Тест45()

	НастройкиТоварныхПолей = ПараметрыСеанса.вмс_НастройкаТоварныхПолей.Получить();
	
КонецФункции

&НаСервере
Функция Тест46()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Поле1", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Поле2", Новый ОписаниеТипов("Строка"));
	
	Строка = Таблица.Добавить();
	Строка.Поле1 = 5;
	Строка.Поле2 = 5;
	
	вмс_РаботаСКоллекциями.РазтипизироватьТаблицуЗначений(Таблица);
	вмс_РаботаСКоллекциями.РазтипизироватьТаблицуЗначений(Таблица);
	вмс_РаботаСКоллекциями.ТипизироватьТаблицуЗначений(Таблица);
	
	Таблица.Очистить();
	вмс_РаботаСКоллекциями.ТипизироватьТаблицуЗначений(Таблица);
	
КонецФункции

&НаСервере
Функция Тест47()

	Товар1 = Справочники.Номенклатура.НайтиПоНаименованию("Кондиционер ELEKTA");
	
	Данные = Товар1;
	
	вмс_Обмен_с_КИС_ВызовСервера.ПреобразоватьДанныеПередОтправкой(Данные);
	
	вмс_Обмен_с_КИС_ВызовСервера.ПреобразоватьДанныеПослеПолучения(Данные);
	
	//////////////////////////////////////////////////////////////////////
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Колонка1", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Колонка2");
	
	Строка = Таблица.Добавить();
	Строка.Колонка1 = "ааааа";
	Строка.Колонка2 = Товар1;
	
	Данные = Новый Структура;
	Данные.Вставить("поле1", 22);
	Данные.Вставить("поле2", Таблица);
	
	вмс_Обмен_с_КИС_ВызовСервера.ПреобразоватьДанныеПередОтправкой(Данные);
	
	вмс_Обмен_с_КИС_ВызовСервера.ПреобразоватьДанныеПослеПолучения(Данные);

КонецФункции

&НаСервере
Функция Тест48()

	Контейнер1 = Справочники.вмс_Контейнеры.НайтиПоРеквизиту("Штрихкод", "PAR00000000000000000000000000000000000000000000000001");
	Коробка2 = Справочники.вмс_Контейнеры.НайтиПоРеквизиту("Штрихкод", "BOX00000000000000000000000000000000000000000000000002");
	Контейнер = Контейнер1;
	
	ДополнительныеПараметрыФункции = Новый Структура;
	ДополнительныеПараметрыФункции.Вставить("МаксимальныйУровеньРазузлования", 1);

	ТаблицаСостава = вмс_ПартионныйУчетСервер.ПолучитьТаблицуСоставаПоКонтейнерам(Контейнер, ДополнительныеПараметрыФункции);
	
КонецФункции

&НаСервере
Функция Тест49()

	Контейнер1 = Справочники.вмс_Контейнеры.НайтиПоРеквизиту("Штрихкод", "PAR00000000000000000000000000000000000000000000000001");
	Коробка2 = Справочники.вмс_Контейнеры.НайтиПоРеквизиту("Штрихкод", "BOX00000000000000000000000000000000000000000000000002");
	
	Контейнеры = Новый Массив;
	Контейнеры.Добавить(Контейнер1);
	Контейнеры.Добавить(Коробка2);
	
	ТаблицаСостава = вмс_ПартионныйУчетСервер.ПолучитьВсеТоварыКонтейнеров(Контейнеры);
	
КонецФункции

&НаСервере
Функция Тест50()

	Логин = "\\COMP22\WDAGUtilityAccount";
	
	РезультатАвторизации = вмс_РаботаСПользователямиСервер.АвторизоватьсяПоПользователюОС(Логин);
	
КонецФункции

&НаКлиенте
Функция Тест51()

	ДвоичныеДанные = Новый ДвоичныеДанные("D:\КС\WMS\ТестТабДок2.mxl");
	
	ТабличныйДокумент = Тест51НаСервере(ДвоичныеДанные);
	
	ТабличныйДокумент.Показать();
	
КонецФункции

&НаСервереБезКонтекста
Функция Тест51НаСервере(ДвоичныеДанные)
	
	ПотокВПамяти = Новый ПотокВПамяти;
	ЗаписьДанных = Новый ЗаписьДанных(ПотокВПамяти);
	ЗаписьДанных.Записать(ДвоичныеДанные);
	ЗаписьДанных.Закрыть();
	
	ПотокВПамяти.Перейти(0, ПозицияВПотоке.Начало);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ПотокВПамяти);
	
	вмс_РаботаСТабличнымиДокументами.СоздатьФорматыСтрок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Функция Тест52()
	
	РК = вмс_РаботаСКоллекциями;
	
	Данные = Новый Структура;
	Данные.Вставить("Поле1", РК.ЗначениеВМассив("1, 2, 3"));
	Данные.Вставить("Поле2", 2);
	Данные.Вставить("Поле3", РК.ЗначениеВМассив("а, б, в"));
	
	МассивСочетаний = РК.ПолучитьСочетанияЭлементов(Данные);
	
	Данные = Новый Массив;
	Данные.Добавить(РК.ЗначениеВМассив("1, 2, 3"));
	Данные.Добавить(2);
	Данные.Добавить(РК.ЗначениеВМассив("а, б, в"));
	
	МассивСочетаний = РК.ПолучитьСочетанияЭлементов(Данные);
	
КонецФункции

&НаСервереБезКонтекста
Функция Тест53()
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("ВидОперации", Справочники.вмс_Операции.НайтиПоКоду("000000003"));
	ПараметрыРегистрации.Вставить("Оператор", Справочники.ФизическиеЛица.НайтиПоНаименованию("Авдеева Аделина Павловна"));
	ПараметрыРегистрации.Вставить("Распоряжение", Документы.РеализацияТоваровУслуг.НайтиПоНомеру("ТДЦБ-000001", '20230522'));
	
	РегистрыСведений.вмс_РегистрацияИзмененийОпераций.ЗарегистрироватьНачалоОперации(ПараметрыРегистрации);
	
КонецФункции

&НаСервереБезКонтекста
Функция Тест54()
	
	СсылкаНаОбъект = Справочники.вмс_МестаХранения.НайтиПоКоду("000000018");
	
	Соответствие = Новый Соответствие;
	Соответствие["Поле1"] = Новый Структура("Колонка1, Колонка2", "Тест1", 1);
	Соответствие[СсылкаНаОбъект] = Новый Структура("Представление", Строка(СсылкаНаОбъект));
	
	ДанныеДляОтправки = Новый Структура;
	ДанныеДляОтправки.Вставить("Соответствие", Соответствие);
	
	вмс_Обмен_с_КИС_ВызовСервера.ПреобразоватьДанныеПередОтправкой(ДанныеДляОтправки);
	
	ПолученныеДанные = вмс_РаботаСКоллекциями.СкопироватьОбъект(ДанныеДляОтправки, Истина);
	вмс_Обмен_с_КИС_ВызовСервера.ПреобразоватьДанныеПослеПолучения(ПолученныеДанные);
	
КонецФункции

&НаСервереБезКонтекста
Функция Тест55()
	
	СсылкаОперации = Справочники.вмс_Операции.НайтиПоКоду("000000001");
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(СсылкаОперации);
	ТаблицаДополнительныхРеквизитов = вмс_УправлениеСвойствамиСервер.ПолучитьТаблицуДополнительныхРеквизитовОбъектов(МассивОбъектов);

	МассивОбъектов = Новый Массив;
	ТаблицаДополнительныхРеквизитов = вмс_УправлениеСвойствамиСервер.ПолучитьТаблицуДополнительныхРеквизитовОбъектов(МассивОбъектов);
	
КонецФункции

&НаСервереБезКонтекста
Функция Тест56()
	
	РаботаСКоллекциями = вмс_РаботаСКоллекциями;
	РаботаСXMLКлиентСервер = вмс_РаботаСXMLКлиентСервер;
	
	СсылкаНаОбъект = ПланыВидовХарактеристик.вмс_ДополнительныеРеквизиты.НайтиПоНаименованию("Использование зоны приемки");
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	Объект.ДополнительныеСвойства.Вставить("Тест1", 11);
	Объект.ДополнительныеСвойства.Вставить("Тест2", "ПППП 11");
	СписокОбъектов = Новый Массив;
	СписокОбъектов.Добавить(Объект);
	СписокОбъектов.Добавить(ГоризонтальноеПоложениеЭлемента.Право);
	
	УпрощеннаяЗапись = Ложь;
	
	ОписаниеТиповВXML = РаботаСXMLКлиентСервер.СериализироватьВXMLНаСервере(Объект.ТипЗначения);
	ОписаниеТипов = РаботаСXMLКлиентСервер.ОписаниеТиповИзXMLСтроки(ОписаниеТиповВXML);
	
	Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.вмс_МестаХранения, СправочникСсылка.вмс_Операции");

	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ПараметрыЗаписиXML = РаботаСXMLКлиентСервер.ПолучитьПараметрыЗаписиXML(ЗаписьXML, УпрощеннаяЗапись);
	РаботаСXMLКлиентСервер.ПодготовитьОбъектыИЗначенияСвойствОбъектовДляЗаписи(ПараметрыЗаписиXML, СписокОбъектов);
	РаботаСXMLКлиентСервер.ЗаписатьСодержимое(ПараметрыЗаписиXML);
	ТекстXML = ЗаписьXML.Закрыть();

	НовыйСписокОбъектов = РаботаСXMLКлиентСервер.ПрочитатьТекстXMLУлучшенная(ТекстXML);
	
КонецФункции

&НаСервереБезКонтекста
Функция Тест57()
	
	РК = вмс_РаботаСКоллекциями;
	
	Товар = Справочники.Номенклатура.НайтиПоНаименованию("Шляпа", Истина);
	
	ТаблицаЗапроса = РК.НоваяТаблицаЗначений(вмс_ОперацииПоЯчейкамКлиентСерверПовтИсп.ТоварныеПоля());
	СтрокаЗапроса = РК.ДобавитьЭлементКоллекции(ТаблицаЗапроса);
	СтрокаЗапроса.Товар = Товар;
	
	ТаблицаДанных = вмс_ОперацииПоЯчейкамСервер.ПолучитьЗначенияПредставленийПолейДанныхСКД(ТаблицаЗапроса);
	
КонецФункции

&НаСервере
Функция Тест58НаСервере(Значение)
КонецФункции

&НаКлиенте
Функция Тест58()
	
	//Тест58НаСервере(ГоризонтальноеПоложениеЭлемента.Центр);
	
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить(Новый Цвет(255, 0, 1));
	МассивЗначений.Добавить(ГоризонтальноеПоложениеЭлемента.Центр);
	//МассивЗначений.Добавить(ЦветаСтиля.ЦветВажного);
	МассивЗначений.Добавить(WebЦвета.Бежевый);
	МассивЗначений.Добавить(Новый Шрифт("Arial", , Истина, , , , 120));
	//МассивЗначений.Добавить(ШрифтыСтиля.ШрифтТекста);
	МассивЗначений.Добавить(ПредопределенноеЗначение("Перечисление.вмс_КачествоТовара.Брак"));
	
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Значения");
	
	Для Каждого Значение Из МассивЗначений Цикл
		
		Попытка
			//ХранилищеЗначения = Новый ХранилищеЗначения(Значение);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ТочкаОстановы = 0;
		КонецПопытки;
		
		Попытка
			//@skip-check undefined-function-or-procedure
			ЗаписатьXML(ЗаписьXML, Значение);
			Продолжить;
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ТочкаОстановы = 0;
		КонецПопытки;
		
		Попытка
			//@skip-check undefined-variable
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ТочкаОстановы = 0;
		КонецПопытки;
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ТекстЗначения = ЗаписьXML.Закрыть();
	
	ТекстЗначения2 = вмс_РаботаСXMLКлиентСервер.XMLСтрокаИзЗначенияУлучшенная(МассивЗначений[0]);
	Значение2 = вмс_РаботаСXMLКлиентСервер.ПрочитатьТекстXMLУлучшенная(ТекстЗначения2);
	
	ТекстЗначения3 = вмс_РаботаСXMLКлиентСервер.XMLСтрокаИзЗначенияУлучшенная(МассивЗначений);
	Значение3 = вмс_РаботаСXMLКлиентСервер.ПрочитатьТекстXMLУлучшенная(ТекстЗначения3);

КонецФункции

&НаСервере
Функция Тест59()
	
	МассивЗначений = Новый Массив;
	Значение = Справочники.Номенклатура.НайтиПоНаименованию("Кондиционер ELEKTA").ПолучитьОбъект();
	МассивЗначений.Добавить(Значение);
	
	ТекстЗначения = вмс_РаботаСXMLКлиентСервер.XMLСтрокаИзЗначенияУлучшенная(МассивЗначений[0]);
	Значение2 = вмс_РаботаСXMLКлиентСервер.ПрочитатьТекстXMLУлучшенная(ТекстЗначения);

КонецФункции

&НаСервере
Функция Тест60()
	
	Перем Объект;
	
	Класс = вмс_ОперацииПоЯчейкамКлиентСервер.ЗарегистрироватьКлассОперации("НоваяОперация");
	Объект = вмс_ОперацииПоЯчейкамКлиентСервер.НовыйОбъект("НоваяОперация");

КонецФункции

&НаКлиенте
Функция Тест61()
	
	Строка = "А1Б20С5";
	КоличествоРазрядов = 3;
	Результат = вмс_РаботаСКоллекциями.ДобавитьЛидирующиеНулиЧиселВСтроке(Строка, КоличествоРазрядов);

КонецФункции

&НаКлиенте
Функция Тест62()
	
	СтруктураСтрокиСоединения = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруСтрокиСоединения();
	
	СтрокаСоединения = "сервер=""новый сервер""; допинфо=""1+1=2""; ""порт""=80";
	
	ТекстовыйПарсер = вмс_ПарсированиеТекста.НовыйТекстовыйПарсерСтрокиЗапускаПриложения();
	Результат = вмс_ПарсированиеТекста.ТекстовыйПарсер_РазобратьТекст(СтрокаСоединения, ТекстовыйПарсер);
	
КонецФункции

&НаСервере
Функция Тест63()
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить("а = 0");
	ПараметрыЗадания.Добавить(Неопределено);
	ФоновоеЗадание = ФоновыеЗадания.Выполнить("вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьПрограммныйКод", ПараметрыЗадания);
	
КонецФункции

&НаСервере
Функция Тест64()
	
	ГС = Обработки.вмс_КлассОперацияСтандартный.ПолучитьМакет("Макет");
	
КонецФункции

&НаКлиенте
Функция Тест65()
	
	Макет = Тест65НаСервере();
	Макет.Показать("Настройки программы");
	
КонецФункции

&НаСервере
Функция Тест65НаСервере()
	
	ДанныеXML = ПолучитьОбщийМакет("ПредопределенныеЭлементыНастроекПрограммы");
	Текст = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьТекстИзДвоичныхДанных(ДанныеXML);

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Текст);
	ЧтениеXML.Прочитать(); //заголовок
	ЧтениеXML.Прочитать(); //первый элемент
	МассивЭлементов = вмс_РаботаСXMLКлиентСервер.ПрочитатьXMLУлучшенная(ЧтениеXML);
	ЧтениеXML.Прочитать(); //конец заголовка

	Макет = Справочники.вмс_НастройкиПрограммы.ПолучитьМакетЭлементов(МассивЭлементов);
	МассивЭлементов2 = Справочники.вмс_НастройкиПрограммы.ПрочитатьЭлементыИзМакета(Макет);
	Возврат Макет;
	
КонецФункции

&НаСервере
Функция Тест66()
	
	Товары = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("Ячейка");
	СтрокаПоТоварам = Товары.Добавить();
	//СтрокаПоТоварам.Товар = Справочники.Номенклатура.НайтиПоКоду("00-00000060");
	СтрокаПоТоварам.Ячейка = Справочники.вмс_МестаХранения.НайтиПоКоду("000000004"); //А-1-1
	//СтрокаПоТоварам.Ячейка = Справочники.вмс_МестаХранения.НайтиПоКоду("000000005"); //Б-1-1
	
	ПараметрыФункции = Новый Структура;
    ПараметрыФункции.Вставить("Товары", Товары);
	ТаблицаОстатков = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ПараметрыФункции);
	
КонецФункции

&НаСервере
Функция Тест67()
	
	РК = вмс_РаботаСКоллекциями;
	
	Поля = "Поле1, Поле2";
	Тип = "ТаблицаЗначений";
	Таблица = РК.НоваяКоллекцияЗначений("Поле1, Поле2", Тип);
	РК.ДобавитьЭлементКоллекции(Таблица, Новый Структура(Поля, 1, 1));
	РК.ДобавитьЭлементКоллекции(Таблица, Новый Структура(Поля, 1, 2));
	РК.ДобавитьЭлементКоллекции(Таблица, Новый Структура(Поля, 1, 3));
	РК.ДобавитьЭлементКоллекции(Таблица, Новый Структура(Поля, 2, 1));
	РК.ДобавитьЭлементКоллекции(Таблица, Новый Структура(Поля, 2, 2));
	РК.ДобавитьЭлементКоллекции(Таблица, Новый Структура(Поля, 2, 3));
	
	МассивСтрок = Новый Массив;
	РК.ДобавитьЭлементыКоллекции(МассивСтрок, РК.НайтиЭлементыКоллекции(Таблица, Новый Структура("Поле2", 1)));
	РК.ДобавитьЭлементыКоллекции(МассивСтрок, РК.НайтиЭлементыКоллекции(Таблица, Новый Структура("Поле2", 2)));
	РК.ДобавитьЭлементыКоллекции(МассивСтрок, РК.НайтиЭлементыКоллекции(Таблица, Новый Структура("Поле2", 3)));
	
	РК.УпорядочитьЭлементыКоллекцииЗначенийПоМассиву(Таблица, МассивСтрок);
	
КонецФункции

&НаСервере
Функция Тест68()
	
	РК = вмс_РаботаСКоллекциями;
	ИК = вмс_ИндексированиеКоллекций;
	
	ПоляИндексирования = "Товар, Ячейка";
	ВсеПоля = ПоляИндексирования + ", Количество";
	Тип = "ТаблицаЗначений";
	Таблица = РК.НоваяКоллекцияЗначений(ВсеПоля, Тип);
	Для НомерТовара=1 По 100 Цикл
		Для НомерЯчейки=1 По 10 Цикл
			РК.ДобавитьЭлементКоллекции(Таблица, Новый Структура(ВсеПоля, "Т" + НомерТовара, "Я" + НомерЯчейки, 1));
		КонецЦикла;
	КонецЦикла;
	
	ПоляИндексированияМассив = РК.ЗначениеВМассив(ПоляИндексирования);
	КоличествоПолей = ПоляИндексированияМассив.Количество();
	
	Индекс = ИК.НовыйИндекс();
	
	КоличествоВариантов = Pow(2, КоличествоПолей) - 1;
	
	ВекторизированныеДанные = Новый Массив;
	Для НомерВарианта=0 По КоличествоВариантов-1 Цикл
		
		Вариант = РК.РазложитьЧислоНаРазряды(НомерВарианта, 2, КоличествоПолей);
		
		Для Каждого ЭлементДанных Из РК.ПолучитьЭлементыКоллекции(Таблица) Цикл
			
			Вектор = Новый Массив;
			Для НомерПоля=0 По КоличествоПолей-1 Цикл
				ОбщееЗначение = Вариант[НомерПоля]=1;
				Если ОбщееЗначение Тогда
					Вектор.Добавить(Неопределено);
				Иначе
					Вектор.Добавить(ЭлементДанных[ПоляИндексированияМассив[НомерПоля]]);
				КонецЕсли;
			КонецЦикла;
			
			ВекторизированныеДанные.Добавить(Новый Структура("Вектор, ЭлементДанных", Вектор, ЭлементДанных));
			
		КонецЦикла;
		
	КонецЦикла;
	
	ИК.ВставитьДанныеВИндекс(Индекс, ВекторизированныеДанные);
	
	Вектор = ИК.НовыйВектор(Новый Структура("Товар, Ячейка", "Т1", Неопределено), ПоляИндексированияМассив);
	ИндексЭлемента = ИК.НайтиИндекс(Индекс, Вектор);
	Данные = ИК.ПолучитьДанныеИндекса(ИндексЭлемента);

	Вектор = ИК.НовыйВектор(Новый Структура("Товар, Ячейка", Неопределено, "Я2"), ПоляИндексированияМассив);
	ИндексЭлемента = ИК.НайтиИндекс(Индекс, Вектор);
	Данные = ИК.ПолучитьДанныеИндекса(ИндексЭлемента);

	Вектор = ИК.НовыйВектор(Новый Структура("Товар, Ячейка", Неопределено, "Я1"), ПоляИндексированияМассив);
	ИндексЭлемента = ИК.НайтиИндекс(Индекс, Вектор);
	Данные = ИК.ПолучитьДанныеИндекса(ИндексЭлемента);
	
	Данные = ИК.ПолучитьДанныеИндекса(Индекс);
	РК.УдалитьДублиВМассиве(Данные);
КонецФункции

Функция Тест69()
	Массив = Новый Массив;
	Массив.Добавить(2);
	Массив.Добавить(1);
	Массив.Добавить(3);
	ОтсортированныйМассив = вмс_РаботаСКоллекциями.БинарнаяСортировка(Массив);

	МассивУпорядоченный = Новый Массив;
	Для Номер=1 По 997 Цикл
		МассивУпорядоченный.Добавить(Номер);
	КонецЦикла;
	
	ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел;
	Массив = Новый Массив;
	Пока МассивУпорядоченный.Количество() > 0 Цикл
		Индекс = ГенераторСлучайныхЧисел.СлучайноеЧисло(0, МассивУпорядоченный.Количество()-1);
		Массив.Добавить(МассивУпорядоченный[Индекс]);
		МассивУпорядоченный.Удалить(Индекс);
	КонецЦикла;
	
	ОтсортированныйМассив = вмс_РаботаСКоллекциями.БинарнаяСортировка(Массив);
	
	ТаблицаСортировки = Новый ТаблицаЗначений;
	ТаблицаСортировки.Колонки.Добавить("Значение");
	
	Для Каждого Значение Из Массив Цикл
		ТаблицаСортировки.Добавить().Значение = Значение;
	КонецЦикла;
	
	ТаблицаСортировки.Сортировать("Значение");
	ОтсортированныйМассив = ТаблицаСортировки.ВыгрузитьКолонку("Значение");
	
КонецФункции

Функция Тест70()

	Статус = 0;

	Документы.вмс_ЗаданиеКладовщику.УстановитьСтатусУказанияКонтейнера(Статус, "Контейнер", Истина);
	СтатусКонтейнера = Документы.вмс_ЗаданиеКладовщику.ПолучитьСтатусУказанияКонтейнера(Статус, "Контейнер");
	
	Документы.вмс_ЗаданиеКладовщику.УстановитьСтатусУказанияКонтейнера(Статус, "КонтейнерОтправитель", Истина);
	СтатусКонтейнераОтправителя = Документы.вмс_ЗаданиеКладовщику.ПолучитьСтатусУказанияКонтейнера(Статус, "КонтейнерОтправитель");

	Документы.вмс_ЗаданиеКладовщику.УстановитьСтатусУказанияКонтейнера(Статус, "КонтейнерПриемник", Ложь, Истина);
	СтатусКонтейнераПриемника = Документы.вмс_ЗаданиеКладовщику.ПолучитьСтатусУказанияКонтейнера(Статус, "КонтейнерПриемник");
	
	Документы.вмс_ЗаданиеКладовщику.УстановитьСтатусУказанияКонтейнера(Статус, "КонтейнерПриемник", Ложь, Истина, Истина);
	СтатусКонтейнераПриемника = Документы.вмс_ЗаданиеКладовщику.ПолучитьСтатусУказанияКонтейнера(Статус, "КонтейнерПриемник");
	
	СтатусКонтейнера = Документы.вмс_ЗаданиеКладовщику.ПолучитьСтатусУказанияКонтейнера(Статус, "Контейнер");
	
КонецФункции

Функция Тест71()

	ИдентификаторыЭлементов = Новый Массив;
	ИдентификаторыЭлементов.Добавить("Производство\Тест");
	ИдентификаторыЭлементов.Добавить("Производство\Склады\Склад готовой продукции");
	ИдентификаторыЭлементов.Добавить("Производство\Склады\Склад готовой продукции 2");
	ИдентификаторыЭлементов.Добавить("Производство\Склады");
	ИдентификаторыЭлементов.Добавить("Производство\Склады\Склад коммерческой службы");
	ИдентификаторыЭлементов.Добавить("Торговая деятельность\Оптовые склады\Центр\Склад бытовой техники");
	
	НайденныеСсылки = вмс_ОбщегоНазначенияСервер.НайтиЭлементыИерархическогоСправочника("Склады", ИдентификаторыЭлементов, "Наименование");
		
КонецФункции

&НаКлиенте
Функция Тест72()

	Звуки = Новый Массив;
	Звуки.Добавить("СтандартнаяСхема\Ошибка");
	Звуки.Добавить("СтандартнаяСхема\Успех");
	
	КэшЗвуков = вмс_РаботаСоЗвукомКлиент.ЗакэшироватьЗвуки(Звуки);
		
КонецФункции

&НаКлиенте
Процедура КомандаТест(Команда)

	Выполнить("Тест" + НомерТеста + "()");

КонецПроцедуры

&НаКлиенте
Процедура КомандаОчистить(Команда)
	Подсказка = "";
КонецПроцедуры

#Область УниверсальныеСлужебныеФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	вмс_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, Объект);
КонецПроцедуры

//Для того, чтобы получить серверную форму, например, для добавления новых элементов формы
&НаСервере
Функция СлужебнаяФункцияВызовСервера(ПрограммныйКод, ДополнительныеПараметры=Неопределено) Экспорт
	Возврат вмс_ОбщегоНазначенияСервер.СлужебнаяФункцияВызовСервераНаФорме(ЭтаФорма, ПрограммныйКод, ДополнительныеПараметры);
КонецФункции

&НаКлиенте
Процедура КомандаКнопка1(Команда)
	Подсказка = Подсказка + "%";
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура Команда1(Команда)
	ОбщегоНазначенияКлиент.СообщитьПользователю(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	ОбщегоНазначенияКлиент.СообщитьПользователю(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПочинитьРегистрОперацииПоЯчейкам(Команда)
	КомандаПочинитьРегистрОперацииПоЯчейкамНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПочинитьРегистрОперацииПоЯчейкамНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вмс_ОперацияПоЯчейкам.Регистратор КАК РегистраторСсылка,
	|	вмс_ОперацияПоЯчейкам.Регистратор.Дата КАК РегистраторДата
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам КАК вмс_ОперацияПоЯчейкам
	|ГДЕ
	|	вмс_ОперацияПоЯчейкам.Регистратор.Номер ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистраторДата";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыНакопления.вмс_ОперацияПоЯчейкам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.РегистраторСсылка);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

#Если Сервер Тогда
МыНаСервере = Истина;
#КонецЕсли	
