#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказыватьКодыМаркировки = Истина;

	УстановитьСвязиВыбора();
	
	вмс_УправлениеСвойствамиСервер.ПриСозданииНаСервере(ЭтаФорма, Объект, Объект.Правило, "ГруппаДополнительно");
	
	УправлениеЭлементамиФормы();
	
	Элементы.ГруппаНастройкаПолейСтрок.Видимость = Ложь;
	
	НастроитьОформлениеСтрокТоваров();
	
	НастройкаПолей_ПриСозданииФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьФактическоеКоличество();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	вмс_УправлениеСвойствамиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	
	вмс_РаботаСФормамиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	вмс_РаботаСФормамиКлиент.ВключитьАвтоОбновлениеДокумента(ЭтаФорма, "ОбработчикОбновленияДокумента");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	вмс_УправлениеСвойствамиСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	Если НЕ Объект.АвтоНастройкаПолей Тогда
		Справочники.вмс_НастройкиПолейЗадания.ПередЗаписьюНаФорме(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	Если НЕ Объект.АвтоНастройкаПолей Тогда
		Справочники.вмс_НастройкиПолейЗадания.ПослеЗаписиНаФорме(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьДополнительныеРеквизиты();
	
	ЗаполнитьФактическоеКоличество();

	вмс_РаботаСФормамиКлиент.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	вмс_РаботаСФормамиКлиент.ПриЗакрытии(ЭтаФорма, ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДополнительныеРеквизиты()
	
	вмс_УправлениеСвойствамиСервер.ОбновитьДополнительныеРеквизиты(ЭтаФорма);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница=Элементы.СтраницаНастройкаПолей Тогда
		
		НастройкаПолей_ОткрытиеСтраницы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗонаОтправительПриИзменении(Элемент)
	
	ЗонаОтправительПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗонаОтправительПриИзмененииНаСервере()

	Документы.вмс_ЗаданиеКладовщику.ПриИзмененииЗоныОтправителя(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗонаПолучательПриИзменении(Элемент)
	
	ЗонаПолучательПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗонаПолучательПриИзмененииНаСервере()

	Документы.вмс_ЗаданиеКладовщику.ПриИзмененииЗоныПолучателя(Объект);
	
КонецПроцедуры

#КонецОбласти

//////////////////////////////////////////////////////////////////
//
//					Настройка полей+
//

&НаСервере
Функция НастройкаПолей_ПриСозданииФормы()

	СтруктураНастройкиПолей = Документы.вмс_ЗаданиеКладовщику.СтруктураНастройкиПолей(Объект);
	Справочники.вмс_НастройкиПолейЗадания.ПриСозданииФормы(ЭтаФорма, СтруктураНастройкиПолей);
	
КонецФункции

&НаКлиенте
Функция НастройкаПолей_ОткрытиеСтраницы()
КонецФункции

&НаКлиенте
Процедура АвтоНастройкаПолейПриИзменении(Элемент)
	
	Если Объект.АвтоНастройкаПолей Тогда
		
		ЗаполнитьНастройкуПолейПоУмолчанию();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНастройкуПолейПоУмолчанию()
	
	СтруктураНастройкиПолей = СтруктураНастройкиПолейПоУмолчанию();
	
	Справочники.вмс_НастройкиПолейЗадания.ЗаполнитьНастройкуПолейНаФорме(ЭтаФорма, СтруктураНастройкиПолей);
	
КонецФункции

&НаСервере
Функция СтруктураНастройкиПолейПоУмолчанию()
	
	Возврат Документы.вмс_ЗаданиеКладовщику.СтруктураНастройкиПолейПоУмолчанию(Объект);
	
КонецФункции

&НаКлиенте
Процедура НастройкаПолей_ПриИзменении(СтандартнаяОбработка)
	Объект.АвтоНастройкаПолей = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_ПриАктивизацииСтроки(Элемент)
	вмс_НастройкиПолейЗадания.СвойстваЭлемента_ПриАктивизацииСтрокиНаФорме(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Перетаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	вмс_НастройкиПолейЗадания.СвойстваЭлементов_Перетаскивание(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	вмс_НастройкиПолейЗадания.СвойстваЭлементов_ПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Имя_ПриИзменении(Элемент)
	вмс_НастройкиПолейЗадания.СвойстваЭлементов_Имя_ПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Имя_НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	вмс_НастройкиПолейЗадания.СвойстваЭлементов_Имя_НачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_ПриИзменении(Элемент)
	вмс_НастройкиПолейЗадания.СвойстваЭлементов_ПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Команда(Команда)
	вмс_НастройкиПолейЗадания.НастройкаПолей_Команда(ЭтаФорма, Команда);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_ДополнительныеСвойстваЭлемента_ПриАктивизацииСтроки(Элемент)
	вмс_НастройкиПолейЗадания.ДополнительныеСвойстваЭлемента_ПриАктивизацииСтрокиНаФорме(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_ДополнительныеСвойстваЭлемента_Значение_ПриИзменении(Элемент)
	вмс_НастройкиПолейЗадания.ДополнительныеСвойстваЭлемента_Значение_ПриИзмененииНаФорме(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_ДополнительныеСвойстваЭлемента_ПриИзменении(Элемент)
	вмс_НастройкиПолейЗадания.ДополнительныеСвойстваЭлемента_ПриИзменении(ЭтаФорма);
КонецПроцедуры

//
//					Настройка полей-
//
//////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

// ТОВАРЫ
&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		Элемент.ТекущиеДанные.ИдентификаторИнструкции = 0;
	КонецЕсли;
	
КонецПроцедуры

// НАСТРОЙКИ ПОЛЕЙ

// ДОПОЛНИТЕЛЬНЫЕ НАСТРОЙКИ
&НаКлиенте
Функция ОбработчикОбновленияДокумента(ОбработчикОжидания, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьФактическоеКоличествоНаКлиентеНаСервереБезКонтекста(Объект.Товары, ПолучитьФактВыполненияИнструкций(Объект.Ссылка));
	
КонецФункции

//функции без контекста используются для того, чтобы форма не "моргала" при клиент-серверной передаче формы
//в таком случае при редактировании текста в поле ввода, текст очищается и невозможно нормально вводить данные
&НаСервереБезКонтекста
Функция ПолучитьДанныеОбновленияДокументаНаСервереБезКонтекста(знач ПараметрыФункции)

	Ссылка = ПараметрыФункции.Ссылка;
	
	ТекущаяВерсияДанных = вмс_ОбщегоНазначенияВызовСервера.ВерсияДанных(Ссылка);
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ТекущаяВерсияДанных", ТекущаяВерсияДанных);
	Если ПараметрыФункции.ВерсияДанных=ТекущаяВерсияДанных Тогда
		РезультатФункции.Вставить("ДанныеФакта", ПолучитьФактВыполненияИнструкций(Ссылка));
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Функция ЗаполнитьФактическоеКоличество()
	
	ЗаполнитьФактическоеКоличествоНаКлиентеНаСервереБезКонтекста(Объект.Товары, ПолучитьФактВыполненияИнструкций(Объект.Ссылка));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьФактическоеКоличествоНаКлиентеНаСервереБезКонтекста(Товары, ДанныеФакта)

	Для Каждого ЭлементТовара Из Товары Цикл
		
		КоличествоФакт = ДанныеФакта[ЭлементТовара.ИдентификаторИнструкции];
		Если КоличествоФакт=Неопределено Тогда
			КоличествоФакт = 0;
		КонецЕсли;
		
		Если ЭлементТовара.КоличествоФакт <> КоличествоФакт Тогда
			ЭлементТовара.КоличествоФакт = КоличествоФакт;
		КонецЕсли;
		
	КонецЦикла;
	
	РассчитатьИдентификаторыОформленияСтрокТоваров(Товары);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьФактВыполненияИнструкций(знач Ссылка)
	
	ТаблицаФакта = Документы.вмс_ЗаданиеКладовщику.ПолучитьФактВыполненияИнструкций(Ссылка);
	
	ДанныеФакта = Новый Соответствие;
	Для Каждого СтрокаФакта Из ТаблицаФакта Цикл
		ДанныеФакта[СтрокаФакта.ИдентификаторИнструкции] = СтрокаФакта.Количество;
	КонецЦикла;
	
	Возврат ДанныеФакта;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьИдентификаторыОформленияСтрокТоваров(знач Строки)
	
	Если Строки=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипСтрок = ТипЗнч(Строки);
	Если ТипСтрок <> Тип("Массив") И ТипСтрок <> Тип("ДанныеФормыКоллекция") Тогда
		Строка = Строки;
		Строки = Новый Массив;
		Строки.Добавить(Строка);
	КонецЕсли;
	
	Для Каждого Строка Из Строки Цикл
		Если Строка.КоличествоФакт=0 Тогда
			ИдентификаторОформления = 0;
		ИначеЕсли Строка.КоличествоФакт < Строка.Количество Тогда
			ИдентификаторОформления = 1;
		ИначеЕсли Строка.КоличествоФакт = Строка.Количество Тогда
			ИдентификаторОформления = 2;
		Иначе
			ИдентификаторОформления = 3;
		КонецЕсли;
		
		Если Строка.ИдентификаторОформления <> ИдентификаторОформления Тогда
			Строка.ИдентификаторОформления = ИдентификаторОформления;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция НастроитьОформлениеСтрокТоваров()
	
	Цвета = Новый Массив;
	Цвета.Добавить(Новый Цвет(255, 255, 200));
	Цвета.Добавить(Новый Цвет(200, 255, 200));
	Цвета.Добавить(Новый Цвет(255, 200, 200));
	
	Для НомерЦвета=1 По Цвета.Количество() Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		ПолеУО = ЭлементУО.Поля.Элементы.Добавить();
		ПолеУО.Поле = Новый ПолеКомпоновкиДанных("Товары");
		
		ОтборУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ИдентификаторОформления");
		ОтборУО.ПравоеЗначение = НомерЦвета;
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Цвета[НомерЦвета-1]);
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВидимостьКодыМаркировки(Команда)
	ПоказыватьКодыМаркировки = Истина;
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкуПолей(Команда)
	
	ЗаполнитьНастройкиПолейНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПолейНаСервере()
	
	СтруктураНастройкиПолей = СтруктураНастройкиПолейПоУмолчанию();
	Справочники.вмс_НастройкиПолейЗадания.ЗаполнитьНастройкуПолейНаФорме(ЭтаФорма, СтруктураНастройкиПолей);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолейСтрок(Команда)
	
	Элементы.ГруппаНастройкаПолейСтрок.Видимость = Истина;
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаНастройкаПолейСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикКомандыДополнительныеНастройкиЭлемента(Команда)
	
	//Элементы.ДополнительныеНастройкиЭлемента.Видимость = НЕ Элементы.ДополнительныеНастройкиЭлемента.Видимость;
	//
	//Если Элементы.ДополнительныеНастройкиЭлемента.Видимость Тогда
	//	Элементы.КнопкаДополнительныеНастройкиЭлемента.Заголовок = "Дополнительно <<";
	//Иначе
	//	Элементы.КнопкаДополнительныеНастройкиЭлемента.Заголовок = "Дополнительно >>";
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ИспользоватьПомещения = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ИспользоватьПомещения", Ложь);
	Элементы.Помещение.Видимость = ИспользоватьПомещения;
	Элементы.ГруппаКодыМаркировки.Видимость = ПоказыватьКодыМаркировки;
	Элементы.ТоварыСерия.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиВыбора() 
	
	Если вмс_АдаптацияКонфигураций.ЭтоУТ() ИЛИ вмс_АдаптацияКонфигураций.ЭтоЕРП() Тогда 
		
		// установка связей параметров выбора
		// по владельцу характеристике
		
		Элементы.ТоварыХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый массив);
		
		Связи = Новый Массив();
		НоваяСвязь = Новый СвязьПараметраВыбора("Номенклатура", "Элементы.Товары.ТекущиеДанные.Номенклатура");	
		Связи.Добавить(НоваяСвязь); 
		
		Элементы.ТоварыХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);
		
		// по владельцу серии
		Элементы.ТоварыСерия.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый массив);
		
		Связи = Новый Массив();
		НоваяСвязь = Новый СвязьПараметраВыбора("Склад", "Объект.Склад");
		Связи.Добавить(НоваяСвязь);
		НоваяСвязь = Новый СвязьПараметраВыбора("Номенклатура", "Элементы.Товары.ТекущиеДанные.Номенклатура");  
		Связи.Добавить(НоваяСвязь);
		НоваяСвязь = Новый СвязьПараметраВыбора("Характеристика", "Элементы.Товары.ТекущиеДанные.Характеристика");
		Связи.Добавить(НоваяСвязь);
			
		Элементы.ТоварыСерия.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);
		
	КонецЕсли; 
	
	Если вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		
		Элементы.ТоварыХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый массив);
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы.Товары.ТекущиеДанные.Номенклатура");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);	
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	Если Объект.Авто Тогда
		Объект.Авто = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Автозаполнение задания отключено");
	КонецЕсли;
	РассчитатьИдентификаторыОформленияСтрокТоваров(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник=ЭтаФорма Тогда
		Если ИмяСобытия="НастройкаПолей_ПриИзменении" Тогда
			НастройкаПолей_ПриИзменении(Параметр.СтандартнаяОбработка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияПриИзменении(Элемент)
	
	Объект.Правило = НайтиПравилоЗаполненияЗадания(Объект.Операция);
	
	ПравилоПриИзменении(Элементы.Правило);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиПравилоЗаполненияЗадания(знач ВидОперации)
	
	Возврат Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.НайтиПравилоЗаполненияЗадания(ВидОперации);
	
КонецФункции

&НаКлиенте
Процедура ПравилоПриИзменении(Элемент)

	Если Объект.АвтоНастройкаПолей Тогда
		
		ЗаполнитьНастройкуПолейПоУмолчанию();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
