
Функция НовыйОпрос(ОповещениеОЗавершении) Экспорт
	
	ТаблицаВопросы = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений();
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(ТаблицаВопросы, "Имя");
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(ТаблицаВопросы, "ТекстВопроса");
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(ТаблицаВопросы, "ВариантыОтветов");
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(ТаблицаВопросы, "Условие");
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(ТаблицаВопросы, "Пропускать");
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(ТаблицаВопросы, "Результат");
	
	Опрос = Новый Структура;
	Опрос.Вставить("НомерТекущегоВопроса");
	Опрос.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	Опрос.Вставить("Вопросы", ТаблицаВопросы);
	
	Возврат Опрос;
	
КонецФункции

Функция ДобавитьВопрос(Опрос, ТекстВопроса, знач ВариантыОтветов=Неопределено, Условие=Неопределено) Экспорт
	
	Если ВариантыОтветов = Неопределено Тогда
		ВариантыОтветов = РежимДиалогаВопрос.ДаНет;
	КонецЕсли;
	
	НовыйВопрос = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Опрос.Вопросы);
	НовыйВопрос.ТекстВопроса = ТекстВопроса;
	НовыйВопрос.ВариантыОтветов = ВариантыОтветов;
	НовыйВопрос.Пропускать = Ложь;
	НовыйВопрос.Условие = Условие;
	
	Возврат НовыйВопрос;
	
КонецФункции

Функция ЗадатьВопрос(Опрос, Вопрос)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Вопрос", Вопрос);
	ДополнительныеПараметры.Вставить("Опрос", Опрос);
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОбработкаОтветаНаВопрос", ЭтотОбъект, ДополнительныеПараметры);
	Если ТипЗнч(Вопрос.ВариантыОтветов) = Тип("РежимДиалогаВопрос") Тогда
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, Вопрос.ТекстВопроса, Вопрос.ВариантыОтветов);
		Возврат Истина;
	КонецЕсли; 
	
	Если ТипЗнч(Вопрос.ВариантыОтветов) = Тип("Число") Тогда
		Результат = Вопрос.ВариантыОтветов;
		ПоказатьВводЧисла(ОписаниеОповещенияОЗавершении, Результат, Вопрос.ТекстВопроса);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ОбработкаОтветаНаВопрос(Результат, ДополнительныеПараметры) Экспорт
	
	Опрос = ДополнительныеПараметры.Опрос;
	НомерВопроса = Опрос.НомерТекущегоВопроса;
	
	Вопрос = ДополнительныеПараметры.Вопрос;
	Вопрос.Результат = Результат;
	
	Пока Опрос.НомерТекущегоВопроса < Опрос.Вопросы.Строки.Количество() Цикл
		// следующий вопрос
		Опрос.НомерТекущегоВопроса = Опрос.НомерТекущегоВопроса + 1;
		СледующийВопрос = Опрос.Вопросы.Строки[Опрос.НомерТекущегоВопроса-1];
		Если Не СледующийВопрос.Пропускать Тогда
			Если СледующийВопрос.Условие <> Неопределено Тогда
				Попытка
					УсловиеВыполнено = (Вычислить(СледующийВопрос.Условие) = Истина);
				Исключение
					УсловиеВыполнено = Ложь;
				КонецПопытки;
				
				Если Не УсловиеВыполнено Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли; 
			ЗадатьВопрос(Опрос, СледующийВопрос);
			Возврат;
		КонецЕсли; 
	КонецЦикла;
	
	// завершить опрос
	ВыполнитьОбработкуОповещения(Опрос.ОповещениеОЗавершении, Опрос);
	
КонецПроцедуры

Функция НачатьОпрос(Опрос) Экспорт
	Если Опрос.Вопросы.Строки.Количество() > 0 Тогда
		Опрос.НомерТекущегоВопроса = 1;
		Вопрос = Опрос.Вопросы.Строки[Опрос.НомерТекущегоВопроса-1];
		ЗадатьВопрос(Опрос, Вопрос)
	КонецЕсли; 
КонецФункции
