
Функция СформироватьЗаданияПоПравилу(Правило, Регистратор=Неопределено, знач Распоряжения=Неопределено) Экспорт
	
	Если Правило.РежимФормированияЗаданий=2 Тогда
		// без распоряжений
		Распоряжения = Неопределено;
	Иначе
		Если Распоряжения=Неопределено Тогда
			Распоряжения = ПолучитьРаспоряженияДляФормированияЗадачиПоПравилу(Правило, Регистратор);
		КонецЕсли;
		
		Если Распоряжения=Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Распоряжения = вмс_РаботаСКоллекциями.ЗначениеВМассив(Распоряжения, , Ложь);
	
	Для Каждого Распоряжение Из Распоряжения Цикл
		ТаблицаЗаданийКладовщикам = ЗаполнитьЗаданияКладовщикамПоРаспоряжению(Правило, Распоряжение);
		Если ТаблицаЗаданийКладовщикам <> Неопределено Тогда
			ЗаписатьЗадания(ТаблицаЗаданийКладовщикам);
		КонецЕсли;
	КонецЦикла;
	
	// Кулалаев++
	// Сам написал, сам закомментил, пока не понятно, как сделать явный переход на след. правило. У КС автоматически подтягиваются все правила по распоряжению
	//Если ЗначениеЗаполнено(Правило.СледующееПравило) Тогда
	//	СформироватьЗаданияПоПравилу(Правило.СледующееПравило, Регистратор, Распоряжения);
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьПланЗаполненияТабличнойЧастиТоварыПоРаспоряжению(Правило, Распоряжение) Экспорт 
	
	Перем Ресурсы;
	
	РК = вмс_РаботаСКоллекциями;
	
	ИмяТабличнойЧасти = "Товары";
	
	// Кулалаев++
	// Добавил ветки заполнения по принятым и отобранным заданиям
	Если Правило.Товары_ЗаполнятьПоОтобранным Тогда
		
		Параметры = Новый Структура;
		Параметры.Вставить("ДокументОснование", Распоряжение);
		Параметры.Вставить("ВидОперации", Правило.ПредыдущиеОперации.ВыгрузитьКолонку("ПредыдущаяОперация"));
		
		ТаблицаТоваров = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуОтобранныхТоваровЧерезСтруктуру(Параметры);
		
		ЗаполнениеТабличнойЧасти = НовоеЗаполнениеТабличнойЧастиЗадания(ИмяТабличнойЧасти, ТаблицаТоваров);
		
	ИначеЕсли Правило.Товары_ЗаполнятьПоПринятым И Правило.РазмещатьКонтейнерыБезПересчета Тогда
		
		ТаблицаТоваров = ПолучитьТаблицуПланПоПринятымКонтейнерам(Правило, Распоряжение);
		
	Иначе
		
		ПараметрыСКД = Новый Структура;
		ПараметрыСКД.Вставить("Правило", Правило.Ссылка);
		ПараметрыСКД.Вставить("Операция", Правило.ОперацияНазначение);
		Если Правило.Товары_ЗаполнятьПоПринятым Тогда
			// ТУ_КС
			// прогоним предварительную таблицу так же через СКД для возможности дополнения,
			// например для добавления идентификатора задания по какой-либо логике
			ТаблицаПринятыхТоваров = ПолучитьТаблицуПланПоПринятым(Правило, Распоряжение);
			ПараметрыСКД.Вставить("ТаблицаПринятыхТоваров", ТаблицаПринятыхТоваров);
		КонецЕсли;
		
		Результат = ПолучитьРезультатДанныхСКДПоПравилу(Правило, "Товары", Распоряжение, ПараметрыСКД);
		ТаблицаТоваров = Результат.Данные;
		Если ТипЗнч(ТаблицаТоваров) <> Тип("ТаблицаЗначений") Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Ресурсы = Результат.Ресурсы;
		
		ЗаменитьТиповуюСериюНаСериюВМС(ТаблицаТоваров);
		
	КонецЕсли;
	
	КолонкаНоменклатура = ТаблицаТоваров.Колонки.Найти("Номенклатура");
	Если КолонкаНоменклатура=Неопределено Тогда
		КолонкаТовар = ТаблицаТоваров.Колонки.Найти("Товар");
		Если КолонкаТовар <> Неопределено Тогда
			ТаблицаТоваров.Колонки.Добавить("Номенклатура");
			ТаблицаТоваров.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("Товар"), "Номенклатура");
		КонецЕсли;
	КонецЕсли;
	
	Если ТаблицаТоваров.Колонки.Найти("ИдентификаторЗадания")=Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ИдентификаторЗадания");
		ТаблицаТоваров.ЗаполнитьЗначения(Неопределено, "ИдентификаторЗадания");
	КонецЕсли;
	
	УдалитьНеиспользуемыеТоварныеПоля(ТаблицаТоваров);
	ПланЗаполненияТабличнойЧастиПоРаспоряжению = НовоеЗаполнениеТабличнойЧастиЗадания(ИмяТабличнойЧасти, ТаблицаТоваров, Ресурсы);
	РК.ВычестьМассив(ПланЗаполненияТабличнойЧастиПоРаспоряжению.ПоляГруппы, "Количество, КоличествоБазовыхЕдиниц"); // не группировать по полю "Количество", никогда

	Возврат ПланЗаполненияТабличнойЧастиПоРаспоряжению;
	
КонецФункции

Функция ЗаменитьТиповуюСериюНаСериюВМС(ТаблицаТоваров)

	КолонкаСерия = ТаблицаТоваров.Колонки.Найти("Серия");
	Если КолонкаСерия=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
			
	РК = вмс_РаботаСКоллекциями;
	ТипСерияВМС = Тип("СправочникСсылка.вмс_СерииНоменклатуры");
	РК.РазтипизироватьТаблицуЗначений(ТаблицаТоваров, "Серия");
	
	СоответствиеСерий = Новый Соответствие;
	
	Для Каждого Строка Из ТаблицаТоваров Цикл
		
		ИсходнаяСерия = Строка.Серия;
		СерияВМС = Неопределено;
		
		Если Не ЗначениеЗаполнено(ИсходнаяСерия) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ИсходнаяСерия)=ТипСерияВМС Тогда
			Продолжить;
		КонецЕсли;
		
		Если СоответствиеСерий.Получить(ИсходнаяСерия) = Неопределено Тогда
			
			СерияВМС = вмс_ВзаимодействиеСОбъектамиУчетаСервер.ПолучитьИлиСоздатьОбъектВмсПоОбъектуУчета(ИсходнаяСерия);
			
			Если Не ЗначениеЗаполнено(СерияВМС) Тогда
				Продолжить;
			КонецЕсли;
			
			СоответствиеСерий.Вставить(ИсходнаяСерия, СерияВМС);
			
		КонецЕсли;
		
		Строка.Серия = СоответствиеСерий[ИсходнаяСерия];
		
	КонецЦикла;
	
	Возврат Истина;
		
КонецФункции

Функция ЗаполнитьПризнакПересчетКонтейнераРодителя(ТаблицаТоваров)

	Если ТаблицаТоваров.Колонки.Найти("Контейнер")=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РК = вмс_РаботаСКоллекциями;
	Если ТаблицаТоваров.Колонки.Найти("ПересчетКонтейнераРодителя")=Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ПересчетКонтейнераРодителя", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	// Необходимо проверить на наличие пересчета короба, который лежит на паллете, если так - заполнить соответствующий реквизит   
	ТаблицаТоваровРазложенная = ТаблицаТоваров.Скопировать();
	ТаблицаТоваровРазложенная.Очистить();
	МассивСтрокиКУдалению = Новый Массив;
	Для Каждого Строка Из ТаблицаТоваров Цикл 
		Если ЗначениеЗаполнено(Строка.Контейнер) И ЗначениеЗаполнено(Строка.Товар) Тогда
			КонтейнерРодитель = вмс_ПартионныйУчетСервер.ПолучитьКонтейнерРодитель(Строка.Контейнер);
			Если ЗначениеЗаполнено(КонтейнерРодитель) Тогда   
				Строка.ПересчетКонтейнераРодителя = Истина;
			КонецЕсли;	   
		ИначеЕсли ЗначениеЗаполнено(Строка.Контейнер) Тогда
			//получается, что задание формируется на основании другой операции, в другой операции пересчета нет, а в этой есть, нужно разузловать контейнер по товарам
			СоставКонтейнера = вмс_ПартионныйУчетСервер.ПолучитьСоставПартии(Строка.Контейнер);
			Для Каждого СтрокаТовараКонтейнера Из СоставКонтейнера.Товары Цикл
				НоваяСтрока = ТаблицаТоваровРазложенная.Добавить(); 
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовараКонтейнера);
				НоваяСтрока.Количество = СтрокаТовараКонтейнера.КоличествоКонечныйОстаток; 
				НоваяСтрока.Контейнер = СтрокаТовараКонтейнера.Контейнер;   
				Если Строка.Контейнер <> СтрокаТовараКонтейнера.Контейнер Тогда 
					НоваяСтрока.ПересчетКонтейнераРодителя = Истина;    
				КонецЕсли;
			КонецЦикла;   
			
			МассивСтрокиКУдалению.Добавить(Строка);
		КонецЕсли;	
	КонецЦикла;
	
	Если МассивСтрокиКУдалению.Количество() > 0 Тогда
		РК.УдалитьЭлементыКоллекции(ТаблицаТоваров, МассивСтрокиКУдалению);
	КонецЕсли;
	
	Если ТаблицаТоваровРазложенная.Количество() > 0 Тогда
		РК.ДобавитьЭлементыКоллекции(ТаблицаТоваров, ТаблицаТоваровРазложенная);
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция ПолучитьПланЗаполненияТабличнойЧастиКодыМаркировкиПоРаспоряжению(Правило, Распоряжение) Экспорт 
	
	Перем Ресурсы;
	
	РК = вмс_РаботаСКоллекциями;
	
	ИмяТабличнойЧасти = "КодыМаркировки";
	
	Результат = ПолучитьРезультатДанныхСКДПоПравилу(Правило, ИмяТабличнойЧасти, Распоряжение);
	ТаблицаТоваров = Результат.Данные;
	Если ТипЗнч(ТаблицаТоваров) <> Тип("ТаблицаЗначений") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ресурсы = Результат.Ресурсы;
		
	Если ТаблицаТоваров.Колонки.Найти("ИдентификаторЗадания")=Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ИдентификаторЗадания");
		ТаблицаТоваров.ЗаполнитьЗначения(Неопределено, "ИдентификаторЗадания");
	КонецЕсли;
	
	УдалитьНеиспользуемыеТоварныеПоля(ТаблицаТоваров);
	ПланЗаполненияТабличнойЧастиПоРаспоряжению = НовоеЗаполнениеТабличнойЧастиЗадания(ИмяТабличнойЧасти, ТаблицаТоваров, Ресурсы);
	РК.ВычестьМассив(ПланЗаполненияТабличнойЧастиПоРаспоряжению.ПоляГруппы, "Количество"); // не группировать по полю "Количество", никогда

	Возврат ПланЗаполненияТабличнойЧастиПоРаспоряжению;
	
КонецФункции

Функция ПолучитьТаблицуПланПоРаспоряжению(Правило, Распоряжение) Экспорт 
	
	ПланЗаполненияТабличнойЧастиПоРаспоряжению = ПолучитьПланЗаполненияТабличнойЧастиТоварыПоРаспоряжению(Правило, Распоряжение);
	
	Если ПланЗаполненияТабличнойЧастиПоРаспоряжению <> Неопределено Тогда
		
		Возврат ПланЗаполненияТабличнойЧастиПоРаспоряжению.Данные;
		
	КонецЕсли;

КонецФункции

Функция ПолучитьПланЗаполненияТабличныхЧастейПоРаспоряжению(Правило, Распоряжение)

	ПланЗаполненияТабличныхЧастей = Новый Структура;
	
	ПланЗаполненияТабличнойЧастиТовары = ПолучитьПланЗаполненияТабличнойЧастиТоварыПоРаспоряжению(Правило, Распоряжение);
	Если ПланЗаполненияТабличнойЧастиТовары <> Неопределено Тогда
		ПланЗаполненияТабличныхЧастей.Вставить("Товары", ПланЗаполненияТабличнойЧастиТовары);
	КонецЕсли;
	
	ПланЗаполненияТабличнойЧастиКодыМаркировки = ПолучитьПланЗаполненияТабличнойЧастиКодыМаркировкиПоРаспоряжению(Правило, Распоряжение);
	Если ПланЗаполненияТабличнойЧастиКодыМаркировки <> Неопределено Тогда
		ПланЗаполненияТабличныхЧастей.Вставить("КодыМаркировки", ПланЗаполненияТабличнойЧастиКодыМаркировки);
	КонецЕсли;
	
	Возврат ПланЗаполненияТабличныхЧастей;
	
КонецФункции

Функция ЗаполнитьПланЗаданий(Правило, ТаблицаШапок, ПланЗаполненияТабличныхЧастейПоРаспоряжению, ТаблицаЗаданийКладовщикам)

	Для Каждого ПланЗаполненияТабличнойЧастиПоРаспоряжению Из ПланЗаполненияТабличныхЧастейПоРаспоряжению Цикл
		
		ЗаполнитьПланТабличнойЧастиЗаданий(Правило, ТаблицаШапок, ПланЗаполненияТабличнойЧастиПоРаспоряжению.Значение, ТаблицаЗаданийКладовщикам);
		
	КонецЦикла;
	
КонецФункции

Функция ЗаполнитьПланТабличнойЧастиЗаданий(Правило, ТаблицаШапок, ПланЗаполненияТабличнойЧастиПоРаспоряжению, ТаблицаЗаданийКладовщикам)

	ОперацияВозврат = Правило.ОперацияВозврат;
	Операция = Правило.ОперацияНазначение;
	
	ИмяТабличнойЧасти = ПланЗаполненияТабличнойЧастиПоРаспоряжению.ИмяТабличнойЧасти;
	
	ЗаданияКладовщикам = ТаблицаЗаданийКладовщикам.ВыгрузитьКолонку("ЗаданиеКладовщику");
	
	ТаблицаПланПоЗаданиямКладовщикам = ПолучитьТаблицуПланПоЗаданиямКладовщикам(ИмяТабличнойЧасти, ЗаданияКладовщикам, Операция, ОперацияВозврат);
	
	ТаблицаПланПоРаспоряжению = ПланЗаполненияТабличнойЧастиПоРаспоряжению.Данные;
	ТаблицаРасхожденийПлана = ПолучитьТаблицуРасхождений(ТаблицаПланПоЗаданиямКладовщикам, ТаблицаПланПоРаспоряжению, ПланЗаполненияТабличнойЧастиПоРаспоряжению);
	
	Если ТаблицаРасхожденийПлана.Количество()=0 Тогда
		// все ровно
		Возврат Истина;
	КонецЕсли;
	
	ПоискЗаданий = Новый Структура("Активно, Авто, Операция, ИдентификаторЗадания", Истина, Истина, Операция);
	
	ТаблицаДобавленияТоваров = ПолучитьТаблицуДобавленияТоваров(ТаблицаРасхожденийПлана);
	Если ТаблицаДобавленияТоваров.Количество() > 0 Тогда
		ТаблицаИдентификаторовЗаданий = ТаблицаДобавленияТоваров.Скопировать();
		ТаблицаИдентификаторовЗаданий.Свернуть("ИдентификаторЗадания");
		ИдентификаторыЗаданий = ТаблицаИдентификаторовЗаданий.ВыгрузитьКолонку("ИдентификаторЗадания");
		Для Каждого ИдентификаторЗадания Из ИдентификаторыЗаданий Цикл
			ПоискЗаданий.ИдентификаторЗадания = ИдентификаторЗадания;
			Попытка
				СтрокаЗадания = ТаблицаЗаданийКладовщикам.НайтиСтроки(ПоискЗаданий)[0]; //должна существовать после заполнения шапки задания
			Исключение
				ВызватьИсключение "Не найден ИдентификаторЗадания " + ИдентификаторЗадания;
			КонецПопытки;
			ТаблицаДобавленияТоваровВЗадание = ТаблицаДобавленияТоваров.Скопировать(Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания));
			ДобавитьТоварыВЗадание(ИмяТабличнойЧасти, СтрокаЗадания.ЗаданиеКладовщикуОбъект, ТаблицаДобавленияТоваровВЗадание, ПланЗаполненияТабличнойЧастиПоРаспоряжению);
			СтрокаЗадания.Модифицирован = Истина;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаУдаленияТоваров = ПолучитьТаблицуУдаленияТоваров(ТаблицаРасхожденийПлана);
	Если ТаблицаУдаленияТоваров.Количество() > 0 Тогда
		ТаблицаФакт = ПолучитьТаблицуФактПоЗаданиямКладовщику(ИмяТабличнойЧасти, ЗаданияКладовщикам, Операция, ОперацияВозврат);
		ТаблицаНеобработано = ПолучитьТаблицуРасхождений(ТаблицаФакт, ТаблицаПланПоЗаданиямКладовщикам, ПланЗаполненияТабличнойЧастиПоРаспоряжению);
		ТаблицаВозвратовТоваров = ТаблицаУдаленияТоваров.Скопировать();
		ТаблицаВычерков = ПолучитьТаблицуВычерков(ТаблицаВозвратовТоваров, ТаблицаНеобработано, ПланЗаполненияТабличнойЧастиПоРаспоряжению);
		Если ТаблицаВычерков.Количество() > 0 Тогда
			ПоискЗаданий.Вставить("Проведен", Истина);
			ТаблицаИдентификаторовЗаданий = ТаблицаВычерков.Скопировать();
			ТаблицаИдентификаторовЗаданий.Свернуть("ИдентификаторЗадания");
			ИдентификаторыЗаданий = ТаблицаИдентификаторовЗаданий.ВыгрузитьКолонку("ИдентификаторЗадания");
			Для Каждого ИдентификаторЗадания Из ИдентификаторыЗаданий Цикл
				ПоискЗаданий.ИдентификаторЗадания = ИдентификаторЗадания;
				ТаблицаВычерковИзЗадания = ТаблицаВычерков.Скопировать(Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания));
				
				НайденныеСтрокиАктивныхЗаданий = ТаблицаЗаданийКладовщикам.НайтиСтроки(ПоискЗаданий);
				Для Каждого СтрокаЗадания Из НайденныеСтрокиАктивныхЗаданий Цикл
					УдалитьТоварыИзЗадания(ИмяТабличнойЧасти, СтрокаЗадания.ЗаданиеКладовщикуОбъект, ТаблицаВычерковИзЗадания, ПланЗаполненияТабличнойЧастиПоРаспоряжению);
					СтрокаЗадания.Модифицирован = Истина;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция	ЗаписатьЗадания(ТаблицаЗаданийКладовщикам)

	Для Каждого СтрокаЗадания Из ТаблицаЗаданийКладовщикам Цикл
		
		Если НЕ СтрокаЗадания.Модифицирован Тогда
			Продолжить;
		КонецЕсли;
		
		Задание = СтрокаЗадания.ЗаданиеКладовщикуОбъект;
		Если Задание=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Задание.Товары.Количество()=0 Тогда
			Если Задание.ЭтоНовый() Тогда
				Продолжить;
			КонецЕсли;
			
			Задание.Проведен = Ложь;
		КонецЕсли;
		
		Если Задание.ПометкаУдаления И НЕ СтрокаЗадания.ПометкаУдаления Тогда
			
			Задание.ПометкаУдаления = Ложь;
			Задание.Записать(РежимЗаписиДокумента.Запись);
			Задание.УстановитьПометкуУдаления(Истина);
			
		ИначеЕсли НЕ Задание.Проведен И СтрокаЗадания.Проведен Тогда
			
			Задание.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(Задание.Дата) Тогда
				Задание.Дата = ТекущаяДата();
			КонецЕсли;
			
			Если Задание.Проведен Тогда
				
				Задание.ПометкаУдаления = Ложь;
				Задание.Записать(РежимЗаписиДокумента.Проведение);
				
			Иначе

				Задание.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция	ЗаполнитьШапкиЗаданий(ТаблицаШапок, ТаблицаЗаданийКладовщикам, Правило)

	РК = вмс_РаботаСКоллекциями;
	
	ОтборЗаданий = Новый Структура("Активно, Авто, Операция, ИдентификаторЗадания", Истина, Истина);
	
	Если ТипЗнч(Правило)=Тип("СправочникСсылка.вмс_ПравилаЗаполненияЗадачиКладовщику") Тогда
		ПравилоСсылка = Правило;
		ПравилоОбъект = Правило.ПолучитьОбъект();
		ПравилоОбъект.Прочитать();
	Иначе
		ПравилоСсылка = Правило.Ссылка;
		ПравилоОбъект = Правило;
	КонецЕсли;
	
	Для Каждого Шапка Из ТаблицаШапок Цикл
		
		ЗаполнитьЗначенияСвойств(ОтборЗаданий, Шапка, "ИдентификаторЗадания");
		ОтборЗаданий.Операция = ПравилоОбъект.ОперацияНазначение;
		НайденныеЗадания = ТаблицаЗаданийКладовщикам.НайтиСтроки(ОтборЗаданий);
		Если НайденныеЗадания.Количество()=0 Тогда
			Задание = Документы.вмс_ЗаданиеКладовщику.СоздатьДокумент();
			Задание.Заполнить(Неопределено);
			Задание.Правило = ПравилоСсылка;
			Задание.Авто = Истина;
			Задание.Состояние = Перечисления.вмс_СостоянияЗаявокКладовщику.Подготовлена;
			Задание.АвтоНастройкаПолей = Истина;
			Задание.Операция = ПравилоОбъект.ОперацияНазначение;
			Задание.Идентификатор = Шапка.ИдентификаторЗадания;
			Если Задание.Идентификатор <> Шапка.ИдентификаторЗадания Тогда
				ВызватьИсключение "Недопустимый тип идентификатора задания: """ + ТипЗнч(Шапка.ИдентификаторЗадания) + """";
			КонецЕсли;			
			СтрокаЗадания = ТаблицаЗаданийКладовщикам.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗадания, ОтборЗаданий);
			СтрокаЗадания.Проведен = Ложь;
			СтрокаЗадания.ПометкаУдаления = Ложь;
			СтрокаЗадания.Модифицирован = Истина;
			СтрокаЗадания.ЗаданиеКладовщикуОбъект = Задание;
			
			Задание.ДополнительныеРеквизиты.Очистить();
			Для Каждого ДополнительныйРеквизитПравила Из ПравилоОбъект.ДополнительныеРеквизиты Цикл
				ДополнительныйРеквизитЗадания = Задание.ДополнительныеРеквизиты.Добавить();
				ЗаполнитьЗначенияСвойств(ДополнительныйРеквизитЗадания, ДополнительныйРеквизитПравила);
			КонецЦикла;
		Иначе
			СтрокаЗадания = НайденныеЗадания[0];
			Задание = СтрокаЗадания.ЗаданиеКладовщикуОбъект;
		КонецЕсли; 
		
		// Кулалаев++
		// Добавил ветку с переопределяемой шапкой
		Если ПравилоОбъект.Шапка_Переопределяемая Тогда
			Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.Переопределяемый_ЗаполнитьШапкуЗадания(Задание, Шапка, Правило);
		Иначе
			РеквизитыЗадания = РК.СтрокуТаблицыЗначенийВСтруктуру(Шапка);
			ЗаполнитьЗначенияСвойств(РеквизитыЗадания, Задание);
			Для Каждого РеквизитЗадания Из РеквизитыЗадания Цикл
				ИмяРеквизита = РеквизитЗадания.Ключ;
				НовоеЗначениеРеквизита = Шапка[ИмяРеквизита];
				Если РеквизитЗадания.Значение <> НовоеЗначениеРеквизита Тогда
					Задание[ИмяРеквизита] = НовоеЗначениеРеквизита;
					СтрокаЗадания.Модифицирован = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции    

Функция УдалитьТоварыИзЗадания(ИмяТабличнойЧасти, Задание, ТаблицаВычерков, ПланЗаполненияТабличнойЧастиПоРаспоряжению)

	РК = вмс_РаботаСКоллекциями;

	ТабличнаяЧасть = Задание[ИмяТабличнойЧасти];

	ПоляГруппы = РК.ПересечениеМассивов(РК.ПолучитьКолонкиКоллекции(ТабличнаяЧасть.Выгрузить()), РК.ПолучитьКолонкиКоллекции(ТаблицаВычерков));
	ПоляГруппы = РК.ПересечениеМассивов(ПоляГруппы, ПланЗаполненияТабличнойЧастиПоРаспоряжению.ПоляГруппы);
	
	ПоляОтбора = РК.МассивВСтроку(ПоляГруппы);
	Отбор = Новый Структура(ПоляОтбора);
	Для Каждого СтрокаВычерка Из ТаблицаВычерков Цикл
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаВычерка);
		
		СтрокиПоТовару = ТабличнаяЧасть.НайтиСтроки(Отбор);
		Для Каждого СтрокаПоТовару Из СтрокиПоТовару Цикл
			
			КоличествоДляВычерка = Мин(СтрокаПоТовару.Количество, СтрокаВычерка.Количество);
			Если КоличествоДляВычерка <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаПоТовару.Количество = СтрокаПоТовару.Количество - КоличествоДляВычерка;
			СтрокаВычерка.Количество = СтрокаВычерка.Количество - КоличествоДляВычерка;
			
			Если СтрокаПоТовару.Количество=0 Тогда
				ТабличнаяЧасть.Удалить(СтрокаПоТовару);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьТаблицуВычерков(ТаблицаУдаленияТоваров, ТаблицаНеобработано, ПланЗаполненияТабличнойЧастиПоРаспоряжению)
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаВычерков = ТаблицаУдаленияТоваров.СкопироватьКолонки();
	
	ПоляГруппы = РК.ПересечениеМассивов(РК.ПолучитьКолонкиКоллекции(ТаблицаУдаленияТоваров), РК.ПолучитьКолонкиКоллекции(ТаблицаНеобработано));
	ПоляГруппы = РК.ПересечениеМассивов(ПланЗаполненияТабличнойЧастиПоРаспоряжению.ПоляГруппы, ПоляГруппы);
	ПоляОтбора = РК.МассивВСтроку(ПоляГруппы);
	Отбор = Новый Структура(ПоляОтбора);
	Для Каждого СтрокаУдаления Из ТаблицаУдаленияТоваров Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаУдаления);
		ТоварНеобработаноМассив = ТаблицаНеобработано.НайтиСтроки(Отбор);
		
		Для Каждого ТоварНеобработано Из ТоварНеобработаноМассив Цикл
			
			Если СтрокаУдаления.Количество=0 Тогда
				Продолжить;
			КонецЕсли;
			
			КоличествоДляВычерка = Мин(СтрокаУдаления.Количество, ТоварНеобработано.Количество);
			Если КоличествоДляВычерка <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаВычерка = ТаблицаВычерков.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВычерка, СтрокаУдаления);
			СтрокаВычерка.Количество = КоличествоДляВычерка;
			
			ТоварНеобработано.Количество = ТоварНеобработано.Количество - КоличествоДляВычерка;
			СтрокаУдаления.Количество = СтрокаУдаления.Количество - КоличествоДляВычерка;
			
		КонецЦикла;
		
	КонецЦикла;
	
	РК = вмс_РаботаСКоллекциями;
	РК.УдалитьНеположительныеСтрокиКоллекции(ТаблицаУдаленияТоваров, "Количество");
	
	Возврат ТаблицаВычерков;
	
КонецФункции

Функция ПолучитьЗадание(Операция, ИдентификаторЗадания, ТаблицаЗаданийКладовщикам)
	
	НайденныеСтроки = ТаблицаЗаданийКладовщикам.НайтиСтроки(Новый Структура("Активно, Операция, ИдентификаторЗадания", Истина, Операция, ИдентификаторЗадания));
	
	СтрокаЗадания = НайденныеСтроки[0];

	Задание = СтрокаЗадания.ЗаданиеКладовщикуОбъект;
	Если Не Задание.Проведен Тогда
		Задание.Товары.Очистить();
		Задание.Проведен = Истина;
	КонецЕсли;
	
	Возврат Задание;
	
КонецФункции

Функция ПолучитьТаблицуДобавленияТоваров(ТаблицаРасхожденийПлана)
	
	ТаблицаДобавленияТоваров = ТаблицаРасхожденийПлана.СкопироватьКолонки();
	
	Для Каждого СтрокаРасхождения Из ТаблицаРасхожденийПлана Цикл
		Если СтрокаРасхождения.Количество > 0 Тогда
			СтрокаДобавления = ТаблицаДобавленияТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДобавления, СтрокаРасхождения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаДобавленияТоваров;
	
КонецФункции

Функция ДобавитьТоварыВЗадание(ИмяТабличнойЧасти, Задание, ТаблицаДобавленияТоваров, ПланЗаполненияТабличнойЧастиПоРаспоряжению)

	РК = вмс_РаботаСКоллекциями;
	
	ТабличнаяЧасть = Задание[ИмяТабличнойЧасти];

	КолонкаИтога = ПланЗаполненияТабличнойЧастиПоРаспоряжению.КолонкаИтога;
	
	ПоляЗаполненияМассив = РК.ПересечениеМассивов(РК.ПолучитьКолонкиКоллекции(ТабличнаяЧасть.Выгрузить()), РК.ПолучитьКолонкиКоллекции(ТаблицаДобавленияТоваров));
	РК.ВычестьМассив(ПоляЗаполненияМассив, КолонкаИтога);

	ПоляГруппы = РК.ПересечениеМассивов(ПоляЗаполненияМассив, ПланЗаполненияТабличнойЧастиПоРаспоряжению.ПоляГруппы);
	
	ПоляОтбора = РК.МассивВСтроку(ПоляГруппы);
	Отбор = Новый Структура(ПоляОтбора);
	
	Если НЕ Задание.Проведен Тогда
		ТабличнаяЧасть.Очистить();
		Задание.Проведен = Истина;
	КонецЕсли;
	
	ПоляЗаполнения = РК.МассивВСтроку(ПоляЗаполненияМассив);

	Для Каждого СтрокаДобавленияТовара Из ТаблицаДобавленияТоваров Цикл
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаДобавленияТовара);
		Если Отбор.Количество() > 0 Тогда
			НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(Отбор);
		Иначе
			НайденныеСтроки = ТабличнаяЧасть;
		КонецЕсли;
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаТовара = НайденныеСтроки[0];
		Иначе
			СтрокаТовара = ТабличнаяЧасть.Добавить();
			СтрокаТовара[КолонкаИтога] = 0;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаТовара, СтрокаДобавленияТовара, ПоляЗаполнения);
		СтрокаТовара[КолонкаИтога] = СтрокаТовара[КолонкаИтога] + СтрокаДобавленияТовара[КолонкаИтога];
	КонецЦикла;
	
КонецФункции

Функция ПолучитьТаблицуУдаленияТоваров(ТаблицаРасхожденийПлана)

	ТаблицаУдаленияТоваров = ТаблицаРасхожденийПлана.СкопироватьКолонки();
	
	Для Каждого СтрокаРасхождения Из ТаблицаРасхожденийПлана Цикл
		Если СтрокаРасхождения.Количество < 0 Тогда
			СтрокаУдаления = ТаблицаУдаленияТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаУдаления, СтрокаРасхождения);
			СтрокаУдаления.Количество = -СтрокаРасхождения.Количество;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаУдаленияТоваров;
	
КонецФункции

Функция ПолучитьТаблицуНеобработано(ТаблицаПлан, ТаблицаФакт, Операция)
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаОтобрано = ТаблицаФакт.Скопировать(Новый Структура("Операция", Операция));
	РК.ИнвертироватьЗначенияКоллекции(ТаблицаОтобрано, "Количество");
	
	ТаблицаНеобработано = ТаблицаПлан.СкопироватьКолонки();
	РК.ДобавитьЭлементыКоллекции(ТаблицаНеобработано, ТаблицаПлан);
	РК.ДобавитьЭлементыКоллекции(ТаблицаНеобработано, ТаблицаОтобрано);
	РК.СвернутьКоллекциюЗначений(ТаблицаНеобработано, , "Количество");
	РК.УдалитьПустыеСтрокиКоллекции(ТаблицаНеобработано, "Количество");
	
	Возврат ТаблицаНеобработано;
	
КонецФункции

Функция ПолучитьТаблицуРасхождений(Таблица1, Таблица2, ПланЗаполненияТабличнойЧастиПоРаспоряжению)
	
	РК = вмс_РаботаСКоллекциями;

	КолонкаИтога = ПланЗаполненияТабличнойЧастиПоРаспоряжению.КолонкаИтога;
	
	ПоляТаблицы1 = РК.ПолучитьКолонкиКоллекции(Таблица1);
	ПоляТаблицы2 = РК.ПолучитьКолонкиКоллекции(Таблица2);
	
	ПоляЗаполненияМассив = РК.ВычитаниеМассивов(ПоляТаблицы2, КолонкаИтога);
	
	ПоляГруппы = РК.ПересечениеМассивов(ПоляЗаполненияМассив, ПланЗаполненияТабличнойЧастиПоРаспоряжению.ПоляГруппы);
	ПоляГруппы = РК.ПересечениеМассивов(ПоляТаблицы1, ПоляГруппы);
	
	ПоляТаблицы = РК.СложениеМассивов(ПоляГруппы, КолонкаИтога);
	ТаблицаРасхождений = РК.НоваяТаблицаЗначений(ПоляТаблицы);
	
	РК.ДобавитьЭлементыКоллекции(ТаблицаРасхождений, Таблица1);
	РК.ИнвертироватьЗначенияКоллекции(ТаблицаРасхождений, "Количество");
	РК.ДобавитьЭлементыКоллекции(ТаблицаРасхождений, Таблица2);
	
	РК.ДополнитьКолонкиКоллекции(ТаблицаРасхождений, ПоляТаблицы2);
	РК.ДополнитьКолонкиКоллекции(ТаблицаРасхождений, "ИдентификаторЗадания");
	
	// почистим-типизируем пустые значения полей
	ПоляТаблицы = РК.ПолучитьКолонкиКоллекции(ТаблицаРасхождений);
	
	ПочиститьПоля = Новый Структура;
	Если ПоляТаблицы.Найти("Контейнер") <> Неопределено Тогда
		ПустойКонтейнер = Справочники.вмс_Контейнеры.ПустаяСсылка();
		ПочиститьПоля.Вставить("Контейнер", ПустойКонтейнер);
	КонецЕсли;

	Если ПоляТаблицы.Найти("Склад") <> Неопределено Тогда
		ПустойСклад = Справочники[вмс_АдаптацияКонфигураций.ПолучитьИмяСправочникаСклады()].ПустаяСсылка();
		ПочиститьПоля.Вставить("Склад", ПустойСклад);
	КонецЕсли;

	Если ПоляТаблицы.Найти("Серия") <> Неопределено Тогда
		ПустаяСерия = Справочники.вмс_СерииНоменклатуры.ПустаяСсылка();
		ПочиститьПоля.Вставить("Серия", ПустаяСерия);
	КонецЕсли;

	Если ПочиститьПоля.Количество() > 0 Тогда
		Для Каждого СтрокаРасхождения Из ТаблицаРасхождений Цикл
			Для Каждого ПолеДляОчистки Из ПочиститьПоля Цикл
				Если НЕ ЗначениеЗаполнено(СтрокаРасхождения[ПолеДляОчистки.Ключ]) Тогда
					СтрокаРасхождения[ПолеДляОчистки.Ключ] = ПолеДляОчистки.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	// подведем итог
	РК.СвернутьКоллекциюЗначений(ТаблицаРасхождений, , КолонкаИтога);
	РК.УдалитьПустыеСтрокиКоллекции(ТаблицаРасхождений, КолонкаИтога);
	
	// заполним дополнительные колонки (негруппировочные, неитоговые)
	ПоляОтбора = РК.МассивВСтроку(ПоляГруппы);
	Отбор = Новый Структура(ПоляОтбора);
	ПоляЗаполнения = РК.МассивВСтроку(ПоляЗаполненияМассив);
	Для Каждого СтрокаРасхождения Из ТаблицаРасхождений Цикл
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаРасхождения);
		СтрокаДопИнформации = РК.НайтиЭлементКоллекции(Таблица2, Отбор);
		Если СтрокаДопИнформации <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаРасхождения, СтрокаДопИнформации, ПоляЗаполнения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРасхождений;
	
КонецФункции

Функция УдалитьНеиспользуемыеТоварныеПоля(ТаблицаТоваров)
	
	РК = вмс_РаботаСКоллекциями;

	УдаляемыеКолонки = РК.ПересечениеМассивов(РК.ПолучитьКолонкиКоллекции(ТаблицаТоваров), НеИспользуемыеТоварныеПоля());
	
	Если УдаляемыеКолонки.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого УдаляемаяКолонка Из УдаляемыеКолонки Цикл
		ТаблицаТоваров.Колонки.Удалить(УдаляемаяКолонка);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьТаблицуПланПоПринятым(Правило, Распоряжение) Экспорт

	Если Правило.РазмещатьКонтейнерыБезПересчета Тогда
		ТаблицаПринятыхТоваров = ПолучитьТаблицуПланПоПринятымКонтейнерам(Правило, Распоряжение);  // ТУ_Сетраков 27.10.2025 ++
	Иначе 
		ТаблицаПринятыхТоваров = ПолучитьТаблицуПланПоПринятымТоварам(Правило, Распоряжение);
		ЗаполнитьПризнакПересчетКонтейнераРодителя(ТаблицаПринятыхТоваров);
	КонецЕсли;
	
	Возврат ТаблицаПринятыхТоваров;
	
КонецФункции

Функция ПолучитьТаблицуПланПоПринятымТоварам(Правило, Распоряжение)
	
	Параметры = Новый Структура;
	Параметры.Вставить("ДокументОснование", Распоряжение);
	Параметры.Вставить("ВидОперации", Правило.ПредыдущиеОперации.ВыгрузитьКолонку("ПредыдущаяОперация"));
	
	ТаблицаПлан = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру(Параметры);
	ТаблицаПлан.Колонки.Добавить("ИдентификаторЗадания", Метаданные.Документы.вмс_ЗаданиеКладовщику.Реквизиты.Идентификатор.Тип);
	Для Каждого ЭлементТаблицыПлан Из ТаблицаПлан Цикл
		ЭлементТаблицыПлан.ИдентификаторЗадания = ЭлементТаблицыПлан.ЯчейкаПриемник;   
		// ТУ_Прошин_14.11.25+  
		// Если на приемке был КонтейнерПриемник в плане на размещение необходимо указать контейнер
		Если ЗначениеЗаполнено(ЭлементТаблицыПлан.КонтейнерПриемник) Тогда
			ЭлементТаблицыПлан.Контейнер = ЭлементТаблицыПлан.КонтейнерПриемник;
		КонецЕсли;
		// ТУ_Прошин_14.11.25-
	КонецЦикла;
	
	Возврат ТаблицаПлан;
	
КонецФункции

Функция ПолучитьТаблицуШапокЗаданийПоРаспоряжению(Правило, Распоряжение, ТаблицаПланПоРаспоряжению=Неопределено) Экспорт
	
	Если ТипЗнч(ТаблицаПланПоРаспоряжению)=Тип("ТаблицаЗначений") Тогда
		вмс_РаботаСКоллекциями.ТипизироватьТаблицуЗначений(ТаблицаПланПоРаспоряжению);
	КонецЕсли;
	
	ПараметрыСКД = Новый Структура("ТаблицаПлан", ТаблицаПланПоРаспоряжению);
	ТаблицаШапок = ПолучитьТаблицуДанныхСКДПоПравилу(Правило, "Шапки", Распоряжение, ПараметрыСКД);
	
	Если НЕ (ТипЗнч(ТаблицаШапок)=Тип("ТаблицаЗначений") И ТаблицаШапок.Количество() > 0) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//Если ТаблицаШапок.Колонки.Найти("Операция")=Неопределено Тогда
	//	ОбщегоНазначения.СообщитьПользователю("Не указано поле ""Операция""!");
	//	Возврат Неопределено;
	//КонецЕсли;
	
	КолонкаСсылка = ТаблицаШапок.Колонки.Найти("Ссылка");
	Если ТаблицаШапок.Колонки.Найти("Распоряжение")=Неопределено Тогда
		Если КолонкаСсылка <> Неопределено Тогда
			МассивРаспоряжений = ТаблицаШапок.ВыгрузитьКолонку("Ссылка");
			ТаблицаШапок.Колонки.Добавить("Распоряжение");
			ТаблицаШапок.ЗагрузитьКолонку(МассивРаспоряжений, "Распоряжение");
		КонецЕсли;
	КонецЕсли;
	
	Если КолонкаСсылка <> Неопределено Тогда
		ТаблицаШапок.Колонки.Удалить("Ссылка");
	КонецЕсли;
	
	Если ТаблицаШапок.Колонки.Найти("Распоряжение")=Неопределено Тогда
		ТаблицаШапок.Колонки.Добавить("Распоряжение");
		ТаблицаШапок.ЗаполнитьЗначения(Распоряжение, "Распоряжение");
	КонецЕсли;
	
	Если ТаблицаШапок.Колонки.Найти("ИдентификаторЗадания")=Неопределено Тогда
		
		ТаблицаШапок.Колонки.Добавить("ИдентификаторЗадания");
		Если ТаблицаПланПоРаспоряжению <> Неопределено Тогда
			// возьмем идентификаторы из таблицы товаров
			ТаблицаИдентификаторыЗаданий = ТаблицаПланПоРаспоряжению.Скопировать();
			ТаблицаИдентификаторыЗаданий.Свернуть("ИдентификаторЗадания");
			ИдентификаторыЗаданий = ТаблицаИдентификаторыЗаданий.ВыгрузитьКолонку("ИдентификаторЗадания");
			
			КоличествоШапок = ТаблицаШапок.Количество();
			ПервыйИдентификатор = Истина;
			Для Каждого ИдентификаторЗадания Из ИдентификаторыЗаданий Цикл
				Если ПервыйИдентификатор Тогда
					Для НомерШапки=1 По КоличествоШапок Цикл
						ТаблицаШапок[НомерШапки-1].ИдентификаторЗадания = ИдентификаторЗадания;
					КонецЦикла;
					ПервыйИдентификатор = Ложь;
				Иначе
					// скопируем шапки для следующих идентификаторов
					Для НомерШапки=1 По КоличествоШапок Цикл
						СтрокаШапки = ТаблицаШапок.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаШапки, ТаблицаШапок[НомерШапки-1]);
						СтрокаШапки.ИдентификаторЗадания = ИдентификаторЗадания;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаШапок;
	
КонецФункции

Функция ПолучитьТаблицуПланПоЗаданиямКладовщикам(ИмяТабличнойЧасти, ЗаданияКладовщикам, Операция, ОперацияВозврат)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ЗаданиеКладовщику.Ссылка КАК ЗаданиеКладовщику,
	|	вмс_ЗаданиеКладовщику.Идентификатор КАК ИдентификаторЗадания,
	|	&ВсеПоля КАК ВсеПоля,
	|	ВЫБОР
	|		КОГДА вмс_ЗаданиеКладовщику.Операция В (&ОперацияВозврат)
	|			ТОГДА -вмс_ЗаданиеКладовщикуТабличнаяЧасть.Количество
	|		КОГДА вмс_ЗаданиеКладовщику.Операция В (&Операция)
	|			ТОГДА вмс_ЗаданиеКладовщикуТабличнаяЧасть.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.вмс_ЗаданиеКладовщику КАК вмс_ЗаданиеКладовщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вмс_ЗаданиеКладовщику.Товары КАК вмс_ЗаданиеКладовщикуТабличнаяЧасть
	|		ПО вмс_ЗаданиеКладовщику.Ссылка = вмс_ЗаданиеКладовщикуТабличнаяЧасть.Ссылка
	|ГДЕ
	|	вмс_ЗаданиеКладовщику.Ссылка В(&ЗаданияКладовщикам)
	|	И вмс_ЗаданиеКладовщику.Проведен
	|	И вмс_ЗаданиеКладовщику.Операция В (&Операция, &ОперацияВозврат)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.вмс_ЗаданиеКладовщику.Товары", "Документ.вмс_ЗаданиеКладовщику." + ИмяТабличнойЧасти);

	Разделитель = "," + Символы.ПС + Символы.Таб;
	ВсеПоля = "";
	МетаданныеТабличнойЧасти = Метаданные.Документы.вмс_ЗаданиеКладовщику.ТабличныеЧасти[ИмяТабличнойЧасти];
	Для Каждого Реквизит Из МетаданныеТабличнойЧасти.Реквизиты Цикл
		Если Реквизит.Имя <> "Количество" Тогда
			ВсеПоля = ВсеПоля + Разделитель + "вмс_ЗаданиеКладовщикуТабличнаяЧасть." + Реквизит.Имя;
		КонецЕсли;
	КонецЦикла;
	
	ВсеПоля = Прав(ВсеПоля, СтрДлина(ВсеПоля)-СтрДлина(Разделитель));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВсеПоля КАК ВсеПоля", ВсеПоля);
	
		
	Запрос.УстановитьПараметр("ЗаданияКладовщикам", ЗаданияКладовщикам);
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("ОперацияВозврат", ОперацияВозврат);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуФактПоЗаданиямКладовщику(ИмяТабличнойЧасти, ЗаданияКладовщикам, Операция, ОперацияВозврат)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ЗаданиеКладовщику.Ссылка КАК ЗаданиеКладовщику,
	|	вмс_ЗаданиеКладовщику.Идентификатор КАК ИдентификаторЗадания,
	|	&ВсеПоля КАК ВсеПоля,
	|	ВЫБОР
	|		КОГДА вмс_ОперацияПоЯчейкам.ВидОперации В (&ОперацияВозврат)
	|			ТОГДА -вмс_ОперацияПоЯчейкамТабличнаяЧасть.Количество
	|		КОГДА вмс_ОперацияПоЯчейкам.ВидОперации В (&Операция)
	|			ТОГДА вмс_ОперацияПоЯчейкамТабличнаяЧасть.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.вмс_ЗаданиеКладовщику КАК вмс_ЗаданиеКладовщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вмс_ОперацияПоЯчейкам КАК вмс_ОперацияПоЯчейкам
	|		ПО вмс_ЗаданиеКладовщику.Ссылка = вмс_ОперацияПоЯчейкам.ЗаданиеКладовщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вмс_ОперацияПоЯчейкам.Товары КАК вмс_ОперацияПоЯчейкамТабличнаяЧасть
	|		ПО (вмс_ОперацияПоЯчейкам.Ссылка = вмс_ОперацияПоЯчейкамТабличнаяЧасть.Ссылка)
	|ГДЕ
	|	вмс_ЗаданиеКладовщику.Ссылка В(&ЗаданияКладовщикам)
	|	И вмс_ОперацияПоЯчейкам.Проведен
	|	И вмс_ОперацияПоЯчейкам.ВидОперации В (&Операция, &ОперацияВозврат)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.вмс_ОперацияПоЯчейкам.Товары", "Документ.вмс_ОперацияПоЯчейкам." + ИмяТабличнойЧасти);

	Разделитель = "," + Символы.ПС + Символы.Таб;
	ВсеПоля = "";
	МетаданныеТабличнойЧасти = Метаданные.Документы.вмс_ОперацияПоЯчейкам.ТабличныеЧасти[ИмяТабличнойЧасти];
	Для Каждого Реквизит Из МетаданныеТабличнойЧасти.Реквизиты Цикл
		ИмяРеквизита = Реквизит.Имя;
		Если ИмяРеквизита <> "Количество" Тогда
			ВсеПоля = ВсеПоля + Разделитель + "вмс_ОперацияПоЯчейкамТабличнаяЧасть." + ИмяРеквизита + " КАК " + ИмяРеквизита;
			Если ИмяРеквизита="Товар" Тогда
				ВсеПоля = ВсеПоля + Разделитель + "вмс_ОперацияПоЯчейкамТабличнаяЧасть.Товар КАК Номенклатура";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВсеПоля = Прав(ВсеПоля, СтрДлина(ВсеПоля)-СтрДлина(Разделитель));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВсеПоля КАК ВсеПоля", ВсеПоля);

	Запрос.УстановитьПараметр("ЗаданияКладовщикам", ЗаданияКладовщикам);
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("ОперацияВозврат", ОперацияВозврат);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуЗаданийКладовщикам(Правило, Распоряжение, Операция, ОперацияВозврат)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ЭтапыОперации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаЭтаповЗавершения
	|ИЗ
	|	Справочник.вмс_ЭтапыОперации КАК вмс_ЭтапыОперации
	|ГДЕ
	|	вмс_ЭтапыОперации.Имя = ""Завершена""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_Операции.Ссылка КАК Ссылка,
	|	вмс_ОперацииЭтапыОперации.Статус КАК СтатусЗавершения
	|ПОМЕСТИТЬ ТаблицаОпераций
	|ИЗ
	|	Справочник.вмс_Операции КАК вмс_Операции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вмс_Операции.ЭтапыОперации КАК вмс_ОперацииЭтапыОперации
	|		ПО вмс_Операции.Ссылка = вмс_ОперацииЭтапыОперации.Ссылка
	|			И (вмс_ОперацииЭтапыОперации.Этап В
	|				(ВЫБРАТЬ
	|					ТаблицаЭтаповЗавершения.Ссылка
	|				ИЗ
	|					ТаблицаЭтаповЗавершения))
	|ГДЕ
	|	вмс_Операции.Ссылка В (&Операция, &ОперацияВозврат)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ЗаданиеКладовщику.Ссылка КАК ЗаданиеКладовщику,
	|	вмс_ЗаданиеКладовщику.Распоряжение КАК Распоряжение,
	|	вмс_ЗаданиеКладовщику.Операция КАК Операция,
	|	вмс_ЗаданиеКладовщику.Идентификатор КАК ИдентификаторЗадания,
	|	вмс_ЗаданиеКладовщику.Проведен КАК Проведен,
	|	вмс_ЗаданиеКладовщику.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, 0) = ЕСТЬNULL(ТаблицаОпераций.СтатусЗавершения, 0)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Активно,
	|	вмс_ЗаданиеКладовщику.Авто КАК Авто
	|ИЗ
	|	Документ.вмс_ЗаданиеКладовщику КАК вмс_ЗаданиеКладовщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО вмс_ЗаданиеКладовщику.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОпераций КАК ТаблицаОпераций
	|		ПО вмс_ЗаданиеКладовщику.Операция = ТаблицаОпераций.Ссылка
	|ГДЕ
	|	вмс_ЗаданиеКладовщику.Распоряжение = &Распоряжение
	|	И вмс_ЗаданиеКладовщику.Операция В
	|			(ВЫБРАТЬ
	|				ТаблицаОпераций.Ссылка
	|			ИЗ
	|				ТаблицаОпераций)
	|	И НЕ вмс_ЗаданиеКладовщику.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("ОперацияВозврат", ОперацияВозврат);
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	
	ТаблицаЗаданийКладовщикам = Запрос.Выполнить().Выгрузить();
	ТаблицаЗаданийКладовщикам.Колонки.Добавить("ЗаданиеКладовщикуОбъект");
	ТаблицаЗаданийКладовщикам.Колонки.Добавить("Модифицирован");
	
	Для Каждого СтрокаЗадания Из ТаблицаЗаданийКладовщикам Цикл
		СтрокаЗадания.ЗаданиеКладовщикуОбъект = СтрокаЗадания.ЗаданиеКладовщику.ПолучитьОбъект();
		СтрокаЗадания.Модифицирован = Ложь;
	КонецЦикла;
	
	Возврат ТаблицаЗаданийКладовщикам;
	
КонецФункции

Функция НеИспользуемыеТоварныеПоля()
	
	РК = вмс_РаботаСКоллекциями;
	
	НеИспользуемыеТоварныеПоля = РК.ВычитаниеМассивов(ТоварныеПоля(), ИспользуемыеТоварныеПоля());
	
	Возврат НеИспользуемыеТоварныеПоля;
	
КонецФункции

Функция ИспользуемыеТоварныеПоля()
	
	РК = вмс_РаботаСКоллекциями;
	
	ИспользуемыеТоварныеПоляМассив = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля();
	
	// использование упаковок определяем по этой инструкции
	РК.ВычестьМассив(ИспользуемыеТоварныеПоляМассив, "Упаковка");
	Если Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("Упаковки_ВестиУчетОстатковПоУпаковкам")=Истина Тогда
		ИспользуемыеТоварныеПоляМассив.Добавить("Упаковка");
	КонецЕсли;

	ЛокальныеИспользуемыеТоварныеПоляМассив = Новый Массив;
	Для Каждого ТоварноеПоле Из ИспользуемыеТоварныеПоляМассив Цикл
		Если ТоварноеПоле="Товар" Тогда
			ТоварноеПоле = "Номенклатура";
		КонецЕсли;
		ЛокальныеИспользуемыеТоварныеПоляМассив.Добавить(ТоварноеПоле);
	КонецЦикла;
	
	Возврат ЛокальныеИспользуемыеТоварныеПоляМассив;
	
КонецФункции

Функция ТоварныеПоля()
	
	РК = вмс_РаботаСКоллекциями;
	
	ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамКлиентСерверПовтИсп.ТоварныеПоля();
	
	ЛокальныеТоварныеПоляМассив = Новый Массив;
	Для Каждого ТоварноеПоле Из ТоварныеПоляМассив Цикл
		Если ТоварноеПоле="Товар" Тогда
			ТоварноеПоле = "Номенклатура";
		КонецЕсли;
		ЛокальныеТоварныеПоляМассив.Добавить(ТоварноеПоле);
	КонецЦикла;
	
	Возврат ЛокальныеТоварныеПоляМассив;
	
КонецФункции

Функция ПолучитьРаспоряженияДляФормированияЗадачиПоПравилу(Правило, Регистратор) Экспорт
	
	ТаблицаДанных = ПолучитьТаблицуДанныхСКДПоПравилу(Правило, "Основания", Регистратор);
	
	Если НЕ (ТипЗнч(ТаблицаДанных)=Тип("ТаблицаЗначений") И ТаблицаДанных.Колонки.Найти("Ссылка") <> Неопределено) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Распоряжения = ТаблицаДанных.ВыгрузитьКолонку("Ссылка");
	
	Возврат Распоряжения;
	
КонецФункции

Функция ПолучитьТаблицуДанныхСКДПоПравилу(Правило, ИмяДанных, Регистратор, ПараметрыСКД=Неопределено)
	
	Возврат ПолучитьРезультатДанныхСКДПоПравилу(Правило, ИмяДанных, Регистратор, ПараметрыСКД).Данные;	
	
КонецФункции

Функция ПолучитьРезультатДанныхСКДПоПравилу(Правило, ИмяДанных, Регистратор, ПараметрыСКД=Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("Данные");
	Результат.Вставить("Ресурсы");

	//3.2.5 - Переход на отдельное хранилище данных
	//ДанныеСКД = Правило.ДанныеСКД.Получить();
	
	ДанныеСКД = Справочники.вмс_ИсточникиДанных.ИсточникДанных("ХранилищеДанныеСКД", Правило.Ссылка);
	
	СКД = Неопределено;
	Если НЕ (ТипЗнч(ДанныеСКД)=Тип("Структура") И ДанныеСКД.Свойство(ИмяДанных, СКД) И ТипЗнч(СКД)=Тип("СхемаКомпоновкиДанных") И СКД.НаборыДанных.Количество() > 0) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыСКД)=Тип("Структура") Тогда
		// установим параметры компоновки данных
		Для Каждого вхПараметрСКД Из ПараметрыСКД Цикл
			ПараметрСКД = СКД.Параметры.Найти(вхПараметрСКД.Ключ);
			Если ПараметрСКД <> Неопределено Тогда
				Типы = Новый Массив;
				Типы.Добавить(ТипЗнч(вхПараметрСКД.Значение));
				ПараметрСКД.ТипЗначения = Новый ОписаниеТипов(Типы);
				ПараметрСКД.Значение = вхПараметрСКД.Значение;
				ПараметрСКД.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	НастройкиСКД = СКД.НастройкиПоУмолчанию;
	Если НастройкиСКД.Выбор.Элементы.Количество()=0 Тогда
		РаботаССКД.УстановитьВсеВыбраннныеПоля(СКД, НастройкиСКД);
	КонецЕсли;
	
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("ВертикальноеРасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
	
	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Источник);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиСКД);
	КомпоновщикНастроек.Восстановить();
	
	НастройкиСКД = КомпоновщикНастроек.ПолучитьНастройки();
	
	Если НастройкиСКД.Структура.Количество()=0 Тогда
		// добавим группировку полей настройки скд по умолчанию
		ГруппировкаНастройки = НастройкиСКД.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ДоступныеПоляПолейГруппировок = Новый Массив;
		ДоступныеПоляПолейГруппировок.Добавить(ГруппировкаНастройки.ПоляГруппировки.ДоступныеПоляПолейГруппировок);

		Для Каждого ДоступноеПолеГруппировки Из ДоступныеПоляПолейГруппировок Цикл
			Если ТипЗнч(ДоступноеПолеГруппировки)=Тип("ДоступноеПолеКомпоновкиДанных") И ДоступноеПолеГруппировки.Папка ИЛИ ТипЗнч(ДоступноеПолеГруппировки)=Тип("ДоступныеПоляКомпоновкиДанных") Тогда
				Для Каждого Элемент Из ДоступноеПолеГруппировки.Элементы Цикл
					ДоступныеПоляПолейГруппировок.Добавить(Элемент);
				КонецЦикла;
			ИначеЕсли НЕ ДоступноеПолеГруппировки.Ресурс Тогда
				ПолеГруппировки = ГруппировкаНастройки.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				ПолеГруппировки.Поле = ДоступноеПолеГруппировки.Поле;
			КонецЕсли;
		КонецЦикла;
		ГруппировкаНастройки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ГруппировкаНастройки.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	КонецЕсли;
	
	Если Правило.РежимФормированияЗаданий=2 Тогда
		// без распоряжения
		// разрешить без отбора
	Иначе
		ДоступныеПоляОтбора = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора;
		Если ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Регистратор")) <> Неопределено Тогда
			ПолеРегистратор = "Регистратор";
		ИначеЕсли ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Ссылка")) <> Неопределено Тогда
			ПолеРегистратор = "Ссылка";
		ИначеЕсли ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Распоряжение")) <> Неопределено Тогда
			ПолеРегистратор = "Распоряжение";
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не указана ссылка распоряжения!");
			Возврат Результат;
		КонецЕсли;
		РаботаССКД.ДобавитьОтбор(НастройкиСКД.Отбор.Элементы, ПолеРегистратор, Регистратор, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	Попытка
		ТаблицаДанных = РаботаССКД.ПолучитьДанныеСКД(СКД, НастройкиСКД);
	Исключение
		ТаблицаДанных = Неопределено;
		Контекст = СтрШаблон("Правило %1; Регистратор %2; ИмяДанных %3", Правило, СтрСоединить(вмс_РаботаСКоллекциями.ЗначениеВМассив(Регистратор, " ,")), ИмяДанных);
		вмс_Журналирование.Ошибка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), Контекст);
		ВызватьИсключение "Ошибка при формировании документа Задание Кладовщику. Подробнее см. в Журнал Событий";
	КонецПопытки;
	
	Если ТаблицаДанных <> Неопределено Тогда
		Ресурсы = Новый Массив;
		Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл
			ИмяПоля = Колонка.Имя;
			ДоступноеПолеКомпоновки = НастройкиСКД.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ИмяПоля));
			Если ДоступноеПолеКомпоновки <> Неопределено И ДоступноеПолеКомпоновки.Ресурс Тогда
				Ресурсы.Добавить(ИмяПоля);
			КонецЕсли;
		КонецЦикла;
		
		Результат.Данные = ТаблицаДанных;
		Результат.Ресурсы = Ресурсы;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОтложеноеЗаполнениеЗаданияКладовщику(ЗаданиеКладовщику) Экспорт
	
	ДокументОбъект = ЗаданиеКладовщику.ПолучитьОбъект();
	ДокументОбъект.ДополнительныеСвойства.Вставить("ОтложенноеЗаполнение", Истина);
	ДокументОбъект.Записать();
	
КонецФункции

Функция ПолучитьТаблицуПланПоПринятымКонтейнерам(Правило, Распоряжение)
	
	РК = вмс_РаботаСКоллекциями;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ДокументОснование", Распоряжение);
	Параметры.Вставить("ВидОперации", Правило.ПредыдущиеОперации.ВыгрузитьКолонку("ПредыдущаяОперация"));
	
	ТаблицаПланПредварительная = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру(Параметры);   
	КолонкиТаблицыПлана = РК.ПолучитьКолонкиКоллекции(ТаблицаПланПредварительная);
	ТаблицаПлан = РК.НоваяТаблицаЗначений(КолонкиТаблицыПлана);
	
	ПустойКонтейнер = Справочники.вмс_Контейнеры.ПустаяСсылка();
	ОтборТовараБезКонтейнера = Новый Структура("Контейнер, КонтейнерПриемник", ПустойКонтейнер, ПустойКонтейнер);
	ТоварыБезКонтейнера = ТаблицаПланПредварительная.НайтиСтроки(ОтборТовараБезКонтейнера); 
	РК.ДобавитьЭлементыКоллекции(ТаблицаПлан, ТоварыБезКонтейнера); 
	РК.УдалитьЭлементыКоллекции(ТаблицаПланПредварительная, ТоварыБезКонтейнера);  	
	ТаблицаПланПредварительная.Свернуть("ЯчейкаПриемник, Контейнер, КонтейнерПриемник", "Количество"); 
	
	Для Каждого Строка Из ТаблицаПланПредварительная Цикл
		Если ЗначениеЗаполнено(Строка.КонтейнерПриемник) Тогда  
			КонтейнерРодитель = вмс_ПартионныйУчетСервер.ПолучитьКонтейнерРодитель(Строка.КонтейнерПриемник);
			
			Если ЗначениеЗаполнено(КонтейнерРодитель) Тогда   
				СтрокаКонтейнер = КонтейнерРодитель;
			Иначе	
				Строка.Контейнер = Строка.КонтейнерПриемник;    
			КонецЕсли;
		Иначе  
			КонтейнерРодитель = вмс_ПартионныйУчетСервер.ПолучитьКонтейнерРодитель(Строка.Контейнер);
			Если ЗначениеЗаполнено(КонтейнерРодитель) Тогда   
				Строка.Контейнер = КонтейнерРодитель;
			Иначе	
				Строка.Контейнер = Строка.Контейнер;  
			КонецЕсли;
		КонецЕсли;
		Строка.Количество = 1; 
	КонецЦикла;          
     
	РК.ДобавитьЭлементыКоллекции(ТаблицаПлан, ТаблицаПланПредварительная);

	ТаблицаПлан.Колонки.Добавить("ИдентификаторЗадания", Метаданные.Документы.вмс_ЗаданиеКладовщику.Реквизиты.Идентификатор.Тип);
	Для Каждого ЭлементТаблицыПлан Из ТаблицаПлан Цикл
		ЭлементТаблицыПлан.ИдентификаторЗадания = ЭлементТаблицыПлан.ЯчейкаПриемник;   
	КонецЦикла;
	
	ИспользуемыеКолонки = ИспользуемыеТоварныеПоля();
	РК.ДобавитьЭлементыКоллекции(ИспользуемыеКолонки, "Товар, Контейнер, ИдентификаторЗадания, Количество");
	УдаляемыеКолонки = РК.ВычитаниеМассивов(РК.ПолучитьКолонкиКоллекции(ТаблицаПлан), ИспользуемыеКолонки);
	Если УдаляемыеКолонки.Количество() > 0 Тогда
		Для Каждого УдаляемаяКолонка Из УдаляемыеКолонки Цикл
			ТаблицаПлан.Колонки.Удалить(УдаляемаяКолонка);
		КонецЦикла;
		РК.СвернутьКоллекциюЗначений(ТаблицаПлан, , "Количество");
	КонецЕсли;
	
	Возврат ТаблицаПлан;
		
КонецФункции

Функция СформироватьЗаданияПоРаспоряжению(Регистратор, знач Кэш=Неопределено) Экспорт
	
	// Метод для создания первичных заданий по правилам. Вторичные создаются из модуля ЗавершитьОперациюПоДокументу().
	
	Если ТипЗнч(Кэш) <> Тип("Структура") Тогда
		Кэш = Новый Структура;
	КонецЕсли;
	
	Правила = Неопределено;
	Кэш.Свойство("ПравилаЗаполненияЗаданийКладовщикам", Правила);
	
	Если Правила=Неопределено Тогда
		Правила = ПолучитьПравилаЗаполненияЗаданийКладовщикамПоРаспоряжению();
		Кэш.Вставить("ПравилаЗаполненияЗаданийКладовщикам", Правила);
	КонецЕсли;
	
	СформироватьЗаданияПоПравилам(Правила, Регистратор);
	
КонецФункции

Функция СформироватьЗаданияБезРаспоряжения() Экспорт

	Правила = ПолучитьПравилаЗаполненияЗаданийКладовщикамБезРаспоряжения();
	
	НомерСообщения = ПолучитьСообщенияПользователю().Количество();
	
	Попытка
		СформироватьЗаданияПоПравилам(Правила);
		ИнформацияОбОшибке = Неопределено;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
	
	Если ИнформацияОбОшибке <> Неопределено Тогда
		
		СообщенияПользователю = ПолучитьСообщенияПользователю();
		Сообщения = "";
		Пока НомерСообщения < СообщенияПользователю.Количество() Цикл
			СообщениеПользователю = СообщенияПользователю[НомерСообщения];
			Сообщения = Сообщения + СообщениеПользователю.Текст + Символы.ПС;
			НомерСообщения = НомерСообщения + 1;
		КонецЦикла;
		Сообщения = СокрП(Сообщения);
		
		вмс_Журналирование.Ошибка(Сообщения);
	КонецЕсли;
			
КонецФункции

Функция СформироватьЗаданияПоПравилам(Правила, Регистратор=Неопределено) Экспорт

	Для Каждого Правило Из Правила Цикл
		
		Попытка
			
			СформироватьЗаданияПоПравилу(Правило, Регистратор);
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ТекстОшибки = "Ошибка при формировании заданий кладовщику по правилу """ + Правило + """:" + Символы.ПС;
			ТекстОшибки = ТекстОшибки + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецФункции

Функция ЗарегистрироватьНаОбновлениеЗаданияКладовщиковПоПравилуЗаполнения(Правило, Распоряжение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.Дата КАК Дата,
	|	вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.Правило КАК Правило,
	|	вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.Распоряжение КАК Распоряжение
	|ИЗ
	|	РегистрСведений.вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения КАК вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения
	|ГДЕ
	|	НЕ вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.Ошибка
	|	И вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.Правило = &Правило
	|	И вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.Распоряжение = &Распоряжение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("Правило", Правило);
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.СоздатьМенеджерЗаписи();
			Запись.Заполнить(Неопределено);
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Удалить();
		КонецЦикла;
	КонецЕсли;

	Запись = РегистрыСведений.вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.СоздатьМенеджерЗаписи();
	Запись.Заполнить(Неопределено);
	Запись.Дата = ТекущаяДата();
	Запись.Правило = Правило;
	Запись.Распоряжение = Распоряжение;
	Запись.Записать();
	
	Возврат Истина;
	
КонецФункции

Функция ОбновлениеЗаданийКладовщикуПоПравиламЗаполнения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.Дата КАК Дата,
	|	вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.Правило КАК Правило,
	|	вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.Распоряжение КАК Распоряжение
	|ИЗ
	|	РегистрСведений.вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения КАК вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения
	|ГДЕ
	|	НЕ вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.Ошибка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Пока Истина Цикл
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НомерСообщения = ПолучитьСообщенияПользователю().Количество();

			Правило = Выборка.Правило;
			
			Запись = РегистрыСведений.вмс_ОбновитьЗаданияКладовщиковПоПравиламЗаполнения.СоздатьМенеджерЗаписи();
			Запись.Заполнить(Неопределено);
			ЗаполнитьЗначенияСвойств(Запись, Выборка);

			Попытка
				СформироватьЗаданияПоПравилу(Правило, , Выборка.Распоряжение);
				ИнформацияОбОшибке = Неопределено;
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				
				ТекстОшибки = "Ошибка при формировании заданий кладовщику по правилу """ + Правило + """:" + Символы.ПС;
				ТекстОшибки = ТекстОшибки + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);

				СообщенияПользователю = ПолучитьСообщенияПользователю();
				Сообщения = "";
				Пока НомерСообщения < СообщенияПользователю.Количество() Цикл
					СообщениеПользователю = СообщенияПользователю[НомерСообщения];
					Сообщения = Сообщения + СообщениеПользователю.Текст + Символы.ПС;
					НомерСообщения = НомерСообщения + 1;
				КонецЦикла;
				Сообщения = СокрП(Сообщения);
			КонецПопытки;
			
			Если ИнформацияОбОшибке=Неопределено Тогда
				Запись.Удалить();
			Иначе
				Запись.Ошибка = Истина;
				Запись.ИнформацияОбОшибке = ТекстОшибки;
				Запись.Сообщения = Сообщения;
				Запись.Записать();
			КонецЕсли;

		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьЗаданияКладовщикамПоРаспоряжению(Правило, Распоряжение) Экспорт
	
	Если Правило.ЗаполнятьПлан Тогда
		ПланЗаполненияТабличныхЧастейПоРаспоряжению = ПолучитьПланЗаполненияТабличныхЧастейПоРаспоряжению(Правило, Распоряжение);
		Если ПланЗаполненияТабличныхЧастейПоРаспоряжению.Количество()=0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если ПланЗаполненияТабличныхЧастейПоРаспоряжению.Свойство("Товары") Тогда
			ТаблицаПланТоваровПоРаспоряжению = ПланЗаполненияТабличныхЧастейПоРаспоряжению.Товары.Данные;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаШапок = ПолучитьТаблицуШапокЗаданийПоРаспоряжению(Правило, Распоряжение, ТаблицаПланТоваровПоРаспоряжению);
	Если ТаблицаШапок=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОперацияВозврат = Правило.ОперацияВозврат;
	Операция = Правило.ОперацияНазначение;

	ТаблицаЗаданийКладовщикам = ПолучитьТаблицуЗаданийКладовщикам(Правило, Распоряжение, Операция, ОперацияВозврат);
	ЗаполнитьШапкиЗаданий(ТаблицаШапок, ТаблицаЗаданийКладовщикам, Правило);
	
	Если Правило.ЗаполнятьПлан Тогда
		ЗаполнитьПланЗаданий(Правило, ТаблицаШапок, ПланЗаполненияТабличныхЧастейПоРаспоряжению, ТаблицаЗаданийКладовщикам);
	КонецЕсли;
	
	Если Правило.Товары_Переопределяемые Тогда
		Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.Переопределяемый_ЗаполнитьТоварыЗадания(Правило, ТаблицаШапок, ТаблицаПланТоваровПоРаспоряжению, ТаблицаЗаданийКладовщикам);
	КонецЕсли;
	
	Возврат ТаблицаЗаданийКладовщикам;
	
КонецФункции

Функция ПолучитьПравилаЗаполненияЗаданийКладовщикамПоРаспоряжению()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ВсеПоля КАК ВсеПоля
	|ИЗ
	|	Справочник.вмс_ПравилаЗаполненияЗадачиКладовщику КАК вмс_ПравилаЗаполненияЗадачиКладовщику
	|ГДЕ
	|	НЕ вмс_ПравилаЗаполненияЗадачиКладовщику.ПометкаУдаления
	|	И НЕ вмс_ПравилаЗаполненияЗадачиКладовщику.ЭтоГруппа
	|	И вмс_ПравилаЗаполненияЗадачиКладовщику.РежимФормированияЗаданий = 0 И вмс_ПравилаЗаполненияЗадачиКладовщику.Активно
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВсеПоля КАК ВсеПоля", "*");
	
	РезультатЗапроса = Запрос.Выполнить();
	Правила = РезультатЗапроса.Выгрузить();
	Возврат Правила;
	
КонецФункции

Функция ПолучитьПравилаЗаполненияЗаданийКладовщикамБезРаспоряжения()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ВсеПоля КАК ВсеПоля
	|ИЗ
	|	Справочник.вмс_ПравилаЗаполненияЗадачиКладовщику КАК вмс_ПравилаЗаполненияЗадачиКладовщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_Операции КАК вмс_Операции
	|		ПО вмс_ПравилаЗаполненияЗадачиКладовщику.ОперацияНазначение = вмс_Операции.Ссылка
	|ГДЕ
	|	НЕ вмс_ПравилаЗаполненияЗадачиКладовщику.ПометкаУдаления
	|	И НЕ вмс_ПравилаЗаполненияЗадачиКладовщику.ЭтоГруппа
	|	И вмс_ПравилаЗаполненияЗадачиКладовщику.РежимФормированияЗаданий = 2
	|	И вмс_Операции.ПоРаспоряжению
	//3.2.5 - добавлен фильтр по активным правилам.
	|	И НЕ вмс_Операции.ПометкаУдаления И вмс_ПравилаЗаполненияЗадачиКладовщику.Активно
	|
	|УПОРЯДОЧИТЬ ПО
	|	вмс_ПравилаЗаполненияЗадачиКладовщику.Приоритет";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВсеПоля КАК ВсеПоля", "*");
	
	РезультатЗапроса = Запрос.Выполнить();
	Правила = РезультатЗапроса.Выгрузить();
	Возврат Правила;
	
КонецФункции

Функция НовоеЗаполнениеТабличнойЧастиЗадания(ИмяТабличнойЧасти, Данные=Неопределено, Ресурсы=Неопределено)
	
	РК = вмс_РаботаСКоллекциями;
	
	ЗаполнениеТабличнойЧастиЗадания = Новый Структура;
	ЗаполнениеТабличнойЧастиЗадания.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ЗаполнениеТабличнойЧастиЗадания.Вставить("Данные", Новый ТаблицаЗначений);
	ЗаполнениеТабличнойЧастиЗадания.Вставить("ПоляДанных", Новый Массив);
	ЗаполнениеТабличнойЧастиЗадания.Вставить("ПоляГруппы", Новый Массив);
	ЗаполнениеТабличнойЧастиЗадания.Вставить("Ресурсы", Новый Массив);
	ЗаполнениеТабличнойЧастиЗадания.Вставить("КолонкаИтога", "Количество");
	
	Если Данные <> Неопределено Тогда
		ПоляДанных = РК.ПолучитьКолонкиКоллекции(Данные);
		РК.ДобавитьЭлементыКоллекции(ЗаполнениеТабличнойЧастиЗадания.ПоляДанных, ПоляДанных);
		РК.ДополнитьКолонкиТаблицыЗначений(ЗаполнениеТабличнойЧастиЗадания.Данные, ЗаполнениеТабличнойЧастиЗадания.ПоляДанных);
		РК.ДобавитьЭлементыКоллекции(ЗаполнениеТабличнойЧастиЗадания.Данные, Данные);
	КонецЕсли;
	
	Если Ресурсы <> Неопределено Тогда
		РК.ДобавитьЭлементыКоллекции(ЗаполнениеТабличнойЧастиЗадания.Ресурсы, Ресурсы);
	КонецЕсли;
	
	РК.ДобавитьЭлементыКоллекции(ЗаполнениеТабличнойЧастиЗадания.ПоляГруппы, ЗаполнениеТабличнойЧастиЗадания.ПоляДанных);
	РК.ВычестьМассив(ЗаполнениеТабличнойЧастиЗадания.ПоляГруппы, ЗаполнениеТабличнойЧастиЗадания.Ресурсы);
	
	// предопределенный ресурс
	РК.ДобавитьЭлементыКоллекции(ЗаполнениеТабличнойЧастиЗадания.Ресурсы, "Количество");
	РК.УдалитьДублиВМассиве(ЗаполнениеТабличнойЧастиЗадания.Ресурсы);
	ЗаполнениеТабличнойЧастиЗадания.Ресурсы = РК.ПересечениеМассивов(ЗаполнениеТабличнойЧастиЗадания.Ресурсы, ЗаполнениеТабличнойЧастиЗадания.ПоляДанных);
	
	Возврат ЗаполнениеТабличнойЧастиЗадания;
	
КонецФункции
