
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// #КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимВыбора") Тогда
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;
	
	Если Параметры.Свойство("Ссылка") Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.Ссылка;
	КонецЕсли;
	
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийФормы

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.РежимВыбора Тогда
		ОповеститьОВыборе(ВыбраннаяСтрока);
	Иначе
		МодульКлиента().ОткрытьФормуРазрешительногоДокумента(ВыбраннаяСтрока, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Копирование Тогда
		МодульКлиента().ОткрытьФормуРазрешительногоДокумента(ТекущиеДанные.Ссылка, ЭтаФорма, Копирование);
	Иначе
		МодульКлиента().ОткрытьФормуРазрешительногоДокумента(Неопределено, ЭтаФорма, Копирование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	МодульКлиента().ОткрытьФормуРазрешительногоДокумента(Элемент.ТекущиеДанные.Ссылка, ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийЭлементовФормы

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОповеститьОВыборе(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиКомандФормы

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидимостьЭлементовФормы()
	
	РежимВыбора = Параметры.РежимВыбора;
	
	Элементы.Кнопка_Выбрать.Видимость = РежимВыбора;
	Элементы.Кнопка_Выбрать.КнопкаПоУмолчанию = РежимВыбора;
	
	Элементы.Кнопка_Создать.КнопкаПоУмолчанию = Не РежимВыбора;
	
КонецПроцедуры

// #КонецОбласти // СлужебныеПроцедурыИФункции
