
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПарольТехническогоСпециалиста) Тогда
		
		ТекстПредупреждения = НСтр("ru='Введите ключ!'");
		МодульКлиента().СообщитьПользователюЛок(ТекстПредупреждения);
		
		Возврат;
		
	КонецЕсли;
	
	Результат = ПроверитьВведенныйПароль(ПарольТехническогоСпециалиста);
	
	Если Результат Тогда
		
		РезультатЗакрытияФормы = Истина;
		
		Закрыть(РезультатЗакрытияФормы);
		
	Иначе
		
		ТекстПредупреждения = НСтр("ru='Неверный ключ!'");
		МодульКлиента().СообщитьПользователюЛок(ТекстПредупреждения);
		
		ПарольТехническогоСпециалиста = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВведенныйПароль(ПарольТехническогоСпециалиста)
	
	Возврат МодульОбъекта().ПроверитьВведенныйПарольТехническогоСпециалиста(ПарольТехническогоСпециалиста);
	
КонецФункции
