Функция ЗагрузитьОбъектыИзXML(ЧтениеXML, Отправитель=Неопределено) Экспорт
	
	МассивОбъектов = глОбщийМодуль("РаботаСXMLКлиентСервер").ПрочитатьXMLУлучшенная(ЧтениеXML);
	
	Возврат ЗаписатьОбъекты(МассивОбъектов, Отправитель, Истина);
	
КонецФункции

// Адаптация: в расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

Функция ЗаписатьОбъекты(МассивОбъектов, Отправитель=Неопределено, ОбменДаннымиЗагрузка=Ложь) Экспорт

	Перем ОбщегоНазначенияСервер;
	
	ОбщегоНазначенияСервер = глОбщийМодуль("ОбщегоНазначенияСервер");

	ОтложенныеДвижения = Новый Массив;
	
	МассивСсылокНаДокументы = Новый Массив;
	ТаблицаОбъектов = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("Данные, МетаДанныеОбъекта, ЭтоДокумент, ПроведениеРазрешено");
	Для Каждого Данные Из МассивОбъектов Цикл
		
		Если Данные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МетаДанныеОбъекта = МетаДанные.НайтиПоТипу(ТипЗнч(Данные));
		ЭтоДокумент = МетаДанныеОбъекта <> Неопределено И МетаДанные.Документы.Содержит(МетаДанныеОбъекта);
		ПроведениеРазрешено = ЭтоДокумент И МетаДанныеОбъекта.Проведение=МетаДанные.СвойстваОбъектов.Проведение.Разрешить;
		
		СтрокаОбъекта = ТаблицаОбъектов.Добавить();
		СтрокаОбъекта.Данные = Данные;
		СтрокаОбъекта.МетаДанныеОбъекта =  МетаДанныеОбъекта;
		СтрокаОбъекта.ЭтоДокумент = ЭтоДокумент;
		СтрокаОбъекта.ПроведениеРазрешено = ПроведениеРазрешено;
		
		Если ЭтоДокумент Тогда
			МассивСсылокНаДокументы.Добавить(Данные.Ссылка);
		КонецЕсли;
		
	КонецЦикла;

	ТаблицаРеквизитовДокументов = ОбщегоНазначенияСервер.ПолучитьРеквизитыОбъектов(МассивСсылокНаДокументы, "Ссылка, Проведен", Новый Структура("ИспользоватьДополнительныеРеквизиты", Ложь));
	
	Для Каждого СтрокаОбъекта Из ТаблицаОбъектов Цикл
		
		Данные = СтрокаОбъекта.Данные;
		
		Если Отправитель <> Неопределено Тогда
			Данные.ОбменДанными.Отправитель = Отправитель;
		КонецЕсли;
		Данные.ОбменДанными.Загрузка = ОбменДаннымиЗагрузка;
		Данные.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		
		Если СтрокаОбъекта.ЭтоДокумент Тогда
			ПроведениеРазрешено = СтрокаОбъекта.ПроведениеРазрешено;
			СтрокиРеквизитовОбъекта = ТаблицаРеквизитовДокументов.НайтиСтроки(Новый Структура("Ссылка", Данные.Ссылка));
			РеквизитыОбъекта = ?(СтрокиРеквизитовОбъекта.Количество() > 0, СтрокиРеквизитовОбъекта[0], Неопределено);
			БылПроведен = ?(ПроведениеРазрешено И РеквизитыОбъекта <> Неопределено, РеквизитыОбъекта.Проведен, Ложь);

			Если Данные.ПометкаУдаления Тогда
				Если БылПроведен Тогда
					Данные.ПометкаУдаления = Ложь;
					Данные.Проведен = Истина;
					Данные.Записать();
					Данные.ОбменДанными.Загрузка = Ложь;
					Данные.УстановитьПометкуУдаления(Истина);
				Иначе
					Данные.Записать();
				КонецЕсли;
			Иначе
				Проведен = ПроведениеРазрешено И Данные.Проведен;
				Если Проведен Тогда
					Данные.Проведен = Ложь;
					Данные.Записать();
					ОтложенныеДвижения.Добавить(Данные);
				ИначеЕсли БылПроведен Тогда
					Данные.Проведен = Истина;
					Данные.Записать();
					Данные.ОбменДанными.Загрузка = Ложь;
					Данные.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Иначе
					Данные.Записать();
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если СтрокаОбъекта.МетаДанныеОбъекта <> Неопределено Тогда
				Если Данные.ЭтоНовый() Тогда
					СсылкаЭлемента = Данные.ПолучитьСсылкуНового();
					Если ЗначениеЗаполнено(СсылкаЭлемента) Тогда
						СтарыйЭлемент = СсылкаЭлемента.ПолучитьОбъект();
						Если СтарыйЭлемент <> Неопределено Тогда
							// заменим старый элемент
							Если Отправитель <> Неопределено Тогда
								СтарыйЭлемент.ОбменДанными.Отправитель = Отправитель;
							КонецЕсли;
							СтарыйЭлемент.ОбменДанными.Загрузка = ОбменДаннымиЗагрузка;
							СтарыйЭлемент.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
							СтарыйЭлемент.Удалить();
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			Данные.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ОтложенноеДвижение Из ОтложенныеДвижения Цикл
		Данные0 = ОтложенноеДвижение;
		Данные = Данные0.Ссылка.ПолучитьОбъект(); // перечитаем объект, не помню зачем, может объект изменился
		
		Для Каждого ДополнительноеСвойство Из Данные0.ДополнительныеСвойства Цикл
			Данные.ДополнительныеСвойства.Вставить(ДополнительноеСвойство.Ключ, ДополнительноеСвойство.Значение);
		КонецЦикла;
		
		Если Отправитель <> Неопределено Тогда
			Данные.ОбменДанными.Отправитель = Отправитель;
		КонецЕсли;
		Данные.ОбменДанными.Получатели.АвтоЗаполнение = Ложь; 
		Если ОбменДаннымиЗагрузка Тогда
			Данные.ДополнительныеСвойства.Вставить("ОбменДанными", Истина);
		КонецЕсли;
		Данные.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецФункции
