// Адаптация: в расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ОбщийМодуль(ИмяМодуля);
КонецФункции

Функция ЗарегистрироватьКласс(ИмяКласса) Экспорт
	
	Класс = НовыйКласс(ИмяКласса);
	
	СведенияОКлассах = СведенияОКлассах();
	СведенияОКлассах.Классы.Вставить(ИмяКласса, Класс);
	СведенияОКлассах.ТекущийКласс = Класс;
	
	Возврат Класс;
	
КонецФункции

Функция НаследоватьКласс(БазовыйКласс) Экспорт

	_БазовыйКласс = ПолучитьКласс(БазовыйКласс);
	
	Для Каждого ЭлементПоля Из _БазовыйКласс.Поля Цикл
		Поле = ЭлементПоля.Значение;
		НовоеПоле = ДобавитьПоле(Поле.Имя);
		ЗаполнитьЗначенияСвойств(НовоеПоле, Поле);
	КонецЦикла;
	
	Для Каждого ЭлементМетода Из _БазовыйКласс.Методы Цикл
		Метод = ЭлементМетода.Значение;
		НовыйМетод = ДобавитьМетод(Метод.ИмяМетода);
		ЗаполнитьЗначенияСвойств(НовыйМетод.ПараметрыКомпиляции, Метод.ПараметрыКомпиляции);
		Для Каждого ЭлементПараметраМетода Из Метод.Параметры Цикл
			ПараметрМетода = ЭлементПараметраМетода.Значение;
			ДобавитьПараметрМетода(ПараметрМетода.ИмяПараметра, ПараметрМетода.ТипПараметра);
		КонецЦикла;
		УстановитьТекстОбработчикаМетода(Метод.ТекстОбработчика);
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

Функция ДобавитьПоле(ИмяПоля, ТипПоля=Неопределено, НаФронтенде=Истина, НаБэкенде=Ложь) Экспорт
	
	Класс = ТекущийКласс();
	Если Класс=Неопределено Тогда
		ВызватьИсключение "Класс объектов не зарегистрирован!";
	КонецЕсли;
	
	Поле = НовоеПоле(ИмяПоля, ТипПоля, НаФронтенде, НаБэкенде);
	Класс.Поля.Вставить(ИмяПоля, Поле);
	
	Возврат Поле;
	
КонецФункции

Функция ДобавитьМетод(ИмяМетода) Экспорт
	
	Метод = НовыйМетод(ИмяМетода);

	СведенияОКлассах = СведенияОКлассах();
	Класс = СведенияОКлассах.ТекущийКласс;
	Класс.Методы.Вставить(ИмяМетода, Метод);
	СведенияОКлассах.ТекущийМетод = Метод;
	
	Возврат Метод;
	
КонецФункции

Функция ДобавитьПараметрМетода(ИмяПараметра, ТипПараметра=Неопределено) Экспорт
	
	Параметр = НовыйПараметрМетода(ИмяПараметра, ТипПараметра);
	
	СведенияОКлассах = СведенияОКлассах();
	Метод = СведенияОКлассах.ТекущийМетод;
	Метод.Параметры.Вставить(ИмяПараметра, Параметр);
	
	Возврат Параметр;
	
КонецФункции

Функция УстановитьТекстОбработчикаМетода(ТекстОбработчика) Экспорт

	СведенияОКлассах = СведенияОКлассах();
	Метод = СведенияОКлассах.ТекущийМетод;
	Метод.ТекстОбработчика = ТекстОбработчика;
	
КонецФункции

Функция ЗакончитьСозданиеКласса() Экспорт
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	СведенияОКлассах = СведенияОКлассах();
	Класс = СведенияОКлассах.ТекущийКласс;
	КомпиляцияНаБэкенде = СведенияОКлассах.ЭтоБэкенд;
	КомпиляцияНаФронтенде = НЕ КомпиляцияНаБэкенде;
	
	ДанныеКомпиляции = Класс.ДанныеКомпиляции;
	
	СинхроПоля = Ложь;
	Для Каждого ЭлементПоле Из Класс.Поля Цикл
		Поле = ЭлементПоле.Значение;
		Если Поле.НаФронтенде И Поле.НаБэкенде Тогда
			СинхроПоля = Истина;
			Класс.ПоляСинхронизации.Вставить(Поле.ИмяПоля, Истина);
		КонецЕсли;
		
		Если Поле.НаФронтенде И КомпиляцияНаФронтенде ИЛИ Поле.НаБэкенде И КомпиляцияНаБэкенде Тогда
			ДанныеКомпиляции.Поля.Вставить(Поле.ИмяПоля, Поле);
		КонецЕсли;
	КонецЦикла;
	
	СинхроМетоды = Ложь;
	Для Каждого ЭлементМетод Из Класс.Методы Цикл
		Метод = ЭлементМетод.Значение;
		ПараметрыКомпиляции = Метод.ПараметрыКомпиляции;
		Если ПараметрыКомпиляции.ВызовБэкенда Тогда
			Класс.ВызовБэкенда = Истина;
			Если Не ПараметрыКомпиляции.БезКонтекста Тогда
				СинхроМетоды = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если КомпиляцияНаБэкенде Тогда
			Если ПараметрыКомпиляции.НаБэкенде Тогда
				СкомпилированныйМетод = РК.СкопироватьОбъект(Метод);
				СкомпилированныйМетод.ПараметрыКомпиляции = ПолучитьПараметрыКомпиляцииДирективы("НаСервере");
				ДанныеКомпиляции.Методы.Вставить(СкомпилированныйМетод.ИмяМетода, СкомпилированныйМетод);
			КонецЕсли;
		Иначе
			Если ПараметрыКомпиляции.НаКлиенте ИЛИ ПараметрыКомпиляции.НаСервере ИЛИ ПараметрыКомпиляции.НаБэкенде Тогда
				СкомпилированныйМетод = РК.СкопироватьОбъект(Метод);
				СкомпилированныйМетод.ПараметрыКомпиляции = РК.СкопироватьОбъект(ПараметрыКомпиляции);
				ДанныеКомпиляции.Методы.Вставить(СкомпилированныйМетод.ИмяМетода, СкомпилированныйМетод);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Класс.СинхронизацияДанных = СинхроПоля И СинхроМетоды;
	
	Скомпилировать(СведенияОКлассах);
	
КонецФункции

Функция ПолучитьТекстМодуля(СведенияОКлассах) Экспорт
	
	Класс = СведенияОКлассах.ТекущийКласс;
	ДанныеКомпиляции = Класс.ДанныеКомпиляции;
	
	Разделитель = ", ";
	ДлинаРазделителя = СтрДлина(Разделитель);
	Если ДанныеКомпиляции.Поля.Количество() > 0 Тогда
		ТекстПолей = "Перем ";
		Для Каждого ЭлементПоля Из ДанныеКомпиляции.Поля Цикл
			Поле = ЭлементПоля.Значение;
			ТекстПолей = ТекстПолей + Поле.ИмяПоля + Разделитель;
		КонецЦикла;
		ТекстПолей = Лев(ТекстПолей, СтрДлина(ТекстПолей)-ДлинаРазделителя);
		ТекстПолей = ТекстПолей + ";";
	Иначе
		ТекстПолей = "";
	КонецЕсли;
	
	ПереводСтроки = Символы.ПС;
	ПропускСтроки = ПереводСтроки + ПереводСтроки;
	
	ТекстМетодов = "";
	Для Каждого ЭлементМетода Из ДанныеКомпиляции.Методы Цикл
		Метод = ЭлементМетода.Значение;
		ПараметрыКомпиляции = Метод.ПараметрыКомпиляции;
		Если Не (ПараметрыКомпиляции.НаКлиенте ИЛИ ПараметрыКомпиляции.НаСервере) Тогда
			Продолжить;
		КонецЕсли;
		
		Директива = ПолучитьДирективуПараметровКомпиляции(ПараметрыКомпиляции);
		Если Директива=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Непосредственно директивы "НаБэкенде" не существует
		// это квази директива, ознащающая директиву "НаСервере", исполняющуюся в учетной базе
		Директива = СтрЗаменить(Директива, "НаБэкенде", "");
		
		ТекстМетодов = ТекстМетодов + ПропускСтроки;
		ТекстМетодов = ТекстМетодов + "&" + Директива + ПереводСтроки + "Функция " + Метод.ИмяМетода + "(";
		Если Метод.Параметры.Количество() > 0 Тогда
			Для Каждого ЭлементПараметраМетода Из Метод.Параметры Цикл
				Параметр = ЭлементПараметраМетода.Значение;
				ТекстМетодов = ТекстМетодов + Параметр.ИмяПараметра + Разделитель;
			КонецЦикла;
			ТекстМетодов = Лев(ТекстМетодов, СтрДлина(ТекстМетодов)-СтрДлина(Разделитель));
		КонецЕсли;
		ТекстМетодов = ТекстМетодов + ")";
		ТекстМетодов = ТекстМетодов + Символы.ПС + Метод.ТекстОбработчика;
		ТекстМетодов = ТекстМетодов + Символы.ПС + "КонецФункции";
	КонецЦикла;
	
	ТекстМодуля = ТекстПолей + ТекстМетодов;
	
	Возврат ТекстМодуля;
	
КонецФункции

Функция Скомпилировать(СведенияОКлассах) Экспорт
	
	СкомпилироватьМодуль(СведенияОКлассах);
	
КонецФункции

Функция СкомпилироватьМодуль(СведенияОКлассах) Экспорт
	
	Класс = СведенияОКлассах.ТекущийКласс;
	
    ТекстМодуля = ПолучитьТекстМодуля(СведенияОКлассах);

	ПроцессорКода = вмс_ВыполнениеПрограммногоКода.НовыйПроцессорКода();

	вмс_ВыполнениеПрограммногоКода.ПроцессорКода_УказатьФункциюДляВызововПодпрограмм(ПроцессорКода, "", "НаКлиенте", , "Параметр1, Параметр2, Параметр3, Параметр4", "Результат");
	вмс_ВыполнениеПрограммногоКода.ПроцессорКода_УказатьФункциюДляВызововПодпрограмм(ПроцессорКода, "", "НаСервере", , "Параметр1, Параметр2, Параметр3, Параметр4", "Результат");
	вмс_ВыполнениеПрограммногоКода.ПроцессорКода_УказатьФункциюДляВызововПодпрограмм(ПроцессорКода, "", "НаСервереБезКонтекста", , "Параметр1, Параметр2, Параметр3, Параметр4", "Результат");
	вмс_ВыполнениеПрограммногоКода.ПроцессорКода_УказатьФункциюДляВызововПодпрограмм(ПроцессорКода, "вмс_ВыполнениеПрограммногоКодаВызовСервера.ВызовПодпрограммыНаСервереБезКонтекста", "НаСервереБезКонтекста", "ДанныеДляРаботыНаСервере_e8a17f9465ac4b1dbd98b4f6427d0162", "Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162, Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162=null, Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162", "Результат_e8a17f9465ac4b1dbd98b4f6427d0162");
	
	вмс_ВыполнениеПрограммногоКода.ПроцессорКода_РазобратьТекст(ПроцессорКода, ТекстМодуля);
	ПоместитьПоля_и_МетодыКласса_в_Контекст(Класс, ПроцессорКода);
	ПреобразоватьКодПодпрограмм(ПроцессорКода);
	вмс_ВыполнениеПрограммногоКода.ПроцессорКода_СформироватьМодуль(ПроцессорКода, "МодульКласса", Истина);

	ДанныеКомпиляции = Класс.ДанныеКомпиляции;
	ДанныеКомпиляции.ДанныеДляВыполненияПодпрограмм = вмс_ВыполнениеПрограммногоКода.ПроцессорКода_ПолучитьДанныеДляВызоваПодпрограмм(ПроцессорКода);
	
	ДанныеКомпиляции.ДанныеДляВыполненияПодпрограммНаСервере = Новый Структура;
	ДанныеКомпиляции.ДанныеДляВыполненияПодпрограммНаСервере.Вставить("КодыПодпрограмм", ДанныеКомпиляции.ДанныеДляВыполненияПодпрограмм.КодыПодпрограммНаСервереБезКонтекста);
	
КонецФункции

Функция ПоместитьПоля_и_МетодыКласса_в_Контекст(Класс, ПроцессорКода)
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ТекстовыйПарсер = ПроцессорКода.ТекстовыйПарсер;

	МассивПеременных = РК.ПолучитьЭлементыКоллекции(ТекстовыйПарсер.ТаблицаПеременных);
	МассивПодпрограмм = РК.ПолучитьЭлементыКоллекции(ТекстовыйПарсер.ТаблицаПодпрограмм);
	
	ДанныеКомпиляции = Класс.ДанныеКомпиляции;
	
	ПолеОбъекта = "ЭтотОбъект";
	ПрефиксОбъекта = ПолеОбъекта + ".";
	
	Директивы = Новый Массив;
	Директивы.Добавить("НаКлиенте");
	Директивы.Добавить("НаСервере");
	Директивы.Добавить("НаСервереБезКонтекста");
	Директивы.Добавить("НаБэкенде");
	
	ЗаменаИдентификаторовПолей = Новый Соответствие;
	ЗаменаИдентификаторовМетодов = Новый Соответствие;
	Для Каждого Директива Из Директивы Цикл
		
		ПараметрыКомпиляцииПодпрограммы = ПолучитьПараметрыКомпиляцииДирективы(Директива);
		
		ЗаменаИдентификаторовПолейПоДирективе = Новый Соответствие;
		Если Не ПараметрыКомпиляцииПодпрограммы.БезКонтекста Тогда
			Для Каждого Переменная Из МассивПеременных Цикл
				ЗаменаИдентификаторовПолейПоДирективе[Переменная.Имя] = ПрефиксОбъекта + Переменная.Имя;
			КонецЦикла;
		КонецЕсли;
		Если ЗаменаИдентификаторовПолейПоДирективе.Количество()>0 Тогда
			ЗаменаИдентификаторовПолей[Директива] = ЗаменаИдентификаторовПолейПоДирективе;
		КонецЕсли;
		
		ЗаменаИдентификаторовМетодовПоДирективе = Новый Соответствие;
		Для Каждого ЭлементМетода Из ДанныеКомпиляции.Методы Цикл
			Метод = ЭлементМетода.Значение;
			ПараметрыКомпиляцииМетода = Метод.ПараметрыКомпиляции;
			Если (ПараметрыКомпиляцииПодпрограммы.НаКлиенте=ПараметрыКомпиляцииМетода.НаКлиенте ИЛИ ПараметрыКомпиляцииПодпрограммы.НаСервере=ПараметрыКомпиляцииМетода.НаСервере) И Не ПараметрыКомпиляцииПодпрограммы.БезКонтекста ИЛИ 
					ПараметрыКомпиляцииПодпрограммы.НаКлиенте И (ПараметрыКомпиляцииМетода.ВызовСервера ИЛИ ПараметрыКомпиляцииМетода.ВызовБэкенда) Тогда
				ЗаменаИдентификаторовМетодовПоДирективе[Метод.ИмяМетода] = ПрефиксОбъекта + Метод.ИмяМетода;
			КонецЕсли;
		КонецЦикла;
		Если ЗаменаИдентификаторовМетодовПоДирективе.Количество()>0 Тогда
			ЗаменаИдентификаторовМетодов[Директива] = ЗаменаИдентификаторовМетодовПоДирективе;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Подпрограмма Из МассивПодпрограмм Цикл

		Директива = Подпрограмма.Директива;
		
		ЗаменаИдентификаторовПолейПоДирективе = ЗаменаИдентификаторовПолей[Директива];
		Если ЗаменаИдентификаторовПолейПоДирективе<>Неопределено Тогда
			вмс_ВыполнениеПрограммногоКода.ТекстовыйПарсер_ЗаменитьИдентификаторыПодпрограммы(ТекстовыйПарсер, Подпрограмма, ЗаменаИдентификаторовПолейПоДирективе, Ложь);
		КонецЕсли;
		
		ЗаменаИдентификаторовМетодовПоДирективе = ЗаменаИдентификаторовМетодов[Директива];
		Если ЗаменаИдентификаторовМетодовПоДирективе<>Неопределено Тогда
			вмс_ВыполнениеПрограммногоКода.ТекстовыйПарсер_ЗаменитьИдентификаторыПодпрограммы(ТекстовыйПарсер, Подпрограмма, ЗаменаИдентификаторовМетодовПоДирективе, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецФункции

Функция ПреобразоватьКодПодпрограмм(ПроцессорКода)

	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");

	ТаблицаПодпрограмм = ПроцессорКода.ТекстовыйПарсер.ТаблицаПодпрограмм;
	
	МетодыУстановкиПолученияЗначенийПолей = Новый Массив;
	РК.ДобавитьЭлементыКоллекции(МетодыУстановкиПолученияЗначенийПолей, РК.НайтиЭлементыКоллекции(ТаблицаПодпрограмм, Новый Структура("Имя", "УстановитьЗначениеПоля")));
	РК.ДобавитьЭлементыКоллекции(МетодыУстановкиПолученияЗначенийПолей, РК.НайтиЭлементыКоллекции(ТаблицаПодпрограмм, Новый Структура("Имя", "ПолучитьЗначениеПоля")));
	
	МассивПодпрограмм = РК.СкопироватьОбъект(РК.ПолучитьЭлементыКоллекции(ТаблицаПодпрограмм));
	РК.ВычестьМассив(МассивПодпрограмм, МетодыУстановкиПолученияЗначенийПолей);
	вмс_ВыполнениеПрограммногоКода.ПроцессорКода_ПреобразоватьКодПодпрограмм(ПроцессорКода, МассивПодпрограмм);
	
	ПроцессорКода.ФункцияДляУстановкиЗначенийПолейОбъектов = Неопределено;
	ПроцессорКода.ФункцияДляПолученияЗначенийПолейОбъектов = Неопределено;
	вмс_ВыполнениеПрограммногоКода.ПроцессорКода_ПреобразоватьКодПодпрограмм(ПроцессорКода, МетодыУстановкиПолученияЗначенийПолей);
	
КонецФункции

Функция ТекущийКласс()
	
	Возврат СведенияОКлассах().ТекущийКласс;
	
КонецФункции

Функция ПолучитьКласс(Объект) Экспорт
	
	Если ТипЗнч(Объект)=Тип("Строка") Тогда
		ИмяКласса = Объект;
	Иначе
		Если ЭтоОписаниеКласса(Объект) Тогда
			Возврат Объект;
		КонецЕсли;
		
		Если вмс_КлассныеОбъекты.ЭтоКлассныйОбъект(Объект) Тогда
			ИмяКласса = Объект.ИмяКласса;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Класс = Неопределено;
	СведенияОКлассах = СведенияОКлассах();
	СведенияОКлассах.Классы.Свойство(ИмяКласса, Класс);
	
	Возврат Класс;
	
КонецФункции

Функция ПолучитьМетод(Объект, ИмяМетода) Экспорт
	
	Класс = ПолучитьКласс(Объект);
	
	Метод = Неопределено;
	Класс.Методы.Свойство(ИмяМетода, Метод);
	Возврат Метод;
	
КонецФункции

Функция УстановитьТекущийКласс(Класс) Экспорт
	
	СведенияОКлассах().ТекущийКласс = Класс;
	
КонецФункции

Функция СведенияОКлассах() Экспорт
	
	Перем ОбщегоНазначенияКлиентСервер;
	
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	СведенияОКлассах = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрПриложения("СведенияОКлассах");
	Если СведенияОКлассах=Неопределено Тогда
		СведенияОКлассах = Новый Структура;
		СведенияОКлассах.Вставить("Классы", Новый Структура);
		СведенияОКлассах.Вставить("ТекущийКласс");
		СведенияОКлассах.Вставить("ТекущийМетод");
		СведенияОКлассах.Вставить("ЭтоБэкенд", ОбщегоНазначенияКлиентСервер.ЭтоБэкенд());
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрПриложения("СведенияОКлассах", СведенияОКлассах);
	КонецЕсли;
	
	Возврат СведенияОКлассах;
	
КонецФункции

Функция ЭтоОписаниеКласса(Объект) Экспорт
	
	Возврат ТипЗнч(Объект)=Тип("Структура") И Объект.Свойство("ЭтоКлассОбъекта");
	
КонецФункции

Функция НовыйКласс(ИмяКласса) Экспорт
	
	ДанныеКомпиляции = Новый Структура;
	ДанныеКомпиляции.Вставить("Поля", Новый Структура);
	ДанныеКомпиляции.Вставить("Методы", Новый Структура);
	ДанныеКомпиляции.Вставить("ДанныеДляВыполненияПодпрограмм");
	ДанныеКомпиляции.Вставить("ДанныеДляВыполненияПодпрограммНаСервере");
	
	Класс = Новый Структура;
	Класс.Вставить("Имя", ИмяКласса);
	Класс.Вставить("Поля", Новый Структура);
	Класс.Вставить("Методы", Новый Структура);
	Класс.Вставить("МетодКонструктор", "");
	Класс.Вставить("СинхронизацияДанных", Ложь);
	Класс.Вставить("ПоляСинхронизации", Новый Соответствие);
	Класс.Вставить("ВызовБэкенда", Ложь);
	Класс.Вставить("ДанныеКомпиляции", ДанныеКомпиляции);
	Класс.Вставить("ЭтоКлассОбъекта", Истина);
	
	Возврат Класс;
	
КонецФункции

Функция НовоеПоле(ИмяПоля, ТипПоля=Неопределено, НаФронтенде=Истина, НаБэкенде=Ложь) Экспорт
	
	Поле = Новый Структура;
	Поле.Вставить("ИмяПоля", ИмяПоля);
	Поле.Вставить("ТипПоля", ТипПоля);
	Поле.Вставить("НаФронтенде", НаФронтенде);
	Поле.Вставить("НаБэкенде", НаБэкенде);
	
	Возврат Поле;
	
КонецФункции

Функция НовыйМетод(ИмяМетода) Экспорт
	
	Метод = Новый Структура;
	Метод.Вставить("ИмяМетода", ИмяМетода);
	Метод.Вставить("Параметры", Новый Структура);
	Метод.Вставить("ТекстОбработчика", "");
	Метод.Вставить("ПараметрыКомпиляции", ПолучитьПараметрыКомпиляцииДирективы("НаКлиенте"));

	Возврат Метод;
	
КонецФункции

Функция УстановитьПараметрыКомпиляцииДирективыМетода(Директива, знач Метод=Неопределено) Экспорт

	Если Метод=Неопределено Тогда
		СведенияОКлассах = СведенияОКлассах();
		Метод = СведенияОКлассах.ТекущийМетод;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(Метод.ПараметрыКомпиляции, ПолучитьПараметрыКомпиляцииДирективы(Директива));
	Возврат Истина;
	
КонецФункции

Функция ПолучитьПараметрыКомпиляцииДирективы(знач Директива) Экспорт

	Директива = ВРЕГ(Директива);
	
	ПараметрыКомпиляции = Новый Структура;
	ПараметрыКомпиляции.Вставить("НаКлиенте", СтрНайти(Директива, "НАКЛИЕНТЕ") > 0);
	ПараметрыКомпиляции.Вставить("НаСервере", СтрНайти(Директива, "НАСЕРВЕРЕ") > 0);
	ПараметрыКомпиляции.Вставить("НаБэкенде", СтрНайти(Директива, "НАБЭКЕНДЕ") > 0);
	ПараметрыКомпиляции.Вставить("БезКонтекста", СтрНайти(Директива, "БЕЗКОНТЕКСТА") > 0);
	ПараметрыКомпиляции.Вставить("ВызовСервера", Директива="НАСЕРВЕРЕ" ИЛИ Директива="НАСЕРВЕРЕБЕЗКОНТЕКСТА");
	ПараметрыКомпиляции.Вставить("ВызовБэкенда", Директива="НАБЭКЕНДЕ");
	
	Возврат ПараметрыКомпиляции;
	
КонецФункции

Функция ПолучитьДирективуПараметровКомпиляции(ПараметрыКомпиляции)
	
	Директива = "";
	Если ПараметрыКомпиляции.НаКлиенте Тогда
		Директива = Директива + "НаКлиенте";
	КонецЕсли;
		
	Если ПараметрыКомпиляции.НаСервере Тогда
		Директива = Директива + "НаСервере";
	КонецЕсли;
	
	Если ПараметрыКомпиляции.НаБэкенде Тогда
		Директива = Директива + "НаБэкенде";
	КонецЕсли;
	
	Если Директива<>"" Тогда
		Если ПараметрыКомпиляции.БезКонтекста Тогда
			Директива = Директива + "БезКонтекста";
		КонецЕсли;
		Возврат Директива;
	КонецЕсли;
	
КонецФункции

Функция НовыйПараметрМетода(ИмяПараметра, ТипПараметра=Неопределено) Экспорт
	
	Параметр = Новый Структура;
	Параметр.Вставить("ИмяПараметра", ИмяПараметра);
	Параметр.Вставить("ТипПараметра", ТипПараметра);
	
	Возврат Параметр;
	
КонецФункции

Функция ЗарегистрироватьБазовыйКласс()
	
	БазовыйКласс = ЗарегистрироватьКласс("Базовый");

	Метод = ДобавитьМетод("УстановитьЗначениеПоля");
		УстановитьПараметрыКомпиляцииДирективыМетода("НаКлиентеНаСервереНаБэкенде");
		ДобавитьПараметрМетода("ИмяПоля", "Строка");
		ДобавитьПараметрМетода("ЗначениеПоля");
		УстановитьТекстОбработчикаМетода("вмс_КлассыОбъектов.БазовыйКласс_МетодУстановитьЗначениеПоля(ЭтотОбъект, ИмяПоля, ЗначениеПоля)");
	
	ДобавитьМетод("ПолучитьЗначениеПоля");
		УстановитьПараметрыКомпиляцииДирективыМетода("НаКлиентеНаСервереНаБэкенде");
		ДобавитьПараметрМетода("ИмяПоля", "Строка");
		УстановитьТекстОбработчикаМетода(
			"Результат = Неопределено;
			|Если ЭтотОбъект.Поля.Свойство(ИмяПоля, Результат) Тогда
			| 	Возврат Результат;
			|КонецЕсли;"
		);
		
	ЗакончитьСозданиеКласса();
	
	Возврат БазовыйКласс;

КонецФункции

Функция БазовыйКласс_МетодУстановитьЗначениеПоля(Объект, ИмяПоля, ЗначениеПоля) Экспорт

	Если Объект.Поля.Свойство(ИмяПоля) Тогда
	 	Объект.Поля[ИмяПоля] = ЗначениеПоля;
		
		Если Объект.СинхронизацияДанных Тогда
			Если Объект.ПоляСинхронизации[ИмяПоля]=Истина Тогда
				Объект.ЗарегистрированныеИзменения[ИмяПоля] = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецФункции

Функция Инициализировать() Экспорт
	
	ЗарегистрироватьБазовыйКласс();
	
КонецФункции
