
&НаКлиенте
Процедура ЗаполнитьТриграммыПоВсейНоменклатуре(Команда)   
	СписокНоменклатуры = вмс_РаботаСТриграммамиВызовСервера.ПолучитьСписокНоменклатуры();  
	ДопПараметры = Новый Структура("СписокНоменклатуры", СписокНоменклатуры);
	ОО = Новый ОписаниеОповещения("ЗаполнениеТриграммовЗавершение", ЭтотОбъект,ДопПараметры);    
	КоличествоНоменклатуры = СписокНоменклатуры.Количество();
	СообщениеПользователю = СтрШаблон("Всего позиций номенклатуры в информационной базе обнаружено %1. Заполнить триграммы всем позициям?",КоличествоНоменклатуры);
	ПоказатьВопрос(ОО,СообщениеПользователю, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры       

&НаКлиенте
Процедура ЗаполнениеТриграммовЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт  
	
	Если Результат = КодВозвратаДиалога.Да Тогда    	
		ЗаполнитьВсеТриграммыФоном();
		ОбщегоНазначенияКлиент.СообщитьПользователю("Триграммы будут заполнены фоновым заданием!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеТриграммыФоном() Экспорт
	
	вмс_РаботаСТриграммамиВызовСервера.ЗаполнитьПервичноРегистрТриграммовФоновымЗаданием();
		
КонецПроцедуры
