
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ссылка = Параметры.Ссылка;
	
	Параметры.Свойство("ДействиеПриОткрытии", ДействиеПриОткрытии);
	
	МодульОбъекта().ДокументУчета_ИзвлечьКодыИзАрхива(Ссылка);
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	УстановитьЗаголовки();
	ЗаполнитьСпискиВыбораЭлементовФормы();
	НастроитьКартинкиКомандФормы();
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы(Истина);
	НастроитьСписокКодыМаркировки();
	ПроверитьТоварыМаркировки();
	УстановитьУсловноеОФормление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПодсказку();
	ОбновитьТекстСообщенияОбОшибке();
	УстановитьОтборПоказатьСписанныеКодыМаркировки();
	ПроверитьВыполнениеОбменаССервисом();
	ОбновитьСтатусОбновленияСтатусовКодовПриОткрытии();
	ОбновитьСтатусПроверкиКодовПриОткрытии();
	ВыполнитьДействиеПриОткрытии();
	
	ПодключитьОбработчикОжидания("ПослеОткрытия", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытия() Экспорт
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("КоличествоКодов", КоличествоКодов);
	ДопПараметры.Вставить("КоличествоАгрегатов", КоличествоАгрегатов);
	ДопПараметры.Вставить("КоличествоОпераций", КоличествоОпераций);
	ДопПараметры.Вставить("КоличествоТоваровДокумента", КоличествоТоваровДокумента);
	Действие = МодульКлиента().Перечисление_ДействияМетрики().Замер_ОткрытиеФормыДокументаУчета;
	МодульКлиента().ЗавершитьЗамерПроизводительности(Действие, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_Операция_Изменен" Тогда
		ЗаполнитьКонтекстФормы();
		ПроверитьТоварыМаркировки();
		НастроитьВидимостьЭлементовФормы();
	КонецЕсли;
		
	Если ИмяСобытия = "КонтурМаркировка_КодыВДокументах_Изменен" И Параметр = Ссылка Тогда
		ОбновитьРезультатыПроверкиКодов();
		ОбновитьСпискиКодовИАгрегатов();
		ПосчитатьКоличествоСтрокТаблицФормы();
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_Операция_КоличествоЗСНИзменено" И Параметр = Ссылка Тогда
		ОбновитьСписокКодовМаркировки();
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_ПринудительноЗакрытьМодуль" Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_ИзмененРежимТехническогоСпециалиста" Тогда
		НастроитьВидимостьПодменюТехническогоСпециалиста(Параметр);
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_СменитьВладельца" И Источник = ВладелецФормы Тогда
		ВладелецФормы = Параметр;
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_ЗапущенОбменССервисом" Тогда
		Если МодульКлиента().МассивСодержитЗначение(Параметр.ДокументыУчета, Ссылка) Тогда
			ОбновитьСтатусОбменаССервисом();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийФормы

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТоварыМаркировки_Добавить(Команда)
	
	ПараметрыФормы = Новый Структура;
	МодульКлиента().ОткрытьФормуОбработкиЛок("Форма_Товары_Список", ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировки_НайтиПоРеквизитам(Команда)
	
	СтрокаДокумента = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если СтрокаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПодобратьТоварыМаркировки(СтрокаДокумента.КлючСтрокиДокумента) Тогда
		Элементы.ТоварыМаркировки.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировки_ЗаполнитьПартииИзКодов(Команда)
	
	ЗаполнитьПартииИВесИзКодовМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировки_ЗаполнитьПартииИзВходящегоУПД(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТоварыМаркировки_УказаныПартии() Тогда
		
		ТекстВопроса = НСтр("ru='Очистить данные по партиям перед заполнением?'");
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ЗаполнитьПартииИВесИзВходящегоУПД_ОчиститьПартииПослеСогласия", ЭтаФорма);
		
		МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	Иначе
		
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура);
		ПараметрыФормы.Отбор.Вставить("Организация", Организация);
		ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
		
		ДопПараметры = Новый Структура("ОчиститьПартии", Ложь);
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ЗаполнитьПартииИВесИзВходящегоУПД_ПослеВыбораУПД", ЭтаФорма, ДопПараметры);
		
		МодульКлиента().ОткрытьФормуВыбораВходящегоУПД(ОписаниеОбработчика, ЭтаФорма, ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПартииИВесИзВходящегоУПД_ОчиститьПартииПослеСогласия(Результат, ДопПараметры = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьПартии = (Результат = КодВозвратаДиалога.Да);
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура);
	ПараметрыФормы.Отбор.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ДопПараметры = Новый Структура("ОчиститьПартии", ОчиститьПартии);
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ЗаполнитьПартииИВесИзВходящегоУПД_ПослеВыбораУПД", ЭтаФорма, ДопПараметры);
	
	МодульКлиента().ОткрытьФормуВыбораВходящегоУПД(ОписаниеОбработчика, ЭтаФорма, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПартииИВесИзВходящегоУПД_ПослеВыбораУПД(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьПартии = МодульКлиента().СвойствоСтруктуры(ДопПараметры, "ОчиститьПартии", Ложь);
	ЗаполнитьПартииИВесИзВходящегоУПД(РезультатВыбора, ОчиститьПартии);
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировки_УказатьСтрокуДокумента(Команда)
	
	ТекущиеДанные = Элементы.КодыМаркировки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"КодыМаркировки_ПослеВыбораСтрокиДокумента", ЭтаФорма);
	
	МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
	, СписокСтрокДокумента()
	, Элементы.КодыМаркировкиСтрокаДокумента
	, ЭтаФорма
	, ТекущиеДанные.КлючСтрокиДокумента);
	
КонецПроцедуры

&НаСервере
Процедура КодыМаркировки_УстановитьКлючСтрокиДокументаНаСервере(НовыйКлючСтрокиДокумента)
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	ВыделенныеСтроки = Элементы.КодыМаркировки.ВыделенныеСтроки;
	
	Если Не ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		ВыделенныеСтроки.Добавить(Элементы.КодыМаркировки.ТекущаяСтрока);
	КонецЕсли;
	
	Для каждого Стр Из ВыделенныеСтроки Цикл
		ТаблицаКодов.Добавить().КлючКода = Стр.КлючКода;
	КонецЦикла;
	
	ТаблицаКодов.ЗаполнитьЗначения(НовыйКлючСтрокиДокумента, "КлючСтрокиДокумента");
	
	УдалитьСтарыеКоды = Ложь;
	ОбновитьКлючиНоменклатуры1С = Истина;
	МодульОбъекта().КодыДокументов_Записать(ТаблицаКодов, Ссылка, УдалитьСтарыеКоды, ОбновитьКлючиНоменклатуры1С);
	
	ОбновитьСписокКодовМаркировки();
	ОбновитьРезультатыПроверкиКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_УказатьСтрокуДокумента(Команда)
	
	ТекДанные = Элементы.Агрегаты.ТекущиеДанные;
	Если ТекДанные = Неопределено
		Или Не ТекДанные.УровеньАгрегата Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"Агрегаты_ПослеВыбораСтрокиДокумента", ЭтаФорма);
	
	МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
	, СписокСтрокДокумента()
	, Элементы.АгрегатыСтрокаДокумента
	, ЭтаФорма
	, ТекДанные.КлючСтрокиДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_УказатьНоменклатуру1С(Команда)
	
	ТекДанные = Элементы.Агрегаты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Агрегаты_ПослеВыбораКлючаНоменклатуры1С", ЭтаФорма);
	
	МодульКлиента().ОткрытьФормуВыбораКлючаНоменклатуры1С(ОписаниеОбработчика, ТекДанные.КлючНоменклатуры1С, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_Обновить(Команда)
	
	ОбновитьСписокАгрегатов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_СортироватьПоВозрастанию(Команда)
	
	Если Не ЗначениеЗаполнено(Агрегаты.ПолучитьЭлементы()) Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.Агрегаты.ТекущийЭлемент;
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = СтрЗаменить(Элемент.Имя, "Агрегаты", "");
	
	Агрегаты_Сортировать(ИмяКолонки, "Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_СортироватьПоУбыванию(Команда)
	
	Если Не ЗначениеЗаполнено(Агрегаты.ПолучитьЭлементы()) Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.Агрегаты.ТекущийЭлемент;
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = СтрЗаменить(Элемент.Имя, "Агрегаты", "");
	
	Агрегаты_Сортировать(ИмяКолонки, "Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура Товары_НеПодлежитМаркировке(Команда)
	
	СтрокаДокумента = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если СтрокаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НеПодлежитМаркировке = Не СтрокаДокумента.НеПодлежитМаркировке;
	Элементы.Кнопка_ТоварНеПодлежитМаркировке.Пометка = НеПодлежитМаркировке;
	
	ВыделенныеСтроки = Элементы.ТоварыДокумента.ВыделенныеСтроки;
	Если Не ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		ВыделенныеСтроки.Добавить(Элементы.ТоварыДокумента.ТекущаяСтрока);
	КонецЕсли;
	
	Для каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		Стр = ТоварыДокумента.НайтиПоИдентификатору(ИдентификаторСтроки);
		Стр.НеПодлежитМаркировке = НеПодлежитМаркировке;
		МодульКлиента().УстановитьПризнакНоменклатурыНеПодлежитМаркировке(Стр.Номенклатура, НеПодлежитМаркировке);
	КонецЦикла;
	
	ОбновитьТекстОстатка();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_Перезаполнить(Команда)
	
	ДокументУчета_ПерезаполнитьНаСервере();
	
	Оповестить("КонтурМаркировка_ДокументУчета_Перезаполнен", Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ДокументУчета_ПерезаполнитьНаСервере()
	
	МодульОбъекта().ДокументУчета_Перезаполнить(Ссылка, Документ1С);
	
	ЗаполнитьКонтекстФормы();
	ОбновитьСпискиКодовИАгрегатов();
	ПроверитьТоварыМаркировки();
	
	НастроитьВидимостьЭлементовФормы();
	УстановитьПодсказку();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	ЗаписатьДокументУчета();
	ПровестиОпросПользователяИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_ЗавершитьРаботу(Команда)
	
	Если Не ПроверитьВозможностьЗавершитьРаботу() Тогда
		ТоварыДокумента_СообщитьОбОшибках();
		Возврат;
	КонецЕсли;
	
	Статусы.ОсновнойСтатус = МодульКлиента().Перечисление_СтатусыДокументовУчета().Завершен;
	
	ЗаписатьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_ЗавершитьРаботуПропустить(Команда)
	
	Статусы.ОсновнойСтатус = МодульКлиента().Перечисление_СтатусыДокументовУчета().Пропущен;
	Статусы.ТребуемоеДействие = МодульКлиента().Перечисление_ТребуемыеДействияДокументовУчета().РаботаЗавершена;
	
	ЗаписатьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_ВозобновитьРаботу(Команда)
	
	СтатусыДокументовУчета = МодульКлиента().Перечисление_СтатусыДокументовУчета();
	
	Если Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Пропущен Тогда
		Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Новый;
	ИначеЕсли Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Завершен Тогда
		Статусы.ОсновнойСтатус = СтатусыДокументовУчета.ВРаботе;
	Иначе
		ВызватьИсключение НСтр("ru = 'Невозможно возобновить работу документа со статусом: '") + Статусы.ОсновнойСтатус;
	КонецЕсли;
	
	ЗаписатьДокументУчета();
	
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_НачатьРаботу(Команда)
	
	Если Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Статусы.ОсновнойСтатус = МодульКлиента().Перечисление_СтатусыДокументовУчета().ВРаботе;
	
	ЗаписатьДокументУчета();
	
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_Удалить(Команда)
	
	Если ЕстьКодыВДокументе() Или ЗначениеЗаполнено(СписокОпераций) Тогда
		ТекстВопроса = НСтр("ru = 'Документ, операции и коды товаров будут удалены, продолжить?'");
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ДокументУчета_УдалитьПослеСогласия", ЭтаФорма);
		МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ДокументУчета_УдалитьПослеСогласия(КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_УдалитьПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ДокументУчета_Удалить(Ссылка);
	
	Ссылка = Неопределено;
	Модифицированность = Ложь;
	
	Оповестить("КонтурМаркировка_ДокументУчета_Удален", Документ1С);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиНаТСДНачатьРаботу(Команда)
	
	Если ЕстьКодыВДокументе() Или ЗначениеЗаполнено(ТоварыМаркировки) Тогда
		ТекстВопроса = НСтр("ru = 'Сопоставленные товары маркировки будут очищены, продолжить?'");
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"НаполнитьКодамиНаТСДНачатьРаботуПослеСогласия", ЭтаФорма);
		МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		НаполнитьКодамиНаТСДНачатьРаботуПослеСогласия(КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Задачи_Обновить(Команда)
	
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменССервисом(Команда)
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Необходимо сохранить изменения, продолжить?'");
		Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ВыполнитьОбменПослеСогласияСохранения", ЭтаФорма);
		МодульКлиента().ПоказатьДиалогВопроса(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗапуститьОбменССервисом();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменПослеСогласияСохранения(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДокументУчета();
	
	ЗапуститьОбменССервисом();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбменССервисом()
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если МодульКлиента().ОчередьОбмена_ЕстьФайлыДляПодписи(Организация, Ссылка) Тогда
		МодульКлиента().ОткрытьФормуПодписанияИОтправки(ЭтаФорма, Организация, Ссылка);
	Иначе
		МодульКлиента().ЗапуститьОбменПоОрганизации(ЭтаФорма, Организация, Ссылка);
		ОбновитьСтатусОбменаССервисом();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыполнениеОбменаССервисом()
	
	Если МодульКлиента().ОбменССервисомВыполняется(Ссылка) Тогда
		МодульКлиента().НастроитьКнопкуОбменаССервисом(Элементы.Кнопка_ВыполнитьОбмен, Истина);
		ПодключитьОбработчикОжидания("ОбновитьСтатусОбменаССервисом", 5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусОбменаССервисом() Экспорт
	
	ОбменССервисомВыполняется = МодульКлиента().ОбменССервисомВыполняется(Ссылка);
	
	МодульКлиента().НастроитьКнопкуОбменаССервисом(Элементы.Кнопка_ВыполнитьОбмен, ОбменССервисомВыполняется);
	
	Если ОбменССервисомВыполняется Тогда
		ПодключитьОбработчикОжидания("ОбновитьСтатусОбменаССервисом", 5, Истина);
	Иначе
		ЗаполнитьКонтекстФормы();
		ОбновитьСписокАгрегатов();
		ПроверитьТоварыМаркировки();
		НастроитьКартинкиКомандФормы();
		НастроитьВидимостьЭлементовФормы();
		МодульКлиента().ОбработатьОшибкиОбменаССервисом(ЭтаФорма, Организация, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Напечатать(Команда)
	
	Если Модифицированность Тогда
		ЗаписатьДокументУчета();
	КонецЕсли;
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ПечатьКодов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ОбновитьСтатусы(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьОбновлениеСтатусовКодов();
	
	ОбновитьСтатусОбновленияСтатусовКодов();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОбновлениеСтатусовКодов()
	
	МодульОбъекта().ЗапуститьОбновлениеСтатусовКодовДокумента(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусОбновленияСтатусовКодовПриОткрытии()
	
	Если МодульКлиента().ОбновлениеСтатусовКодовДокументаВыполняется(Ссылка) Тогда
		ИнтервалОжидания = 5;
		ПодключитьОбработчикОжидания("ОбновитьСтатусОбновленияСтатусовКодов", ИнтервалОжидания, Истина);
		НастроитьКнопкуОбновленияСтатусовКодов(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусОбновленияСтатусовКодов() Экспорт
	
	ОбновлениеСтатусовВыполняется = МодульКлиента().ОбновлениеСтатусовКодовДокументаВыполняется(Ссылка);
	
	НастроитьКнопкуОбновленияСтатусовКодов(ОбновлениеСтатусовВыполняется);
	
	Если ОбновлениеСтатусовВыполняется Тогда
		ИнтервалОжидания = 5;
		ПодключитьОбработчикОжидания("ОбновитьСтатусОбновленияСтатусовКодов", ИнтервалОжидания, Истина);
	Иначе
		ОбновитьСпискиКодовИАгрегатов();
		ОбновитьРезультатыПроверкиКодов();
		ОбновитьСтатусыДокумента();
		ЗаполнитьГруппуЭтаповМаркировки();
		ЗаполнитьГруппуМаршрутМаркировки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзДокументаОснования(Команда)
	
	Если Модифицированность Тогда
		ЗаписатьДокументУчета();
	КонецЕсли;
	
	НаполнитьКодамиИзДокументаОснованияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НаполнитьКодамиИзДокументаОснованияНаСервере()
	
	Если ЗначениеЗаполнено(ВидКорректировки) Тогда
		МодульОбъекта().ДокументУчета_ЗаполнитьКодамИзОснования(Ссылка);
	Иначе
		МодульОбъекта().ДокументУчета_ПодобратьКодыИзОснования(Ссылка);
	КонецЕсли;
	
	ОбновитьРезультатыПроверкиКодов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьСпискиКодовИАгрегатов();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзИсправляемогоДокумента(Команда)
	
	Если Модифицированность Тогда
		ЗаписатьДокументУчета();
	КонецЕсли;
	
	НаполнитьКодамиИзИсправляемогоДокументаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НаполнитьКодамиИзИсправляемогоДокументаНаСервере()
	
	ЗаписатьДокументУчетаНаСервере();
	
	МодульОбъекта().ДокументУчета_ЗаполнитьКодамиИзИсправляемогоДокумента(Ссылка);
	
	ОбновитьРезультатыПроверкиКодов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьСпискиКодовИАгрегатов();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьАгрегамиИзДокументаОснования(Команда)
	
	НаполнитьАгрегамиИзДокументаОснованияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НаполнитьАгрегамиИзДокументаОснованияНаСервере()
	
	МодульОбъекта().ДокументУчета_ПодобратьАгрегатыИзОснования(Ссылка);
	
	ОбновитьРезультатыПроверкиКодов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьСпискиКодовИАгрегатов();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ПодобратьИзПула(Команда)
	
	ПодобратьНовыеКодыИзЗаказовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьНовыеКодыИзЗаказовНаСервере()
	
	МодульОбъекта().ДокументУчета_ПодобратьНовыеКодыИзЗаказов(Ссылка);
	
	ОбновитьРезультатыПроверкиКодов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьСписокКодовМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиНаТСД(Команда)
	
	ЗаписатьДокументУчета();
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ПодборКодовНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Заказать(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ЗаказКодов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ВыполнитьВводВОборот(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ВводВОборот;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Агрегировать(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().АгрегацияКодов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ЗарегистрироватьКИТУ(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().РегистрацияАгрегатов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Разагрегировать(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().РасформированиеАгрегатов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Перемаркировать(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().Перемаркировка;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_ЗаполнитьТоварыИзГИСМТ(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТоварыАгрегатовИзГИСМТ();
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_ЗаполнитьВложенныеКодыИзГИСМТ(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВложенныеКодыАгрегатовИзГИСМТ();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзВходящегоУПД(Команда)
	
	ЗагрузитьКодыИзВходящегоУПД();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзВнешнегоИсточника(Команда)
	
	ЗагрузитьКодыИзВнешнегоИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзВнешнегоИсточникаНачатьРаботу(Команда)
	
	ЗагрузитьКодыИзВнешнегоИсточника(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзДругогоДокумента(Команда)
	
	ЗагрузитьКодыИзДругогоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзДругогоДокументаНачатьРаботу(Команда)
	
	ЗагрузитьКодыИзДругогоДокумента(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайлCSV(Команда)
	
	ФорматыФайловСКодами = МодульКлиента().Перечисление_ФорматыФайловСКодами();
	СохранитьКодыВФайл(ФорматыФайловСКодами.csv);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайлXLS(Команда)
	
	ФорматыФайловСКодами = МодульКлиента().Перечисление_ФорматыФайловСКодами();
	СохранитьКодыВФайл(ФорматыФайловСКодами.xlsx);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайл(ФорматФайла)
	
	ТипыФайловСКодами = МодульКлиента().Перечисление_ТипыФайловСКодами();
	
	ПараметрыСохранения = МодульКлиента().Новый_ПараметрыСохраненияФайлаСКодами();
	
	ПараметрыСохранения.Ссылка = Ссылка;
	ПараметрыСохранения.ФорматФайла = ФорматФайла;
	ПараметрыСохранения.ТипФайлаСКодами = ТипыФайловСКодами.ФайлКодовДокументаУчета;
	
	МодульКлиента().СохранитьКодыВФайл(ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_НаполнитьАгрегатыНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().НаполнениеАгрегатовНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_НаполнитьНаборыНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().НаполнениеНаборовНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ЗарегистрироватьНаборы(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().РегистрацияНаборов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_СоздатьОтчетОНанесении(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ОтчетОНанесении;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_НаполнитьОтчетОНанесенииНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ОтчетОНанесенииНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_НаполнитьОтчетОВыбытииНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ОтчетОВыбытииНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_СкрытьСписанные(Команда)
	
	Элемент = Элементы.Кнопка_СкрытьСписанныеКоды;
	Элемент.Пометка = Не Элемент.Пометка;
	
	УстановитьОтборПоказатьСписанныеКодыМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_АгрегироватьКИГУ(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ФормированиеКИГУ;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_НаполнитьКИГУНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().НаполнениеКИГУНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ЗарегистрироватьКИГУ(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().РегистрацияКИГУ;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ВернутьВОборот(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ВозвратВОборот;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_НаполнитьВозвратВОборотНаТСД(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ВозвратВОборотНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_СформироватьАТК(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ФормированиеАТК;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_РасформироватьАТК(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().РасформированиеАТК;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_КорректироватьСведения(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().КорректировкаСведенийОКодах;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_УведомитьОСостоянииКодов(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().УведомлениеОСостоянииКодов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаСервере
Процедура Документ_НачатьРаботу()
	
	СтатусыДокументовУчета = МодульОбъекта().Перечисление_СтатусыДокументовУчета();
	
	Если Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Новый Тогда
		Статусы.ОсновнойСтатус = СтатусыДокументовУчета.ВРаботе;
		ЗаписатьДокументУчетаНаСервере();
	КонецЕсли;
	
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_Записать(Команда)
	
	ЗаписатьДокументУчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчета_СообщитьОбОтгрузке(Команда)
	
	ЗаписатьДокументУчета();
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().СообщениеОбОтгрузке;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ВывестиИзОборота(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ВыводИзОборота;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_СоздатьОтчетОВыбытии(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ОтчетОВыбытии;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзФайлов(Команда)
	
	ЗагрузитьКодыИзФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзФайловНачатьРаботу(Команда)
	
	ЗагрузитьКодыИзФайлов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументы_Открыть(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументУчета", Ссылка);
	
	МодульКлиента().ОткрытьФормуОбработкиЛок("Форма_СвязанныеДокументы", ЭтаФорма, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоВиртуальномуСкладу(Команда)
	
	Контекст = КонтекстОтчетаПоВиртуальномуСкладу();
	
	Если Не ЗначениеЗаполнено(Контекст) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОтчетаПоВиртуальномуСкладу(ЭтаФорма, Контекст);
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ДобавитьЗСН(Команда)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ОбновитьКоличествоЗСН", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументУчета", Ссылка);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	МодульКлиента().ОткрытьРедакторЗаводскихСерийныхНомеров(ЭтаФорма, ПараметрыФормы, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_РасформироватьНаборы(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().РасформированиеНаборов;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,, Организация, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Распределить(Команда)
	
	МодульКлиента().ДокументУчета_РаспределитьКодыМаркировки(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзТабличногоДокумента(Команда)
	
	ОткрытьФормуЗагрузкиКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиСПомощьюСканера(Команда)
	
	РежимСканера = Истина;
	
	ОткрытьФормуЗагрузкиКодов(РежимСканера);
	
КонецПроцедуры

&НаКлиенте
Процедура Шапка_ДополнительнаяКнопкаНажатие(Команда)
	
	РазмещенияКнопок = МодульКлиента().Перечисление_РазмещениеДополнительныхКнопок();
	
	ПараметрыНажатия = МодульКлиента().Новый_ПараметрыНажатияДопКнопки();
	ПараметрыНажатия.Размещение = РазмещенияКнопок.ДокументУчетаШапка;
	ПараметрыНажатия.ВызывающаяФорма = ЭтаФорма;
	ПараметрыНажатия.ДопСведения.ДокументУчета = Ссылка;
	ПараметрыНажатия.ДопСведения.Документ1С = Документ1С;
	
	МодульКлиента().ПриНажатииДополнительнойКнопки(ПараметрыНажатия, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировки_ДополнительнаяКнопкаНажатие(Команда)
	
	РазмещенияКнопок = МодульКлиента().Перечисление_РазмещениеДополнительныхКнопок();
	
	ПараметрыНажатия = МодульКлиента().Новый_ПараметрыНажатияДопКнопки();
	ПараметрыНажатия.Размещение = РазмещенияКнопок.ДокументУчетаСписокКодов;
	ПараметрыНажатия.ВызывающаяФорма = ЭтаФорма;
	ПараметрыНажатия.ДопСведения.ДокументУчета = Ссылка;
	ПараметрыНажатия.ДопСведения.Документ1С = Документ1С;
	
	МодульКлиента().ПриНажатииДополнительнойКнопки(ПараметрыНажатия, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКодыСПомощьюТабличногоДокумента(Команда)
	
	ОткрытьФормуЗагрузкиКодов(, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКодыСПомощьюСканера(Команда)
	
	ОткрытьФормуЗагрузкиКодов(Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуАдминистратора(Команда)
	
	МодульКлиента().ОткрытьФормуАдминистратораМаркировки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактораДокументаУчета(Команда)
	
	МодульКлиента().ОткрытьФормуРедактораДокументаУчета(Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактораОперации(Команда)
	
	Операция = Неопределено;
	
	Если Элементы.ГруппаЗакладки.ТекущаяСтраница = Элементы.Закладка_Операции Тогда
		ТекущиеДанные = Элементы.СписокОпераций.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Операция = ТекущиеДанные.Операция;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуРедактораОперации(Операция, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедакторКода(Команда)
	
	ТекущийКлючКода = Неопределено;
	
	Если Элементы.ГруппаЗакладки.ТекущаяСтраница = Элементы.Закладка_КодыМаркировки Тогда
		ТекущиеДанные = Элементы.КодыМаркировки.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаЗакладки.ТекущаяСтраница = Элементы.Закладка_Агрегаты Тогда
		ТекущиеДанные = Элементы.Агрегаты.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Неопределено;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущийКлючКода = ТекущиеДанные.КлючКода;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуРедактораКодаМаркировки(ТекущийКлючКода, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКодыДокумента(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапуститьПроверкуКодов() Тогда
		ОбновитьСтатусПроверкиКодов();
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Нет кодов для проверки'");
		МодульКлиента().ПоказатьДиалогПредупреждения(ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьПроверкуКодов()
	
	Если Не МодульОбъекта().КодыДокументов_ЕстьКоды(Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МодульОбъекта().ЗапуститьПроверкуКодовДокумента(Ссылка);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСтатусПроверкиКодовПриОткрытии()
	
	Если МодульКлиента().ПроверкаКодовДокументаВыполняется(Ссылка) Тогда
		ИнтервалОжидания = 5;
		ПодключитьОбработчикОжидания("ОбновитьСтатусПроверкиКодов", ИнтервалОжидания, Истина);
		НастроитьКнопкуПроверкиКодов(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусПроверкиКодов() Экспорт
	
	ПроверкаКодовВыполняется = МодульКлиента().ПроверкаКодовДокументаВыполняется(Ссылка);
	
	НастроитьКнопкуПроверкиКодов(ПроверкаКодовВыполняется);
	
	Если ПроверкаКодовВыполняется Тогда
		ИнтервалОжидания = 5;
		ПодключитьОбработчикОжидания("ОбновитьСтатусПроверкиКодов", ИнтервалОжидания, Истина);
	Иначе
		ОбновитьРезультатыПроверкиКодов();
		ОбновитьСпискиКодовИАгрегатов();
		УстановитьПодсказку();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьПроверкуРД(Команда)
	
	ТипыПроверкиКодов = МодульКлиента().Перечисление_ТипыСтатусовПроверкиКодов();
	ОтключитьПроверкуКодовПоТипу(ТипыПроверкиКодов.ПроверкаРДКодов);
	УстановитьПодсказку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьПроверкуВладельца(Команда)
	
	ТипыПроверкиКодов = МодульКлиента().Перечисление_ТипыСтатусовПроверкиКодов();
	ОтключитьПроверкуКодовПоТипу(ТипыПроверкиКодов.ПроверкаВладельцаКодов);
	УстановитьПодсказку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьПроверкуСтатуса(Команда)
	
	ТипыПроверкиКодов = МодульКлиента().Перечисление_ТипыСтатусовПроверкиКодов();
	ОтключитьПроверкуКодовПоТипу(ТипыПроверкиКодов.ПроверкаСтатусаКодов);
	УстановитьПодсказку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьДопПроверкаКодов1(Команда)
	
	ТипыПроверкиКодов = МодульКлиента().Перечисление_ТипыСтатусовПроверкиКодов();
	ОтключитьПроверкуКодовПоТипу(ТипыПроверкиКодов.ДопПроверкаКодов1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьДопПроверкаКодов2(Команда)
	
	ТипыПроверкиКодов = МодульКлиента().Перечисление_ТипыСтатусовПроверкиКодов();
	ОтключитьПроверкуКодовПоТипу(ТипыПроверкиКодов.ДопПроверкаКодов2);
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьПроверкуКодовПоТипу(ТипПроверки)
	
	СтатусыПроверкиКодов = МодульОбъекта().Перечисление_СтатусыПроверкиКодовДокумента();
	ДопИнформацияСтатусов = МодульОбъекта().Перечисление_ДопИнформацияСтатусовПроверкиКодовДокумента();
	
	СтатусыРезультатаПроверки = МодульОбъекта().ДокументУчета_СтатусыРезультатаПроверкиКодов(Ссылка);
	ИмяПоляДопИнформация = МодульОбъекта().ИмяПоляДопИнформация(ТипПроверки);
	
	Если СтатусыРезультатаПроверки[ТипПроверки] = СтатусыПроверкиКодов.Отключена Тогда
		СтатусыРезультатаПроверки[ТипПроверки] = СтатусыПроверкиКодов.НеАктуален;
		СтатусыРезультатаПроверки[ИмяПоляДопИнформация] = ДопИнформацияСтатусов.ПроверкаКодовНеактуальнаПерезапустить;
	Иначе
		СтатусыРезультатаПроверки[ТипПроверки] = СтатусыПроверкиКодов.Отключена;
		СтатусыРезультатаПроверки[ИмяПоляДопИнформация] = ДопИнформацияСтатусов.ПроверкаКодовОтключенаВДокументе;
	КонецЕсли;
	
	МодульОбъекта().ДокументУчета_ЗаписатьРезультатыПроверкиКодов(Ссылка, СтатусыРезультатаПроверки);
	
	ОбновитьРезультатыПроверкиКодов();
	ЗаполнитьКоличествоКодов();
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиКомандФормы

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ТоварыКоличествоЗСН Тогда
		СтандартнаяОбработка = Ложь;
		Если ТекущиеДанные.ТребуетсяЗСН Тогда
			ОткрытьРедакторЗаводскихСерийныхНомеров(ТекущиеДанные);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ТоварыНоменклатура Тогда
		СсылкаНаОбъект = ТекущиеДанные.Номенклатура;
	ИначеЕсли Поле = Элементы.ТоварыХарактеристика Тогда
		СсылкаНаОбъект = ТекущиеДанные.Характеристика;
	ИначеЕсли Поле = Элементы.ТоварыУпаковка Тогда
		СсылкаНаОбъект = ТекущиеДанные.Упаковка;
	ИначеЕсли Поле = Элементы.ТоварыСерия Тогда
		СсылкаНаОбъект = ТекущиеДанные.Серия;
	Иначе
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОбъектаИС(СсылкаНаОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	СтрокаДокумента = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если СтрокаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючСтрокиДокумента = СтрокаДокумента.КлючСтрокиДокумента;
	НеПодлежитМаркировке = СтрокаДокумента.НеПодлежитМаркировке;
	
	Элементы.Кнопка_ТоварНеПодлежитМаркировке.Пометка = НеПодлежитМаркировке;
	
	Если СтрокаДокумента.НеПодлежитМаркировке Тогда
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("КлючСтрокиДокумента", МодульКлиента().ПустойУникальныйИдентификатор());
	Иначе
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("КлючСтрокиДокумента", КлючСтрокиДокумента);
	КонецЕсли;
	Элементы.ТоварыМаркировки.ОтборСтрок = ПараметрыОтбора;
	
	ОбновитьТекстСообщенияОбОшибке();
	ОбновитьТекстОстатка();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	Стр = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если Стр.КоличествоУпаковок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Стр.РучнойВводКоличества = Истина;
	УстановитьНовоеКоличествоТоваровМаркировки(Стр);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПравилоОтраженияВЭДОПриИзменении(Элемент)
	
	ПроверитьТоварыМаркировки();
	ОбновитьТекстСообщенияОбОшибке();
	УстановитьПодсказку();
	Модифицированность = Истина;
	ИзмененоОтражениеВЭДО = Истина;
	
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиКоличествоПриИзменении(Элемент)
	
	СтрТов = Элементы.ТоварыМаркировки.ТекущиеДанные;
	Если СтрТов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрДок = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если СтрДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрТов.КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
	СтрДок.КоличествоПодобрано = КоличествоУпаковокТоваровМаркировки(СтрДок.КлючСтрокиДокумента, ЭтаФорма);
	
	ОбновитьТекстОстатка();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиПослеУдаления(Элемент)
	
	Стр = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Стр.КоличествоПодобрано = КоличествоУпаковокТоваровМаркировки(Стр.КлючСтрокиДокумента, ЭтаФорма);
	
	ОчиститьСоообщениеОбОшибкеВСтроке(Стр);
	ОбновитьТекстСообщенияОбОшибке();
	ЗаполнитьТребуетсяЗСН(Стр.КлючСтрокиДокумента);
	ЗаполнитьДоступностьПартионногоУчета(Стр.КлючСтрокиДокумента);
	ОбновитьТекстОстатка();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	СтрТов = Элементы.ТоварыМаркировки.ТекущиеДанные;
	Если СтрТов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрДок = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если СтрДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрТов.КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
	
	ОчиститьСоообщениеОбОшибкеВСтроке(СтрДок);
	ОбновитьТекстСообщенияОбОшибке();
	ЗаполнитьТребуетсяЗСН(СтрДок.КлючСтрокиДокумента);
	ЗаполнитьПризнакПеременныйВес(СтрДок.КлючСтрокиДокумента);
	ЗаполнитьДоступностьПартионногоУчета(СтрДок.КлючСтрокиДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиТоварОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТоварСсылка = Элементы.ТоварыМаркировки.ТекущиеДанные.Товар;
	
	Если ЗначениеЗаполнено(ТоварСсылка) Тогда
		МодульКлиента().ОткрытьФормуТовара(ТоварСсылка, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиТоварНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТекущийЭлемент");
	МодульКлиента().ОткрытьФормуОбработкиЛок("Форма_Товары_Список", Элемент, ПараметрыФормы);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиТоварПриИзменении(Элемент)
	
	Элементы.ТоварыМаркировки.ТекущиеДанные.ДобавленВручную = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМаркировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.ГруппаТоваровМаркировки.ТолькоПросмотр Тогда
		
		Если Поле = Элементы.ТоварыМаркировкиТовар Тогда
			Товар = Элемент.ТекущиеДанные.Товар;
			Если ЗначениеЗаполнено(Товар) Тогда
				МодульКлиента().ОткрытьФормуТовара(Товар, ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Поле = Элементы.КодыМаркировкиКодМаркировки Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.КлючКода) Тогда
			МодульКлиента().ОткрытьФормуКодаМаркировки(ТекущиеДанные.КлючКода, Организация, ЭтаФорма);
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.КодыМаркировкиСтрокаДокумента Тогда
		
		Если ТолькоПросмотр Тогда
			Возврат;
		КонецЕсли;
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"КодыМаркировки_ПослеВыбораСтрокиДокумента", ЭтаФорма);
		
		МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
		, СписокСтрокДокумента()
		, Элемент
		, ЭтаФорма
		, ТекущиеДанные.КлючСтрокиДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Не ЗначениеЗаполнено(Элементы.КодыМаркировки.ВыделенныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Выбранные коды будут удалены из документа, продолжить?'");
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Коды_УдалитьИзДокументаПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.СписокОпераций.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипОперации = ТекСтрока.ТипОперации;
	Операция = ТекСтрока.Операция;
	
	Если Не ЗначениеЗаполнено(Операция) Тогда
		Операция = МодульКлиента().Операция_Создать(ТипОперации, Ссылка);
		ОбновитьСписокОпераций();
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	НастроитьКартинкиКомандФормы();
	ЗаписатьДокументУчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОткрытие(Элемент, СтандартнаяОбработка)
	
	МодульКлиента().ОткрытьФормуОрганизации(Организация, ЭтаФорма);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	МодульКлиента().ОткрытьФормуОбработкиЛок("Форма_Организации_Список", Элемент, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СкладОткрытие(Элемент, СтандартнаяОбработка)
	
	МодульКлиента().ОткрытьФормуСклада(Склад, ЭтаФорма);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	МодульКлиента().ОткрытьФормуОбработкиЛок("Форма_Склады_Список", Элемент, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если Поле = Элементы.АгрегатыКодМаркировки Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ТекДанные.КлючКода) Тогда
			МодульКлиента().ОткрытьФормуКодаМаркировки(ТекДанные.КлючКода, Организация, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
		
	Если Поле = Элементы.АгрегатыСтрокаДокумента Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТолькоПросмотр Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ТекДанные.УровеньАгрегата Тогда
			Возврат;
		КонецЕсли;
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Агрегаты_ПослеВыбораСтрокиДокумента", ЭтаФорма);
		
		МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
		, СписокСтрокДокумента()
		, Элемент
		, ЭтаФорма
		, ТекДанные.КлючСтрокиДокумента);
		
	КонецЕсли;
		
	Если Поле = Элементы.АгрегатыКлючНоменклатуры1С Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТолькоПросмотр Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекДанные.Товар) Тогда
			Возврат;
		КонецЕсли;
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Агрегаты_ПослеВыбораКлючаНоменклатуры1С", ЭтаФорма);
		
		МодульКлиента().ОткрытьФормуВыбораКлючаНоменклатуры1С(ОписаниеОбработчика, ТекДанные.КлючНоменклатуры1С, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Не ЗначениеЗаполнено(Элементы.Агрегаты.ВыделенныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Выбранные агрегаты будут удалены из документа, продолжить?'");
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Агрегаты_УдалитьИзДокументаПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаЗакладкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.Закладка_Агрегаты И Не СписокАгрегатовЗаполнен Тогда
		ИнтервалОжидания = 0.1;
		ПодключитьОбработчикОжидания("ОбновитьСписокАгрегатовПослеОткрытияВкладки", ИнтервалОжидания, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКорректировкиПриИзменении(Элемент)
	
	УстановитьЗаголовкиСтраницФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправляемыйДокументУчетаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ИсправляемыйДокумент) Тогда
		ИсправляемыйДокументУчета = МодульКлиента().ДокументУчета_НайтиИлиСоздать(ИсправляемыйДокумент, ЭтаФорма);
		Если ЗначениеЗаполнено(ИсправляемыйДокументУчета) Тогда
			МодульКлиента().ОткрытьФормуДокументаУчета(ИсправляемыйДокументУчета, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьКакИсправитьОшибкуНажатие(Элемент)
	
	МодульКлиента().ОткрытьСправкуКакИсправитьОшибкиКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодробнееОРаботеСМаршрутамиДокументаНажатие(Элемент)
	
	МодульКлиента().ОткрытьСправкуОРаботеСМаршрутамиДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодробнееОРаботеСМаршрутамиДокумента82Нажатие(Элемент)
	
	МодульКлиента().ОткрытьСправкуОРаботеСМаршрутамиДокумента();
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийЭлементовФормы

// #Область ЭтапыМаркировки

&НаСервере
Процедура ОбновитьСтатусыДокумента()
	
	ВсеСтатусы = МодульОбъекта().СтатусыДокументаУчета_Прочитать(Ссылка);
	ЗаполнитьЗначенияСвойств(Статусы, ВсеСтатусы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуЭтаповМаркировки()
	
	Если Не ЗначениеЗаполнено(МаршрутМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеЭтапы = ТекущиеЭтапыМаршрутаМаркировки();
	
	ТекТребДействие = Статусы.ТребуемоеДействиеПоМаршруту;
	ТребуемыеДействия = МодульОбъекта().Перечисление_ТребуемыеДействияДокументовУчета();
	
	ЭтоПредыдущийЭтап = Ложь;
	Для Каждого Элемент Из ТекущиеЭтапы Цикл
		Если Элемент.ТекущийЭтап Тогда
			ЭтоПредыдущийЭтап = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ЭтоСледующийЭтап = Ложь;
	КоличествоЭтапов = ТекущиеЭтапы.Количество();
	КартинкаТочкиПоследнегоЭтапа = Неопределено;
	Для сц = 1 По 3 Цикл
		
		Элементы["ГруппаЭтап" + сц].Видимость = (сц <= КоличествоЭтапов);
		Если сц > КоличествоЭтапов Тогда
			Продолжить;
		КонецЕсли;
		
		Элемент = ТекущиеЭтапы[сц - 1];
		
		ЭтоСледующийЭтап = Не (ЭтоПредыдущийЭтап Или Элемент.ТекущийЭтап);
		
		Если Элемент.ТекущийЭтап Тогда
			ЭтоПредыдущийЭтап = Ложь;
			КартинкаТочки = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяТочкаКонтурная;
			КартинкаЛинии = БиблиотекаКартинок.КонтурМаркировка_СераяЛинияГоризонт;
		КонецЕсли;
		
		Если ЭтоПредыдущийЭтап Тогда
			КартинкаТочки = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяТочка;
			КартинкаЛинии = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяЛинияГоризонт;
		КонецЕсли;
		
		Если ЭтоСледующийЭтап Или Элемент.Пропущен Тогда
			КартинкаТочки = БиблиотекаКартинок.КонтурМаркировка_СераяТочкаКонтурная;
			КартинкаЛинии = БиблиотекаКартинок.КонтурМаркировка_СераяЛинияГоризонт;
		КонецЕсли;
		
		Если ТекТребДействие = ТребуемыеДействия.РаботаЗавершена
			И Не Элемент.Пропущен Тогда
			КартинкаТочки = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяТочка;
			КартинкаЛинии = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяЛинияГоризонт;
		КонецЕсли;
		
		Если Элемент.ПоследнийЭтап Тогда
			КартинкаТочкиПоследнегоЭтапа = КартинкаТочки;
		КонецЕсли;
		
		Элементы["Картинка_Точка" + сц].Картинка = КартинкаТочки;
		Элементы["Картинка_ЛинияЭтап" + сц].Картинка = КартинкаЛинии;
		Элементы["Надпись_Этап" + сц].Заголовок = Элемент.ТребуемоеДействие;
		
	КонецЦикла;
	
	Этап = ТекущиеЭтапы[ТекущиеЭтапы.ВГраница()];
	Если Этап.ПоследнийЭтап Тогда
		Элементы.Картинка_Точка4.Картинка = КартинкаТочкиПоследнегоЭтапа;
	Иначе
		
		Если ТекТребДействие = ТребуемыеДействия.РаботаЗавершена Тогда
			Элементы.Картинка_Точка4.Картинка = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяТочка;
		Иначе
			Элементы.Картинка_Точка4.Картинка = БиблиотекаКартинок.КонтурМаркировка_СераяТочкаКонтурная;
		КонецЕсли;
		
	КонецЕсли;
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3.12")
		Или МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3.12") Тогда
		
		Для сц = 1 По 4 Цикл
			Элементы["Картинка_Точка" + сц].Высота = 1;
			Элементы["Картинка_Точка" + сц].Ширина = 2;
		КонецЦикла;
		
		Для сц = 1 По 3 Цикл
			Элементы["Картинка_ЛинияЭтап" + сц].Высота = 1;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекущиеЭтапыМаршрутаМаркировки()
	
	Результат = Новый Массив;
	
	ТекТребДействие = Статусы.ТребуемоеДействиеПоМаршруту;
	ТребуемыеДействия = МодульОбъекта().Перечисление_ТребуемыеДействияДокументовУчета();
	
	МаксИндекс = ЭтапыМаркировки.Количество() - 1;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТребуемоеДействие", ТекТребДействие);
	
	Строки = ЭтапыМаркировки.НайтиСтроки(ПараметрыОтбора);
	Если ТекТребДействие = ТребуемыеДействия.РаботаЗавершена Тогда
		Индекс = МаксИндекс;
	ИначеЕсли Строки.Количество() = 0 Тогда
		Индекс = 0;
	Иначе
		Индекс = ЭтапыМаркировки.Индекс(Строки[0]);
	КонецЕсли;
	
	Если Индекс = 0 Тогда
		сцМин = Индекс;
		сцМакс = Мин(2, МаксИндекс);
	ИначеЕсли Индекс = МаксИндекс Тогда
		сцМин = Макс(0, МаксИндекс - 2);
		сцМакс = Индекс;
	Иначе
		сцМин = Индекс - 1;
		сцМакс = Индекс + 1;
	КонецЕсли;
	
	Для сц = сцМин По сцМакс Цикл
		
		Стр = ЭтапыМаркировки.Получить(сц);
		ТекущийЭтап = сц = Индекс;
		
		Элемент = Новый Структура;
		Элемент.Вставить("ТребуемоеДействие", Стр.ТребуемоеДействие);
		Элемент.Вставить("ТекущийЭтап", ТекущийЭтап);
		Элемент.Вставить("Пропущен", Стр.Пропущен);
		Элемент.Вставить("ПоследнийЭтап", сц = МаксИндекс);
		
		Результат.Добавить(Элемент);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьГруппуМаршрутМаркировки()
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3.12")
		Или МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3.12") Тогда
		
		Элементы.ГруппаМаршрутДокумента.Видимость = Ложь;
		Элементы.Закладка_МаршрутДокумента.Видимость = Истина;
		РодительЭлемента = Элементы.ГруппаМаршрутДокументаДанные82;
		ДекорацииРучногоВыбораЭтапа = Элементы.ДекорацияУстановитьЭтапВручную82;
		
	Иначе
		
		Элементы.ГруппаМаршрутДокумента.Видимость = Истина;
		Элементы.Закладка_МаршрутДокумента.Видимость = Ложь;
		РодительЭлемента = Элементы.ГруппаМаршрутДокументаДанные;
		ДекорацииРучногоВыбораЭтапа = Элементы.ДекорацияУстановитьЭтапВручную;
		
	КонецЕсли;
	
	ОбновитьЗаголовокДекорацииРучногоВыбораЭтапа(ЭтаФорма, ДекорацииРучногоВыбораЭтапа);
	
	УдалитьПодчиненныеЭлементы(РодительЭлемента);
	УдалитьДобавленныеРеквизиты();
	
	ОписаниеТипа_Булево = МодульОбъекта().ОписаниеТипа_Булево();
	ГруппировкаВерт = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппировкаГоризонт = ГоризонтальнаяГруппировкаПодчиненныхЭлементовФормы();
	
	КлючиЭтапов = МодульОбъекта().КлючиПеречисления_ЭтапыМаркировки();
	КлючиТребДействий = МодульОбъекта().КлючиПеречисления_ТребуемыеДействияДокументовУчета();
	ТребуемыеДействия = МодульОбъекта().Перечисление_ТребуемыеДействияДокументовУчета();
	СтатусыДокументовУчета = МодульОбъекта().Перечисление_СтатусыДокументовУчета();
	
	ДобавляемыеРеквизиты = Новый Массив;
	ПутиКДанным = Новый Массив;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТребуемоеДействие", Статусы.ТребуемоеДействиеПоМаршруту);
	Строки = ЭтапыМаркировки.НайтиСтроки(ПараметрыОтбора);
	Если Статусы.ТребуемоеДействиеПоМаршруту = ТребуемыеДействия.РаботаЗавершена Тогда
		ИндексТребДействие = ЭтапыМаркировки.Количество();
	ИначеЕсли Строки.Количество() = 0 Тогда
		ИндексТребДействие = -1;
	Иначе
		ИндексТребДействие = ЭтапыМаркировки.Индекс(Строки[0]);
	КонецЕсли;
	
	Этап = Неопределено;
	Для Каждого Стр Из ЭтапыМаркировки Цикл
		
		КлючЭтапа = КлючиЭтапов[Стр.Этап];
		КлючТребДействие = КлючиТребДействий[Стр.ТребуемоеДействие];
		
		Если Этап <> Стр.Этап Тогда
			
			Этап = Стр.Этап;
			
			ИмяЭлемента = "ГруппаЭтапМаршрутаДокумента_" + КлючЭтапа;
			ГруппаФормы = СоздатьГруппуЭтапаМаршрутаДокумента(ИмяЭлемента, РодительЭлемента);
			
			ИмяЭлемента = "ГруппаКартинкиМаршрутаДокумента_" + КлючЭтапа;
			ГруппаКартинки = СоздатьОбычнуюГруппуФормы(ИмяЭлемента, ГруппаФормы, ГруппировкаВерт);
			СоздатьКартинкиМаршрутаДокумента(Стр.Этап, ГруппаКартинки);
			
			ИмяЭлемента = "ГруппаЭтапДетально_" + КлючЭтапа;
			ГруппаЭтапДетально = СоздатьОбычнуюГруппуФормы(ИмяЭлемента, ГруппаФормы, ГруппировкаВерт);
			
			ИмяЭлемента = "Надпись_" + КлючЭтапа;
			ДекорацияЭтап = СоздатьДекорациюНадпись(ИмяЭлемента, ГруппаЭтапДетально, Стр.Этап);
			ДекорацияЭтап.РастягиватьПоГоризонтали = Истина;
			ПолужирныйШрифт = Новый Шрифт(ДекорацияЭтап.Шрифт,,, Истина);
			ДекорацияЭтап.Шрифт = ПолужирныйШрифт;
			
		КонецЕсли;
		
		ИмяЭлемента = "ГруппаТребуемыеДействия_" + КлючЭтапа + "_" + КлючТребДействие;
		ГруппаТребуемыеДействия = СоздатьОбычнуюГруппуФормы(ИмяЭлемента, ГруппаЭтапДетально, ГруппировкаГоризонт);
		
		ИмяЭлемента = "Флажок_" + КлючЭтапа + "_" + КлючТребДействие;
		ВидПоля = ВидПоляФормы.ПолеФлажка;
		ПолеФлажок = СоздатьПолеФормы(ИмяЭлемента, ГруппаТребуемыеДействия, ВидПоля);
		ПолеФлажок.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеФлажок.Видимость = Ложь;
		ПолеФлажок.УстановитьДействие("ПриИзменении", "ВыбратьЭтап");
		
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяЭлемента, ОписаниеТипа_Булево));
		ПутиКДанным.Добавить(Новый Структура("ПолеФормы, ПутьКДанным", ПолеФлажок, ИмяЭлемента));
		
		ИмяЭлемента = "Картинка_" + КлючЭтапа + "_" + КлючТребДействие;
		ТекИндекс = ЭтапыМаркировки.Индекс(Стр);
		Если Стр.ТребуемоеДействие = Статусы.ТребуемоеДействиеПоМаршруту И Не Стр.Пропущен Тогда
			Картинка = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяТочкаМалая;
		ИначеЕсли ТекИндекс < ИндексТребДействие И Не Стр.Пропущен Тогда
			Картинка = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяГалка;
		Иначе
			Картинка = БиблиотекаКартинок.КонтурМаркировка_СераяТочкаМалая;
		КонецЕсли;
		СоздатьДекорациюКартинка(ИмяЭлемента, ГруппаТребуемыеДействия, Картинка);
		
		ИмяЭлемента = "Надпись_" + КлючЭтапа + "_" + КлючТребДействие;
		СоздатьДекорациюНадпись(ИмяЭлемента, ГруппаТребуемыеДействия, Стр.ТребуемоеДействие);
		
		Если Стр.ТребуемоеДействие = Статусы.ТребуемоеДействиеПоМаршруту
			И Стр.ТребуемоеДействие <> ТребуемыеДействия.ЗавершитьРаботу Тогда
			ИмяЭлемента = "НадписьПропуститьЭтап_" + КлючЭтапа + "_" + КлючТребДействие;
			ЗаголовокЭлемента =  НСтр("ru = 'Пропустить этап'");
			ДекорацияПропуститьЭтап = СоздатьДекорациюНадпись(ИмяЭлемента, ГруппаТребуемыеДействия, ЗаголовокЭлемента);
			ДекорацияПропуститьЭтап.Гиперссылка = Истина;
			ДекорацияПропуститьЭтап.УстановитьДействие("Нажатие", "ПропуститьЭтап");
			ДекорацияПропуститьЭтап.Доступность = (Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Новый
			Или Статусы.ОсновнойСтатус = СтатусыДокументовУчета.ВРаботе);
		КонецЕсли;
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для Каждого Элемент Из ПутиКДанным Цикл
		Элемент.ПолеФормы.ПутьКДанным = Элемент.ПутьКДанным;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗаголовокДекорацииРучногоВыбораЭтапа(ЭтаФорма, Элемент)
	
	Если ЭтаФорма.РучнойВыборЭтапа Тогда
		ТекстЗаголовка = НСтр("ru = 'Подтвердить выбор'");
	Иначе
		ТекстЗаголовка = НСтр("ru = 'Установить этап вручную'");
	КонецЕсли;
	
	Элемент.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПодчиненныеЭлементы(Элемент)
	
	Пока Элемент.ПодчиненныеЭлементы.Количество() Цикл
		ПодчиненныйЭлемент = Элемент.ПодчиненныеЭлементы[0];
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ГруппаФормы")
			И ПодчиненныйЭлемент.ПодчиненныеЭлементы.Количество() > 0 Тогда
			УдалитьПодчиненныеЭлементы(ПодчиненныйЭлемент);
		КонецЕсли;
		Элементы.Удалить(ПодчиненныйЭлемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДобавленныеРеквизиты()
	
	ИменаРеквизитов = Новый Массив;
	РеквизитыФормы = ПолучитьРеквизиты();
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		ИменаРеквизитов.Добавить(РеквизитФормы.Имя);
	КонецЦикла;
	
	КлючиЭтапов = МодульОбъекта().КлючиПеречисления_ЭтапыМаркировки();
	КлючиТребДействий = МодульОбъекта().КлючиПеречисления_ТребуемыеДействияДокументовУчета();
	
	УдаляемыеРеквизиты = Новый Массив;
	Для Каждого Стр Из ЭтапыМаркировки Цикл
		КлючЭтапа = КлючиЭтапов[Стр.Этап];
		КлючТребДействие = КлючиТребДействий[Стр.ТребуемоеДействие];
		ИмяЭлемента = "Флажок_" + КлючЭтапа + "_" + КлючТребДействие;
		Если ИменаРеквизитов.Найти(ИмяЭлемента) <> Неопределено Тогда
			УдаляемыеРеквизиты.Добавить(ИмяЭлемента);
		КонецЕсли;
	КонецЦикла;
	
	ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Функция СоздатьГруппуЭтапаМаршрутаДокумента(ИмяЭлемента, РодительЭлемента)
	
	ТипЭлемента = Тип("ГруппаФормы");
	
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, ТипЭлемента, РодительЭлемента);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГоризонтальнаяГруппировкаПодчиненныхЭлементовФормы();
	НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	
	Возврат НовыйЭлемент;
	
КонецФункции

&НаСервере
Функция СоздатьОбычнуюГруппуФормы(ИмяЭлемента, РодительЭлемента, Группировка)
	
	ТипЭлемента = Тип("ГруппаФормы");
	
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, ТипЭлемента, РодительЭлемента);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = Группировка;
	
	Возврат НовыйЭлемент;
	
КонецФункции

&НаСервере
Процедура СоздатьКартинкиМаршрутаДокумента(Этап, РодительЭлемента)
	
	ТребуемыеДействия = МодульОбъекта().Перечисление_ТребуемыеДействияДокументовУчета();
	
	КлючиЭтапов = МодульОбъекта().КлючиПеречисления_ЭтапыМаркировки();
	КлючЭтапа = КлючиЭтапов[Этап];
	
	ЭтоПоследнийЭтап = Ложь;
	Если ЭтапыМаркировки.Количество() > 0 Тогда
		ЭтоПоследнийЭтап = Этап = ЭтапыМаркировки[ЭтапыМаркировки.Количество() - 1].Этап;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТребуемоеДействие", Статусы.ТребуемоеДействиеПоМаршруту);
	Строки = ЭтапыМаркировки.НайтиСтроки(ПараметрыОтбора);
	
	Если Статусы.ТребуемоеДействиеПоМаршруту = ТребуемыеДействия.РаботаЗавершена Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Этап", Этап);
		ПараметрыОтбора.Вставить("Пропущен", Ложь);
		Строки = ЭтапыМаркировки.НайтиСтроки(ПараметрыОтбора);
		ЭтапЗавершен = Строки.Количество() > 0;
		
		Если ЭтапЗавершен Тогда
			КартинкаТочка = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяТочка;
			КартинкаЛинияВерт = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяЛинияВерт;
		Иначе
			КартинкаТочка = БиблиотекаКартинок.КонтурМаркировка_СераяТочкаКонтурная;
			КартинкаЛинияВерт = БиблиотекаКартинок.КонтурМаркировка_СераяЛинияВерт;
		КонецЕсли;
		
	ИначеЕсли Строки.Количество() = 0 Тогда
		
		// текущего требуемого действия нет в маршруте маркировки, что-то пошло не так
		КартинкаТочка = БиблиотекаКартинок.КонтурМаркировка_СераяТочкаКонтурная;
		КартинкаЛинияВерт = БиблиотекаКартинок.КонтурМаркировка_СераяЛинияВерт;
		
	Иначе
		
		ИндексТребДействие = ЭтапыМаркировки.Индекс(Строки[0]);
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Этап", Этап);
		ПараметрыОтбора.Вставить("ТребуемоеДействие", Статусы.ТребуемоеДействиеПоМаршруту);
		
		Строки = ЭтапыМаркировки.НайтиСтроки(ПараметрыОтбора);
		ЭтапВРаботе = Строки.Количество() > 0;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Этап", Этап);
		Строки = ЭтапыМаркировки.НайтиСтроки(ПараметрыОтбора);
		МаксИндексЭтапа = ЭтапыМаркировки.Индекс(Строки[Строки.ВГраница()]);
		ЭтапЗавершен = ИндексТребДействие > МаксИндексЭтапа;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Этап", Этап);
		ПараметрыОтбора.Вставить("Пропущен", Ложь);
		Строки = ЭтапыМаркировки.НайтиСтроки(ПараметрыОтбора);
		ЭтапПропущен = Строки.Количество() = 0;
		
		Если ЭтапВРаботе И Не ЭтапПропущен Тогда
			КартинкаТочка = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяТочкаКонтурная;
			КартинкаЛинияВерт = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяЛинияВерт;
		ИначеЕсли ЭтапЗавершен И Не ЭтапПропущен Тогда
			КартинкаТочка = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяТочка;
			КартинкаЛинияВерт = БиблиотекаКартинок.КонтурМаркировка_ЗеленаяЛинияВерт;
		Иначе
			КартинкаТочка = БиблиотекаКартинок.КонтурМаркировка_СераяТочкаКонтурная;
			КартинкаЛинияВерт = БиблиотекаКартинок.КонтурМаркировка_СераяЛинияВерт;
		КонецЕсли;
		
	КонецЕсли;
	
	ИмяЭлемента = "КартинкаТочка_" + КлючЭтапа;
	ДекорацияТочка = СоздатьДекорациюКартинка(ИмяЭлемента, РодительЭлемента, КартинкаТочка);
	ДекорацияТочка.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
	
	Если Не ЭтоПоследнийЭтап Тогда
		ИмяЭлемента = "КартинкаЛинияВерт_" + КлючЭтапа;
		ДекорацияЛинияВерт = СоздатьДекорациюКартинка(ИмяЭлемента, РодительЭлемента, КартинкаЛинияВерт);
		ДекорацияЛинияВерт.РазмерКартинки = РазмерКартинки.Растянуть;
		ДекорацияЛинияВерт.РастягиватьПоВертикали = Истина;
	КонецЕсли;
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3.12")
		Или МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3.12") Тогда
		
		Элементы["КартинкаТочка_" + КлючЭтапа].Высота = 1;
		Элементы["КартинкаТочка_" + КлючЭтапа].Ширина = 2;
		
		Если Не ЭтоПоследнийЭтап Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Этап", Этап);
			Строки = ЭтапыМаркировки.НайтиСтроки(ПараметрыОтбора);
			Элементы["КартинкаЛинияВерт_" + КлючЭтапа].Высота = Строки.Количество();
			Элементы["КартинкаЛинияВерт_" + КлючЭтапа].Ширина = 2;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьДекорациюКартинка(ИмяЭлемента, РодительЭлемента, Картинка)
	
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), РодительЭлемента);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка = Картинка;
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3.12")
		Или МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3.12") Тогда
		
		НовыйЭлемент.Высота = 1;
		НовыйЭлемент.Ширина = 2;
		
	КонецЕсли;
	
	Возврат НовыйЭлемент;
	
КонецФункции

&НаСервере
Функция СоздатьДекорациюНадпись(ИмяЭлемента, РодительЭлемента, ЗаголовокЭлемента)
	
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), РодительЭлемента);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = ЗаголовокЭлемента;
	
	Возврат НовыйЭлемент;
	
КонецФункции

&НаСервере
Функция СоздатьПолеФормы(ИмяЭлемента, РодительЭлемента, ВидПоля)
	
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), РодительЭлемента);
	НовыйЭлемент.Вид = ВидПоля;
	
	Возврат НовыйЭлемент;
	
КонецФункции

&НаСервере
Функция ГоризонтальнаяГруппировкаПодчиненныхЭлементовФормы()
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3.12") Тогда
		Результат = Вычислить("ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная");
	Иначе
		Результат = Вычислить("ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДекорацияУстановитьЭтапВручнуюНажатие(Элемент)
	
	ДекорацияУстановитьЭтапВручнуюНажатиеНаСервере();
	
	Если РучнойВыборЭтапа Тогда
		
		РучнойВыборЭтапа = Ложь;
		
		Если МодульКлиента().ВерсияПлатформыНиже("8.3.12")
			Или МодульКлиента().ВерсияРежимаСовместимостиНиже("8.3.12") Тогда
			ДекорацииРучногоВыбораЭтапа = Элементы.ДекорацияУстановитьЭтапВручную82;
		Иначе
			ДекорацииРучногоВыбораЭтапа = Элементы.ДекорацияУстановитьЭтапВручную;
		КонецЕсли;
		ОбновитьЗаголовокДекорацииРучногоВыбораЭтапа(ЭтаФорма, ДекорацииРучногоВыбораЭтапа);
		
		Оповестить("КонтурМаркировка_ДокументУчета_Изменен", Ссылка);
		ОповеститьОбИзменении(Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДекорацияУстановитьЭтапВручнуюНажатиеНаСервере()
	
	КлючиЭтапов = МодульОбъекта().КлючиПеречисления_ЭтапыМаркировки();
	КлючиТребДействий = МодульОбъекта().КлючиПеречисления_ТребуемыеДействияДокументовУчета();
	
	Если РучнойВыборЭтапа Тогда
		
		Если МодульОбъекта().ВерсияПлатформыНиже("8.3.12")
			Или МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3.12") Тогда
			ДекорацииРучногоВыбораЭтапа = Элементы.ДекорацияУстановитьЭтапВручную82;
		Иначе
			ДекорацииРучногоВыбораЭтапа = Элементы.ДекорацияУстановитьЭтапВручную;
		КонецЕсли;
		ОбновитьЗаголовокДекорацииРучногоВыбораЭтапа(ЭтаФорма, ДекорацииРучногоВыбораЭтапа);
		
		ТекСтрокаНайдена = Ложь;
		Для Каждого Стр Из ЭтапыМаркировки Цикл
			
			Стр.Пропущен = Не ТекСтрокаНайдена;
			
			КлючЭтапа = КлючиЭтапов[Стр.Этап];
			КлючТребДействие = КлючиТребДействий[Стр.ТребуемоеДействие];
			
			ИмяЭлемента = "Флажок_" + КлючЭтапа + "_" + КлючТребДействие;
			
			Если ЭтаФорма[ИмяЭлемента] Тогда
				
				Стр.Пропущен = Ложь;
				ТекСтрокаНайдена = Истина;
				Статусы.ТребуемоеДействие = Стр.ТребуемоеДействие;
				МодульОбъекта().СтатусыДокументаУчета_Записать(Ссылка, Статусы);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// установка видимости для флажков и надписи Пропустить этап
	Для Каждого Стр Из ЭтапыМаркировки Цикл
		
		КлючЭтапа = КлючиЭтапов[Стр.Этап];
		КлючТребДействие = КлючиТребДействий[Стр.ТребуемоеДействие];
		
		ИмяЭлемента = "Флажок_" + КлючЭтапа + "_" + КлючТребДействие;
		Элементы[ИмяЭлемента].Видимость = Не Элементы[ИмяЭлемента].Видимость;
		Если Элементы[ИмяЭлемента].Видимость Тогда
			ЭтаФорма[ИмяЭлемента] = Ложь;
		КонецЕсли;
		
		Если Стр.ТребуемоеДействие = Статусы.ТребуемоеДействие Тогда
			ИмяЭлемента = "НадписьПропуститьЭтап_" + КлючЭтапа + "_" + КлючТребДействие;
			Если Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда
				Элементы[ИмяЭлемента].Видимость = Не Элементы[ИмяЭлемента].Видимость;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если РучнойВыборЭтапа Тогда
		
		ЗаписатьДокументУчетаНаСервере();
		
		НастроитьВидимостьКомандФормы();
		НастроитьВидимостьЭлементовФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПропуститьЭтап(Элемент)
	
	ПропуститьЭтапНаСервере(Элемент.Имя);
	
	Оповестить("КонтурМаркировка_ДокументУчета_Изменен", Ссылка);
	ОповеститьОбИзменении(Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПропуститьЭтапНаСервере(Знач ИмяЭлемента)
	
	ЧастиТекста = МодульОбъекта().РазделитьСтроку(ИмяЭлемента, "_");
	КлючЭтапа = ЧастиТекста[1];
	КлючТребДействие = ЧастиТекста[2];
	
	КлючиЭтапов = МодульОбъекта().КлючиПеречисления_ЭтапыМаркировки();
	КлючиТребДействий = МодульОбъекта().КлючиПеречисления_ТребуемыеДействияДокументовУчета();
	
	ТекСтрокаНайдена = Ложь;
	ЭтоЗавершениеМаршрута = Истина;
	Для Каждого Стр Из ЭтапыМаркировки Цикл
		
		ТекКлючЭтапа = КлючиЭтапов[Стр.Этап];
		ТекКлючТребДействие = КлючиТребДействий[Стр.ТребуемоеДействие];
		
		Если ТекСтрокаНайдена Тогда
			
			Статусы.ТребуемоеДействие = Стр.ТребуемоеДействие;
			МодульОбъекта().СтатусыДокументаУчета_Записать(Ссылка, Статусы);
			Прервать;
			
		Иначе
			
			Если ТекКлючЭтапа = КлючЭтапа И ТекКлючТребДействие = КлючТребДействие Тогда
				
				ТекСтрокаНайдена = Истина;
				Стр.Пропущен = Истина;
				МодульОбъекта().Метрика_МаршрутДокументаПропускШагаЭтапаМаркировки(Стр.Этап, Стр.ТребуемоеДействие);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписатьДокументУчетаНаСервере();
	
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭтап(Элемент)
	
	РучнойВыборЭтапа = Истина;
	Если МодульКлиента().ВерсияПлатформыНиже("8.3.12")
		Или МодульКлиента().ВерсияРежимаСовместимостиНиже("8.3.12") Тогда
		ДекорацииРучногоВыбораЭтапа = Элементы.ДекорацияУстановитьЭтапВручную82;
	Иначе
		ДекорацииРучногоВыбораЭтапа = Элементы.ДекорацияУстановитьЭтапВручную;
	КонецЕсли;
	ОбновитьЗаголовокДекорацииРучногоВыбораЭтапа(ЭтаФорма, ДекорацииРучногоВыбораЭтапа);
	
	КлючиЭтапов = МодульКлиента().КлючиПеречисления_ЭтапыМаркировки();
	КлючиТребДействий = МодульКлиента().КлючиПеречисления_ТребуемыеДействияДокументовУчета();
	
	Для Каждого Стр Из ЭтапыМаркировки Цикл
		
		КлючЭтапа = КлючиЭтапов[Стр.Этап];
		КлючТребДействие = КлючиТребДействий[Стр.ТребуемоеДействие];
		
		ИмяЭлемента = "Флажок_" + КлючЭтапа + "_" + КлючТребДействие;
		
		ЭтаФорма[ИмяЭлемента] = ИмяЭлемента = Элемент.Имя;
		
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти // ЭтапыМаркировки

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ВсеТоварыПодобраны()
	
	Результат = Истина;
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		Если Стр.НеПодлежитМаркировке Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.КоличествоУпаковок <> Стр.КоличествоПодобрано Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписокОпераций()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	ПодходящиеТипыОпераций = МодульОбъекта().ТипыИнтерактивныхОпераций();
	МодульОбъекта().УдалитьЗначениеИзМассива(ПодходящиеТипыОпераций, ТипыОпераций.РезервированиеПартий);
	
	СписокОпераций.Загрузить(МодульОбъекта().ДокументУчета_СписокОпераций(Ссылка, ПодходящиеТипыОпераций));
	
	Для Каждого Стр Из СписокОпераций Цикл
		
		Если Стр.Статус = СтатусыОпераций.Новый Тогда
			Стр.ТребуемоеДействие = "Начать работу";
			Стр.Активная = Истина;
			Стр.НомерКартинки = 0;
		ИначеЕсли Стр.Статус = СтатусыОпераций.ОперацияЗавершена
			Или Стр.Статус = СтатусыОпераций.ОперацияОтменена
			Или Стр.Статус = СтатусыОпераций.ПринятЧастично Тогда
			Стр.ТребуемоеДействие = "Работа завершена";
			Стр.Активная = Ложь;
			Стр.НомерКартинки = 4;
		ИначеЕсли Стр.Статус = СтатусыОпераций.ОшибкаЗаполнения
			Или Стр.Статус = СтатусыОпераций.ОшибкаОбработки
			Или Стр.Статус = СтатусыОпераций.ОшибкаОтменыОперации Тогда
			Стр.ТребуемоеДействие = "Исправить ошибки";
			Стр.Активная = Истина;
			Стр.НомерКартинки = 2;
		ИначеЕсли Стр.Статус = СтатусыОпераций.НеУдалосьРаспознатьКоды Тогда
			Стр.ТребуемоеДействие = "Редактировать список кодов";
			Стр.Активная = Истина;
			Стр.НомерКартинки = 3;
		Иначе
			Стр.ТребуемоеДействие = "Обрабатывается";
			Стр.Активная = Ложь;
			Стр.НомерКартинки = 3;
		КонецЕсли;
		
	КонецЦикла;
	
	ПосчитатьКоличествоСтрокТаблицФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовки()
	
	УстановитьЗаголовокФормы();
	УстановитьЗаголовкиСтраницФормы();
	УстановитьЗаголовкиКолонокДопПроверкиКодов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Заголовок = МодульОбъекта().ПараметрыВСтроку(НСтр("ru = 'Маркировка: %1'"), Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиСтраницФормы()
	
	Если МодульОбъекта().ДокументУчета_ЕстьРольКорректировкаОтгрузки(Ссылка) Тогда
		ВидыКорректировки = МодульОбъекта().Перечисление_ВидыКорректировкиДокумента();
		Если ВидКорректировки = ВидыКорректировки.Возврат Тогда
			Элементы.Закладка_Товары.Заголовок = НСтр("ru = 'Товары (возвращаемые)'");
			Элементы.Закладка_КодыМаркировки.Заголовок = НСтр("ru = 'Коды маркировки (возвращаемые)'");
			Элементы.Закладка_Агрегаты.Заголовок = НСтр("ru = 'Транспортные упаковки (возвращаемые)'");
		Иначе
			Элементы.Закладка_Товары.Заголовок = НСтр("ru = 'Товары (после корректировки)'");
			Элементы.Закладка_КодыМаркировки.Заголовок = НСтр("ru = 'Коды маркировки (после корректировки)'");
			Элементы.Закладка_Агрегаты.Заголовок = НСтр("ru = 'Транспортные упаковки (после корректировки)'");
		КонецЕсли;
	Иначе
		Элементы.Закладка_Товары.Заголовок = НСтр("ru = 'Товары'");
		Элементы.Закладка_КодыМаркировки.Заголовок = НСтр("ru = 'Коды маркировки'");
		Элементы.Закладка_Агрегаты.Заголовок = НСтр("ru = 'Транспортные упаковки'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиКолонокДопПроверкиКодов()

	НастройкиДокумента = МодульОбъекта().НастройкиДокументовУчета_НайтиПоТипуДокумента(ТипДокумента);
	ОписаниеНастроек = МодульОбъекта().НастройкиДокументаУчета_Прочитать(НастройкиДокумента);
	
	ЗаголовокКолонкиДопПроверкаКодов1 = СокрЛП(ОписаниеНастроек.ЗаголовокКолонкиДопПроверкаКодов1);
	Если ЗначениеЗаполнено(ЗаголовокКолонкиДопПроверкаКодов1) Тогда
		Элементы.НадписьДопПроверкаКодов1.Заголовок = ЗаголовокКолонкиДопПроверкаКодов1;
		Элементы.КодыМаркировкиДопПроверка1.Заголовок = ЗаголовокКолонкиДопПроверкаКодов1;
		Элементы.АгрегатыДопПроверка1.Заголовок = ЗаголовокКолонкиДопПроверкаКодов1;
	КонецЕсли;
	
	ЗаголовокКолонкиДопПроверкаКодов2 = СокрЛП(ОписаниеНастроек.ЗаголовокКолонкиДопПроверкаКодов2);
	Если ЗначениеЗаполнено(ЗаголовокКолонкиДопПроверкаКодов2) Тогда
		Элементы.НадписьДопПроверкаКодов2.Заголовок = ЗаголовокКолонкиДопПроверкаКодов2;
		Элементы.КодыМаркировкиДопПроверка2.Заголовок = ЗаголовокКолонкиДопПроверкаКодов2;
		Элементы.АгрегатыДопПроверка2.Заголовок = ЗаголовокКолонкиДопПроверкаКодов2;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	ТипыОбъектов = МодульОбъекта().ТипыОбъектовИС();
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.Контрагент1С, ТипыОбъектов.Контрагент);
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.ИсправляемыйДокумент, МодульОбъекта().ОписаниеТипа_ЛюбойДокумент());
	
	НастроитьПодвалДля82();
	ПоказатьКнопкиПоискаДля82();
	СформироватьДополнительныеКнопки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	ЗаполнитьРеквизитыПоДокументуУчета();
	ЗаполнитьТребуетсяЗСН();
	ЗаполнитьПризнакПеременныйВес();
	ЗаполнитьДоступностьПартионногоУчета();
	ЗаполнитьКоличествоКодов();
	ЗаполнитьКоличествоКодовПоСтатусам();
	ЗаполнитьКоличествоЗаводскихСерийныхНомеров();
	ОбновитьСписокОпераций();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьРезультатыПроверкиКодов();
	ЗаполнитьГруппуЭтаповМаркировки();
	ЗаполнитьГруппуМаршрутМаркировки();
	
	ОбъектВПроцессеОбновления = Не МодульОбъекта().ПроверитьОбъектВПроцессеОбновления(Ссылка, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоДокументуУчета()
	
	ОписаниеДокумента = МодульОбъекта().ДокументУчета_ПрочитатьДокумент(Ссылка);
	ВсегоСтрокДокумента = ОписаниеДокумента.ТоварыДокумента.Количество();
	ЕстьАртикул = МодульОбъекта().Интеграция_Номенклатура1С_ЕстьАртикул();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеДокумента, , "ТоварыДокумента, ТоварыМаркировки, ЭтапыМаркировки");
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеДокумента.ДопРеквизиты);
	
	ТоварыМаркировки.Очистить();
	Для Каждого Стр Из ОписаниеДокумента.ТоварыМаркировки Цикл
		НоваяСтрока = ТоварыМаркировки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	КэшНоменклатуры = Новый Соответствие;
	НомерСтроки = 0;
	
	ТоварыДокумента.Очистить();
	Для Каждого Стр Из ОписаниеДокумента.ТоварыДокумента Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = ТоварыДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		
		НоваяСтрока.НомерСтроки = НомерСтроки;
		НоваяСтрока.КоличествоПодобрано = КоличествоУпаковокТоваровМаркировки(Стр.КлючСтрокиДокумента, ЭтаФорма);
		
		НоваяСтрока.ПредставлениеСтроки = МодульОбъекта().ПредставлениеСтрокиСНомером(НомерСтроки
		, МодульОбъекта().ПредставлениеНоменклатуры1С(Стр, КэшНоменклатуры)
		, ВсегоСтрокДокумента);
		
		Если ЕстьАртикул И ЗначениеЗаполнено(НоваяСтрока.КлючНоменклатуры1С) Тогда
			НоваяСтрока.Артикул = МодульОбъекта().КлючНоменклатуры1С_Артикул(НоваяСтрока.КлючНоменклатуры1С);
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтапыМаркировки.Очистить();
	Для Каждого Стр Из ОписаниеДокумента.ЭтапыМаркировки Цикл
		НоваяСтрока = ЭтапыМаркировки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр,, "СпособыВыполнения");
		НоваяСтрока.СпособыВыполнения.ЗагрузитьЗначения(Стр.СпособыВыполнения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоКодов()
	
	КоличествоКодовПоСтрокам = МодульОбъекта().КодыДокументов_КоличествоКодовПоСтрокам(Ссылка);
	КоличествоКодовСОшибкамиПоСтрокам = МодульОбъекта().КодыДокументов_КоличествоКодовСОшибкамиПоСтрокам(Ссылка);
	
	ОтборПоСтроке = Новый Структура();
	ОтборПоСтроке.Вставить("КлючСтрокиДокумента");
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		
		КодовВсего = 0;
		КодовСОшибками = 0;
		
		ОтборПоСтроке.КлючСтрокиДокумента = Стр.КлючСтрокиДокумента;
		
		СтрКоличествоВсего = КоличествоКодовПоСтрокам.Найти(Стр.КлючСтрокиДокумента, "КлючСтрокиДокумента");
		СтрКоличествоСОшибками = КоличествоКодовСОшибкамиПоСтрокам.Найти(Стр.КлючСтрокиДокумента, "КлючСтрокиДокумента");
		
		Если ЗначениеЗаполнено(СтрКоличествоВсего) Тогда
			КодовВсего = СтрКоличествоВсего.Количество;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрКоличествоСОшибками) Тогда
			КодовСОшибками = СтрКоличествоСОшибками.Количество;
		КонецЕсли;
		
		Стр.КоличествоКодовСОшибками = КодовСОшибками;
		Стр.КоличествоКодов = КодовВсего - КодовСОшибками;
		
	КонецЦикла;
	
	УстановитьВидимостьКолонкиТоваров("КоличествоКодовСОшибками");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоКодовПоСтатусам()
	
	ИтогоПоСтатусам = "";
	
	СтатусыКодовДокумента = МодульОбъекта().КодыДокументов_КоличествоКодовПоСтатусам(Ссылка);
	
	ПредставлениеПустогоСтатуса = НСтр("ru='Неизвестный'");
	ПустойСтатус = "";
	Разделитель = "";
	ШаблонСтатуса = "%1: %2";
	
	ЭтоПервыйСтатус = Истина;
	
	Для Каждого Стр Из СтатусыКодовДокумента Цикл
		
		СтатусКодов = Стр.СтатусКодов;
		Если СтатусКодов = ПустойСтатус Тогда
			СтатусКодов = ПредставлениеПустогоСтатуса;
		КонецЕсли;
		
		ПредставлениеСтатуса = МодульОбъекта().ПараметрыВСтроку(ШаблонСтатуса, СтатусКодов, Стр.Количество);
		
		ИтогоПоСтатусам = ИтогоПоСтатусам + Разделитель + ПредставлениеСтатуса;
		
		Если ЭтоПервыйСтатус Тогда
			Разделитель = ", ";
			ЭтоПервыйСтатус = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.НадписьИтогоПоСтатусам.Заголовок = ИтогоПоСтатусам;
	
	ЕстьСписанные = СтатусыКодовДокумента.Найти(МодульОбъекта().Перечисление_СтатусыКодов().Списан, "СтатусКодов") <> Неопределено;
	УстановитьВидимостьКнопкиСкрытьСписанные(ЕстьСписанные);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоЗаводскихСерийныхНомеров()
	
	Если Не ТоварыДокумента_ТребуютсяЗаводскиеСерийныеНомера() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрДок Из ТоварыДокумента Цикл
		СтрДок.КоличествоЗСН = 0;
	КонецЦикла;
	
	Отбор = Новый Структура("КлючСтрокиДокумента");
	Для каждого СтрЗСН Из МодульОбъекта().КодыДокументов_КоличествоЗаводскихСерийныхНомеров(Ссылка) Цикл
		Отбор.КлючСтрокиДокумента = СтрЗСН.КлючСтрокиДокумента;
		Для каждого СтрТовара Из ТоварыДокумента.НайтиСтроки(Отбор) Цикл
			СтрТовара.КоличествоЗСН = СтрЗСН.КоличествоЗСН;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТребуетсяЗСН(КлючСтрокиДокумента = Неопределено)
	
	КэшТоваров = Новый Соответствие;
	
	Для Каждого СтрДок Из ТоварыДокумента Цикл
		
		Если ЗначениеЗаполнено(КлючСтрокиДокумента)
			И СтрДок.КлючСтрокиДокумента <> КлючСтрокиДокумента Тогда
			Продолжить;
		КонецЕсли;
		
		ТребуетсяЗСН = Ложь;
		Отбор = Новый Структура("КлючСтрокиДокумента", СтрДок.КлючСтрокиДокумента);
		Для Каждого СтрТов Из ТоварыМаркировки.НайтиСтроки(Отбор) Цикл
			Если ЗначениеЗаполнено(СтрТов.Товар) Тогда
				ОписаниеТовара = МодульОбъекта().Товар_Прочитать(СтрТов.Товар, КэшТоваров);
				ТребуетсяЗСН = ОписаниеТовара.ДопРеквизиты.ИспользоватьЗаводскойСН;
				Если ТребуетсяЗСН Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		СтрДок.ТребуетсяЗСН = ТребуетсяЗСН;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступностьПартионногоУчета(КлючСтрокиДокумента = Неопределено)
	
	ДопустимыеВидыПродукции = МодульОбъекта().ДопустимыеВидыПродукцииДляПартионногоУчета();
	ДопустимыеТипыКодов = МодульОбъекта().ДопустимыеТипыКодовМаркировкиДляПартионногоУчета();
	
	СтрокиТоваров = ТоварыМаркировки;
	Если ЗначениеЗаполнено(КлючСтрокиДокумента) Тогда
		СтрокиТоваров = ТоварыМаркировки.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", КлючСтрокиДокумента));
	КонецЕсли;
	
	Для Каждого СтрТов Из СтрокиТоваров Цикл
		
		СтрТов.ДоступенПартионныйУчет = Ложь;
		
		Если ЗначениеЗаполнено(СтрТов.Товар)
			И МодульОбъекта().МассивСодержитЗначение(ДопустимыеТипыКодов, СтрТов.Товар.ТипКодаМаркировки)
			И МодульОбъекта().МассивСодержитЗначение(ДопустимыеВидыПродукции, СтрТов.Товар.ВидПродукции) Тогда
			СтрТов.ДоступенПартионныйУчет = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПризнакПеременныйВес(КлючСтрокиДокумента = Неопределено)
	
	СтрокиТоваров = ТоварыМаркировки;
	Если ЗначениеЗаполнено(КлючСтрокиДокумента) Тогда
		СтрокиТоваров = ТоварыМаркировки.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", КлючСтрокиДокумента));
	КонецЕсли;
	
	Для Каждого СтрТов Из СтрокиТоваров Цикл
		СтрТов.ПеременныйВес = СтрТов.Товар.ПеременныйВес;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПодобратьТоварыМаркировки(КлючСтрокиДокумента)
	
	СтрДок = СтрокаДокументаПоКлючуСтроки(КлючСтрокиДокумента);
	
	МассивТоваров = МодульОбъекта().Товары_НайтиПоШтрихкодуИлиАртикулуНоменклатуры1С(СтрДок.КлючНоменклатуры1С, Организация);
	Если Не ЗначениеЗаполнено(МассивТоваров) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Отбор = Новый Структура("КлючСтрокиДокумента", КлючСтрокиДокумента);
	Для Каждого Стр Из ТоварыМаркировки.НайтиСтроки(Отбор) Цикл
		ТоварыМаркировки.Удалить(Стр);
	КонецЦикла;
	
	СопоставленОдинТовар = (МассивТоваров.Количество() = 1);
	
	Для Каждого Товар Из МассивТоваров Цикл
		
		НоваяСтрока = ТоварыМаркировки.Добавить();
		НоваяСтрока.Товар = Товар;
		НоваяСтрока.КлючСтрокиДокумента = СтрДок.КлючСтрокиДокумента;
		
		Если СопоставленОдинТовар Тогда
			НоваяСтрока.КоличествоУпаковок = СтрДок.КоличествоУпаковок;
			СтрДок.КоличествоПодобрано = СтрДок.КоличествоУпаковок;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьТребуетсяЗСН(КлючСтрокиДокумента);
	ЗаполнитьПризнакПеременныйВес(КлючСтрокиДокумента);
	ЗаполнитьДоступностьПартионногоУчета(КлючСтрокиДокумента);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Агрегаты_ПослеВыбораКлючаНоменклатуры1С(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ИдентификаторСтроки Из Элементы.Агрегаты.ВыделенныеСтроки Цикл
		Стр = Агрегаты.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(Стр.Товар) Тогда
			Стр.КлючНоменклатуры1С = РезультатВыбора;
		КонецЕсли;
		Если Стр.УровеньАгрегата Тогда
			Для Каждого СтрТовара Из Стр.ПолучитьЭлементы() Цикл
				СтрТовара.КлючНоменклатуры1С = РезультатВыбора;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Агрегаты_ОбновитьТоварыАгрегатов();
	
КонецПроцедуры

&НаСервере
Процедура Агрегаты_ОбновитьТоварыАгрегатов()
	
	ТоварыАгрегатов = МодульОбъекта().Новый_ТоварыАгрегатов();
	
	Для каждого ИдентификаторСтроки Из Элементы.Агрегаты.ВыделенныеСтроки Цикл
		
		Стр = Агрегаты.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если Стр.УровеньАгрегата Тогда
			СтрАгрегата = Стр;
		Иначе
			СтрАгрегата = Стр.ПолучитьРодителя();
		КонецЕсли;
		
		Для Каждого СтрТовара Из СтрАгрегата.ПолучитьЭлементы() Цикл
			ЗаполнитьЗначенияСвойств(ТоварыАгрегатов.Добавить(), СтрТовара);
		КонецЦикла;
		
	КонецЦикла;
	
	МодульОбъекта().ТаблицаЗначений_СвернутьПоВсемКолонкам(ТоварыАгрегатов, "Количество, КоличествоУпаковок");
	
	МодульОбъекта().ТоварыАгрегатов_Записать(ТоварыАгрегатов);
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_ПослеВыбораСтрокиДокумента(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйКлючСтрокиДокумента = РезультатВыбора.Значение;
	НоваяСтрокаДокумента = РезультатВыбора.Представление;
	
	Если Не ЗначениеЗаполнено(НовыйКлючСтрокиДокумента) Тогда
		НоваяСтрокаДокумента = "";
	КонецЕсли;
	
	Для каждого ИдентификаторСтроки Из Элементы.Агрегаты.ВыделенныеСтроки Цикл
		Стр = Агрегаты.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если Стр.УровеньАгрегата Тогда
			Стр.КлючСтрокиДокумента = НовыйКлючСтрокиДокумента;
			Стр.СтрокаДокумента = НоваяСтрокаДокумента;
		КонецЕсли;
	КонецЦикла;
	
	Агрегаты_УстановитьКлючСтрокиДокументаНаСервере(НовыйКлючСтрокиДокумента);
	
КонецПроцедуры

&НаСервере
Процедура Агрегаты_УстановитьКлючСтрокиДокументаНаСервере(НовыйКлючСтрокиДокумента)
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	Для каждого ИдентификаторСтроки Из Элементы.Агрегаты.ВыделенныеСтроки Цикл
		Стр = Агрегаты.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если Стр.УровеньАгрегата Тогда
			ТаблицаКодов.Добавить().КлючКода = Стр.КлючКода;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаКодов.ЗаполнитьЗначения(НовыйКлючСтрокиДокумента, "КлючСтрокиДокумента");
	
	МодульОбъекта().КодыДокументов_Записать(ТаблицаКодов, Ссылка, Ложь, Истина);
	
	ЗаполнитьКоличествоКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировки_ПослеВыбораСтрокиДокумента(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КодыМаркировки_УстановитьКлючСтрокиДокументаНаСервере(РезультатВыбора.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторЗаводскихСерийныхНомеров(СтрДок)
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Необходимо сохранить изменения, продолжить?'");
		Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ОткрытьРедакторЗаводскихСерийныхНомеровПослеСогласияСохранения", ЭтаФорма, СтрДок);
		МодульКлиента().ПоказатьДиалогВопроса(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("КлючСтрокиДокумента", СтрДок.КлючСтрокиДокумента);
	СтрокиТоваров = ТоварыМаркировки.НайтиСтроки(ПараметрыОтбора);
	
	Если Не ЗначениеЗаполнено(СтрокиТоваров) Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо указать GTIN'");
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
		Возврат;
	КонецЕсли;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ОбновитьКоличествоЗСН", ЭтаФорма, СтрДок);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументУчета", Ссылка);
	ПараметрыФормы.Вставить("КлючСтрокиДокумента", СтрДок.КлючСтрокиДокумента);
	ПараметрыФормы.Вставить("КлючНоменклатуры1С", СтрДок.КлючНоменклатуры1С);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	Если СтрокиТоваров.Количество() = 1 Тогда
		ПараметрыФормы.Вставить("Товар", СтрокиТоваров[0].Товар);
	КонецЕсли;
	
	МодульКлиента().ОткрытьРедакторЗаводскихСерийныхНомеров(ЭтаФорма, ПараметрыФормы, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторЗаводскихСерийныхНомеровПослеСогласияСохранения(Ответ, СтрДок) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДокументУчета();
	
	ОткрытьРедакторЗаводскихСерийныхНомеров(СтрДок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоЗСН(Успешно, СтрокаТоваров) Экспорт
	
	Если Успешно = Истина Тогда
		ЗаполнитьКоличествоЗаводскихСерийныхНомеров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиНаТСДНачатьРаботуПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТребуемыеДействия = МодульКлиента().Перечисление_ТребуемыеДействияДокументовУчета();
	СтатусыДокументовУчета = МодульКлиента().Перечисление_СтатусыДокументовУчета();
	
	Если Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Новый Тогда
		Статусы.ОсновнойСтатус = СтатусыДокументовУчета.ВРаботе;
	КонецЕсли;
	
	ТоварыМаркировки.Очистить();
	
	СброситьКодыДокументаИСохранить();
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ПодборТоваровИКодовНаТСД;
	МодульКлиента().Операция_СоздатьИОткрыть(ТипОперации, Ссылка,,, ЭтаФорма);
	ОбновитьСписокОпераций();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьКнопкиПоискаДля82()
	
	Если Не МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КодыМаркировкиКнопкиПоискаДля82.Видимость = Истина;
	Элементы.АгрегатыКнопкиПоискаДля82.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПодвалДля82()
	
	Если Не МодульОбъекта().ВерсияПлатформыНиже("8.3.12")
		И Не МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3.12") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаРезультатПроверкиКодов.Видимость = Ложь;
	
	Элементы.НадписьИтогоПоСтатусам.РастягиватьПоГоризонтали = Истина;
	Элементы.НадписьИтогоПоСтатусам.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	
	Ширина15 = 15;
	Ширина75 = 75;
	
	ПрефиксГруппа = "Группа";
	ПрефиксНадпись = "Надпись";
	
	Для Каждого КлючЗначение Из МодульОбъекта().Перечисление_ТипыПроверкиКодов() Цикл
		
		ИмяЭлементаГруппы = ПрефиксГруппа + КлючЗначение.Ключ;
		ИмяЭлементаНадпись = ПрефиксНадпись + КлючЗначение.Ключ;
		
		Элементы[ИмяЭлементаГруппы].Ширина = Ширина75;
		Элементы[ИмяЭлементаНадпись].Ширина = Ширина15;
		
	КонецЦикла;
	
	НовыйРодительГруппаРезультат82 = Элементы.ГруппаРезультатПроверкиКодов82;
	
	Элементы.Переместить(Элементы.ГруппаПодсказкаПроверки, НовыйРодительГруппаРезультат82, Элементы.ГруппаРезультатыПроверки82);
	Элементы.Переместить(Элементы.ГруппаСтатусыПроверкиКодов, НовыйРодительГруппаРезультат82);
	Элементы.Переместить(Элементы.ГруппаКакИсправитьОшибку, НовыйРодительГруппаРезультат82);
	
	Элементы.Переместить(Элементы.ДатаВыполненияПроверки, Элементы.ГруппаРезультатыПроверки82);
	Элементы.Переместить(Элементы.ГруппаКоличествоКодовСОшибками, Элементы.ГруппаРезультатыПроверки82);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьКомандФормы()
	
	НастройкаДокумента = МодульОбъекта().НастройкиДокументовУчета_НайтиПоТипуДокумента(ТипДокумента);
	ОписаниеНастройки = МодульОбъекта().НастройкиДокументаУчета_Прочитать(НастройкаДокумента);
	
	Для каждого Эл Из СоответствиеЭлементовИКомандДокументов() Цикл
		Элементы[Эл.Ключ].Видимость = Не МодульОбъекта().МассивСодержитЗначение(ОписаниеНастройки.ОтключенныеКоманды, Эл.Значение);
	КонецЦикла;
	
	РолиДокументов = МодульОбъекта().Перечисление_РолиДокументовУчета();
	ЕстьРольОтгрузка = ДокументуДоступнаРоль(РолиДокументов.Отгрузка);
	ЕстьРольКорректировка = ДокументуДоступнаРоль(РолиДокументов.КорректировкаОтгрузки);
	
	Если ЕстьРольОтгрузка Или ЕстьРольКорректировка Тогда
		
		Элементы.Кнопка_ОтчетПоВиртуальномуСкладу.Видимость = ТоварыДокумента_ЕстьОтражениеВЭДООСУ();
		Элементы.Кнопка_СообщитьОбОтгрузке.Видимость = Истина;
		Элементы.Кнопка_ПроверитьКоды.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКартинкиКомандФормы()
	
	ОписаниеТарифа = МодульОбъекта().Тариф(Организация);
	
	Для Каждого Элемент Из СоответствиеКомандИТиповОперацийДляПодписок() Цикл
		
		Команда = Элемент.Ключ;
		ТипОперации = Элемент.Значение;
		
		Если ТипОперации = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если МодульОбъекта().СозданиеОперацииОграниченоТарифом(ТипОперации, ОписаниеТарифа) Тогда
			Команда.Картинка = БиблиотекаКартинок.КонтурМаркировка_Замок;
		Иначе
			Команда.Картинка = Новый Картинка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоответствиеКомандИТиповОперацийДляПодписок()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Команды.Коды_Заказать,                      ТипыОпераций.ЗаказКодов);
	
	Результат.Вставить(Команды.Коды_СоздатьОтчетОНанесении,        ТипыОпераций.ОтчетОНанесении);
	Результат.Вставить(Команды.Коды_НаполнитьОтчетОНанесенииНаТСД, ТипыОпераций.ОтчетОНанесенииНаТСД);
	
	Результат.Вставить(Команды.Коды_ВыполнитьВводВОборот,          ТипыОпераций.ВводВОборот);
	Результат.Вставить(Команды.Коды_ВывестиИзОборота,              ТипыОпераций.ВыводИзОборота);
	
	Результат.Вставить(Команды.Коды_ВернутьВОборот,                ТипыОпераций.ВозвратВОборот);
	Результат.Вставить(Команды.Коды_НаполнитьВозвратВОборотНаТСД,  ТипыОпераций.ВозвратВОборотНаТСД);
	
	Результат.Вставить(Команды.Коды_НаполнитьНаборыНаТСД,          ТипыОпераций.НаполнениеНаборовНаТСД);
	Результат.Вставить(Команды.Коды_ЗарегистрироватьНаборы,        ТипыОпераций.РегистрацияНаборов);
	Результат.Вставить(Команды.Коды_РасформироватьНаборы,          ТипыОпераций.РасформированиеНаборов);
	
	Результат.Вставить(Команды.Коды_Агрегировать,                  ТипыОпераций.АгрегацияКодов);
	Результат.Вставить(Команды.Коды_ЗарегистрироватьКИТУ,          ТипыОпераций.РегистрацияАгрегатов);
	Результат.Вставить(Команды.Коды_Разагрегировать,               ТипыОпераций.РасформированиеАгрегатов);
	Результат.Вставить(Команды.Коды_НаполнитьАгрегатыНаТСД,        ТипыОпераций.НаполнениеАгрегатовНаТСД);
	
	Результат.Вставить(Команды.Коды_АгрегироватьКИГУ,              ТипыОпераций.ФормированиеКИГУ);
	Результат.Вставить(Команды.Коды_НаполнитьКИГУНаТСД,            ТипыОпераций.НаполнениеКИГУНаТСД);
	Результат.Вставить(Команды.Коды_ЗарегистрироватьКИГУ,          ТипыОпераций.РегистрацияКИГУ);
	
	Результат.Вставить(Команды.Коды_СформироватьАТК,               ТипыОпераций.ФормированиеАТК);
	Результат.Вставить(Команды.Коды_РасформироватьАТК,             ТипыОпераций.РасформированиеАТК);
	
	Результат.Вставить(Команды.Коды_СоздатьОтчетОВыбытии,          ТипыОпераций.ОтчетОВыбытии);
	Результат.Вставить(Команды.Коды_НаполнитьОтчетОВыбытииНаТСД,   ТипыОпераций.ОтчетОВыбытииНаТСД);
	
	Результат = Новый ФиксированноеСоответствие(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСпискиВыбораЭлементовФормы()
	
	ЗаполнитьСписокВыбораПравилаОтраженияВЭДО();
	ЗаполнитьСписокВыбораВидКорректировки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПравилаОтраженияВЭДО()
	
	СписокВыбора = Элементы.ТоварыОтражениеВЭДО.СписокВыбора;
	ПравилаОтражения = МодульОбъекта().Перечисление_ПравилаОтраженияВЭДО();
	
	ЗначенияСписка = Новый Массив;
	ЗначенияСписка.Добавить(ПравилаОтражения.ОСУ);
	ЗначенияСписка.Добавить(ПравилаОтражения.ПУ);
	ЗначенияСписка.Добавить(ПравилаОтражения.ПартионныйУчет);
	ЗначенияСписка.Добавить(ПравилаОтражения.НеОтражать);
	
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВидКорректировки()
	
	СписокВыбора = Элементы.ВидКорректировки.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, МодульОбъекта().Перечисление_ВидыКорректировкиДокумента());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УстановитьОформлениеАгрегаты();
	УстановитьОформлениеКодыМаркировки();
	УстановитьОформлениеТоварыДокумента();
	УстановитьОформлениеТоварыМаркировки();
	УстановитьОформлениеОперацииТребуемоеДействие();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыДокумента()
	
	ТаблицаФормы = Элементы.ТоварыДокумента;
	
	УсловноеОформление_ТоварыДокумента_ТоварНеПодлежитМаркировке(ТаблицаФормы);
	МодульОбъекта().УсловноеОформление_Товары_ТребуетсяЗСН(УсловноеОформление, ТаблицаФормы);
	МодульОбъекта().УсловноеОформление_Товары_НеТребуетсяЗСН(УсловноеОформление, ТаблицаФормы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыМаркировки()
	
	ТаблицаФормы = Элементы.ТоварыМаркировки;
	
	УсловноеОформление_ТоварыМаркировки_НеДоступенПартионныйУчет(ТаблицаФормы);
	УсловноеОформление_ТоварыМаркировки_НеДоступенПеременныйВес(ТаблицаФормы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеАгрегаты()
	
	ТаблицаФормы = Элементы.Агрегаты;
	
	УсловноеОформление_Агрегаты_ТолькоПросмотр_СтрокаДокумента(ТаблицаФормы);
	УсловноеОформление_Агрегаты_ПустыеПоляНаУровнеТовара(ТаблицаФормы);
	УсловноеОформление_Агрегаты_АвтоРаспределение(ТаблицаФормы);
	УсловноеОформление_Агрегаты_РезультатыПроверки(ТаблицаФормы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеКодыМаркировки()
	
	ТаблицаФормы = Элементы.КодыМаркировки;
	
	УсловноеОформление_КодыМаркировки_РезультатыПроверки(ТаблицаФормы);
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_КодыМаркировки_РезультатыПроверки(ТаблицаФормы)
	
	РезультатыПроверкиКодов = МодульОбъекта().Перечисление_РезультатыПроверкиКодовДокументов();
	
	Для Каждого ТипПроверки Из МодульОбъекта().Перечисление_ИменаПолейРезультатовПроверкиКодов() Цикл
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ТипПроверки);
		
		ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + "." + ТипПроверки);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = РезультатыПроверкиКодов.НеТребуется;
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоСерый);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_ТоварыДокумента_ТоварНеПодлежитМаркировке(ТаблицаФормы)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя);
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".НеПодлежитМаркировке");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(240, 240, 240));
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_ТоварыМаркировки_НеДоступенПартионныйУчет(ТаблицаФормы)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыМаркировкиНомерПартии");
	
	ГруппаИли = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ЭлементОтбора = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ДоступенПартионныйУчет");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементОтбора = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ТоварыДокумента.Имя + ".ОтражениеВЭДО");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = МодульОбъекта().Перечисление_ПравилаОтраженияВЭДО().ПартионныйУчет;
	
	МодульОбъекта().УсловноеОформление_УстановитьТекстНеТребуется(ЭлементУО);
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_ТоварыМаркировки_НеДоступенПеременныйВес(ТаблицаФормы)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыМаркировкиКоличество");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ПеременныйВес");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	МодульОбъекта().УсловноеОформление_УстановитьТекстНеТребуется(ЭлементУО);
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_Агрегаты_ТолькоПросмотр_СтрокаДокумента(ТаблицаФормы)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыСтрокаДокумента");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".УровеньАгрегата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_Агрегаты_ПустыеПоляНаУровнеТовара(ТаблицаФормы)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыКодМаркировки");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыСтатусКода");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыОсобоеСостояниеКода");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыВладелец");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыНапечатан");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыСтрокаДокумента");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыПроверкаРД");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыПроверкаВладельца");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыПроверкаСтатуса");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыДопПроверка1");
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыДопПроверка2");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".УровеньАгрегата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_Агрегаты_АвтоРаспределение(ТаблицаФормы)
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("АгрегатыСтрокаДокумента");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".УровеньАгрегата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".СтрокаДокумента");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<Авто>");
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление_Агрегаты_РезультатыПроверки(ТаблицаФормы)
	
	РезультатыПроверкиКодов = МодульОбъекта().Перечисление_РезультатыПроверкиКодовДокументов();
	
	Для Каждого ТипПроверки Из МодульОбъекта().Перечисление_ИменаПолейРезультатовПроверкиКодов() Цикл
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		ЭлементУО.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ТипПроверки);
		
		ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".УровеньАгрегата");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Истина;
		
		ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + "." + ТипПроверки);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = РезультатыПроверкиКодов.НеТребуется;
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоСерый);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеОперацииТребуемоеДействие()
	
	ТаблицаФормы = Элементы.СписокОпераций;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОперацииТребуемоеДействие");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".Активная");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТусклоСерый);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКнопкуОбновленияСтатусовКодов(ОбновлениеСтатусовВыполняется)
	
	Если ОбновлениеСтатусовВыполняется Тогда
		ЗаголовокКнопки = НСтр("ru = 'Обновляются статусы кодов...'");
		ДоступностьКнопки = Ложь;
	Иначе
		ЗаголовокКнопки = НСтр("ru = 'Обновить статусы кодов'");
		ДоступностьКнопки = Истина;
	КонецЕсли;
	
	Элементы.Кнопка_ОбновитьСтатусыКодов.Заголовок = ЗаголовокКнопки;
	Элементы.Кнопка_ОбновитьСтатусыКодов1.Заголовок = ЗаголовокКнопки;
	
	Элементы.Кнопка_ОбновитьСтатусыКодов.Доступность = ДоступностьКнопки;
	Элементы.Кнопка_ОбновитьСтатусыКодов1.Доступность = ДоступностьКнопки;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКнопкуПроверкиКодов(ПроверкаКодовВыполняется)
	
	Кнопка = Элементы.Кнопка_ПроверитьКоды;
	
	Если ПроверкаКодовВыполняется Тогда
		ЗаголовокКнопки = НСтр("ru = 'Выполняется проверка кодов...'");
		ДоступностьКнопки = Ложь;
	Иначе
		ЗаголовокКнопки = НСтр("ru = 'Проверить коды'");
		ДоступностьКнопки = Истина;
	КонецЕсли;
	
	Кнопка.Заголовок = ЗаголовокКнопки;
	Кнопка.Доступность = ДоступностьКнопки;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокКодыМаркировки()
	
	КодыМаркировки.ТекстЗапроса = ТекстЗапросаКодыМаркировки();
	
	РезультатыПроверкиКодов = МодульОбъекта().Перечисление_РезультатыПроверкиКодовДокументов();
	
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ПустаяДата", '00010101');
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ДокументУчета", Ссылка);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ПоказатьСписанные", Не Элементы.Кнопка_СкрытьСписанныеКоды.Пометка);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ПустойКонтрагент", Справочники.КонтурМаркировка_Контрагенты.ПустаяСсылка());
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("СтатусКода_Списан", МодульОбъекта().Перечисление_СтатусыКодов().Списан);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("Проверен", РезультатыПроверкиКодов.Проверен);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("НеТребуется", РезультатыПроверкиКодов.НеТребуется);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиКодовИАгрегатов()
	
	ОбновитьСписокКодовМаркировки();
	ОбновитьСписокАгрегатов();
	
	ЗаполнитьКоличествоКодовПоСтатусам();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокКодовМаркировки()
	
	ЗаполнитьКоличествоКодов();
	ЗаполнитьКоличествоЗаводскихСерийныхНомеров();
	
	Элементы.КодыМаркировки.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокАгрегатовПослеОткрытияВкладки() Экспорт
	
	ОбновитьСписокАгрегатов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокАгрегатов()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КодыДокументов.КлючКода КАК КлючКода,
	|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	КодыДокументов.КлючСтрокиДокумента КАК КлючСтрокиДокумента,
	|	КодыДокументов.КлючПроверкиКода КАК КлючПроверкиКода,
	|	ИнформацияОКодах.Товар КАК Товар,
	|	ИнформацияОКодах.КлючНоменклатуры1С КАК КлючНоменклатуры1С,
	|	ИнформацияОКодах.ДатаПечати КАК ДатаПечати,
	|	КодыМаркировки.КлючСтатусаКода КАК КлючСтатусаКода,
	|	КодыМаркировки.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ТабКодов
	|ИЗ
	|	РегистрСведений.КонтурМаркировка_ИнформацияОКодах КАК ИнформацияОКодах
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_КодыМаркировки КАК КодыМаркировки
	|		ПО ИнформацияОКодах.КлючИнформацииОКоде = КодыМаркировки.КлючИнформацииОКоде
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_КодыДокументов КАК КодыДокументов
	|		ПО (КодыМаркировки.КлючКода = КодыДокументов.КлючКода)
	|			И (КодыДокументов.ДокументУчета = &ДокументУчета)
	|ГДЕ
	|	ИнформацияОКодах.ОбщийТипУпаковки = &ТранспортнаяУпаковка
	|	И КодыДокументов.КлючКода ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДокумента.ПредставлениеСтроки КАК СтрокаДокумента,
	|	ТабКодов.КодМаркировки КАК КодМаркировки,
	|	ЕСТЬNULL(ТоварыАгрегатов.Товар, ТабКодов.Товар) КАК Товар,
	|	ЕСТЬNULL(ТоварыАгрегатов.КлючНоменклатуры1С, ТабКодов.КлючНоменклатуры1С) КАК КлючНоменклатуры1С,
	|	ЕСТЬNULL(ТоварыАгрегатов.КоличествоУпаковок, ТабКодов.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	ТабКодов.КлючКода КАК КлючКода,
	|	ТабКодов.КлючСтрокиДокумента КАК КлючСтрокиДокумента,
	|	СтатусыКодов.Владелец КАК Владелец,
	|	СтатусыКодов.Статус КАК СтатусКода,
	|	СтатусыКодов.ОсобоеСостояниеКода КАК ОсобоеСостояниеКода,
	|	ВЫБОР
	|		КОГДА ТабКодов.ДатаПечати > &ПустаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Напечатан,
	|	ЛОЖЬ КАК УровеньАгрегата,
	|	ВЫБОР
	|		КОГДА ТоварыДокумента.КлючСтрокиДокумента ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьСтрокаДокумента,
	|	РезультатыПроверкиКодов.ПроверкаРД КАК ПроверкаРД,
	|	ВЫБОР
	|		КОГДА РезультатыПроверкиКодов.ПроверкаРД ЕСТЬ NULL
	|				ИЛИ РезультатыПроверкиКодов.ПроверкаРД = &НеТребуется
	|			ТОГДА -1
	|		КОГДА РезультатыПроверкиКодов.ПроверкаРД = &Проверен
	|			ТОГДА 4
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинкиПроверкаРД,
	|	РезультатыПроверкиКодов.ПроверкаСтатуса КАК ПроверкаСтатуса,
	|	ВЫБОР
	|		КОГДА РезультатыПроверкиКодов.ПроверкаСтатуса ЕСТЬ NULL
	|				ИЛИ РезультатыПроверкиКодов.ПроверкаСтатуса = &НеТребуется
	|			ТОГДА -1
	|		КОГДА РезультатыПроверкиКодов.ПроверкаСтатуса = &Проверен
	|			ТОГДА 4
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинкиПроверкаСтатуса,
	|	РезультатыПроверкиКодов.ПроверкаВладельца КАК ПроверкаВладельца,
	|	ВЫБОР
	|		КОГДА РезультатыПроверкиКодов.ПроверкаВладельца ЕСТЬ NULL
	|				ИЛИ РезультатыПроверкиКодов.ПроверкаВладельца = &НеТребуется
	|			ТОГДА -1
	|		КОГДА РезультатыПроверкиКодов.ПроверкаВладельца = &Проверен
	|			ТОГДА 4
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинкиПроверкаВладельца,
	|	РезультатыПроверкиКодов.ДопПроверка1 КАК ДопПроверка1,
	|	ВЫБОР
	|		КОГДА РезультатыПроверкиКодов.ДопПроверка1 ЕСТЬ NULL
	|				ИЛИ РезультатыПроверкиКодов.ДопПроверка1 = &НеТребуется
	|			ТОГДА -1
	|		КОГДА РезультатыПроверкиКодов.ДопПроверка1 = &Проверен
	|			ТОГДА 4
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинкиДопПроверка1,
	|	РезультатыПроверкиКодов.ДопПроверка2 КАК ДопПроверка2,
	|	ВЫБОР
	|		КОГДА РезультатыПроверкиКодов.ДопПроверка2 ЕСТЬ NULL
	|				ИЛИ РезультатыПроверкиКодов.ДопПроверка2 = &НеТребуется
	|			ТОГДА -1
	|		КОГДА РезультатыПроверкиКодов.ДопПроверка2 = &Проверен
	|			ТОГДА 4
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинкиДопПроверка2
	|ИЗ
	|	ТабКодов КАК ТабКодов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурМаркировка_ДокументыУчета.ТоварыДокумента КАК ТоварыДокумента
	|		ПО ТабКодов.КлючСтрокиДокумента = ТоварыДокумента.КлючСтрокиДокумента
	|			И (ТоварыДокумента.Ссылка = &ДокументУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ТоварыАгрегатов КАК ТоварыАгрегатов
	|		ПО ТабКодов.КлючКода = ТоварыАгрегатов.КлючКода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыКодовГИСМТ КАК СтатусыКодов
	|		ПО ТабКодов.КлючСтатусаКода = СтатусыКодов.КлючСтатусаКода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_РезультатыПроверкиКодов КАК РезультатыПроверкиКодов
	|		ПО ТабКодов.КлючПроверкиКода = РезультатыПроверкиКодов.КлючПроверкиКода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕстьСтрокаДокумента УБЫВ,
	|	СтрокаДокумента,
	|	КодМаркировки
	|ИТОГИ
	|	МАКСИМУМ(СтрокаДокумента),
	|	МАКСИМУМ(КодМаркировки),
	|	СУММА(КоличествоУпаковок),
	|	МАКСИМУМ(КлючСтрокиДокумента),
	|	МАКСИМУМ(Владелец),
	|	МАКСИМУМ(СтатусКода),
	|	МАКСИМУМ(ОсобоеСостояниеКода),
	|	МАКСИМУМ(Напечатан),
	|	МАКСИМУМ(ЕстьСтрокаДокумента),
	|	МАКСИМУМ(ПроверкаРД),
	|	МАКСИМУМ(ИндексКартинкиПроверкаРД),
	|	МАКСИМУМ(ПроверкаСтатуса),
	|	МАКСИМУМ(ИндексКартинкиПроверкаСтатуса),
	|	МАКСИМУМ(ПроверкаВладельца),
	|	МАКСИМУМ(ИндексКартинкиПроверкаВладельца),
	|	МАКСИМУМ(ДопПроверка1),
	|	МАКСИМУМ(ИндексКартинкиДопПроверка1),
	|	МАКСИМУМ(ДопПроверка2),
	|	МАКСИМУМ(ИндексКартинкиДопПроверка2)
	|ПО
	|	КлючКода");
	
	РезультатыПроверкиКодов = МодульОбъекта().Перечисление_РезультатыПроверкиКодовДокументов();
	
	Запрос.УстановитьПараметр("ДокументУчета", Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата", МодульОбъекта().ПустаяДата());
	Запрос.УстановитьПараметр("ТранспортнаяУпаковка", Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ТранспортнаяУпаковка);
	Запрос.УстановитьПараметр("НеТребуется", РезультатыПроверкиКодов.НеТребуется);
	Запрос.УстановитьПараметр("Проверен", РезультатыПроверкиКодов.Проверен);
	
	АгрегатыСТоварами = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Для Каждого СтрАгрегата Из АгрегатыСТоварами.Строки Цикл
		СтрАгрегата.УровеньАгрегата = Истина;
		
		Для Каждого СтрТовара Из СтрАгрегата.Строки Цикл
			
			СтрТовара.ИндексКартинкиПроверкаРД = -1;
			СтрТовара.ИндексКартинкиПроверкаСтатуса = -1;
			СтрТовара.ИндексКартинкиПроверкаВладельца = -1;
			СтрТовара.ИндексКартинкиДопПроверка1 = -1;
			СтрТовара.ИндексКартинкиДопПроверка2 = -1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(АгрегатыСТоварами, "Агрегаты");
	
	ПосчитатьКоличествоСтрокТаблицФормы();
	ЗаполнитьКоличествоКодов();
	
	СписокАгрегатовЗаполнен = Истина;
	
КонецПроцедуры

&НаСервере
Функция СоответствиеЭлементовИКомандДокументов()
	
	НаборКоманд = МодульОбъекта().Перечисление_КомандыДокумента();
	
	Результат = Новый Соответствие;
	Результат.Вставить("Кнопка_ЗаказатьКоды",         НаборКоманд.ЗаказКодов);
	Результат.Вставить("Кнопка_ПодобратьКодыИзПула",  НаборКоманд.ПодборСвободныхОстатков);
	Результат.Вставить("Кнопка_НаполнитьКодамиНаТСД", НаборКоманд.НаполнитьНаТСД);
	
	Результат.Вставить("Кнопка_НаполнитьКодамиНаТСДНачатьРаботу",               НаборКоманд.НаполнитьНаТСДНачатьРаботу);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзВнешнегоИсточникаНачатьРаботу", НаборКоманд.НаполнитьКодамиИзВнешнегоИсточникаНачатьРаботу);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзДругогоДокументаНачатьРаботу",  НаборКоманд.НаполнитьКодамиИзДругогоДокументаНачатьРаботу);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзФайловНачатьРаботу",            НаборКоманд.НаполнитьКодамиИзФайловНачатьРаботу);
	
	Результат.Вставить("Кнопка_НаполнитьКодамиИзВнешнегоИсточника",    НаборКоманд.НаполнитьКодамиИзВнешнегоИсточника);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзДругогоДокумента",     НаборКоманд.НаполнитьКодамиИзДругогоДокумента);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзДокументаОснования",   НаборКоманд.НаполнитьКодамиИзОснования);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзВходящегоУПД",         НаборКоманд.НаполнитьКодамиИзВходящегоУПД);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзФайлов",               НаборКоманд.НаполнитьКодамиИзФайлов);
	Результат.Вставить("Кнопка_НаполнитьКодамиИзТабличногоДокумента",  НаборКоманд.НаполнитьКодамиИзТабличногоДокумента);
	Результат.Вставить("Кнопка_НаполнитьКодамиСПомощьюСканера",        НаборКоманд.НаполнитьКодамиСПомощьюСканера);
	Результат.Вставить("Кнопка_НаполнитьАгрегамиИзДокументаОснования", НаборКоманд.НаполнитьАгрегатамиИзОснования);
	
	Результат.Вставить("Кнопка_ЗаполнитьПартииИзКодов",        НаборКоманд.ЗаполнитьПартииИзКодов);
	Результат.Вставить("Кнопка_ЗаполнитьПартииИзВходящегоУПД", НаборКоманд.ЗаполнитьПартииИзВходящегоУПД);
	
	Результат.Вставить("Кнопка_КорректироватьСведения",   НаборКоманд.КорректировкаСведений);
	Результат.Вставить("Кнопка_УведомитьОСостоянииКодов", НаборКоманд.УведомлениеОСостоянииКодов);
	
	Результат.Вставить("Кнопка_НапечататьЭтикетки",  НаборКоманд.ПечатьКодов);
	Результат.Вставить("Кнопка_НапечататьЭтикетки1", НаборКоманд.ПечатьКодов);
	
	Результат.Вставить("Кнопка_СоздатьОтчетОНанесении",         НаборКоманд.ОтчетОНанесении);
	Результат.Вставить("Кнопка_СоздатьОтчетОНанесении1",        НаборКоманд.ОтчетОНанесении);
	Результат.Вставить("Кнопка_НаполнитьОтчетОНанесенииНаТСД",  НаборКоманд.ОтчетОНанесенииНаТСД);
	Результат.Вставить("Кнопка_НаполнитьОтчетОНанесенииНаТСД1", НаборКоманд.ОтчетОНанесенииНаТСД);
	
	Результат.Вставить("Кнопка_ВвестиВОборот",  НаборКоманд.ВводВоборот);
	Результат.Вставить("Кнопка_ВвестиВОборот1", НаборКоманд.ВводВоборот);
	
	Результат.Вставить("Кнопка_ВывестиИзОборота",  НаборКоманд.ВыводИзОборота);
	Результат.Вставить("Кнопка_ВывестиИзОборота1", НаборКоманд.ВыводИзОборота);
	
	Результат.Вставить("Кнопка_ВернутьВОборот",  НаборКоманд.ВозвратВОборот);
	Результат.Вставить("Кнопка_ВернутьВОборот1", НаборКоманд.ВозвратВОборот);
	
	Результат.Вставить("Кнопка_НаполнитьВозвратВОборотНаТСД",  НаборКоманд.ВозвратВОборотНаТСД);
	Результат.Вставить("Кнопка_НаполнитьВозвратВОборотНаТСД1", НаборКоманд.ВозвратВОборотНаТСД);
	
	Результат.Вставить("Кнопка_СоздатьОтчетОВыбытии",         НаборКоманд.ОтчетОВыбытии);
	Результат.Вставить("Кнопка_СоздатьОтчетОВыбытии1",        НаборКоманд.ОтчетОВыбытии);
	Результат.Вставить("Кнопка_НаполнитьОтчетОВыбытииНаТСД",  НаборКоманд.ОтчетОВыбытииНаТСД);
	Результат.Вставить("Кнопка_НаполнитьОтчетОВыбытииНаТСД1", НаборКоманд.ОтчетОВыбытииНаТСД);
	
	Результат.Вставить("Кнопка_АгрегироватьКоды",        НаборКоманд.АгрегацияКоды);
	Результат.Вставить("Кнопка_АгрегироватьКоды1",       НаборКоманд.АгрегацияКоды);
	Результат.Вставить("Кнопка_ЗарегистрироватьКИТУ",    НаборКоманд.ЗарегистрироватьКИТУ);
	Результат.Вставить("Кнопка_ЗарегистрироватьКИТУ1",   НаборКоманд.ЗарегистрироватьКИТУ);
	Результат.Вставить("Кнопка_РасформироватьКИТУ",      НаборКоманд.РасформироватьКИТУ);
	Результат.Вставить("Кнопка_РасформироватьКИТУ1",     НаборКоманд.РасформироватьКИТУ);
	Результат.Вставить("Кнопка_НаполнитьАгрегатыНаТСД",  НаборКоманд.НаполнитьАгрегатыНаТСД);
	Результат.Вставить("Кнопка_НаполнитьАгрегатыНаТСД1", НаборКоманд.НаполнитьАгрегатыНаТСД);
	
	Результат.Вставить("Кнопка_РасформироватьНаборы",   НаборКоманд.РасформироватьНаборы);
	Результат.Вставить("Кнопка_НаполнитьНаборыНаТСД",   НаборКоманд.НаполнитьНаборыНаТСД);
	Результат.Вставить("Кнопка_ЗарегистрироватьНаборы", НаборКоманд.ЗарегистрироватьНаборы);
	
	Результат.Вставить("Кнопка_АгрегироватьКИГУ",     НаборКоманд.АгрегироватьКИГУ);
	Результат.Вставить("Кнопка_НаполнитьКИГУНаТСД",   НаборКоманд.НаполнитьКИГУНаТСД);
	Результат.Вставить("Кнопка_ЗарегистрироватьКИГУ", НаборКоманд.ЗарегистрироватьКИГУ);
	
	Результат.Вставить("Кнопка_СформироватьАТК",   НаборКоманд.СформироватьАТК);
	Результат.Вставить("Кнопка_РасформироватьАТК", НаборКоманд.РасформироватьАТК);
	
	Результат.Вставить("Кнопка_СохранитьКодыВФайлCSV",  НаборКоманд.СохранитьКодыВФайлCSV);
	Результат.Вставить("Кнопка_СохранитьКодыВФайлCSV1", НаборКоманд.СохранитьКодыВФайлCSV);
	Результат.Вставить("Кнопка_СохранитьКодыВФайлXLS",  НаборКоманд.СохранитьКодыВФайлXLS);
	Результат.Вставить("Кнопка_СохранитьКодыВФайлXLS1", НаборКоманд.СохранитьКодыВФайлXLS);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборПоказатьСписанныеКодыМаркировки()
	
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ПоказатьСписанные"
	, Не Элементы.Кнопка_СкрытьСписанныеКоды.Пометка);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьЭлементовФормы(ПриСозданииНаСервере = Ложь)
	
	Если ПриСозданииНаСервере Тогда
		
		Если МодульОбъекта().ДокументУчета_ЕстьРолиДляОтраженияВЭДО(Ссылка) Тогда
			Элементы.ТоварыОтражениеВЭДО.Видимость = Истина;
		КонецЕсли;
		
		Если МодульОбъекта().ДокументУчета_ЕстьРольКорректировкаОтгрузки(Ссылка) Тогда
			Элементы.ГруппаКорректировка.Видимость = Истина;
			Элементы.Кнопка_НаполнитьКодамиИзИсправляемогоДокумента.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	СтатусыДокументовУчета = МодульОбъекта().Перечисление_СтатусыДокументовУчета();
	
	Элементы.ГруппаИтого.Видимость = ЗначениеЗаполнено(ИтогоПоСтатусам);
	
	Элементы.ТоварыНоменклатура.Ширина = 10;
	
	Элементы.Документ1С.Видимость = ЗначениеЗаполнено(Документ1С);
	Элементы.ГруппаЭтапыМаркировки.Видимость = ЗначениеЗаполнено(МаршрутМаркировки);
	
	ТребуютсяЗСН = ТоварыДокумента_ТребуютсяЗаводскиеСерийныеНомера();
	ДоступенПартионныйУчет = ТоварыМаркировки_ДоступенПартионныйУчет() И МодульОбъекта().ДокументУчета_ЕстьРолиДляПартионногоУчета(Ссылка);
	ВключенПартионныйУчет = ТоварыДокумента_ЕстьОтражениеВЭДОПартионныйУчет();
	ЕстьПеременныйВес = ТоварыМаркировки_ЕстьПеременныйВес();
	
	УстановитьТолькоПросмотр(Ложь);
	
	Если Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Новый Тогда
		
		Элементы.Кнопка_НачатьРаботу.КнопкаПоУмолчанию		= Истина;
		Элементы.Кнопка_НачатьРаботу.Видимость				= Истина;
		
		Элементы.Кнопка_Перезаполнить.Видимость				= ЗначениеЗаполнено(Документ1С);
		Элементы.Кнопка_НеПодлежитМаркировке.Видимость		= Истина;
		Элементы.Кнопка_ЗавершитьРаботу.Видимость			= Ложь;
		Элементы.Кнопка_Записать.Видимость					= Истина;
		Элементы.Кнопка_ВозобновитьРаботу.Видимость			= Ложь;
		
		Элементы.ДекорацияУстановитьЭтапВручную.Доступность = Истина;
		Элементы.ДекорацияУстановитьЭтапВручную82.Доступность = Истина;
		
		Элементы.ГруппаТоваровМаркировки.ТолькоПросмотр = Ложь;
		Элементы.ТоварыМаркировкиГруппаКнопок.Доступность = Истина;
		
		Элементы.Закладка_Операции.Видимость = Ложь;
		
		Элементы.Меню_ПодобратьКодыНачатьРаботу.Видимость = Истина;
		Элементы.Меню_ЗаполнитьПартии.Видимость = Ложь;
		Элементы.Меню_ПодобратьКоды.Видимость = Ложь;
		Элементы.Меню_УдалитьКоды.Видимость = Ложь;
		Элементы.Кнопка_ВыполнитьОбмен.Видимость = Ложь;
		Элементы.Кнопка_ОбновитьЗадачи.Видимость = Ложь;
		Элементы.Закладка_КодыМаркировки.Видимость = Ложь;
		Элементы.Закладка_Агрегаты.Видимость = Ложь;
		Элементы.Кнопка_СообщитьОбОтгрузке.Видимость = Ложь;
		Элементы.ТоварыКоличествоКодов.Видимость = Ложь;
		Элементы.ТоварыКоличествоУпаковок.ТолькоПросмотр = Ложь;
		Элементы.ТоварыКоличествоЗСН.Видимость = Ложь;
		Элементы.КодыМаркировкиЗаводскойСерийныйНомер.Видимость = Ложь;
		Элементы.КодыМаркировкиНомерПартии.Видимость = ДоступенПартионныйУчет;
		Элементы.Кнопка_ДобавитьЗСН.Видимость = Ложь;
		Элементы.ТоварыМаркировкиНомерПартии.Видимость = Ложь;
		Элементы.ТоварыМаркировкиКоличество.Видимость = Ложь;
		Элементы.Кнопка_ПроверитьКоды.Видимость = Ложь;
		
	ИначеЕсли Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Пропущен Тогда
		
		Элементы.Кнопка_НачатьРаботу.Видимость = Ложь;
		Элементы.Кнопка_Перезаполнить.Видимость = Ложь;
		Элементы.Кнопка_НеПодлежитМаркировке.Видимость = Ложь;
		Элементы.Кнопка_ЗавершитьРаботу.Видимость = Ложь;
		Элементы.Кнопка_Записать.Видимость = Ложь;
		Элементы.Кнопка_ВозобновитьРаботу.Видимость = Истина;
		
		Элементы.ДекорацияУстановитьЭтапВручную.Доступность = Ложь;
		Элементы.ДекорацияУстановитьЭтапВручную82.Доступность = Ложь;
		
		Элементы.ГруппаТоваровМаркировки.ТолькоПросмотр = Истина;
		Элементы.ТоварыМаркировкиГруппаКнопок.Доступность = Ложь;
		
		Элементы.Закладка_Операции.Видимость = Ложь;
		
		Элементы.Меню_ПодобратьКодыНачатьРаботу.Видимость = Ложь;
		Элементы.Меню_ЗаполнитьПартии.Видимость = Ложь;
		Элементы.Меню_ПодобратьКоды.Видимость = Ложь;
		Элементы.Меню_УдалитьКоды.Видимость = Ложь;
		Элементы.Кнопка_ВыполнитьОбмен.Видимость = Ложь;
		Элементы.Кнопка_ОбновитьЗадачи.Видимость = Ложь;
		Элементы.Закладка_КодыМаркировки.Видимость = Ложь;
		Элементы.Закладка_Агрегаты.Видимость = Ложь;
		Элементы.Кнопка_СообщитьОбОтгрузке.Видимость = Ложь;
		Элементы.ТоварыКоличествоКодов.Видимость = Ложь;
		Элементы.ТоварыКоличествоУпаковок.ТолькоПросмотр = Ложь;
		Элементы.ТоварыКоличествоЗСН.Видимость = Ложь;
		Элементы.КодыМаркировкиЗаводскойСерийныйНомер.Видимость = Ложь;
		Элементы.Кнопка_ДобавитьЗСН.Видимость = Ложь;
		Элементы.ТоварыМаркировкиНомерПартии.Видимость = Ложь;
		Элементы.ТоварыМаркировкиКоличество.Видимость = Ложь;
		Элементы.Кнопка_ПроверитьКоды.Видимость = Ложь;
		
	ИначеЕсли Статусы.ОсновнойСтатус = СтатусыДокументовУчета.ВРаботе Тогда
		
		Элементы.Кнопка_НачатьРаботу.Видимость				= Ложь;
		Элементы.Кнопка_Перезаполнить.Видимость				= ЗначениеЗаполнено(Документ1С);
		Элементы.Кнопка_НеПодлежитМаркировке.Видимость 		= Ложь;
		Элементы.Кнопка_ЗавершитьРаботу.Видимость			= Истина;
		Элементы.Кнопка_Записать.Видимость					= Истина;
		Элементы.Кнопка_ВозобновитьРаботу.Видимость			= Ложь;
		
		Элементы.ДекорацияУстановитьЭтапВручную.Доступность = Истина;
		Элементы.ДекорацияУстановитьЭтапВручную82.Доступность = Истина;
		
		Элементы.Кнопка_ЗавершитьРаботу.КнопкаПоУмолчанию = Истина;
		
		Элементы.КодыМаркировки.ТолькоПросмотр = Ложь;
		
		Элементы.ГруппаТоваровМаркировки.ТолькоПросмотр = Ложь;
		Элементы.ТоварыМаркировкиГруппаКнопок.Доступность = Истина;
		
		Элементы.Закладка_Операции.Видимость = Истина;
		
		Элементы.Меню_ПодобратьКодыНачатьРаботу.Видимость = Ложь;
		Элементы.Меню_ПодобратьКоды.Видимость = Истина;
		Элементы.Меню_ЗаполнитьПартии.Видимость = ДоступенПартионныйУчет;
		Элементы.Меню_УдалитьКоды.Видимость = Истина;
		Элементы.Кнопка_ВыполнитьОбмен.Видимость = Истина;
		Элементы.Кнопка_ОбновитьЗадачи.Видимость = Истина;
		Элементы.Закладка_КодыМаркировки.Видимость = Истина;
		Элементы.Закладка_Агрегаты.Видимость = Истина;
		Элементы.ТоварыКоличествоКодов.Видимость = Истина;
		Элементы.ТоварыКоличествоУпаковок.ТолькоПросмотр = Истина;
		Элементы.Меню_ОперацииСКодами.Видимость = Истина;
		Элементы.Меню_ОперацииСАгрегатами.Видимость = Истина;
		Элементы.КодыМаркировкиЗаводскойСерийныйНомер.Видимость = ТребуютсяЗСН;
		Элементы.ТоварыКоличествоЗСН.Видимость = ТребуютсяЗСН;
		Элементы.Кнопка_ДобавитьЗСН.Видимость = ТребуютсяЗСН;
		Элементы.ТоварыМаркировкиНомерПартии.Видимость = ДоступенПартионныйУчет И ВключенПартионныйУчет;
		Элементы.ТоварыМаркировкиКоличество.Видимость = ДоступенПартионныйУчет И ВключенПартионныйУчет И ЕстьПеременныйВес;
		Элементы.КодыМаркировкиНомерПартии.Видимость = ДоступенПартионныйУчет;
		
	ИначеЕсли Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Завершен Тогда
		
		УстановитьТолькоПросмотр(Истина);
		
		Элементы.Кнопка_НачатьРаботу.Видимость = Ложь;
		Элементы.Кнопка_Перезаполнить.Видимость = Ложь;
		Элементы.Кнопка_НеПодлежитМаркировке.Видимость = Ложь;
		Элементы.Кнопка_ЗавершитьРаботу.Видимость = Ложь;
		Элементы.Кнопка_Записать.Видимость = Ложь;
		Элементы.Кнопка_ВозобновитьРаботу.Видимость = Истина;
		
		Элементы.ДекорацияУстановитьЭтапВручную.Доступность = Ложь;
		Элементы.ДекорацияУстановитьЭтапВручную82.Доступность = Ложь;
		
		Элементы.КодыМаркировки.ТолькоПросмотр = Истина;
		
		Элементы.ГруппаТоваровМаркировки.ТолькоПросмотр = Истина;
		Элементы.ТоварыМаркировкиГруппаКнопок.Доступность = Ложь;
		Элементы.ТоварыКоличествоЗСН.Видимость = ТребуютсяЗСН;
		Элементы.КодыМаркировкиЗаводскойСерийныйНомер.Видимость = ТребуютсяЗСН;
		Элементы.ТоварыМаркировкиНомерПартии.Видимость = ДоступенПартионныйУчет И ВключенПартионныйУчет;
		Элементы.ТоварыМаркировкиКоличество.Видимость = ДоступенПартионныйУчет И ВключенПартионныйУчет И ЕстьПеременныйВес;
		Элементы.КодыМаркировкиНомерПартии.Видимость = ДоступенПартионныйУчет;
		
		Элементы.Меню_ПодобратьКодыНачатьРаботу.Видимость = Ложь;
		Элементы.Меню_ПодобратьКоды.Видимость = Ложь;
		Элементы.Меню_ЗаполнитьПартии.Видимость = Ложь;
		Элементы.Меню_УдалитьКоды.Видимость = Ложь;
		Элементы.Кнопка_ВыполнитьОбмен.Видимость = Ложь;
		Элементы.Кнопка_ОбновитьЗадачи.Видимость = Ложь;
		Элементы.Меню_ОперацииСКодами.Видимость = Ложь;
		Элементы.Меню_ОперацииСАгрегатами.Видимость = Ложь;
		Элементы.Кнопка_ДобавитьЗСН.Видимость = Ложь;
		
		Элементы.Кнопка_СообщитьОбОтгрузке.Видимость = Ложь;
		Элементы.Кнопка_ПроверитьКоды.Видимость = Ложь;
		
	Иначе
		ВызватьИсключение НСтр("ru = 'Документ учета имеет неизвестный статус: '") + Статусы.ОсновнойСтатус;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТоварыДокумента) Тогда
		УстановитьВидимостьКолонкиТоваров("Характеристика");
		УстановитьВидимостьКолонкиТоваров("Упаковка");
		УстановитьВидимостьКолонкиТоваров("Артикул");
		УстановитьВидимостьКолонкиТоваров("Серия");
		УстановитьВидимостьКолонкиТоваров("Цена");
	КонецЕсли;
	
	Если ОбъектВПроцессеОбновления Тогда
		УстановитьТолькоПросмотр(Истина);
	КонецЕсли;
	
	РежимТехническогоСпециалиста = МодульОбъекта().ВключенРежимТехническогоСпециалиста();
	НастроитьВидимостьПодменюТехническогоСпециалиста(РежимТехническогоСпециалиста);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКолонкиТоваров(ИмяКолонки)
	
	ЕстьЗначения = Ложь;
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		Если ЗначениеЗаполнено(Стр[ИмяКолонки]) Тогда
			ЕстьЗначения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы["Товары" + ИмяКолонки].Видимость = ЕстьЗначения;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТолькоПросмотр(Значение)
	
	ЭтаФорма.ТолькоПросмотр = Значение;
	Элементы.Закладка_Агрегаты.ТолькоПросмотр = Значение;
	Элементы.Закладка_КодыМаркировки.ТолькоПросмотр = Значение;
	Элементы.Закладка_Дополнительно.ТолькоПросмотр = Значение;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьПодменюТехническогоСпециалиста(РежимТехническогоСпециалиста)
	
	Элементы.Группа_ФункцииТехническогоСпециалиста.Видимость = РежимТехническогоСпециалиста;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопкиСкрытьСписанные(Значение)
	
	Элементы.Кнопка_СкрытьСписанныеКоды.Видимость = Значение;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРезультатыПроверкиКодов()
	
	СтатусыРезультатаПроверки = МодульОбъекта().ДокументУчета_СтатусыРезультатаПроверкиКодов(Ссылка);
	ЗаполнитьКонтекстРезультатаПроверкиКодов(СтатусыРезультатаПроверки);
	НастроитьЭлементыРезультатаПроверкиКодов(СтатусыРезультатаПроверки);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыРезультатаПроверкиКодов(СтатусыПроверокКодов)
	
	СтатусыПроверкиКодов = МодульОбъекта().Перечисление_СтатусыПроверкиКодовДокумента();
	ТипыПроверкиКодов = МодульОбъекта().Перечисление_ТипыПроверкиКодов();
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3.12")
		Или МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3.12") Тогда
		ГруппаРезультатПроверки = Элементы.ГруппаРезультатПроверкиКодов82;
		ЭлементРезультатПроверки = Элементы.НадписьРезультатыПроверки82;
		ИмяСвойстваЦвет = "ЦветТекста";
	Иначе
		ГруппаРезультатПроверки = Элементы.ГруппаРезультатПроверкиКодов;
		ЭлементРезультатПроверки = Элементы.ГруппаРезультатыПроверки;
		ИмяСвойстваЦвет = "ЦветТекстаЗаголовка";
	КонецЕсли;
	
	КоличествоКодов = МодульОбъекта().КодыДокументов_ОбщееКоличествоТоварныхКодов(Ссылка);
	КоличествоАгрегатов = МодульОбъекта().КодыДокументов_ОбщееКоличествоТранспортныхУпаковок(Ссылка);
	ЕстьРезультатПроверки = ЗначениеЗаполнено(СтатусыПроверокКодов.РезультатПроверкиКодовДокумента);
	
	ГруппаРезультатПроверки.Видимость = ЕстьРезультатПроверки;
	
	Элементы.ГруппаКоличествоКодовСОшибками.Видимость = КоличествоКодовСОшибками > 0;
	Элементы.КодыМаркировкиГруппаСтатусПроверки.Видимость = (КоличествоКодов > 0 И ЕстьРезультатПроверки);
	Элементы.АгрегатыГруппаСтатусПроверки.Видимость = (КоличествоАгрегатов > 0 И ЕстьРезультатПроверки);
	
	Если Не ЕстьРезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьРезультатДопПроверки1 = ЗначениеЗаполнено(СтатусыПроверокКодов.ДопПроверкаКодов1);
	ЕстьРезультатДопПроверки2 = ЗначениеЗаполнено(СтатусыПроверокКодов.ДопПроверкаКодов2);
	
	Элементы.ГруппаДопПроверкаКодов1.Видимость = ЕстьРезультатДопПроверки1;
	Элементы.ГруппаДопПроверкаКодов2.Видимость = ЕстьРезультатДопПроверки2;
	
	ПрефиксЭлементаГруппа = "ГруппаНадписи";
	ПрефиксЭлементаКоманды = "Кнопка_Отключить";
	ПрефиксГруппыКолонокАгрегаты = "АгрегатыГруппа";
	ПрефиксГруппыКолонокКодыМаркировки = "КодыМаркировкиГруппа";
	
	Для Каждого КлючЗначение Из ТипыПроверкиКодов Цикл
		
		ЭтоДопПроверка = (КлючЗначение.Значение = ТипыПроверкиКодов.ДопПроверкаКодов1
		Или КлючЗначение.Значение = ТипыПроверкиКодов.ДопПроверкаКодов2);
		
		ТипПроверкиОтключен = (СтатусыПроверокКодов[КлючЗначение.Ключ] = СтатусыПроверкиКодов.Отключена);
		ТипПроверкиОтключенВНастройках = (Не ЭтоДопПроверка И Не МодульОбъекта().ДокументУчета_ВключенТипПроверкиКодов(Ссылка, КлючЗначение.Значение));
		
		ИмяЭлементаГруппа = (ПрефиксЭлементаГруппа + КлючЗначение.Ключ);
		Элементы[ИмяЭлементаГруппа].Доступность = Не ТипПроверкиОтключен;
		
		ИмяЭлементаКоманда = (ПрефиксЭлементаКоманды + КлючЗначение.Ключ);
		Элементы[ИмяЭлементаКоманда].Видимость = (ЭтоДопПроверка Или Не ТипПроверкиОтключенВНастройках);
		
		ВидимостьКолонкиПроверки = (ЗначениеЗаполнено(СтатусыПроверокКодов[КлючЗначение.Ключ]) И Не ТипПроверкиОтключен);
		
		ИмяЭлементаГруппаКолонокКодыМаркировки = (ПрефиксГруппыКолонокКодыМаркировки + КлючЗначение.Ключ);
		Элементы[ИмяЭлементаГруппаКолонокКодыМаркировки].Видимость = ВидимостьКолонкиПроверки;
		
		ИмяЭлементаГруппаКолонокАгрегаты = (ПрефиксГруппыКолонокАгрегаты + КлючЗначение.Ключ);
		Элементы[ИмяЭлементаГруппаКолонокАгрегаты].Видимость = ВидимостьКолонкиПроверки;
		
		Если ТипПроверкиОтключен Тогда
			Элементы[ИмяЭлементаКоманда].Заголовок = НСтр("ru='включить'");
		Иначе
			Элементы[ИмяЭлементаКоманда].Заголовок = НСтр("ru='отключить'");
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтатусыПроверокКодов.РезультатПроверкиКодовДокумента = СтатусыПроверкиКодов.ЕстьОшибки
		Или СтатусыПроверокКодов.РезультатПроверкиКодовДокумента = СтатусыПроверкиКодов.НеАктуален
		Или СтатусыПроверокКодов.РезультатПроверкиКодовДокумента = СтатусыПроверкиКодов.Предупреждение Тогда
		ЭлементРезультатПроверки[ИмяСвойстваЦвет] = WebЦвета.Красный;
	ИначеЕсли СтатусыПроверокКодов.РезультатПроверкиКодовДокумента = СтатусыПроверкиКодов.Отключена Тогда
		ЭлементРезультатПроверки[ИмяСвойстваЦвет] = WebЦвета.Серый;
	Иначе
		ЭлементРезультатПроверки[ИмяСвойстваЦвет] = WebЦвета.Зеленый;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстРезультатаПроверкиКодов(СтатусыПроверокКодов)
	
	КоличествоКодовСОшибками = МодульОбъекта().КодыДокументов_КоличествоКодовСОшибками(Ссылка);
	СтатусыПроверкиКодов = МодульОбъекта().Перечисление_СтатусыПроверкиКодовДокумента();
	ТипыПроверкиКодов = МодульОбъекта().Перечисление_ТипыПроверкиКодов();
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3.12")
		Или МодульОбъекта().ВерсияРежимаСовместимостиНиже("8.3.12") Тогда
		ГруппаРезультатПроверки = Элементы.ГруппаРезультатПроверкиКодов82;
		ЭлементРезультатПроверки = Элементы.НадписьРезультатыПроверки82;
	Иначе
		ГруппаРезультатПроверки = Элементы.ГруппаРезультатПроверкиКодов;
		ЭлементРезультатПроверки = Элементы.ГруппаРезультатыПроверки;
	КонецЕсли;
	
	ЭлементРезультатПроверки.Заголовок = СтатусыПроверокКодов.ДопИнформация_РезультатПроверкиКодовДокумента;
	Элементы.ДатаВыполненияПроверки.Заголовок = СтатусыПроверокКодов.ДатаСтатуса_РезультатПроверкиКодовДокумента;
	
	ПрефиксЭлементаКартинки = "Картинка";
	ПрефиксЭлементаНадписьСтатус = "НадписьСтатус";
	
	Для Каждого КлючЗначение Из ТипыПроверкиКодов Цикл
		
		ИмяПоляДопИнформация = МодульОбъекта().ИмяПоляДопИнформация(КлючЗначение.Ключ);
		
		РезультатПроверки = СтатусыПроверокКодов[КлючЗначение.Ключ];
		ДопИнформация = СтатусыПроверокКодов[ИмяПоляДопИнформация];
		
		ИмяЭлементаКартинки = (ПрефиксЭлементаКартинки + КлючЗначение.Ключ);
		ИмяЭлементаДопИнформация = (ПрефиксЭлементаНадписьСтатус + КлючЗначение.Ключ);
		
		Если РезультатПроверки = СтатусыПроверкиКодов.Успешно Тогда
			Элементы[ИмяЭлементаКартинки].Картинка = БиблиотекаКартинок.КонтурМаркировка_ГалочкаВКруге;
		ИначеЕсли РезультатПроверки = СтатусыПроверкиКодов.ЕстьОшибки
			Или РезультатПроверки = СтатусыПроверкиКодов.Предупреждение
			Или РезультатПроверки = СтатусыПроверкиКодов.Неактуален Тогда
			Элементы[ИмяЭлементаКартинки].Картинка = БиблиотекаКартинок.КонтурМаркировка_ВосклицательныйЗнак;
		Иначе
			Элементы[ИмяЭлементаКартинки].Картинка = БиблиотекаКартинок.КонтурМаркировка_Запрещено;
		КонецЕсли;
		
		Элементы[ИмяЭлементаДопИнформация].Заголовок = ДопИнформация;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СписокСтрокДокумента()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить(Неопределено, "<Очистить>");
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		Если Стр.НеПодлежитМаркировке = Ложь Тогда
			Результат.Добавить(Стр.КлючСтрокиДокумента, Стр.ПредставлениеСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЕстьКодыВДокументе()
	
	Возврат МодульОбъекта().КодыДокументов_ЕстьКоды(Ссылка);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КоличествоУпаковокТоваровМаркировки(КлючСтрокиДокумента, Форма)
	
	МассивСтрок = Форма.ТоварыМаркировки.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", КлючСтрокиДокумента));
	
	Результат = 0;
	Для Каждого Стр Из МассивСтрок Цикл
		Результат = Результат + Стр.КоличествоУпаковок;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СтрокаДокументаПоКлючуСтроки(КлючСтрокиДокумента)
	
	МассивСтрок = ТоварыДокумента.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", КлючСтрокиДокумента));
	
	Если Не ЗначениеЗаполнено(МассивСтрок) Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось найти строку документа по ключу: '") + КлючСтрокиДокумента;
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат МассивСтрок[0];
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТекстОстатка()
	
	ТекСтрока = Элементы.ТоварыДокумента.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		
		Если ТекСтрока.НеПодлежитМаркировке Тогда
			
			ТекстОстатокПодбора = "Номенклатура не подлежит маркировке";
			//Элементы.ТекстОстатокПодбора.ЦветТекста = Новый Цвет(51,51,51);
			//Элементы.ТекстОстатокПодбора.ЦветФона = Новый Цвет(240,240,240);
			
			Элементы.ТоварыМаркировки.ТолькоПросмотр = Истина;
			Элементы.Кнопка_НайтиТоварПоРеквизитам.Доступность = Ложь;
			
		Иначе
			
			Остаток = ТекСтрока.КоличествоУпаковок - ТекСтрока.КоличествоПодобрано;
			Если Остаток > 0 Тогда
				ТекстОстатокПодбора = "Осталось подобрать: "+Остаток;
				//Элементы.ТекстОстатокПодбора.ЦветТекста = Новый Цвет(83,106,194);
				//Элементы.ТекстОстатокПодбора.ЦветФона = Новый Цвет(255,255,255);
			ИначеЕсли Остаток < 0 Тогда
				ТекстОстатокПодбора = "Уберите лишний товар: "+(-1*Остаток);
				//Элементы.ТекстОстатокПодбора.ЦветТекста = Новый Цвет(255,0,0);
				//Элементы.ТекстОстатокПодбора.ЦветФона = Новый Цвет(255,240,240);
			Иначе
				ТекстОстатокПодбора = "Товары подобраны";
				//Элементы.ТекстОстатокПодбора.ЦветТекста = Новый Цвет(47,80,80);
				//Элементы.ТекстОстатокПодбора.ЦветФона = Новый Цвет(240,255,240);
			КонецЕсли;
			
			Элементы.ТоварыМаркировки.ТолькоПросмотр = Ложь;
			Элементы.Кнопка_НайтиТоварПоРеквизитам.Доступность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстСообщенияОбОшибке()
	
	ТекущиеДанные = Элементы.ТоварыДокумента.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекстСообщениеОбОшибке = "";
	Иначе
		ТекстСообщениеОбОшибке = ТекущиеДанные.СообщениеобОшибке;
	КонецЕсли;
	
	Элементы.ТекстРезультатПроверкиТоваров.Видимость = ЗначениеЗаполнено(ТекстСообщениеОбОшибке);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьСоообщениеОбОшибкеВСтроке(СтрокаДокумента)
	
	СтрокаДокумента.СообщениеОбОшибке = "";
	СтрокаДокумента.ИндексКартинки = -1;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокументУчета()
	
	Если Не ПроверитьВозможностьЗаписатьДокумент() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДокументУчетаНаСервере();
	
	Оповестить("КонтурМаркировка_ДокументУчета_Изменен", Ссылка);
	
	ОповеститьОбИзменении(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьКодыДокументаИСохранить()
	
	ДокументУчета_СброситьКодыИСохранитьНаСервере();
	
	Модифицированность = Ложь;
	
	Оповестить("КонтурМаркировка_ДокументУчета_Изменен", Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ДокументУчета_СброситьКодыИСохранитьНаСервере()
	
	МодульОбъекта().КодыДокументов_Записать(МодульОбъекта().Новый_ТаблицаКодов(), Ссылка);
	
	ЗаписатьДокументУчетаНаСервере();
	
	НастроитьВидимостьКомандФормы();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеПолей(Знач ОписаниеДокумента = Неопределено)
	
	Если ОписаниеДокумента = Неопределено Тогда
		ОписаниеДокумента = ОписаниеДокументаПоДаннымФормы();
	КонецЕсли;
	
	ОшибкиЗаполнения = МодульОбъекта().ДокументУчета_ПроверитьЗаполнениеПолей(ОписаниеДокумента);
	МодульОбъекта().СообщитьОбОшибкахЗаполнения(ЭтаФорма, ОшибкиЗаполнения);
	
	Возврат Не ЗначениеЗаполнено(ОшибкиЗаполнения);
	
КонецФункции

&НаСервере
Процедура ЗаписатьДокументУчетаНаСервере()
	
	ОписаниеДокумента = ОписаниеДокументаПоДаннымФормы();
	
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	Попытка
		СохранитьСвязиНоменклатуры();
		СохранитьКоэффициентыПересчета();
		МодульОбъекта().ДокументУчета_Записать(ОписаниеДокумента);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ИзмененоОтражениеВЭДО Тогда
		ИзмененоОтражениеВЭДО = Ложь;
		МодульОбъекта().ДокументУчета_УстановитьСтатусРезультатаПроверкиКодовНеактуален(Ссылка);
	КонецЕсли;
	
	ЗаполнитьКонтекстФормы();
	
	ПроверитьТоварыМаркировки();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеДокументаПоДаннымФормы()
	
	Результат = МодульОбъекта().Новый_ДокументУчета();
	
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма, , "ТоварыДокумента, ТоварыМаркировки, ЭтапыМаркировки");
	ЗаполнитьЗначенияСвойств(Результат.ДопРеквизиты, ЭтаФорма);
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		ЗаполнитьЗначенияСвойств(Результат.ТоварыДокумента.Добавить(), Стр);
	КонецЦикла;
	
	Для Каждого Стр Из ТоварыМаркировки Цикл
		СтрокиДок = ТоварыДокумента.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", Стр.КлючСтрокиДокумента));
		Если ЗначениеЗаполнено(СтрокиДок) И СтрокиДок[0].НеПодлежитМаркировке = Ложь Тогда
			ЗаполнитьЗначенияСвойств(Результат.ТоварыМаркировки.Добавить(), Стр);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из ЭтапыМаркировки Цикл
		НоваяСтрока = Результат.ЭтапыМаркировки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр,, "СпособыВыполнения");
		НоваяСтрока.СпособыВыполнения = Стр.СпособыВыполнения.ВыгрузитьЗначения();
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьВозможностьЗавершитьРаботу()
	
	ЕстьОшибки = Ложь;
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	ОперацииПечати = МодульОбъекта().ДокументУчета_СписокОпераций(Ссылка, ТипыОпераций.ПечатьКодов);
	Если ЗначениеЗаполнено(ОперацииПечати) Тогда
		Ошибка = МодульОбъекта().Новый_ОшибкаЗаполнения("СписокОпераций");
		Ошибка.ТекстОшибки = НСтр("ru = 'Необходимо завершить операции печати'");
		МодульОбъекта().СообщитьОбОшибкахЗаполнения(ЭтаФорма, Ошибка);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	ОписаниеДокумента = ОписаниеДокументаПоДаннымФормы();
	
	Если Не ПроверитьЗаполнениеПолей(ОписаниеДокумента) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ПроверитьТоварыМаркировки(ОписаниеДокумента) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если МодульОбъекта().ДокументУчета_ЕстьРольКорректировкаОтгрузки(ОписаниеДокумента)
		И Не МодульОбъекта().ДокументУчета_ПроверитьСопоставлениеКодов(Ссылка) Тогда
		Ошибка = МодульОбъекта().Новый_ОшибкаЗаполнения("КодыМаркировки");
		Ошибка.ТекстОшибки = НСтр("ru = 'Не все коды сопоставлены со строками документа. Выполните сопоставление и затем завершите работу с документом'");
		МодульОбъекта().СообщитьОбОшибкахЗаполнения(ЭтаФорма, Ошибка);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Функция ПроверитьТоварыМаркировки(Знач ОписаниеДокумента = Неопределено)
	
	СтатусыДокументовУчета = МодульОбъекта().Перечисление_СтатусыДокументовУчета();
	
	Если Статусы.ОсновнойСтатус = СтатусыДокументовУчета.Новый Тогда
		Для Каждого СтрокаДокумента Из ТоварыДокумента Цикл
			ОчиститьСоообщениеОбОшибкеВСтроке(СтрокаДокумента);
		КонецЦикла;
		Возврат Ложь;
	КонецЕсли;
	
	Если ОписаниеДокумента = Неопределено Тогда
		ОписаниеДокумента = ОписаниеДокументаПоДаннымФормы();
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	ОшибкиGTIN = МодульОбъекта().ДокументУчета_ПроверитьТоварыМаркировки(ОписаниеДокумента);
	Для Каждого СтрокаДокумента Из ТоварыДокумента Цикл
		
		ОписаниеОшибки = МодульОбъекта().МассивСтруктур_Найти(ОшибкиGTIN, СтрокаДокумента.НомерСтроки, "НомерСтроки");
		
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			СтрокаДокумента.СообщениеОбОшибке = ОписаниеОшибки.ТекстОшибки;
			СтрокаДокумента.ИндексКартинки = 2;
			ЕстьОшибки = Истина;
		Иначе
			ОчиститьСоообщениеОбОшибкеВСтроке(СтрокаДокумента);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		МодульОбъекта().Метрика_Функциональность_ОшибкиПроверкиGTINВДокументеУчета(Организация);
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура СохранитьСвязиНоменклатуры()
	
	Для Каждого Стр Из ТоварыМаркировки Цикл
		
		Если Не Стр.ДобавленВручную Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.Товар)
			Или Не ЗначениеЗаполнено(Стр.КоличествоУпаковок) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиДокумента = ТоварыДокумента.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", Стр.КлючСтрокиДокумента));
		Если Не ЗначениеЗаполнено(СтрокиДокумента) Тогда
			Возврат;
		КонецЕсли;
		
		СтрДок = СтрокиДокумента[0];
		Если СтрДок.НеПодлежитМаркировке Тогда
			Продолжить;
		КонецЕсли;
		
		МодульОбъекта().СвязьНоменклатуры_Добавить(Стр.Товар
		, СтрДок.КлючНоменклатуры1С);
		
		Стр.ДобавленВручную = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьКоэффициентыПересчета()
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		
		Если Не Стр.РучнойВводКоличества
			Или Стр.НеПодлежитМаркировке Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.КоличествоУпаковок)
			Или Не ЗначениеЗаполнено(Стр.Количество) Тогда
			Продолжить;
		КонецЕсли;
		
		Числитель = Стр.КоличествоУпаковок;
		Знаменатель = Стр.Количество;
		КлючНоменклатуры1С = Стр.КлючНоменклатуры1С;
		
		МодульОбъекта().КоэффициентПересчета_Записать(КлючНоменклатуры1С, Числитель, Знаменатель);
		МодульОбъекта().Метрика_Функциональность_ЗаписьКоэффициентаПересчетаВДокументе();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПосчитатьКоличествоСтрокТаблицФормы()
	
	КоличествоОпераций = СписокОпераций.Количество();
	КоличествоТоваровДокумента = ТоварыДокумента.Количество();
	КоличествоКодов = МодульОбъекта().КодыДокументов_ОбщееКоличествоТоварныхКодов(Ссылка);
	КоличествоАгрегатов = МодульОбъекта().КодыДокументов_ОбщееКоличествоТранспортныхУпаковок(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзВходящегоУПД()
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура);
	ПараметрыФормы.Отбор.Вставить("Организация", Организация);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ЗагрузитьКодыИзВходящегоУПДПослеВыбораУПД", ЭтаФорма);
	
	МодульКлиента().ОткрытьФормуВыбораВходящегоУПД(ОписаниеОбработчика, ЭтаФорма, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзВходящегоУПДПослеВыбораУПД(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьКодыИзВходящегоУПДНаСервере(РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКодыИзВходящегоУПДНаСервере(РезультатВыбора)
	
	КодыДобавлены = МодульОбъекта().КодыДокументов_ДобавитьИзВходящегоУПД(РезультатВыбора.Объект, Ссылка);
	
	Если Не КодыДобавлены Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьРезультатыПроверкиКодов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьСпискиКодовИАгрегатов();
	ОбновитьСтатусыДокумента();
	ЗаполнитьГруппуЭтаповМаркировки();
	ЗаполнитьГруппуМаршрутМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзВнешнегоИсточника(НачатьРаботу = Ложь)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	КодыДобавлены = ЗагрузитьКодыИзВнешнегоИсточникаНаСервере();
	
	Если Не КодыДобавлены Тогда
		Возврат;
	КонецЕсли;
	
	Если НачатьРаботу Тогда
		Документ_НачатьРаботу();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКодыИзВнешнегоИсточникаНаСервере()
	
	КодыДобавлены = МодульОбъекта().КодыДокументов_ДобавитьИзВнешнегоИсточника(Ссылка);
	
	Если КодыДобавлены Тогда
		ОбновитьРезультатыПроверкиКодов();
		ПосчитатьКоличествоСтрокТаблицФормы();
		ОбновитьСпискиКодовИАгрегатов();
		ОбновитьСтатусыДокумента();
		ЗаполнитьГруппуЭтаповМаркировки();
		ЗаполнитьГруппуМаршрутМаркировки();
	КонецЕсли;
	
	Возврат КодыДобавлены;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьКодыИзДругогоДокумента(НачатьРаботу = Ложь)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("НачатьРаботу", НачатьРаботу);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ЗагрузитьКодыИзДругогоДокументаПослеВыбораВида", ЭтаФорма, ДопПараметры);
	
	ВидыДокументов = МодульКлиента().ВидыДокументовДляПодбораКодов(Ссылка);
	МодульКлиента().ОткрытьФормуВыбораВидаДокумента(ОписаниеОбработчика, ВидыДокументов, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзДругогоДокументаПослеВыбораВида(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ЗагрузитьКодыИзДругогоДокументаПослеВыбораДокумента", ЭтаФорма, ДопПараметры);
	
	МодульКлиента().ОткрытьФормуВыбораОбъектаИС(РезультатВыбора.Значение, ЭтаФорма, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзДругогоДокументаПослеВыбораДокумента(РезультатВыбора, ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	КодыДобавлены = ЗагрузитьКодыИзДругогоДокументаНаСервере(РезультатВыбора);
	
	Если Не КодыДобавлены Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.НачатьРаботу Тогда
		Документ_НачатьРаботу();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКодыИзДругогоДокументаНаСервере(ДругойДокумент1C)
	
	КодыДобавлены = МодульОбъекта().КодыДокументов_ПодобратьИзДругогоДокумента(Ссылка, ДругойДокумент1C);
	
	Если КодыДобавлены Тогда
		ОбновитьРезультатыПроверкиКодов();
		ПосчитатьКоличествоСтрокТаблицФормы();
		ОбновитьСпискиКодовИАгрегатов();
		ОбновитьСтатусыДокумента();
		ЗаполнитьГруппуЭтаповМаркировки();
		ЗаполнитьГруппуМаршрутМаркировки();
	КонецЕсли;
	
	Возврат КодыДобавлены;
	
КонецФункции

&НаКлиенте
Процедура УстановитьНовоеКоличествоТоваровМаркировки(СтрокаДокумента)
	
	КлючСтрокиДокумента = СтрокаДокумента.КлючСтрокиДокумента;
	
	ПодходящиеСтроки = ТоварыМаркировки.НайтиСтроки(Новый Структура("КлючСтрокиДокумента", КлючСтрокиДокумента));
	Если ПодходящиеСтроки.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	Стр = ПодходящиеСтроки[0];
	Стр.КоличествоУпаковок = СтрокаДокумента.КоличествоУпаковок;
	СтрокаДокумента.КоличествоПодобрано = КоличествоУпаковокТоваровМаркировки(КлючСтрокиДокумента, ЭтаФорма);
	
	ОбновитьТекстОстатка();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзФайлов(НачатьРаботу = Ложь)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыбораФайлов = МодульКлиента().Новый_ПараметрыДиалогаВыбораФайла();
	ПараметрыВыбораФайлов.Заголовок = НСтр("ru = 'Выберите файл(ы) для загрузки кодов маркировки в документ учета'");
	ДополнитьПараметрыВыбораПередЗагрузкойКодовИзФайлов(ПараметрыВыбораФайлов);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("НачатьРаботу", НачатьРаботу);
	ДопПараметры.Вставить("ПараметрыДиалогаВыбора", ПараметрыВыбораФайлов);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ЗагрузитьКодыИзФайловПослеВыбораФайлов", ЭтаФорма, ДопПараметры);
	
	МодульКлиента().ПоказатьДиалогВыбораФайла(ОписаниеОбработчика, ПараметрыВыбораФайлов);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьПараметрыВыбораПередЗагрузкойКодовИзФайлов(ПараметрыВыбораФайлов)
	
	МодульОбъекта().ДокументУчета_ПередЗагрузкойКодовИзФайлов(ПараметрыВыбораФайлов, Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзФайловПослеВыбораФайлов(ВыбранныеФайлы, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДиалога = ДопПараметры.ПараметрыДиалогаВыбора;
	ОписанияФайлов = МодульКлиента().ОписанияФайлов(ВыбранныеФайлы);
	КодыЗагружены = ЗагрузитьКодыИзФайловНаСервере(ОписанияФайлов, ПараметрыДиалога);
	
	Если Не КодыЗагружены Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.НачатьРаботу Тогда
		Документ_НачатьРаботу();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКодыИзФайловНаСервере(ОписанияФайлов, ПараметрыВыбораФайлов)
	
	КодыЗагружены = МодульОбъекта().КодыДокументов_ЗагрузитьИзФайлов(Ссылка, ОписанияФайлов, ПараметрыВыбораФайлов);
	
	Если КодыЗагружены Тогда
		ОбновитьРезультатыПроверкиКодов();
		ПосчитатьКоличествоСтрокТаблицФормы();
		ОбновитьСпискиКодовИАгрегатов();
		ОбновитьСтатусыДокумента();
		ЗаполнитьГруппуЭтаповМаркировки();
		ЗаполнитьГруппуМаршрутМаркировки();
	КонецЕсли;
	
	Возврат КодыЗагружены;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуЗагрузкиКодов(РежимСканера = Ложь, ДляУдаления = Ложь)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДляУдаления Тогда
		Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("УдалитьКодыСПомощьюТабличногоДокументаПослеУказанияКодов", ЭтаФорма);
	Иначе
		Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("НаполнитьКодамиИзТабличногоДокументаПослеУказанияКодов", ЭтаФорма);
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуЗагрузкиКодов(ЭтаФорма, Обработчик, РежимСканера, ДляУдаления);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКодыСПомощьюТабличногоДокументаПослеУказанияКодов(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКодов = ПолучитьИзВременногоХранилища(Результат.АдресТаблицыКодов);
	МодульОбъекта().ТаблицаКодов_ЗаполнитьКлючиКодов(ТаблицаКодов);
	КлючиКодов = ТаблицаКодов.ВыгрузитьКолонку("КлючКода");
	
	МодульОбъекта().КодыДокументов_УдалитьКоды(Ссылка, КлючиКодов);
	
	ОбновитьРезультатыПроверкиКодов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ОбновитьСпискиКодовИАгрегатов();
	ОбновитьСтатусыДокумента();
	ЗаполнитьГруппуЭтаповМаркировки();
	ЗаполнитьГруппуМаршрутМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьКодамиИзТабличногоДокументаПослеУказанияКодов(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	КодыДобавлены = НаполнитьКодамиИзТабличногоДокументаНаСервере(Результат);
	Если Не КодыДобавлены Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", Ссылка);
		
		МодульКлиента().ОткрытьФормуОбработкиМодально("Форма_РедакторКодов", ЭтаФорма, ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НаполнитьКодамиИзТабличногоДокументаНаСервере(Результат) Экспорт
	
	КодыДобавлены = МодульОбъекта().КодыДокументов_ДобавитьИзТабличногоДокумента_Сканера(Ссылка, Результат);
	
	Если КодыДобавлены Тогда
		ОбновитьРезультатыПроверкиКодов();
		ПосчитатьКоличествоСтрокТаблицФормы();
		ОбновитьСпискиКодовИАгрегатов();
		ОбновитьСтатусыДокумента();
		ЗаполнитьГруппуЭтаповМаркировки();
		ЗаполнитьГруппуМаршрутМаркировки();
	КонецЕсли;
	
	Возврат КодыДобавлены;
	
КонецФункции

&НаКлиенте
Процедура ТоварыДокумента_СообщитьОбОшибках()
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		Если ЗначениеЗаполнено(Стр.СообщениеОбОшибке) Тогда
			МодульКлиента().СообщитьОбОшибкеВСтрокеТабЧасти(Стр.СообщениеОбОшибке, УникальныйИдентификатор
			, Элементы.ТоварыДокумента, "Номенклатура", ТоварыДокумента.Индекс(Стр));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказку()
	
	ТекстПодсказки = "";
	Разделитель = "";
	
	ОписаниеДокумента = ОписаниеДокументаПоДаннымФормы();
	
	ПодсказкаВыполняетсяОбновленияДанных = ПодсказкаВыполняетсяОбновлениеДанных();
	Если ЗначениеЗаполнено(ПодсказкаВыполняетсяОбновленияДанных) Тогда
		ТекстПодсказки = ТекстПодсказки + Разделитель + ПодсказкаВыполняетсяОбновленияДанных;
		Разделитель = Символы.ПС;
	КонецЕсли;
	
	ПодсказкаОСУАнтисептики = ПодсказкаНедопустимыеАнтисептикиОСУ(ОписаниеДокумента);
	Если ЗначениеЗаполнено(ПодсказкаОСУАнтисептики) Тогда
		ТекстПодсказки = ТекстПодсказки + Разделитель + ПодсказкаОСУАнтисептики;
		Разделитель = Символы.ПС;
	КонецЕсли;
	
	ПодсказкаКонтрольКодовОтключен = ПодсказкаКонтрольКодовОтключен();
	Если ЗначениеЗаполнено(ПодсказкаКонтрольКодовОтключен) Тогда
		ТекстПодсказки = ТекстПодсказки + Разделитель + ПодсказкаКонтрольКодовОтключен;
		Разделитель = Символы.ПС;
	КонецЕсли;
	
	ПодсказкаТоварыПодлежатПартионномуУчету = ПодсказкаТоварыПодлежатПартионномуУчету(ОписаниеДокумента);
	Если ЗначениеЗаполнено(ПодсказкаТоварыПодлежатПартионномуУчету) Тогда
		ТекстПодсказки = ТекстПодсказки + Разделитель + ПодсказкаТоварыПодлежатПартионномуУчету;
		Разделитель = Символы.ПС;
	КонецЕсли;
	
	Элементы.ТекстПодсказки.Заголовок = ТекстПодсказки;
	Элементы.ГруппаПодсказки.Видимость = ЗначениеЗаполнено(ТекстПодсказки);
	
КонецПроцедуры

&НаСервере
Функция ПодсказкаВыполняетсяОбновлениеДанных()
	
	Результат = "";
	
	Если ОбъектВПроцессеОбновления Тогда
		Результат = НСтр("ru = 'Работа с объектом заблокирована. Выполняется обновление данных'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПодсказкаНедопустимыеАнтисептикиОСУ(ОписаниеДокумента)
	
	Возврат МодульОбъекта().ДокументУчета_ПроверитьНедопустимыеАнтисептикиОСУ(ОписаниеДокумента);
	
КонецФункции

&НаСервере
Функция ПодсказкаКонтрольКодовОтключен()
	
	Результат = "";
	СтатусыПроверкиКодов = МодульОбъекта().Перечисление_СтатусыПроверкиКодовДокумента();
	СтатусыРезультатаПроверки = МодульОбъекта().ДокументУчета_СтатусыРезультатаПроверкиКодов(Ссылка);
	
	ШаблонПодсказки = НСтр("ru='Контроль кодов отключен. В документ отгрузки могут попасть коды товаров %1'");
	
	ДопТекст = Новый Массив;
	
	Если СтатусыРезультатаПроверки.ПроверкаСтатусаКодов = СтатусыПроверкиКодов.Отключена Тогда
		ДопТекст.Добавить(НСтр("ru='в некорректном статусе'"));
	КонецЕсли;
	
	Если СтатусыРезультатаПроверки.ПроверкаРДКодов = СтатусыПроверкиКодов.Отключена Тогда
		ДопТекст.Добавить(НСтр("ru='с недоступными РД'"));
	КонецЕсли;
	
	Если СтатусыРезультатаПроверки.ПроверкаВладельцаКодов = СтатусыПроверкиКодов.Отключена Тогда
		ДопТекст.Добавить(НСтр("ru='не принадлежащие организации'"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДопТекст) Тогда
		Результат = МодульОбъекта().ПараметрыВСтроку(ШаблонПодсказки, МодульОбъекта().СоединитьСтроку(ДопТекст, ", "));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПодсказкаТоварыПодлежатПартионномуУчету(ОписаниеДокумента)
	
	Возврат МодульОбъекта().ДокументУчета_ПроверитьТоварыПодлежатПартионномуУчету(ОписаниеДокумента);
	
КонецФункции

&НаСервере
Функция ТоварыДокумента_ТребуютсяЗаводскиеСерийныеНомера()
	
	Отбор = Новый Структура("ТребуетсяЗСН", Истина);
	Возврат ЗначениеЗаполнено(ТоварыДокумента.НайтиСтроки(Отбор));
	
КонецФункции

&НаСервере
Функция ТоварыДокумента_ЕстьОтражениеВЭДООСУ()
	
	ПравилаОтражения = МодульОбъекта().Перечисление_ПравилаОтраженияВЭДО();
	Отбор = Новый Структура("ОтражениеВЭДО", ПравилаОтражения.ОСУ);
	
	Возврат ЗначениеЗаполнено(ТоварыДокумента.НайтиСтроки(Отбор));
	
КонецФункции

&НаСервере
Функция ТоварыДокумента_ЕстьОтражениеВЭДОПартионныйУчет()
	
	ПравилаОтражения = МодульОбъекта().Перечисление_ПравилаОтраженияВЭДО();
	Отбор = Новый Структура("ОтражениеВЭДО", ПравилаОтражения.ПартионныйУчет);
	
	Возврат ЗначениеЗаполнено(ТоварыДокумента.НайтиСтроки(Отбор));
	
КонецФункции

&НаСервере
Функция ТоварыМаркировки_ДоступенПартионныйУчет(КлючСтрокиДокумента = Неопределено)
	
	Отбор = Новый Структура("ДоступенПартионныйУчет", Истина);
	
	Если ЗначениеЗаполнено(КлючСтрокиДокумента) Тогда
		Отбор.Вставить("КлючСтрокиДокумента", КлючСтрокиДокумента);
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(ТоварыМаркировки.НайтиСтроки(Отбор));
	
КонецФункции

&НаСервере
Функция ТоварыМаркировки_ЕстьПеременныйВес(КлючСтрокиДокумента = Неопределено)
	
	Отбор = Новый Структура("ПеременныйВес", Истина);
	
	Если ЗначениеЗаполнено(КлючСтрокиДокумента) Тогда
		Отбор.Вставить("КлючСтрокиДокумента", КлючСтрокиДокумента);
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(ТоварыМаркировки.НайтиСтроки(Отбор));
	
КонецФункции

&НаКлиенте
Функция ТоварыМаркировки_УказаныПартии(КлючСтрокиДокумента = Неопределено)
	
	Отбор = Новый Структура("НомерПартии", "");
	
	Если ЗначениеЗаполнено(КлючСтрокиДокумента) Тогда
		Отбор.Вставить("КлючСтрокиДокумента", КлючСтрокиДокумента);
	КонецЕсли;
	
	СтрокиСПартиями = ТоварыМаркировки.НайтиСтроки(Отбор);
	
	Возврат СтрокиСПартиями.Количество() <> ТоварыМаркировки.Количество();
	
КонецФункции

&НаСервере
Функция ТекстЗапросаКодыМаркировки()
	
	Возврат
	
	"ВЫБРАТЬ
	|	КодыДокументов.КлючСтрокиДокумента КАК КлючСтрокиДокумента,
	|	КодыДокументов.КлючКода КАК КлючКода,
	|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	КодыМаркировки.ЗаводскойСерийныйНомер КАК ЗаводскойСерийныйНомер,
	|	ИнформацияОКодах.Товар КАК Товар,
	|	ИнформацияОКодах.КлючНоменклатуры1С КАК КлючНоменклатуры1С,
	|	ИнформацияОКодах.ОбщийТипУпаковки КАК ОбщийТипУпаковки,
	|	ЕСТЬNULL(ТоварыДокумента.ПредставлениеСтроки, """") КАК СтрокаДокумента,
	|	ЕСТЬNULL(СтатусыКодов.ОсобоеСостояниеКода, """") КАК ОсобоеСостояниеКода,
	|	ЕСТЬNULL(СтатусыКодов.Статус, """") КАК СтатусКода,
	|	ЕСТЬNULL(СтатусыКодов.Владелец, &ПустойКонтрагент) КАК Владелец,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнформацияОКодах.ДатаПечати, &ПустаяДата) > &ПустаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Напечатан,
	|	ЕСТЬNULL(ИнформацияОКодах.НомерПартии, """") КАК НомерПартии,
	|	ВЫБОР
	|		КОГДА РезультатыПроверкиКодов.ПроверкаРД ЕСТЬ NULL
	|				ИЛИ РезультатыПроверкиКодов.ПроверкаРД = &НеТребуется
	|			ТОГДА -1
	|		КОГДА РезультатыПроверкиКодов.ПроверкаРД = &Проверен
	|			ТОГДА 4
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинкиПроверкаРД,
	|	ВЫБОР
	|		КОГДА РезультатыПроверкиКодов.ПроверкаСтатуса ЕСТЬ NULL
	|				ИЛИ РезультатыПроверкиКодов.ПроверкаСтатуса = &НеТребуется
	|			ТОГДА -1
	|		КОГДА РезультатыПроверкиКодов.ПроверкаСтатуса = &Проверен
	|			ТОГДА 4
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинкиПроверкаСтатуса,
	|	ВЫБОР
	|		КОГДА РезультатыПроверкиКодов.ПроверкаВладельца ЕСТЬ NULL
	|				ИЛИ РезультатыПроверкиКодов.ПроверкаВладельца = &НеТребуется
	|			ТОГДА -1
	|		КОГДА РезультатыПроверкиКодов.ПроверкаВладельца = &Проверен
	|			ТОГДА 4
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинкиПроверкаВладельца,
	|	ВЫБОР
	|		КОГДА РезультатыПроверкиКодов.ДопПроверка1 ЕСТЬ NULL
	|				ИЛИ РезультатыПроверкиКодов.ДопПроверка1 = &НеТребуется
	|			ТОГДА -1
	|		КОГДА РезультатыПроверкиКодов.ДопПроверка1 = &Проверен
	|			ТОГДА 4
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинкиДопПроверка1,
	|	ВЫБОР
	|		КОГДА РезультатыПроверкиКодов.ДопПроверка2 ЕСТЬ NULL
	|				ИЛИ РезультатыПроверкиКодов.ДопПроверка2 = &НеТребуется
	|			ТОГДА -1
	|		КОГДА РезультатыПроверкиКодов.ДопПроверка2 = &Проверен
	|			ТОГДА 4
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинкиДопПроверка2,
	|	РезультатыПроверкиКодов.ПроверкаСтатуса КАК ПроверкаСтатуса,
	|	РезультатыПроверкиКодов.ПроверкаВладельца КАК ПроверкаВладельца,
	|	РезультатыПроверкиКодов.ПроверкаРД КАК ПроверкаРД,
	|	РезультатыПроверкиКодов.ДопПроверка1 КАК ДопПроверка1,
	|	РезультатыПроверкиКодов.ДопПроверка2 КАК ДопПроверка2
	|ИЗ
	|	РегистрСведений.КонтурМаркировка_КодыДокументов КАК КодыДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_КодыМаркировки КАК КодыМаркировки
	|		ПО КодыДокументов.КлючКода = КодыМаркировки.КлючКода
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыКодовГИСМТ КАК СтатусыКодов
	|		ПО (КодыМаркировки.КлючСтатусаКода = СтатусыКодов.КлючСтатусаКода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ИнформацияОКодах КАК ИнформацияОКодах
	|		ПО (КодыМаркировки.КлючИнформацииОКоде = ИнформацияОКодах.КлючИнформацииОКоде)}
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурМаркировка_ДокументыУчета.ТоварыДокумента КАК ТоварыДокумента
	|		ПО КодыДокументов.КлючСтрокиДокумента = ТоварыДокумента.КлючСтрокиДокумента
	|			И (ТоварыДокумента.Ссылка = &ДокументУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_РезультатыПроверкиКодов КАК РезультатыПроверкиКодов
	|		ПО КодыДокументов.КлючПроверкиКода = РезультатыПроверкиКодов.КлючПроверкиКода
	|ГДЕ
	|	КодыДокументов.ДокументУчета = &ДокументУчета
	|	И ИнформацияОКодах.ОбщийТипУпаковки <> ЗНАЧЕНИЕ(Перечисление.КонтурМаркировка_ОбщиеТипыУпаковок.ТранспортнаяУпаковка)
	|	И (&ПоказатьСписанные
	|			ИЛИ ЕСТЬNULL(СтатусыКодов.Статус, """") <> &СтатусКода_Списан)";
	
КонецФункции

&НаСервере
Функция ПроверитьВозможностьЗаписатьДокумент()
	
	РезультатПроверки = МодульОбъекта().ПроверитьУстановленнуюВерсиюМодуля();
	
	Возврат РезультатПроверки.Успешно;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТоварыАгрегатовИзГИСМТ()
	
	ТаблицаКодов = МодульОбъекта().КодыДокументов_ТранспортныеУпаковки(Ссылка);
	
	МодульОбъекта().ТоварыАгрегатов_ЗаполнитьИзГИСМТ(ТаблицаКодов, Организация);
	
	ОбновитьСписокАгрегатов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложенныеКодыАгрегатовИзГИСМТ()
	
	ТаблицаКодов = МодульОбъекта().КодыДокументов_ТранспортныеУпаковки(Ссылка);
	
	МодульОбъекта().ТаблицаКодов_ЗаполнитьВложенныеКодыИзГИСМТ(ТаблицаКодов, Организация);
	
	ОбновитьСписокАгрегатов();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДополнительныеКнопки()
	
	РазмещенияКнопок = МодульОбъекта().Перечисление_РазмещениеДополнительныхКнопок();
	
	// Шапка
	Действие = "Шапка_ДополнительнаяКнопкаНажатие";
	ГруппаКнопок = Элементы.ШапкаДопКнопки;
	НастройкиКнопок = МодульОбъекта().НастройкиДополнительныхКнопок(РазмещенияКнопок.ДокументУчетаШапка, ТипДокумента);
	МодульОбъекта().ДобавитьНаФормуДополнительныеКнопки(ЭтаФорма, НастройкиКнопок, ГруппаКнопок, Действие);
	
	// Коды маркировки
	Действие = "КодыМаркировки_ДополнительнаяКнопкаНажатие";
	ГруппаКнопок = Элементы.СписокКодовДопКнопки;
	НастройкиКнопок = МодульОбъекта().НастройкиДополнительныхКнопок(РазмещенияКнопок.ДокументУчетаСписокКодов, ТипДокумента);
	МодульОбъекта().ДобавитьНаФормуДополнительныеКнопки(ЭтаФорма, НастройкиКнопок, ГруппаКнопок, Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПриОткрытии()
	
	Если ДействиеПриОткрытии = "ПроверитьЗаполнениеПолей" Тогда
		ПроверитьЗаполнениеПолей();
	КонецЕсли;
	
	Если ДействиеПриОткрытии = "ПроверитьВозможностьЗавершитьРаботу" Тогда
		Если Не ПроверитьВозможностьЗавершитьРаботу() Тогда
			ТоварыДокумента_СообщитьОбОшибках();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КонтекстОтчетаПоВиртуальномуСкладу()
	
	Если ТоварыМаркировки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = МодульОбъекта().Новый_ОтчетПоВиртуальномуСкладу_Контекст();
	
	Результат.Организация = Организация;
	Результат.ФормаИнициатор = "Форма_ДокументУчета";
	Для Каждого Строка Из ТоварыМаркировки Цикл
		Результат.СписокТоваров.Добавить(Строка.Товар);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПровестиОпросПользователяИЗакрыть()
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.ДокументУчета);
	
	Если ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеОпросаПользователя", ЭтаФорма);
		МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма, ОписаниеОбработчика);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОпросаПользователя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура Агрегаты_Сортировать(ИмяКолонки, Направление)
	
	КолонкаСортировки = ИмяКолонки + " " + Направление;
	СортироватьПодчиненные = (ИмяКолонки = "Товар" Или ИмяКолонки = "КлючНоменклатуры1С");
	
	ДеревоАгрегатов = РеквизитФормыВЗначение("Агрегаты");
	ДеревоАгрегатов.Строки.Сортировать(КолонкаСортировки, СортироватьПодчиненные, Новый СравнениеЗначений);
	ЗначениеВРеквизитФормы(ДеревоАгрегатов, "Агрегаты");
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_УдалитьИзДокументаПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Агрегаты_УдалитьИзДокументаПослеСогласияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Агрегаты_УдалитьИзДокументаПослеСогласияНаСервере() Экспорт
	
	КлючиКодов = Новый Массив;
	Для каждого ИдентификаторСтроки Из Элементы.Агрегаты.ВыделенныеСтроки Цикл
		Стр = Агрегаты.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если Стр.УровеньАгрегата Тогда
			КлючиКодов.Добавить(Стр.КлючКода);
		КонецЕсли;
	КонецЦикла;
	
	МодульОбъекта().КодыДокументов_УдалитьКоды(Ссылка, КлючиКодов);
	
	ОбновитьРезультатыПроверкиКодов();
	ОбновитьСписокАгрегатов();
	ПосчитатьКоличествоСтрокТаблицФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_УдалитьИзДокументаПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Коды_УдалитьИзДокументаПослеСогласияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Коды_УдалитьИзДокументаПослеСогласияНаСервере()
	
	КлючиКодов = Новый Массив;
	Для каждого Стр Из Элементы.КодыМаркировки.ВыделенныеСтроки Цикл
		КлючиКодов.Добавить(Стр.КлючКода);
	КонецЦикла;
	
	МодульОбъекта().КодыДокументов_УдалитьКоды(Ссылка, КлючиКодов);
	
	ОбновитьРезультатыПроверкиКодов();
	ОбновитьСписокКодовМаркировки();
	ПосчитатьКоличествоСтрокТаблицФормы();
	
КонецПроцедуры

&НаСервере
Функция ДокументуДоступнаРоль(РольДокумента)
	
	Возврат МодульОбъекта().ДокументУчета_ТипуДокументаДоступнаРоль(ТипДокумента, РольДокумента);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПартииИВесИзВходящегоУПД(РезультатВыбора, ОчиститьПартии)
	
	ВходящийУПД = РезультатВыбора.Объект;
	ТаблицаПартий = МодульОбъекта().Операция_ВходящийУПД_ПартииТоваров(ВходящийУПД);
	ТаблицаПартий.Колонки.Добавить("Распределено", МодульОбъекта().ОписаниеТипа_Булево());
	
	ТаблицаТоваров = ТоварыМаркировки.Выгрузить();
	Если ОчиститьПартии Тогда
		МодульОбъекта().ТаблицаЗначений_СвернутьПоВсемКолонкам(ТаблицаТоваров, "КоличествоУпаковок", "НомерПартии");
	КонецЕсли;
	
	МодульОбъекта().ДокументУчета_РаспределитьПартии(ТаблицаТоваров, ТаблицаПартий);
	ТоварыМаркировки.Загрузить(ТаблицаТоваров);
	
	ЗаполнитьПризнакПеременныйВес();
	ЗаполнитьДоступностьПартионногоУчета();
	
	ТоварыДокумента_ОбновитьОтраженияВЭДО();
	НастроитьВидимостьЭлементовФормы();
	
	ПроверитьТоварыМаркировки();
	ТоварыМаркировки_ПроверитьРаспределениеПартий();
	
	Функциональность = МодульОбъекта().Перечисление_ФункциональностьМодуля().ЗаполнитьПартииИзВходящегоУПД;
	МодульОбъекта().Метрика_Функциональность_ЗаполнитьПартииВДокументеУчета(Ссылка, Функциональность);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ТоварыМаркировки_ПроверитьРаспределениеПартий()
	
	ПравилаОтражения = МодульОбъекта().Перечисление_ПравилаОтраженияВЭДО();
	
	ОтборТоварБезПарт = Новый Структура("ДоступенПартионныйУчет, НомерПартии", Истина, "");
	СтрокиБезПартий = ТоварыМаркировки.Выгрузить(ОтборТоварБезПарт, "КлючСтрокиДокумента, Товар, КоличествоУпаковок");
	СтрокиБезПартий.Свернуть("КлючСтрокиДокумента, Товар", "КоличествоУпаковок");
	
	ШаблонОшибки = НСтр("ru='Строка товара %1. Для товара %2 не заполнена партия для %3 уп.'");
	
	ОтборКлючСтроки = Новый Структура("КлючСтрокиДокумента");
	ОтборКлючСтрокиТовар = Новый Структура("КлючСтрокиДокумента, Товар");
	
	Для Каждого Стр Из СтрокиБезПартий Цикл
		
		Если Стр.КоличествоУпаковок < 1 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОтборКлючСтроки, Стр);
		ЗаполнитьЗначенияСвойств(ОтборКлючСтрокиТовар, Стр);
		
		Для каждого СтрДокумента Из ТоварыДокумента.НайтиСтроки(ОтборКлючСтроки) Цикл
			Если СтрДокумента.ОтражениеВЭДО <> ПравилаОтражения.ПартионныйУчет Тогда
				Продолжить;
			КонецЕсли;
			ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки
			, СтрДокумента.ПредставлениеСтроки
			, Стр.Товар
			, Стр.КоличествоУпаковок);
			МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ТоварыМаркировки_Свернуть()
	
	ВременнаяТаблица = ТоварыМаркировки.Выгрузить();
	МодульОбъекта().ТаблицаЗначений_СвернутьПоВсемКолонкам(ВременнаяТаблица, "Количество, КоличествоУпаковок");
	
	ТоварыМаркировки.Очистить();
	ТоварыМаркировки.Загрузить(ВременнаяТаблица);
	
КонецПроцедуры

&НаСервере
Функция ТоварыМаркировки_ИтогиПоПартиям()
	
	ОтборДоступенПартионныйУчет = Новый Структура("ДоступенПартионныйУчет", Истина);
	
	Результат = ТоварыМаркировки.Выгрузить(ОтборДоступенПартионныйУчет);
	Результат.Свернуть("КлючСтрокиДокумента, Товар, НомерПартии", "КоличествоУпаковок, Количество");
	
	МодульОбъекта().ТаблицаЗначений_УдалитьЗначение(Результат, "НомерПартии", "");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ТоварыДокумента_ОбновитьОтраженияВЭДО(КлючСтрокиДокумента = Неопределено)
	
	ТаблицаПартий = ТоварыМаркировки_ИтогиПоПартиям();
	ПравилаОтражения = МодульОбъекта().Перечисление_ПравилаОтраженияВЭДО();
	
	Если ЗначениеЗаполнено(КлючСтрокиДокумента) Тогда
		МодульОбъекта().ТаблицаЗначений_УдалитьДругиеЗначения(ТаблицаПартий
		, "КлючСтрокиДокумента"
		, МодульОбъекта().ЗначениеВМассиве(КлючСтрокиДокумента));
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru='В строке %1 установлено отражение в ЭДО ""%2""'");
	КлючиСтрокСПартиями = МодульОбъекта().ТаблицаЗначений_ВыгрузитьКолонку(ТаблицаПартий, "КлючСтрокиДокумента", Истина);
	
	ОтборПоКлючу = Новый Структура("КлючСтрокиДокумента");
	Для Каждого КлючСтроки Из КлючиСтрокСПартиями Цикл
		ОтборПоКлючу.КлючСтрокиДокумента = КлючСтроки;
		Для Каждого СтрДокумента Из ТоварыДокумента.НайтиСтроки(ОтборПоКлючу) Цикл
			Если СтрДокумента.ОтражениеВЭДО = ПравилаОтражения.ПартионныйУчет Тогда
				Продолжить;
			КонецЕсли;
			СтрДокумента.ОтражениеВЭДО = ПравилаОтражения.ПартионныйУчет;
			ТекстСообщения = МодульОбъекта().ПараметрыВСтроку(ШаблонСообщения
			, СтрДокумента.ПредставлениеСтроки
			, СтрДокумента.ОтражениеВЭДО);
			МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПартииИВесИзКодовМаркировки()
	
	Если Не МодульОбъекта().КодыДокументов_ЕстьПартионныйУчет(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПравилаОтражения = МодульОбъекта().Перечисление_ПравилаОтраженияВЭДО();
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		
		КлючСтрокиДокумента = Стр.КлючСтрокиДокумента;
		
		Если Стр.ОтражениеВЭДО <> ПравилаОтражения.ОСУ
			И Стр.ОтражениеВЭДО <> ПравилаОтражения.ПартионныйУчет Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ТоварыМаркировки_ДоступенПартионныйУчет(КлючСтрокиДокумента) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьПартииИВесИзКодовМаркировкиДляСтрокиДокумента(КлючСтрокиДокумента);
		
	КонецЦикла;
	
	ЗаполнитьПризнакПеременныйВес();
	ЗаполнитьДоступностьПартионногоУчета();
	
	ТоварыДокумента_ОбновитьОтраженияВЭДО();
	НастроитьВидимостьЭлементовФормы();
	
	ПроверитьТоварыМаркировки();
	ТоварыМаркировки_ПроверитьРаспределениеПартий();
	
	Функциональность = МодульОбъекта().Перечисление_ФункциональностьМодуля().ЗаполнитьПартииПоКодам;
	МодульОбъекта().Метрика_Функциональность_ЗаполнитьПартииВДокументеУчета(Ссылка, Функциональность);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПартииИВесИзКодовМаркировкиДляСтрокиДокумента(КлючСтрокиДокумента)
	
	ТаблицаПартий = МодульОбъекта().КодыДокументов_КоличествоКодовПоПартиям(Ссылка, КлючСтрокиДокумента);
	
	Если Не ЗначениеЗаполнено(ТаблицаПартий) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборКлючСтроки = Новый Структура("КлючСтрокиДокумента", КлючСтрокиДокумента);
	ТаблицаТоваровБезПартий = ТоварыМаркировки.Выгрузить(ОтборКлючСтроки, "Товар, КоличествоУпаковок");
	ТаблицаТоваровБезПартий.Свернуть("Товар", "КоличествоУпаковок");
	
	МодульОбъекта().ТаблицаЗначений_УдалитьЗначение(ТоварыМаркировки, "КлючСтрокиДокумента", КлючСтрокиДокумента);
	
	Для Каждого СтрПарт Из ТаблицаПартий Цикл
		
		СтрТов = ТоварыМаркировки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТов, СтрПарт);
		СтрТов.КлючСтрокиДокумента = КлючСтрокиДокумента;
		
		СтрБезПарт = ТаблицаТоваровБезПартий.Найти(СтрПарт.Товар, "Товар");
		Если СтрБезПарт <> Неопределено Тогда
			Если СтрБезПарт.КоличествоУпаковок > СтрПарт.КоличествоУпаковок Тогда
				СтрБезПарт.КоличествоУпаковок = СтрБезПарт.КоличествоУпаковок - СтрПарт.КоличествоУпаковок;
			Иначе
				ТаблицаТоваровБезПартий.Удалить(СтрБезПарт);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ОтборТоварБезПарт = Новый Структура("КлючСтрокиДокумента, НомерПартии, Товар", КлючСтрокиДокумента, "");
	
	Для Каждого СтрБезПарт Из ТаблицаТоваровБезПартий Цикл
		
		ОтборТоварБезПарт.Товар = СтрБезПарт.Товар;
		СтрТов = МодульОбъекта().ТаблицаЗначений_НайтиСтроку(ТоварыМаркировки, ОтборТоварБезПарт);
		
		Если СтрТов = Неопределено Тогда
			СтрТов = ТоварыМаркировки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТов, СтрБезПарт);
			СтрТов.КлючСтрокиДокумента = КлючСтрокиДокумента;
		Иначе
			СтрТов.КоличествоУпаковок = СтрТов.КоличествоУпаковок + СтрБезПарт.КоличествоУпаковок;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти // СлужебныеПроцедурыИФункции

