#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Процедура ПриИзмененииЗоныОтправителя(ЗаданиеКладовщику) Экспорт
	
	Для Каждого СтрокаТовара Из ЗаданиеКладовщику.Товары Цикл
		
		СтрокаТовара.Ячейка = ЗаданиеКладовщику.ЗонаОтправитель;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриИзмененииЗоныПолучателя(ЗаданиеКладовщику) Экспорт
	
	Для Каждого СтрокаТовара Из ЗаданиеКладовщику.Товары Цикл
		
		СтрокаТовара.ЯчейкаПриемник = ЗаданиеКладовщику.ЗонаПолучатель;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьЗадачиНаИнвентаризацию(ДокументОснование, СтандартнаяОбработка) Экспорт
	
	Кладовщики = ДокументОснование.Товары.ВыгрузитьКолонку("Исполнитель");
	вмс_РаботаСКоллекциями.УдалитьДублиВМассиве(Кладовщики);
	
	Для каждого Кладовщик Из Кладовщики Цикл
		
		НовоеЗадание = Документы.вмс_ЗаданиеКладовщику.СоздатьДокумент();
		НовоеЗадание.Заполнить(Неопределено);
		НовоеЗадание.Дата = ТекущаяДатаСеанса();
		НовоеЗадание.ЗаполнитьЗаданиеКладовщикуНаИнвентаризацию(ДокументОснование, Кладовщик);
		НовоеЗадание.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создано %1 документ(ов)", Кладовщики.Количество()));
	
КонецФункции

// Кодирует статус типа контейнера в общем статусе для типов контейнеров
//
// Параметры:
//  Статус - Число - Текущий статус указания контейнеров.
//  ТипКонтейнера - Строка - Тип контейнера ("Контейнер", "КонтейнерОтправитель", "КонтейнерПриемник").
//  УказываетсяПоПлану - Булево - флаг, что контейнер указывается по плану - по умолчанию Ложь. 
//  УказываетсяПоФакту - Булево - флаг, что контейнер указывается по факту - по умолчанию Ложь. 
//  УказываетсяНеОбязательно - Булево - флаг, что контейнер необязательно указывать - по умолчанию Ложь. 
//
// Возвращаемое значение:
//  Булево - Истина (с изменением состояния статуса)
//
Функция УстановитьСтатусУказанияКонтейнера(Статус, ТипКонтейнера="Контейнер", УказываетсяПоПлану=Ложь, УказываетсяПоФакту=Ложь, УказываетсяНеОбязательно=Ложь) Экспорт
	
	Если УказываетсяПоПлану Тогда
		СтатусТипаКонтейнера = 2;
	ИначеЕсли УказываетсяПоФакту Тогда
		Если УказываетсяНеОбязательно Тогда
			СтатусТипаКонтейнера = 4;
		Иначе
			СтатусТипаКонтейнера = 3;
		КонецЕсли;
	Иначе
		СтатусТипаКонтейнера = 1;
	КонецЕсли;

	КоличествоВариантовСтатуса = 5;
	
	Если ТипКонтейнера="Контейнер" Тогда
		ОснованиеТипаКонтейнера = 1;
	ИначеЕсли ТипКонтейнера="КонтейнерОтправитель" Тогда
		ОснованиеТипаКонтейнера = КоличествоВариантовСтатуса;
	ИначеЕсли ТипКонтейнера="КонтейнерПриемник" Тогда
		ОснованиеТипаКонтейнера = КоличествоВариантовСтатуса*КоличествоВариантовСтатуса;
	Иначе
		ВызватьИсключение "Недопустимый тип контейнера """ + ТипКонтейнера + """";
	КонецЕсли;

	ТекущийСтатусТипаКонтейнера = Цел(Статус / ОснованиеТипаКонтейнера) % КоличествоВариантовСтатуса;
	
	Статус = Статус + (СтатусТипаКонтейнера-ТекущийСтатусТипаКонтейнера)*ОснованиеТипаКонтейнера;
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСтатусУказанияКонтейнера(Статус, ТипКонтейнера="Контейнер") Экспорт

	КоличествоВариантовСтатуса = 5;

	Если ТипКонтейнера="Контейнер" Тогда
		ОснованиеТипаКонтейнера = 1;
	ИначеЕсли ТипКонтейнера="КонтейнерОтправитель" Тогда
		ОснованиеТипаКонтейнера = КоличествоВариантовСтатуса;
	ИначеЕсли ТипКонтейнера="КонтейнерПриемник" Тогда
		ОснованиеТипаКонтейнера = КоличествоВариантовСтатуса*КоличествоВариантовСтатуса;
	Иначе
		ВызватьИсключение "Недопустимый тип контейнера """ + ТипКонтейнера + """";
	КонецЕсли;

	ТекущийСтатусТипаКонтейнера = Цел(Статус / ОснованиеТипаКонтейнера) % КоличествоВариантовСтатуса;
	
	Возврат ТекущийСтатусТипаКонтейнера;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ПодобратьЯчейкиПолучатели(ЗаданиеКладовщику) Экспорт 
	
	// Стандартная реализация
	МаршрутРазмещения = вмс_РазмещениеСервер.ПодобратьЯчейкиПолучатели(ЗаданиеКладовщику);
	РК = вмс_РаботаСКоллекциями;
	
	Для каждого Строка Из ЗаданиеКладовщику.Товары Цикл
		Если ЗначениеЗаполнено(Строка.Контейнер) Тогда   
			Отбор = Новый Структура("Контейнер", Строка.Контейнер);	
		Иначе		
			Отбор = Новый Структура("Товар, Характеристика, Контейнер", Строка.Номенклатура, Строка.Характеристика,Строка.Контейнер);  
		КонецЕсли;
		НайденныеСтроки = МаршрутРазмещения.НайтиСтроки(Отбор);
		ПерваяЯчейка = Истина;
		ДополнительныеЯчейки = Новый Массив;
		
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если ПерваяЯчейка Тогда
				Строка.ЯчейкаПриемник = НайденнаяСтрока.Ячейка;
				ПерваяЯчейка = Ложь;
			Иначе       
				Если Строка.ЯчейкаПриемник <> НайденнаяСтрока.Ячейка Тогда
					ДополнительныеЯчейки.Добавить(НайденнаяСтрока.Ячейка); 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		РК.УдалитьДублиВМассиве(ДополнительныеЯчейки);
		Строка.ДополнительныеЯчейки = вмс_РаботаСКоллекциями.МассивВСтроку(ДополнительныеЯчейки, ",");
		
	КонецЦикла;
	
КонецПроцедуры   

Процедура ПодобратьЯчейкиОтправители(знач ЗаданияКладовщикам) Экспорт
	
	РК = вмс_РаботаСКоллекциями; 
	
	ЗаданияКладовщикам = РК.ЗначениеВМассив(ЗаданияКладовщикам, , Ложь);
	
	ПараметрыЗаполнения = вмс_ОтборСервер.НовыйПараметрыЗаполненияОтбора();
	
	Для Каждого ЗаданиеКладовщику Из ЗаданияКладовщикам Цикл
		ТаблицаПлан = ПлановаяТаблицаПоЗаданию(ЗаданиеКладовщику);
		ЗаполнитьФактТаблицыЗадания(ЗаданиеКладовщику, ТаблицаПлан);

		РазгруппироватьОчиститьИнструкции(ТаблицаПлан);
		СгруппироватьИнструкции(ТаблицаПлан);
		ПерераспределитьПлановоеКоличество(ЗаданиеКладовщику, ТаблицаПлан);
		ЗаданиеКладовщику.Товары.Загрузить(ТаблицаПлан);
		
		ТаблицаПланДляЗаполнения = ВыделитьТаблицуПланДляЗаполнения(ТаблицаПлан);
		Если ТаблицаПланДляЗаполнения.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		
		ИнициализироватьПараметрыЗаполненияЯчеек(ПараметрыЗаполнения, ЗаданиеКладовщику);
		МаршрутОтбора = вмс_ОтборСервер.ПодобратьЯчейкиОтправители(ПараметрыЗаполнения);
		
		//конструируется на основе колонок плана и маршрута.
		СводнаяТаблица = СводнаяТаблицаДляЗаполнения(МаршрутОтбора, ТаблицаПлан);
		
		ОбновитьСводнуюТаблицуПоМаршруту(МаршрутОтбора, СводнаяТаблица, ТаблицаПланДляЗаполнения);	
		ОбновитьСводнуюТаблицуКонтейнеры(ПараметрыЗаполнения, СводнаяТаблица);

		СводнаяТаблица.Сортировать("ПриоритетЗоны, Приоритет, Ячейка");
		
		ЗаданиеКладовщику.Товары.Очистить();
		РК.ДобавитьЭлементыКоллекции(ЗаданиеКладовщику.Товары, СводнаяТаблица); // добавим ячейки товаров, заполненные сейчас
		ОбработатьПустыеЯчейки(ЗаданиеКладовщику, ТаблицаПланДляЗаполнения); // добавим пустые ячейки товаров, для которых не нашлось остатков
		РК.ДобавитьЭлементыКоллекции(ЗаданиеКладовщику.Товары, ТаблицаПлан); // добавим ячейки товаров, заполненные в прошлый раз
		
		СгруппироватьИнструкции(ЗаданиеКладовщику.Товары);
	КонецЦикла;
	
КонецПроцедуры

Функция	ЗаполнитьФактТаблицыЗадания(ЗаданиеКладовщику, ТаблицаПлан)
	
	ТаблицаПлан.Колонки.Добавить("ОбработанФакт", Новый ОписаниеТипов("Булево"));
	ТаблицаПлан.Колонки.Добавить("КоличествоФакт", Новый ОписаниеТипов("Число"));

	ТаблицаФактаВыполненияИнструкций = ПолучитьФактВыполненияИнструкций(ЗаданиеКладовщику);
	ТаблицаФактаВыполненияИнструкций.Индексы.Добавить("ИдентификаторИнструкции");
	
	ПоискПоИдентификатору = Новый Структура("ИдентификаторИнструкции");
	Для Каждого СтрокаПлан Из ТаблицаПлан Цикл
		ПоискПоИдентификатору.ИдентификаторИнструкции = СтрокаПлан.ИдентификаторИнструкции;
		СтрокаФактМассив = ТаблицаФактаВыполненияИнструкций.НайтиСтроки(ПоискПоИдентификатору);
		Если СтрокаФактМассив.Количество() > 0 Тогда
			СтрокаПлан.КоличествоФакт = СтрокаФактМассив[0].Количество;
			СтрокаПлан.ОбработанФакт = Истина;
		Иначе
			СтрокаПлан.КоличествоФакт = 0;
			СтрокаПлан.ОбработанФакт = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПерераспределитьПлановоеКоличество(ЗаданиеКладовщику, знач Инструкции=Неопределено) Экспорт
	
	Поиск = ПолучитьПоляПланаЗадания(ЗаданиеКладовщику);
	Если Поиск=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Поиск.Свойство("Товар") Тогда
		Поиск.Удалить("Товар");
		Поиск.Вставить("Номенклатура");
	КонецЕсли;
	
	Если Инструкции=Неопределено Тогда
		Инструкции = ЗаданиеКладовщику.Товары.Выгрузить();
		ЗаполнитьФактТаблицыЗадания(ЗаданиеКладовщику, Инструкции);
		ЗагрузитьТаблицу = Истина;
	Иначе
		ЗагрузитьТаблицу = Ложь;
	КонецЕсли;
	
	Перераспределено = Ложь;
	УдалитьСтроки = Новый Массив;
	
	Для Каждого СтрокаПлан Из Инструкции Цикл
		
		КоличествоПревышено = СтрокаПлан.КоличествоФакт - СтрокаПлан.Количество;
		Если КоличествоПревышено <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Поиск, СтрокаПлан);
		
		СтрокиПлана = Инструкции.НайтиСтроки(Поиск);
		Для Каждого СтрокаПланаДляУменьшения Из СтрокиПлана Цикл
			КоличествоДоступно = СтрокаПланаДляУменьшения.Количество - СтрокаПланаДляУменьшения.КоличествоФакт;
			Если КоличествоДоступно <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если КоличествоПревышено > КоличествоДоступно Тогда
				КоличествоРаспределить = КоличествоДоступно;
			Иначе
				КоличествоРаспределить = КоличествоПревышено;
			КонецЕсли;
			
			СтрокаПлан.Количество = СтрокаПлан.Количество + КоличествоРаспределить;
			СтрокаПланаДляУменьшения.Количество = СтрокаПланаДляУменьшения.Количество - КоличествоРаспределить;
			Если СтрокаПланаДляУменьшения.Количество=0 Тогда
				УдалитьСтроки.Добавить(СтрокаПланаДляУменьшения);
			КонецЕсли;
			КоличествоПревышено = КоличествоПревышено - КоличествоРаспределить;
			Перераспределено = Истина;
			Если КоличествоПревышено=0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаУдалить Из УдалитьСтроки Цикл
		Инструкции.Удалить(СтрокаУдалить);
	КонецЦикла;
	
	Если ЗагрузитьТаблицу Тогда
		ЗаданиеКладовщику.Товары.Загрузить(Инструкции);
	КонецЕсли;
	
	Возврат Перераспределено;
	
КонецФункции

Функция ПолучитьПоляПланаЗадания(ЗаданиеКладовщику)
	
	Если НЕ ЗаданиеКладовщику.ДополнительныеСвойства.Свойство("СтруктураНастройкиПолей") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкаПолей = ЗаданиеКладовщику.ДополнительныеСвойства.СтруктураНастройкиПолей.НастройкаПолей;
	
	Поля = Новый Структура;
	
	Префикс = "Задание.Товары.";
	ДлинаПрефикса = СтрДлина(Префикс);
	
	Для Каждого Поле Из НастройкаПолей Цикл
		
		Если НЕ Поле.План Тогда
			Продолжить;
		КонецЕсли;
		
		Если Поле.Ресурс Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДаннымЗаполнения = Поле.ПутьКДаннымЗаполнения;
		Если Лев(ПутьКДаннымЗаполнения, ДлинаПрефикса) <> Префикс Тогда
			Продолжить;
		КонецЕсли;
		
		Имя = Прав(ПутьКДаннымЗаполнения, СтрДлина(ПутьКДаннымЗаполнения)-ДлинаПрефикса);
		Запятая = СтрНайти(Имя, ",");
		Если Запятая <> 0 Тогда
			Имя = Лев(Имя, Запятая-1);
		КонецЕсли;
		
		Поля.Вставить(Имя);
		
	КонецЦикла;
	
	Возврат Поля;
	
КонецФункции

Функция РазгруппироватьОчиститьИнструкции(Инструкции)
	
	ПустыеПоляИнструкции = Новый Структура;
	ПустыеПоляИнструкции.Вставить("Ячейка", Справочники.вмс_МестаХранения.ПустаяСсылка());
	ПустыеПоляИнструкции.Вставить("Серия", Справочники.вмс_СерииНоменклатуры.ПустаяСсылка());
	ПустыеПоляИнструкции.Вставить("СпособВводаСерии", Перечисления.вмс_СпособВводаСерии.ПустаяСсылка());
	ПустыеПоляИнструкции.Вставить("Контейнер", Справочники.вмс_Контейнеры.ПустаяСсылка());
	ПустыеПоляИнструкции.Вставить("КонтейнерОтправитель", Справочники.вмс_Контейнеры.ПустаяСсылка());
	ПустыеПоляИнструкции.Вставить("Помещение", Справочники.вмс_Помещения.ПустаяСсылка());

	КоличествоИнструкций = Инструкции.Количество();
	
	Для НомерИнструкции=0 По КоличествоИнструкций-1 Цикл
		Инструкция = Инструкции[НомерИнструкции];
		Если НЕ Инструкция.ОбработанФакт Тогда
			//инструкция еще не обрабатывалась,
			//возможно полностью перезаполнить и сгруппировать с похожими инструкциями
			Инструкция.ИдентификаторИнструкции = 0;
			ЗаполнитьЗначенияСвойств(Инструкция, ПустыеПоляИнструкции);
			Продолжить;
		КонецЕсли;
		
		Если Инструкция.КоличествоФакт <= 0 Тогда
			//инструкция уже обрабатывалась, но количество было отсторнировано
			//ячейку можно перезаполнить, но использованный идентификатор лучше сохранить
			ЗаполнитьЗначенияСвойств(Инструкция, ПустыеПоляИнструкции);
			Продолжить;
		КонецЕсли;
		
		Если Инструкция.Количество <= Инструкция.КоличествоФакт Тогда
			//инструкция полностью обработана, не трогаем
			Продолжить;
		КонецЕсли;
		
		ИнструкцияНевыполненная = Инструкции.Добавить();
		ЗаполнитьЗначенияСвойств(ИнструкцияНевыполненная, Инструкция);
		ИнструкцияНевыполненная.Количество = Инструкция.Количество - Инструкция.КоличествоФакт;
		Инструкция.Количество = Инструкция.КоличествоФакт;
		ИнструкцияНевыполненная.ИдентификаторИнструкции = 0;
		
		ЗаполнитьЗначенияСвойств(ИнструкцияНевыполненная, ПустыеПоляИнструкции);
	КонецЦикла;
	
КонецФункции

Функция СгруппироватьИнструкции(Инструкции)
	
	РК = вмс_РаботаСКоллекциями;
	
	ПоляПоиска = Новый Массив;
	Для Каждого Реквизит Из Метаданные.Документы.вмс_ЗаданиеКладовщику.ТабличныеЧасти.Товары.Реквизиты Цикл
		ПоляПоиска.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	РК.ВычестьМассив(ПоляПоиска, "ДополнительныеЯчейки, Примечание, СпособВводаСерии, ИдентификаторИнструкции");

	ПоляСуммы = Новый Массив;
	ПоляСуммы.Добавить("Количество");
	//ПоляСуммы.Добавить("КоличествоБазовыхЕдиниц");
	РК.ВычестьМассив(ПоляПоиска, ПоляСуммы);
	
	ПоискИнструкции = Новый Структура;
	Для Каждого ПолеПоиска Из ПоляПоиска Цикл
		ПоискИнструкции.Вставить(ПолеПоиска);
	КонецЦикла;
	
	ИнструкцииУдалить = Новый Соответствие;
	//объединить одинаковые строки
	Для Каждого Инструкция Из Инструкции Цикл
		
		Если ИнструкцииУдалить[Инструкция]=Истина Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПоискИнструкции, Инструкция);
		ИнструкцииСгруппировать = Инструкции.НайтиСтроки(ПоискИнструкции);
		Для Каждого ИнструкцияСгруппировать Из ИнструкцииСгруппировать Цикл
			Если Инструкция=ИнструкцияСгруппировать Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ (ИнструкцияСгруппировать.ИдентификаторИнструкции=0) Тогда
				//присоеднияем только новые инструкции
				Продолжить;
			КонецЕсли;
			
			Количество = ИнструкцияСгруппировать.Количество;
			
			Инструкция.Количество = Инструкция.Количество + Количество;
			ИнструкцияСгруппировать.Количество = ИнструкцияСгруппировать.Количество - Количество;

			Если ИнструкцияСгруппировать.Количество=0 Тогда
				ИнструкцииУдалить[ИнструкцияСгруппировать] = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если Инструкция.Количество=0 Тогда
			ИнструкцииУдалить[Инструкция] = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ИнструкцияУдалить Из ИнструкцииУдалить Цикл
		Инструкции.Удалить(ИнструкцияУдалить.Ключ);
	КонецЦикла;
	
КонецФункции

Функция ПолучитьФактВыполненияИнструкций(ЗаданиеКладовщику) Экспорт

	Если ТипЗнч(ЗаданиеКладовщику)=Тип("ДокументСсылка.вмс_ЗаданиеКладовщику") Тогда
		СсылкаНаЗаданиеКладовщику = ЗаданиеКладовщику;
	Иначе
		СсылкаНаЗаданиеКладовщику = ЗаданиеКладовщику.Ссылка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамТовары.ИдентификаторИнструкции КАК ИдентификаторИнструкции,
	|	СУММА(вмс_ОперацияПоЯчейкамТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам КАК вмс_ОперацияПоЯчейкам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вмс_ОперацияПоЯчейкам.Товары КАК вмс_ОперацияПоЯчейкамТовары
	|		ПО вмс_ОперацияПоЯчейкам.Ссылка = вмс_ОперацияПоЯчейкамТовары.Ссылка
	|ГДЕ
	|	&СсылкаНаЗаданиеКладовщику <> ЗНАЧЕНИЕ(Документ.вмс_ЗаданиеКладовщику.ПустаяСсылка)
	|	И вмс_ОперацияПоЯчейкам.Проведен
	|	И вмс_ОперацияПоЯчейкам.ЗаданиеКладовщику = &СсылкаНаЗаданиеКладовщику
	|	И вмс_ОперацияПоЯчейкамТовары.ИдентификаторИнструкции <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_ОперацияПоЯчейкамТовары.ИдентификаторИнструкции";
	Запрос.УстановитьПараметр("СсылкаНаЗаданиеКладовщику", СсылкаНаЗаданиеКладовщику);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаФактаВыполненияИнструкций = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаФактаВыполненияИнструкций;
	
КонецФункции

Функция ВыделитьТаблицуПланДляЗаполнения(ТаблицаПлан)

	РК = вмс_РаботаСКоллекциями;
	
	СтрокиТаблицыДляЗаполнения = Новый Массив;
	Для Каждого СтрокаПлана Из ТаблицаПлан Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаПлана.Ячейка) Тогда
			СтрокиТаблицыДляЗаполнения.Добавить(СтрокаПлана); 
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПланДляЗаполнения = ТаблицаПлан.Скопировать(СтрокиТаблицыДляЗаполнения);
	РК.УдалитьЭлементыКоллекции(ТаблицаПлан, СтрокиТаблицыДляЗаполнения);
	
	Возврат ТаблицаПланДляЗаполнения;
	
КонецФункции

Процедура ОбновитьСводнуюТаблицуПоМаршруту(Знач МаршрутОтбора, Знач СводнаяТаблица, Знач ТаблицаПлан)
	
	// обход по маршруту, а не по плану обусловлен тем, что маршрут уже настроен по приоритетам заранее
	// и нам нужно вычерпывать сверху самые вкусные строки.
	
	Для Каждого СтрокаОтбора Из МаршрутОтбора Цикл
		
		Если СтрокаОтбора.СвободныйОстаток <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("Номенклатура, Характеристика", СтрокаОтбора.Товар, СтрокаОтбора.Характеристика);
		НайденныеСтроки = ТаблицаПлан.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаПлана Из НайденныеСтроки Цикл
			Если СтрокаОтбора.СвободныйОстаток <= 0 Тогда
				Прервать;
			КонецЕсли;

			Если СтрокаПлана.Количество <> 0 Тогда
				НоваяСтрока = СводнаяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОтбора);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлана, , "Ячейка, ДополнительныеЯчейки, Контейнер, КонтейнерОтправитель, Помещение");
				НоваяСтрока.Серия = СтрокаОтбора.Серия;
				СтрокаПлана.ИдентификаторИнструкции = 0;
				Если СтрокаПлана.Количество > СтрокаОтбора.СвободныйОстаток Тогда
					НоваяСтрока.Количество = СтрокаОтбора.СвободныйОстаток;
					СтрокаПлана.Количество = СтрокаПлана.Количество - НоваяСтрока.Количество;
				Иначе   
					НоваяСтрока.Количество = СтрокаПлана.Количество; 
					СтрокаПлана.Количество = 0;
					СтрокаПлана.Обработано = Истина;
				КонецЕсли;
				
				СтрокаОтбора.СвободныйОстаток = СтрокаОтбора.СвободныйОстаток - НоваяСтрока.Количество;
			Иначе
				НайденныеСтроки = СводнаяТаблица.НайтиСтроки(Отбор);
				Для Каждого Строка Из НайденныеСтроки Цикл
					Если Строка.ДополнительныеЯчейки=Неопределено Тогда
						Строка.ДополнительныеЯчейки = "";
					Иначе
						Строка.ДополнительныеЯчейки = Строка.ДополнительныеЯчейки + ", ";
					КонецЕсли;
					Строка.ДополнительныеЯчейки = Строка.ДополнительныеЯчейки + СтрокаОтбора.Ячейка;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработатьПустыеЯчейки(Знач ЗаданиеКладовщику, Знач ТаблицаПлан)
	
	Перем НоваяСтрока, ОтборНеОбработанного, Строка, ТоварБезОстатка;
	
	ОтборНеОбработанного = Новый Структура("Обработано", Ложь);
	ТоварБезОстатка = ТаблицаПлан.НайтиСтроки(ОтборНеОбработанного);  
	
	Для Каждого Строка Из ТоварБезОстатка Цикл
		НоваяСтрока = ЗаданиеКладовщику.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		//НоваяСтрока.ИдентификаторИнструкции = 0; 
	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьСводнуюТаблицуКонтейнеры(Знач ПараметрыЗаполнения, Знач СводнаяТаблица)
	
	РК = вмс_РаботаСКоллекциями;
	
	// ТУ_Прошин_24.11.25+ 	
	МассивКонтейнеров = СводнаяТаблица.ВыгрузитьКолонку("Контейнер");
	РК.УдалитьДублиВМассиве(МассивКонтейнеров);
	РК.УдалитьПустыеСтрокиКоллекции(МассивКонтейнеров);
	
	Если МассивКонтейнеров.Количество() > 0 Тогда      
		вмс_ОтборСервер.ПодготовитьПланЗаданияДляОтгрузкиКонтейнеров(СводнаяТаблица, МассивКонтейнеров, ПараметрыЗаполнения.Правило);
	КонецЕсли;	
	// ТУ_Прошин_24.11.25-

КонецПроцедуры

Функция СводнаяТаблицаДляЗаполнения(Знач МаршрутОтбора, Знач ТаблицаПлан)
	
	РК = вмс_РаботаСКоллекциями;
	
	КолонкиМаршрута = РК.ПолучитьКолонкиКоллекции(МаршрутОтбора);
	КолонкиПлана = РК.ПолучитьКолонкиКоллекции(ТаблицаПлан);
	
	КолонкиСводнойТаблицы = РК.СложениеМассивов(КолонкиМаршрута, КолонкиПлана);
	РК.УдалитьДублиВМассиве(КолонкиСводнойТаблицы);
	РК.УдалитьЭлементыКоллекции(КолонкиМаршрута, "Товар");
	
	КолонкиСводнойТаблицы.Добавить("ИдентификаторИнструкции");
	КолонкиСводнойТаблицы.Добавить("ДополнительныеЯчейки");
	
	СводнаяТаблица = РК.НоваяТаблицаЗначений(КолонкиСводнойТаблицы);
	
	Возврат СводнаяТаблица;

КонецФункции

Функция ПлановаяТаблицаПоЗаданию(Знач ЗаданиеКладовщику)
	
	Перем ТаблицаПлан;
	
	ТаблицаПлан = ЗаданиеКладовщику.Товары.Выгрузить();
	ТаблицаПлан.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
	ТаблицаПлан.Колонки.Добавить("ОбработаноКонтейнеры", Новый ОписаниеТипов("Булево"));
	Возврат ТаблицаПлан;

КонецФункции

Функция НовыеПараметрыЗаполненияЯчеек(ЗаданиеКладовщику) Экспорт
	
	Возврат ИнициализироватьПараметрыЗаполненияЯчеек(вмс_ОтборСервер.НовыйПараметрыЗаполненияОтбора(), ЗаданиеКладовщику);

КонецФункции

Функция ИнициализироватьПараметрыЗаполненияЯчеек(ПараметрыЗаполнения, ЗаданиеКладовщику)

	ПараметрыЗаполнения.ЗаданиеКладовщику = ЗаданиеКладовщику;
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ЗаданиеКладовщику);
	
	Если ЗаданиеКладовщику.Правило.ИспользоватьЗонуОтбора = Истина Тогда
		ПараметрыЗаполнения.ТипыЯчеек = Перечисления.вмс_ТипыЯчеек.ЗонаОтбора;
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

//////////////////////////////////////////////////////////////////
//
//					Настройка полей+
//

Функция СтруктураНастройкиПолей(ЗаданиеКладовщику) Экспорт
	
	Если ЗаданиеКладовщику.АвтоНастройкаПолей Тогда
		Возврат СтруктураНастройкиПолейПоУмолчанию(ЗаданиеКладовщику);
	Иначе
		Если ЗначениеЗаполнено(ЗаданиеКладовщику.Ссылка) Тогда
			СсылкаНастройкиПолей = Справочники.вмс_НастройкиПолейЗадания.НайтиНастройкуПолейПоВладельцу(ЗаданиеКладовщику.Ссылка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СсылкаНастройкиПолей) Тогда
			Возврат Справочники.вмс_НастройкиПолейЗадания.СтруктураНастройкиПолей(СсылкаНастройкиПолей);
		Иначе
			Возврат Справочники.вмс_НастройкиПолейЗадания.СтруктураНастройкиПолейПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция СтруктураНастройкиПолейПоУмолчанию(ЗаданиеКладовщику) Экспорт
	Если ЗначениеЗаполнено(ЗаданиеКладовщику.Правило) Тогда
		Возврат Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.СтруктураНастройкиПолей(ЗаданиеКладовщику.Правило);
	Иначе
		Возврат Справочники.вмс_НастройкиПолейЗадания.СтруктураНастройкиПолейПоУмолчанию();
	КонецЕсли;
КонецФункции

Функция ЕстьЗаполненныеЗначенияПоля(ТаблицаДокумента, знач ИмяПоля) Экспорт
	
	Если ИмяПоля="Товар" Тогда
		ИмяПоля = "Номенклатура";
	КонецЕсли;
	
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		Попытка
			ЗначениеПоля = СтрокаДокумента[ИмяПоля];
		Исключение
			Возврат Ложь;
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция УдалитьНеиспользуемыеПоля(ТаблицаНастройки)
	
	Для Каждого Поле Из ТаблицаНастройки.НайтиСтроки(Новый Структура("Использование", Ложь)) Цикл
		
		ТаблицаНастройки.Удалить(Поле);
		
	КонецЦикла;
	
КонецФункции

Функция ЗаполнитьНастройкуПолейСтрокДокумента(ЗаданиеКладовщику) Экспорт
	
	ЗаданиеКладовщику.НастройкаПолейСтрок.Очистить();
	
	ЗаполнитьСвойстваПоляЯчейкаСтрокЗадания(ЗаданиеКладовщику);
	ЗаполнитьСвойстваПоляЯчейкаПриемникСтрокЗадания(ЗаданиеКладовщику);
	
	ЗаполнитьПолеСерияСтрокЗадания(ЗаданиеКладовщику);
	
	ЗаполнитьПолеКонтейнерПриемникСтрокЗадания(ЗаданиеКладовщику);  
	
	//ТУ_Прошин_07.05.26+      
	ЗаполнитьПолеКонтейнерОтправительСтрокЗадания(ЗаданиеКладовщику);
	ЗаполнитьПолеТоварСтрокЗадания(ЗаданиеКладовщику);
	ЗаполнитьПолеХарактеристикаСтрокЗадания(ЗаданиеКладовщику);
	ЗаполнитьПолеКонтейнерСтрокЗадания(ЗаданиеКладовщику);
	//ТУ_Прошин_07.05.26-
	
	ЗаданиеКладовщику.НастройкаПолейСтрок.Сортировать("ИдентификаторИнструкции, ИмяПоля, ИмяСвойства");
	
КонецФункции

Функция ЗаполнитьСвойстваПоляЯчейкаСтрокЗадания(ЗаданиеКладовщику)

	НастройкаПолей = ЗаданиеКладовщику.ДополнительныеСвойства.СтруктураНастройкиПолей.НастройкаПолей;
	
	ИмяПоля = "Ячейка";
	ИспользуетсяПланПоЯчейкеПриемнику = НастройкаПолей.НайтиСтроки(Новый Структура("Имя, План", ИмяПоля, Истина)).Количество() > 0;
	Если НЕ ИспользуетсяПланПоЯчейкеПриемнику Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Строка Из ЗаданиеКладовщику.Товары Цикл
		Если ЗначениеЗаполнено(Строка[ИмяПоля]) Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля = Новый Структура;
		СвойстваПоля.Вставить("План", Ложь);
		УстановитьНастройкуПолейДляИнструкцийЗадания(Строка, ЗаданиеКладовщику.НастройкаПолейСтрок, ИмяПоля, СвойстваПоля);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьСвойстваПоляЯчейкаПриемникСтрокЗадания(ЗаданиеКладовщику)

	НастройкаПолей = ЗаданиеКладовщику.ДополнительныеСвойства.СтруктураНастройкиПолей.НастройкаПолей;
	
	ИмяПоля = "ЯчейкаПриемник";
	ИспользуетсяПланПоЯчейкеПриемнику = НастройкаПолей.НайтиСтроки(Новый Структура("Имя, Ввод, План", ИмяПоля, Истина, Истина)).Количество() > 0;
	Если НЕ ИспользуетсяПланПоЯчейкеПриемнику Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Строка Из ЗаданиеКладовщику.Товары Цикл
		Если ЗначениеЗаполнено(Строка[ИмяПоля]) Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля = Новый Структура;
		СвойстваПоля.Вставить("План", Ложь);
		УстановитьНастройкуПолейДляИнструкцийЗадания(Строка, ЗаданиеКладовщику.НастройкаПолейСтрок, ИмяПоля, СвойстваПоля);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьПолеСерияСтрокЗадания(ЗаданиеКладовщику)

	НастройкаПолей = ЗаданиеКладовщику.ДополнительныеСвойства.СтруктураНастройкиПолей.НастройкаПолей;

	ПолеСерияМассив = НастройкаПолей.НайтиСтроки(Новый Структура("Имя", "Серия"));
	Если ПолеСерияМассив.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПолеСерия = ПолеСерияМассив[0];
	
	ТаблицаИспользованияСерий = вмс_СерииТоваровСервер.ИспользованиеУчетаСерийПоТоварам(ЗаданиеКладовщику.Товары.ВыгрузитьКолонку("Номенклатура"));
	НоменклатураСУчетомПоСериям = ТаблицаИспользованияСерий.Скопировать(Новый Структура("Используется", Истина)).ВыгрузитьКолонку("Товар");

	Для Каждого Строка Из ЗаданиеКладовщику.Товары Цикл
		СвойстваПоля = Новый Структура;

		ВедениеСерийногоУчетаПоТовару = НоменклатураСУчетомПоСериям.Найти(Строка.Номенклатура) <> Неопределено;
		ПланДляСтроки = НЕ (ВедениеСерийногоУчетаПоТовару И НЕ ЗначениеЗаполнено(Строка.Серия));
		Если ПолеСерия.План И НЕ ПланДляСтроки Тогда
			СвойстваПоля.Вставить("План", ПланДляСтроки);
		КонецЕсли;
		
		Если НЕ ВедениеСерийногоУчетаПоТовару Тогда
			СвойстваПоля.Вставить("Вывод", Ложь);
			//СвойстваПоля.Вставить("ОбязательныйВвод", Ложь);
			СвойстваПоля.Вставить("Ввод", Ложь);
			СвойстваПоля.Вставить("ОбязательноеЗаполнение", Ложь);
		КонецЕсли;
		
		Если СвойстваПоля.Количество() > 0 Тогда
			УстановитьНастройкуПолейДляИнструкцийЗадания(Строка, ЗаданиеКладовщику.НастройкаПолейСтрок, "Серия", СвойстваПоля);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
		
КонецФункции

Функция ЗаполнитьПолеКонтейнерПриемникСтрокЗадания(ЗаданиеКладовщику)

	НастройкаПолей = ЗаданиеКладовщику.ДополнительныеСвойства.СтруктураНастройкиПолей.НастройкаПолей;
	
	ПолеКонтейнераМассив = НастройкаПолей.НайтиСтроки(Новый Структура("Имя", "КонтейнерПриемник"));
	Если ПолеКонтейнераМассив.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПолеКонтейнера = ПолеКонтейнераМассив[0];
	
	СобиратьКонтейнеры = ЗаданиеКладовщику.СобиратьКонтейнеры;
	Для Каждого Строка Из ЗаданиеКладовщику.Товары Цикл
		План = НЕ СобиратьКонтейнеры ИЛИ ЗначениеЗаполнено(Строка.КонтейнерПриемник);
		СвойстваПоля = Новый Структура;
		СвойстваПоля.Вставить("План", План);
		СвойстваПоля.Вставить("ОбязательноеЗаполнение", План);
		УстановитьНастройкуПолейДляИнструкцийЗадания(Строка, ЗаданиеКладовщику.НастройкаПолейСтрок, "КонтейнерПриемник", СвойстваПоля);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции   

Функция ЗаполнитьПолеКонтейнерОтправительСтрокЗадания(ЗаданиеКладовщику)

	НастройкаПолей = ЗаданиеКладовщику.ДополнительныеСвойства.СтруктураНастройкиПолей.НастройкаПолей;
	
	Если НастройкаПолей.НайтиСтроки(Новый Структура("Имя, План", "КонтейнерОтправитель", Истина)).Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Строка Из ЗаданиеКладовщику.Товары Цикл
		Использование = ЗначениеЗаполнено(Строка.КонтейнерОтправитель);
		Если НЕ Использование Тогда
			СвойстваПоля = Новый Структура;
			СвойстваПоля.Вставить("ОбязательноеЗаполнение", Использование); 
			СвойстваПоля.Вставить("Ввод", Использование);     
			СвойстваПоля.Вставить("Вывод", Использование);    
			УстановитьНастройкуПолейДляИнструкцийЗадания(Строка, ЗаданиеКладовщику.НастройкаПолейСтрок, "КонтейнерОтправитель", СвойстваПоля);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции 

Функция ЗаполнитьПолеКонтейнерСтрокЗадания(ЗаданиеКладовщику)  
	
	НастройкаПолей = ЗаданиеКладовщику.ДополнительныеСвойства.СтруктураНастройкиПолей.НастройкаПолей;
	
	Если НастройкаПолей.НайтиСтроки(Новый Структура("Имя, План", "Контейнер", Истина)).Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Строка Из ЗаданиеКладовщику.Товары Цикл
		Использование = ЗначениеЗаполнено(Строка.Контейнер);
		Если НЕ Использование Тогда
			СвойстваПоля = Новый Структура;
			СвойстваПоля.Вставить("ОбязательноеЗаполнение", Использование); 
			СвойстваПоля.Вставить("Ввод", Использование);    
			СвойстваПоля.Вставить("Вывод", Использование);    
			УстановитьНастройкуПолейДляИнструкцийЗадания(Строка, ЗаданиеКладовщику.НастройкаПолейСтрок, "Контейнер", СвойстваПоля);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;    
	
КонецФункции   

Функция ЗаполнитьПолеХарактеристикаСтрокЗадания(ЗаданиеКладовщику)  
	
	НастройкаПолей = ЗаданиеКладовщику.ДополнительныеСвойства.СтруктураНастройкиПолей.НастройкаПолей;
	
	Если НастройкаПолей.НайтиСтроки(Новый Структура("Имя", "Характеристика")).Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Строка Из ЗаданиеКладовщику.Товары Цикл
		План = ЗначениеЗаполнено(Строка.Характеристика);
		СвойстваПоля = Новый Структура;
		СвойстваПоля.Вставить("План", План);
		СвойстваПоля.Вставить("ОбязательноеЗаполнение", План); 
		СвойстваПоля.Вставить("Ввод", План);     
		СвойстваПоля.Вставить("Вывод", План);    
		СвойстваПоля.Вставить("Сборка", План);
		УстановитьНастройкуПолейДляИнструкцийЗадания(Строка, ЗаданиеКладовщику.НастройкаПолейСтрок, "Характеристика", СвойстваПоля);
	КонецЦикла;
	
	Возврат Истина;    
	
КонецФункции

Функция ЗаполнитьПолеТоварСтрокЗадания(ЗаданиеКладовщику)  
	
	НастройкаПолей = ЗаданиеКладовщику.ДополнительныеСвойства.СтруктураНастройкиПолей.НастройкаПолей;
	
	ПолеТоварМассив = НастройкаПолей.НайтиСтроки(Новый Структура("Имя", "Товар"));
	Если ПолеТоварМассив.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПолеТовар = ПолеТоварМассив[0];
	
	Для Каждого Строка Из ЗаданиеКладовщику.Товары Цикл
		СвойстваПоля = Новый Структура;
		Использование = ЗначениеЗаполнено(Строка.Номенклатура) ИЛИ НЕ ЗначениеЗаполнено(Строка.Контейнер);
		Если Использование Тогда
			Если ПолеТовар.План И НЕ ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				// товар не указан, разрешим ввод любого товара
				СвойстваПоля.Вставить("План", Ложь);
			КонецЕсли;
		Иначе
			// оперировать целыми контейнерами
			СвойстваПоля.Вставить("ОбязательноеЗаполнение", Использование); 
			СвойстваПоля.Вставить("Ввод", Использование);     
			СвойстваПоля.Вставить("Вывод", Использование);    
		КонецЕсли;

		Если СвойстваПоля.Количество() > 0 Тогда
			УстановитьНастройкуПолейДляИнструкцийЗадания(Строка, ЗаданиеКладовщику.НастройкаПолейСтрок, "Товар", СвойстваПоля);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;    
	
КонецФункции
	
//Устанавливает индивидуальные настройки полей для строк (инструкций) задания
//
//	Параметры:
//		ИнструкцииЗадания - Массив строк задания, одна строка задания, массив идентификаторов инструкций или один идентификатор инструкции
//		НастройкаПолейСтрок - таблица с настройками полей строк задания
//		Поля - Имена полей
//		Настройка - Структура со свойствами полей
Функция УстановитьНастройкуПолейДляИнструкцийЗадания(знач ИнструкцииЗадания, НастройкаПолейСтрок, знач Поля, Настройка) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	Если СтрНайти(Строка(ИнструкцииЗадания), "ДокументТабличнаяЧастьСтрока.")=1 ИЛИ НЕ РК.ДоступенОбходКоллекции(ИнструкцииЗадания) Тогда
		ИнструкцияЗадания = ИнструкцииЗадания;
		ИнструкцииЗадания = Новый Массив;
		ИнструкцииЗадания.Добавить(ИнструкцияЗадания);
	КонецЕсли;
	
	Поля = РК.ЗначениеВМассив(Поля, , Ложь);
	
	Для Каждого ИнструкцияЗадания Из ИнструкцииЗадания Цикл
		Если ТипЗнч(ИнструкцияЗадания)=Тип("Число") Тогда
			ИдентификаторИнструкции = ИнструкцияЗадания;
		ИначеЕсли ТипЗнч(ИнструкцияЗадания)=Тип("Строка") Тогда
			ИдентификаторИнструкции = Число(ИнструкцияЗадания);
		Иначе
			ИдентификаторИнструкции = ИнструкцияЗадания.ИдентификаторИнструкции;
		КонецЕсли;
		
		Для Каждого Поле Из Поля Цикл
			Для Каждого СвойствоПоля Из Настройка Цикл
				Отбор = Новый Структура("ИдентификаторИнструкции, ИмяПоля, ИмяСвойства", ИдентификаторИнструкции, Поле, СвойствоПоля.Ключ);
				СвойствоПоляИнструкцииМассив = НастройкаПолейСтрок.НайтиСтроки(Отбор);
				Если СвойствоПоляИнструкцииМассив.Количество()=0 Тогда
					СвойствоПоляИнструкции = НастройкаПолейСтрок.Добавить();
					ЗаполнитьЗначенияСвойств(СвойствоПоляИнструкции, Отбор);
				Иначе
					СвойствоПоляИнструкции = СвойствоПоляИнструкцииМассив[0];
				КонецЕсли;
				СвойствоПоляИнструкции.ЗначениеСвойства = СвойствоПоля.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецФункции

//
//					Настройка полей-
//
//////////////////////////////////////////////////////////////////

#КонецОбласти

#КонецЕсли
