#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДозаполнениеДокумента() Экспорт
	
	ДополнительныеСвойства.Вставить("СтруктураНастройкиПолей", СтруктураНастройкиПолей());
	
	ЗаполнитьИдентификаторыИнструкций();
	
	// Сетраков 10.10.2025
	Если Авто Тогда
		ДозаполнениеТоваровДокумента();
		СкопироватьДополнительныеСвойства();
	КонецЕсли;
	
	Документы.вмс_ЗаданиеКладовщику.ЗаполнитьНастройкуПолейСтрокДокумента(ЭтотОбъект);
	ЗаполнитьКачествоВСтрокахДокумента();
	
КонецФункции

Функция СтруктураНастройкиПолей() Экспорт
	
	Возврат Документы.вмс_ЗаданиеКладовщику.СтруктураНастройкиПолей(ЭтотОбъект);
	
КонецФункции

#КонецОбласти

Функция ДозаполнениеТоваровДокумента()
	
	// совместимость+
	Попытка
		СобиратьКонтейнеры = Правило.Контейнеры_СобиратьКонтейнеры;
	Исключение
		СобиратьКонтейнеры = Правило.СобиратьКонтейнеры;
	КонецПопытки;
	// совместимость-
	
	ИспользуетсяКачество = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля().Найти("Качество") <> Неопределено; 
	
	//Если ИспользуетсяКачество Тогда
	//	КачествоПоУмолчанию = Перечисления.вмс_КачествоТовара.Новый; 
	//Иначе
	//	КачествоПоУмолчанию = Перечисления.вмс_КачествоТовара.ПустаяСсылка();
	//КонецЕсли;
	
	Если Товары.Количество() <> 0 Тогда
		ШаблонТовары = Товары.Выгрузить(); 
		Товары.Очистить();
		ШаблонТовары.ЗаполнитьЗначения(КачествоПоУмолчанию, "Качество");
		Товары.Загрузить(ШаблонТовары);	
	КонецЕсли;
	Если ТоварыПоИнвентаризации.Количество() <> 0 Тогда
		ШаблонТоварыПоИнвентаризации = ТоварыПоИнвентаризации.Выгрузить(); 
		ТоварыПоИнвентаризации.Очистить();
		ШаблонТовары.ЗаполнитьЗначения(КачествоПоУмолчанию, "Качество");
		ТоварыПоИнвентаризации.Загрузить(ШаблонТоварыПоИнвентаризации);	
	КонецЕсли;
	
	Если Правило.ПодбиратьЯчейкиПолучатели Тогда
		// Сетраков 10.10.2025
		Если Правило.ПриниматьНаСлужебнуюЗонуПолучатель Тогда
			// ТУ_Августинович ++ 000058974 16.12.2025
			// - При обработке объектов или приемке, если СкладПолучатель не заполнен, то начинает генерировать (дублировать ячейки)
			СкладИсточник = ?(ЗначениеЗаполнено(СкладПолучатель), СкладПолучатель, Склад);
			ЗонаПолучатель = вмс_СкладыВызовСервера.ПолучитьЗонуСклада(СкладИсточник, Правило.ТипЗоныПолучателя);
			// ТУ_Августинович -- 16.12.2025
			Документы.вмс_ЗаданиеКладовщику.ПриИзмененииЗоныПолучателя(ЭтотОбъект);
		ИначеЕсли Правило.УстанавливатьЯчейкуПолучатель Тогда
			ЗонаПолучатель = Правило.ЗонаПолучатель;
			Документы.вмс_ЗаданиеКладовщику.ПриИзмененииЗоныПолучателя(ЭтотОбъект);
		ИначеЕсли Правило.РучнойВводЗоныПолучателя Тогда
			// ничего не заполняем
		Иначе
			Документы.вмс_ЗаданиеКладовщику.ПодобратьЯчейкиПолучатели(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
	Если Правило.ПодбиратьЯчейкиОтправители Тогда
		// совместимость+
		Попытка
			ИспользоватьЗонуОтправитель = Правило.ИспользоватьЗонуОтправитель;
		Исключение
			ИспользоватьЗонуОтправитель = Ложь;
		КонецПопытки;
		// совместимость-
		
		Если Правило.ОтгружатьСоСлужебнойЗоныОтправителя Тогда
			ЗонаОтправитель = вмс_СкладыВызовСервера.ПолучитьЗонуСклада(Склад, Правило.ТипЗоныОтправителя);
			Документы.вмс_ЗаданиеКладовщику.ПриИзмененииЗоныОтправителя(ЭтотОбъект);
		ИначеЕсли Правило.УстанавливатьЯчейкуОтправитель Тогда
			ЗонаОтправитель = Правило.ЗонаОтправитель;
			Документы.вмс_ЗаданиеКладовщику.ПриИзмененииЗоныОтправителя(ЭтотОбъект);
		ИначеЕсли ИспользоватьЗонуОтправитель Тогда
			// ничего не заполняем,
			// должна была заполниться по данным СКД в правиле заполнения
		Иначе
			Если Правило.ПодбиратьЯчейкиОтправители И Состояние=Перечисления.вмс_СостоянияЗаявокКладовщику.Обрабатывается Тогда
				Документы.вмс_ЗаданиеКладовщику.ПодобратьЯчейкиОтправители(ЭтотОбъект);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИспользуютсяСерии = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля().Найти("Серия") <> Неопределено;
	Если ИспользуютсяСерии Тогда
		ТаблицаИспользованияСерий = вмс_СерииТоваровСервер.ИспользованиеУчетаСерийПоТоварам(Товары.ВыгрузитьКолонку("Номенклатура"));
		НоменклатураСУчетомПоСериям = ТаблицаИспользованияСерий.Скопировать(Новый Структура("Используется", Истина)).ВыгрузитьКолонку("Товар");
		
		// способ ввода серии по факту должен быть установлен при внедрении заранее
		// в остальных случаях заполняем по умолчанию.
		Для каждого Строка Из Товары Цикл
			ВедениеСерийногоУчетаПоТовару = НоменклатураСУчетомПоСериям.Найти(Строка.Номенклатура) <> Неопределено;
			Если ЗначениеЗаполнено(Строка.Серия)Тогда
				Строка.СпособВводаСерии = Перечисления.вмс_СпособВводаСерии.ВПлане;
			ИначеЕсли ВедениеСерийногоУчетаПоТовару Тогда
				Строка.СпособВводаСерии = Перечисления.вмс_СпособВводаСерии.ПоФакту;
			Иначе
				Строка.СпособВводаСерии = Перечисления.вмс_СпособВводаСерии.НеУказывается;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Правило.ОтбиратьПоПомещениям Тогда
		УправляющееЗадание = РазделитьСборкуПоПомещениям();  
	ИначеЕсли вмс_ОбщегоНазначенияСервер.ИспользуютсяКонтейнеры() Тогда   
		// _ТУ_Прошин_28.11.25+
		// Если помещения есть - раздел по коробам проходит внутри раздела на помещения
		//УправляющееЗадание = РазделитьСборкуПоКонтейнерам();       
		// ТУ_Прошин_28.11.25-
	КонецЕсли;  
	
	// ТУ_Прошин_24.11.25+    
	//Если вмс_ОбщегоНазначенияСервер.ИспользуютсяКонтейнеры() Тогда  
	//	УправляющееЗадание = РазделитьСборкуПоКонтейнерам();	
	//КонецЕсли;	
	// ТУ_Прошин_24.11.25-
	
	ЗаполнитьИдентификаторыИнструкций();
	
КонецФункции

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Если ЭтоНовый() Тогда
			// сгенерировать уникальный номер в основной базе при загрузке из мобильной базы
			УстановитьНовыйНомер(); 
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// ТУ_Прошин_14.01.26
	// Если задание уже обработано на ТСД то данные методы заходить не нужно
	Если Не ПометкаУдаления И НЕ РаботаСЗаданиемНаТСДЗавершена() Тогда
		
		ДозаполнениеДокумента();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьНастройкуПолей() Экспорт
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ТУ_Прошин_20.01.26
	// Добавил проверку на управляющее задание
	Если НЕ УправляющееЗадание Тогда 
		СформироватьДвиженияПланируемыйПриходРасход(); 
	КонецЕсли;
	
	СформироватьДвиженияВыполнениеРаспоряжения();
	
	ЗаписатьСвязиЗадачи(Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если  ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ИнициализироватьДанные(ДанныеЗаполнения);
		ЗаполнениеДокументаПоРаспоряжению(ДанныеЗаполнения);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.вмс_ВыборочнаяИнвентаризация") Тогда
		// Заполнение реализовано через БСП в модуле менеджера задания кладовщику.
		//ЗаполнитьЗаданиеКладовщикуНаИнвентаризацию(ДанныеЗаполнения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗонаОтправитель) Тогда
		Документы.вмс_ЗаданиеКладовщику.ПриИзмененииЗоныОтправителя(ЭтотОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗонаПолучатель) Тогда
		Документы.вмс_ЗаданиеКладовщику.ПриИзмененииЗоныПолучателя(ЭтотОбъект);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КачествоПоУмолчанию) Тогда
		КачествоПоУмолчанию = Перечисления.вмс_КачествоТовара.КачествоПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДанные(ДанныеЗаполнения)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Функция ЗаполнениеДокументаПоРаспоряжению(ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.Процесс = "Приемка" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	ТоварыКПоступлениюОстатки.Серия КАК Серия,
		|	&ЯчейкаПриемник КАК ЯчейкаПриемник,
		|	&Ячейка КАК Ячейка,
		|	ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток КАК Количество,
		|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК Документ,
		|	&Качество КАК Качество
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки(, ДокументПоступления = &Распоряжение) КАК ТоварыКПоступлениюОстатки";
		
		Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
		Запрос.УстановитьПараметр("Ячейка", ЗонаОтправитель);
		Запрос.УстановитьПараметр("ЯчейкаПриемник", ЗонаПолучатель);
		Запрос.УстановитьПараметр("Качество", КачествоПоУмолчанию);
		
		Товары.Загрузить(Запрос.Выполнить().Выгрузить());  
		
	ИначеЕсли ДанныеЗаполнения.Процесс = "Размещение" Тогда
		
		ТоварыКРазмещению = ДанныеЗаполнения.ТаблицаРазмещения;
		Для каждого Строка Из ТоварыКРазмещению Цикл	
			СтрокаТЧ = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Строка);
			СтрокаТЧ.Ячейка = ЗонаОтправитель;
			СтрокаТЧ.Качество = КачествоПоУмолчанию;	
		КонецЦикла;   
		
	ИначеЕсли ДанныеЗаполнения.Процесс = "Отбор" Тогда
		// ТУ_ПРошин_13.01.26 Измерение склад упразнил но пока сам отбор по складу оставляю (из ячейки беру)
		Запрос = Новый Запрос;
		//Запрос.МенеджерВременныхТаблиц = ДанныеЗаполнения.МенеджерТоваров;
		Запрос.Текст = 		
		"ВЫБРАТЬ
		|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
		|	ТоварыКОтгрузкеОстатки.Серия КАК Серия,
		|	ТоварыКОтгрузкеОстатки.КОформлениюОстаток КАК КоличествоКОтгрузке,
		|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ,
		|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
		|	ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток, 0) КАК КоличествоВЯчейке,
		|	&ЯчейкаПриемник КАК ЯчейкаПриемник,
		|	ТоварыКОтгрузкеОстатки.Номенклатура.Представление КАК НоменклатураПредставление	
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ДокументОтгрузки = &Распоряжение) КАК ТоварыКОтгрузкеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(, Ячейка.ТипЯчейки В (&ЯчейкиДляОтбора)) КАК вмс_ОперацияПоЯчейкамОстатки
		|		ПО ТоварыКОтгрузкеОстатки.Склад = вмс_ОперацияПоЯчейкамОстатки.Ячейка.Владелец
		|			И ТоварыКОтгрузкеОстатки.Номенклатура = вмс_ОперацияПоЯчейкамОстатки.Товар
		|			И ТоварыКОтгрузкеОстатки.Характеристика = вмс_ОперацияПоЯчейкамОстатки.Характеристика
		|			И ТоварыКОтгрузкеОстатки.Серия = вмс_ОперацияПоЯчейкамОстатки.Серия
		|ИТОГИ
		|	МАКСИМУМ(КоличествоКОтгрузке),
		|	СУММА(КоличествоВЯчейке)
		|ПО
		|	Номенклатура";
		
		ЯчейкиДляОтбора = Новый Массив;
		ЯчейкиДляОтбора.Добавить(Перечисления.вмс_ТипыЯчеек.ЗонаПриемки);
		ЯчейкиДляОтбора.Добавить(Перечисления.вмс_ТипыЯчеек.Хранение);
		Запрос.УстановитьПараметр("Распоряжение", Распоряжение); // Заказ клиента.
		Запрос.УстановитьПараметр("ЯчейкаПриемник", ЗонаПолучатель); 
		Запрос.УстановитьПараметр("ЯчейкиДляОтбора", ЯчейкиДляОтбора);
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			ОсталосьСписать = ВыборкаНоменклатура.КоличествоКОтгрузке;
			Выборка = ВыборкаНоменклатура.Выбрать();
			Пока Выборка.Следующий() И ОсталосьСписать <> 0 Цикл
				
				Списываем = МИН(ОсталосьСписать, Выборка.КоличествоВЯчейке);
				СтрокаТЧ = Товары.Добавить();
				//СтрокаТЧ.Документ = Выборка.Документ;  
				СтрокаТЧ.Документ = ДанныеЗаполнения.Распоряжение;
				СтрокаТЧ.Номенклатура =Выборка.Номенклатура;
				СтрокаТЧ.Характеристика = Выборка.Характеристика;
				СтрокаТЧ.Серия = Выборка.Серия;
				СтрокаТЧ.ЯчейкаПриемник = Выборка.ЯчейкаПриемник;
				СтрокаТЧ.Ячейка = Выборка.Ячейка;
				СтрокаТЧ.Количество = Списываем;  
				СтрокаТЧ.Качество = КачествоПоУмолчанию;
				
				ОсталосьСписать = ОсталосьСписать - Списываем;
				
			КонецЦикла;
		КонецЦикла;
		
		
	ИначеЕсли ДанныеЗаполнения.Процесс = "Контроль" Тогда 
		
		//ТоварыККонтролю = ДанныеЗаполнения.ТоварыККонтролю;
		//Для каждого Строка Из ТоварыКРазмещению Цикл	
		//	СтрокаТЧ = Товары.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаТЧ, Строка);
		//КонецЦикла; 
		
	КонецЕсли;
	
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
		
	вмс_РаботаСКоллекциями.ВычитаниеМассивов(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьДвиженияПланируемыйПриходРасход()
	
	ТаблицаРегистра = ТаблицаДвиженийПланируемыйПриходРасход();
	
	НаборЗаписей = Движения.вмс_ОперацияПоЯчейкам;
	НаборЗаписей.Записывать = Истина;
	НаборЗаписей.Загрузить(ТаблицаРегистра); 
	
	Если ДополнительныеСвойства.Свойство("ОбменДанными") И ДополнительныеСвойства.ОбменДанными = Истина Тогда
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
	КонецЕсли;
	
КонецФункции

Функция ТаблицаДвиженийПланируемыйПриходРасход() Экспорт
	
	// При проведении документа формируем планируемые отборы и размещения в ячейки
	// В зависимости от статуса добавляем планируемые количества, либо убираем ранее созданый план.
	
	// Задача документа в фиксации плана. Он не отвечает за случаи, когда планируемый расход\приход
	// расходится с фактическим выполнением. После выполнения операции план "закрывается".
	
	// 221023812: Решить проблему двойного проведения: 1 - проводим подготовленный документ, формируется приход. 2 - при втором проведении должен добавиться расход, но остаться приход
	
	Таблица = Движения.вмс_ОперацияПоЯчейкам.ВыгрузитьКолонки();
	ВидДвижения = ВидДвиженияНакопления.Приход;
	
	Если ЗначениеЗаполнено(ВидДвижения) Тогда 
		
		Для Каждого СтрокаДокумента Из Товары Цикл 
			
			Если ЗначениеЗаполнено(СтрокаДокумента.Ячейка) ИЛИ ЗначениеЗаполнено(ЗонаОтправитель) Тогда
				СтрокаРегистра = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРегистра, СтрокаДокумента);    
				// ТУ_Прошин_14.01.26+
				СтрокаРегистра.Ячейка = ?(ЗначениеЗаполнено(СтрокаДокумента.Ячейка), СтрокаДокумента.Ячейка, ЗонаОтправитель);  
				// ТУ_Прошин_14.01.26-
				СтрокаРегистра.ПланируемыйРасход = СтрокаДокумента.Количество;
				ДозаполнитьСтрокуДвижения(СтрокаРегистра, СтрокаДокумента, ВидДвижения);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДокумента.ЯчейкаПриемник) ИЛИ ЗначениеЗаполнено(ЗонаПолучатель) Тогда
				СтрокаРегистра = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРегистра, СтрокаДокумента);  
				// ТУ_Прошин_14.01.26+
				СтрокаРегистра.Ячейка = ?(ЗначениеЗаполнено(СтрокаДокумента.ЯчейкаПриемник), СтрокаДокумента.ЯчейкаПриемник, ЗонаПолучатель);
				//СтрокаРегистра.Ячейка = СтрокаДокумента.ЯчейкаПриемник;   
				// ТУ_Прошин_14.01.26-
				СтрокаРегистра.ПланируемыйПриход = СтрокаДокумента.Количество;
				ДозаполнитьСтрокуДвижения(СтрокаРегистра, СтрокаДокумента, ВидДвижения);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// ТУ_Прошин_13.01.26+
	//Таблица.ЗаполнитьЗначения(Склад, "Склад");      
	// ТУ_Прошин_13.01.26-
	Таблица.ЗаполнитьЗначения(0, "Количество"); // для этого документа Количество ни к чему
	Таблица.ЗаполнитьЗначения(Дата, "Период");
	Таблица.ЗаполнитьЗначения(Ссылка, "Регистратор");
	Таблица.ЗаполнитьЗначения(Истина, "Активность");
	
	Возврат Таблица;
	
КонецФункции 

Функция СформироватьДвиженияВыполнениеРаспоряжения()
	
	Движения.вмс_ЗаданияКладовщикам.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.вмс_ЗаданияКладовщикам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Распоряжение = Распоряжение;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Операция = Операция;
		Движение.Характеристика = ТекСтрокаТовары.Характеристика;
		Движение.Серия = ТекСтрокаТовары.Серия;
		Движение.Упаковка = ТекСтрокаТовары.Упаковка;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.КоличествоБазовыхЕдиниц = ТекСтрокаТовары.КоличествоБазовыхЕдиниц;
	КонецЦикла;
	
КонецФункции

Процедура ЗаписатьСвязиЗадачи(Отказ, Режим)
	
	// регистр вмс_ЗадачиКладовщиков
	Если НЕ ЗначениеЗаполнено(Распоряжение) Тогда
		Возврат;
	КонецЕсли;
	Движения.вмс_ЗадачиКладовщиков.Записывать = Истина;
	Движение = Движения.вмс_ЗадачиКладовщиков.Добавить();
	Движение.Распоряжение = Распоряжение;
	Движение.ЗадачаКладовщика = Ссылка;
	Движение.Состояние = Состояние;   
	
КонецПроцедуры

Процедура ДозаполнитьСтрокуДвижения(СтрокаРегистра, СтрокаДокумента, ВидДвижения)
	
	СтрокаРегистра.Товар = СтрокаДокумента.Номенклатура;
	СтрокаРегистра.ВидДвижения = ВидДвижения;  
	СтрокаРегистра.Контейнер = СтрокаДокумента.Контейнер;
	СтрокаРегистра.Качество = СтрокаДокумента.Качество;
	
КонецПроцедуры

Функция ЗаполнитьИдентификаторыИнструкций()
	
	Если Товары.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаТовары = Товары.Выгрузить();
	ТаблицаТовары.Сортировать("ИдентификаторИнструкции");
	ИдентификаторИнструкции = ТаблицаТовары[Товары.Количество()-1].ИдентификаторИнструкции;
	
	ИсправленоИдентификаторов = Ложь;
	
	НеВалидныеИдентификаторы = Новый Соответствие;
	НеВалидныеИдентификаторы[0] = Истина;
	Для Каждого Строка Из Товары Цикл
		Если НеВалидныеИдентификаторы[Строка.ИдентификаторИнструкции]=Истина Тогда
			Если Строка.ИдентификаторИнструкции <> 0 Тогда
				ИсправленоИдентификаторов = ИсправленоИдентификаторов + 1;
			КонецЕсли;
			
			ИдентификаторИнструкции = ИдентификаторИнструкции + 1;
			Строка.ИдентификаторИнструкции = ИдентификаторИнструкции;
		Иначе
			// запретить повторение идентификаторов
			НеВалидныеИдентификаторы[Строка.ИдентификаторИнструкции] = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ИсправленоИдентификаторов > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Исправлены некорректные идентификаторы инструкций");
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьЗаданиеКладовщикуНаИнвентаризацию(ПлановаяИнвентаризация, Кладовщик) Экспорт
	
	Инвентаризация = Истина;
	Авто = Истина;
	АвтоНастройкаПолей = Истина;
	Склад = ПлановаяИнвентаризация.Склад;
	Операция = Справочники.вмс_Операции.ПолучитьЭлементСправочникаОперацииПоИмени("ПлановаяИнвентаризация");
	Комментарий = ПлановаяИнвентаризация.Комментарий;
	// ТУ_Алфимов 19.06.26 ++ // Нужно заполнять кодом созданного вами правила
	//Правило = Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.НайтиПоКоду("");
	//Правило = Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.НайтиПоРеквизиту("Имя" "ПлановаяИнвентаризация");
	// ТУ_Алфимов 19.06.26 --
	Распоряжение = ПлановаяИнвентаризация;
	Исполнитель = Справочники.вмс_НастройкиОператора.ПолучитьНастройкуОператораТСД(Кладовщик);
	// в инвентаризации ввод по факту
	вмс_УправлениеСвойствамиВызовСервера.УстановитьЗначенияДополнительныхРеквизитовОбъекта(ЭтотОбъект, Новый Структура("РазрешитьПревышениеКоличестваТовара", Истина));
	
	// ТУ_Алфимов Д.С. 21.04.26 ++ в инвентаризации могут найти товар на ячейке
	вмс_УправлениеСвойствамиВызовСервера.УстановитьЗначенияДополнительныхРеквизитовОбъекта(ЭтотОбъект, Новый Структура("РазрешитьВводОтсутствующегоТовара", Истина));
	// ТУ_Алфимов Д.С. 21.04.26 --
	
	СтрокиИсполнителя =  ПлановаяИнвентаризация.Товары.НайтиСтроки(Новый Структура("Исполнитель", Кладовщик));
	Для каждого СтрокаИсполнителя Из СтрокиИсполнителя Цикл
		нСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нСтрока, СтрокаИсполнителя); 
		нСтрока.Номенклатура = СтрокаИсполнителя.Товар;
		нСтрока.Количество = СтрокаИсполнителя.КоличествоПлан;
	КонецЦикла;
	
КонецФункции

Функция РазделитьСборкуПоПомещениям()
	
	ИспользуемыеПомещения = Товары.ВыгрузитьКолонку("Помещение");
	вмс_РаботаСКоллекциями.УдалитьДублиВМассиве(ИспользуемыеПомещения);
	
	Если ЗначениеЗаполнено(ИспользуемыеПомещения) Тогда
		
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			СсылкаНаОсновноеЗадание = Документы.вмс_ЗаданиеКладовщику.ПолучитьСсылку();
			УстановитьСсылкуНового(СсылкаНаОсновноеЗадание);
		Иначе
			СсылкаНаОсновноеЗадание = Ссылка;
		КонецЕсли;
		
		Для каждого мПомещение Из ИспользуемыеПомещения Цикл
			// ТУ_Прошин_27.11.25 
			Если вмс_ОбщегоНазначенияСервер.ИспользуютсяКонтейнеры() Тогда          
				ПараметрыСборки = ИнициализироватьПараметрыСборки();  
				ПараметрыСборки.Помещение = мПомещение;  
				ПараметрыСборки.СсылкаНаОсновноеЗадание = СсылкаНаОсновноеЗадание;
				ПараметрыСборки.ТаблицаТоваров = Товары.Выгрузить(Новый Структура("Помещение", мПомещение),);
				
				ЗаданияСформированы = РазделитьСборкуПоКонтейнерам(ПараметрыСборки);
				Если ЗаданияСформированы Тогда
					Продолжить;	
				КонецЕсли;	
			КонецЕсли;		
			// ТУ_Прошин_27.11.25-
			НовоеЗадание = Документы.вмс_ЗаданиеКладовщику.СоздатьДокумент();
			НовоеЗадание.Заполнить(Неопределено);
			ЗаполнитьЗначенияСвойств(НовоеЗадание, ЭтотОбъект,,"Номер, Дата");
			НовоеЗадание.Дата = Дата + 1;
			НовоеЗадание.Авто = Ложь;
			НовоеЗадание.Помещение = мПомещение;
			НовоеЗадание.ОсновноеЗадание = СсылкаНаОсновноеЗадание;
			
			НовоеЗадание.Товары.Загрузить(Товары.Выгрузить(Новый Структура("Помещение", мПомещение),));
			//НовоеЗадание.НастройкаПолей.Загрузить(НастройкаПолей.Выгрузить());
			//НовоеЗадание.СборщикиДанных.Загрузить(СборщикиДанных.Выгрузить());
			//НовоеЗадание.НастройкаСтраниц.Загрузить(НастройкаСтраниц.Выгрузить());
			
			НовоеЗадание.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьКачествоВСтрокахДокумента()
	
	Для каждого Строка Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Качество) Тогда
			Строка.Качество = КачествоПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция РазделитьСборкуПоКонтейнерам(ПараметрыСборки = Неопределено)
	
	РК = вмс_РаботаСКоллекциями;
	// ТУ_Прошин_28.11.25+    
	Если ПараметрыСборки <> Неопределено Тогда  
		ТаблицаКонтейнеров = ПараметрыСборки.ТаблицаТоваров;
		Помещение = ПараметрыСборки.Помещение;  
		СсылкаНаОсновноеЗадание = ПараметрыСборки.СсылкаНаОсновноеЗадание;
	Иначе
		Помещение = Справочники.вмс_Помещения.ПустаяСсылка();
		ТаблицаКонтейнеров = Товары.Выгрузить();	   
		СсылкаНаОсновноеЗадание = Неопределено;
	КонецЕсли;
	
	// ТУ_Прошин_28.11.25-
	// ТаблицаКонтейнеров = Товары.Выгрузить(); 
	КолонкиТаблицы = РК.ПолучитьКолонкиКоллекции(ТаблицаКонтейнеров); 
	ТаблицаТоваров = РК.НоваяТаблицаЗначений(РК.МассивВСтроку(КолонкиТаблицы));
	
	ПустойКонтейнер = Справочники.вмс_Контейнеры.ПустаяСсылка();
	
	ОтборСтрокТоваров= Новый Структура("Контейнер", ПустойКонтейнер);
	НайденныеСтроки = ТаблицаКонтейнеров.НайтиСтроки(ОтборСтрокТоваров);  	
	
	РК.ДобавитьЭлементыКоллекции(ТаблицаТоваров, НайденныеСтроки);   
	РК.УдалитьЭлементыКоллекции(ТаблицаКонтейнеров, НайденныеСтроки);
	
	Если ТаблицаТоваров.Количество() = 0 ИЛИ ТаблицаКонтейнеров.Количество() = 0 Тогда 
		// нет смысла разбивать
		Возврат Ложь;
	КонецЕсли;   
	
	Если СсылкаНаОсновноеЗадание = Неопределено Тогда
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			СсылкаНаОсновноеЗадание = Документы.вмс_ЗаданиеКладовщику.ПолучитьСсылку();
			УстановитьСсылкуНового(СсылкаНаОсновноеЗадание);
		Иначе
			СсылкаНаОсновноеЗадание = Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ТаблицаТоваров");
	ДанныеЗаполнения.Вставить("Комментарий");
	ДанныеЗаполнения.Вставить("Помещение");
	
	ДанныеЗаполнения.ТаблицаТоваров = ТаблицаТоваров;
	ДанныеЗаполнения.Комментарий = "Без контейнеров";
	ДанныеЗаполнения.Помещение = Помещение;
	СоздатьЗаданиеКладовщикуОтУправляющегоЗадания(СсылкаНаОсновноеЗадание, ДанныеЗаполнения);
	
	ДанныеЗаполнения.ТаблицаТоваров = ТаблицаКонтейнеров;
	ДанныеЗаполнения.Комментарий = "По контейнерам";
	ДанныеЗаполнения.Помещение = Помещение;
	СоздатьЗаданиеКладовщикуОтУправляющегоЗадания(СсылкаНаОсновноеЗадание, ДанныеЗаполнения);
	
	Возврат Истина;
	
КонецФункции  

Функция СоздатьЗаданиеКладовщикуОтУправляющегоЗадания(СсылкаНаОсновноеЗадание, ДанныеЗаполнения)
	
	НовоеЗадание = Документы.вмс_ЗаданиеКладовщику.СоздатьДокумент();
	НовоеЗадание.Заполнить(Неопределено);
	ЗаполнитьЗначенияСвойств(НовоеЗадание, ЭтотОбъект,,"Номер, Дата");
	НовоеЗадание.Дата = Дата + 1;
	НовоеЗадание.Авто = Ложь;
	НовоеЗадание.Комментарий = НовоеЗадание.Комментарий + " " + ДанныеЗаполнения.Комментарий;
	НовоеЗадание.ОсновноеЗадание = СсылкаНаОсновноеЗадание;
	НовоеЗадание.Товары.Загрузить(ДанныеЗаполнения.ТаблицаТоваров);
	НовоеЗадание.Помещение = ДанныеЗаполнения.Помещение;
	
	//НовоеЗадание.НастройкаПолей.Загрузить(НастройкаПолей.Выгрузить());
	//НовоеЗадание.СборщикиДанных.Загрузить(СборщикиДанных.Выгрузить());
	//НовоеЗадание.НастройкаСтраниц.Загрузить(НастройкаСтраниц.Выгрузить());
	
	
	НовоеЗадание.Записать(РежимЗаписиДокумента.Проведение);
	
КонецФункции 

Функция ИнициализироватьПараметрыСборки()   
	
	ПараметрыСборки = Новый Структура("Помещение, ТаблицаТоваров, СсылкаНаОсновноеЗадание");
	Возврат ПараметрыСборки;       
	
КонецФункции

Функция РаботаСЗаданиемНаТСДЗавершена()
	
	Если Состояние = Перечисления.вмс_СостоянияЗаявокКладовщику.Завершена Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Состояние = Перечисления.вмс_СостоянияЗаявокКладовщику.ЗавершенаСОшибками Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Состояние = Перечисления.вмс_СостоянияЗаявокКладовщику.ЗавершенаСРасхождением Тогда
		Возврат Истина;	
	КонецЕсли;	
	
	Возврат Ложь;   
	
КонецФункции

Функция СкопироватьДополнительныеСвойства()
	
	// ТУ_Алфимов Д.С. 21.04.26 ++ Очистка плановой инвентаризации запрещена
	Если НЕ Операция.ИмяДляПоиска = "ПлановаяИнвентаризация" Тогда
		ТаблицаДополнительныхРеквизитов = вмс_УправлениеСвойствамиСервер.ПолучитьТаблицуДополнительныхРеквизитовОбъекта(Правило);
		ТаблицаДополнительныхРеквизитов.Колонки.ЗначениеСвойства.Имя = "Значение";
		
		ДополнительныеРеквизиты.Очистить();
		Для Каждого СтрокаЗначенияДополнительногоРеквизитаИсточника Из ТаблицаДополнительныхРеквизитов Цикл
			СтрокаЗначенияДополнительногоРеквизита = ДополнительныеРеквизиты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗначенияДополнительногоРеквизита, СтрокаЗначенияДополнительногоРеквизитаИсточника);
		КонецЦикла;
	КонецЕсли;
	// ТУ_Алфимов Д.С. 21.04.26 --
КонецФункции

#КонецОбласти

#КонецЕсли
