#Область ДОКУМЕНТЫ



Функция ДозаполнитьДокумент(Документ) Экспорт
	
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ДозаполнитьДокумент(Документ);
	
КонецФункции

Функция ПолучитьИмяТабличнойЧасти() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяТабличнойЧастиПоУмолчанию();
КонецФункции 

Функция ПолучитьИмяТабличнойЧастиПродукция() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяТабличнойЧастиПроизводство();
КонецФункции

Функция ПолучитьИмяБазовогоДокумента() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяБазовогоДокумента();
КонецФункции

Функция ПолучитьИмяПриходногоДокумента() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяПриходногоДокумента();
КонецФункции

Функция ПолучитьДокументыСНесколькимиТЧ() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьДокументыСНесколькимиТЧ();
КонецФункции



#КонецОбласти

#Область СПРАВОЧНИКИ




Функция ИспользуютсяХарактеристики() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИспользуютсяХарактеристики();
КонецФункции

Функция ИспользуютсяСерии() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИспользуютсяСерии();
КонецФункции

Функция ПолучитьИмяСправочникаСерии() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяСправочникаСерии();
КонецФункции

Функция ИмяКолонкиХарактеристика() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяКолонкиХарактеристика();
КонецФункции 

Функция ИмяКолонкиФизЛицо() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяКолонкиФизЛицо();
КонецФункции 

Функция ИмяКолонкиФайлКартинки() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяКолонкиФайлКартинки();
КонецФункции 

Функция ИмяСправочникаНоменклатураПрисоединенныеФайлы() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяСправочникаНоменклатураПрисоединенныеФайлы();
КонецФункции 

Функция ПолучитьИмяСправочникаДополнительныхОтчетовИОбработок() Экспорт
	
	ВариантыСправочников = Новый Массив;
	ВариантыСправочников.Добавить("Справочник.ДополнительныеОтчетыИОбработки");
	ВариантыСправочников.Добавить("Справочник.вмс_ПечатныеФормы");
	
	Для Каждого ИмяСправочника Из ВариантыСправочников Цикл
		Если Метаданные.НайтиПоПолномуИмени(ИмяСправочника) <> Неопределено Тогда
			Возврат ИмяСправочника;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьИмяТипаУчетныхЗаписей() Экспорт
	
	Возврат "Справочник.УчетныеЗаписиЭлектроннойПочты";
	
КонецФункции

Функция ПустаяХарактеристика() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПустаяХарактеристика();
КонецФункции



#КонецОбласти

#Область СКЛАДЫ



Функция ПолучитьИмяСправочникаСклады() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяСправочникаСклады();
КонецФункции  

Функция ПолучитьИмяСкладаЗапрос() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяСкладаЗапрос();
КонецФункции

Функция ПустойСклад() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПустойСклад();
КонецФункции

Функция ПолучитьТипСкладаОптовый() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ТипОптовогоСклада();
КонецФункции 

Функция ПолучитьИмяПараметраТипСклада() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяПараметраТипСклада();
КонецФункции

Функция ИмяСправочникаФизЛица() Экспорт
	
	ИмяСправочникаФизЛица = ВыполнитьМетодАдаптации("ИмяСправочникаФизЛица");
	
	Если ИмяСправочникаФизЛица=Неопределено Тогда
		ИмяСправочникаФизЛица = "ФизическиеЛица";
	КонецЕсли;
	
	Возврат ИмяСправочникаФизЛица;
		
КонецФункции 

Функция ПолучитьВладельцаЯчейки(ИзначальныйВладелец) Экспорт
	
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьВладельцаЯчейки(ИзначальныйВладелец);
	
КонецФункции



#КонецОбласти

#Область УПАКОВКИ



Функция ПустаяУпаковка() Экспорт	
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПустаяУпаковка();
КонецФункции

Функция ПолучитьИмяСправочникаУпаковки() Экспорт
	
	УстановитьБезопасныйРежим(Истина); 
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяСправочникаУпаковки();
	
КонецФункции

Функция КоэффициентУпаковки(Упаковка, Номенклатура) Экспорт

	УстановитьБезопасныйРежим(Истина); 
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().КоэффициентУпаковки(Упаковка, Номенклатура);
	
КонецФункции

Функция ПолучитьИмяТипаСправочникаУпаковки() Экспорт
	
	УстановитьБезопасныйРежим(Истина); 
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяТипаСправочникаУпаковки();
	
КонецФункции

Функция ТекстЗапросаОбъемНоменклатуры(ИсточникУпаковки, ИсточникНоменклатуры) Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ТекстЗапросаОбъемНоменклатуры(ИсточникУпаковки, ИсточникНоменклатуры);
КонецФункции

Функция ТекстЗапросаВесНоменклатуры(ИсточникУпаковки, ИсточникНоменклатуры) Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ТекстЗапросаВесНоменклатуры(ИсточникУпаковки, ИсточникНоменклатуры);
КонецФункции

Функция ИмяКолонкиЕдиницаИзмерения() Экспорт
	
	УстановитьБезопасныйРежим(Истина); 
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяКолонкиЕдиницыИзмерения();
	
КонецФункции

Функция ИмяРеквизитаНоменклатурыЕдиницаИзмерения() Экспорт
	
	УстановитьБезопасныйРежим(Истина); 
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяРеквизитаНоменклатурыЕдиницаИзмерения();
	
КонецФункции

Функция ПолучитьЕдиницыИзмеренияТоваров(Строки) Экспорт
	
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьЕдиницыИзмеренияТоваров(Строки);
		
КонецФункции

Функция ПолучитьУпаковкиТоваров(Товары) Экспорт
	
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьУпаковкиТоваров(Товары);
		
КонецФункции

Функция СоздатьИПолучитьУпаковкуТовара(Товар, Коэффициент) Экспорт
	
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().СоздатьИПолучитьУпаковкуТовара(Товар, Коэффициент);
		
КонецФункции

Функция ВесОбъемБазовойУпаковки(Товар) Экспорт
	УстановитьБезопасныйРежим(Истина); 
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ВесОбъемБазовойУпаковки(Товар);	
КонецФункции


#КонецОбласти

#Область ПЕЧАТЬ_ЭТИКЕТКИ



Функция ПечатьЭтикеткиТовара(ВходящиеДанные) Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПечатьЭтикеткиТовара(ВходящиеДанные);
КонецФункции




#КонецОбласти

#Область ПАРАМЕТРЫ_УЧЕТА


Функция ОпределитьМаркируемыеТовары(Товары) Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ОпределитьМаркируемыеТовары(Товары);
КонецФункции

Функция ПолучитьВидыТоваров(Товары) Экспорт	
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьВидыТоваров(Товары);
КонецФункции

Функция ПолучитьИспользованиеХарактеристикТоваровИПолучитьВладельцаДляВыбора(ВходящиеДанные) Экспорт

	УстановитьБезопасныйРежим(Истина); 
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьИспользованиеХарактеристикТоваровИПолучитьВладельцаДляВыбора(ВходящиеДанные);
	
КонецФункции

Функция ПолучитьДинамическиеПараметрыНоменклатуры(ПараметрыОтбора) Экспорт

	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьДинамическиеПараметрыНоменклатуры(ПараметрыОтбора);
	
КонецФункции

Функция ПолучитьСтатическиеПараметрыНоменклатуры() Экспорт

	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьСтатическиеПараметрыНоменклатуры();

КонецФункции

Функция ПолучитьОстатокТовараПоОсновномуУчету(Товар) Экспорт
	
	ТаблицаОстатков = ПолучитьОстаткиТоваровПоОсновномуУчету(Товар);

	Если ТаблицаОстатков <> Неопределено И ТаблицаОстатков.Количество() > 0 Тогда
		
		Возврат ТаблицаОстатков[0].Остаток;
		
	КонецЕсли;
	
КонецФункции 

Функция ПолучитьОстаткиТоваровПоОсновномуУчету(Товары) Экспорт
	
	ТаблицаОстатков = ВыполнитьМетодАдаптации("ПолучитьОстаткиТоваровПоОсновномуУчету", Товары);
	
	Возврат ТаблицаОстатков;
		
КонецФункции 

Функция СтроковоеПредставлениеОстатковНаСкладе(Товар) Экспорт
	
	СтроковоеПредставление = ВыполнитьМетодАдаптации("СтроковоеПредставлениеОстатковНаСкладе", Товар);
	
	Возврат СтроковоеПредставление;
		
КонецФункции

Функция ПолучитьИмяТипаСсылкиУчетныхЗаписей() Экспорт
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ПолучитьИмяТипаСсылкиИзИмениТипаОбъекта(ПолучитьИмяТипаУчетныхЗаписей());
	
КонецФункции

Функция ИмяРеквизитаНоменклатурыВладелецСерии() Экспорт

	ИмяРеквизитаНоменклатурыВладелецСерии = ВыполнитьМетодАдаптации("ИмяРеквизитаНоменклатурыВладелецСерии");
	
	Если ИмяРеквизитаНоменклатурыВладелецСерии=Неопределено Тогда
		ИмяРеквизитаНоменклатурыВладелецСерии = "ВидНоменклатуры";
	КонецЕсли;
	
	Возврат ИмяРеквизитаНоменклатурыВладелецСерии;

КонецФункции

Функция ИмяРеквизитаВладелецСерии() Экспорт

	ИмяРеквизитаВладелецСерии = ВыполнитьМетодАдаптации("ИмяРеквизитаВладелецСерии");
	
	Если ИмяРеквизитаВладелецСерии=Неопределено Тогда
		ИмяРеквизитаВладелецСерии = "ВидНоменклатуры";
	КонецЕсли;
	
	Возврат ИмяРеквизитаВладелецСерии;

КонецФункции

Функция ИмяРеквизитаНомерСерии() Экспорт

	ИмяРеквизитаНомерСерии = ВыполнитьМетодАдаптации("ИмяРеквизитаНомерСерии");
	
	Если ИмяРеквизитаНомерСерии=Неопределено Тогда
		ИмяРеквизитаНомерСерии = "Номер";
	КонецЕсли;
	
	Возврат ИмяРеквизитаНомерСерии;

КонецФункции

Функция ПолучитьТипыДанныхКонфигурации() Экспорт
	
	ТипыДанных = Новый ТаблицаЗначений;
	ТипыДанных.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ТипыДанных.Колонки.Добавить("ТипДанных", Новый ОписаниеТипов("Строка")); 
	
	вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьТипыДанныхКонфигурации(ТипыДанных);
	
	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Качество", "Перечисление.вмс_КачествоТовара");
	
	Возврат ТипыДанных;
	
КонецФункции

Функция ПолучитьСписокТоваровПоВводуСтроки(Текст) Экспорт
	 Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьСписокТоваровПоВводуСтроки(Текст);
КонецФункции

Функция ПолучитьКлючиАналитикиНоменклатуры() Экспорт
	
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьКлючиАналитикиНоменклатуры();
	
КонецФункции 

Функция ПривязатьФотографиюКНоменклатуре(Номенклатура, ХранилищеФайла) Экспорт
	
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПривязатьФотографиюКНоменклатуре(Номенклатура, ХранилищеФайла);
	
КонецФункции

Функция ПолучитьИменаРаспоряжений() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьИменаРаспоряжений();
КонецФункции

Функция ПолучитьСоответствияИменСправочников() Экспорт
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьСоответствияИменСправочников();
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ВыполнитьМетодАдаптации(ИмяМетода, Параметр1=null, Параметр2=null, Параметр3=null, Параметр4=null)

	ПрефиксФункции = ПрефиксФункции();
	Если ПрефиксФункции=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПолноеИмяМетода = ПрефиксФункции + ИмяМетода;
	
	Параметры = Новый Массив;
	Параметры.Добавить(Параметр1);
	Параметры.Добавить(Параметр2);
	Параметры.Добавить(Параметр3);
	Параметры.Добавить(Параметр4);
	СтрокаПараметров = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтрокуПараметровМетода(Параметры);
	
	Попытка
		Результат = Вычислить(ПолноеИмяМетода + СтрокаПараметров);
		Возврат Результат;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Если СтрНайти(ОписаниеОшибки, "не определена (" + ИмяМетода + ")") > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если СтрНайти(ОписаниеОшибки, "Метод объекта не обнаружен (" + ИмяМетода + ")") > 0 ИЛИ СтрНайти(ОписаниеОшибки, "Object method not found (" + ИмяМетода + ")") > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ВызватьИсключение ОписаниеОшибки;
	КонецПопытки

КонецФункции

Функция ПрефиксФункции() Экспорт
	
	Если ЭтоУТ103() Тогда
		Возврат "вмс_АдаптацияКонфигурацийУТ10.";
	ИначеЕсли ЭтоУТ() Тогда 
		Возврат "вмс_АдаптацияКонфигурацийУТ.";
	ИначеЕсли ЭтоУНФ() Тогда
		Возврат "вмс_АдаптацияКонфигурацийУНФ.";
	ИначеЕсли ЭтоБП() Тогда 
		Возврат "вмс_АдаптацияКонфигурацийБП.";
	ИначеЕсли ЭтоАвтосалон() Тогда 
		Возврат "вмс_АдаптацияКонфигурацийАвтасалон.";   
	ИначеЕсли ЭтоЕРП() Тогда
		Возврат "вмс_АдаптацияКонфигурацийЕРП."; 
	ИначеЕсли ЭтоУАТ() Тогда 
		Возврат "вмс_АдаптацияКонфигурацийУАТ.";
	КонецЕсли;
		
КонецФункции

Функция ЭтоЕРП() Экспорт
	
	Возврат ПроверитьИменаКонфигурации("УправлениеПредприятием");

КонецФункции

Функция ЭтоУТ() Экспорт
	
	Возврат ПроверитьИменаКонфигурации("УправлениеТорговлей, КомплекснаяАвтоматизация");
	
КонецФункции

Функция ЭтоКА() Экспорт
	
	Возврат ПроверитьИменаКонфигурации("КомплекснаяАвтоматизация");
	
КонецФункции

Функция ЭтоУТ103() Экспорт
	
	Возврат Метаданные.Имя = "УправлениеТорговлей" И СтрНайти(Метаданные.Версия, "10.") = 1;
	
КонецФункции

Функция ЭтоУНФ() Экспорт
	
	Возврат ПроверитьИменаКонфигурации("УправлениеНебольшойФирмой");

КонецФункции  

Функция ЭтоБП() Экспорт
	
	Возврат ПроверитьИменаКонфигурации("БухгалтерияПредприятия");
				
КонецФункции

Функция ЭтоАвтосалон() Экспорт
	
	Возврат СтрНайти(Метаданные.Имя, "Автосалон")=1;
				
КонецФункции

Функция ЭтоУАТ() Экспорт     
	
	Возврат ПроверитьИменаКонфигурации("УправлениеАвтотранспортомПроф");

КонецФункции


Функция ПроверитьИменаКонфигурации(Имена) Экспорт
	
	МассивДопустимыхИмен = вмс_РаботаСКоллекциями.ЗначениеВМассив(Имена, , Ложь);
	
	ИмяКонфигурации = Метаданные.Имя;
	
	Для Каждого Имя Из МассивДопустимыхИмен Цикл  		
		Если СтрНайти(ИмяКонфигурации, Имя) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ИерархическийСправочник(Знач ИмяСправочника) Экспорт
	
	ПолноеИмяСправочника = ИмяСправочника; 
	
	ПозицияТочки = Найти(ПолноеИмяСправочника, ".");
	Если ПозицияТочки = 0 Тогда
		ПолноеИмяСправочника = "Справочник."+ПолноеИмяСправочника;		
	КонецЕсли; 
	
	ПозицияТипа = Найти(ПолноеИмяСправочника, "Справочник");
	Если ПозицияТипа = 0 Тогда
		ПолноеИмяСправочника = "Справочник."+ПолноеИмяСправочника;		
	КонецЕсли;

	ИмяМенеджера = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьИмяМенеджераОбъектаПоИмениТипа(ПолноеИмяСправочника); 
	
	Если ИмяМенеджера <> Неопределено Тогда
		Возврат Метаданные.Справочники[ИмяСправочника].Иерархический И Метаданные.Справочники[ИмяСправочника].ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов;
	КонецЕсли;
	
	
КонецФункции

#КонецОбласти

Функция ИмяРеквизитаНоменклатурыВид() Экспорт
	
	УстановитьБезопасныйРежим(Истина); 
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ИмяРеквизитаНоменклатурыВид();
	
КонецФункции   

Функция ПолучитьИмяТипаНоменклатурыТовар() Экспорт   
	Возврат вмс_АдаптацияКонфигурацийПовтИсп.МодульАдаптации().ПолучитьИмяТипаНоменклатурыТовар();
КонецФункции

