#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОХР_ЦеныТарифицируемыхУслуг.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.ОХР_ЦеныТарифицируемыхУслуг.Добавить();
		Движение.Период = Дата;
		Движение.ТипТары = ТекСтрокаТовары.ТипТары;
		Движение.Операция = ТекСтрокаТовары.Операция;
		Движение.Контрагент = Контрагент;
		Движение.Цена = ТекСтрокаТовары.Цена; 
		
	КонецЦикла;

КонецПроцедуры
#КонецЕсли