//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

Функция СоздатьЭлементыФормы(Форма, ОписаниеФормы) Экспорт
	МассивНовыхЭлементов = Новый Массив;
	МассивНовыхРеквизитовФормы = Новый Массив;
	Для Каждого ОписаниеЭлемента Из ОписаниеФормы.Элементы Цикл
		Если ОписаниеЭлемента.ТипЭлемента = 1 Тогда
			ТипЭлементаФормы = Тип("ГруппаФормы");
		ИначеЕсли ОписаниеЭлемента.ТипЭлемента = 2 Тогда
			ТипЭлементаФормы = Тип("ПолеФормы");
		Иначе
			Продолжить;
		КонецЕсли;
		
		ЭлементФормы = Форма.Элементы.Найти(ОписаниеЭлемента.ИмяЭлементаФормы);
		Если ЭлементФормы <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеРодителяЭлемента = ОписаниеЭлемента.Родитель;
		ИмяРодителяЭлементаФормы = ОписаниеРодителяЭлемента.ИмяЭлементаФормы;
		Если ИмяРодителяЭлементаФормы = "" Тогда
			Продолжить;
		КонецЕсли;
		
		РодительЭлементаФормы = Форма.Элементы.Найти(ИмяРодителяЭлементаФормы);
		Если РодительЭлементаФормы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяНовогоЭлементаФормы = ПолучитьИмяНовогоЭлементаФормы(Форма);
		ОписаниеЭлемента.ИмяЭлементаФормы = ИмяНовогоЭлементаФормы;
		НовыйЭлементФормы = Форма.Элементы.Добавить(ИмяНовогоЭлементаФормы, ТипЭлементаФормы, РодительЭлементаФормы);
		Если ОписаниеЭлемента.ТипЭлемента = 1 Тогда
			НовыйЭлементФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НовыйЭлементФормы.ОтображатьЗаголовок = Ложь;
			НовыйЭлементФормы.Отображение = ОписаниеЭлемента.Свойства.Отображение;
			НовыйЭлементФормы.Группировка = ОписаниеЭлемента.Свойства.Группировка;
		ИначеЕсли ОписаниеЭлемента.ТипЭлемента = 2 Тогда
			НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеНадписи;
			НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НовыйЭлементФормы.АвтоМаксимальнаяШирина = Ложь; 
		КонецЕсли;

		НовыйЭлементФормы.Ширина = ОписаниеЭлемента.Свойства.Ширина;
		НовыйЭлементФормы.Высота = ОписаниеЭлемента.Свойства.Высота;
		
		Если ОписаниеЭлемента.Реквизит <> Неопределено Тогда
			ИмяНовогоРеквизитаФормы = ИмяНовогоЭлементаФормы;

			ОписаниеРеквизитаФормы = ОписаниеЭлемента.Реквизит;
			ОписаниеРеквизитаФормы.ПутьКДанным = ИмяНовогоРеквизитаФормы;
			
			НовыйРеквизитФормы = Новый РеквизитФормы(ИмяНовогоРеквизитаФормы, ОписаниеРеквизитаФормы.Тип);
			МассивНовыхРеквизитовФормы.Добавить(НовыйРеквизитФормы);
		КонецЕсли;
		
		МассивНовыхЭлементов.Добавить(ОписаниеЭлемента);
		
	КонецЦикла;
	
	Если МассивНовыхРеквизитовФормы.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(МассивНовыхРеквизитовФормы);
	КонецЕсли;
	
	Для Каждого ОписаниеЭлемента Из МассивНовыхЭлементов Цикл
		ОписаниеРеквизитаФормы = ОписаниеЭлемента.Реквизит;
		
		Если ОписаниеРеквизитаФормы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементФормы = Форма.Элементы.Найти(ОписаниеЭлемента.ИмяЭлементаФормы);
		ЭлементФормы.ПутьКДанным = ОписаниеЭлемента.Реквизит.ПутьКДанным;
		
		ПоляЭлемента = ОписаниеРеквизитаФормы.Поля;
		ЧастиФорматированнойСтроки = Новый Массив;
		Для Каждого ПолеЭлемента Из ПоляЭлемента Цикл
			Если ПолеЭлемента.ТипПоля = 0 Тогда
				ПредставлениеПоля = ПолеЭлемента.Значение;
			Иначе
				ПредставлениеПоля = "<" + ПолеЭлемента.Значение + ">";
			КонецЕсли;
			
			ЧастиФорматированнойСтроки.Добавить(ПредставлениеПоля);
		КонецЦикла;
		
		Форма[ОписаниеРеквизитаФормы.ПутьКДанным] = Новый ФорматированнаяСтрока(ЧастиФорматированнойСтроки);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьИмяНовогоЭлементаФормы(Форма)

	Префикс = "ДинамическийЭлемент";
	НомерЭлемента = 1;
	
	Пока Истина Цикл
		НомерЭлементаСтрокой = Формат(НомерЭлемента, "ЧГ=0");
		ИмяЭлемента = Префикс + НомерЭлементаСтрокой;
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			Возврат ИмяЭлемента;
		КонецЕсли;
		НомерЭлемента = НомерЭлемента + 1;
	КонецЦикла;
	
КонецФункции
