
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ссылка = Параметры.Ссылка;
	
	ЗаполнитьСпискиВыбораЭлементовФормы();
	ЗаполнитьКонтекстФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбновитьПрефикс();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипАгрегатаПриИзменении(Элемент)
	
	Если ТипАгрегата = МодульКлиента().Перечисление_ТипыАгрегатов().Палета Тогда
		КодТипаАгрегата = 1;
	Иначе
		КодТипаАгрегата = 0;
	КонецЕсли;
	
	ЗаполнитьСерийныйНомер();
	
КонецПроцедуры

&НаКлиенте
Процедура КодТипаАгрегатаПриИзменении(Элемент)
	
	ЗаполнитьСерийныйНомер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКодаПриИзменении(Элемент)
	
	ЗаполнитьТипШтрихкода();
	ЗаполнитьСерийныйНомер();
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныйНомерПриИзменении(Элемент)
	
	СерийныйНомерИзмененВручную = Истина;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти

// #Область ПроверкаЗаполнения

&НаКлиенте
Функция ПроверитьЗаполнениеПолей()
	
	ОчиститьСообщения();
	
	Возврат ПроверитьЗаполнениеПолейНаСервере();
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеПолейНаСервере()
	
	ЕстьОшибки = Не ПроверитьЗаполнение();
	
	ПроверитьПрефикс(ЕстьОшибки);
	ПроверитьСерийныйНомер(ЕстьОшибки);
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура ПроверитьПрефикс(ЕстьОшибки)
	
	Если ЗначениеЗаполнено(Префикс) И Не МодульОбъекта().ВСтрокеТолькоЦифры(Префикс) Тогда
		ТекстСообщения = НСтр("ru = 'В префиксе должны быть только цифры'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, "Префикс");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСерийныйНомер(ЕстьОшибки)
	
	ДлинаТекущегоНомера = СтрДлина(Формат(СерийныйНомер, "ЧН=0; ЧГ=0"));
	ДопустимаяДлинаНомера = МодульОбъекта().ДопустимаяДлинаСерийногоНомера(ОписаниеПоКонтекстуФормы());
	
	Если ДлинаТекущегоНомера > ДопустимаяДлинаНомера Тогда
		ТекстСообщения = НСтр("ru = 'Серийный номер не может быть длиннее %1 символов'");
		ТекстСообщения = МодульОбъекта().ПараметрыВСтроку(ТекстСообщения, ДопустимаяДлинаНомера);
		МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, "СерийныйНомер");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Записать()
	
	ЗаписатьНаСервере();
	
	Оповестить("КонтурМаркировка_ВидАгрегата_Изменен", Ссылка);
	
	ОповеститьОбИзменении(Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Префикс = СокрЛП(Префикс);
	
	ОписаниеВидаАгрегата = ОписаниеПоКонтекстуФормы();
	
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	
	Попытка
		
		Ссылка = МодульОбъекта().ВидАгрегата_Записать(ОписаниеВидаАгрегата);
		
		Если СерийныйНомерИзмененВручную Тогда
			МодульОбъекта().СерийныеНомераТранспортныхУпаковок_Записать(ОписаниеВидаАгрегата, СерийныйНомер);
		КонецЕсли;
		
		Действие = МодульОбъекта().Перечисление_ДействияМетрики().ЗаписьВБазу;
		МодульОбъекта().Метрика_ВидАгрегата(Действие, Ссылка);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение;
	КонецПопытки;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ОписаниеВидаАгрегата = МодульОбъекта().ВидАгрегата_Прочитать(Ссылка);
	Иначе
		ОписаниеВидаАгрегата = МодульОбъекта().Новый_ВидАгрегата();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеВидаАгрегата);
	
	ЗаполнитьСерийныйНомер();
	
КонецПроцедуры

&НаСервере
Функция ОписаниеПоКонтекстуФормы()
	
	Результат = МодульОбъекта().Новый_ВидАгрегата();
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСпискиВыбораЭлементовФормы()
	
	ЗаполнитьСписокВыбораТиповАгрегатов();
	ЗаполнитьСписокВыбораТиповКодов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТиповАгрегатов()
	
	СписокВыбора = Элементы.ТипАгрегата.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ТипыАгрегатов();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТиповКодов()
	
	СписокВыбора = Элементы.ТипКода.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ТипыКодовТранспортныхУпаковок();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСерийныйНомер()
	
	СерийныйНомер = МодульОбъекта().СерийныеНомераТранспортныхУпаковок_Прочитать(ОписаниеПоКонтекстуФормы());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипШтрихкода()
	
	ТипыКодов = МодульОбъекта().Перечисление_ТипыКодовТранспортныхУпаковок();
	
	ТипыШтрихкодов = Новый Соответствие;
	ТипыШтрихкодов.Вставить(ТипыКодов.SSCC, Перечисления.КонтурМаркировка_ТипыШтрихкодов.SSCC);
	ТипыШтрихкодов.Вставить(ТипыКодов.Code128_26, Перечисления.КонтурМаркировка_ТипыШтрихкодов.Code128);
	
	ТипШтрихкода = ТипыШтрихкодов[ТипКода];
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПрефикс()
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ПрефиксИзИдентификатораGS1 = ПрефиксИзИдентификатораGS1Организации();
	
	Если ЗначениеЗаполнено(Префикс) И Префикс <> ПрефиксИзИдентификатораGS1 Тогда
		ТекстВопроса = НСтр("ru = 'Перезаполнить префикс GS1 из данных организации?'");
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
		"ОбновитьПрефиксПослеСогласия", ЭтаФорма, ПрефиксИзИдентификатораGS1);
		МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		УстановитьЗначениеПрефикса(ПрефиксИзИдентификатораGS1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПрефиксПослеСогласия(Ответ, ПрефиксИзИдентификатораGS1) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьЗначениеПрефикса(ПрефиксИзИдентификатораGS1);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПрефикса(Значение)
	
	Префикс = Значение;
	
	ЗаполнитьСерийныйНомер();
	
КонецПроцедуры

&НаСервере
Функция ПрефиксИзИдентификатораGS1Организации()
	
	Возврат МодульОбъекта().Организация_ПрефиксВидаАгрегатаИзИдентификатораGS1(Организация);
	
КонецФункции

// #КонецОбласти
