
Функция ПолучитьПараметрыЭлектронногоПисьма() Экспорт

	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Тема");
	ПараметрыПисьма.Вставить("Кому", Новый Массив);
	ПараметрыПисьма.Вставить("ТипТекста");
	ПараметрыПисьма.Вставить("Тело");
	
	Возврат ПараметрыПисьма;
	
КонецФункции

Функция ДобавитьПолучателяПисьма(ПараметрыПисьма, Адрес, Представление=Неопределено) Экспорт
	
	ПараметрыПисьма.Кому.Добавить(Новый Структура("Адрес, Представление", Адрес, Представление));
	
КонецФункции

Функция ЭтоПараметрыЭлектронногоПисьма(Значение) Экспорт

	Возврат ТипЗнч(Значение) = Тип("Структура") И Значение.Свойство("Тема") И Значение.Свойство("Кому");
	
КонецФункции

Функция СформироватьВложенияЭлектронногоПисьмаПоДаннымHTML(ДанныеHTML, ПараметрыПисьма) Экспорт
	
	Вложения = Неопределено;
	ПараметрыПисьма.Свойство("Вложения", Вложения);
	Если Вложения = Неопределено Тогда
		Вложения = Новый Массив;
	КонецЕсли;
	
	НовыеВложения = Новый Массив;
		
	Для Каждого Картинка Из ДанныеHTML.ДокументHTML.Картинки Цикл
		ИмяФайлаКартинки = Картинка.ПолучитьАтрибут("src");
		ДанныеКартинки = ДанныеHTML.Картинки[ИмяФайлаКартинки];
		Если ДанныеКартинки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		ИдентификаторЗанят = Истина;
		Пока ИдентификаторЗанят Цикл
			ИдентификаторКартинки = Строка(Новый УникальныйИдентификатор);
			ИдентификаторЗанят = Ложь;
			Для Каждого Вложение Из Вложения Цикл
				ЗанятыйИдентификатор = Неопределено;
				Если Вложение.Свойство("Идентификатор", ЗанятыйИдентификатор) Тогда
					Если ЗанятыйИдентификатор = ИдентификаторКартинки Тогда
						ИдентификаторЗанят = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Картинка.УстановитьАтрибут("src", "cid:" + ИдентификаторКартинки);
		Вложение = Новый Структура("Идентификатор, АдресВоВременномХранилище, Представление", ИдентификаторКартинки, ДанныеКартинки.ДвоичныеДанные, ДанныеКартинки.Имя);
		Вложения.Добавить(Вложение);
		НовыеВложения.Добавить(Вложение);
			
	КонецЦикла;
	
	Если НовыеВложения.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыПисьма.Вставить("Вложения", Вложения);
	Возврат Истина;
	
КонецФункции
