
Функция НеобходимоОбновлениеИнформационнойБазы() Экспорт
	
	Если РольДоступна("ПолныеПрава") Тогда
		Версия = вмс_ОбновлениеИнформационнойБазыWMS.Версия();
		ВерсияИБ = вмс_ОбновлениеИнформационнойБазыСлужебный.ВерсияИБ(вмс_ОбновлениеИнформационнойБазыWMS.Имя());
		Если Версия <> ВерсияИБ Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ВыполнитьОбновлениеИнформационнойБазы(ВыполнятьОтложенныеОбработчики = Ложь) Экспорт
	
	Возврат вмс_ОбновлениеИнформационнойБазыСлужебный.ВыполнитьОбновлениеИнформационнойБазы(Неопределено);
	
КонецФункции

Функция НоваяТаблицаОбработчиковОбновления() Экспорт
	
	Обработчики = Новый ТаблицаЗначений;
	// Общие свойства.
	Обработчики.Колонки.Добавить("НачальноеЗаполнение", Новый ОписаниеТипов("Булево"));
	Обработчики.Колонки.Добавить("Версия",    Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0)));
	Обработчики.Колонки.Добавить("Процедура", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0)));
	Обработчики.Колонки.Добавить("РежимВыполнения", Новый ОписаниеТипов("Строка"));
	// Для библиотек.
	Обработчики.Колонки.Добавить("ВыполнятьВГруппеОбязательных", Новый ОписаниеТипов("Булево"));
	Обработчики.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2)));
	// Для модели сервиса.
	Обработчики.Колонки.Добавить("ОбщиеДанные",             Новый ОписаниеТипов("Булево"));
	Обработчики.Колонки.Добавить("УправлениеОбработчиками", Новый ОписаниеТипов("Булево"));
	// Для отложенных обработчиков обновления.
	Обработчики.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0)));
	Обработчики.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Обработчики.Колонки.Добавить("ПроцедураПроверки", Новый ОписаниеТипов("Строка"));
	Обработчики.Колонки.Добавить("БлокируемыеОбъекты", Новый ОписаниеТипов("Строка"));
	// Для параллельного режима отложенного обновления.
	Обработчики.Колонки.Добавить("ПроцедураЗаполненияДанныхОбновления", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0)));
	Обработчики.Колонки.Добавить("ОчередьОтложеннойОбработки",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4)));
	Обработчики.Колонки.Добавить("ЗапускатьТолькоВГлавномУзле",  Новый ОписаниеТипов("Булево"));
	Обработчики.Колонки.Добавить("ЗапускатьИВПодчиненномУзлеРИБСФильтрами",  Новый ОписаниеТипов("Булево"));
	Обработчики.Колонки.Добавить("ЧитаемыеОбъекты", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0)));
	Обработчики.Колонки.Добавить("ИзменяемыеОбъекты", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0)));
	Обработчики.Колонки.Добавить("ПриоритетыВыполнения");
	Обработчики.Колонки.Добавить("Многопоточный", Новый ОписаниеТипов("Булево"));
	
	// Устарело. Обратная совместимость с редакцией "2.2".
	Обработчики.Колонки.Добавить("Опциональный");
	Обработчики.Колонки.Добавить("МонопольныйРежим");
	
	Возврат Обработчики;
	
КонецФункции

Функция ПриоритетыВыполненияОбработчика() Экспорт
	
	Приоритеты = Новый ТаблицаЗначений;
	Приоритеты.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0)));
	Приоритеты.Колонки.Добавить("Идентификатор");
	Приоритеты.Колонки.Добавить("Процедура", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0)));
	
	Возврат Приоритеты;
	
КонецФункции

Функция ДобавитьОбработчикОбновления(ТаблицаОбработчиков, ПроцедураОбработчика, Версия=Неопределено, НачальноеЗаполнение=Неопределено) Экспорт
	
	ПерваяВерсия = вмс_ОбновлениеИнформационнойБазыСлужебный.ПерваяВерсия();
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Процедура = ПроцедураОбработчика;
	Обработчик.Версия = ?(Версия <> Неопределено, Версия, ПерваяВерсия);
	Обработчик.НачальноеЗаполнение = ?(НачальноеЗаполнение <> Неопределено, НачальноеЗаполнение, Обработчик.Версия=ПерваяВерсия);
	Обработчик.ПриоритетыВыполнения = ПриоритетыВыполненияОбработчика();
	Возврат Обработчик;
КонецФункции

Функция ЗагрузитьПредопределенныеОбъектыИБИзДанныхXML(ДанныеXML) Экспорт
	
	Если ТипЗнч(ДанныеXML) = Тип("ДвоичныеДанные") Тогда
		Текст = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьТекстИзДвоичныхДанных(ДанныеXML);
	ИначеЕсли ТипЗнч(ДанныеXML) = Тип("Строка") Тогда
		Текст = ДанныеXML;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Текст);
	ЧтениеXML.Прочитать(); //заголовок
	ЧтениеXML.Прочитать(); //первый элемент
	вмс_РаботаСXMLВызовСервера.ЗагрузитьОбъектыИзXML(ЧтениеXML);
	ЧтениеXML.Прочитать(); //конец заголовка
	
	Возврат Истина;
	
КонецФункции

Функция ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета(ИмяМакета, знач ТипЭлементов=Неопределено) Экспорт

	ДанныеМакета = ПолучитьОбщийМакет(ИмяМакета);
	
	Если ТипЗнч(ДанныеМакета)=Тип("ТабличныйДокумент") Тогда
		Если ТипЭлементов=Неопределено Тогда
			ТипЭлементов = ОпределитьТипПредопределенныхЭлементовПоИмениМакета(ИмяМакета);
		КонецЕсли;
		Возврат ЗагрузитьЭлементыИзМакета(ДанныеМакета, ТипЭлементов);
	ИначеЕсли ТипЗнч(ДанныеМакета)=Тип("ТекстовыйДокумент") Тогда
		//3.2.5
		СодержимоеМакета = ДанныеМакета.ПолучитьТекст();
		Возврат ЗагрузитьПредопределенныеОбъектыИБИзДанныхXML(СодержимоеМакета);
	Иначе
		Возврат ЗагрузитьПредопределенныеОбъектыИБИзДанныхXML(ДанныеМакета);
	КонецЕсли;
	
КонецФункции

Функция ОпределитьТипПредопределенныхЭлементовПоИмениМакета(ИмяМакета) Экспорт

	Если ИмяМакета="ПредопределенныеЭлементыНастроекПрограммы" Тогда
		ТипЭлементов = Тип("СправочникОбъект.вмс_НастройкиПрограммы");
	ИначеЕсли ИмяМакета="ПредопределенныеЭлементыОперацииТСД" ИЛИ ИмяМакета="ПредопределенныеЭлементыОперацииТСД_Лайт" Тогда
		ТипЭлементов = Тип("СправочникОбъект.вмс_Операции");
	КонецЕсли;
	
	Возврат ТипЭлементов;

КонецФункции

Функция ПолучитьМакетЭлементов(ТипЭлементов, ОтборЭлементов=Неопределено) Экспорт

	СвойстваЭлементов = ПолучитьСвойстваЭлементов(ТипЭлементов, ОтборЭлементов);
	
	ЗаписатьСвойстваЭлементовПереопределяемый(СвойстваЭлементов, ТипЭлементов);
	
	МакетЭлементов = ПолучитьМакетСвойствЭлементов(ТипЭлементов, СвойстваЭлементов);
	
	Возврат МакетЭлементов;
	
КонецФункции

Функция ПолучитьМакетСвойствЭлементов(ТипЭлементов, СвойстваЭлементов) Экспорт
	
	Макет = Новый ТабличныйДокумент;
	
	НомерСтроки = 1;
	
	// тип
	Макет.Область(НомерСтроки, 1).Текст = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьИмяТипаОбъекта(ТипЭлементов);
	НомерСтроки = НомерСтроки + 1;
	
	// шапка
	НомерКолонки = 1;
	Для Каждого Колонка Из СвойстваЭлементов.Колонки Цикл
		Макет.Область(НомерСтроки, НомерКолонки).Текст = Колонка.Имя;
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	Макет.Область(НомерСтроки, НомерКолонки).Текст = "ВерсияВМС";

	НомерСтроки = НомерСтроки + 1;
	
	// свойства
	ВерсияВМС = вмс_ОбновлениеИнформационнойБазыWMS.Версия();

	ЗаписьXML = Новый ЗаписьXML;
	ПараметрыЗаписиXML = вмс_РаботаСXMLКлиентСервер.ПолучитьПараметрыЗаписиXML(ЗаписьXML, Истина);
	вмс_РаботаСXMLКлиентСервер.ПодготовитьОбъектыИЗначенияСвойствОбъектовДляЗаписи(ПараметрыЗаписиXML, СвойстваЭлементов);
	
	Для Каждого СтрокаТаблицыОбъектов Из СвойстваЭлементов Цикл
		НомерКолонки = 1;
		Для Каждого Колонка Из СвойстваЭлементов.Колонки Цикл
			Значение = СтрокаТаблицыОбъектов[Колонка.Имя];
			Область = Макет.Область(НомерСтроки, НомерКолонки);
			
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
			ПараметрыЗаписиXML.ЗаписьXML = ЗаписьXML;
			вмс_РаботаСXMLКлиентСервер.ЗаписатьОбъект(Значение, ПараметрыЗаписиXML);
			Текст = ЗаписьXML.Закрыть();
			
			Если ТипЗнч(Значение) <> Тип("ТаблицаЗначений") Тогда
				// только содержимое значения без тэгов в одну строку
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.УстановитьСтроку(Текст);
				ЧтениеXML.Прочитать();
				Текст = вмс_РаботаСXMLКлиентСервер.ПрочитатьСодержимоеТекущегоУзлаXML(ЧтениеXML);
			КонецЕсли;
			
			Область.Текст = Текст;
			Область.ВысотаСтроки = 10;
			
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;

		Область = Макет.Область(НомерСтроки, НомерКолонки);
		Область.Текст = ВерсияВМС;
		НомерКолонки = НомерКолонки + 1;
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат Макет;
	
КонецФункции

Функция ПолучитьСвойстваЭлементов(ТипЭлементов, ОтборЭлементов=Неопределено) Экспорт
	
	МетаданныеОбъекта = вмс_ОбщегоНазначенияСервер.ПолучитьМетаданныеОбъекта(ТипЭлементов);
	
	ГруппыРеквизитов = Новый Массив;
	ГруппыРеквизитов.Добавить(МетаданныеОбъекта.СтандартныеРеквизиты);
	ГруппыРеквизитов.Добавить(МетаданныеОбъекта.Реквизиты);
	
	СвойстваОбъектов = "";
	Разделитель = "," + Символы.ПС + Символы.Таб;
	Для Каждого ГруппаРеквизитов Из ГруппыРеквизитов Цикл
		Для Каждого Реквизит Из ГруппаРеквизитов Цикл
			СвойстваОбъектов = СвойстваОбъектов + Разделитель + "ТаблицаСвойствОбъектов." + Реквизит.Имя + " КАК " + Реквизит.Имя;
		КонецЦикла;
	КонецЦикла;
	
	РазделительСвойствТабличныхЧастей = "," + Символы.ПС + Символы.Таб + Символы.Таб;
	Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		СвойстваОбъектов = СвойстваОбъектов + Разделитель + "ТаблицаСвойствОбъектов." + ТабличнаяЧасть.Имя + ".(" + Символы.ПС + Символы.Таб + Символы.Таб;

		ГруппыРеквизитов = Новый Массив;
		ГруппыРеквизитов.Добавить(ТабличнаяЧасть.СтандартныеРеквизиты);
		ГруппыРеквизитов.Добавить(ТабличнаяЧасть.Реквизиты);
		
		СвойстваТабличнойЧасти = "";
		Для Каждого ГруппаРеквизитов Из ГруппыРеквизитов Цикл
			Для Каждого Реквизит Из ГруппаРеквизитов Цикл
				СвойстваТабличнойЧасти = СвойстваТабличнойЧасти + РазделительСвойствТабличныхЧастей + Реквизит.Имя + " КАК " + Реквизит.Имя;
			КонецЦикла;
		КонецЦикла;
		
		СвойстваТабличнойЧасти = Прав(СвойстваТабличнойЧасти, СтрДлина(СвойстваТабличнойЧасти)-СтрДлина(РазделительСвойствТабличныхЧастей));
		
		СвойстваОбъектов = СвойстваОбъектов + СвойстваТабличнойЧасти + Символы.ПС + Символы.Таб + ") КАК " + ТабличнаяЧасть.Имя;
	КонецЦикла;

	СвойстваОбъектов = Прав(СвойстваОбъектов, СтрДлина(СвойстваОбъектов)-СтрДлина(Разделитель));
	
	ИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	ИмяСсылки = СтрЗаменить(ИмяОбъекта, ".", "Ссылка.");
	ТипСсылки = Тип(ИмяСсылки);
	
	СписокСсылокНаОбъекты = Новый Массив;
	Если ОтборЭлементов <> Неопределено Тогда
		Для Каждого Элемент Из ОтборЭлементов Цикл
			Если ТипЗнч(Элемент)=ТипСсылки Тогда
				СписокСсылокНаОбъекты.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&СвойстваОбъектов КАК СвойстваОбъектов
	|ИЗ
	|	&ТаблицаСвойствОбъектов КАК ТаблицаСвойствОбъектов
	|ГДЕ
	|	(&БезОтбора
	|				И НЕ ТаблицаСвойствОбъектов.ПометкаУдаления
	|			ИЛИ НЕ &БезОтбора
	|				И ТаблицаСвойствОбъектов.Ссылка В (&СписокСсылокНаОбъекты))";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СвойстваОбъектов КАК СвойстваОбъектов", СвойстваОбъектов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТаблицаСвойствОбъектов", МетаданныеОбъекта.ПолноеИмя());
	Запрос.УстановитьПараметр("БезОтбора", ОтборЭлементов=Неопределено);
	Запрос.УстановитьПараметр("СписокСсылокНаОбъекты", СписокСсылокНаОбъекты);
	РезультатЗапроса = Запрос.Выполнить();
	СвойстваЭлементов = РезультатЗапроса.Выгрузить();
	
	Для Каждого СвойстваЭлемента Из СвойстваЭлементов Цикл
		Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
			СвойстваЭлемента[ТабличнаяЧасть.Имя].Сортировать("НомерСтроки");
		КонецЦикла;
	КонецЦикла;
	
	Возврат СвойстваЭлементов;
	
КонецФункции

Функция ЗаписатьСвойстваЭлементовПереопределяемый(ТаблицаСвойствЭлементов, ТипЭлементов)

	МенеджерОбъектов = вмс_ОбщегоНазначенияСервер.ПолучитьМенеджерОбъектовБазы(ТипЭлементов);
	
	Попытка
		МенеджерОбъектов.ЗаписатьСвойстваЭлементов(ТаблицаСвойствЭлементов);
	Исключение
		// без обработки
	КонецПопытки;

КонецФункции

Функция ЗагрузитьЭлементыИзМакета(знач Макет, ТипЭлементов=Неопределено, ВерсияВМСОт=Неопределено) Экспорт
	
	Если ТипЗнч(Макет)=Тип("Строка") Тогда
		Макет = ПолучитьОбщийМакет(Макет);
	КонецЕсли;
	
	МассивОбъектов = ПрочитатьЭлементыИзМакета(Макет, ТипЭлементов, ВерсияВМСОт);
	
	вмс_РаботаСXMLВызовСервера.ЗаписатьОбъекты(МассивОбъектов);
	
КонецФункции

Функция ЗагрузитьЭлементыИзТаблицы(ТаблицаСвойствЭлементов, ТипЭлементов, ВерсияВМСОт=Неопределено) Экспорт
	
	Для Каждого Элемент Из ПрочитатьЭлементыИзТаблицы(ТаблицаСвойствЭлементов, ТипЭлементов, ВерсияВМСОт) Цикл
		
		Элемент.Записать();
		
	КонецЦикла;
	
КонецФункции

Функция ПрочитатьЭлементыИзМакета(Макет, ТипЭлементов=Неопределено, ВерсияВМСОт=Неопределено) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	НомерСтроки = 1;
	
	Текст = Макет.Область(НомерСтроки, 1).Текст;
	Если СтрНайти(Текст, ".") > 0 Тогда
		// новая версия макета
		ТипЭлементов = Текст;
		НомерСтроки = НомерСтроки + 1;
	КонецЕсли;

	ТаблицаСвойствЭлементов = РК.ЗагрузитьКоллекциюЗначенийИзТабличногоДокумента(Макет, , НомерСтроки);
	
	ПрочитатьСвойстваЭлементовПереопределяемый(ТаблицаСвойствЭлементов, ТипЭлементов);
	
	МассивЭлементов = ПрочитатьЭлементыИзТаблицы(ТаблицаСвойствЭлементов, ТипЭлементов, ВерсияВМСОт);
	
	Возврат МассивЭлементов;
	
КонецФункции

Функция ПрочитатьЭлементыИзТаблицы(ТаблицаСвойствЭлементов, ТипЭлементов, ВерсияВМСОт=Неопределено) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	Если ВерсияВМСОт <> Неопределено Тогда
		ВесВерсияВМСОт = вмс_ОбновлениеИнформационнойБазыСлужебный.ВесВерсии(ВерсияВМСОт);
	КонецЕсли;
	
	СтруктураОбъекта = Новый Структура("Реквизиты, ТабличныеЧасти", Новый Структура, Новый Структура);
	МетаданныеОбъекта = вмс_ОбщегоНазначенияСервер.ПолучитьМетаданныеОбъекта(ТипЭлементов);
	КолонкиСвойствЭлементов = РК.ПолучитьКолонкиКоллекции(ТаблицаСвойствЭлементов);
	Для Каждого ИмяКолонки Из КолонкиСвойствЭлементов Цикл
		Если МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяКолонки) <> Неопределено Тогда
			СтруктураОбъекта.ТабличныеЧасти.Вставить(ИмяКолонки);
		Иначе
			СтруктураОбъекта.Реквизиты.Вставить(ИмяКолонки);
		КонецЕсли;
	КонецЦикла;
	
	УказанаВерсияЭлементовВМакете = КолонкиСвойствЭлементов.Найти("ВерсияВМС") <> Неопределено;
	
	МассивЭлементов = Новый Массив;
	ПараметрыЧтенияXML = вмс_РаботаСXMLКлиентСервер.ПолучитьПараметрыЧтенияXML();
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	Для Каждого СвойстваОбъекта Из РК.ПолучитьЭлементыКоллекции(ТаблицаСвойствЭлементов) Цикл
		
		Если НЕ ЗначениеЗаполнено(СвойстваОбъекта.Наименование) И НЕ ЗначениеЗаполнено(СвойстваОбъекта.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВерсияВМСОт <> Неопределено И УказанаВерсияЭлементовВМакете Тогда
			ВесВерсииВМС = вмс_ОбновлениеИнформационнойБазыСлужебный.ВесВерсии(СвойстваОбъекта.ВерсияВМС);
			Если ВесВерсииВМС <= ВесВерсияВМСОт Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта.Реквизиты, СвойстваОбъекта);
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта.ТабличныеЧасти, СвойстваОбъекта);

		ЭтоГруппа = СтруктураОбъекта.Реквизиты.Свойство("ЭтоГруппа") И СтруктураОбъекта.Реквизиты.ЭтоГруппа="true";
		Элемент = вмс_ОбщегоНазначенияСервер.ПолучитьОбъектИБ(ТипЭлементов, СвойстваОбъекта.Ссылка, ЭтоГруппа);
		
		Для Каждого ЭлементТабличнаяЧасть Из СтруктураОбъекта.ТабличныеЧасти Цикл
			ЧтениеXML.УстановитьСтроку(ЭлементТабличнаяЧасть.Значение);
			ЧтениеXML.Прочитать();
			ТаблицаДанных = Новый(ЧтениеXML.Имя);
			вмс_РаботаСXMLКлиентСервер.ПрочитатьСвойстваОбъектаТаблицаЗначенийКомпактная(ТаблицаДанных, ПараметрыЧтенияXML);
			СтруктураОбъекта.ТабличныеЧасти[ЭлементТабличнаяЧасть.Ключ] = ТаблицаДанных;
		КонецЦикла;
		//СтруктураОбъекта.Реквизиты.Значение = Новый Структура("ИмяТипа, Значение", СвойстваОбъекта.ТипЗначения, СвойстваОбъекта.Значение);
		вмс_РаботаСXMLСервер.ЗаполнитьСвойстваОбъектаИБИзСтруктуры(Элемент, СтруктураОбъекта);
		
		МассивЭлементов.Добавить(Элемент);
		
	КонецЦикла;
	
	Возврат МассивЭлементов;
	
КонецФункции

Функция ПрочитатьСвойстваЭлементовПереопределяемый(ТаблицаСвойствЭлементов, ТипЭлементов)

	МенеджерОбъектов = вмс_ОбщегоНазначенияСервер.ПолучитьМенеджерОбъектовБазы(ТипЭлементов);
	
	Попытка
		МенеджерОбъектов.ПрочитатьСвойстваЭлементов(ТаблицаСвойствЭлементов);
	Исключение
		// без обработки
	КонецПопытки;

КонецФункции
