
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	ТаблицаРаспоряжений = ПолучитьТаблицуРаспоряжений();
	
	ПолучитьДанныеЗаданий(ТаблицаРаспоряжений);
	
	ТаблицаРезультата = ПолучитьТаблицуРезультата(ТаблицаРаспоряжений);
	
	ВывестиТаблицуРезультата(ТаблицаРезультата, ДокументРезультат, ДанныеРасшифровки);
	
КонецПроцедуры

Функция ПолучитьТаблицуРаспоряжений()

	ОсновнаяСхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.Настройки;
	СхемаКомпоновкиДанныхРаспоряжений = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиДанныхРаспоряжений.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.СтрокаСоединения = "localhost";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных0 = ОсновнаяСхемаКомпоновкиДанных.НаборыДанных.Найти("Распоряжения");
	НаборДанных = СхемаКомпоновкиДанныхРаспоряжений.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	ЗаполнитьЗначенияСвойств(НаборДанных, НаборДанных0, "Имя, Запрос, ИсточникДанных");
	
    ПараметрыИспользоватьДанныеЗапросаПоРаспоряжениям = СхемаКомпоновкиДанныхРаспоряжений.Параметры.Добавить();
	ПараметрыИспользоватьДанныеЗапросаПоРаспоряжениям.Имя = "ИспользоватьДанныеЗапросаПоРаспоряжениям";
	ПараметрыИспользоватьДанныеЗапросаПоРаспоряжениям.ОграничениеИспользования = Истина;
	ПараметрыИспользоватьДанныеЗапросаПоРаспоряжениям.Значение = Истина;
	
	НастройкиРаспоряжений = СхемаКомпоновкиДанныхРаспоряжений.НастройкиПоУмолчанию;
	РаботаССКД.СкопироватьЭлементы(НастройкиРаспоряжений.Отбор, Настройки.Отбор);
	РаботаССКД.УстановитьНастройкуВыводаВсехПолей(СхемаКомпоновкиДанныхРаспоряжений, НастройкиРаспоряжений);
	РаботаССКД.УстановитьНастройкиДляПолученияКоллекцииЗначений(НастройкиРаспоряжений);
	
	КомпоновщикНастроекРаспоряжений = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекРаспоряжений.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанныхРаспоряжений));
	КомпоновщикНастроекРаспоряжений.ЗагрузитьНастройки(НастройкиРаспоряжений);
	КомпоновщикНастроекРаспоряжений.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	НастройкиРаспоряжений = КомпоновщикНастроекРаспоряжений.Настройки;
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиРаспоряжений = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанныхРаспоряжений, НастройкиРаспоряжений, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиРаспоряжений, , , Истина);
	
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРаспоряжений = ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	Возврат ТаблицаРаспоряжений;
	
КонецФункции

Функция ПолучитьДанныеЗаданий(ТаблицаРаспоряжений)
	
	ТаблицаРаспоряжений.Колонки.Добавить("ЗаданиеОбъект");
	
	РассчитатьОстаткиПоЗаданиям = Новый Массив;
	
	Для Каждого ЭлементТаблицыРаспоряжений Из ТаблицаРаспоряжений Цикл
		ЗаданиеОбъект = ЭлементТаблицыРаспоряжений.Задание.ПолучитьОбъект();
		ЗаданиеОбъект.Прочитать();
		ЭлементТаблицыРаспоряжений.ЗаданиеОбъект = ЗаданиеОбъект;
		Если НЕ ЭлементТаблицыРаспоряжений.ОстаткиПодобраны Тогда
			РассчитатьОстаткиПоЗаданиям.Добавить(ЗаданиеОбъект);
		КонецЕсли;
	КонецЦикла;
	
	Если РассчитатьОстаткиПоЗаданиям.Количество() > 0 Тогда
		Документы.вмс_ЗаданиеКладовщику.ПодобратьЯчейкиОтправители(РассчитатьОстаткиПоЗаданиям);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуРезультата(ТаблицаРаспоряжений)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Распоряжение");
	ТаблицаРезультата.Колонки.Добавить("Номенклатура");
	ТаблицаРезультата.Колонки.Добавить("Характеристика");
	ТаблицаРезультата.Колонки.Добавить("Серия");
	ТаблицаРезультата.Колонки.Добавить("КоличествоЗаказано");
	ТаблицаРезультата.Колонки.Добавить("КоличествоОбеспечено");
	
	ПустаяЯчейка = Справочники.вмс_МестаХранения.ПустаяСсылка();
	
	Для Каждого ЭлементТаблицыРаспоряжений Из ТаблицаРаспоряжений Цикл
		ЗаданиеОбъект = ЭлементТаблицыРаспоряжений.ЗаданиеОбъект;
		Для Каждого ЭлементТовара Из ЗаданиеОбъект.Товары Цикл
			ЭлементРезультат = ТаблицаРезультата.Добавить();
			ЭлементРезультат.Распоряжение = ЗаданиеОбъект.Распоряжение;
			ЗаполнитьЗначенияСвойств(ЭлементРезультат, ЭлементТовара);
			ЭлементРезультат.КоличествоЗаказано = ЭлементТовара.Количество;
			ЭлементРезультат.КоличествоОбеспечено = ?(ЭлементТовара.Ячейка <> ПустаяЯчейка, ЭлементТовара.Количество, 0);
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаРезультата.Свернуть("Распоряжение, Номенклатура, Характеристика, Серия", "КоличествоЗаказано, КоличествоОбеспечено");
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиТаблицуРезультата(ТаблицаРезультата, ДокументРезультат, ДанныеРасшифровки)

	СхемаКомпоновкиРезультат = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НаборДанныхРаспоряжения = СхемаКомпоновкиРезультат.НаборыДанных.Найти("Распоряжения");
	СхемаКомпоновкиРезультат.НаборыДанных.Удалить(НаборДанныхРаспоряжения);

	КомпоновщикНастроекРезультата = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекРезультата.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиРезультат));
	КомпоновщикНастроекРезультата.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	КомпоновщикНастроекРезультата.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	НастройкиРезультата = КомпоновщикНастроекРезультата.ПолучитьНастройки();

	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиРезультат, НастройкиРезультата, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаРезультата", ТаблицаРезультата);
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
КонецФункции

