
&НаСервере
Процедура ДалееНаСервере()

	МенеджерЗаписи = РегистрыСведений.вмс_ЛицензииПодсистем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заполнить(Неопределено);
	МенеджерЗаписи.Отображение = "Адресное хранение";
	МенеджерЗаписи.Подсистема = "вмс_ЛицензияСклад";
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Лицензия = ЭтотОбъект.ЛицензияСклад;
	МенеджерЗаписи.Записать();
	
	МенеджерЗаписи = РегистрыСведений.вмс_ЛицензииПодсистем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заполнить(Неопределено);
	МенеджерЗаписи.Отображение = "Контейнеры";
	МенеджерЗаписи.Подсистема = "вмс_ЛицензияКонтейнеры";
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Лицензия = ЭтотОбъект.ЛицензияКонтейнеры;
	МенеджерЗаписи.Записать();
	
	МенеджерЗаписи = РегистрыСведений.вмс_ЛицензииПодсистем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заполнить(Неопределено);
	МенеджерЗаписи.Отображение = "Магазин";
	МенеджерЗаписи.Подсистема = "вмс_ЛицензияМагазин";
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Лицензия = ЭтотОбъект.ЛицензияМагазин;
	МенеджерЗаписи.Записать();
	
	МенеджерЗаписи = РегистрыСведений.вмс_ЛицензииПодсистем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заполнить(Неопределено);
	МенеджерЗаписи.Отображение = "ОХР";
	МенеджерЗаписи.Подсистема = "вмс_ЛицензияОХР";
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Лицензия = ЭтотОбъект.ЛицензияОХР;
	МенеджерЗаписи.Записать();
	
	ЗаполнитьОперацииПредопределеннымиЭлементами();
	ЗаполнитьРегистрационныеДанныеИКлючиТСД();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОперацииПредопределеннымиЭлементами()
	
	ОчиститьСправочникОпераций();
	
	Если ЗначениеЗаполнено(ЛицензияСклад) Тогда
		вмс_ОбновлениеИнформационнойБазы.ЗагрузитьЭлементыИзМакета("ПредопределенныеЭлементыОперацииТСД", , "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛицензияМагазин) Тогда
		вмс_ОбновлениеИнформационнойБазы.ЗагрузитьЭлементыИзМакета("ПредопределенныеЭлементыОперацииТСД_Лайт", , "");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСправочникОпераций()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_Операции.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вмс_Операции КАК вмс_Операции";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СправочоникОперацииОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СправочоникОперацииОбъект.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ЛицензияВведена = Ложь;
	РегДанныеЗаполнены = Ложь;
	
	Если ЗначениеЗаполнено(ЛицензияСклад) Тогда
		ЛицензияВведена = Истина;
	ИначеЕсли ЗначениеЗаполнено(ЛицензияОХР) Тогда
		ЛицензияВведена = Истина;
	ИначеЕсли ЗначениеЗаполнено(ЛицензияМагазин) И НЕ ЗначениеЗаполнено(ЛицензияКонтейнеры) Тогда
		ЛицензияВведена = Истина;
	ИначеЕсли ЗначениеЗаполнено(ЛицензияМагазин) И ЗначениеЗаполнено(ЛицензияКонтейнеры) Тогда
		ПоказатьПредупреждение(,"Лицензия на контейнеры не является лицензией входящей в AS WMS Lite. Удалите лицензию на контейнеры или введите лицензию Адресного хранения");
	ИначеЕсли ЗначениеЗаполнено(ЛицензияКонтейнеры) Тогда
		ПоказатьПредупреждение(,"Лицензия на контейнеры не является самостоятельной лицензией. Введите лицензию Адресного хранения");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		Если ЛицензииТСД.Количество() > 0 Тогда
			РегДанныеЗаполнены = Истина;
		Иначе
			ПоказатьПредупреждение(,"Не введен лицензии ТСД");
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(,"Не введен регистрационный номер");
	КонецЕсли;
	
	Если ЛицензияВведена И РегДанныеЗаполнены Тогда
		
		ДалееНаСервере();
		ОткрытьФорму("Обработка.вмс_ГлавноеМеню.Форма");
		ЭтаФорма.Закрыть();
		
	ИначеЕсли НЕ ЛицензияВведена И РегДанныеЗаполнены Тогда
		
		ПоказатьПредупреждение(,"Введите лицензию");
		
	ИначеЕсли ЛицензияВведена И НЕ РегДанныеЗаполнены Тогда
		
		ПоказатьПредупреждение(,"Заполните регистрационные данные");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьКартинкуНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ПолучитьКартинкуНаСервере()
	Обработка =  РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("Лого");
	ОблЛого = Макет.ПолучитьОбласть("Лого");
	ТУ_Лого.Вывести(ОблЛого);
КонецПроцедуры

&НаКлиенте
Процедура ЛицензияСкладПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ЛицензияСклад) Тогда
		Если ПроверитьДоступностьПодсистемы("вмс_ЛицензияСклад",ЛицензияСклад) Тогда
			
		Иначе
			ПоказатьПредупреждение(,"Данная лицензия не относится к лицензии Адресного хранения");
			ЛицензияСклад = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛицензияОХРПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ЛицензияОХР) Тогда
		Если ПроверитьДоступностьПодсистемы("вмс_ЛицензияОХР",ЛицензияОХР) Тогда
			
		Иначе
			ПоказатьПредупреждение(,"Данная лицензия не относится к лицензии Ответственного хранения");
			ЛицензияОХР = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛицензияМагазинПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ЛицензияМагазин) Тогда
		Если ПроверитьДоступностьПодсистемы("вмс_ЛицензияМагазин",ЛицензияМагазин) Тогда
			
		Иначе
			ПоказатьПредупреждение(,"Данная лицензия не относится к лицензии AS WMS Lite");
			ЛицензияМагазин = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛицензияКонтейнерыПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ЛицензияКонтейнеры) Тогда
		Если ПроверитьДоступностьПодсистемы("вмс_ЛицензияМагазин",ЛицензияКонтейнеры) Тогда
			
		Иначе
			ПоказатьПредупреждение(,"Данная лицензия не относится к лицензии Контейнеров");
			ЛицензияКонтейнеры = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьДоступностьПодсистемы(ПодсистемаИмя, КодЛицензии)
	Возврат вмс_ОбщегоНазначенияВызовСервера.Модуль("вмс_ЗащищенныйМодуль").ПроверитьДоступностьЛицензииПоКоду(ПодсистемаИмя,КодЛицензии);
КонецФункции

&НаКлиенте
Процедура ДалееВводДанных(Команда)
	ТекущийЭлемент = Элементы.ГруппаВводаРегДанныхиЛицензий;
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ТекущийЭлемент = Элементы.ГруппаВвода;
КонецПроцедуры

&НаКлиенте
Процедура ЛицензииТСДЛицензияТСДПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЛицензииТСД.ТекущиеДанные;
	
	Если СтрДлина(ТекДанные.ЛицензияТСД) > 11 Тогда
		
	Иначе
		ПоказатьПредупреждение(,"Введена не Лецензия для ТСД");
		ТекДанные.ЛицензияТСД = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегистрационныеДанныеИКлючиТСД()
	
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("РегистрационныйНомер", РегистрационныйНомер);
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("КлючЛицензии", РегистрационныйНомер);
	
	Для каждого СтрокаЛ Из ЛицензииТСД Цикл
		
		МенеджерЗаписи = РегистрыСведений.вмс_Лицензии.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Заполнить(Неопределено);
		МенеджерЗаписи.Лицензия = СтрокаЛ.ЛицензияТСД;
		МенеджерЗаписи.ПубличныйКлюч = СтрокаЛ.ПубличныйКлюч;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры


 
