#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Элемент из Метаданные.Справочники.вмс_МестаХранения.Владельцы цикл
		Источник = Элемент.Имя;
		Прервать;
	КонецЦикла;
	
	Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка,
	|	Склады.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ЭтоГруппа
	|	И НЕ Склады.ПометкаУдаления
	|	И ИСТИНА";
	
	ИмяСправочникаСклады = вмс_АдаптацияКонфигураций.ПолучитьИмяСправочникаСклады(); 
	ИмяПараметраТипСклада = вмс_АдаптацияКонфигураций.ПолучитьИмяПараметраТипСклада();
	
	Текст = СтрЗаменить(Текст,"Справочник.Склады","Справочник." +ИмяСправочникаСклады);
	
	Текст = СтрЗаменить(Текст,"НЕ Склады.ЭтоГруппа",
	?(вмс_АдаптацияКонфигураций.ИерархическийСправочник(ИмяСправочникаСклады) = Истина,
	"НЕ Склады.ЭтоГруппа",
	"ИСТИНА"));   
	
	Текст = СтрЗаменить(Текст,"ТипСклада",ИмяПараметраТипСклада);
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр(ИмяПараметраТипСклада,вмс_АдаптацияКонфигураций.ПолучитьТипСкладаОптовый());
	
	Запрос.Текст = Текст;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Элементы.Владелец.СписокВыбора.Добавить(Выборка.Ссылка,Выборка.Наименование);
	КонецЦикла;
	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда 
		СтруктураМестХранения = Новый структура; 
		Предел = 2; 
		Пока Предел <= ТабличныйДокумент.ВысотаТаблицы Цикл
			
			// ТУ_Августинович ++ 000056225 27.10.2025
			// - В табличный документ добавлены новые колонки (Склад, Ряд, Стеллаж, Ярус, Место)
			
			//Место = Новый Структура("Наименование, Объем",ТабличныйДокумент.Область(Предел,1).Текст,ТабличныйДокумент.Область(Предел,2).Текст); 
			Место = Новый Структура;
			Место.Вставить("Наименование",	ТабличныйДокумент.Область(Предел, 1).Текст);
			Место.Вставить("Склад",			ТабличныйДокумент.Область(Предел, 2).Текст);
			Место.Вставить("Ряд",			ТабличныйДокумент.Область(Предел, 3).Текст);
			Место.Вставить("Стеллаж",		ТабличныйДокумент.Область(Предел, 4).Текст);
			Место.Вставить("Ярус",			ТабличныйДокумент.Область(Предел, 5).Текст);
			Место.Вставить("Место",			ТабличныйДокумент.Область(Предел, 6).Текст);
			Место.Вставить("ВидСверху",		ТабличныйДокумент.Область(Предел, 7).Текст);
			Место.Вставить("Объем",			ТабличныйДокумент.Область(Предел, 8).Текст);
			//3.2.4
			Место.Вставить("Штрихкод",		ТабличныйДокумент.Область(Предел, 9).Текст);
			// ТУ_Августинович -- 27.10.2025
			
			// ТУ_Самойленко 26.05.23 ++
			СтруктураМестХранения.Вставить("место"+(Формат(Предел-1, "ЧГ=")),Место); // Исправлена загрузка ячеек, в количестве, превышающем 999 шт.
			// ТУ_Самойленко 26.05.23 --
			Предел=Предел+1;
		КонецЦикла;
		
		ЗагрузитьНаСервере(СтруктураМестХранения,Объект.Склад); 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Готово";
		Сообщение.УстановитьДанные(Элементы.Владелец);
		Сообщение.Сообщить();
	Иначе 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Место хранения для создания ячейки не выбрано");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(Массив,Владелец)
	
	Для Каждого СтрокаДокумента из Массив Цикл
		
		ДанныеСтроки = СтрокаДокумента.Значение;
		
		лЗапрос= Новый Запрос;
		лЗапрос.Текст =
		
		"ВЫБРАТЬ
		|	вмс_МестаХранения.Владелец КАК Владелец,
		|	вмс_МестаХранения.Наименование КАК Наименование,
		|	вмс_МестаХранения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
		|ГДЕ
		|	вмс_МестаХранения.Владелец = &Владелец
		|	И вмс_МестаХранения.Наименование = &Наименование";
		
		лЗапрос.УстановитьПараметр("Владелец",Владелец);
		лЗапрос.УстановитьПараметр("Наименование",ДанныеСтроки.Наименование);
		ВыборкаПоСкладу =лЗапрос.Выполнить().Выгрузить();
		
		Если ВыборкаПоСкладу.Количество() = 0 Тогда
			Запись = Справочники.вмс_МестаХранения.СоздатьЭлемент();
			Запись.Заполнить(Неопределено);
			Если ДанныеСтроки.Наименование = "" тогда
				ОбщегоНазначения.СообщитьПользователю("Невозможно создание неименованной ячейки");
				Продолжить;	
			КонецЕсли;
			Запись.Наименование = ДанныеСтроки.Наименование;
			Запись.ТипЯчейки = Перечисления.вмс_ТипыЯчеек.Хранение;
			Запись.Владелец = Владелец; 
			
			// ТУ_Августинович ++ 000056225 30.10.2025
			// - Передаем составные части наименования. Необходимы для интерактивной карты склада
			Запись.ЧастьНаименованияСклад	= ДанныеСтроки.Склад;
			Запись.ЧастьНаименованияРяд		= ДанныеСтроки.Ряд;
			Запись.ЧастьНаименованияСтеллаж	= ДанныеСтроки.Стеллаж;
			Запись.ЧастьНаименованияЯрус	= ДанныеСтроки.Ярус;
			Запись.ЧастьНаименованияМесто	= ДанныеСтроки.Место;
			Запись.ВидСверху				= ДанныеСтроки.ВидСверху;
			//3.2.4
			Запись.Штрихкод					= ДанныеСтроки.Штрихкод;
			// ТУ_Августинович -- 30.10.2025
			
			Запись.Записать();
		Иначе
			Ячейка = ВыборкаПоСкладу[0].Ссылка.ПолучитьОбъект();
			Ячейка.Объем = ДанныеСтроки.Объем;
			
			// ТУ_Августинович ++ 000056225 30.10.2025
			// - Передаем составные части наименования. Необходимы для интерактивной карты склада
			Ячейка.ЧастьНаименованияСклад	= ДанныеСтроки.Склад;
			Ячейка.ЧастьНаименованияРяд		= ДанныеСтроки.Ряд;
			Ячейка.ЧастьНаименованияСтеллаж	= ДанныеСтроки.Стеллаж;
			Ячейка.ЧастьНаименованияЯрус	= ДанныеСтроки.Ярус;
			Ячейка.ЧастьНаименованияМесто	= ДанныеСтроки.Место;
			Ячейка.ВидСверху				= ДанныеСтроки.ВидСверху;
			Ячейка.Штрихкод					= ДанныеСтроки.Штрихкод;
			// ТУ_Августинович -- 30.10.2025
			
			Ячейка.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти




