
Функция ПоказатьВыборОбъектаМетаданных(ОписаниеОповещенияОЗакрытии=Неопределено, ВладелецФормы=Неопределено) Экспорт
	
	Форма = ПолучитьФорму("ОбщаяФорма.ФормаВыбораОбъектовМетаДанных", , ВладелецФормы);
	Форма.ОписаниеОповещенияОЗакрытии = ОписаниеОповещенияОЗакрытии;
	Форма.Открыть();
	
	Возврат Форма;
	
КонецФункции

#Область Алгоритмы

Функция ВыполнитьАлгоритм(АлгоритмСсылка, ВходящиеПараметры = Неопределено, ОшибкаВыполнения = Ложь,
	СообщениеОбОшибке = "") Экспорт
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьАлгоритм(АлгоритмСсылка, ВходящиеПараметры, ОшибкаВыполнения,
		СообщениеОбОшибке)
КонецФункции

#КонецОбласти

Функция ПоказатьДиалогВыбораЦвета(ОписаниеОповещенияОЗакрытии=Неопределено, Владелец=Неопределено, Цвет=Неопределено) Экспорт
	
	ФормаВыбораЦвета = ПолучитьФорму("ОбщаяФорма.вмс_ФормаВыбораЦвета", , Владелец);
	Если ТипЗнч(Цвет) = Тип("Цвет") Тогда
		ФормаВыбораЦвета.Цвет = Цвет;
	КонецЕсли;
	ФормаВыбораЦвета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещенияОЗакрытии;
	ФормаВыбораЦвета.Открыть();
	
	Возврат ФормаВыбораЦвета;
	
КонецФункции

Функция УстановитьПометкуУдаленияОбъекта(Объект, Пометка=Истина) Экспорт
	
	// ТУ_Кулалаев Е.С ++ 11.06.2024 12:17:20  
	// Единственная функция в модуле вмс_Клиент. Перенес.
		
	вмс_Сервер.УстановитьПометкуУдаленияОбъекта(Объект.Ссылка, Пометка);
	Если ТипЗнч(Объект) = Тип("Структура") Тогда
		Объект.Вставить("ПометкаУдаления", Пометка);
		Если Пометка Тогда
			Объект.Вставить("Проведен", Ложь);
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции
