#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем РК;
Перем ТипыВводаКоличества Экспорт;
Перем ПустойЭлементВывода;
Перем ПустоеПолеОбработки;

#Область API
Функция ВыполнитьДействие(Действие) Экспорт

	Код = Действие.Код;
	ПараметрыДействия = Действие.Параметры;

	Если Код="СозданиеОбработки" Тогда
		
		ДействиеСозданиеОбработки(Действие);
	
	#Область Инициализация
	ИначеЕсли Код="Инициализировать" Тогда
		
		ДействиеИнициализировать(Действие);
		
	ИначеЕсли Код="ИнициализироватьПеременныеМодуляОбработки" Тогда
		
		ДействиеИнициализироватьПеременныеМодуляОбработки(Действие);
		
	ИначеЕсли Код="ИнициализироватьПараметрыОбработки" Тогда

		ДействиеИнициализироватьПараметрыОбработки(Действие);
		
	ИначеЕсли Код="ИнициализироватьИсточникиДанныхДляЗаполненияПолей" Тогда
		
		ДействиеИнициализироватьИсточникиДанныхДляЗаполненияПолей(Действие);
		
	ИначеЕсли Код="ИнициализироватьПоляОбработкиПоУмолчанию" Тогда
		
		ДействиеИнициализироватьПоляОбработкиПоУмолчанию(Действие);
		
	ИначеЕсли Код="ИнициализироватьПоляОбработки" Тогда

		ДействиеИнициализироватьПоляОбработки(Действие);
		
	ИначеЕсли Код="ЗакончитьИнициализациюПолейОбработки" Тогда
		
		ДействиеЗакончитьИнициализациюПолейОбработки(Действие);
		
	ИначеЕсли Код="ИнициализироватьДанныеОбработки" Тогда

		ДействиеИнициализироватьДанныеОбработки(Действие)
		
	ИначеЕсли Код="ИнициализироватьСборщикиДанных" Тогда

		ДействиеИнициализироватьСборщикиДанных(Действие)
		
	#КонецОбласти
	ИначеЕсли Код="НачалоОбработки" Тогда
		
		ДействиеНачалоОбработки(Действие);

	ИначеЕсли Код="ПолучениеФормыОбработки" Тогда

		ДействиеПолучениеФормыОбработки(Действие);
		
	ИначеЕсли Код="ПриОткрытииФормыОбработки" Тогда

		ДействиеПриОткрытииФормыОбработки(Действие);
		
	ИначеЕсли Код="ПослеОткрытияФормыОбработки" Тогда

		ДействиеПослеОткрытияФормыОбработки(Действие);
		
	ИначеЕсли Код="ПриСменеСтраницы" Тогда
		
		ДействиеПриСменеСтраницы(Действие);
		
	ИначеЕсли Код="ВыборЭлементаТаблицы" Тогда
		
		ДействиеВыборЭлементаТаблицы(Действие);
		
	ИначеЕсли Код="НачатьТранзакциюОбработки" Тогда
		
		ДействиеНачатьТранзакциюОбработки(Действие);
		
	ИначеЕсли Код="ОтменитьТранзакциюОбработки" Тогда
		
		ДействиеОтменитьТранзакциюОбработки(Действие);
		
	ИначеЕсли Код="ЗафиксироватьТранзакциюОбработки" Тогда
		
		ДействиеЗафиксироватьТранзакциюОбработки(Действие);
		
	ИначеЕсли Код="ЕстьИзменениеДанных" Тогда

		ДействиеЕстьИзменениеДанных(Действие);

	ИначеЕсли Код="ПослеЗавершенияВвода" Тогда

		ДействиеПослеЗавершенияВвода(Действие);

	#Область РаботаСДокументомОперацияПоЯчейкам
	ИначеЕсли Код="ПолучитьДокументОперацииПоЯчейкам" Тогда
		
		ДействиеПолучитьДокументОперацииПоЯчейкам(Действие);
		
	ИначеЕсли Код="ЗаписатьДокументОперацииПоЯчейкам" Тогда
		
		ДействиеЗаписатьДокументОперацииПоЯчейкам(Действие);
		
	ИначеЕсли Код="НовыйДокументОперацииПоЯчейкам" Тогда

		ДействиеНовыйДокументОперацииПоЯчейкам(Действие);
		
	ИначеЕсли Код="ВыполнитьЗавершениеОперации" Тогда

		ДействиеВыполнитьЗавершениеОперации(Действие);

	#КонецОбласти
	ИначеЕсли Код="СохранитьСостояниеОбработки" Тогда
		
		ДействиеСохранитьСостояниеОбработки(Действие);
		
	ИначеЕсли Код="ВосстановитьСостояниеОбработки" Тогда
		
		ДействиеВосстановитьСостояниеОбработки(Действие);
		
	ИначеЕсли Код="ПередЗакрытиемФормыОбработки" Тогда
		
		ДействиеПередЗакрытиемФормыОбработки(Действие);
		
	КонецЕсли;
	
	Возврат Действие.Результат;

КонецФункции
#КонецОбласти

Функция ДействиеНачатьТранзакциюОбработки(Действие)
	
	НачатьТранзакцию();
	
    ЗаблокироватьЗаданиеКладовщику(ПараметрыОбработки.СсылкаНаЗадание);
	
КонецФункции

Функция ЗаблокироватьЗаданиеКладовщику(СсылкаНаЗадание)
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаЗадание) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить(СсылкаНаЗадание.Метаданные().ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("Ссылка", СсылкаНаЗадание);
	БлокировкаДанных.Заблокировать();
	Возврат Истина;
	
КонецФункции


Функция ДействиеОтменитьТранзакциюОбработки(Действие)
	
	ОтменитьТранзакцию();
	
КонецФункции

Функция ДействиеЗафиксироватьТранзакциюОбработки(Действие)
	
	ЗафиксироватьТранзакцию();
	
КонецФункции

Функция ДействиеПослеЗавершенияВвода(Действие)
	
	Если ДействиеВыполняетсяПосле(Действие) Тогда
		
		Если ДанныеОбработки.ВводДанныхПередЗавершениемОперацииЗавершен Тогда
			
			ЗавершитьОперациюПослеВводаДанных();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////
//
//					Инициализация+
//

#Область Инициализация

Функция ДействиеИнициализироватьПеременныеМодуляОбработки(Действие)

	ТипыВводаКоличества = РК.НовоеПеречисление("Установить, Добавить", "Строка");
	
КонецФункции

Функция ДействиеСозданиеОбработки(Действие)

	ПараметрыИнициализации = Действие.Параметры;
	СсылкаНаЗадание = Неопределено;
	ПараметрыИнициализации.Свойство("СсылкаНаЗадание", СсылкаНаЗадание);
	Если ЗначениеЗаполнено(СсылкаНаЗадание) Тогда
		АктуализироватьЗаданиеКладовщику(СсылкаНаЗадание);
	КонецЕсли;

КонецФункции

//меняет состояние задания на "Обрабатывается" и дозаполняет данные (ячейки и т.п.)
Функция АктуализироватьЗаданиеКладовщику(СсылкаНаЗадание)
	
	НачатьТранзакцию();
	ЗаблокироватьЗаданиеКладовщику(СсылкаНаЗадание);
	ЗаданиеКладовщику = СсылкаНаЗадание.ПолучитьОбъект();
	Если ЗаданиеКладовщику=Неопределено Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	ЗаданиеКладовщику.Прочитать();
	Если ЗаданиеКладовщику.Состояние=Перечисления.вмс_СостоянияЗаявокКладовщику.Подготовлена Тогда
		ЗаданиеКладовщику.Состояние = Перечисления.вмс_СостоянияЗаявокКладовщику.Обрабатывается;
	КонецЕсли;

	Если ЗаданиеКладовщику.Состояние=Перечисления.вмс_СостоянияЗаявокКладовщику.Обрабатывается Тогда
		Если ЗаданиеКладовщику.Проведен Тогда
			ЗаданиеКладовщику.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	Возврат Истина;
	
КонецФункции

Функция ДействиеИнициализировать(Действие)

	Если ПараметрыОбработки.Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДействиеВыполняетсяПосле(Действие) Тогда
		//ПараметрыОбработки.ПроцессорВводаДанных.Вставить("ВводКоличества", Ложь);
		
		ЗаполнитьСтраницуЗавершение();

		УстановитьВидимостьТаблицыОбработки("ТаблицаПланФакт", ПараметрыОбработки.ЕстьПлан);
		
		ШрифтТаблиц = Новый Шрифт;
		УстановитьСвойстваЭлементовВывода("ТаблицаПланФакт, ТаблицаФакт", Новый Структура("Шрифт, ВариантУправленияВысотой, ВысотаВСтрокахТаблицы", ШрифтТаблиц, "ВСтрокахТаблицы", 1));
		УстановитьСвойстваЭлементовВывода("ТаблицаПланФактПредставлениеТовара, ТаблицаФактПредставлениеТовара", Новый Структура("Ширина, АвтоВысотаЯчейки", 30, Истина));
		
		УстановитьСвойстваЭлементовВывода("ТаблицаПланФактКоличествоПлан, ТаблицаПланФактКоличествоФактИтогоВТаблице", "Ширина", 7);

		УстановитьСвойстваЭлементовВывода("ТаблицаФактКоличествоФакт", "Ширина", 5);
		
		
		
		ПрефиксСтраниц = Обработки.вмс_СерверУправляемыйМодульОперацияПоЯчейкамУниверсальная.ПрефиксСтраницОперации();
		//УстановитьСвойстваЭлементовВывода("КартинкаТест", Новый Структура("ТипЭлемента, Значение, Родитель", "ПолеКартинки", БиблиотекаКартинок.BCGКорова.ПолучитьДвоичныеДанные(), ПрефиксСтраниц + "Инфо"));
		//УстановитьСвойстваЭлементовВывода("КартинкаТест", Новый Структура("ТипЭлемента, Картинка, Родитель", "Картинка", БиблиотекаКартинок.вмс_Штрихкод, ПрефиксСтраниц + "Инфо"));
		
		
		//УстановитьСвойстваЭлементовВывода(ПолучитьЭлементВыводаДляПоляОбработки("Товар"), Новый Структура("ВариантУправленияВысотой, МаксимальнаяВысота, АвтоМаксимальнаяВысота, АвтоПереносСтрок, МногострочныйРежим", "ПоСодержимому", 1, Ложь, Истина, Истина));
		
		СоздатьПорталВыводаHTMLДляСтраницы("Инфо");
		СоздатьПорталВыводаHTMLДляСтраницыВводДанных();
		
		//УстановитьСвойстваЭлементовВывода("ГлавнаяПанельСтраницаИнфо", Новый Структура("Видимость", Ложь));
		
	КонецЕсли;

КонецФункции

Функция ДействиеИнициализироватьПараметрыОбработки(Действие)
	
	Если ДействиеВыполняетсяПосле(Действие) Тогда
		ПараметрыИнициализации = Действие.Параметры.ПараметрыИнициализации;
		
		//
		СсылкаНаЗадание = Неопределено;
		ПараметрыИнициализации.Свойство("СсылкаНаЗадание", СсылкаНаЗадание);
		Если СсылкаНаЗадание <> Неопределено Тогда
			Задание = СсылкаНаЗадание.ПолучитьОбъект();
			Задание.Прочитать();
		Иначе
			Задание = Неопределено;
		КонецЕсли;
		
		Если Задание=Неопределено Тогда
			ВидОперации = Неопределено;
			ПараметрыИнициализации.Свойство("ВидОперации", ВидОперации);

			Задание = СгенерироватьЗаданиеКладовщику(ВидОперации);

			СсылкаНаЗадание = Задание.Ссылка;
		КонецЕсли;
		
		СтруктураНастройкиПолей = Задание.СтруктураНастройкиПолей();
		Задание.ДополнительныеСвойства.Вставить("СтруктураНастройкиПолей", СтруктураНастройкиПолей);
		
		ПравилоЗаполнения = Задание.Правило;
		СледующееПравилоЗаполнения = ПравилоЗаполнения.СледующееПравило;
		Склад = Задание.Склад;
		ДокументОснование = Задание.Распоряжение;
		ЗонаОтправитель = Задание.ЗонаОтправитель;
		ЗонаПолучатель = Задание.ЗонаПолучатель;
		ВидОперации = Задание.Операция;
		РеквизитыВидаОперации = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначенияРеквизитовОбъекта(ВидОперации, "ОтветственноеХранение, ЗапрашиватьУслугиХранения");
		ЕстьОХР = РеквизитыВидаОперации <> Неопределено И ЗначениеЗаполнено(РеквизитыВидаОперации.ОтветственноеХранение);
		ЗапрашиватьУслугиХранения = ЕстьОХР И РеквизитыВидаОперации.ЗапрашиватьУслугиХранения=Истина;
		
		ПараллельноеФормированиеЗаданийСледующегоЭтапа =	ПравилоЗаполнения.ПараллельноеФормированиеЗаданийСледующегоЭтапа
															И ЗначениеЗаполнено(СледующееПравилоЗаполнения)
															И ЗначениеЗаполнено(ДокументОснование);
		
		Инвентаризация = Задание.Инвентаризация;
		ИмяТаблицыФакта = ?(Инвентаризация, "ТоварыПоИнвентаризации", "Товары");
		
		НастройкаОператора = Неопределено;
		ПараметрыИнициализации.Свойство("НастройкаОператора", НастройкаОператора);
		
		Если НастройкаОператора <> Неопределено Тогда
			РеквизитыНастройкиОператора = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначенияРеквизитовОбъекта(НастройкаОператора, "Оператор, ЗвуковаяСхема, МасштабФормы");
			Ответственный = РеквизитыНастройкиОператора.Оператор;
			ИмяЗвуковойСхемы = РеквизитыНастройкиОператора.ЗвуковаяСхема.Имя;
			Если ЗначениеЗаполнено(РеквизитыНастройкиОператора.МасштабФормы) Тогда
				ПараметрыОбработки.МасштабФормы = РеквизитыНастройкиОператора.МасштабФормы;
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыОбработки.ШрифтФормы = СтруктураНастройкиПолей.Шрифт;
	
		ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля();
		РК.ВычестьМассив(ТоварныеПоляМассив, "Упаковка");
		ТоварныеПоля = РК.МассивВСтроку(ТоварныеПоляМассив);

		ПараметрыОбработки.Вставить("СсылкаНаЗадание", СсылкаНаЗадание);
		ПараметрыОбработки.Вставить("Задание", Задание);
		ПараметрыОбработки.Вставить("СтруктураНастройкиПолей", СтруктураНастройкиПолей);
		ПараметрыОбработки.Вставить("ЕстьПлан", Задание.Товары.Количество() > 0);
		ПараметрыОбработки.Вставить("ВерсияДокументаЗадания");
		ПараметрыОбработки.Вставить("ОперацияПоЯчейкам");
		ПараметрыОбработки.Вставить("ВидОперации", ВидОперации);
		ПараметрыОбработки.Вставить("ЕстьОХР", ЕстьОХР);
		ПараметрыОбработки.Вставить("ЗапрашиватьУслугиХранения", ЗапрашиватьУслугиХранения);
		ПараметрыОбработки.Вставить("НастройкаОператора", НастройкаОператора);
		ПараметрыОбработки.Вставить("ВерсияНастройкиОператора");
		ПараметрыОбработки.Вставить("Ответственный", Ответственный);
		ПараметрыОбработки.Вставить("ДокументОснование", ДокументОснование);
		ПараметрыОбработки.Вставить("ПравилоЗаполнения", ПравилоЗаполнения);
		ПараметрыОбработки.Вставить("СледующееПравилоЗаполнения", СледующееПравилоЗаполнения);
		ПараметрыОбработки.Вставить("ПараллельноеФормированиеЗаданийСледующегоЭтапа", ПараллельноеФормированиеЗаданийСледующегоЭтапа);
		ПараметрыОбработки.Вставить("Склад", Склад);
		ПараметрыОбработки.Вставить("ЗонаОтправитель", ЗонаОтправитель);
		ПараметрыОбработки.Вставить("ЗонаПолучатель", ЗонаПолучатель);
		ПараметрыОбработки.Вставить("ТоварныеПоляМассив", ТоварныеПоляМассив);
		ПараметрыОбработки.Вставить("ТоварныеПоля", ТоварныеПоля);
		ПараметрыОбработки.Вставить("ТипыВводаКоличества", ТипыВводаКоличества);
		ПараметрыОбработки.Вставить("Инвентаризация", Инвентаризация);
		ПараметрыОбработки.Вставить("ИмяТаблицыФакта", ИмяТаблицыФакта);
		ПараметрыОбработки.Вставить("ИмяЗвуковойСхемы", ИмяЗвуковойСхемы);

		ПустойЭлементВывода = ПараметрыОбработки.ПустойЭлементВывода;
		ПустоеПолеОбработки = ПараметрыОбработки.ПустоеПолеОбработки;
	КонецЕсли;
	
КонецФункции

Функция СгенерироватьЗаданиеКладовщику(ВидОперации)

	Правило = Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.НайтиПравилоЗаполненияЗадания(ВидОперации);
	Если НЕ ЗначениеЗаполнено(Правило) Тогда
		ПараметрыОбработки.Отказ = Истина;
		вмс_СерверУправляемыеОбработки.ДобавитьОшибкуДействия("Не найдено правило заполнения");
		Задание = Документы.вмс_ЗаданиеКладовщику.СоздатьДокумент();
		Возврат Задание;
	КонецЕсли;
	
	ТаблицаЗаданийКладовщику = вмс_ФормированиеЗаданийКладовщикам.ЗаполнитьЗаданияКладовщикамПоРаспоряжению(Правило, Неопределено);
	
	Если ЗначениеЗаполнено(ТаблицаЗаданийКладовщику) Тогда
		Задание = ТаблицаЗаданийКладовщику[0].ЗаданиеКладовщикуОбъект;
		Задание.ДозаполнениеДокумента();
	Иначе
		Задание = Документы.вмс_ЗаданиеКладовщику.СоздатьДокумент();
		Задание.Заполнить(Неопределено);
		ПараметрыОбработки.Отказ = Истина;
		вмс_СерверУправляемыеОбработки.ДобавитьОшибкуДействия("Нет данных для обработки");
	КонецЕсли;

	Возврат Задание;
	
КонецФункции

Функция ДействиеИнициализироватьСборщикиДанных(Действие)

	СтруктураНастройкиПолей = ПараметрыОбработки.СтруктураНастройкиПолей;
	НастройкаСборщиковДанных = СтруктураНастройкиПолей.СборщикиДанных;
	НастройкаСтраниц = СтруктураНастройкиПолей.НастройкаСтраниц;
	Для Каждого НастройкаСборщикаДанных Из НастройкаСборщиковДанных Цикл
		Имя = НастройкаСборщикаДанных.Имя;
		СтраницыСборщика = НастройкаСтраниц.НайтиСтроки(Новый Структура("СборщикДанных", Имя));
		ПоляСборщика = Новый Массив;
		Для Каждого СтраницаСборщика Из СтраницыСборщика Цикл
			РК.ДобавитьЭлементыКоллекции(ПоляСборщика, ПоляОбработки(Новый Структура("Страница", СтраницаСборщика.Имя)));
		КонецЦикла;
		СписокПолейСборщика = РК.ВыгрузитьЗначенияКолонкиКоллекции(ПоляСборщика, "Имя");
		
		Если НастройкаСборщикаДанных.Тип="СборщикДанныхТоваров" Тогда
			Если СписокПолейСборщика.Найти("Маркировка") <> Неопределено Тогда
				СборщикДанных = СтандартныйМодуль.ДобавитьСборщикДанных("СборщикДанныхМаркировки", "СборщикДанныхМаркировки");
				СборщикДанных.УстановитьПоля(ПоляСборщика);
				СборщикДанных.УстановитьРабочиеСтраницы(РК.ВыгрузитьЗначенияКолонкиКоллекции(СтраницыСборщика, "Имя"));
			КонецЕсли;
		КонецЕсли;
		
		СборщикДанных = СтандартныйМодуль.ДобавитьСборщикДанных(НастройкаСборщикаДанных.Тип, Имя);
		СборщикДанных.УстановитьПоля(ПоляСборщика);
		СборщикДанных.УстановитьРабочиеСтраницы(РК.ВыгрузитьЗначенияКолонкиКоллекции(СтраницыСборщика, "Имя"));
	КонецЦикла;
	
	СборщикДанныхТоваров = СборщикДанных("СборщикДанныхТоваров");
	Если СборщикДанныхТоваров <> Неопределено Тогда
		УстановитьДополнительныеПоляСборщикаДанныхТоваров(СборщикДанныхТоваров);
		СборщикДанныхТоваров.ДобавитьЭтапВводаДанных(НовыйОписаниеОповещения("ОбработчикЭтапаВводаДанныхТовара_КонецВвода"), "КонецВвода");
	КонецЕсли;

	СборщикДанныхЗавершение = СборщикДанных("СборщикДанныхЗавершение");
	Если СборщикДанныхЗавершение <> Неопределено Тогда
		СборщикДанныхЗавершение.ДобавитьЭтапВводаДанных(НовыйОписаниеОповещения("ОбработчикЭтапаВводаДанныхПередЗавершениемОперации"), "КонецВвода");
	КонецЕсли;
	
	УстановитьРезультатДействия(Действие, Истина);
	
КонецФункции

Функция УстановитьДополнительныеПоляСборщикаДанныхТоваров(СборщикДанныхТоваров)
	
	ПоляИспользуемыеСборщиками = Новый Массив;
	Для Каждого СборщикДанных Из СборщикиДанных() Цикл
		РК.ДобавитьЭлементыКоллекции(ПоляИспользуемыеСборщиками, СборщикДанных.ПараметрыМодуля.ПоляОбработки.ВыгрузитьКолонку("Имя"));
	КонецЦикла;
	
	ПоляСборщика = Новый Массив;
	Для Каждого ИмяСтраницы Из СборщикДанныхТоваров.ПараметрыМодуля.РабочиеСтраницы Цикл
		РК.ДобавитьЭлементыКоллекции(ПоляСборщика, СписокПолейОбработки(Новый Структура("Страница", ИмяСтраницы)));
	КонецЦикла;
	
	ДополнительныеПоляСборщика = РК.ВычитаниеМассивов(ПоляСборщика, ПоляИспользуемыеСборщиками);
	Если ДополнительныеПоляСборщика.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ИмяПоля Из ДополнительныеПоляСборщика Цикл
		Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьСвойстваПолейОбработки(СборщикДанныхТоваров.ПараметрыМодуля, ИмяПоля, ПолеОбработки(ИмяПоля));
	КонецЦикла;
	
	СборщикДанныхТоваров.ИнициализироватьДанные();
	
	Возврат Истина;
	
КонецФункции

Функция ДействиеИнициализироватьИсточникиДанныхДляЗаполненияПолей(Действие)

	СтандартныйМодуль.ДобавитьИсточникДанныхДляЗаполненияПолей("Задание", "ПараметрыОбработки.Задание");
	СтандартныйМодуль.ДобавитьИсточникДанныхДляЗаполненияПолей("Задание.Товары", "ДанныеОбработки.Таблицы.ТаблицаПланФакт");

КонецФункции

Функция ДействиеИнициализироватьПоляОбработкиПоУмолчанию(Действие)
	
	РК.УстановитьЭлементыКоллекции(ПараметрыОбработки.ПоляОбработки, вмс_СерверУправляемыеОперации.ТаблицаЗначенийСвойствПолейОперацииПоУмолчанию());

	//отключим по умолчанию все поля, после завершения инициализации неиспользуемые поля будут удалены
	УстановитьСвойстваПолейОбработки(, "Использование", Ложь);

	УстановитьРезультатДействия(Действие, Истина);

КонецФункции

Функция ДействиеИнициализироватьПоляОбработки(Действие)

	ИнициализироватьПоляОбработкиПоЗаданию();
	
	Если ПараметрыОбработки.Инвентаризация Тогда
		ПолеЯчейка = ПолеОбработки("Ячейка");
		Если ПолеЯчейка.Использование Тогда
			УстановитьСвойстваПолейОбработки(ПолеЯчейка, Новый Структура("Синоним, СинонимВинительныйПадеж", "Ячейка", "Ячейку"));
		КонецЕсли;
	КонецЕсли;
	
	ИнициализироватьПоляОперацииПриЗавершении();
	
	ИнциализироватьСобытияПолейОбработки();
	
	УстановитьРезультатДействия(Действие, Истина);
	
КонецФункции

Функция ИнциализироватьСобытияПолейОбработки()
	Для Каждого Поле Из ПоляОбработки(Новый Структура("Группа, Ввод, Вывод", "Количество", Истина, Истина)) Цикл
		УстановитьОбработчикиСобытийПолейОбработки(Поле, Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикОткрытьФормуВводаКоличества", , Новый Структура("ИмяПоля", Поле.Имя))));
		УстановитьСвойстваЭлементовВывода(Поле.ИмяЭлементаВывода, Новый Структура("ТолькоПросмотр", Истина));
	КонецЦикла;
КонецФункции

Функция ОбработчикОткрытьФормуВводаКоличества(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрыДействия = Новый Структура("Отказ", Ложь);
	ДействиеПередОткрытиемФормыВводаКоличества = Действие("ПередОткрытиемФормыВводаКоличества", ПараметрыДействия);
	ДействиеПередОткрытиемФормыВводаКоличества.Результат = ПараметрыДействия;
	вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(ДействиеПередОткрытиемФормыВводаКоличества);
	Если ДействиеПередОткрытиемФормыВводаКоличества.Результат.Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Количество", ДанныеОбработки.ПредставлениеДанныхПолей[ДополнительныеПараметры.ИмяПоля]);
	СтандартныйМодуль.ПоказатьФормуДиалога(НовыйОписаниеОповещения("ОбработчикЗакрытияФормыВводаКоличества", , ДополнительныеПараметры), "ОбщаяФорма.ФормаВводаКоличества", ПараметрыФормы);
	
КонецФункции

Функция ОбработчикЗакрытияФормыВводаКоличества(ВведенноеКоличество, ДополнительныеПараметры) Экспорт
	
	Если ВведенноеКоличество=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВвестиДанныеПоля(ДополнительныеПараметры.ИмяПоля, ВведенноеКоличество);
	
КонецФункции

Функция ИнициализироватьПоляОбработкиПоЗаданию()
	
	СтруктураНастройкиПолей = ПараметрыОбработки.СтруктураНастройкиПолей;
	
	ПорядокВвода = 1;
	
	НастройкаПолей = СтруктураНастройкиПолей.НастройкаПолей.Скопировать();
	НастройкаПолей.Сортировать("ПорядокВвода");
	
	Для Каждого НастройкаПоля Из НастройкаПолей Цикл
		
		Если НЕ (НастройкаПоля.Ввод ИЛИ НастройкаПоля.Сборка ИЛИ НастройкаПоля.Вывод) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = НастройкаПоля.Имя;
		Если ИмяПоля="ЯчейкаОтправитель" Тогда
			ИмяПоля = "Ячейка";
		КонецЕсли;
		
		СвойстваПоля = Новый Структура("ОбязательныйВвод, ОбязательноеЗаполнение, Сборка, Ввод, План, Вывод, Ресурс, Страница, ПутьКДаннымЗаполнения, Синоним, ПоложениеЗаголовка", Истина, Истина, Ложь, Ложь, Ложь, Ложь, Ложь);
		ЗаполнитьЗначенияСвойств(СвойстваПоля, НастройкаПоля);
		Если ЗначениеЗаполнено(СвойстваПоля.Страница) Тогда
			СвойстваПоля.Страница = СвойстваПоля.Страница;
		КонецЕсли;
		
		ТипЗначения = НастройкаПоля.ТипЗначения;
		Если ТипЗнч(ТипЗначения)=Тип("ОписаниеТипов") И ТипЗначения.Типы().Количество() > 0 Тогда
			СвойстваПоля.Вставить("ТипЗначения", ТипЗначения);
		КонецЕсли;
		
		Шрифт = НастройкаПоля.Шрифт;
		Если ТипЗнч(Шрифт) <> Тип("Шрифт") Тогда
			Шрифт = Новый Шрифт;
		КонецЕсли;

		СвойстваПоля.Вставить("ПорядокВвода", ПорядокВвода);
		СвойстваПоля.Вставить("ПорядокВывода", ПорядокВвода);
		СвойстваПоля.Вставить("Шрифт", Шрифт);
		
		УстановитьСвойстваПолейОбработки(ИмяПоля, СвойстваПоля);
		УстановитьСвойстваЭлементовВывода(ИмяПоля, Новый Структура("МногострочныйРежим", Истина));
		
		ПорядокВвода = ПорядокВвода + 1;
		
	КонецЦикла;

	Подсказка = ПолеОбработки("Подсказка");
	Если Подсказка <> ПустоеПолеОбработки Тогда
		УстановитьСвойстваЭлементовВывода(ПолучитьЭлементВыводаДляПоляОбработки("Подсказка", Подсказка), Новый Структура("ГоризонтальноеПоложение, РастягиватьПоВертикали", "Центр", "Нет"));
	КонецЕсли;
		
	ПорядокВвода = ПорядокВвода + 1;
	УстановитьСвойстваПолейОбработки("КоличествоПлан",		Новый Структура("План, Вывод, Ресурс, НачальноеЗначение, ЗначениеПоУмолчанию, ПустыеЗначения, ПорядокВывода, Страница, ПоложениеЗаголовка, Шрифт", Истина, Ложь, Истина, 0, 0, 0, ПорядокВвода, "ГлавнаяПанельСтраницаВводДанных", "Нет", Шрифт));
	УстановитьСвойстваЭлементовВывода("КоличествоПлан", "РастягиватьПоВертикали", Ложь);
	УстановитьСвойстваПолейОбработки("КоличествоФактИтого", Новый Структура("План, Вывод, Ресурс, НачальноеЗначение, ЗначениеПоУмолчанию, ПустыеЗначения, ПорядокВывода", Истина, Ложь,	Истина, 0, 0, 0, ПорядокВвода+1));

КонецФункции

Функция ИнициализироватьПоляОперацииПриЗавершении()
	ПрефиксСтраницОперации = Обработки.вмс_СерверУправляемыйМодульОперацияПоЯчейкамУниверсальная.ПрефиксСтраницОперации();
	ИмяСтраницы = ПрефиксСтраницОперации + "Завершение";

	УстановитьСвойстваПолейОбработки("ПодтвердитьРасхожденияПоПлану", Новый Структура("Ввод, Вывод, АвтоНачалоВыбора, ТипЗначения, Страница", Истина, Ложь, Истина, Новый ОписаниеТипов("Булево"), ИмяСтраницы));
	СтандартныйМодуль.УстановитьОбработчикиСобытийПолейОбработки("ПодтвердитьРасхожденияПоПлану", Новый Структура("НачалоВыбора", НовыйОписаниеОповещения("ОбработчикЗадатьВопросПодтвердитьРасхожденияПоПлану")));
	
	Если ПараметрыОбработки.ЗапрашиватьУслугиХранения Тогда
		УстановитьСвойстваПолейОбработки("УслугиОХР", Новый Структура("Ввод, Вывод, АвтоНачалоВыбора, ТипЗначения, Страница", Истина, Ложь, Истина, Новый ОписаниеТипов("Булево"), ИмяСтраницы));
		СтандартныйМодуль.УстановитьОбработчикиСобытийПолейОбработки("УслугиОХР", Новый Структура("НачалоВыбора", НовыйОписаниеОповещения("ОбработчикЗадатьВопросНужноВвестиУслугиОХР")));
	КонецЕсли;
КонецФункции

Функция ДействиеЗакончитьИнициализациюПолейОбработки(Действие)
	
	Если ПараметрыОбработки.ЕстьПлан Тогда
		Для Каждого ПолеКоличества Из ПоляОбработки(Новый Структура("Группа", "Количество")) Цикл
			Если ПолеКоличества.План И ПолеКоличества.Вывод Тогда
				УстановитьСвойстваПолейОбработки("КоличествоПлан", Новый Структура("Вывод", Истина));
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ПолеОбработки Из ПоляОбработки() Цикл
		Если НЕ ЗначениеЗаполнено(ПолеОбработки.Страница) Тогда
			ПолеОбработки.Страница = "ГлавнаяПанельСтраницаВводДанных";
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция СоздатьПорталВыводаHTMLДляСтраницыВводДанных()
	
	ИмяПортала = СоздатьПорталВыводаHTMLДляСтраницы("ВводДанных");
	
	КнопкаДалее = ЭлементВывода("КнопкаДалее");
	Если КнопкаДалее <> ПустойЭлементВывода Тогда
		СвойстваЭлемента = Новый Структура;
		СвойстваЭлемента.Вставить("ТипЭлемента", КнопкаДалее.ТипЭлемента);
		СвойстваЭлемента.Вставить("Видимость", Ложь);
		СвойстваЭлемента.Вставить("Номер", КнопкаДалее.Номер);
		Если КнопкаДалее.Свойства.Свойство("СочетаниеКлавиш") Тогда
			СвойстваЭлемента.Вставить("СочетаниеКлавиш", КнопкаДалее.Свойства.СочетаниеКлавиш);
		КонецЕсли;
		УстановитьСвойстваЭлементовВывода("КнопкаДалееПереходникHTML", СвойстваЭлемента);
		УстановитьОбработчикиСобытийЭлементовВывода("КнопкаДалееПереходникHTML", РК.СкопироватьОбъект(КнопкаДалее.События));

		ПрограммныйКод =
		"document = ЭтаФорма.Элементы.[ПорталВыводаHTML].Документ;
		|defaultView = document.defaultView;
		|document.activeElement.blur();
		|button = defaultView.КнопкаДалееПереходникHTML;
		|Если button <> Неопределено Тогда
		|	button.focus();
		|	button.click();
		|КонецЕсли;";
		
		ПрограммныйКод = СтрЗаменить(ПрограммныйКод, "[ПорталВыводаHTML]", ИмяПортала);
		
		ДополнительныеПараметры = Новый Структура("ПрограммныйКод", ПрограммныйКод);
		УстановитьОбработчикиСобытийЭлементовВывода("КнопкаДалее", Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикКнопкиДалееВызовHTML", , ДополнительныеПараметры)));
		
		УстановитьСвойстваЭлементовВывода("КнопкаДалееПереходникHTML", "Портал", ИмяПортала);
	КонецЕсли;
	
КонецФункции

Функция СоздатьПорталВыводаHTMLДляСтраницы(ИмяСтраницы)

	ИмяПортала = "ПорталВыводаHTMLСтраницы" + ИмяСтраницы;
	
	ИмяСтраницыПолное = "ГлавнаяПанельСтраница" + ИмяСтраницы;
	УстановитьСвойстваЭлементовВывода(ИмяПортала, Новый Структура("ТипЭлемента, АктивизироватьПоУмолчанию, Родитель", "ПолеHTMLДокумента", Истина, ИмяСтраницыПолное));
	
	ПоляВывода = ПоляОбработки(Новый Структура("Вывод, Страница", Истина, ИмяСтраницыПолное));
	Если ПоляВывода.Количество() > 0 Тогда
		ПорядокВывода = ПоляВывода[0].ПорядокВывода;
		Для Каждого ПолеВывода Из ПоляВывода Цикл
			Если ПолеВывода.ПорядокВывода < ПорядокВывода Тогда
				ПорядокВывода = ПолеВывода.ПорядокВывода;
			КонецЕсли;
		КонецЦикла;
		УстановитьСвойстваЭлементовВывода(ИмяПортала, Новый Структура("Номер", ПорядокВывода));
	КонецЕсли;
	СписокЭлементовВывода = РК.ВыгрузитьЗначенияКолонкиКоллекции(ПоляВывода, "ИмяЭлементаВывода");
	
	УстановитьСвойстваЭлементовВывода(СписокЭлементовВывода, "Портал", ИмяПортала);
	
	УстановитьОбработчикиСобытийЭлементовВывода(ИмяПортала, Новый Структура("ПриНажатии", НовыйОписаниеОповещения("ОбработчикHTMLСобытия", СтандартныйМодуль)));
	УстановитьОбработчикиСобытийЭлементовВывода(ИмяПортала, Новый Структура("RunTimeError", НовыйОписаниеОповещения("ОбработчикОшибкиВыполнения", СтандартныйМодуль)));

	Возврат ИмяПортала;

КонецФункции

Функция ОбработчикКнопкиДалееВызовHTML(Параметр, ДополнительныеПараметры) Экспорт

	ДобавитьДействиеНаКлиенте("ВыполнитьПрограммныйКод", ДополнительныеПараметры.ПрограммныйКод);
	
КонецФункции

Функция ДействиеИнициализироватьДанныеОбработки(Действие)

	Если ДействиеВыполняетсяПосле(Действие) Тогда
		
		ДанныеОбработки.Вставить("СсылкаОперацииПоЯчейкам");
		ДанныеОбработки.Вставить("ВводДанныхПередЗавершениемОперацииЗавершен", Ложь);
		
		ДанныеОбработки.Таблицы.Вставить("ТаблицаПланФакт", РК.НоваяКоллекцияЗначений("Товар, Выполнен, КоличествоПлан, КоличествоФактИтого"));
		
	КонецЕсли;
	
КонецФункции

Функция Переинициализировать()
	
	СохраненныеПараметрыОбработки = Новый Структура("Диалоги, Таймеры, ЭлементыВывода");
	СохраненныеДанныеОбработки = Новый Структура("СсылкаОперацииПоЯчейкам");
	ЗаполнитьЗначенияСвойств(СохраненныеПараметрыОбработки, ПараметрыОбработки);
	ЗаполнитьЗначенияСвойств(СохраненныеДанныеОбработки, ДанныеОбработки);
	
	//скопируем значения полей
	ДанныеХЗ = Новый ХранилищеЗначения(ПараметрыОбработки.Данные);
	ПараметрыОбработки.СостояниеОбработки.Данные = ДанныеХЗ.Получить();
	
	Для Каждого СборщикДанных Из СборщикиДанных() Цикл
		ПараметрыМодуля = СборщикДанных.ПараметрыМодуля;
		ДанныеХЗ = Новый ХранилищеЗначения(ПараметрыМодуля.Данные);
		ПараметрыМодуля.СостояниеМодуля.Данные = ДанныеХЗ.Получить();
	КонецЦикла;
	
	//
	Действие = Действие("Инициализировать", ПараметрыОбработки.СостояниеОбработки.ПараметрыИнициализации);
	вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие);
	
	//Если после инициализации какие-то поля были отключены, то элементы вывода этих полей также надо скрыть
	//Для этого сохраним информацию об этих элементах, чтобы система понимала, что они были, больше не используются
	//и их надо скрыть
	Для Каждого ЭлементВывода Из СохраненныеПараметрыОбработки.ЭлементыВывода Цикл
		НовыйЭлементВывода = ЭлементВывода(ЭлементВывода.Имя);
		Если НовыйЭлементВывода=ПустойЭлементВывода Тогда
			УстановитьСвойстваЭлементовВывода(ЭлементВывода.Имя, "Удалить", Истина);
		Иначе
			ТипЭлемента = Неопределено;
			НовыйТипЭлемента = Неопределено;
			Если ЭлементВывода.Свойства.Свойство("ТипЭлемента", ТипЭлемента)
				И НовыйЭлементВывода.Свойства.Свойство("ТипЭлемента", НовыйТипЭлемента)
				И ТипЭлемента <> НовыйТипЭлемента Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НовыйЭлементВывода, ЭлементВывода, "СвойстваНаКлиенте");
			Если НовыйЭлементВывода.Свойства.Свойство("Номер") Тогда
				НовыйЭлементВывода.СвойстваПередать.Вставить("Номер", НовыйЭлементВывода.Свойства.Номер);
				НовыйЭлементВывода.СвойстваНаКлиенте.Удалить("Номер");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СохраненныеПараметрыОбработки.Удалить("ЭлементыВывода");
	ЗаполнитьЗначенияСвойств(ПараметрыОбработки, СохраненныеПараметрыОбработки);
	ДанныеОбработки.СсылкаОперацииПоЯчейкам = СохраненныеДанныеОбработки.СсылкаОперацииПоЯчейкам;

	//восстановим значения полей
	ЗаполнитьЗначенияСвойств(ДанныеОбработки.ВведенныеДанныеПолей, СостояниеОбработки.Данные.ВведенныеДанныеПолей);
	Для Каждого ДанныеПоля Из СостояниеОбработки.Данные.СтатическиеДанныеПолей Цикл
		УстановитьЗначениеДанныхПоляОбработки(ПолеОбработки(ДанныеПоля.Ключ), ДанныеПоля.Значение);
	КонецЦикла;
	СостояниеОбработки.Данные = ДанныеОбработки;
	
	Для Каждого СборщикДанных Из СборщикиДанных() Цикл
		ЗаполнитьЗначенияСвойств(СборщикДанных.ДанныеМодуля.ВведенныеДанныеПолей, СборщикДанных.СостояниеМодуля.Данные.ВведенныеДанныеПолей);
		Для Каждого ДанныеПоля Из СборщикДанных.СостояниеМодуля.Данные.СтатическиеДанныеПолей Цикл
			Поле = Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(СборщикДанных.ПараметрыМодуля, ДанныеПоля.Ключ);
			Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьЗначениеДанныхПоляОбработки(СборщикДанных.ПараметрыМодуля, Поле, ДанныеПоля.Значение);
		КонецЦикла;
		СборщикДанных.СостояниеМодуля.Данные = СборщикДанных.ДанныеМодуля;
	КонецЦикла;
	
	//
	ЗаполнитьТаблицы();
	ЗаполнитьДанныеПолей();
	
КонецФункции

#КонецОбласти

//
//					Инициализация-
//
//////////////////////////////////////////////////////////////////////////////////

Функция ОбработчикЗадатьВопросПодтвердитьРасхожденияПоПлану(Параметры, ДополнительныеПараметры) Экспорт
	
	Если НЕ ПараметрыОбработки.ЕстьПлан ИЛИ ПроверитьВыполнениеПлана() Тогда
		// нет расхождений
		ВвестиДанныеПоля("ПодтвердитьРасхожденияПоПлану", Ложь);
		Возврат Ложь;
	КонецЕсли;
	
	ПоказатьДиалогНаКлиенте("ОбработчикОтветаНаВопросПодтвердитьРасхожденияПоПлану", "Есть расхождения по плану, продолжить?", "ДаНет");
	
КонецФункции

Функция ОбработчикОтветаНаВопросПодтвердитьРасхожденияПоПлану(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ="Да" Тогда
		ВвестиДанныеПоля("ПодтвердитьРасхожденияПоПлану", Истина);
	КонецЕсли;
	
КонецФункции

Функция ОбработчикЗадатьВопросНужноВвестиУслугиОХР(Параметры, ДополнительныеПараметры) Экспорт
	
	ПоказатьДиалогНаКлиенте("ОбработчикОтветаНаВопросНужноВвестиУслугиОХР", "Ввести услги ОХР?", "ДаНетОтмена");
	
КонецФункции

Функция ОбработчикОтветаНаВопросНужноВвестиУслугиОХР(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ="Отмена" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Ответ="Да" Тогда
		ОбработчикОткрытьФормуВводУслугОХР();
	Иначе
		ВвестиДанныеПоля("УслугиОХР", Ложь);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОбработчикОткрытьФормуВводУслугОХР(Параметры=Неопределено, ДополнительныеПараметры=Неопределено) Экспорт
	
	Контрагент = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(ПараметрыОбработки.ДокументОснование, "Контрагент");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", Контрагент);
	ПараметрыФормы.Вставить("Операция", ПараметрыОбработки.ВидОперации);
	ПараметрыФормы.Вставить("ДокументОснование", ПараметрыОбработки.ДокументОснование);
	ПараметрыФормы.Вставить("НоваяФорма", Ложь);
	СтандартныйМодуль.ПоказатьФормуДиалога(НовыйОписаниеОповещения("ОбработчикЗавершениеВводУслугОХР"), "Документ.вмс_ОперацияПоЯчейкам.Форма.ФормаОХР", ПараметрыФормы);
	
КонецФункции

Функция ОбработчикЗавершениеВводУслугОХР(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> Неопределено Тогда
		ВвестиДанныеПоля("УслугиОХР", Истина);
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьСтраницуЗавершение()
	
	Свойства = Новый Структура;
	Свойства.Вставить("Родитель", "ГлавнаяПанельСтраницаЗавершение");
	Свойства.Вставить("АвтоМаксимальнаяШирина", Ложь);
	Свойства.Вставить("МаксимальнаяШирина", 0);
	Свойства.Вставить("АвтоМаксимальнаяВысота", Ложь);
	Свойства.Вставить("МаксимальнаяВысота", 0);
	Свойства.Вставить("РастягиватьПоГоризонтали", Истина);
	Свойства.Вставить("РастягиватьПоВертикали", Истина);

	
	
	Свойства.Вставить("ТипЭлемента", "Надпись");
	УстановитьСвойстваЭлементовВывода("Заглушка1", Свойства);
	УстановитьСвойстваЭлементовВывода("Заглушка2", Свойства);

	
	
	Свойства.Вставить("ЦветРамки", Новый Цвет(0,0,0));
	Свойства.Вставить("ТипЭлемента", "КнопкаФормы");
	
	Свойства.Вставить("Заголовок", "Сохранить и выйти");
	УстановитьСвойстваЭлементовВывода("КнопкаСохранить", Свойства);
	УстановитьОбработчикиСобытийЭлементовВывода("КнопкаСохранить", Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикКнопкиСохранить")));

	Свойства.Вставить("Заголовок", "Завершить задание");
	УстановитьСвойстваЭлементовВывода("КнопкаЗавершить", Свойства);
	УстановитьОбработчикиСобытийЭлементовВывода("КнопкаЗавершить", Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикКнопкиЗавершить")));
	
КонецФункции

Функция ОбработчикКнопкиСохранить(Результат, ДополнительныеПараметры) Экспорт
	
	//просто закрываем обработку, данные уже сохранены, но чтобы кладовщик не переживал напишем "Сохранить" на кнопке
	ЗавершитьРаботуОбработки();
	
КонецФункции

Функция ОбработчикКнопкиЗавершить(Результат, ДополнительныеПараметры) Экспорт
	
	ЗавершитьОперацию();
	
КонецФункции

Функция ДействиеНачалоОбработки(Действие)

	Если ПараметрыОбработки.Отказ Тогда
		ЗавершитьРаботуОбработки();
		Возврат УстановитьРезультатДействия(Действие, Ложь);
	КонецЕсли;
	
	ВзятьЗаданиеВРаботу();
	
	ЗаполнитьТаблицы();
	ОпределитьСледующуюИнструкцию();
	ЗаполнитьДанныеПолей();
	
	ПараметрыОбработки.ВерсияДокументаЗадания = вмс_ОбщегоНазначенияВызовСервера.ВерсияДанных(ПараметрыОбработки.СсылкаНаЗадание);
	ПараметрыОбработки.ВерсияНастройкиОператора = вмс_ОбщегоНазначенияВызовСервера.ВерсияДанных(ПараметрыОбработки.НастройкаОператора);

	
	ОткрытьФормуОбработки("Документ.вмс_ОперацияПоЯчейкам.Форма." + ПолучитьФормуОбработки());
	
	Возврат УстановитьРезультатДействия(Действие, Истина);
	
КонецФункции

Функция ВзятьЗаданиеВРаботу()
	
	вмс_ОперацииПоЯчейкамВызовСервера.УстановитьСтатусСПроверкой(ПараметрыОбработки.СсылкаНаЗадание, ПараметрыОбработки.ВидОперации, ПараметрыОбработки.Ответственный);
	
КонецФункции

Функция ДействиеПолучениеФормыОбработки(Действие)
	
КонецФункции

Функция ДействиеПриОткрытииФормыОбработки(Действие)
	
КонецФункции

Функция ДействиеПослеОткрытияФормыОбработки(Действие)

	Если ДействиеВыполняетсяПосле(Действие) Тогда
		Если ПроверитьВыполнениеПлана() Тогда
			ПредложитьЗавершениеОперации();
		КонецЕсли;

		ДобавитьТаймер("ОбработчикОжидания", 1000);
	КонецЕсли;
	
КонецФункции

Функция ОбработчикОжидания(Результат, ДополнительныеПараметры) Экспорт
	
	НоваяВерсияДокументаЗадания = вмс_ОбщегоНазначенияВызовСервера.ВерсияДанных(ПараметрыОбработки.СсылкаНаЗадание);
	Если ПараметрыОбработки.ВерсияДокументаЗадания <> НоваяВерсияДокументаЗадания Тогда
		//при изменении задания переинициализируем операцию
		Если НастройкиПолейИзменились() Тогда
			Переинициализировать();
		Иначе
			СтандартныйМодуль.ОбработчикОжидания(Результат, ДополнительныеПараметры);
		КонецЕсли;
		ПараметрыОбработки.ВерсияДокументаЗадания = НоваяВерсияДокументаЗадания;
	Иначе
		
		НоваяВерсияНастройкиОператора = вмс_ОбщегоНазначенияВызовСервера.ВерсияДанных(ПараметрыОбработки.НастройкаОператора);
		Если ПараметрыОбработки.ВерсияНастройкиОператора <> НоваяВерсияНастройкиОператора Тогда
			ПараметрыОбработки.МасштабФормы = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(ПараметрыОбработки.НастройкаОператора, "МасштабФормы");
			ПараметрыОбработки.ВерсияНастройкиОператора = НоваяВерсияНастройкиОператора;
		КонецЕсли;
		
		СтандартныйМодуль.ОбработчикОжидания(Результат, ДополнительныеПараметры);
	КонецЕсли;
	
КонецФункции

Функция ДействиеЕстьИзменениеДанных(Действие)

	НоваяВерсияДокументаЗадания = вмс_ОбщегоНазначенияВызовСервера.ВерсияДанных(ПараметрыОбработки.СсылкаНаЗадание);
	Если ПараметрыОбработки.ВерсияДокументаЗадания <> НоваяВерсияДокументаЗадания Тогда
		Возврат УстановитьРезультатДействия(Действие, Истина);
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция НастройкиПолейИзменились()
	
	Задание = ПараметрыОбработки.Задание;
	Если НЕ ЗначениеЗаполнено(Задание.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НовоеЗадание = ПараметрыОбработки.Задание.Ссылка.ПолучитьОбъект();
	НовоеЗадание.Прочитать();
	
	СтруктураНастройкиПолей = ПараметрыОбработки.СтруктураНастройкиПолей;
	НоваяСтруктураНастройкиПолей = НовоеЗадание.СтруктураНастройкиПолей();
	
	ХЗ = Новый ХранилищеЗначения(СтруктураНастройкиПолей);
	НХЗ = Новый ХранилищеЗначения(НоваяСтруктураНастройкиПолей);
	
	XMLСтрока = XMLСтрока(ХЗ);
	НоваяXMLСтрока = XMLСтрока(НХЗ);
	
	НастройкиПолейИзменились = XMLСтрока <> НоваяXMLСтрока;
	
	Возврат НастройкиПолейИзменились;
	
КонецФункции

Функция НастроитьИспользованиеПолейПоИнструкции(Инструкция)
	
	ПустыеДанныеПолей = ДанныеОбработки.ПустыеДанныеПолей;
	ДанныеПолей = ДанныеОбработки.ДанныеПолей;
	
	ПоляПланаМассив = СписокПолейОбработки(Новый Структура("План, Ресурс", Истина, Ложь));
	Для Каждого Поле Из ПоляПланаМассив Цикл
		
		Если Поле="Ячейка" Тогда
			
			ПолеЗаполнено = ЗначениеЗаполнено(ДанныеПолей[Поле]);
			
			Если ПолеЗаполнено Тогда
				ВосстановитьИсходныеСвойстваПолейОбработки("Ячейка, КоличествоОтобрано, Количество0Отобрано, ТипВводаКоличестваОтобрано");
			Иначе
				УстановитьСвойстваПолейОбработки("Ячейка", "Ввод, Вывод", Ложь);
				УстановитьСвойстваПолейОбработки("КоличествоОтобрано, Количество0Отобрано, ТипВводаКоличестваОтобрано", "Сборка, Ввод, Вывод", Ложь);
			КонецЕсли;
			
		ИначеЕсли Поле="ЯчейкаПриемник" Тогда
			
			ПолеЗаполнено = ЗначениеЗаполнено(ДанныеПолей[Поле]);
			
			Если ПолеЗаполнено Тогда
				ВосстановитьИсходныеСвойстваПолейОбработки("ЯчейкаПриемник, КоличествоРазмещено, Количество0Размещено, ТипВводаКоличестваРазмещено");
			Иначе
				УстановитьСвойстваПолейОбработки("ЯчейкаПриемник", "Ввод, Вывод", Ложь);
				УстановитьСвойстваПолейОбработки("КоличествоРазмещено, Количество0Размещено, ТипВводаКоличестваРазмещено", "Сборка, Ввод, Вывод", Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьИнструкциюПоИдентификатору(Идентификатор)
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		ИнструкцияМассив = ДанныеОбработки.Таблицы.ТаблицаПланФакт.НайтиСтроки(Новый Структура("ИдентификаторИнструкцииДляПоиска", Идентификатор));
		Если ИнструкцияМассив.Количество() > 0 Тогда
			Возврат ИнструкцияМассив[0];
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ОпределитьСледующуюИнструкцию()
	
	ИнтерфейсСборщикДанныхТоваров = СборщикДанных("СборщикДанныхТоваров");
	Если ИнтерфейсСборщикДанныхТоваров <> Неопределено Тогда
		НачатьТранзакциюОбработки(ИнтерфейсСборщикДанныхТоваров);
		ИнтерфейсСборщикДанныхТоваров.НачатьТранзакциюСборщика();
		ИдентификаторИнструкцииДляПоиска = ИнтерфейсСборщикДанныхТоваров.Модуль("СборщикДанныхТоваров").ОпределитьСледующуюИнструкцию();
		ИнтерфейсСборщикДанныхТоваров.ОбновитьДанныеТранзакцииОбработки();
		ЗафиксироватьТранзакциюОбработки(ИнтерфейсСборщикДанныхТоваров);
	КонецЕсли;
	
	Возврат ИдентификаторИнструкцииДляПоиска;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////
//
//					Ввод данных+
//

Функция ОбработчикЭтапаВводаДанныхТовара_КонецВвода(Параметры, ДополнительныеПараметры) Экспорт
	
	СборщикДанныхТоваров = СборщикДанных("СборщикДанныхТоваров");
	Если СборщикДанныхТоваров.ПараметрыМодуля.ДанныеСохранены Тогда
		Если ПроверитьВыполнениеПлана() Тогда
			ПредложитьЗавершениеОперации();
		КонецЕсли;
		
		Если ПараметрыОбработки.ПараллельноеФормированиеЗаданийСледующегоЭтапа Тогда
			ЗарегистрироватьНаОбновлениеЗаданияКладовщиковПоПравилуЗаполненияСледующегоЭтапа();
		КонецЕсли;
	КонецЕсли;

КонецФункции

Функция ЗарегистрироватьНаОбновлениеЗаданияКладовщиковПоПравилуЗаполненияСледующегоЭтапа()
	вмс_ФормированиеЗаданийКладовщикам.ЗарегистрироватьНаОбновлениеЗаданияКладовщиковПоПравилуЗаполнения(ПараметрыОбработки.СледующееПравилоЗаполнения, ПараметрыОбработки.ДокументОснование);
КонецФункции

Функция ДействиеВыборЭлементаТаблицы(Действие)
	
	ИмяТаблицы = Действие.Параметры.ИмяТаблицы;
	
	ЭлементТаблицы = ПолучитьЭлементТаблицыПоИдентификатору(ИмяТаблицы, Действие.Параметры.ИдентификаторЭлемента);
	
	СборщикиДанных = СборщикиДанныхСтраницыОперации("ВводДанных");
	Если ИмяТаблицы="ТаблицаПланФакт" Тогда

		Инструкция = ПолучитьИнструкциюПоИдентификатору(ЭлементТаблицы.ИдентификаторИнструкцииДляПоиска);
		Если Инструкция <> Неопределено Тогда
			ПараметрыТаблицы = ПараметрыТаблицы(ИмяТаблицы);
			ОчиститьДанныеПолей(, , СборщикиДанных);
			УстановитьЗначениеДанныхПоляОбработки("ИдентификаторИнструкцииДляПоиска", Инструкция.ИдентификаторИнструкцииДляПоиска);
			
			//в таблице план-факт идентификатор инструкции совпадает с идентификатором элемента
			ПараметрыТаблицы.ИдентификаторТекущегоЭлемента = Инструкция.ИдентификаторИнструкцииДляПоиска;
			ПараметрыТаблицы.ИдентификаторТекущегоЭлементаНаКлиенте = Инструкция.ИдентификаторИнструкцииДляПоиска;

			//в таблице факт идентификатор инструкции НЕ совпадает с идентификатором элемента, дополнительно получим его
			ЭлементФактаМассив = ДанныеОбработки.Таблицы.ТаблицаФакт.НайтиСтроки(Новый Структура("ИдентификаторИнструкцииДляПоиска", Инструкция.ИдентификаторИнструкцииДляПоиска));
			Если ЭлементФактаМассив.Количество() > 0 Тогда
				ИдентификаторЭлемента = СтандартныйМодуль.ДополнительныеДанныеЭлементаТаблицы("ТаблицаФакт", ЭлементФактаМассив[0]).Идентификатор;
				СтандартныйМодуль.УстановитьТекущийЭлементТаблицы("ТаблицаФакт", ИдентификаторЭлемента);
			КонецЕсли;
			
			ЗаполнитьДанныеПолей(СборщикиДанных);
			ПереключитьСтраницу("ВводДанных");
		КонецЕсли;
		
	ИначеЕсли ИмяТаблицы="ТаблицаФакт" Тогда
		
		Таблица = ДанныеОбработки.Таблицы[ИмяТаблицы];
		ВосстановитьИсходныеСвойстваПолейОбработки();
		ОсновныеПоляСборкиМассив = СписокПолейОбработки(Новый Структура("Сборка, Ресурс", Истина, Ложь));
		ОсновныеПоляСборки = РК.МассивВСтроку(ОсновныеПоляСборкиМассив);
		КолонкиКоллекции = РК.ПолучитьКолонкиКоллекции(Таблица);
		ПоляСборки = РК.ПересечениеМассивов(КолонкиКоллекции, ОсновныеПоляСборкиМассив);
		Если ПоляСборки.Количество() > 0 Тогда
			
			Инструкция = ПолучитьИнструкциюПоИдентификатору(ЭлементТаблицы.ИдентификаторИнструкцииДляПоиска);
			
			Если Инструкция <> Неопределено Тогда
				ПараметрыТаблицы = ПараметрыТаблицы(ИмяТаблицы);
				
				ИдентификаторЭлемента = СтандартныйМодуль.ДополнительныеДанныеЭлементаТаблицы(ПараметрыТаблицы, ЭлементТаблицы).Идентификатор;
				ПараметрыТаблицы.ИдентификаторТекущегоЭлемента = ИдентификаторЭлемента;
				ПараметрыТаблицы.ИдентификаторТекущегоЭлементаНаКлиенте = ИдентификаторЭлемента;
				
				ОчиститьДанныеПолей(, , СборщикиДанных);
				ЗаполнитьЗначенияСвойств(ДанныеОбработки.ВведенныеДанныеПолей, ЭлементТаблицы);
				УстановитьЗначениеДанныхПоляОбработки("ИдентификаторИнструкцииДляПоиска", Инструкция.ИдентификаторИнструкцииДляПоиска);
				СтандартныйМодуль.УстановитьТекущийЭлементТаблицы("ТаблицаПланФакт", Инструкция.ИдентификаторИнструкцииДляПоиска);
				ЗаполнитьДанныеПолей(СборщикиДанных);
				ПереключитьСтраницу("ВводДанных");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ДействиеПриСменеСтраницы(Действие)
	
	Если ДействиеВыполняетсяПосле(Действие) Тогда
		ТаблицыСтраницы = Новый Массив;
		ТаблицыСтраницы.Добавить(Новый Структура("Таблица, Страница", "ТаблицаПланФакт", "ГлавнаяПанельСтраницаПланФакт"));
		ТаблицыСтраницы.Добавить(Новый Структура("Таблица, Страница", "ТаблицаФакт", "ГлавнаяПанельСтраницаФакт"));
		
		Для Каждого ТаблицаСтраница Из ТаблицыСтраницы Цикл
			Если НЕ ДанныеОбработки.Таблицы.Свойство(ТаблицаСтраница.Таблица) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеОбновленияТаблицыПланФакт = ПараметрыТаблицы(ТаблицаСтраница.Таблица);
			ДополнительныеДанныеЭлементов = ДанныеОбновленияТаблицыПланФакт.ДополнительныеДанныеЭлементов;
			Если ДополнительныеДанныеЭлементов.Количество() > 0 Тогда
				Если ПараметрыОбработки.РабочаяСтраница=ТаблицаСтраница.Страница Тогда
					//очистить клиентский идентификатор чтобы он повторно обновился по серверному идентификатору
					ДанныеОбновленияТаблицыПланФакт.ИдентификаторТекущегоЭлементаНаКлиенте = 0;
				Иначе
					//чтобы список промотался до нужного элемента после перехода на страницу со списком
					ДанныеОбновленияТаблицыПланФакт.СброситьТекущийЭлемент = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция СборщикиДанныхСтраницыОперации(ИмяСтраницы)
	
	ПрефиксСтраницОперации = Обработки.вмс_СерверУправляемыйМодульОперацияПоЯчейкамУниверсальная.ПрефиксСтраницОперации();

	ЭлементыСборщиковСтраницы = ПараметрыОбработки.СтруктураНастройкиПолей.НастройкаСтраниц.НайтиСтроки(Новый Структура("Имя", ПрефиксСтраницОперации + ИмяСтраницы));
	Сборщики = РК.ВыгрузитьЗначенияКолонкиКоллекции(ЭлементыСборщиковСтраницы, "СборщикДанных");
	Возврат Сборщики;
	
КонецФункции


Функция ПроверитьВыполнениеПлана()
	
	Если НЕ ПараметрыОбработки.ЕстьПлан Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаПланФакт = ДанныеОбработки.Таблицы.ТаблицаПланФакт;
	
	Возврат ТаблицаПланФакт.НайтиСтроки(Новый Структура("Выполнен", Ложь)).Количество()=0;
	
КонецФункции

Функция ПредложитьЗавершениеОперации()
	
	ПереключитьСтраницу("ПланФакт");
	
	ПоказатьДиалогНаКлиенте("ОбработчикОтветаНаВопросЗавершитьОперацию", "Задание выполнено. Завершить операцию?", "ДаНет", , , , "Завершение");
	
КонецФункции

//
//					Ввод данных-
//
//////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////
//
//					Сохранение данных в базу+
//

Функция ДействиеПолучитьДокументОперацииПоЯчейкам(Действие)

	ОперацияПоЯчейкам = ПараметрыОбработки.ОперацияПоЯчейкам;
	СсылкаОперацииПоЯчейкам = ДанныеОбработки.СсылкаОперацииПоЯчейкам;
	
	Если ЗначениеЗаполнено(СсылкаОперацииПоЯчейкам) Тогда
		
		НоваяВерсияДанных = вмс_ОбщегоНазначенияВызовСервера.ВерсияДанных(СсылкаОперацииПоЯчейкам);
		
		Если НоваяВерсияДанных <> "" Тогда
			Если ОперацияПоЯчейкам=Неопределено Тогда
				ОперацияПоЯчейкам = СсылкаОперацииПоЯчейкам.ПолучитьОбъект();
				ПараметрыОбработки.ОперацияПоЯчейкам = ОперацияПоЯчейкам;
			КонецЕсли;
			ВерсияДанных = ОперацияПоЯчейкам.ВерсияДанных;
		Иначе
			Если ОперацияПоЯчейкам=Неопределено Тогда
				ВерсияДанных = "";
			Иначе
				ВерсияДанных = ОперацияПоЯчейкам.ВерсияДанных;
			КонецЕсли;
		КонецЕсли;

		Если ВерсияДанных <> НоваяВерсияДанных Тогда
			
			Если НоваяВерсияДанных <> "" Тогда
				
				ОперацияПоЯчейкам.Прочитать();
				Если ОперацияПоЯчейкам.ПометкаУдаления Тогда
					//документ помечен на удаление
					ОперацияПоЯчейкам = Неопределено;
					ПараметрыОбработки.ОперацияПоЯчейкам = ОперацияПоЯчейкам;
				КонецЕсли;
				
			Иначе
				
				//документ удален
				ОперацияПоЯчейкам = Неопределено;
				ПараметрыОбработки.ОперацияПоЯчейкам = ОперацияПоЯчейкам;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОперацияПоЯчейкам=Неопределено И Действие.Параметры.Создавать Тогда
		
		ОперацияПоЯчейкам = НовыйДокументОперацииПоЯчейкам();
		ПараметрыОбработки.ОперацияПоЯчейкам = ОперацияПоЯчейкам;
		
	КонецЕсли;
	
	Возврат УстановитьРезультатДействия(Действие, ОперацияПоЯчейкам);

КонецФункции

Функция ДействиеЗаписатьДокументОперацииПоЯчейкам(Действие)
	
	ОперацияПоЯчейкам = Действие.Параметры.ОперацияПоЯчейкам;
	
	ОперацияПоЯчейкам.ВремяОкончанияОперации = ТекущаяДатаСеанса();
	
	Отказ = Ложь;
	СтандартныйМодуль.НачатьСборСообщений();
	Попытка
		ОперацияПоЯчейкам.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Отказ = Истина;
	КонецПопытки;
	СтандартныйМодуль.ЗакончитьСборСообщений();
	
	Если Отказ Тогда
		СобранныеСообщения = СтандартныйМодуль.СобранныеСообщения();
		Если СобранныеСообщения.Количество()=0 Тогда
			СобранныеСообщения.Добавить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		Иначе
			УбратьНомераСтрокИзСообщений();
		КонецЕсли;
		СтандартныйМодуль.ОтправитьСобранныеСообщенияВОшибкуДействия();
		ПараметрыОбработки.ОперацияПоЯчейкам = Неопределено;
	Иначе
		СтандартныйМодуль.УдалитьСобранныеСообщения();
		ДанныеОбработки.СсылкаОперацииПоЯчейкам = ОперацияПоЯчейкам.Ссылка;
	КонецЕсли;
	
	Возврат УстановитьРезультатДействия(Действие, НЕ Отказ);
	
КонецФункции

Функция УбратьНомераСтрокИзСообщений()
	
	Сообщения = СтандартныйМодуль.СобранныеСообщения();
	Для НомерСообщения=0 По Сообщения.ВГраница() Цикл
		Сообщение = Сообщения[НомерСообщения];
		Если СтрНайти(нрег(Сообщение), "номер строки ") <> 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Позиция = СтрНайти(Сообщение, ": ");
		Если Позиция=0 Тогда
			Продолжить;
		КонецЕсли;
		
		Сообщение = Прав(Сообщение, СтрДлина(Сообщение) - Позиция - 1);
		Сообщения[НомерСообщения] = Сообщение;
	КонецЦикла;
	
КонецФункции

Функция ДействиеНовыйДокументОперацииПоЯчейкам(Действие)
	
	ОперацияПоЯчейкам = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
	ОперацияПоЯчейкам.Дата = ТекущаяДатаСеанса();
	ОперацияПоЯчейкам.ВремяНачалаОперации = ОперацияПоЯчейкам.Дата;
	ОперацияПоЯчейкам.ДокументОснование = ПараметрыОбработки.ДокументОснование;
	ОперацияПоЯчейкам.ЗаданиеКладовщику = ПараметрыОбработки.СсылкаНаЗадание;
	ОперацияПоЯчейкам.ВидОперации = ПараметрыОбработки.ВидОперации;
	ОперацияПоЯчейкам.Версия = 2;
	ОперацияПоЯчейкам.Ответственный = ПараметрыОбработки.Ответственный;
	
	Возврат УстановитьРезультатДействия(Действие, ОперацияПоЯчейкам);

КонецФункции

//
//					Сохранение данных в базу-
//
//////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////
//
//					Завершение операции+
//

Функция ЗавершитьОперацию()
	
	Если ВвестиДанныеПередЗавершениемОперации() Тогда
		//начат ввод данных
		Возврат Ложь;
	КонецЕсли;
	
	//ввод данных не требуется, завершаем операцию
	Возврат ЗавершитьОперациюПослеВводаДанных();
	
КонецФункции

Функция ЗавершитьОперациюПослеВводаДанных()
	
	НачатьТранзакцию();
	
	Если НЕ ВыполнитьЗавершениеОперации() Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	ЗавершитьРаботуОбработки();
	Возврат Истина;
	
КонецФункции

Функция ДействиеВыполнитьЗавершениеОперации(Действие)
	
	Для Каждого СборщикДанных Из СборщикиДанных() Цикл
		Если НЕ СборщикДанных.ВыполнитьЗавершениеОперации() Тогда
			Возврат УстановитьРезультатДействия(Действие, Ложь);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ УстановитьПризнакГотовОперацииПоЯчейкам() Тогда
		Возврат УстановитьРезультатДействия(Действие, Ложь);
	КонецЕсли;

	вмс_ОперацииПоЯчейкамВызовСервера.ЗавершитьОперациюПоДокументу(ПараметрыОбработки.СсылкаНаЗадание, ПараметрыОбработки.ВидОперации, ПараметрыОбработки.Ответственный, , ДанныеОбработки.СсылкаОперацииПоЯчейкам);
	Если ПараметрыОбработки.ЕстьОХР И ЗначениеЗаполнено(ПараметрыОбработки.ДокументОснование) Тогда
		Документы.ОХР_РегистрацияОпераций.ЗаписатьПоОперацииПоЯчейкамПоОснованию(ПараметрыОбработки.ДокументОснование, ПараметрыОбработки.ВидОперации, ПараметрыОбработки.Ответственный);
	КонецЕсли;
	
	Возврат УстановитьРезультатДействия(Действие, Истина);
	
КонецФункции

Функция УстановитьПризнакГотовОперацииПоЯчейкам()
	
	ОперацияПоЯчейкам = ПолучитьДокументОперацииПоЯчейкам();
	ОперацияПоЯчейкам.Готов = Истина;
	Возврат ЗаписатьДокументОперацииПоЯчейкам(ОперацияПоЯчейкам);
	
КонецФункции

Процедура ОбработчикОтветаНаВопросЗавершитьОперацию(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ="Да" Тогда
		ЗавершитьОперацию();
	КонецЕсли;
	
КонецПроцедуры

Функция ВвестиДанныеПередЗавершениемОперации()
	
	СборщикДанныхЗавершение = СборщикДанных("СборщикДанныхЗавершение"); 
	Если СборщикДанныхЗавершение=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СборщикДанныхЗавершение.НачатьВыборСледующегоПоля();
	
КонецФункции

Функция ОбработчикЭтапаВводаДанныхПередЗавершениемОперации(Параметры, ДополнительныеПараметры) Экспорт
	
	СборщикДанныхЗавершение = СборщикДанных("СборщикДанныхЗавершение"); 
	
	Если СборщикДанныхЗавершение.ДанныеТранзакции.РезультатАнализаЗаполненияПолейДанныхВвода.ВсеПоляЗаполнены Тогда
		ДанныеОбработки.ВводДанныхПередЗавершениемОперацииЗавершен = Истина;
	КонецЕсли;
	
КонецФункции

Функция ДействиеПередЗакрытиемФормыОбработки(Действие)
	
	ПоказатьДиалогНаКлиенте("ОбработчикОтветаНаВопросЗакрытьФорму", "Закрыть?", "OKОтмена");

	Ответ = Действие.Параметры;
	Ответ.Отказ = Истина;
	УстановитьРезультатДействия(Действие, Ответ);
	
КонецФункции

Процедура ОбработчикОтветаНаВопросЗакрытьФорму(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ="OK" Тогда
		
		ЗавершитьРаботуОбработки();
		
	КонецЕсли;
	
КонецПроцедуры

//
//					Завершение операции-
//
//////////////////////////////////////////////////////////////////////////////////

Функция ДействиеСохранитьСостояниеОбработки(Действие)
	
КонецФункции

Функция ДействиеВосстановитьСостояниеОбработки(Действие)
	
КонецФункции













//////////////////////////////////////////////////////////////////////////////////
//
//					Объявления функций+
//

#Область ОбъявленияФункций

Функция ПолучитьФормуОбработки()
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ПолучениеФормыОбработки"));
	
КонецФункции

Функция ОткрытьФормуОбработки(ИмяФормы)

	ДобавитьДействиеНаКлиенте("ОткрытьФормуОбработки", Новый Структура("ИмяФормы", ИмяФормы));
	
КонецФункции

Функция НачатьТранзакциюОбработки(СборщикиДанных=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("НачатьТранзакциюОбработки", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

Функция ЗафиксироватьТранзакциюОбработки(СборщикиДанных=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗафиксироватьТранзакциюОбработки", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, знач Модуль=Неопределено, ДополнительныеПараметры=Неопределено, ИмяПроцедурыОбработкиОшибки=Неопределено, МодульОбработкиОшибки=Неопределено)
	
	Если Модуль=Неопределено Тогда
		Модуль = ЭтотОбъект;
	КонецЕсли;
	
	Возврат вмс_СерверУправляемыеОбработки.НовыйОписаниеОповещения(ИмяПроцедуры, ПараметрыОбработки, Модуль, ДополнительныеПараметры, ИмяПроцедурыОбработкиОшибки, МодульОбработкиОшибки);
	
КонецФункции

Функция ПереключитьСтраницу(ИмяСтраницы)

	Возврат СтандартныйМодуль.ПереключитьСтраницу(ИмяСтраницы);

КонецФункции

Функция ДобавитьДействиеНаКлиенте(КодДействие, знач ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ДобавитьДействиеНаКлиенте(ПараметрыОбработки, КодДействие, ПараметрыДействия);

КонецФункции

Функция ДобавитьТаймер(ИД, Интервал_мс, знач ОписаниеОповещения=Неопределено, ВремяЗаморозки=0)
	
	Если ОписаниеОповещения=Неопределено Тогда
		//обработчик на основании имени таймера
		ОписаниеОповещения = НовыйОписаниеОповещения(ИД);
	КонецЕсли;

	Возврат СтандартныйМодуль.ДобавитьТаймер(ИД, Интервал_мс, ОписаниеОповещения, ВремяЗаморозки);
	
КонецФункции

Функция Действие(Код, ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.Действие(Код, ПараметрыДействия, ПараметрыОбработки.Идентификатор, ПараметрыОбработки, ЭтотОбъект);
	
КонецФункции

Функция ДействиеВыполняетсяПосле(Действие)
	
	Возврат вмс_СерверУправляемыеОбработки.ДействиеВыполняетсяПосле(Действие);
	
КонецФункции

Функция УстановитьРезультатДействия(Действие, Результат=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, Результат);
	
КонецФункции

Функция ВвестиДанные(ВходящиеДанные)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ВвестиДанные", Новый Структура("ВходящиеДанные", ВходящиеДанные)));
	
КонецФункции

Функция ВвестиДанныеПоля(ИмяПоля, ЗначениеПоля)
	
	Возврат СтандартныйМодуль.ВвестиДанныеПоля(ИмяПоля, ЗначениеПоля);
	
КонецФункции

Функция НовыеВходящиеДанные(Данные=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.НовыеВходящиеДанные(Данные);
	
КонецФункции

Функция ДобавитьЭтапВводаДанных(ОписаниеОбработчика, Группа, Место=Неопределено, Параметр=Неопределено, Имя=Неопределено)

	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ДобавитьЭтапВводаДанных", Новый Структура("ОписаниеОбработчика, Группа, Место, Параметр, Имя", ОписаниеОбработчика, Группа, Место, Параметр, Имя)));
	
КонецФункции

Функция ПолучитьЭлементТаблицыПоИдентификатору(ИмяТаблицы, ИдентификаторЭлемента)
	
	Возврат СтандартныйМодуль.ПолучитьЭлементТаблицыПоИдентификатору(ИмяТаблицы, ИдентификаторЭлемента);
	
КонецФункции

Функция ОбновитьСостояниеКлиента()
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ОбновитьСостояниеКлиента"));
	
КонецФункции

Функция ПараметрыТаблицы(ИмяТаблицы)
	
	Возврат СтандартныйМодуль.ПараметрыТаблицы(ИмяТаблицы);
	
КонецФункции

Функция УстановитьВидимостьТаблицыОбработки(ИмяТаблицы, Видимость)
	
	Возврат СтандартныйМодуль.УстановитьВидимостьТаблицыОбработки(ИмяТаблицы, Видимость);
	
КонецФункции

Функция ЗаполнитьТаблицы()

	Возврат СтандартныйМодуль.ЗаполнитьТаблицы();
	
КонецФункции

Функция ЗаполнитьДанныеПолей(СборщикиДанных=Неопределено)

	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗаполнитьДанныеПолей", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

Функция ОчиститьДанныеПолей(Поля=Неопределено, ИмяДанных=Неопределено, СборщикиДанных=Неопределено)
	
	Возврат СтандартныйМодуль.ОчиститьДанныеПолей(Поля, ИмяДанных, СборщикиДанных);
	
КонецФункции

#Область РаботаСДокументомОперацияПоЯчейкам
Функция ЗаписатьДокументОперацииПоЯчейкам(ОперацияПоЯчейкам)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗаписатьДокументОперацииПоЯчейкам", Новый Структура("ОперацияПоЯчейкам", ОперацияПоЯчейкам)));
	
КонецФункции

Функция ПолучитьДокументОперацииПоЯчейкам(Создавать=Истина)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ПолучитьДокументОперацииПоЯчейкам", Новый Структура("Создавать", Создавать)));
	
КонецФункции

Функция НовыйДокументОперацииПоЯчейкам()
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("НовыйДокументОперацииПоЯчейкам"));
	
КонецФункции
#КонецОбласти
Функция ЗавершитьРаботуОбработки()
	
	вмс_СерверУправляемыеОбработки.ЗавершитьРаботуОбработки(ПараметрыОбработки);
	
КонецФункции

Функция ВыполнитьЗавершениеОперации()

	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ВыполнитьЗавершениеОперации"));
	
КонецФункции

/////////////////////////////////////////////////////////////////////////
//
//				Поля обработки+
//

Функция УстановитьОбработчикиСобытийПолейОбработки(Поля=Неопределено, События)
	
	Возврат СтандартныйМодуль.УстановитьОбработчикиСобытийПолейОбработки(Поля, События);
	
КонецФункции

Функция ВосстановитьИсходныеСвойстваПолейОбработки(Поля=Неопределено)

	Возврат СтандартныйМодуль.ВосстановитьИсходныеСвойстваПолейОбработки(Поля);
	
КонецФункции

//возвращает всю таблицу полей или массив полей по отбору
Функция ПоляОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(ПараметрыОбработки, Отбор);

КонецФункции

Функция ПолеОбработки(Отбор)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

//возвращает поля с указанными именами, если поля нет, то создает новое
Функция ПолучитьПоляОбработки(Поля=Неопределено)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьПоляОбработки(ПараметрыОбработки, Поля);

КонецФункции

Функция УстановитьСвойстваПолейОбработки(Поля=Неопределено, Свойства=Неопределено, Значение=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьСвойстваПолейОбработки(ПараметрыОбработки, Поля, Свойства, Значение);
	
КонецФункции

Функция ПолучитьЗначениеСвойстваПоляОбработки(Поле, ИмяСвойства)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеСвойстваПоляОбработки(ПараметрыОбработки, Поле, ИмяСвойства);
	
КонецФункции

Функция УстановитьПоляВводаОбработки(Поля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьПоляВводаОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция УстановитьПоляВыводаОбработки(Поля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьПоляВыводаОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция СписокПолейВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВвода(ПараметрыОбработки);
	
КонецФункции

Функция ПоляВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВвода(ПараметрыОбработки);
	
КонецФункции

Функция СписокПолейВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВывода(ПараметрыОбработки);
	
КонецФункции

Функция ПоляВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВывода(ПараметрыОбработки);
	
КонецФункции

Функция СписокПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ТаблицаПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ТаблицаПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ПолучитьЗначениеДанныхПоляОбработки(Поле, ИмяСвойства)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеДанныхПоляОбработки(ПараметрыОбработки, Поле, ИмяСвойства);
	
КонецФункции

Функция УстановитьЗначениеДанныхПоляОбработки(Поле, Значение)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьЗначениеДанныхПоляОбработки(ПараметрыОбработки, Поле, Значение);
	
КонецФункции

Функция ПрочитатьПутиКДаннымПолей(ПолеПути, Поля=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПрочитатьПутиКДаннымПолей(ПараметрыОбработки, ПолеПути, Поля);
	
КонецФункции

Функция ЗаписатьПутиКДаннымПолей(ПолеПути, ТаблицаПутейКДаннымПолей)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ЗаписатьПутиКДаннымПолей(ПараметрыОбработки, ПолеПути, ТаблицаПутейКДаннымПолей);
	
КонецФункции

//
//				Поля обработки-
//
/////////////////////////////////////////////////////////////////////////

Функция СборщикиДанных(Отбор=Неопределено) Экспорт
	
	Возврат СтандартныйМодуль.СборщикиДанных(Отбор);
	
КонецФункции

Функция СборщикДанных(Отбор) Экспорт
	
	Возврат СтандартныйМодуль.СборщикДанных(Отбор);
	
КонецФункции

Функция УстановитьОбработчикиСобытийЭлементовВывода(Элементы, События)
	
	Возврат СтандартныйМодуль.УстановитьОбработчикиСобытийЭлементовВывода(Элементы, События);
	
КонецФункции

Функция УстановитьСвойстваЭлементовВывода(Элементы, Свойства=Неопределено, ЗначениеСвойства=Неопределено)
	
	Возврат СтандартныйМодуль.УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства);
	
КонецФункции

Функция ПолучитьЭлементВывода(Имя)
	
	Возврат СтандартныйМодуль.ПолучитьЭлементВывода(Имя);
	
КонецФункции

Функция ПолучитьЭлементВыводаДляПоляОбработки(ЭлементВывода, ПолеДанныхЭлемента=Неопределено)
	
	Возврат СтандартныйМодуль.ПолучитьЭлементВыводаДляПоляОбработки(ЭлементВывода, ПолеДанныхЭлемента);
	
КонецФункции

Функция ЭлементВывода(ОтборЭлемента)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ЭлементВывода(ПараметрыОбработки, ОтборЭлемента);
	
КонецФункции

Функция ЭлементыВывода(ОтборЭлементов)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ЭлементыВывода(ПараметрыОбработки, ОтборЭлементов);
	
КонецФункции

Функция ПоказатьДиалогНаКлиенте(знач ОписаниеОповещения=Неопределено, Текст, знач Кнопки=Неопределено, знач Таймаут=Неопределено, КнопкаПоУмолчанию=Неопределено, Заголовок=Неопределено, ИмяЗвука="Сигнал")
	
	Если ТипЗнч(ОписаниеОповещения)=Тип("Строка") Тогда
		ОписаниеОповещения = НовыйОписаниеОповещения(ОписаниеОповещения);
	КонецЕсли;
	
	Возврат СтандартныйМодуль.ПоказатьДиалогНаКлиенте(ОписаниеОповещения, Текст, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, ИмяЗвука);
	
КонецФункции
#КонецОбласти

//
//					Объявления функций-
//
//////////////////////////////////////////////////////////////////////////////////

РК = вмс_РаботаСКоллекциями;
#КонецЕсли