
&НаКлиенте
Процедура ТоварыТипТарыПриИзменении(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
	ЭтотОбъект);	
	
	ПоказатьВопрос(Оповещение,
	"Заполнить операции по выбранной таре",
	РежимДиалогаВопрос.ДаНет,
	0, КодВозвратаДиалога.Да
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Владелец = Элементы.Товары.ТекущиеДанные.ТипТары;
	КонецЕсли;
	ЗаполнитьНаСервере(Владелец);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНаСервере (Владелец)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец",Владелец);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипыКонтейнеровОперацииОтветственногоХранения.Операция КАК Операция
	|ИЗ
	|	ПланВидовХарактеристик.ТипыКонтейнеров.ОперацииОтветственногоХранения КАК ТипыКонтейнеровОперацииОтветственногоХранения
	|ГДЕ
	|	ТипыКонтейнеровОперацииОтветственногоХранения.Ссылка = &Владелец"; 
	
	РезультатЗапроса= Запрос.Выполнить().Выгрузить();
	
	МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("ТипТары",Владелец)); 
	
	Если ЗначениеЗаполнено(РезультатЗапроса) тогда
		//Если РезультатЗапроса.Количество()>= МассивСтрок.Количество() Тогда 
		Индекс = 0;
		Для Каждого Строка из МассивСтрок Цикл
			Строка.Операция = РезультатЗапроса.Получить(Индекс).Операция;
			Индекс = Индекс+1;
		КонецЦикла;
		Если РезультатЗапроса.Количество()> Индекс Тогда
			Для Индекс = Индекс по РезультатЗапроса.Количество()-1 Цикл
				Строка = Объект.Товары.Добавить();
				Строка.Операция = РезультатЗапроса.Получить(Индекс).Операция;
				Строка.ТипТары = Владелец;
			КонецЦикла;
		КонецЕсли;
		//Иначе
		
		//КонецЕсли;
		
	КонецЕсли;
	
	
КонецФункции

&НаКлиенте
Процедура Подбор(Команда) 
	
	Оповещение = Новый ОписаниеОповещения("ПодборПродолжение",ЭтотОбъект);	
	ПоказатьВопрос(Оповещение,"Табличная часть будет очищена. Продолжить?",
	РежимДиалогаВопрос.ДаНетОтмена,0, КодВозвратаДиалога.Да);	
	
КонецПроцедуры  

&НаКлиенте
Функция ПодборПродолжение(Результат,ДополнительныеПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		
		ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Истина, Истина);
		ОткрытьФорму("ПланВидовХарактеристик.ТипыКонтейнеров.ФормаВыбора", ПараметрыПодбора,ЭтаФорма);
	КонецЕсли;
КонецФункции // ПодборПродолжение()


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПодбор",ЭтотОбъект, Новый Структура("Значения", ВыбранноеЗначение));	
	ПоказатьВопрос(Оповещение,"Заполнить операции услуг хранения по выбранным типам контейнеров?",
	РежимДиалогаВопрос.ДаНетОтмена,0, КодВозвратаДиалога.Да); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияВопросаПодбор(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьТовары(Результат = КодВозвратаДиалога.Да, Параметры.Значения);
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТовары(ПризнакЗаполнения, Значения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипыКонтейнеровОперацииОтветственногоХранения.Операция КАК Операция,
	|	ТипыКонтейнеровОперацииОтветственногоХранения.Ссылка КАК ТипТары
	|ИЗ
	|	ПланВидовХарактеристик.ТипыКонтейнеров.ОперацииОтветственногоХранения КАК ТипыКонтейнеровОперацииОтветственногоХранения
	|ГДЕ
	|	ТипыКонтейнеровОперацииОтветственногоХранения.Ссылка В(&Владелец)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Владелец", Значения); 
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	
	Если ПризнакЗаполнения тогда
		Объект.Товары.Загрузить(ТаблицаЗапроса);
	Иначе 
		ТаблицаЗапроса.Свернуть ("ТипТары");
		Для Каждого Запись Из ТаблицаЗапроса Цикл
		Объект.Товары.Загрузить(ТаблицаЗапроса);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции
