
#Область Команды

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ПредупреждениеАсинх(ПроверитьПодключениеНаСервере());   
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоклажедателя(Команда) 
	
	НезаполненныеСтроки = Ложь;
	
	Если Объект.ТабПоклажедатель.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поклажедатели не заполнены";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	МассивДляРегистрацииПоклажедателей = Новый Массив;
		
	Для каждого СтрокаТЧ Из Объект.ТабПоклажедатель Цикл
		Если (НЕ ЗначениеЗаполнено(СтрокаТЧ.Контрагент)) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.Представитель) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("В строке %1 не заполнен контрагент или пользователь", СтрокаТЧ.НомерСтроки);
			Сообщение.Сообщить();	
			
			НезаполненныеСтроки = Истина; 
			
			Продолжить;
		КонецЕсли;
		
		ОтправленныеДанные = Новый Структура;
		ОтправленныеДанные.Вставить("Контрагент", СтрокаТЧ.Контрагент);
		ОтправленныеДанные.Вставить("Представитель", СтрокаТЧ.Представитель);   
		
		МассивДляРегистрацииПоклажедателей.Добавить(ОтправленныеДанные);
	КонецЦикла;          
	
	Если НезаполненныеСтроки Тогда
		Возврат;	
	Иначе      
		ОтправитьПоклажедателяНаСервере(МассивДляРегистрацииПоклажедателей);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСклады(Команда)
	
	НезаполненныеСтроки = Ложь;
	
	Если Объект.ТабСклады.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Склады не заполнены";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	МассивСкладов = Новый Массив;
	
	Для каждого СтрокаТЧ Из Объект.ТабСклады Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Склад) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("В строке %1 не заполнен склад", СтрокаТЧ.НомерСтроки);
			Сообщение.Сообщить();	
			
			НезаполненныеСтроки = Истина;  
			
			Продолжить;
		КонецЕсли;                    
		
		МассивСкладов.Добавить(СтрокаТЧ.Склад);
	КонецЦикла;  
	
	Если НезаполненныеСтроки Тогда
		Возврат;	
	Иначе      
		ОтправитьСкладыНаСервере(МассивСкладов); 
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурнал(Команда)

	Отбор = Новый Структура("Пользователь, СобытиеЖурналаРегистрации, ДатаНачала, ДатаОкончания, Данные, Сеанс, Уровень");
	Отбор.СобытиеЖурналаРегистрации = "Личный кабинет: уведомление";
		
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(Отбор, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОстаткиПоКарточкам(Команда)
	
	ОтправитьОстаткиПоКарточкамНаСервере();   
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКарточки(Команда)
	
	ПолучитьКарточкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДокументы(Команда)
	
	ПолучитьДокументыНаСервере();    
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПоклажедателя(Команда)
	
	НезаполненныеСтроки = Ложь;
	
	Если Объект.ТабПоклажедатель.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поклажедатели не заполнены";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	МассивДляРедактированияПоклажедателей = Новый Массив;
		
	Для каждого СтрокаТЧ Из Объект.ТабПоклажедатель Цикл
		Если (НЕ ЗначениеЗаполнено(СтрокаТЧ.Контрагент)) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.Представитель) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("В строке %1 не заполнен контрагент или пользователь", СтрокаТЧ.НомерСтроки);
			Сообщение.Сообщить();	
			
			НезаполненныеСтроки = Истина; 
			
			Продолжить;
		КонецЕсли;
		
		ОтправленныеДанные = Новый Структура;
		ОтправленныеДанные.Вставить("Контрагент", СтрокаТЧ.Контрагент);
		ОтправленныеДанные.Вставить("Представитель", СтрокаТЧ.Представитель);   
		
		МассивДляРедактированияПоклажедателей.Добавить(ОтправленныеДанные);
	КонецЦикла;          
	
	Если НезаполненныеСтроки Тогда
		Возврат;	
	Иначе      
		РедактироватьПоклажедателяНаСервере(МассивДляРедактированияПоклажедателей);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументыПоФайлу(Команда)
	ЗаполнитьДокументыПоФайлуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Прочее
               
&НаСервере
Функция ПроверитьПодключениеНаСервере()
	
	Возврат вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПроверитьПодключениеСервер(); 
	
КонецФункции

#КонецОбласти

#Область Работа_со_справочниками

&НаСервере
Процедура ОтправитьСкладыНаСервере(ОтправленныеДанные)

	вмс_ЛичныйКабинетПоклажедателяВызовСервер.ОтправитьСклады(ОтправленныеДанные);
	
КонецПроцедуры
	
&НаСервере
Процедура РедактироватьПоклажедателяНаСервере(ОтправленныеДанные)

	вмс_ЛичныйКабинетПоклажедателяВызовСервер.РедактироватьПоклажедателяВЛК(ОтправленныеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область Пользователи

&НаСервере
Процедура ОтправитьПоклажедателяНаСервере(ОтправленныеДанные)
	
	вмс_ЛичныйКабинетПоклажедателяВызовСервер.ОтправитьПоклажедателяНаСервере(ОтправленныеДанные);
	
КонецПроцедуры   

&НаСервере
Функция ВыгрузитьКонтрагентовНаСервере()
	
	Возврат вмс_ЛичныйКабинетПоклажедателяВызовСервер.ВыгрузитьКонтрагентовНаСервере();
	
КонецФункции

&НаСервере
Функция КонтрагентПредставителя(ТД_Представитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Контрагент КАК Контрагент
	|ИЗ
	|	Справочник.вмс_Поклажедатели КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТД_Представитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();  
	Выборка.Следующий();
	
	Возврат Выборка.Контрагент;
	
КонецФункции

&НаКлиенте
Процедура ТабПоклажедательКонтрагентПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТабПоклажедатель.ТекущиеДанные;   	
	ТекДанные.Представитель = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабПоклажедательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ТабПоклажедатель.ТекущиеДанные;   
	ТД_Представитель = ТекДанные.Представитель; 
	ТД_Контрагент = ТекДанные.Контрагент; 
	
	Если ЗначениеЗаполнено(ТД_Контрагент) Тогда
		ЗначениеОтбора = Новый Структура("Контрагент", ТД_Контрагент); 
		ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		
		ОткрытьФорму("Справочник.вмс_Поклажедатели.Формавыбора",ПараметрыВыбора, Элемент);	
	Иначе
		ОткрытьФорму("Справочник.вмс_Поклажедатели.Формавыбора",,Элемент);			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабПоклажедательОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТабПоклажедатель.ТекущиеДанные;   
	ТекДанные.Контрагент = КонтрагентПредставителя(ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область Документы

&НаСервере
Процедура ОтправитьОстаткиПоКарточкамНаСервере()
	
	вмс_ЛичныйКабинетПоклажедателяВызовСервер.ОтправитьОстаткиПоКарточкам();    
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКарточкиНаСервере()

	вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПолучитьКарточки();    
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДокументыНаСервере()
	
	вмс_ЛичныйКабинетПоклажедателяВызовСервер.ВыгрузитьДокПередачаНаХранение();
	вмс_ЛичныйКабинетПоклажедателяВызовСервер.ВыгрузитьДокВыдачаСХранения(); 
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыПоФайлуНаСервере()   
	
	вмс_ЛичныйКабинетПоклажедателяВызовСервер.ВыгрузитьДокументыДляЗаполненияПоФайлу();   
	
КонецПроцедуры

#КонецОбласти






