&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ПроцентПополнения = 50;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЯчейки(Команда)
	ПроверитьЯчейкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьЯчейкиНаСервере()
	
	РаспределениеПодпитки.Очистить();
	
	Запрос = Новый Запрос;
	// ТУ_ПРошин_13.01.26+ 
	//Предполагаю что в подпитке склад важен, поэтому достаю из ячейки   
	
	Запрос.УстановитьПараметр("Склад", Объект.Склад);        
	Запрос.УстановитьПараметр("ТипЯчейки", Перечисления.вмс_ТипыЯчеек.Хранение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки КАК вмс_ОперацияПоЯчейкамОстатки
	|ГДЕ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка.Владелец = &Склад
	|	И вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток < 5
	|	И вмс_ОперацияПоЯчейкамОстатки.Ячейка.ТипЯчейки = &ТипЯчейки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товар";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		рСтрока = РаспределениеПодпитки.Добавить();
		рСтрока.Номенклатура   		= Выборка.Товар;
		рСтрока.Характеристика 		= Выборка.Характеристика;
		рСтрока.ЯчейкаПриемник 		= Выборка.Ячейка;
		рСтрока.ОстатокВПриемнике 	= Выборка.КоличествоОстаток;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодпитку(Команда)
	ПроверитьПодпиткуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодпиткуНаСервере()
	
	ВыгрузкаТТ = РаспределениеПодпитки.Выгрузить(,"Номенклатура, Характеристика");	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	//Установка значений параметров
	Запрос.УстановитьПараметр("ТипЯчейки", Перечисления.вмс_ТипыЯчеек.Подпитка);  
	// ТУ_Прошин_13.01.26
	//Предполагаю, что для подпитки важно сохранить отбор по складу, поэтому достаю из ячейки
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("ВнешняяТаблица", ВыгрузкаТТ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнешняяТаблица.Номенклатура КАК Номенклатура,
	|	ВнешняяТаблица.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ВнешняяТаблица
	|ИЗ
	|	&ВнешняяТаблица КАК ВнешняяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_ВнешняяТаблица КАК ВТ_ВнешняяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки КАК вмс_ОперацияПоЯчейкамОстатки
	|		ПО ВТ_ВнешняяТаблица.Номенклатура = вмс_ОперацияПоЯчейкамОстатки.Товар
	|			И ВТ_ВнешняяТаблица.Характеристика = вмс_ОперацияПоЯчейкамОстатки.Характеристика
	|ГДЕ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка.Владелец = &Склад
	|	И вмс_ОперацияПоЯчейкамОстатки.Ячейка.ТипЯчейки = &ТипЯчейки";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		 
		МассивТоваровПодпитки = РаспределениеПодпитки.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",Выборка.Товар,Выборка.Характеристика));
		ПерваяИтерация = 0;
		ОстатокРезерва = 0;
		Для каждого НайденныйТовар Из МассивТоваровПодпитки Цикл	
			
			Если ЗначениеЗаполнено(НайденныйТовар.ЯчейкаПодпитки) Тогда
				  Продолжить;
			  КонецЕсли;
			  
			Если МассивТоваровПодпитки.Количество() = 1 Тогда
				
				НайденныйТовар.ОстатокВЯчейке 		= Выборка.КоличествоОстаток;
				НайденныйТовар.ЯчейкаПодпитки 		= Выборка.Ячейка;
				НайденныйТовар.Зарезервировано 		= Окр((НайденныйТовар.ОстатокВЯчейке * (Объект.ПроцентПополнения / 100)));
				НайденныйТовар.ОстатокБезРезерва 	= Выборка.КоличествоОстаток - НайденныйТовар.Зарезервировано; 
				НайденныйТовар.ОстатокСРезервом 	= НайденныйТовар.ОстатокВПриемнике + НайденныйТовар.Зарезервировано;
				
			ИначеЕсли ПерваяИтерация = 0 Тогда
				
				НайденныйТовар.ОстатокВЯчейке 		= Выборка.КоличествоОстаток;
				НайденныйТовар.ЯчейкаПодпитки 		= Выборка.Ячейка;
				Если Выборка.КоличествоОстаток >= 10 Тогда
					НайденныйТовар.Зарезервировано 		= Окр((НайденныйТовар.ОстатокВЯчейке * (Объект.ПроцентПополнения / 100)));
				Иначе
					НайденныйТовар.Зарезервировано 		= Выборка.КоличествоОстаток;
				КонецЕсли;
				
				НайденныйТовар.ОстатокБезРезерва 	= Выборка.КоличествоОстаток - НайденныйТовар.Зарезервировано;
				НайденныйТовар.ОстатокСРезервом 	= НайденныйТовар.ОстатокВПриемнике + НайденныйТовар.Зарезервировано;
				ПерваяИтерация = 1;
				ОстатокРезерва = НайденныйТовар.ОстатокБезРезерва;
				
			Иначе
				Если ОстатокРезерва = 0 Тогда
					Прервать;	
				КонецЕсли;
				НайденныйТовар.ОстатокВЯчейке 		= НайденныйТовар.ОстатокБезРезерва;
				НайденныйТовар.ЯчейкаПодпитки 		= Выборка.Ячейка;				
				НайденныйТовар.ОстатокБезРезерва 	= НайденныйТовар.Зарезервировано;
				НайденныйТовар.ОстатокСРезервом 	= НайденныйТовар.ОстатокВПриемнике + НайденныйТовар.Зарезервировано;
				
				Если ОстатокРезерва > 10 Тогда
					НайденныйТовар.Зарезервировано 	= Окр((ОстатокРезерва * (Объект.ПроцентПополнения / 100)));
					ОстатокРезерва = ОстатокРезерва -  НайденныйТовар.Зарезервировано;
				Иначе
					НайденныйТовар.Зарезервировано 	= ОстатокРезерва;
					ПерваяИтерация = 0;
					ОстатокРезерва = 0;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадания(Команда)
	СоздатьЗаданияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаданияНаСервере()
	
	ЗаданиеКладовщику = Документы.вмс_ЗаданиеКладовщику.СоздатьДокумент();
	ЗаданиеКладовщику.Заполнить(Неопределено);
	ЗаданиеКладовщику.Дата = ТекущаяДата();
	ЗаданиеКладовщику.Склад = Объект.Склад;
	ЗаданиеКладовщику.Автор = Пользователи.ТекущийПользователь();
	ЗаданиеКладовщику.Комментарий = "Создан автоматически при помощи обработки";
	ЗаданиеКладовщику.Операция = Справочники.вмс_Операции.НайтиПоНаименованию("Подпитка");
	
	Для каждого ТоварКПодпитке Из РаспределениеПодпитки Цикл
		
		Если ЗначениеЗаполнено(ТоварКПодпитке.Зарезервировано) Тогда
			нСтрока = ЗаданиеКладовщику.Товары.Добавить();
			нСтрока.Номенклатура 	= ТоварКПодпитке.Номенклатура;
			нСтрока.Характеристика  = ТоварКПодпитке.Характеристика;
			нСтрока.Ячейка 			= ТоварКПодпитке.ЯчейкаПодпитки;
			нСтрока.ЯчейкаПриемник  = ТоварКПодпитке.ЯчейкаПриемник;
			нСтрока.Количество = ТоварКПодпитке.Зарезервировано;
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		ЗаданиеКладовщику.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЗаданиеКладовщику.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	ОбщегоНазначения.СообщитьПользователю("Создан документ на подпитку: " + ЗаданиеКладовщику.Ссылка);
	
КонецПроцедуры