
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ПараметрыПроверкиКода") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	НастроитьЭлементыФормы83();
	
	ПроверитьКодМаркировки();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодМаркировкиПриИзменении(Элемент)
	
	КлючКода = Неопределено;
	ОчиститьСообщения();
	СброситьРезультатыПроверки();
	
	Если Не ЗначениеЗаполнено(КодМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьКодМаркировки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КодМаркировкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МодульКлиента().ОткрытьФормуКодаМаркировки(КлючКода, Организация, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭквивалентовРазделителяGS1Нажатие(Элемент)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("СписокЭквивалентовРазделителяGS1ПослеРедактирования", ЭтаФорма);
	
	КонтекстФормы = МодульКлиента().Новый_ПараметрыФормыРедактированияСписка();
	
	КонтекстФормы.РазрешитьРедактирование = Истина;
	КонтекстФормы.Заголовок               = НСтр("ru = 'Эквиваленты разделителя GS1'");
	КонтекстФормы.Список                  = СписокЭквивалентовРазделителяGS1;
	КонтекстФормы.ТипЗначений             = Тип("Строка");
	
	МодульКлиента().ОткрытьФормуПросмотраСписка(ЭтаФорма, КонтекстФормы, Обработчик);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьКодМаркировки(Команда)
	
	Если ЕстьОшибки Или Не ЗначениеЗаполнено(КлючКода) Тогда
		ТекстОшибки = НСтр("ru='Код маркировки не подходит для операции'");
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор);
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("КлючКода", КлючКода);
	ПараметрыЗакрытия.Вставить("КодМаркировки", КодМаркировки);
	
	ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	ЗаполнитьСписокЭквивалентовРазделителяGS1();
	
	Параметры.Свойство("КлючКода", КлючКода);
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("ПараметрыПроверкиКода", ПараметрыПроверкиКода);
	
	Если ЗначениеЗаполнено(Параметры.КлючКода) Тогда
		КодМаркировки = МодульОбъекта().КодМаркировки_НайтиПоКлючу(КлючКода);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыПроверкиКода) Тогда
		
		ПараметрыПроверкиКода.Свойство("ПроверятьПолныйКод", ПроверятьПолныйКод);
		ПараметрыПроверкиКода.Свойство("ПроверятьСоставКода", ПроверятьСоставКода);
		
		ПроверятьПеременноеКоличествоТовара = ПараметрыПроверкиКода.ПеременноеКоличествоТовара <> Неопределено;
		ПроверятьОбщийТипУпаковки = ПараметрыПроверкиКода.ОбщийТипУпаковки <> Неопределено;
		ПроверятьВидПродукции = ПараметрыПроверкиКода.ВидПродукции <> Неопределено;
		ПроверятьСтатусКода = ПараметрыПроверкиКода.СтатусКода <> Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Элементы.ГруппаТекстПодсказки.Видимость = ПроверятьПолныйКод;
	
	Элементы.ГруппаВидПродукции.Видимость = ПроверятьВидПродукции;
	Элементы.ГруппаОбщийТипУпаковки.Видимость = ПроверятьОбщийТипУпаковки;
	Элементы.ГруппаТоварПеременноеКоличество.Видимость = ПроверятьПеременноеКоличествоТовара;
	Элементы.ГруппаСтатус.Видимость = ПроверятьСтатусКода;
	Элементы.ГруппаПолныйКод.Видимость = ПроверятьПолныйКод;
	Элементы.ГруппаСоставКода.Видимость = ПроверятьСоставКода;
	Элементы.СписокЭквивалентовРазделителяGS1.Видимость = ПроверятьПолныйКод;
	
	Если ПроверятьСтатусКода Тогда
		ШаблонТекстаЭлемента = НСтр("ru='Код должен быть в статусе %1'");
		СтатусыКодов = МодульОбъекта().ЗначениеВМассиве(ПараметрыПроверкиКода.СтатусКода);
		СтатусыСтрокой = МодульОбъекта().СоединитьСтроку(СтатусыКодов, ", ");
		Элементы.ТекстСтатус.Заголовок = МодульОбъекта().ПараметрыВСтроку(ШаблонТекстаЭлемента, СтатусыСтрокой);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы83()
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3.19") Тогда
		Возврат;
	КонецЕсли;
	
	ПоРазмеруШрифта = Вычислить("РазмерКартинки.ПоРазмеруШрифта");
	
	Элементы.КартинкаСоставКода.РазмерКартинки = ПоРазмеруШрифта;
	Элементы.КартинкаВидПродукции.РазмерКартинки = ПоРазмеруШрифта;
	Элементы.КартинкаОбщийТипУпаковки.РазмерКартинки = ПоРазмеруШрифта;
	Элементы.КартинкаТоварПеременноеКоличество.РазмерКартинки = ПоРазмеруШрифта;
	Элементы.КартинкаСтатус.РазмерКартинки = ПоРазмеруШрифта;
	Элементы.КартинкаПолныйКод.РазмерКартинки = ПоРазмеруШрифта;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКодМаркировки(ВызыватьИсключение = Ложь)
	
	Если Не ЗначениеЗаполнено(КодМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	
	СтрКода = ТаблицаКодов.Добавить();
	ЗаполнитьИнформациюПоКодуМаркировки(ТаблицаКодов, СтрКода, ВызыватьИсключение);
	
	КлючКода = СтрКода.КлючКода;
	КодМаркировки = СтрКода.КодМаркировки;
	
	ПроверитьПеременноеКоличествоТовара(СтрКода);
	ПроверитьОбщийТипУпаковки(СтрКода);
	ПроверитьВидПродукции(СтрКода);
	ПроверитьСтатусКода(СтрКода);
	ПроверитьСоставКода(СтрКода);
	ПроверитьПолныйКод(СтрКода);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюПоКодуМаркировки(ТаблицаКодов, СтрКода, ВызыватьИсключение = Ложь)
	
	СтатусыКодов = МодульОбъекта().Перечисление_СтатусыКодов();
	
	ИсходныйКод = КодМаркировкиВосстановитьЭквивалентРазделителяGS1(КодМаркировки);
	СтрКода.КодМаркировки = ИсходныйКод;
	
	// При открытии формы КлючКода уже может быть заполнен
	Если ЗначениеЗаполнено(КлючКода) Тогда
		СтрКода.КлючКода = КлючКода;
	Иначе
		СтрКода.КлючКода = МодульОбъекта().КодМаркировки_КлючКода(КодМаркировки);
	КонецЕсли;
	
	ЕстьКодВБазе = ЗначениеЗаполнено(СтрКода.КлючКода);
	ВведенПолныйКод = Ложь;
	ЗаписатьПолныйКодВБазу = Ложь;
	
	Если ЕстьКодВБазе Тогда
		МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	КонецЕсли;
	
	// Заполненный вид продукции требуется для корректной нормализации и обновления статусов в сервисе
	Если Не ЗначениеЗаполнено(СтрКода.ВидПродукции) И ПараметрыПроверкиКода.Свойство("ВидПродукции") Тогда
		СтрКода.ВидПродукции = ПараметрыПроверкиКода.ВидПродукции;
	КонецЕсли;
	
	// Нормализуем код в сервисе, пытаемся найти в базе нормализованный код
	Если Не ЕстьКодВБазе Тогда
		
		МодульОбъекта().ТаблицаКодов_НормализоватьКоды(ТаблицаКодов, Организация, Ложь);
		МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
		
		ЕстьКодВБазе = ЗначениеЗаполнено(СтрКода.КлючКода);
		
	КонецЕсли;
	
	// Заполняем полный код если его нет в базе
	Если ПроверятьПолныйКод И Не СтрКода.ЕстьПолныйКод Тогда
		
		Если КодМаркировкиСодержитЭквивалентРазделителяGS1(ИсходныйКод, ВызыватьИсключение) Тогда
			СтрКода.ПолныйКод = ИсходныйКод;
			ЗаписатьПолныйКодВБазу = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверяем что код существует в ГИС МТ
	МодульОбъекта().ТаблицаКодов_ОбновитьСтатусы(ТаблицаКодов, Организация);
	Если СтрКода.Статус = СтатусыКодов.НеНайден И ВызыватьИсключение Тогда
		ТекстОшибки = НСтр("ru='Не удалось найти код маркировки в ГИС МТ'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если Не ЕстьКодВБазе Или ЗаписатьПолныйКодВБазу Тогда
		МодульОбъекта().ТаблицаКодов_ЗаписатьВсюИнформацию(ТаблицаКодов);
	КонецЕсли;
	
	Если ЗаписатьПолныйКодВБазу Тогда
		МодульОбъекта().ПолныеКоды_Записать(ТаблицаКодов);
	КонецЕсли;
	
	Если ПроверятьСоставКода Тогда
		Если Не МодульОбъекта().КодМаркировки_ЕстьВложенныеКоды(СтрКода.КлючКода) Тогда
			МодульОбъекта().ТаблицаКодов_ЗаполнитьВложенныеКодыИзГИСМТ(ТаблицаКодов, Организация);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВидПродукции(ОписаниеКода)
	
	Если Не ПроверятьВидПродукции Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = (ПараметрыПроверкиКода.ВидПродукции = ОписаниеКода.ВидПродукции);
	ОтразитьРезультатПроверки(Элементы.КартинкаВидПродукции, РезультатПроверки);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьОбщийТипУпаковки(ОписаниеКода)
	
	Если Не ПроверятьОбщийТипУпаковки Тогда
		Возврат;
	КонецЕсли;
	
	ПодходящиеЗначения = МодульОбъекта().ЗначениеВМассиве(ПараметрыПроверкиКода.ОбщийТипУпаковки);
	РезультатПроверки = МодульОбъекта().МассивСодержитЗначение(ПодходящиеЗначения, ОписаниеКода.ОбщийТипУпаковки);
	
	ОтразитьРезультатПроверки(Элементы.КартинкаОбщийТипУпаковки, РезультатПроверки);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтатусКода(ОписаниеКода)
	
	Если Не ПроверятьСтатусКода Тогда
		Возврат;
	КонецЕсли;
	
	ПодходящиеЗначения = МодульОбъекта().ЗначениеВМассиве(ПараметрыПроверкиКода.СтатусКода);
	РезультатПроверки = МодульОбъекта().МассивСодержитЗначение(ПодходящиеЗначения, ОписаниеКода.Статус);
	
	ОтразитьРезультатПроверки(Элементы.КартинкаСтатус, РезультатПроверки);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПеременноеКоличествоТовара(ОписаниеКода)
	
	Если Не ПроверятьПеременноеКоличествоТовара Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеКода.Товар) Тогда
		ОписаниеТовара = МодульОбъекта().Товар_Прочитать(ОписаниеКода.Товар);
		РезультатПроверки = (ПараметрыПроверкиКода.ПеременноеКоличествоТовара = ОписаниеТовара.ПеременныйВес);
	Иначе
		РезультатПроверки = Ложь;
	КонецЕсли;
	
	ОтразитьРезультатПроверки(Элементы.КартинкаТоварПеременноеКоличество, РезультатПроверки);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПолныйКод(ОписаниеКода)
	
	Если Не ПроверятьПолныйКод Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = (ОписаниеКода.ЕстьПолныйКод = Истина);
	ОтразитьРезультатПроверки(Элементы.КартинкаПолныйКод, РезультатПроверки);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоставКода(ОписаниеКода)
	
	Если Не ПроверятьСоставКода Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = МодульОбъекта().КодМаркировки_ЕстьВложенныеКоды(ОписаниеКода.КлючКода);
	ОтразитьРезультатПроверки(Элементы.КартинкаСоставКода, РезультатПроверки);
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьРезультатПроверки(Элемент, РезультатПроверки)
	
	Если РезультатПроверки = Истина Тогда
		Элемент.Картинка = БиблиотекаКартинок.КонтурМаркировка_ГалочкаВКруге;
	Иначе
		ЕстьОшибки = Истина;
		Элемент.Картинка = БиблиотекаКартинок.КонтурМаркировка_ВосклицательныйЗнак;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СписокЭквивалентовРазделителяGS1ПослеРедактирования(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивЭквивалентовGS1 = Результат.ВыгрузитьЗначения();
	МодульОбъекта().ЭквивалентыРазделителяGS1_Записать(МассивЭквивалентовGS1);
	
	ЗаполнитьСписокЭквивалентовРазделителяGS1();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЭквивалентовРазделителяGS1()
	
	МассивЭквивалентовGS1 = МодульОбъекта().ЭквивалентыРазделителяGS1();
	СписокЭквивалентовРазделителяGS1.ЗагрузитьЗначения(МассивЭквивалентовGS1);
	
КонецПроцедуры

&НаСервере
Функция КодМаркировкиВосстановитьЭквивалентРазделителяGS1(Знач КодМаркировки)
	
	МассивРазделителей = СписокЭквивалентовРазделителяGS1.ВыгрузитьЗначения();
	ЭквивалентРазделителяGS1 = МодульОбъекта().ЭквивалентРазделителяGS1();
	
	Результат = КодМаркировки;
	Для Каждого Разделитель Из МассивРазделителей Цикл
		Результат = СтрЗаменить(Результат, Разделитель, ЭквивалентРазделителяGS1);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КодМаркировкиСодержитЭквивалентРазделителяGS1(Знач КодМаркировки, ВызыватьИсключение = Ложь)
	
	Результат = (Найти(КодМаркировки, МодульОбъекта().ЭквивалентРазделителяGS1()) <> 0);
	
	Если Результат = Ложь И ВызыватьИсключение Тогда
		ШаблонОшибки = НСтр("ru = 'Код маркировки %1 не содержит эквиваленты разделителя GS1 и не может быть загружен как полный.'");
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки, КодМаркировки);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СброситьРезультатыПроверки()
	
	ЕстьОшибки = Ложь;
	
	КартинкаПредупреждение = БиблиотекаКартинок.КонтурМаркировка_Предупреждение;
	
	Элементы.КартинкаСоставКода.Картинка = КартинкаПредупреждение;
	Элементы.КартинкаВидПродукции.Картинка = КартинкаПредупреждение;
	Элементы.КартинкаОбщийТипУпаковки.Картинка = КартинкаПредупреждение;
	Элементы.КартинкаТоварПеременноеКоличество.Картинка = КартинкаПредупреждение;
	Элементы.КартинкаСтатус.Картинка = КартинкаПредупреждение;
	Элементы.КартинкаПолныйКод.Картинка = КартинкаПредупреждение;
	
КонецПроцедуры

// #КонецОбласти
