// { Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
// } Адаптация

Функция ЗаписатьСодержимоеОбъектаИБ(Объект, ПараметрыЗаписиXML) Экспорт
	
	Перем Обмен_с_КИС_ВызовСервера, РаботаСXMLКлиентСервер, ОбщегоНазначенияСервер, ОбщегоНазначенияВызовСервера, РаботаСКоллекциями;
	
	//Обмен_с_КИС_ВызовСервера = ПараметрыЗаписиXML.ОбщиеМодули.Обмен_с_КИС_ВызовСервера;
	РаботаСXMLКлиентСервер = ПараметрыЗаписиXML.ОбщиеМодули.РаботаСXMLКлиентСервер;
	ОбщегоНазначенияСервер = ПараметрыЗаписиXML.ОбщиеМодули.ОбщегоНазначенияСервер;
	ОбщегоНазначенияВызовСервера = ПараметрыЗаписиXML.ОбщиеМодули.ОбщегоНазначенияВызовСервера;
	РаботаСКоллекциями = ПараметрыЗаписиXML.ОбщиеМодули.РаботаСКоллекциями;
	
	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;
	
	Если ТипЗнч(Объект) = Тип("УдалениеОбъекта") Тогда
		ЗаписатьXML(ЗаписьXML, Объект);
		Возврат Истина;
	КонецЕсли;
	
	ДанныеОбъекта = ПараметрыЗаписиXML.ДанныеОбъектов[Объект];
	Если ДанныеОбъекта=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//Обмен_с_КИС_ВызовСервера.ПреобразоватьСсылкиИБВКвазиСсылкиВДанных(СтруктураОбъекта);
	
	МетаданныеОбъекта = ОбщегоНазначенияСервер.ПолучитьМетаДанныеОбъекта(Объект);
	ЭтоСсылочныйТип = ОбщегоНазначенияВызовСервера.ЭтоМетаданныеСсылочногоТипа(МетаданныеОбъекта);
	Если ЭтоСсылочныйТип И (Метаданные.Справочники.Содержит(МетаданныеОбъекта) ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеОбъекта)) И МетаданныеОбъекта.Иерархический Тогда
		ЭтоГруппа = Объект.ЭтоГруппа;
	Иначе
		ЭтоГруппа = Неопределено;
	КонецЕсли;
	
	Если ЭтоСсылочныйТип Тогда
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", Строка(Объект.Ссылка.УникальныйИдентификатор()));
	КонецЕсли;
	
	Если ЭтоГруппа <> Неопределено Тогда
		ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", XMLСтрока(ЭтоГруппа));
	КонецЕсли;

	// запишем реквизиты шапки
	РаботаСXMLКлиентСервер.ЗаписатьСвойстваОбъекта(ДанныеОбъекта.ТаблицаСвойствРеквизитовОбъектов, ПараметрыЗаписиXML);
	
	// запишем табличные части
	Для Каждого ТаблицаСвойствТаблицыОбъекта Из ДанныеОбъекта.ТаблицаСвойствТаблицОбъекта Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента(ТаблицаСвойствТаблицыОбъекта.Имя);
		Для Каждого ТаблицаСвойствСтрокиТаблицы Из ТаблицаСвойствТаблицыОбъекта.ТаблицаСвойствСтрокТаблицы Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("Row");
			РаботаСXMLКлиентСервер.ЗаписатьСвойстваОбъекта(ТаблицаСвойствСтрокиТаблицы, ПараметрыЗаписиXML);
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	// запишем дополнительные структуры
	Для Каждого ТаблицаСвойствДополнительнойСтруктурыОбъекта Из ДанныеОбъекта.ТаблицаСвойствДополнительныхСтруктурОбъекта Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента(ТаблицаСвойствДополнительнойСтруктурыОбъекта.Имя);
		РаботаСXMLКлиентСервер.ЗаписатьСвойстваОбъекта(ТаблицаСвойствДополнительнойСтруктурыОбъекта.ТаблицаСвойствЭлементов, ПараметрыЗаписиXML);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьСвойстваОбъектаИБИзСтруктуры(Объект, СтруктураОбъекта) Экспорт
	
	Перем РаботаСКоллекциями, ОбщегоНазначенияВызовСервера, МетаДанныеРеквизита, ЗначениеРеквизитаТипизированное;
	
	РаботаСКоллекциями = глОбщийМодуль("РаботаСКоллекциями");
	ОбщегоНазначенияВызовСервера = глОбщийМодуль("ОбщегоНазначенияВызовСервера");
	
	МетаДанныеОбъекта = Объект.Метаданные();
	
	ЭтоРегистр = МетаДанные.РегистрыСведений.Содержит(МетаДанныеОбъекта) ИЛИ Метаданные.РегистрыНакопления.Содержит(МетаДанныеОбъекта);
	
	ЭтоГруппа = Неопределено;
	
	
	Если СтруктураОбъекта.Свойство("Реквизиты") Тогда
		ЭтоПВХ = МетаДанные.ПланыВидовХарактеристик.Содержит(МетаДанныеОбъекта);
		Если СтруктураОбъекта.Реквизиты.Свойство("ЭтоГруппа") Тогда
			Если МетаДанныеОбъекта.Иерархический Тогда
				ЭтоГруппа = ТипизироватьЗначениеРеквизита(СтруктураОбъекта.Реквизиты.ЭтоГруппа, МетаДанныеОбъекта.СтандартныеРеквизиты.ЭтоГруппа);
			Иначе
				ЭтоГруппа = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		РеквизитыИсключения = Новый Соответствие;
		РеквизитыИсключения["Ссылка"] = Истина;
		РеквизитыИсключения["ЭтоГруппа"] = Истина;
		РеквизитыИсключения["ИмяПредопределенныхДанных"] = Истина;
		РеквизитыИсключения["Предопределенный"] = Истина;
		
		ЭтоСтандартныйРеквизит = Новый Соответствие;
		МетаДанныеРеквизитов = Новый Структура;
		Для Каждого МетаДанныеРеквизита Из МетаДанныеОбъекта.СтандартныеРеквизиты Цикл
			МетаДанныеРеквизитов.Вставить(МетаДанныеРеквизита.Имя, МетаДанныеРеквизита);
			ЭтоСтандартныйРеквизит[МетаДанныеРеквизита.Имя] = Истина;
		КонецЦикла;
		
		Для Каждого МетаДанныеРеквизита Из МетаДанныеОбъекта.Реквизиты Цикл
			МетаДанныеРеквизитов.Вставить(МетаДанныеРеквизита.Имя, МетаДанныеРеквизита);
		КонецЦикла;
		
		ТипОписаниеТипов = Тип("ОписаниеТипов");
		
		Для Каждого Реквизит Из СтруктураОбъекта.Реквизиты Цикл
			ИмяРеквизита = Реквизит.Ключ;
			ЗначениеРеквизита = Реквизит.Значение;
			
			Если РеквизитыИсключения[ИмяРеквизита] = Истина Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ МетаДанныеРеквизитов.Свойство(ИмяРеквизита, МетаДанныеРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЭтоГруппа <> Неопределено Тогда
				Если ЭтоСтандартныйРеквизит[ИмяРеквизита] <> Истина Тогда
					Если Не (МетаДанныеРеквизита.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппыИЭлемента
						ИЛИ МетаДанныеРеквизита.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента И Не ЭтоГруппа
						ИЛИ МетаДанныеРеквизита.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И ЭтоГруппа) Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ЗначениеРеквизитаТипизированное = ТипизироватьЗначениеРеквизита(ЗначениеРеквизита, МетаДанныеРеквизита);
			
			Если ЭтоПВХ Тогда
				Тип = ТипЗнч(ЗначениеРеквизитаТипизированное);
				Если Тип=ТипОписаниеТипов Тогда
					ДоступныеТипы = РаботаСКоллекциями.ПересечениеМассивов(ЗначениеРеквизитаТипизированное.Типы(), МетаДанныеОбъекта.Тип.Типы());
					Если ДоступныеТипы.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Если ДоступныеТипы.Количество() < ЗначениеРеквизитаТипизированное.Типы().Количество() Тогда
						ЗначениеРеквизитаТипизированное = Новый ОписаниеТипов(ДоступныеТипы, ЗначениеРеквизитаТипизированное.КвалификаторыЧисла, ЗначениеРеквизитаТипизированное.КвалификаторыСтроки, ЗначениеРеквизитаТипизированное.КвалификаторыДаты, ЗначениеРеквизитаТипизированное.КвалификаторыДвоичныхДанных);
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли;
			
			Объект[ИмяРеквизита] = ЗначениеРеквизитаТипизированное;
			
		КонецЦикла; 
	КонецЕсли;
	
	
	Если ЭтоРегистр Тогда
		МетаДанныеРеквизитов = Новый Структура;
		Для Каждого МетаДанныеРеквизита Из МетаДанныеОбъекта.СтандартныеРеквизиты Цикл
			МетаДанныеРеквизитов.Вставить(МетаДанныеРеквизита.Имя, МетаДанныеРеквизита);
		КонецЦикла;
		
		Для Каждого МетаДанныеРеквизита Из МетаДанныеОбъекта.Реквизиты Цикл
			МетаДанныеРеквизитов.Вставить(МетаДанныеРеквизита.Имя, МетаДанныеРеквизита);
		КонецЦикла;
		
		Для Каждого МетаДанныеРеквизита Из МетаДанныеОбъекта.Измерения Цикл
			МетаДанныеРеквизитов.Вставить(МетаДанныеРеквизита.Имя, МетаДанныеРеквизита);
		КонецЦикла;
		
		Для Каждого МетаДанныеРеквизита Из МетаДанныеОбъекта.Ресурсы Цикл
			МетаДанныеРеквизитов.Вставить(МетаДанныеРеквизита.Имя, МетаДанныеРеквизита);
		КонецЦикла;
		
		Для Каждого ЭлементОтбора Из СтруктураОбъекта.Отбор Цикл
			ИмяРеквизита = ЭлементОтбора.Ключ;
			ЗначениеРеквизита = ЭлементОтбора.Значение;
			
			Если НЕ МетаДанныеРеквизитов.Свойство(ИмяРеквизита, МетаДанныеРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеРеквизитаТипизированное = ТипизироватьЗначениеРеквизита(ЗначениеРеквизита, МетаДанныеРеквизита);

			Объект.Отбор[ИмяРеквизита].Установить(ЗначениеРеквизитаТипизированное);
		КонецЦикла;
	КонецЕсли;
	
	
	Если СтруктураОбъекта.Свойство("ТабличныеЧасти") Тогда
		РеквизитыИсключения = Новый Соответствие;
		РеквизитыИсключения["НомерСтроки"] = Истина;
		
		Для Каждого РеквизитТабличнаяЧасть Из СтруктураОбъекта.ТабличныеЧасти Цикл
			ИмяТабличнойЧасти = РеквизитТабличнаяЧасть.Ключ;
			ТабличнаяЧасть = РеквизитТабличнаяЧасть.Значение;
			
			Если ЭтоРегистр Тогда
				
				Если ИмяТабличнойЧасти="Записи" Тогда
					
					МетаДанныеРеквизитовТабличнойЧасти = МетаДанныеРеквизитов;
					
				Иначе
					
					Продолжить;
					
				КонецЕсли;
				
				ТабличнаяЧастьОбъекта = Объект;
				
			Иначе
				
				МетаДанныеТабличнойЧасти = МетаДанныеОбъекта.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
				Если МетаДанныеТабличнойЧасти = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				МетаДанныеРеквизитовТабличнойЧасти = Новый Структура;
				Для Каждого МетаДанныеРеквизита Из МетаДанныеТабличнойЧасти.СтандартныеРеквизиты Цикл
					МетаДанныеРеквизитовТабличнойЧасти.Вставить(МетаДанныеРеквизита.Имя, МетаДанныеРеквизита);
				КонецЦикла;
				
				Для Каждого МетаДанныеРеквизита Из МетаДанныеТабличнойЧасти.Реквизиты Цикл
					МетаДанныеРеквизитовТабличнойЧасти.Вставить(МетаДанныеРеквизита.Имя, МетаДанныеРеквизита);
				КонецЦикла;
				
				Если ЭтоГруппа <> Неопределено Тогда
					Если Не (МетаДанныеТабличнойЧасти.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппыИЭлемента
						ИЛИ МетаДанныеТабличнойЧасти.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента И Не ЭтоГруппа
						ИЛИ МетаДанныеТабличнойЧасти.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И ЭтоГруппа) Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				ТабличнаяЧастьОбъекта = Объект[ИмяТабличнойЧасти];
				
			КонецЕсли;
			
			ТабличнаяЧастьОбъекта.Очистить();
			СтрокиТабличнойЧасти = РаботаСКоллекциями.ПолучитьЭлементыКоллекции(ТабличнаяЧасть);
			КолонкиТабличнойЧасти = РаботаСКоллекциями.ПолучитьКолонкиКоллекции(ТабличнаяЧасть);
			Для Каждого Строка Из СтрокиТабличнойЧасти Цикл
				НоваяСтрока = ТабличнаяЧастьОбъекта.Добавить();
				Для Каждого ИмяКолонки Из КолонкиТабличнойЧасти Цикл
					ИмяРеквизита = ИмяКолонки;
					ЗначениеРеквизита = Строка[ИмяРеквизита];
					
					Если РеквизитыИсключения[ИмяРеквизита]=Истина Тогда
						Продолжить;
					КонецЕсли;
					
					Если НЕ МетаДанныеРеквизитовТабличнойЧасти.Свойство(ИмяРеквизита, МетаДанныеРеквизита) Тогда
						Продолжить;
					КонецЕсли;
					
					ЗначениеРеквизитаТипизированное = ТипизироватьЗначениеРеквизита(ЗначениеРеквизита, МетаДанныеРеквизита);
					
					НоваяСтрока[ИмяРеквизита] = ЗначениеРеквизитаТипизированное;
				КонецЦикла; 
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	
	Если СтруктураОбъекта.Свойство("ДополнительныеСвойства") Тогда
		Для Каждого ДополнительноеСвойство Из СтруктураОбъекта.ДополнительныеСвойства Цикл
			
			Объект.ДополнительныеСвойства.Вставить(ДополнительноеСвойство.Ключ, ДополнительноеСвойство.Значение);
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции

Функция ТипизироватьЗначениеРеквизита(Значение, Реквизит)
	
	ТипРеквизита = Реквизит.Тип;
	
	ТипизированноеЗначение = ТипРеквизита.ПривестиЗначение(Значение);
	
	Если ТипизированноеЗначение <> Значение Тогда
		// не соответствует типу реквизита
		ТипизированноеЗначение = Неопределено;
		
		Если ТипЗнч(Значение)=Тип("Строка") Тогда
			// сериализованное значение
			Типы = ТипРеквизита.Типы();
			Если Типы.Количество()=1 Тогда
				Попытка
					ТипизированноеЗначение = XMLЗначение(Типы[0], Значение);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТипизированноеЗначение;
	
КонецФункции
