
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьМерногоУчета();
КонецПроцедуры

&НаКлиенте
Процедура ВидДвиженияПриИзменении(Элемент)
	УстановитьВидимостьУслугиДляХранения();
КонецПроцедуры


&НаКлиенте
Процедура МерныйУчетПриИзменении(Элемент)
	УстановитьДоступностьМерногоУчета();
КонецПроцедуры

&НаКлиенте
Функция УстановитьДоступностьМерногоУчета()
	
	Элементы.ГруппаАлгоритмыДляШтучногоТовара.ТолькоПросмотр = Объект.МерныйУчет = Ложь;
	
КонецФункции

&НаКлиенте
Функция УстановитьВидимостьУслугиДляХранения()
	Элементы.УслугаХранения.Видимость = Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.вмс_ВидыДвиженияУслугОтветственногоХранения.Приход");	
КонецФункции

// ТУ_Уварова 03.09.2026 ++ 3.2.6
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НужнаФормаНоменклатуры = НЕ ЗначениеЗаполнено(Объект.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НужнаФормаНоменклатуры И ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		
		 ПараметрыОткрытия = Новый Структура("Ключ", Объект.Номенклатура);
		 ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыОткрытия);
	
	КонецЕсли;

КонецПроцедуры 
// ТУ_Уварова 03.09.2026 -- 3.2.6