
// #Область ПрограммныйИнтерфейс

Процедура ВыполнитьОсновнуюКомандуКонтурИнтеграции(Команда, Форма, Источник, Оповещение) Экспорт
	
	Модуль = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент();
	Модуль.КонтурИнтеграция_ВыполнитьОсновнуюКомандуКонтурИнтеграции(Команда, Форма, Источник, Оповещение);
	
КонецПроцедуры

Процедура ВыполнитьОсновнуюКомандуКонтурИнтеграцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Модуль = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент();
	Модуль.КонтурИнтеграция_ВыполнитьОсновнуюКомандуКонтурИнтеграцииЗавершение(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуКонтурИнтеграции(Команда, Форма, Источник, Оповещение) Экспорт
	
	Модуль = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент();
	Модуль.КонтурИнтеграция_ВыполнитьДополнительнуюКомандуКонтурИнтеграции(Команда, Форма, Источник, Оповещение);
	
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуКонтурИнтеграцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Модуль = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент();
	Модуль.КонтурИнтеграция_ВыполнитьДополнительнуюКомандуКонтурИнтеграцииЗавершение(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

Функция ОбщийМодуль(ИмяОбщегоМодуля)
	
	Модуль = Вычислить(ИмяОбщегоМодуля);
	
	#Если Не ВебКлиент Тогда
		Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
			ВызватьИсключение НСтр("ru = 'Общий модуль не существует: '") + ИмяОбщегоМодуля;
		КонецЕсли;
	#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции

// #КонецОбласти
