
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если МодульОбъекта().ТребуетсяВыполнитьДлительноеОбновлениеДанных() Тогда
		ТекстЗаголовка = НСтр(
		"ru = 'Выполняется обновление данных до версии %1
		|Обновление может занять несколько часов
		|Пожалуйста, подождите...'");
	Иначе
		ТекстЗаголовка = НСтр(
		"ru = 'Выполняется обновление данных до версии %1
		|Пожалуйста, подождите...'");
	КонецЕсли;
	
	ТребуемаяВерсия = МодульОбъекта().ТребуемаяВерсияДанныхПодсистемы();
	
	Элементы.НадписьПереходНаНовуюВерсию.Заголовок = МодульОбъекта().ПараметрыВСтроку(ТекстЗаголовка, ТребуемаяВерсия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если МодульКлиента().ВыполняетсяОбновлениеДанныхПодсистемы() Тогда
		Интервал = 10;
		ПодключитьОбработчикОжидания("ПроверитьОбновлениеДанныхВДругомСеансе", Интервал, Истина);
	Иначе
		Интервал = 0.1;
		ПодключитьОбработчикОжидания("ПерейтиНаНовуюВерсиюДанных", Интервал, Истина);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьОбновлениеДанныхВДругомСеансе()
	
	Если МодульКлиента().ВыполняетсяОбновлениеДанныхПодсистемы() Тогда
		Интервал = 10;
		ПодключитьОбработчикОжидания("ПроверитьОбновлениеДанныхВДругомСеансе", Интервал, Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеВыполнено = Не МодульКлиента().НеобходимоПерейтиНаНовуюВерсиюДанных();
	
	Если ОбновлениеВыполнено Тогда
		СообщитьОбУспешномОбновленииДанных();
	КонецЕсли;
	
	ЭтаФорма.Закрыть(ОбновлениеВыполнено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаНовуюВерсиюДанных()
	
	ПерейтиНаНовуюВерсиюДанныхНаСервере();
	
	СообщитьОбУспешномОбновленииДанных();
	
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиНаНовуюВерсиюДанныхНаСервере()
	
	МодульОбъекта().ПерейтиНаНовуюВерсиюДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбУспешномОбновленииДанных()
	
	НоваяВерсияДанных = МодульКлиента().ВерсияДанныхПодсистемы();
	ИдентификаторФормы = МодульКлиента().СвойствоОбъекта(ВладелецФормы, "УникальныйИдентификатор");
	
	ТекстСообщения = НСтр("ru = 'Обновление на новую версию данных %1 успешно завершено'");
	ТекстСообщения = МодульКлиента().ПараметрыВСтроку(ТекстСообщения, НоваяВерсияДанных);
	МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, ИдентификаторФормы);
	
КонецПроцедуры

// #КонецОбласти
