&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтруктураНастройкиПолей = Справочники.вмс_НастройкиПолейЗадания.СтруктураНастройкиПолей(Объект);
	Иначе
		СтруктураНастройкиПолей = Справочники.вмс_НастройкиПолейЗадания.СтруктураНастройкиПолейПоУмолчанию();
	КонецЕсли;
	Справочники.вмс_НастройкиПолейЗадания.ПриСозданииФормы(ЭтаФорма, СтруктураНастройкиПолей);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_ПриАктивизацииСтроки(Элемент)
	вмс_НастройкиПолейЗадания.СвойстваЭлемента_ПриАктивизацииСтрокиНаФорме(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Перетаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	вмс_НастройкиПолейЗадания.СвойстваЭлементов_Перетаскивание(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	вмс_НастройкиПолейЗадания.СвойстваЭлементов_ПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Имя_ПриИзменении(Элемент)
	вмс_НастройкиПолейЗадания.СвойстваЭлементов_Имя_ПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Имя_НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	вмс_НастройкиПолейЗадания.СвойстваЭлементов_Имя_НачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_ПриИзменении(Элемент)
	вмс_НастройкиПолейЗадания.СвойстваЭлементов_ПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Команда(Команда)
	вмс_НастройкиПолейЗадания.НастройкаПолей_Команда(ЭтаФорма, Команда);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_ДополнительныеСвойстваЭлемента_ПриАктивизацииСтроки(Элемент)
	вмс_НастройкиПолейЗадания.ДополнительныеСвойстваЭлемента_ПриАктивизацииСтрокиНаФорме(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_ДополнительныеСвойстваЭлемента_Значение_ПриИзменении(Элемент)
	вмс_НастройкиПолейЗадания.ДополнительныеСвойстваЭлемента_Значение_ПриИзмененииНаФорме(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_ДополнительныеСвойстваЭлемента_ПриИзменении(Элемент)
	вмс_НастройкиПолейЗадания.ДополнительныеСвойстваЭлемента_ПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Справочники.вмс_НастройкиПолейЗадания.ПередЗаписьюНаФорме(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры
