#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция НайтиОбъект(СтрокаПоиска) Экспорт
	
	МассивСтрокПоиска = Новый Массив;
	МассивСтрокПоиска.Добавить(СтрокаПоиска);
	ТаблицаОбъектов = НайтиОбъекты(МассивСтрокПоиска);
	
	Если ТаблицаОбъектов.Количество() > 0 Тогда
		Возврат ТаблицаОбъектов[0].Объект;
	КонецЕсли;
	
КонецФункции

Функция НайтиОбъекты(МассивСтрокПоиска) Экспорт

	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ТаблицаОбъектов.Колонки.Добавить("СтрокаПоиска");
	ТаблицаОбъектов.Колонки.Добавить("Объект");
	ТаблицаОбъектов.Колонки.Добавить("ТипОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("ИмяТипаОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("НомерОбъекта");
	
	ТаблицаПолучаемыеОбъекты = ПолучаемыеОбъекты.Выгрузить();
	вмс_ОбщегоНазначенияСервер.ДополнитьТаблицуРеквизитамиОбъектов(ТаблицаПолучаемыеОбъекты, "ТипОбъекта", "Наименование, Префикс");
	ТаблицаПолучаемыеОбъекты.Колонки.ТипОбъектаНаименование.Имя = "ИмяТипаОбъекта";
	
	Если ИмяРеквизитаПоиска = "GUID" ИЛИ ИмяРеквизитаПоиска = "УникальныйИдентификатор" Тогда
		
		МетаДанныеОбъекта = МетаДанные.НайтиПоПолномуИмени(ИмяТаблицыДанныхИБ);
		Если МетаДанныеОбъекта.Реквизиты.Найти(ИмяРеквизитаПоиска) = Неопределено Тогда
			// поиск по гуиду
			МенеджерОбъекта = вмс_ОбщегоНазначенияСервер.ПолучитьМенеджерОбъектовБазы(ИмяТаблицыДанныхИБ);
			Для Каждого СтрокаПоиска Из МассивСтрокПоиска Цикл
				УникальныйИдентификатор = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьУникальныйИдентификаторИзСтроки(СтрокаПоиска);
				Если УникальныйИдентификатор <> Неопределено Тогда
					НайденнаяСсылка = МенеджерОбъекта.ПолучитьСсылку(УникальныйИдентификатор);
					Для Каждого СтрокаТипаОбъекта Из ТаблицаПолучаемыеОбъекты Цикл
						НайденныйОбъект = НайденнаяСсылка.ПолучитьОбъект();
						Если НайденныйОбъект <> Неопределено Тогда
							Объект = НайденныйОбъект[СтрокаТипаОбъекта.ИмяРеквизитаОбъекта];
						Иначе
							Объект = Неопределено;
						КонецЕсли;
						
						Если Объект <> Неопределено Тогда
							СтрокаОбъекта = ТаблицаОбъектов.Добавить();
							СтрокаОбъекта.СтрокаПоиска = СтрокаПоиска;
							СтрокаОбъекта.Объект = Объект;
							СтрокаОбъекта.ТипОбъекта = СтрокаТипаОбъекта.ТипОбъекта;
							СтрокаОбъекта.ИмяТипаОбъекта = СтрокаТипаОбъекта.ИмяТипаОбъекта;
							СтрокаОбъекта.НомерОбъекта = 1;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			Возврат ТаблицаОбъектов;
			
		КонецЕсли; //МетаДанныеОбъекта.Реквизиты.Найти(ИмяРеквизитаПоиска) = Неопределено
		
	КонецЕсли;     
	
	
	Если ПолучатьПоляЧерезЗапрос Тогда   
		
		Запрос = Новый Запрос(ПолеЗапроса);
		
		НомерОбъекта = 1;
		
		// важно понимать по какому конкретно штрих-коду найден объект, если их передано несколько
		Для Каждого СтрокаПоиска Из МассивСтрокПоиска Цикл 
			
			Запрос.УстановитьПараметр("МассивСтрокПоиска", СтрокаПоиска); // для совместимости
			Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
			РезультатЗапроса = Запрос.Выполнить();
			ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
			
			Для Каждого СтрокаЗапроса Из ТаблицаЗапроса Цикл 
				
				Для каждого Колонка Из ТаблицаЗапроса.Колонки  Цикл
					
					СтрокаОбъекта = ТаблицаОбъектов.Добавить();
					СтрокаОбъекта.СтрокаПоиска = СтрокаПоиска;
					СтрокаОбъекта.Объект = СтрокаЗапроса[Колонка.Имя];
					СтрокаОбъекта.ТипОбъекта = Колонка.Имя;   //Имя правила для поиска
					СтрокаОбъекта.ИмяТипаОбъекта = Колонка.Имя;
					СтрокаОбъекта.НомерОбъекта = НомерОбъекта;

				КонецЦикла;
				
				НомерОбъекта = НомерОбъекта + 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
	
		// поиск по реквизиту
		ПоляОбъектовДляЗапроса = "";
		ДопОтборы = "";
		Если ТаблицаПолучаемыеОбъекты.Количество() > 0 Тогда
			ДопОтборыМассив = Новый Массив;
			Связка = ", ";
			НомерПараметраЗначенияПоУмолчанию = 1;
			Для Каждого СтрокаПолучаемогоОбъекта Из ТаблицаПолучаемыеОбъекты Цикл
				ПоляОбъектовДляЗапроса = ПоляОбъектовДляЗапроса + Связка;
				Если СтрокаПолучаемогоОбъекта.ИспользоватьЗначениеПоУмолчанию Тогда
					ИмяПараметраЗначенияПоУмолчанию = "ЗначениеОбъектаПоУмолчанию" + Формат(НомерПараметраЗначенияПоУмолчанию, "ЧГ=0");
					Запрос.УстановитьПараметр(ИмяПараметраЗначенияПоУмолчанию, СтрокаПолучаемогоОбъекта.ЗначениеПоУмолчанию);
					НомерПараметраЗначенияПоУмолчанию = НомерПараметраЗначенияПоУмолчанию + 1;

					ПоляОбъектовДляЗапроса = ПоляОбъектовДляЗапроса + "&" + ИмяПараметраЗначенияПоУмолчанию;
				Иначе
					ПоляОбъектовДляЗапроса = ПоляОбъектовДляЗапроса + "ТаблицаИБ." + СтрокаПолучаемогоОбъекта.ИмяРеквизитаОбъекта;
					Если СтрокаПолучаемогоОбъекта.ИскатьОбъектыПоЗначениюПоУмолчанию Тогда
						ДопОтборыМассив.Добавить("ТаблицаИБ." + СтрокаПолучаемогоОбъекта.ИмяРеквизитаОбъекта + " В (&" + ИмяПараметраЗначенияПоУмолчанию + ")");
					КонецЕсли;
				КонецЕсли;
				ПоляОбъектовДляЗапроса = ПоляОбъектовДляЗапроса + " КАК " + СтрокаПолучаемогоОбъекта.ИмяРеквизитаОбъекта;
			КонецЦикла;
			ПоляОбъектовДляЗапроса = Прав(ПоляОбъектовДляЗапроса, СтрДлина(ПоляОбъектовДляЗапроса)-СтрДлина(Связка));
			Если ДопОтборыМассив.Количество() > 0 Тогда
				ДопОтборы = "И " + вмс_РаботаСКоллекциями.МассивВСтроку(ДопОтборыМассив, " И ");
			КонецЕсли;
		КонецЕсли;
		
		ТаблицаПоискаОбъектов = Новый ТаблицаЗначений;
		ТаблицаПоискаОбъектов.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка"));
		ТаблицаПоискаОбъектов.Колонки.Добавить("СтрокаПоиска", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(300)));
		
		Для Каждого СтрокаПоиска Из МассивСтрокПоиска Цикл
			СтрокаПоискаОбъектов = ТаблицаПоискаОбъектов.Добавить();
			СтрокаПоискаОбъектов.Штрихкод = СтрокаПоиска;
			СтрокаПоискаОбъектов.СтрокаПоиска = СтрокаПоиска;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ОбработчикПередПоискомОбъектов) Тогда
			ВыполнитьОбработчикПередПоискомОбъектов(ТаблицаПоискаОбъектов);
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПоискаОбъектов.Штрихкод КАК Штрихкод,
		|	ТаблицаПоискаОбъектов.СтрокаПоиска КАК СтрокаПоиска
		|ПОМЕСТИТЬ ТаблицаПоискаОбъектов
		|ИЗ
		|	&ТаблицаПоискаОбъектов КАК ТаблицаПоискаОбъектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПоискаОбъектов.Штрихкод КАК СтрокаПоиска,
		|	&ПоляОбъектов КАК Объект
		|ИЗ
		|	ТаблицаПоискаОбъектов КАК ТаблицаПоискаОбъектов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_ПравилаПоискаОбъектов КАК ТаблицаИБ
		|		ПО ТаблицаПоискаОбъектов.СтрокаПоиска = ТаблицаИБ.Наименование";
		
		Если ЗначениеЗаполнено(ДопОтборы) Тогда
			Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	" + ДопОтборы;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ТаблицаПоискаОбъектов", ТаблицаПоискаОбъектов);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.вмс_ПравилаПоискаОбъектов", ИмяТаблицыДанныхИБ);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаИБ.Наименование", "ТаблицаИБ." + ИмяРеквизитаПоиска);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляОбъектов КАК Объект", ПоляОбъектовДляЗапроса);
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
		
		ТаблицаЗапроса.Колонки.Добавить("НомерОбъекта");
		НомерОбъекта = 1;
		Для Каждого СтрокаЗапроса Из ТаблицаЗапроса Цикл
			СтрокаЗапроса.НомерОбъекта = НомерОбъекта;
			НомерОбъекта = НомерОбъекта + 1;
		КонецЦикла;

		
		Для Каждого СтрокаПолучаемогоОбъекта Из ТаблицаПолучаемыеОбъекты Цикл
			ТипОбъекта = СтрокаПолучаемогоОбъекта.ТипОбъекта;
			ИмяТипаОбъекта = СтрокаПолучаемогоОбъекта.ИмяТипаОбъекта;  
			
			Для Каждого СтрокаЗапроса Из ТаблицаЗапроса Цикл
				СтрокаОбъекта = ТаблицаОбъектов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаОбъекта, СтрокаЗапроса);
				СтрокаОбъекта.Объект = СтрокаЗапроса[СтрокаПолучаемогоОбъекта.ИмяРеквизитаОбъекта];
				СтрокаОбъекта.ТипОбъекта = ТипОбъекта;
				СтрокаОбъекта.ИмяТипаОбъекта = ИмяТипаОбъекта; 
			КонецЦикла; 		
			
		КонецЦикла;  
		
	КонецЕсли;
	
	Возврат ТаблицаОбъектов;
	
КонецФункции

Функция ВыполнитьОбработчикПередПоискомОбъектов(ТаблицаПоискаОбъектов)
	
	Выполнить(ОбработчикПередПоискомОбъектов);
	
КонецФункции

Функция НайтиШтрихкодыОбъектов(ТаблицаПоискаОбъектов) Экспорт
	
	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ТаблицаОбъектов.Колонки.Добавить("Штрихкод");
	ТаблицаОбъектов.Колонки.Добавить("Объект");
	ТаблицаОбъектов.Колонки.Добавить("ТипОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("ИмяТипаОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("НомерОбъекта");
	
	Запрос = Новый Запрос;
	
	ПоляОбъектовМассив = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаПоискаОбъектов.Колонки, "Имя");
	ПоляОбъектовТаблицыПоиска = "";
	ПоляОбъектовТаблицыПоискаСПсевдонимами = "";
	ПоляОбъектовТаблицыИБ = "";
	ПоляОбъектовТаблицыИБСПсевдонимами = "";
	ПоляПоискаОбъектов = "";
	Связка = ", ";
	НомерПараметраЗначенияПоУмолчанию = 1;
	Для Каждого СтрокаПолучаемогоПоПравилуОбъекта Из ПолучаемыеОбъекты Цикл
		ПолеОбъекта = СтрокаПолучаемогоПоПравилуОбъекта.ИмяРеквизитаОбъекта;
		ЕстьПолеПоиска = ПоляОбъектовМассив.Найти(ПолеОбъекта) <> Неопределено;
		ИскатьШтрихкодПоПолю = НЕ СтрокаПолучаемогоПоПравилуОбъекта.НеИскатьШтрихкод И ЕстьПолеПоиска;

		///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		Если ИскатьШтрихкодПоПолю Тогда
			СтрокаПоляОбъекта = "ТаблицаПоиска." + ПолеОбъекта;
			ПоляОбъектовТаблицыПоиска = ПоляОбъектовТаблицыПоиска + Связка + СтрокаПоляОбъекта;
			ПоляОбъектовТаблицыПоискаСПсевдонимами = ПоляОбъектовТаблицыПоискаСПсевдонимами + Связка + СтрокаПоляОбъекта + " КАК " + ПолеОбъекта;
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		Если СтрокаПолучаемогоПоПравилуОбъекта.ИспользоватьЗначениеПоУмолчанию Тогда
			ИмяПараметраЗначенияПоУмолчанию = "ЗначениеОбъектаПоУмолчанию" + Формат(НомерПараметраЗначенияПоУмолчанию, "ЧГ=0");
			Запрос.УстановитьПараметр(ИмяПараметраЗначенияПоУмолчанию, СтрокаПолучаемогоПоПравилуОбъекта.ЗначениеПоУмолчанию);
			СтрокаПоляОбъекта = "&" + ИмяПараметраЗначенияПоУмолчанию;
			НомерПараметраЗначенияПоУмолчанию = НомерПараметраЗначенияПоУмолчанию + 1;
		Иначе
			СтрокаПоляОбъекта = "ТаблицаИБ." + ПолеОбъекта;
		КонецЕсли;
		
		Если ИскатьШтрихкодПоПолю Тогда
			ПоляПоискаОбъектов = ПоляПоискаОбъектов + Связка + СтрокаПоляОбъекта;
		КонецЕсли;

		ПоляОбъектовТаблицыИБ = ПоляОбъектовТаблицыИБ + Связка + СтрокаПоляОбъекта;
		ПоляОбъектовТаблицыИБСПсевдонимами = ПоляОбъектовТаблицыИБСПсевдонимами + Связка + СтрокаПоляОбъекта + " КАК " + ПолеОбъекта;
	КонецЦикла;
	
	Если ПоляОбъектовТаблицыИБ="" ИЛИ ПоляПоискаОбъектов="" Тогда
		// не указаны необходимые поля
		Возврат ТаблицаОбъектов;
	КонецЕсли;

	ДлинаСвязки = СтрДлина(Связка);
	ПоляОбъектовТаблицыПоиска = Прав(ПоляОбъектовТаблицыПоиска, СтрДлина(ПоляОбъектовТаблицыПоиска)-ДлинаСвязки);
	ПоляОбъектовТаблицыПоискаСПсевдонимами = Прав(ПоляОбъектовТаблицыПоискаСПсевдонимами, СтрДлина(ПоляОбъектовТаблицыПоискаСПсевдонимами)-ДлинаСвязки);
	ПоляОбъектовТаблицыИБ = Прав(ПоляОбъектовТаблицыИБ, СтрДлина(ПоляОбъектовТаблицыИБ)-ДлинаСвязки);
	ПоляОбъектовТаблицыИБСПсевдонимами = Прав(ПоляОбъектовТаблицыИБСПсевдонимами, СтрДлина(ПоляОбъектовТаблицыИБСПсевдонимами)-ДлинаСвязки);
	ПоляПоискаОбъектов = Прав(ПоляПоискаОбъектов, СтрДлина(ПоляПоискаОбъектов)-ДлинаСвязки);
	
	ТаблицаПоискаОбъектов = ТаблицаПоискаОбъектов.Скопировать();
	вмс_РаботаСКоллекциями.ТипизироватьТаблицуЗначений(ТаблицаПоискаОбъектов);
	
	Запрос.УстановитьПараметр("ТаблицаПоиска", ТаблицаПоискаОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ПоляОбъектовТаблицыПоискаСПсевдонимами КАК Объект
	|ПОМЕСТИТЬ ТаблицаПоиска
	|ИЗ
	|	&ТаблицаПоиска КАК ТаблицаПоиска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПоляОбъектовТаблицыИБСПсевдонимами КАК Объект,
	|	ТаблицаИБ.Наименование КАК Штрихкод
	|ИЗ
	|	Справочник.вмс_ПравилаПоискаОбъектов КАК ТаблицаИБ
	|ГДЕ
	|	(&ПоляПоискаОбъектов) В
	|			(ВЫБРАТЬ
	|				&ПоляОбъектовТаблицыПоискаСПсевдонимами КАК Объект
	|			ИЗ
	|				ТаблицаПоиска)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.вмс_ПравилаПоискаОбъектов", ИмяТаблицыДанныхИБ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаИБ.Наименование", "ТаблицаИБ." + ИмяРеквизитаПоиска);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляОбъектовТаблицыПоискаСПсевдонимами КАК Объект", ПоляОбъектовТаблицыПоискаСПсевдонимами);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляОбъектовТаблицыИБСПсевдонимами КАК Объект", ПоляОбъектовТаблицыИБСПсевдонимами);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляОбъектовТаблицыИБ", ПоляОбъектовТаблицыИБ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляПоискаОбъектов", ПоляПоискаОбъектов);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	ТаблицаШтрихкодовЗапроса = ТаблицаЗапроса.Скопировать();
	ТаблицаШтрихкодовЗапроса.Свернуть("Штрихкод");
	
	ТаблицаЗапроса.Колонки.Добавить("НомерОбъекта");
	Для каждого СтрокаШтрихкода Из ТаблицаШтрихкодовЗапроса Цикл
		НомерОбъекта = 1;
		Для каждого СтрокаЗапроса Из ТаблицаЗапроса.НайтиСтроки(Новый Структура("Штрихкод", СтрокаШтрихкода.Штрихкод)) Цикл
			СтрокаЗапроса.НомерОбъекта = НомерОбъекта;
			НомерОбъекта = НомерОбъекта + 1;
		КонецЦикла; 
	КонецЦикла; 

	ТаблицаПолучаемыеОбъекты = ПолучаемыеОбъекты.Выгрузить();
	вмс_ОбщегоНазначенияСервер.ДополнитьТаблицуРеквизитамиОбъектов(ТаблицаПолучаемыеОбъекты, "ТипОбъекта", "Наименование");
	ТаблицаПолучаемыеОбъекты.Колонки.ТипОбъектаНаименование.Имя = "ИмяТипаОбъекта";
	
	Для Каждого СтрокаПолучаемогоПоПравилуОбъекта Из ТаблицаПолучаемыеОбъекты Цикл
		ПолеОбъекта = СтрокаПолучаемогоПоПравилуОбъекта.ИмяРеквизитаОбъекта;
		ТипОбъекта = СтрокаПолучаемогоПоПравилуОбъекта.ТипОбъекта;
		ИмяТипаОбъекта = СтрокаПолучаемогоПоПравилуОбъекта.ИмяТипаОбъекта;
		Для Каждого СтрокаЗапроса Из ТаблицаЗапроса Цикл
			СтрокаОбъекта = ТаблицаОбъектов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОбъекта, СтрокаЗапроса);
			СтрокаОбъекта.Объект = СтрокаЗапроса[ПолеОбъекта];
			СтрокаОбъекта.ТипОбъекта = ТипОбъекта;
			СтрокаОбъекта.ИмяТипаОбъекта = ИмяТипаОбъекта;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаОбъектов;
	
КонецФункции

#Иначе

#КонецЕсли