Функция ЗвукСигнал() Экспорт
	
	Возврат ПроигратьЗвукСхемы("Сигнал");
	
КонецФункции

Функция ЗвукОшибка() Экспорт
	
	Возврат ПроигратьЗвукСхемы("Ошибка");
	
КонецФункции

Функция ЗвукНераспознано() Экспорт
	
	Возврат ПроигратьЗвукСхемы("Нераспознано");
	
КонецФункции

Функция ЗвукЗавершение() Экспорт
	
	Возврат ПроигратьЗвукСхемы("Завершение");
	
КонецФункции

Функция ПроигратьЗвукСхемы(Звук) Экспорт
	
	ИмяЗвуковойСхемы = вмс_ПараметрыПриложения["ИмяЗвуковойСхемы"];
	Если ЗначениеЗаполнено(ИмяЗвуковойСхемы) Тогда
		Возврат ПроигратьЗвук(ИмяЗвуковойСхемы + "\" + Звук);
	КонецЕсли;
	
КонецФункции

Функция ПроигратьЗвук(Звук, ПрерватьПредыдущийЗвук=Истина) Экспорт
	
	ДанныеЗвука = вмс_РаботаСоЗвуком.ПолучитьЗвук(ПодсистемаЗвука(), Звук);
	ПроигратьПодготовленныйЗвук(ДанныеЗвука, ПрерватьПредыдущийЗвук);

КонецФункции

Функция ПроигратьПодготовленныйЗвук(ДанныеЗвука, ПрерватьПредыдущийЗвук)
	
	ПодсистемаЗвука = ПодсистемаЗвука();
	
	#Если МобильноеПриложениеКлиент Тогда
		Если ПоддерживаетсяФункциональностьМобильногоПриложения(ФункциональностьМобильногоПриложения.ВоспроизведениеАудиоИВибрация) Тогда
			Если ДанныеЗвука <> Неопределено И ДанныеЗвука.ДанныеМультимедиа <> Неопределено Тогда
				Если ПрерватьПредыдущийЗвук Тогда
					ПодсистемаЗвука.ЗвукВоспроизводится = Ложь;
					ПодсистемаЗвука.ОчередьВоспроизведения.Очистить();
				Иначе
					Если ПодсистемаЗвука.ЗвукВоспроизводится Тогда
						ПодсистемаЗвука.ОчередьВоспроизведения.Добавить(ДанныеЗвука);
						Возврат Истина;
					КонецЕсли;
				КонецЕсли;
				
				ПодсистемаЗвука.ЗвукВоспроизводится = Истина;
				СредстваМультимедиа.ВоспроизвестиАудио(ДанныеЗвука.ДанныеМультимедиа, 0, Новый ОписаниеОповещения("ОбработчикПрерыванияВоспроизведения", вмс_РаботаСоЗвукомКлиент), Истина);
			КонецЕсли;	
		КонецЕсли;
	#Иначе
		Попытка
			spVoice = ПодсистемаЗвука.spVoice;
			Если spVoice <> Неопределено Тогда
				SVSFlagsAsync = 1;
				SVSFPurgeBeforeSpeak = 2;
				SVSFIsFilename = 4;
				
				SpeakFlags = SVSFlagsAsync;
				Если ПрерватьПредыдущийЗвук Тогда
					SpeakFlags = SpeakFlags + SVSFPurgeBeforeSpeak;
				КонецЕсли;
				
				Если ДанныеЗвука <> Неопределено И ДанныеЗвука.spmStream <> Неопределено Тогда
					spVoice.SpeakStream(ДанныеЗвука.spmStream, SpeakFlags);
				КонецЕсли;
			Иначе
				Сигнал();
			КонецЕсли;	
		Исключение
			Сигнал();
		КонецПопытки;
		
	#КонецЕсли
	
КонецФункции

Функция ОбработчикПрерыванияВоспроизведения(ТекущаяПозиция, ДополнительныеПараметры) Экспорт

	ПодсистемаЗвука = ПодсистемаЗвука();
	ПодсистемаЗвука.ЗвукВоспроизводится = Ложь;
	
	Если ПодсистемаЗвука.ОчередьВоспроизведения.Количество() > 0 Тогда
		ДанныеЗвука = ПодсистемаЗвука.ОчередьВоспроизведения[0];
		ПодсистемаЗвука.ОчередьВоспроизведения.Удалить(0);
		ПроигратьПодготовленныйЗвук(ДанныеЗвука, Ложь);
	КонецЕсли;
	
КонецФункции

Функция ЗакэшироватьЗвуки(Звуки) Экспорт
	
	Возврат вмс_РаботаСоЗвуком.ЗакэшироватьЗвуки(ПодсистемаЗвука(), Звуки);
	
КонецФункции

Функция ПодсистемаЗвука()

	ПодсистемаЗвука = вмс_ПараметрыПриложения["ПодсистемаЗвука"];

	Если ПодсистемаЗвука=Неопределено Тогда
		ПодсистемаЗвука = вмс_РаботаСоЗвуком.НоваяПодсистемаЗвука();
		вмс_ПараметрыПриложения["ПодсистемаЗвука"] = ПодсистемаЗвука;
	КонецЕсли;
	
	Возврат ПодсистемаЗвука;
	
КонецФункции
