// ******************************************************************
// { Адаптация

Функция глПолучитьОбщиеМодули(ИменаМодулей)
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ПолучитьОбщиеМодули(ИменаМодулей);
	
КонецФункции

Функция глОбщийМодуль(ИмяМодуля)
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
	
КонецФункции

Функция ЗдесьОстановиПоБратски()
	
	ТочкаОстановы = 1;
	
	Возврат ТочкаОстановы;
	
КонецФункции

// } Адаптация
// ******************************************************************

Функция НовыйПроцессорУправленияОстатками() Экспорт
	
	ОбщиеМодули = глПолучитьОбщиеМодули("РаботаСКоллекциями, ОперацииПоЯчейкамКлиентСервер, ОбщегоНазначенияВызовСервера, ОперацииПоЯчейкамВызовСервера, УправлениеОстаткамиВызовСервера, УправлениеОстаткамиАдаптация");
	РК = ОбщиеМодули.РаботаСКоллекциями;
	
	ТоварныеПоляМассив = ОбщиеМодули.ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля();
	ТоварныеПоля = РК.МассивВСтроку(ТоварныеПоляМассив);
	
	// Кулалаев. BOX-57 В процессоре упаковки исключены
	Если ТоварныеПоляМассив.Найти("Упаковка") <> Неопределено Тогда
		РК.УдалитьЭлементыКоллекции(ТоварныеПоляМассив, "Упаковка");
		ТоварныеПоля = РК.МассивВСтроку(ТоварныеПоляМассив);
	КонецЕсли;
	
	ПоляТаблицыТоваров = "Ячейка, КонтейнерВерхнегоУровня, МастерКонтейнер, Уровень, Контейнер, %ТОВАРНЫЕПОЛЯ%, СвязанныйТовар, ИтогПоИерархии, ИсходноеКоличество, Количество";
	ПоляТаблицыТоваров = СтрЗаменить(ПоляТаблицыТоваров, "%ТОВАРНЫЕПОЛЯ%", ТоварныеПоля);
	ТаблицаТоваров = РК.НоваяКвазиТаблицаЗначений(ПоляТаблицыТоваров);
	РК.ДобавитьИндексыКвазиТаблицыЗначений(ТаблицаТоваров, "СвязанныйТовар, Контейнер");
	РК.ДобавитьИндексыКвазиТаблицыЗначений(ТаблицаТоваров, "МастерКонтейнер");
	
	ПоляТаблицыКонтейнеров = "Ячейка, КонтейнерВерхнегоУровня, МастерКонтейнер, Уровень, Контейнер, ПолныеДанные, ИсходноеКоличество, Количество, ОсновныеДанныеКонтейнера, СтрокиИтогов, СтрокиОтклонений, СтрокиОбщихИтогов, ДополнительныеДанные";
	ТаблицаКонтейнеров = РК.НоваяКвазиТаблицаЗначений(ПоляТаблицыКонтейнеров);
	РК.ДобавитьИндексыКвазиТаблицыЗначений(ТаблицаКонтейнеров, "МастерКонтейнер");
	РК.ДобавитьИндексыКвазиТаблицыЗначений(ТаблицаКонтейнеров, "Контейнер");
	
	ГруппировочныеПоляТаблицыОбщихИтоговПоТоварам = "Ячейка, Контейнер, " + ТоварныеПоля;
	ПоляТаблицыОбщихИтоговПоТоварам = ГруппировочныеПоляТаблицыОбщихИтоговПоТоварам + ", Количество, КоличествоНераспределено";
	ТаблицаОбщихИтоговПоТоварам = РК.НоваяКвазиТаблицаЗначений(ПоляТаблицыОбщихИтоговПоТоварам);
	РК.ДобавитьИндексыКвазиТаблицыЗначений(ТаблицаОбщихИтоговПоТоварам, ГруппировочныеПоляТаблицыОбщихИтоговПоТоварам);
	
	ПоляТаблицыОстатков = "";
	ПоляТаблицыОстатков = ПоляТаблицыОстатков + "ИдентификаторЭлемента, Объект, ТипОбъекта, Место";
	ПоляТаблицыОстатков = ПоляТаблицыОстатков + ", " + ТоварныеПоля;
	ПоляТаблицыОстатков = ПоляТаблицыОстатков + ", Количество, НачальноеКоличество, ЭтоОбщийИтог";
	ТаблицаОстатков = РК.НоваяКоллекцияЗначений(ПоляТаблицыОстатков, "КвазиТаблицаЗначений");
	
	Процессор = Новый Структура;
	Процессор.Вставить("ТаблицаОстатков", ТаблицаОстатков);
	Процессор.Вставить("ТаблицаТоваров", ТаблицаТоваров);
	Процессор.Вставить("ТаблицаКонтейнеров", ТаблицаКонтейнеров);
	Процессор.Вставить("ТаблицаОбщихИтоговПоТоварам", ТаблицаОбщихИтоговПоТоварам);
	Процессор.Вставить("ПустаяЯчейка", ПредопределенноеЗначение("Справочник.вмс_МестаХранения.ПустаяСсылка"));
	Процессор.Вставить("ПустойКонтейнер", ПредопределенноеЗначение("Справочник.вмс_Контейнеры.ПустаяСсылка"));
	Процессор.Вставить("ПустойТовар", ОбщиеМодули.ОбщегоНазначенияВызовСервера.ПолучитьПустуюСсылкуНаТовар());
	Процессор.Вставить("ТипКонтейнер", Тип("СправочникСсылка.вмс_Контейнеры"));
	Процессор.Вставить("ТипЯчейка", Тип("СправочникСсылка.вмс_МестаХранения"));
	Процессор.Вставить("ТипЧисло", Тип("Число"));
	Процессор.Вставить("СуперКонтейнер", Процессор.ПустойКонтейнер);
	Процессор.Вставить("ПоляИтогов", "ИсходноеКоличество, Количество");
	Процессор.Вставить("ДанныеКонтейнеров", Новый Соответствие);
	Процессор.Вставить("РазрешитьОтрицательныеОстатки", Ложь);
	Процессор.Вставить("ОбщиеМодули", ОбщиеМодули);
	Процессор.Вставить("ТоварныеПоляМассив", ТоварныеПоляМассив);
	Процессор.Вставить("ТоварныеПоля", ТоварныеПоля);
	Процессор.Вставить("ТекущиеДокументы");
	Процессор.Вставить("ДатаПолученияОстатков");
	
	Возврат Процессор;
	
КонецФункции

Функция Очистить(Процессор) Экспорт   
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	РК.УдалитьСтрокиКвазиТаблицыЗначений(Процессор.ТаблицаТоваров);
	РК.УдалитьСтрокиКвазиТаблицыЗначений(Процессор.ТаблицаКонтейнеров);
	РК.УдалитьСтрокиКвазиТаблицыЗначений(Процессор.ТаблицаОбщихИтоговПоТоварам);
	Процессор.ДанныеКонтейнеров.Очистить();
	
КонецФункции

Функция Загрузить(Процессор, ТаблицаОстатковВЯчейках, ТаблицаСоставовКонтейнеровДляЗагрузки = Неопределено) Экспорт
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ОчиститьЗаписиКонтейнеровПоТаблицеСоставовКонтейнеров(Процессор, ТаблицаСоставовКонтейнеровДляЗагрузки);
	ЗагрузитьТаблицуТоваров(Процессор, ТаблицаОстатковВЯчейках);
	
	///////////////////////////////////////////////////////////////////////////////////////////////
	Если ТаблицаСоставовКонтейнеровДляЗагрузки <> Неопределено Тогда
		Если Не РаботаСКоллекциями.ПроверитьЕстьИндексКоллекции(ТаблицаСоставовКонтейнеровДляЗагрузки, "Контейнер") Тогда
			РаботаСКоллекциями.ДобавитьИндексКоллекции(ТаблицаСоставовКонтейнеровДляЗагрузки, "Контейнер");
		КонецЕсли;
		
		ЗагрузитьТаблицуСоставовКонтейнеров(Процессор, ТаблицаСоставовКонтейнеровДляЗагрузки, ТаблицаОстатковВЯчейках);
		
		КонтейнерыДляОбновления = РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(РаботаСКоллекциями.ПолучитьЭлементыКоллекции(ТаблицаСоставовКонтейнеровДляЗагрузки), "Контейнер");
	КонецЕсли;
	
	ОбновитьТаблицы(Процессор, КонтейнерыДляОбновления);
	
	ЗагрузитьНовая(ТаблицаОстатковВЯчейках);
	
КонецФункции

Функция ЗагрузитьНовая(Таблица)
	
	
	
КонецФункции

Функция ОчиститьЗаписиКонтейнера(Процессор, Контейнер) Экспорт
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ДанныеКонтейнеров = Процессор.ДанныеКонтейнеров;
	ТаблицаТоваров = Процессор.ТаблицаТоваров;
	ТаблицаКонтейнеров = Процессор.ТаблицаКонтейнеров;
	ТаблицаОбщихИтоговПоТоварам = Процессор.ТаблицаОбщихИтоговПоТоварам;
	
	СтрокиКонтейнеров = РаботаСКоллекциями.НайтиЭлементыКоллекции(ТаблицаКонтейнеров, Новый Структура("Контейнер", Контейнер));
	Для Каждого СтрокаКонтейнера Из СтрокиКонтейнеров Цикл
		ТекущийКонтейнер = СтрокаКонтейнера.Контейнер;
		
		СтрокиТоваровКонтейнера = РаботаСКоллекциями.НайтиЭлементыКоллекции(ТаблицаТоваров, Новый Структура("Контейнер", ТекущийКонтейнер));
		РаботаСКоллекциями.УдалитьЭлементыКоллекции(ТаблицаТоваров, СтрокиТоваровКонтейнера);
		
		СтрокиОбщихИтоговПоТоварамКонтейнера = РаботаСКоллекциями.НайтиЭлементыКоллекции(ТаблицаОбщихИтоговПоТоварам, Новый Структура("Контейнер", ТекущийКонтейнер));
		РаботаСКоллекциями.УдалитьЭлементыКоллекции(ТаблицаОбщихИтоговПоТоварам, СтрокиОбщихИтоговПоТоварамКонтейнера);
		
		СтрокиКонтейнера = РаботаСКоллекциями.НайтиЭлементыКоллекции(ТаблицаКонтейнеров, Новый Структура("МастерКонтейнер", ТекущийКонтейнер));
		РаботаСКоллекциями.ДобавитьЭлементыКоллекции(СтрокиКонтейнеров, СтрокиКонтейнера);
		ДанныеКонтейнеров.Удалить(ТекущийКонтейнер);
	КонецЦикла;
	
	РаботаСКоллекциями.УдалитьЭлементыКоллекции(ТаблицаКонтейнеров, СтрокиКонтейнеров);
	
КонецФункции

Функция ОбновитьТаблицы(Процессор, КонтейнерыДляОбновления=Неопределено) Экспорт
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ТаблицаТоваров = Процессор.ТаблицаТоваров;
	ТаблицаКонтейнеров = Процессор.ТаблицаКонтейнеров;
	
	// добавление товаров для промежуточных контейнеров
	ОбновитьИтогиПоИерархииКонтейнеров(Процессор, КонтейнерыДляОбновления, Ложь);
	
	РаботаСКоллекциями.СортироватьКвазиТаблицуЗначений(ТаблицаКонтейнеров, "Уровень");
	
	///////////////////////////////////////////////////////////////////////////////////////////////
	РаботаСКоллекциями.СортироватьКвазиТаблицуЗначений(ТаблицаТоваров, "Уровень");
	
КонецФункции

Функция ЗагрузитьТаблицуТоваров(Процессор, ТаблицаТоваровДляЗагрузки) Экспорт
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	СуперКонтейнер = Процессор.СуперКонтейнер;
	ДанныеКонтейнеров = Процессор.ДанныеКонтейнеров;
	ТаблицаТоваров = Процессор.ТаблицаТоваров;
	ТаблицаКонтейнеров = Процессор.ТаблицаКонтейнеров;
	ТаблицаОбщихИтоговПоТоварам = Процессор.ТаблицаОбщихИтоговПоТоварам;
	ТоварныеПоляМассив = Процессор.ТоварныеПоляМассив;
	
	НовыеСтрокиКонтейнеров = Новый Массив;
	
	ПоляСтроки = Новый Структура("Ячейка, Контейнер, " + Процессор.ТоварныеПоля);
	СтрокиТоваровДляЗагрузки = РК.ПолучитьЭлементыКоллекции(ТаблицаТоваровДляЗагрузки);
	Для Каждого СтрокаТовараДляЗагрузки Из СтрокиТоваровДляЗагрузки Цикл
		Ячейка = СтрокаТовараДляЗагрузки.Ячейка;
		Контейнер = СтрокаТовараДляЗагрузки.Контейнер;
		ЭтоПустойКонтейнер = Контейнер = ПустойКонтейнер;
		
		ПоляСтроки.Ячейка = Ячейка;
		ПоляСтроки.Контейнер = Контейнер;
		Для Каждого ИмяПоля Из ТоварныеПоляМассив Цикл
			ПоляСтроки[ИмяПоля] = СтрокаТовараДляЗагрузки[ИмяПоля];
		КонецЦикла;
		
		Если ЭтоПустойКонтейнер Тогда
			СтрокаТовара = РК.НайтиЭлементКоллекции(ТаблицаТоваров, ПоляСтроки);
			Если СтрокаТовара = Неопределено Тогда
				СтрокаТовара = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаТоваров);
				ЗаполнитьЗначенияСвойств(СтрокаТовара, ПоляСтроки);
			КонецЕсли;
			
			СтрокаТовара.КонтейнерВерхнегоУровня = ПустойКонтейнер;
			СтрокаТовара.МастерКонтейнер = СуперКонтейнер;
			СтрокаТовара.СвязанныйТовар = 0;
			СтрокаТовара.ИтогПоИерархии = 0;
			СтрокаТовара.Количество = СтрокаТовараДляЗагрузки.Количество;
			СтрокаТовара.ИсходноеКоличество = СтрокаТовара.Количество;
			СтрокаТовара.Уровень = 0;
			РК.ИндексироватьСтрокиКвазиТаблицы(ТаблицаТоваров, СтрокаТовара);
		Иначе
			СтрокаКонтейнера = ДанныеКонтейнеров[Контейнер];
			Если СтрокаКонтейнера = Неопределено ИЛИ Не СтрокаКонтейнера.ОсновныеДанныеКонтейнера Тогда
				СтрокаКонтейнера = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаКонтейнеров);
				СтрокаКонтейнера.Ячейка = Ячейка;
				СтрокаКонтейнера.КонтейнерВерхнегоУровня = Контейнер;
				СтрокаКонтейнера.МастерКонтейнер = СуперКонтейнер;
				СтрокаКонтейнера.Контейнер = Контейнер;
				СтрокаКонтейнера.ПолныеДанные = Ложь;
				СтрокаКонтейнера.ОсновныеДанныеКонтейнера = Истина;
				СтрокаКонтейнера.Уровень = 0;
				СтрокаКонтейнера.Количество = 1;
				СтрокаКонтейнера.СтрокиОбщихИтогов = Новый Массив;
				НовыеСтрокиКонтейнеров.Добавить(СтрокаКонтейнера);
				ДанныеКонтейнеров[Контейнер] = СтрокаКонтейнера;
			КонецЕсли;
			
			СтрокаОбщегоИтогаПоТоваруКонтейнера = РК.НайтиЭлементКоллекции(ТаблицаОбщихИтоговПоТоварам, ПоляСтроки);
			Если СтрокаОбщегоИтогаПоТоваруКонтейнера = Неопределено Тогда
				СтрокаОбщегоИтогаПоТоваруКонтейнера = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаОбщихИтоговПоТоварам);
				ЗаполнитьЗначенияСвойств(СтрокаОбщегоИтогаПоТоваруКонтейнера, ПоляСтроки);
				СтрокаКонтейнера.СтрокиОбщихИтогов.Добавить(СтрокаОбщегоИтогаПоТоваруКонтейнера);
			КонецЕсли;
			СтрокаОбщегоИтогаПоТоваруКонтейнера.Количество = СтрокаТовараДляЗагрузки.Количество;
			РК.ИндексироватьСтрокиКвазиТаблицы(ТаблицаОбщихИтоговПоТоварам, СтрокаОбщегоИтогаПоТоваруКонтейнера);
		КонецЕсли;
		
	КонецЦикла;
	
	ИнициализироватьСтрокиКонтейнеров(Процессор, НовыеСтрокиКонтейнеров);
	РК.ИндексироватьСтрокиКвазиТаблицы(ТаблицаКонтейнеров, НовыеСтрокиКонтейнеров);
	
	
КонецФункции

Функция ЗагрузитьТаблицуСоставовКонтейнеров(Процессор, ТаблицаСоставовКонтейнеровДляЗагрузки, ТаблицаОстатков=Неопределено) Экспорт
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ЗдесьОстановиПоБратски();
	
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	ПустаяЯчейка = Процессор.ПустаяЯчейка;
	ТипКонтейнер = Процессор.ТипКонтейнер;
	СуперКонтейнер = Процессор.СуперКонтейнер;
	ДанныеКонтейнеров = Процессор.ДанныеКонтейнеров;
	ТаблицаТоваров = Процессор.ТаблицаТоваров;
	ТаблицаКонтейнеров = Процессор.ТаблицаКонтейнеров;
	ТаблицаОбщихИтоговПоТоварам = Процессор.ТаблицаОбщихИтоговПоТоварам;
	ТоварныеПоля = Процессор.ТоварныеПоля;
	
	Для Каждого СтрокаОбщегоИтога Из ТаблицаОбщихИтоговПоТоварам.Строки Цикл
		СтрокаОбщегоИтога.КоличествоНераспределено = СтрокаОбщегоИтога.Количество;
	КонецЦикла;
	
	НовыеСтрокиКонтейнеров = Новый Массив;
	
	СтрокиСоставовКонтейнеровДляЗагрузки = РК.ПолучитьЭлементыКоллекции(ТаблицаСоставовКонтейнеровДляЗагрузки);
	Для Каждого СтрокаСоставаКонтейнераДляЗагрузки Из СтрокиСоставовКонтейнеровДляЗагрузки Цикл
		
		МастерКонтейнер = СтрокаСоставаКонтейнераДляЗагрузки.Контейнер;
		Если МастерКонтейнер = СуперКонтейнер Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеМастерКонтейнера = ДанныеКонтейнеров[МастерКонтейнер];
		Если ДанныеМастерКонтейнера = Неопределено Тогда
			Ячейка = ПустаяЯчейка;
			Если ТаблицаОстатков <> Неопределено Тогда
				СтрокаОстатка = РК.НайтиЭлементКоллекции(ТаблицаОстатков, Новый Структура("Контейнер", МастерКонтейнер));
				Если СтрокаОстатка <> Неопределено Тогда
					Ячейка = СтрокаОстатка.Ячейка;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаКонтейнера = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаКонтейнеров);
			СтрокаКонтейнера.Ячейка = Ячейка;
			СтрокаКонтейнера.КонтейнерВерхнегоУровня = МастерКонтейнер;
			СтрокаКонтейнера.МастерКонтейнер = СуперКонтейнер;
			СтрокаКонтейнера.Контейнер = МастерКонтейнер;
			СтрокаКонтейнера.ПолныеДанные = Ложь;
			СтрокаКонтейнера.ОсновныеДанныеКонтейнера = Истина;
			СтрокаКонтейнера.Уровень = 0;
			СтрокаКонтейнера.СтрокиОбщихИтогов = Новый Массив;
			СтрокаКонтейнера.Количество = 1;
			НовыеСтрокиКонтейнеров.Добавить(СтрокаКонтейнера);
			РК.ИндексироватьСтрокиКвазиТаблицы(ТаблицаКонтейнеров, СтрокаКонтейнера);
			ДанныеКонтейнеров[МастерКонтейнер] = СтрокаКонтейнера;
			ДанныеМастерКонтейнера = СтрокаКонтейнера;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаСоставаКонтейнераДляЗагрузки.Товар) = ТипКонтейнер Тогда
			
			// добавление контейнера
			ПолнаяЗагрузка = СтрокаСоставаКонтейнераДляЗагрузки.ПолныеДанные;
			Контейнер = СтрокаСоставаКонтейнераДляЗагрузки.Товар;
			
			СтрокиКонтейнера = РК.НайтиЭлементыКоллекции(ТаблицаКонтейнеров, Новый Структура("Контейнер", Контейнер));
			НайденнаяСтрокаКонтейнера = Неопределено;
			СтрокаКонтейнера = Неопределено;
			Для Каждого НайденнаяСтрокаКонтейнера Из СтрокиКонтейнера Цикл
				Если ПолнаяЗагрузка Тогда
					НайденнаяСтрокаКонтейнера.ПолныеДанные = Истина;
				КонецЕсли;
				
				Если НайденнаяСтрокаКонтейнера.МастерКонтейнер = МастерКонтейнер Тогда
					СтрокаКонтейнера = НайденнаяСтрокаКонтейнера;
				КонецЕсли;
			КонецЦикла;
			
			Если СтрокаКонтейнера = Неопределено Тогда
				СтрокаКонтейнера = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаКонтейнеров);
				ЗаполнитьЗначенияСвойств(СтрокаКонтейнера, ДанныеМастерКонтейнера, "Ячейка, КонтейнерВерхнегоУровня");
				СтрокаКонтейнера.МастерКонтейнер = МастерКонтейнер;
				СтрокаКонтейнера.Контейнер = Контейнер;
				СтрокаКонтейнера.ОсновныеДанныеКонтейнера = Истина;
				СтрокаКонтейнера.Уровень = ДанныеМастерКонтейнера.Уровень + 1;
				СтрокаКонтейнера.ПолныеДанные = ПолнаяЗагрузка;
				Если НайденнаяСтрокаКонтейнера <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(СтрокаКонтейнера, НайденнаяСтрокаКонтейнера, "СтрокиИтогов, СтрокиОтклонений, СтрокиОбщихИтогов");
				Иначе
					СтрокаКонтейнера.СтрокиОбщихИтогов = Новый Массив;
				КонецЕсли;
				СтрокаКонтейнера.Количество = 1;
				НовыеСтрокиКонтейнеров.Добавить(СтрокаКонтейнера);
				ДанныеКонтейнеров[Контейнер] = СтрокаКонтейнера;
			КонецЕсли;
			
			СтрокаКонтейнера.Количество = СтрокаСоставаКонтейнераДляЗагрузки.КоличествоОстаток;
			
		Иначе
			
			/////////////////////////////////////
			//
			// Добавление товара
			//
			
			Отбор = Новый Структура("Контейнер, " + ТоварныеПоля);
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаСоставаКонтейнераДляЗагрузки);
			
			НайденныеСтроки = РК.НайтиЭлементыКоллекции(ТаблицаТоваров, Отбор);
			РК.УдалитьЭлементыКоллекции(ТаблицаТоваров, НайденныеСтроки);
			
			ДобавленныеСтроки = Новый Массив;
			КоличествоОстаток = СтрокаСоставаКонтейнераДляЗагрузки.КоличествоОстаток;
			
			Если КоличествоОстаток <> 0 Тогда
				//////////////////////////////////////////////
				// Распределение состава контейнера по ячейкам
				СтрокиОбщихИтоговПоКонтейнеру = ДанныеМастерКонтейнера.СтрокиОбщихИтогов;
				СтрокиОбщихИтоговПоТовару = РК.НайтиЭлементыКоллекции(СтрокиОбщихИтоговПоКонтейнеру, Отбор);
				Для Каждого СтрокаОбщегоИтогаПоТовару Из СтрокиОбщихИтоговПоТовару Цикл
					Если КоличествоОстаток <= 0 Тогда
						Прервать;
					КонецЕсли;
					
					КоличествоРаспределить = Мин(СтрокаОбщегоИтогаПоТовару.КоличествоНераспределено, КоличествоОстаток);
					Если КоличествоРаспределить = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаТовара = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаТоваров);
					ЗаполнитьЗначенияСвойств(СтрокаТовара, ДанныеМастерКонтейнера);
					ЗаполнитьЗначенияСвойств(СтрокаТовара, Отбор);
					СтрокаТовара.Ячейка = СтрокаОбщегоИтогаПоТовару.Ячейка;
					СтрокаТовара.Количество = КоличествоРаспределить;
					ДобавленныеСтроки.Добавить(СтрокаТовара);
					
					КоличествоОстаток = КоличествоОстаток - КоличествоРаспределить;
					СтрокаОбщегоИтогаПоТовару.КоличествоНераспределено = СтрокаОбщегоИтогаПоТовару.КоличествоНераспределено - КоличествоРаспределить;
				КонецЦикла;
				
				Если КоличествоОстаток <> 0 Тогда
					СтрокаТовара = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаТоваров);
					ЗаполнитьЗначенияСвойств(СтрокаТовара, ДанныеМастерКонтейнера);
					ЗаполнитьЗначенияСвойств(СтрокаТовара, Отбор);
					СтрокаТовара.Количество = КоличествоОстаток;
					ДобавленныеСтроки.Добавить(СтрокаТовара);
				КонецЕсли;
			КонецЕсли;
			
			Если ДобавленныеСтроки.Количество() > 0 Тогда
				Для Каждого СтрокаТовара Из ДобавленныеСтроки Цикл
					СтрокаТовара.ИсходноеКоличество = СтрокаТовара.Количество;
					СтрокаТовара.СвязанныйТовар = 0;
					СтрокаТовара.ИтогПоИерархии = 0;
				КонецЦикла;
				РК.ИндексироватьСтрокиКвазиТаблицы(ТаблицаТоваров, ДобавленныеСтроки);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ИнициализироватьСтрокиКонтейнеров(Процессор, НовыеСтрокиКонтейнеров);
	РК.ИндексироватьСтрокиКвазиТаблицы(ТаблицаКонтейнеров, НовыеСтрокиКонтейнеров);
	
КонецФункции

Функция УстановитьКоличествоТовара(Процессор, Товар, Количество, Контейнер=Неопределено, Ячейка=Неопределено) Экспорт
	
	СтрокаТовара = ПолучитьСтрокуТовара(Процессор, Товар, Количество, Контейнер, Ячейка);
	Если СтрокаТовара <> Неопределено Тогда
		СтрокаТовара.Количество = Количество;
	КонецЕсли;
	
КонецФункции

Функция УстановитьРасходТовара(Процессор, Товар, Количество, Контейнер=Неопределено, Ячейка=Неопределено) Экспорт
	
	СтрокаТовара = ПолучитьСтрокуТовара(Процессор, Товар, Количество, Контейнер, Ячейка);
	
	Если СтрокаТовара <> Неопределено Тогда
		НовоеКоличество = СтрокаТовара.ИсходноеКоличество - Количество;
		Если СтрокаТовара.Количество <> НовоеКоличество Тогда
			СтрокаТовара.Количество = НовоеКоличество;
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ОбновитьИтогиПоИерархииКонтейнеров(Процессор, КонтейнерыДляОбновления=Неопределено, знач НужноУпорядочить=Неопределено) Экспорт
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ТаблицаТоваров = Процессор.ТаблицаТоваров;
	ТаблицаКонтейнеров = Процессор.ТаблицаКонтейнеров;
	ПоляИтогов = Процессор.ПоляИтогов;
	ТоварныеПоля = Процессор.ТоварныеПоля;
	
	МассивДанныхКонтейнеров = ПолучитьИерархиюКонтейнеров(Процессор, КонтейнерыДляОбновления);
	РаботаСКоллекциями.СортироватьКоллекцию(МассивДанныхКонтейнеров, "Уровень УБЫВ");
	
	ПоискСобственныхИтогов = Новый Структура("СвязанныйТовар, Контейнер", 1);
	ПоискПодчиненныхИтогов = Новый Структура("МастерКонтейнер");
	ПоискКонтейнеров = Новый Структура("МастерКонтейнер");
	ПоискТоваровКонтейнера = Новый Структура("Контейнер");
	ПоискТоваров = Новый Структура(ТоварныеПоля);
	ПоискТоваровПоОбщемуИтогу = Новый Структура("Ячейка, Контейнер, " + ТоварныеПоля);
	
	ДополнительныеПараметрыПоискаПодчиненныхИтогов = Новый Структура;
	ДополнительныеПараметрыПоискаПодчиненныхИтогов.Вставить("СистемаИндексирования", РаботаСКоллекциями.МенеджерИндексирования_ПодобратьИндекс(ТаблицаТоваров.МенеджерИндексирования, ПоискПодчиненныхИтогов));
	
	ДополнительныеПараметрыПоискаТоваровКонтейнера = Новый Структура;
	ДополнительныеПараметрыПоискаТоваровКонтейнера.Вставить("СистемаИндексирования", РаботаСКоллекциями.МенеджерИндексирования_ПодобратьИндекс(ТаблицаТоваров.МенеджерИндексирования, ПоискТоваровКонтейнера));
	
	ДополнительныеПараметрыПоискаКонтейнеров = Новый Структура;
	ДополнительныеПараметрыПоискаКонтейнеров.Вставить("СистемаИндексирования", РаботаСКоллекциями.МенеджерИндексирования_ПодобратьИндекс(ТаблицаКонтейнеров.МенеджерИндексирования, ПоискКонтейнеров));
	
	Для Каждого ДанныеКонтейнера Из МассивДанныхКонтейнеров Цикл
		
		Контейнер = ДанныеКонтейнера.Контейнер;
		ЗаполнитьЗначенияСвойств(ПоискСобственныхИтогов, ДанныеКонтейнера);
		
		/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		СтрокиСобственныхИтогов = ДанныеКонтейнера.СтрокиИтогов;
		Для Каждого СтрокаИтога Из СтрокиСобственныхИтогов Цикл
			СтрокаИтога.Количество = 0;
			СтрокаИтога.ИсходноеКоличество = 0;
		КонецЦикла;
		
		ПоискКонтейнеров.МастерКонтейнер = Контейнер;
		ДанныеПодчиненныхКонтейнеров = РаботаСКоллекциями.НайтиЭлементыКоллекции(ТаблицаКонтейнеров, ПоискКонтейнеров, ДополнительныеПараметрыПоискаКонтейнеров);
		Для Каждого ДанныеПодчиненногоКонтейнера Из ДанныеПодчиненныхКонтейнеров Цикл
			ПоискТоваровКонтейнера.Контейнер = ДанныеПодчиненногоКонтейнера.Контейнер;
			СтрокиТоваровПодчиненногоКонтейнера = РаботаСКоллекциями.НайтиЭлементыКоллекции(ТаблицаТоваров, ПоискТоваровКонтейнера, ДополнительныеПараметрыПоискаТоваровКонтейнера);
			Для Каждого СтрокаТовара Из СтрокиТоваровПодчиненногоКонтейнера Цикл
				ЗаполнитьЗначенияСвойств(ПоискТоваров, СтрокаТовара);
				НайденныеСтрокиТовара = РаботаСКоллекциями.НайтиЭлементыКоллекции(СтрокиСобственныхИтогов, ПоискТоваров);
				Если НайденныеСтрокиТовара.Количество() > 0 Тогда
					СтрокаИтога = НайденныеСтрокиТовара[0];
				Иначе
					СтрокаИтога = РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаТоваров);
					ЗаполнитьЗначенияСвойств(СтрокаИтога, СтрокаТовара);
					ЗаполнитьЗначенияСвойств(СтрокаИтога, ДанныеКонтейнера, , ПоляИтогов);
					СтрокаИтога.СвязанныйТовар = 1;
					СтрокаИтога.ИтогПоИерархии = 1;
					СтрокаИтога.Количество = 0;
					СтрокаИтога.ИсходноеКоличество = 0;
					РаботаСКоллекциями.ИндексироватьСтрокиКвазиТаблицы(ТаблицаТоваров, СтрокаИтога);
					СтрокиСобственныхИтогов.Добавить(СтрокаИтога);
					Если НужноУпорядочить = Неопределено Тогда
						НужноУпорядочить = Истина;
					КонецЕсли;
				КонецЕсли;
				
				СтрокаИтога.Количество = СтрокаИтога.Количество + СтрокаТовара.Количество * ДанныеПодчиненногоКонтейнера.Количество;
				СтрокаИтога.ИсходноеКоличество = СтрокаИтога.ИсходноеКоличество + СтрокаТовара.ИсходноеКоличество * ДанныеПодчиненногоКонтейнера.ИсходноеКоличество;
			КонецЦикла;
		КонецЦикла;
		
		/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		СтрокиОбщихИтогов = ДанныеКонтейнера.СтрокиОбщихИтогов;
		СтрокиОтклонений = ДанныеКонтейнера.СтрокиОтклонений;
		
		Для Каждого СтрокаОбщегоИтога Из СтрокиОбщихИтогов Цикл
			ЗаполнитьЗначенияСвойств(ПоискТоваровПоОбщемуИтогу, СтрокаОбщегоИтога);
			СтрокиПоТовару = РаботаСКоллекциями.НайтиЭлементыКоллекции(ТаблицаТоваров, ПоискТоваровПоОбщемуИтогу);
			КоличествоПоТовару = РаботаСКоллекциями.ПолучитьИтогКоллекции(СтрокиПоТовару, "ИсходноеКоличество");
			Отклонение = СтрокаОбщегоИтога.Количество - КоличествоПоТовару;
			Если Отклонение = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокиОтклоненийПоТовару = РаботаСКоллекциями.НайтиЭлементыКоллекции(СтрокиОтклонений, ПоискТоваровПоОбщемуИтогу);
			Если СтрокиОтклоненийПоТовару.Количество() > 0 Тогда
				СтрокаОтклоненияПоТовару = СтрокиОтклоненийПоТовару[0];
			Иначе
				СтрокаОтклоненияПоТовару = РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаТоваров);
				ЗаполнитьЗначенияСвойств(СтрокаОтклоненияПоТовару, СтрокаОбщегоИтога);
				ЗаполнитьЗначенияСвойств(СтрокаОтклоненияПоТовару, ДанныеКонтейнера, , ПоляИтогов);
				СтрокаОтклоненияПоТовару.ИсходноеКоличество = 0;
				СтрокаОтклоненияПоТовару.СвязанныйТовар = 1;
				СтрокаОтклоненияПоТовару.ИтогПоИерархии = 0;
				СтрокиОтклонений.Добавить(СтрокаОтклоненияПоТовару);
				РаботаСКоллекциями.ИндексироватьСтрокиКвазиТаблицы(ТаблицаТоваров, СтрокаОтклоненияПоТовару);
			КонецЕсли;
			
			СтрокаОтклоненияПоТовару.ИсходноеКоличество = СтрокаОтклоненияПоТовару.ИсходноеКоличество + Отклонение;
			СтрокаОтклоненияПоТовару.Количество = СтрокаОтклоненияПоТовару.ИсходноеКоличество;
		КонецЦикла;
		
		/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		ПоискКонтейнеров.МастерКонтейнер = Контейнер;
		ВложенныеКонтейнеры = РаботаСКоллекциями.НайтиЭлементыКоллекции(ТаблицаКонтейнеров, ПоискКонтейнеров, ДополнительныеПараметрыПоискаКонтейнеров);
		ПолныеДанные = Истина;
		Для Каждого ВложенныйКонтейнер Из ВложенныеКонтейнеры Цикл
			Если Не ВложенныйКонтейнер.ПолныеДанные Тогда
				ПолныеДанные = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ДанныеКонтейнера.ПолныеДанные = ПолныеДанные;
		
	КонецЦикла;
	
	Если НужноУпорядочить = Истина Тогда
		//РаботаСКоллекциями.СвернутьКвазиТаблицуЗначений(ТаблицаТоваров, , ПоляИтогов);
		РаботаСКоллекциями.СортироватьКвазиТаблицуЗначений(ТаблицаТоваров, "Уровень");
	КонецЕсли;
	
КонецФункции

Функция ПереместитьКонтейнер(Процессор, Контейнер, знач КонтейнерПриемник) Экспорт
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ТаблицаТоваров = Процессор.ТаблицаТоваров;
	ТаблицаКонтейнеров = Процессор.ТаблицаКонтейнеров;
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	СуперКонтейнер = Процессор.СуперКонтейнер;
	ДанныеКонтейнеров = Процессор.ДанныеКонтейнеров;
	
	Если КонтейнерПриемник = Неопределено Тогда
		КонтейнерПриемник = ПустойКонтейнер;
	КонецЕсли;
	
	НайденныеСтрокиКонтейнера = РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(ТаблицаКонтейнеров, Новый Структура("Контейнер, Количество", Контейнер, 1));
	Если НайденныеСтрокиКонтейнера.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого НайденнаяСтрокаКонтейнера Из НайденныеСтрокиКонтейнера Цикл
		НайденнаяСтрокаКонтейнера.Количество = 0;
	КонецЦикла;
	
	Если КонтейнерПриемник <> ПустойКонтейнер Тогда
		Если КонтейнерПриемник = СуперКонтейнер Тогда
			ДанныеКонтейнераВерхнегоУровня = ДанныеКонтейнеров[НайденнаяСтрокаКонтейнера.КонтейнерВерхнегоУровня];
			ДанныеКонтейнераПриемника = Новый Структура("КонтейнерВерхнегоУровня, МастерКонтейнер, Уровень, Ячейка", Контейнер, СуперКонтейнер, ДанныеКонтейнераВерхнегоУровня.Уровень, ДанныеКонтейнераВерхнегоУровня.Ячейка);
		Иначе
			ДанныеКонтейнераПриемника = ДанныеКонтейнеров[КонтейнерПриемник];
		КонецЕсли;
		
		Если ДанныеКонтейнераПриемника <> Неопределено Тогда
			НайденныеСтрокиКонтейнера = РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(ТаблицаКонтейнеров, Новый Структура("МастерКонтейнер, Контейнер", КонтейнерПриемник, Контейнер));
			Если НайденныеСтрокиКонтейнера.Количество() = 0 Тогда
				НоваяСтрокаКонтейнера = РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаКонтейнеров, ДанныеКонтейнераПриемника);
				НоваяСтрокаКонтейнера.МастерКонтейнер = КонтейнерПриемник;
				НоваяСтрокаКонтейнера.Контейнер = Контейнер;
				НоваяСтрокаКонтейнера.Уровень = НоваяСтрокаКонтейнера.Уровень + 1;
				НоваяСтрокаКонтейнера.ИсходноеКоличество = 0;
				НайденныеСтрокиКонтейнера.Добавить(НоваяСтрокаКонтейнера);
			КонецЕсли;
			
			Для Каждого НайденнаяСтрокаКонтейнера Из НайденныеСтрокиКонтейнера Цикл
				НайденнаяСтрокаКонтейнера.Количество = 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПрименитьИзменения(Процессор) Экспорт
	
	Перем УправлениеОстаткамиВызовСервера;
	
	УправлениеОстаткамиВызовСервера = Процессор.ОбщиеМодули.УправлениеОстаткамиВызовСервера;
	
	ТаблицаДвижений = ПолучитьТаблицуДвижений(Процессор);
	Если ТаблицаДвижений.Строки.Количество() > 0 Тогда
		УправлениеОстаткамиВызовСервера.ПрименитьИзменения(ТаблицаДвижений);
	КонецЕсли;
	
КонецФункции

Функция УстановитьФактическиеКоличества(Процессор, ТаблицаФакта) Экспорт
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	СтрокиФакта = РК.ПолучитьЭлементыКоллекции(ТаблицаФакта);
	
	Для Каждого СтрокаФакта Из СтрокиФакта Цикл
		УстановитьКоличествоТовара(Процессор, СтрокаФакта, СтрокаФакта.Количество);
	КонецЦикла;
	
	ОбновитьИтогиПоИерархииКонтейнеров(Процессор);
	
КонецФункции

Функция ПодгрузитьНеобходимыеДанные(Процессор, ТаблицаИзменений) Экспорт
	
	УнифицированнаяТаблицаИзменений = ПолучитьУнифицированнуюТаблицуИзменений(Процессор, ТаблицаИзменений);
	
	ТаблицаТоваровДляЗагрузки = ПолучитьТаблицуТоваровДляПодгрузкиДанных(Процессор, УнифицированнаяТаблицаИзменений);
	Если ТаблицаТоваровДляЗагрузки.Количество() > 0 Тогда
		ПодгрузитьДанныеПоТоварам(Процессор, ТаблицаТоваровДляЗагрузки);
	КонецЕсли;
	
	МассивКонтейнеровЗагрузитьПолныеДанные = ПолучитьКонтейнерыДляПодгрузкиПолныхДанных(Процессор, УнифицированнаяТаблицаИзменений);
	Если МассивКонтейнеровЗагрузитьПолныеДанные.Количество() > 0 Тогда
		ПодгрузитьДанныеПоКонтейнерам(Процессор, МассивКонтейнеровЗагрузитьПолныеДанные, Истина);
	КонецЕсли;
	
	МассивКонтейнеровЗагрузитьНеполныеДанные = ПолучитьКонтейнерыДляПодгрузкиНеполныхДанных(Процессор, УнифицированнаяТаблицаИзменений);
	Если МассивКонтейнеровЗагрузитьНеполныеДанные.Количество() > 0 Тогда
		ПодгрузитьДанныеПоКонтейнерам(Процессор, МассивКонтейнеровЗагрузитьНеполныеДанные, Ложь);
	КонецЕсли;
	
КонецФункции


Функция ПодгрузитьДанныеПоТоварам(Процессор, ТаблицаТоваров) Экспорт
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	МассивТоваров = РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаТоваров, "Товар");
	МассивЯчеек = РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаТоваров, "Ячейка");
	
	ИспользуемыеПоляМассив = РК.СкопироватьМассив(Процессор.ТоварныеПоляМассив);
	ИспользуемыеПоляМассив.Добавить("Контейнер");
	
	ДополнительныеПараметрыФункции = Новый Структура;
	ДополнительныеПараметрыФункции.Вставить("ТекущиеДокументы", Процессор.ТекущиеДокументы);
	ДополнительныеПараметрыФункции.Вставить("Дата", Процессор.ДатаПолученияОстатков);
	ДополнительныеПараметрыФункции.Вставить("Ячейки", МассивЯчеек);
	ДополнительныеПараметрыФункции.Вставить("Товары", МассивТоваров);
	ДополнительныеПараметрыФункции.Вставить("Контейнеры", Процессор.ПустойКонтейнер);
	ДополнительныеПараметрыФункции.Вставить("ИспользуемыеПоля", ИспользуемыеПоляМассив);
	ДополнительныеПараметрыФункции.Вставить("ВключатьОтрицательные", ?(Процессор.Свойство("РазрешитьОтрицательныеОстатки"),Процессор.РазрешитьОтрицательныеОстатки, Ложь)); // ТУ_Самойленко 28.06.23
	ТаблицаОстатковТоваровВЯчейках = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ДополнительныеПараметрыФункции);
	
	Загрузить(Процессор, ТаблицаОстатковТоваровВЯчейках);
	
КонецФункции

Функция ПодгрузитьДанныеПоКонтейнерам(Процессор, Контейнеры, ЗагрузитьПолныеДанные) Экспорт
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ТоварныеПоляМассив = Процессор.ТоварныеПоляМассив;
	
	ДополнительныеПараметрыФункции = Новый Структура;
	ДополнительныеПараметрыФункции.Вставить("ТекущиеДокументы", Процессор.ТекущиеДокументы);
	ДополнительныеПараметрыФункции.Вставить("Дата", Процессор.ДатаПолученияОстатков);
	ДополнительныеПараметрыФункции.Вставить("ПолучитьГоризонтальныеОстаткиДополнительныхУровней", Истина);
	ДополнительныеПараметрыФункции.Вставить("МаксимальныйУровеньРазузлования", ?(ЗагрузитьПолныеДанные, -1, 1));
	ДополнительныеПараметрыФункции.Вставить("ТоварныеПоля", ТоварныеПоляМассив);
	ТаблицаСоставовКонтейнеров = вмс_ПартионныйУчетСервер.ПолучитьТаблицуСоставаПоКонтейнерам(Контейнеры, ДополнительныеПараметрыФункции);
	
	ЗагруженныеКонтейнеры = Новый Массив;
	РК.ДобавитьЭлементыКоллекции(ЗагруженныеКонтейнеры, РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаСоставовКонтейнеров, "Контейнер"));
	РК.ДобавитьЭлементыКоллекции(ЗагруженныеКонтейнеры, РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаСоставовКонтейнеров, "Товар"));
	
	ИспользуемыеПоляМассив = РК.СкопироватьМассив(ТоварныеПоляМассив);
	ИспользуемыеПоляМассив.Добавить("Контейнер");
	ПараметрыФункции = Новый Структура;
	ПараметрыФункции.Вставить("ТекущиеДокументы", Процессор.ТекущиеДокументы);
	ПараметрыФункции.Вставить("Дата", Процессор.ДатаПолученияОстатков);
	ПараметрыФункции.Вставить("Контейнеры", ЗагруженныеКонтейнеры);
	ПараметрыФункции.Вставить("ИспользуемыеПоля", ИспользуемыеПоляМассив);
	ТаблицаОстатковКонтейнеровВЯчейках = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ПараметрыФункции);
	
	Загрузить(Процессор, ТаблицаОстатковКонтейнеровВЯчейках, ТаблицаСоставовКонтейнеров);
	
КонецФункции

Функция ВыполнитьАгрегированиеКонтейнеров(ТаблицаСодержимого, РеквизитыДокументаОперации=Неопределено, СсылкаНаДокументТекущейОперации=Неопределено) Экспорт
	
	МРК = вмс_РаботаСКоллекциями;
	
	ТипКонтейнер = Тип("СправочникСсылка.вмс_Контейнеры");
	ПустойКонтейнер = ПолучитьПустойКонтейнер();
	СуперКонтейнер = ПолучитьСуперКонтейнер();
	ПустойТовар = вмс_ОбщегоНазначенияВызовСервера.ПолучитьПустуюСсылкуНаТовар();
	
	МассивВложенныхКонтейнеров = Новый Массив;
	Для Каждого СтрокаСодержимого Из ТаблицаСодержимого Цикл
		Если ТипЗнч(СтрокаСодержимого.Товар) = ТипКонтейнер Тогда
			МассивВложенныхКонтейнеров.Добавить(СтрокаСодержимого.Товар);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивВложенныхКонтейнеров", МассивВложенныхКонтейнеров);
	Запрос.УстановитьПараметр("СсылкаНаДокументТекущейОперации", СсылкаНаДокументТекущейОперации);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОстаткиВКонтейнерахОстатки.Товар КАК ПартияТовара,
	|	вмс_ОстаткиВКонтейнерахОстатки.Контейнер КАК Контейнер,
	|	вмс_ОстаткиВКонтейнерахОстатки.Товар КАК Товар,
	|	вмс_ОстаткиВКонтейнерахОстатки.Маркировка КАК Маркировка,
	|	вмс_ОстаткиВКонтейнерахОстатки.КоличествоКонечныйОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.вмс_ОстаткиВКонтейнерах.ОстаткиИОбороты(, , , , Товар В (&МассивВложенныхКонтейнеров)) КАК вмс_ОстаткиВКонтейнерахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОстаткиВКонтейнерахОстатки.Товар КАК ПартияТовара,
	|	вмс_ОстаткиВКонтейнерахОстатки.Контейнер КАК Контейнер,
	|	вмс_ОстаткиВКонтейнерахОстатки.Товар КАК Товар,
	|	вмс_ОстаткиВКонтейнерахОстатки.Маркировка КАК Маркировка,
	|	вмс_ОстаткиВКонтейнерахОстатки.КоличествоКонечныйОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.вмс_ОстаткиВКонтейнерах.ОстаткиИОбороты(, , Регистратор, , Товар В (&МассивВложенныхКонтейнеров)) КАК вмс_ОстаткиВКонтейнерахОстатки
	|ГДЕ
	|	вмс_ОстаткиВКонтейнерахОстатки.Регистратор = &СсылкаНаДокументТекущейОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Контейнер КАК КонтейнерТовара,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Контейнер КАК Контейнер,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОстатки.Склад КАК Склад,
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоКонечныйОстаток КАК Количество,
	|	вмс_ОперацияПоЯчейкамОстатки.ВесКонечныйОстаток КАК Вес,
	|	вмс_ОперацияПоЯчейкамОстатки.Партия КАК Партия,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия КАК Серия,
	|	вмс_ОперацияПоЯчейкамОстатки.Качество КАК Качество
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.ОстаткиИОбороты(, , , , Контейнер В (&МассивВложенныхКонтейнеров)) КАК вмс_ОперацияПоЯчейкамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Контейнер КАК КонтейнерТовара,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Контейнер КАК Контейнер,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОстатки.Склад КАК Склад,
	|	вмс_ОперацияПоЯчейкамОстатки.Партия КАК Партия,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия КАК Серия,
	|	вмс_ОперацияПоЯчейкамОстатки.Качество КАК Качество,
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоКонечныйОстаток КАК Количество,
	|	вмс_ОперацияПоЯчейкамОстатки.ВесКонечныйОстаток КАК Вес
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.ОстаткиИОбороты(, , Регистратор, , Контейнер В (&МассивВложенныхКонтейнеров)) КАК вмс_ОперацияПоЯчейкамОстатки
	|ГДЕ
	|	вмс_ОперацияПоЯчейкамОстатки.Регистратор = &СсылкаНаДокументТекущейОперации";
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаОбщихОстатковСоставовПартий = ПакетРезультатовЗапроса[0].Выгрузить();
	ТаблицаТекущихОстатковСоставовПартий = ПакетРезультатовЗапроса[1].Выгрузить();
	ТаблицаОбщихОстатковПартийВЯчейках = ПакетРезультатовЗапроса[2].Выгрузить();
	ТаблицаТекущихОстатковПартийВЯчейках = ПакетРезультатовЗапроса[3].Выгрузить();
	КолонкиИтоговОстатковСоставовВЯчейках = "Количество";
	КолонкиГруппыОстатковСоставовВЯчейках = МРК.МассивВСтроку(МРК.ПолучитьКолонкиКоллекции(ТаблицаОбщихОстатковСоставовПартий, КолонкиИтоговОстатковСоставовВЯчейках));
	КолонкиИтоговОстатковВЯчейках = "Количество, Вес";
	КолонкиГруппыОстатковВЯчейках = МРК.МассивВСтроку(МРК.ПолучитьКолонкиКоллекции(ТаблицаОбщихОстатковПартийВЯчейках, КолонкиИтоговОстатковВЯчейках));
	
	/////////////////////////////////////////////////////////////////////////////
	СписанияКонтейнеров = МРК.НоваяТаблицаЗначений("Документ, ТаблицаОстатков, ТаблицаОстатковСостава, Изменен");
	Если СсылкаНаДокументТекущейОперации <> Неопределено Тогда
		ДокументТекущейОперации = СсылкаНаДокументТекущейОперации.ПолучитьОбъект();
	КонецЕсли;
	
	Если ДокументТекущейОперации <> Неопределено Тогда
		МРК.ДобавитьСтрокуТЗ(СписанияКонтейнеров, ДокументТекущейОперации, ТаблицаТекущихОстатковПартийВЯчейках, ТаблицаТекущихОстатковСоставовПартий, 0);
	КонецЕсли;
	
	ОперацияПоЯчейкам = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
	ОперацияПоЯчейкам.Заполнить(Неопределено);
	МРК.ДобавитьСтрокуТЗ(СписанияКонтейнеров, ОперацияПоЯчейкам, ТаблицаОбщихОстатковПартийВЯчейках, ТаблицаОбщихОстатковСоставовПартий, 0);
	
	МассивКонтейнеров = Новый Массив;
	
	Для Каждого СтрокаСодержимого Из ТаблицаСодержимого Цикл
		
		Если ТипЗнч(СтрокаСодержимого.Товар) = ТипКонтейнер Тогда
			Контейнер = СтрокаСодержимого.Товар;
			Товар = ПустойТовар;
		Иначе
			Контейнер = ПустойКонтейнер;
			Товар = СтрокаСодержимого.Товар;
		КонецЕсли;
		
		Если СтрокаСодержимого.Количество > 0 Тогда
			// помещение в контейнер
			Если Контейнер <> ПустойКонтейнер Тогда
				ОтборОстатков = Новый Структура("Контейнер", Контейнер);
				
				Для Каждого СписаниеКонтейнеров Из СписанияКонтейнеров Цикл
					ТаблицаДокумента = СписаниеКонтейнеров.Документ.Товары;
					
					// извлечение контейнера из состава предыдущего мастер-контейнера
					ТаблицаОстатковСоставовПартий = СписаниеКонтейнеров.ТаблицаОстатковСостава;
					СтрокиОстатковСоставаПартии = ТаблицаОстатковСоставовПартий.НайтиСтроки(ОтборОстатков);
					Если СтрокиОстатковСоставаПартии.Количество() > 0 Тогда
						Для Каждого СтрокаОстаткаСоставаПартии Из СтрокиОстатковСоставаПартии Цикл
							СтрокаДокумента = ТаблицаДокумента.Добавить();
							СтрокаДокумента.Контейнер = Контейнер;
							СтрокаДокумента.КонтейнерПриемник = СтрокаОстаткаСоставаПартии.Контейнер;
							СтрокаДокумента.Количество = -СтрокаОстаткаСоставаПартии.Количество;
						КонецЦикла;
						
						Если ТаблицаОстатковСоставовПартий = ТаблицаТекущихОстатковСоставовПартий Тогда
							// вычесть также из общих остатков
							МРК.ИнвертироватьЗначенияКоллекции(СтрокиОстатковСоставаПартии, КолонкиИтоговОстатковСоставовВЯчейках);
							МРК.ДобавитьЭлементыКоллекции(ТаблицаОбщихОстатковСоставовПартий, СтрокиОстатковСоставаПартии);
							ТаблицаОбщихОстатковСоставовПартий.Свернуть(КолонкиГруппыОстатковСоставовВЯчейках, КолонкиИтоговОстатковСоставовВЯчейках);
							МРК.УдалитьПустыеСтрокиКоллекции(ТаблицаОбщихОстатковСоставовПартий, КолонкиИтоговОстатковСоставовВЯчейках);
						КонецЕсли;
						МРК.УдалитьЭлементыКоллекции(ТаблицаОстатковСоставовПартий, СтрокиОстатковСоставаПартии);
						СписаниеКонтейнеров.Изменен = 1;
					КонецЕсли;
					
					
					// списание состава размещаемого контейнера с ячеек (если это контейнер верхнего уровня)
					ТаблицаОстатковПартийВЯчейках = СписаниеКонтейнеров.ТаблицаОстатков;
					СтрокиОстатковПартииВЯчейках = ТаблицаОстатковПартийВЯчейках.НайтиСтроки(ОтборОстатков);
					Если СтрокиОстатковПартииВЯчейках.Количество() > 0 Тогда
						Для Каждого СтрокаОстаткаПартииВЯчейке Из СтрокиОстатковПартииВЯчейках Цикл
							СтрокаДокумента = ТаблицаДокумента.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаОстаткаПартииВЯчейке, "Контейнер, Товар, Характеристика, Партия, Серия, Качество");
							СтрокаДокумента.ЯчейкаПриемник = СтрокаОстаткаПартииВЯчейке.Ячейка;
							СтрокаДокумента.Количество = -СтрокаОстаткаПартииВЯчейке.Количество;
						КонецЦикла;
						
						Если ТаблицаОстатковПартийВЯчейках = ТаблицаТекущихОстатковПартийВЯчейках Тогда
							// вычесть также из общих остатков
							МРК.ИнвертироватьЗначенияКоллекции(СтрокиОстатковПартииВЯчейках, КолонкиИтоговОстатковВЯчейках);
							МРК.ДобавитьЭлементыКоллекции(ТаблицаОбщихОстатковПартийВЯчейках, СтрокиОстатковПартииВЯчейках);
							ТаблицаОбщихОстатковПартийВЯчейках.Свернуть(КолонкиГруппыОстатковВЯчейках, КолонкиИтоговОстатковВЯчейках);
							МРК.УдалитьПустыеСтрокиКоллекции(ТаблицаОбщихОстатковПартийВЯчейках, КолонкиИтоговОстатковВЯчейках);
						КонецЕсли;
						МРК.УдалитьЭлементыКоллекции(ТаблицаОстатковПартийВЯчейках, СтрокиОстатковПартииВЯчейках);
						СписаниеКонтейнеров.Изменен = 1;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			Если Товар <> ПустойТовар Тогда
				СтрокаДокумента = ОперацияПоЯчейкам.АгрегацияКонтейнеров.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаСодержимого);
				СтрокаДокумента.Товар = Товар;
				СтрокаДокумента.Характеристика = СтрокаСодержимого.Характеристика;
				СтрокаДокумента.Контейнер = ПустойКонтейнер;
				СтрокаДокумента.КонтейнерПриемник = СтрокаСодержимого.КонтейнерПриемник;
			Иначе
				СтрокаДокумента = ОперацияПоЯчейкам.Товары.Добавить();
				СтрокаДокумента.Контейнер = Контейнер;
				СтрокаДокумента.КонтейнерПриемник = СтрокаСодержимого.КонтейнерПриемник;
			КонецЕсли;
			СтрокаДокумента.Количество = СтрокаСодержимого.Количество;
			
		ИначеЕсли СтрокаСодержимого.Количество < 0 Тогда
			
			Если Контейнер <> ПустойКонтейнер Тогда
				// потом
			КонецЕсли;
			
			СтрокаДокумента = ОперацияПоЯчейкам.Товары.Добавить();
			СтрокаДокумента.Контейнер = Контейнер;
			СтрокаДокумента.Товар = Товар;
			СтрокаДокумента.Характеристика = СтрокаСодержимого.Характеристика;
			СтрокаДокумента.КонтейнерОтправитель = СтрокаСодержимого.КонтейнерОтправитель;
			СтрокаДокумента.Количество = -СтрокаСодержимого.Количество;
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		Если МассивКонтейнеров.Найти(СтрокаСодержимого.КонтейнерОтправитель) = Неопределено Тогда
			МассивКонтейнеров.Добавить(СтрокаСодержимого.КонтейнерОтправитель);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДокументТекущейОперации <> Неопределено Тогда
		// ТУ_Прошин 17.04.2023++
		ДокументТекущейОперации.ДополнительныеСвойства.Вставить("ОбменДанными", Истина); 
		// ТУ_ПРошин 17.04.2023--
		ДокументТекущейОперации.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	Если ОперацияПоЯчейкам.Товары.Количество() > 0 ИЛИ ОперацияПоЯчейкам.АгрегацияКонтейнеров.Количество() > 0 Тогда
		Комментарий = "Агрегирование " + ?(МассивКонтейнеров.Количество() > 1, "контейнеров", "контейнера") + " ";
		Комментарий = Комментарий + вмс_РаботаСКоллекциями.МассивВСтроку(МассивКонтейнеров);
		
		ОперацияПоЯчейкам.Дата = ТекущаяДата();
		ОперацияПоЯчейкам.Комментарий = Комментарий;
		
		Если ТипЗнч(РеквизитыДокументаОперации) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ОперацияПоЯчейкам, РеквизитыДокументаОперации);
		КонецЕсли;
		
		ОперацияПоЯчейкам.ВидСубОперации = вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьСсылкуНаВидОперацииПоЯчейкам("ИзменитьПаллету");
		ОперацияПоЯчейкам.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьАгрегированиеКонтейнеровНовая(ПараметрыФункции) Экспорт
	
	Перем ТаблицаИзменений, РеквизитыДокументаОперации, СсылкаНаТекущийДокументОперации, ТаблицыОстатковДляСписанияПоЯчейкам, ПолучитьПолныйСоставПоКонтейнерам;
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	
	Если ТипЗнч(ПараметрыФункции) <> Тип("Структура") Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыФункции.Свойство("ТаблицаИзменений", ТаблицаИзменений);
	Если ТаблицаИзменений = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	РК = вмс_РаботаСКоллекциями;
	
	ПараметрыФункции.Свойство("РеквизитыДокументаОперации", РеквизитыДокументаОперации);
	ПараметрыФункции.Свойство("СсылкаНаТекущийДокументОперации", СсылкаНаТекущийДокументОперации);
	ПараметрыФункции.Свойство("ПолучитьПолныйСоставПоКонтейнерам", ПолучитьПолныйСоставПоКонтейнерам);
	
	Если ТипЗнч(ПолучитьПолныйСоставПоКонтейнерам) <> Тип("Массив") Тогда
		ПолучитьПолныйСоставПоКонтейнерам = Новый Массив;
	КонецЕсли;
	
	ЕстьМастерОперация = СсылкаНаТекущийДокументОперации <> Неопределено;
	
	ПроцессорУО = НовыйПроцессорУправленияОстатками();
	ТаблицаТоваров = ПроцессорУО.ТаблицаТоваров;
	ТаблицаКонтейнеров = ПроцессорУО.ТаблицаКонтейнеров;
	ТипКонтейнер = ПроцессорУО.ТипКонтейнер;
	ПустаяЯчейка = ПроцессорУО.ПустаяЯчейка;
	
	ТаблицаИзменений = ПолучитьУнифицированнуюТаблицуИзменений(ПроцессорУО, ТаблицаИзменений);
	
	МастерКонтейнеры = РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаИзменений, "Контейнер");
	РК.УдалитьДублиВМассиве(МастерКонтейнеры);
	РК.УдалитьПустыеСтрокиКоллекции(МастерКонтейнеры);
	
	МастерКонтейнерыНаМестах = ПолучитьКонтейнерыНаМестах(МастерКонтейнеры);
	МастерКонтейнерыНеНаМестах = РК.ВычитаниеМассивов(МастерКонтейнеры, МастерКонтейнерыНаМестах);
	
	Если МастерКонтейнерыНеНаМестах.Количество() > 0 Тогда
		ПодгрузитьДанныеПоКонтейнерам(ПроцессорУО, МастерКонтейнерыНеНаМестах, Истина);
	КонецЕсли;
	ПодгрузитьНеобходимыеДанные(ПроцессорУО, ТаблицаИзменений);
	
	// обнулить количества по редактируемым контейнерам,
	// чтобы они списались со своих текущих расположений
	ПоискКонтейнера = Новый Структура("Контейнер");
	Для Каждого СтрокаИзменений Из РК.ПолучитьЭлементыКоллекции(ТаблицаИзменений) Цикл
		Если ТипЗнч(СтрокаИзменений.Товар) = ТипКонтейнер И СтрокаИзменений.Количество > СтрокаИзменений.ИсходноеКоличество Тогда
			ПоискКонтейнера.Контейнер = СтрокаИзменений.Товар;
			СтрокиКонтейнера = РК.НайтиЭлементыКоллекции(ТаблицаКонтейнеров, ПоискКонтейнера);
			Для Каждого СтрокаКонтейнера Из СтрокиКонтейнера Цикл
				СтрокаКонтейнера.Количество = 0;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьФактическиеКоличества(ПроцессорУО, ТаблицаИзменений);
	ТаблицаДвижений = ПолучитьТаблицуДвижений(ПроцессорУО);
	СтрокиДвижений = РК.ПолучитьЭлементыКоллекции(ТаблицаДвижений);
	
	МассивМастерКонтейнеров = Новый Массив;
	РК.ДобавитьЭлементыКоллекции(МассивМастерКонтейнеров, РК.ВыгрузитьЗначенияКолонкиКоллекции(СтрокиДвижений, "КонтейнерОтправитель"));
	РК.ДобавитьЭлементыКоллекции(МассивМастерКонтейнеров, РК.ВыгрузитьЗначенияКолонкиКоллекции(СтрокиДвижений, "КонтейнерПриемник"));
	РК.УдалитьПустыеСтрокиКоллекции(МассивМастерКонтейнеров);
	РК.УдалитьДублиВМассиве(МассивМастерКонтейнеров);
	
	ПоляГруппыТаблицыОборотов = "Контейнер, " + ПроцессорУО.ТоварныеПоля;
	ПоляИтоговТаблицыОборотов = "Количество";
	ВсеПоляТаблицыОборотов = ПоляГруппыТаблицыОборотов + ", " + ПоляИтоговТаблицыОборотов;
	ПроцессорУО.Вставить("ПоляГруппыТаблицыОборотов", ПоляГруппыТаблицыОборотов);
	ПроцессорУО.Вставить("ПоляИтоговТаблицыОборотов", ПоляИтоговТаблицыОборотов);
	ПроцессорУО.Вставить("ВсеПоляТаблицыОборотов", ВсеПоляТаблицыОборотов);
	ТаблицаОприходований = РК.НоваяТаблицаЗначений(ВсеПоляТаблицыОборотов);
	
	Если МассивМастерКонтейнеров.Количество() > 0 Тогда
		СтрокиДвиженийОприходования = Новый Массив;
		Для Каждого СтрокаДвижения Из СтрокиДвижений Цикл
			Если СтрокаДвижения.ЯчейкаПриемник <> ПустаяЯчейка Тогда
				СтрокиДвиженийОприходования.Добавить(СтрокаДвижения);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаДвижения Из СтрокиДвиженийОприходования Цикл
			СтрокаОприходования = ТаблицаОприходований.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОприходования, СтрокаДвижения);
			СтрокаОприходования.Контейнер = СтрокаДвижения.Контейнер;
		КонецЦикла;
		
		Если ЕстьМастерОперация Тогда
			// предполагается, что движения по ячейкам сделает основная операция
			РК.УдалитьЭлементыКоллекции(ТаблицаДвижений, СтрокиДвиженийОприходования);
		КонецЕсли;
	КонецЕсли;
	
	// по контейнерам, которые еще не приняты на ячейки оприходываем полный состав
	РК.ДобавитьЭлементыКоллекции(ПолучитьПолныйСоставПоКонтейнерам, МастерКонтейнерыНеНаМестах);
	
	РК.УдалитьДублиВМассиве(ПолучитьПолныйСоставПоКонтейнерам);  
	
	Для Каждого Контейнер Из ПолучитьПолныйСоставПоКонтейнерам Цикл  
		ТаблицаОприходований.Очистить(); // ТУ_Кошелев 03.07.24 - Исправил баг с задвоением количества первоначально добавляемого товара в не новый контейнер (при дополнении ранее существующего)
		
		ПоискКонтейнера.Контейнер = Контейнер;
		ТоварыКонтейнера = РК.НайтиЭлементыКоллекции(ТаблицаТоваров, ПоискКонтейнера);
		РК.ДобавитьЭлементыКоллекции(ТаблицаОприходований, ТоварыКонтейнера);
	КонецЦикла;
	
	ТаблицаОприходований.Свернуть(ПоляГруппыТаблицыОборотов, ПоляИтоговТаблицыОборотов);
	Результат.Вставить("ТаблицаОприходований", ТаблицаОприходований);
	
	// при упаковке малых контейнеров в большой контейнер,
	// малые контейнеры списываются с остатков,
	// если эти малые контейнеры уже были приняты в текущей операции,
	// то надо сделать по ним вычерки из фактически принятых данных
	// для этого можно передать текущие остатки по операции и вычерки сделаются в этих остатках
	ПараметрыФункции.Свойство("ТаблицыОстатковДляСписанияПоЯчейкам", ТаблицыОстатковДляСписанияПоЯчейкам);
	ТаблицыСписанийОстатковПоЯчейкам = ВыполнитьСписанияОстатковПриАгрегированииКонтейнеров(ПроцессорУО, ТаблицаДвижений, ТаблицыОстатковДляСписанияПоЯчейкам);
	
	ТаблицаОборотов = ПолучитьТаблицуОборотовПриАгрегированииКонтейнеров(ПроцессорУО, ТаблицаОприходований, ТаблицыСписанийОстатковПоЯчейкам);
	ТаблицаОборотовБезИерархии = ПолучитьТаблицуОборотовБезИерархииПриАгрегированииКонтейнеров(ПроцессорУО, СтрокиДвижений);
	ДокументАгрегирования = ПолучитьДокументАгрегированияКонтейнера(ПроцессорУО, РеквизитыДокументаОперации, МассивМастерКонтейнеров, ТаблицаДвижений, ПараметрыФункции);
	
	Результат.Вставить("ТаблицыСписанийОстатковПоЯчейкам", ТаблицыСписанийОстатковПоЯчейкам);
	Результат.Вставить("ТаблицаОборотов", ТаблицаОборотов);
	Результат.Вставить("ТаблицаОборотовБезИерархии", ТаблицаОборотовБезИерархии);
	Результат.Вставить("МастерКонтейнеры", МастерКонтейнеры);
	Результат.Вставить("ДокументАгрегирования", ДокументАгрегирования);
	Результат.Вставить("Успешно", Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуДвижений(Процессор) Экспорт
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ПустаяЯчейка = Процессор.ПустаяЯчейка;
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	ПустойТовар = Процессор.ПустойТовар;
	ТоварныеПоля = Процессор.ТоварныеПоля;
	
	ТаблицаТоваров = Процессор.ТаблицаТоваров;
	ТаблицаКонтейнеров = Процессор.ТаблицаКонтейнеров;
	СтрокиКонтейнеров = РК.ПолучитьЭлементыКоллекции(ТаблицаКонтейнеров);
	КонтейнерыВерхнегоУровня = Новый Массив;
	ТоварыКонтейнеров = Новый Соответствие;
	ПоискТоваровКонтейнера = Новый Структура("Контейнер");
	
	КолонкиДокумента = "Контейнер, %ТОВАРНЫЕПОЛЯ%, Ячейка, ЯчейкаПриемник, Количество, КонтейнерОтправитель, КонтейнерПриемник";
	КолонкиДокумента = СтрЗаменить(КолонкиДокумента, "%ТОВАРНЫЕПОЛЯ%", ТоварныеПоля);
	ТаблицаДвижений = РК.НоваяКвазиТаблицаЗначений(КолонкиДокумента);
	
	//////////////////////////////////////////////////////////////////////////
	// изменение составов контейнеров, изменение остатков товаров без контейнера
	Для Каждого СтрокаТовара Из РК.ПолучитьЭлементыКоллекции(ТаблицаТоваров) Цикл
		
		Если СтрокаТовара.СвязанныйТовар <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Разница = СтрокаТовара.Количество - СтрокаТовара.ИсходноеКоличество;
		Если Разница = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТовара.Контейнер <> ПустойКонтейнер Тогда
			
			СтрокаДвижения = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаДвижений);
			ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТовара);
			СтрокаДвижения.Контейнер = ПустойКонтейнер;
			
			СтрокаДвижения.Ячейка = ПустаяЯчейка;
			СтрокаДвижения.ЯчейкаПриемник = ПустаяЯчейка;
			Если Разница > 0 Тогда
				СтрокаДвижения.КонтейнерОтправитель = ПустойКонтейнер;
				СтрокаДвижения.КонтейнерПриемник = СтрокаТовара.Контейнер;
				СтрокаДвижения.Количество = Разница;
			Иначе
				СтрокаДвижения.КонтейнерОтправитель = СтрокаТовара.Контейнер;
				СтрокаДвижения.КонтейнерПриемник = ПустойКонтейнер;
				СтрокаДвижения.Количество = -Разница;
			КонецЕсли;
			
		ИначеЕсли СтрокаТовара.Ячейка <> ПустаяЯчейка Тогда
			
			// остаток без контейнера
			СтрокаДвижения = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаДвижений);
			ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТовара);
			СтрокаДвижения.Контейнер = ПустойКонтейнер;
			
			СтрокаДвижения.КонтейнерОтправитель = ПустойКонтейнер;
			СтрокаДвижения.КонтейнерПриемник = ПустойКонтейнер;
			Если Разница > 0 Тогда
				СтрокаДвижения.Ячейка = ПустаяЯчейка;
				СтрокаДвижения.ЯчейкаПриемник = СтрокаТовара.Ячейка;
				СтрокаДвижения.Количество = Разница;
			Иначе
				СтрокаДвижения.Ячейка = СтрокаТовара.Ячейка;
				СтрокаДвижения.ЯчейкаПриемник = ПустаяЯчейка;
				СтрокаДвижения.Количество = -Разница;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаКонтейнера Из СтрокиКонтейнеров Цикл
		
		Если СтрокаКонтейнера.Количество = 0 И СтрокаКонтейнера.ИсходноеКоличество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаКонтейнера.Уровень = 0 Тогда
			КонтейнерыВерхнегоУровня.Добавить(СтрокаКонтейнера);
		КонецЕсли;
		
		Если СтрокаКонтейнера.МастерКонтейнер = ПустойКонтейнер Тогда
			Продолжить;
		КонецЕсли;
		
		Количество = СтрокаКонтейнера.Количество;
		
		Если Количество > 0 Тогда
			// списывание опустевшего контейнера
			ТоварыКонтейнера = ТоварыКонтейнеров[СтрокаКонтейнера.Контейнер];
			Если ТоварыКонтейнера = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ПоискТоваровКонтейнера, СтрокаКонтейнера);
				ТоварыКонтейнера = РК.НайтиЭлементыКоллекции(ТаблицаТоваров, ПоискТоваровКонтейнера);
				ТоварыКонтейнеров[СтрокаКонтейнера.Контейнер] = ТоварыКонтейнера;
			КонецЕсли;
			
			ИтогиПоТоварам = РК.ПолучитьИтогиКоллекции(ТоварыКонтейнера, "Количество, ИсходноеКоличество");
			Если ИтогиПоТоварам.Количество <= 0 И ИтогиПоТоварам.ИсходноеКоличество > 0 Тогда
				Количество = 0;
			КонецЕсли;
		КонецЕсли;
		
		Разница = Количество - СтрокаКонтейнера.ИсходноеКоличество;
		Если Разница = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДвижения = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаДвижений);
		ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаКонтейнера);
		СтрокаДвижения.КонтейнерПриемник = СтрокаКонтейнера.Контейнер;
		
		СтрокаДвижения.Ячейка = ПустаяЯчейка;
		СтрокаДвижения.ЯчейкаПриемник = ПустаяЯчейка;
		Если Разница > 0 Тогда
			СтрокаДвижения.КонтейнерОтправитель = ПустойКонтейнер;
			СтрокаДвижения.КонтейнерПриемник = СтрокаКонтейнера.МастерКонтейнер;
			СтрокаДвижения.Количество = Разница;
		Иначе
			СтрокаДвижения.КонтейнерОтправитель = СтрокаКонтейнера.МастерКонтейнер;
			СтрокаДвижения.КонтейнерПриемник = ПустойКонтейнер;
			СтрокаДвижения.Количество = -Разница;
		КонецЕсли;
		
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////
	// изменение остатков в ячейках в контейнерах
	Для Каждого СтрокаКонтейнера Из КонтейнерыВерхнегоУровня Цикл
		
		Разница = СтрокаКонтейнера.Количество - СтрокаКонтейнера.ИсходноеКоличество;
		
		ДобавлениеКонтейнера = Разница > 0;
		УдалениеКонтейнера = Разница < 0;
		
		ТоварыКонтейнера = ТоварыКонтейнеров[СтрокаКонтейнера.Контейнер];
		Если ТоварыКонтейнера = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ПоискТоваровКонтейнера, СтрокаКонтейнера);
			ТоварыКонтейнера = РК.НайтиЭлементыКоллекции(ТаблицаТоваров, ПоискТоваровКонтейнера);
			ТоварыКонтейнеров[СтрокаКонтейнера.Контейнер] = ТоварыКонтейнера;
		КонецЕсли;
		
		Если ДобавлениеКонтейнера Тогда
			
			// приходуем новый состав контейнера
			Ячейка = СтрокаКонтейнера.Ячейка;
			Контейнер = СтрокаКонтейнера.КонтейнерВерхнегоУровня;
			Если Ячейка <> ПустаяЯчейка Тогда
				Для Каждого СтрокаТовара Из ТоварыКонтейнера Цикл
					Если СтрокаТовара.Количество = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаДвижения = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаДвижений);
					ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТовара);
					СтрокаДвижения.Контейнер = Контейнер;
					СтрокаДвижения.Ячейка = ПустаяЯчейка;
					СтрокаДвижения.ЯчейкаПриемник = Ячейка;
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли УдалениеКонтейнера Тогда
			
			// списываем старый состав контейнера
			Для Каждого СтрокаТовара Из ТоварыКонтейнера Цикл
				Ячейка = СтрокаТовара.Ячейка;
				Если Ячейка = ПустаяЯчейка Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрокаТовара.ИсходноеКоличество = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаДвижения = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаДвижений);
				ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТовара);
				СтрокаДвижения.Количество = СтрокаТовара.ИсходноеКоличество;
				СтрокаДвижения.Контейнер = СтрокаТовара.КонтейнерВерхнегоУровня;
				СтрокаДвижения.Ячейка = Ячейка;
				СтрокаДвижения.ЯчейкаПриемник = ПустаяЯчейка;
			КонецЦикла;
			
		Иначе
			
			// отражаем изменение состава контейнера в ячейках
			Для Каждого СтрокаТовара Из ТоварыКонтейнера Цикл
				Ячейка = СтрокаТовара.Ячейка;
				Если Ячейка = ПустаяЯчейка Тогда
					Продолжить;
				КонецЕсли;
				
				Разница = СтрокаТовара.Количество - СтрокаТовара.ИсходноеКоличество;
				Если Разница = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаДвижения = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаДвижений);
				ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТовара);
				СтрокаДвижения.Контейнер = СтрокаТовара.КонтейнерВерхнегоУровня;
				Если Разница > 0 Тогда
					СтрокаДвижения.Ячейка = ПустаяЯчейка;
					СтрокаДвижения.ЯчейкаПриемник = Ячейка;
					СтрокаДвижения.Количество = Разница;
				Иначе	
					СтрокаДвижения.Ячейка = Ячейка;
					СтрокаДвижения.ЯчейкаПриемник = ПустаяЯчейка;
					СтрокаДвижения.Количество = -Разница;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДвижений;
	
КонецФункции











Функция ОчиститьЗаписиКонтейнеровПоТаблицеСоставовКонтейнеров(Процессор, ТаблицаЗагрузки)
	
	Если ТаблицаЗагрузки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	КонтейнерУдален = Новый Соответствие;
	СтрокиЗагрузки = РК.ПолучитьЭлементыКоллекции(ТаблицаЗагрузки);
	Для Каждого СтрокаЗагрузки Из СтрокиЗагрузки Цикл
		Контейнер = СтрокаЗагрузки.Товар;
		ПолнаяЗагрузка = СтрокаЗагрузки.ПолныеДанные;
		Если ПолнаяЗагрузка Тогда
			Если КонтейнерУдален[Контейнер] <> Истина Тогда
				ОчиститьЗаписиКонтейнера(Процессор, Контейнер);
				КонтейнерУдален[Контейнер] = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ИнициализироватьСтрокиКонтейнеров(Процессор, СтрокиКонтейнеров)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	МассивСтрокКонтейнеров = РК.ЗначениеВМассив(СтрокиКонтейнеров, , Ложь);
	
	Для Каждого СтрокаКонтейнера Из МассивСтрокКонтейнеров Цикл
		СтрокаКонтейнера.ИсходноеКоличество = СтрокаКонтейнера.Количество;
		Если СтрокаКонтейнера.СтрокиИтогов = Неопределено Тогда
			СтрокаКонтейнера.СтрокиИтогов = Новый Массив;
		КонецЕсли;
		Если СтрокаКонтейнера.СтрокиОтклонений = Неопределено Тогда
			СтрокаКонтейнера.СтрокиОтклонений = Новый Массив;
		КонецЕсли;
		Если СтрокаКонтейнера.СтрокиОбщихИтогов = Неопределено Тогда
			СтрокаКонтейнера.СтрокиОбщихИтогов = Новый Массив;
		КонецЕсли;
		СтрокаКонтейнера.ДополнительныеДанные = Новый Структура;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьСтрокуТовара(Процессор, Товар, Количество, знач Контейнер=Неопределено, Ячейка=Неопределено)
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	ПустаяЯчейка = Процессор.ПустаяЯчейка;
	СуперКонтейнер = Процессор.СуперКонтейнер;
	ТаблицаТоваров = Процессор.ТаблицаТоваров;
	ТаблицаКонтейнеров = Процессор.ТаблицаКонтейнеров;
	ТипКонтейнер = Процессор.ТипКонтейнер;  
	ТоварныеПоля = Процессор.ТоварныеПоля;
	ТоварныеПоляМассив = Процессор.ТоварныеПоляМассив;
	
	/////////////////////////////////////////////////////////////////////
	ДанныеТовара = Новый Структура(ТоварныеПоля + ", Контейнер, Ячейка");
	Попытка
		ПолеТовар = Товар.Товар;
		ЭтоСтруктураДанных = Истина;
	Исключение
		ЭтоСтруктураДанных = Ложь;
	КонецПопытки;
	
	Если ЭтоСтруктураДанных Тогда
		ЗаполнитьЗначенияСвойств(ДанныеТовара, Товар);
	Иначе
		ДанныеТовара.Товар = Товар;
		ДанныеТовара.Контейнер = Контейнер;
		ДанныеТовара.Ячейка = Ячейка;
	КонецЕсли;
	ДанныеТовара.Вставить("СвязанныйТовар", 0);
	
	Если ДанныеТовара.Контейнер = Неопределено Тогда
		ДанныеТовара.Контейнер = ПустойКонтейнер;
	КонецЕсли;
	
	Если ДанныеТовара.Ячейка = Неопределено Тогда
		ДанныеТовара.Ячейка = ПустаяЯчейка;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеТовара.Товар) = ТипКонтейнер Тогда
		// оказался контейнер, и так бывает
		Возврат ПолучитьСтрокуКонтейнера(Процессор, ДанныеТовара.Товар, ДанныеТовара.Контейнер, ДанныеТовара.Ячейка);
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////
	ПоискТовара = РаботаСКоллекциями.СкопироватьОбъект(ДанныеТовара);
	
	Если ПоискТовара.Ячейка = ПустаяЯчейка Тогда
		ПоискТовара.Удалить("Ячейка");
	КонецЕсли;
	
	НайденныеСтрокиТовара = РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(ТаблицаТоваров, ПоискТовара);
	Если НайденныеСтрокиТовара.Количество() = 0 Тогда
		
		ДанныеТовара.Вставить("КонтейнерВерхнегоУровня", ПустойКонтейнер);
		ДанныеТовара.Вставить("МастерКонтейнер", ПустойКонтейнер);
		ДанныеТовара.Вставить("Уровень", 0);
		
		Если ДанныеТовара.Контейнер <> ПустойКонтейнер Тогда
			НайденныеСтрокиКонтейнера = РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(ТаблицаКонтейнеров, Новый Структура("Контейнер", ДанныеТовара.Контейнер));
			Если НайденныеСтрокиКонтейнера.Количество() > 0 Тогда
				СтрокаКонтейнера = НайденныеСтрокиКонтейнера[0];
				ЗаполнитьЗначенияСвойств(ДанныеТовара, СтрокаКонтейнера);
			КонецЕсли;
		КонецЕсли;
		
		ДанныеТовара.Вставить("ИсходноеКоличество", 0);
		ДанныеТовара.Вставить("Количество", 0);
		ДанныеТовара.Вставить("ИтогПоИерархии", 0);
		
		СтрокаТовара = РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаТоваров, ДанныеТовара);
		
	Иначе
		
		СтрокаТовара = НайденныеСтрокиТовара[0];
		
	КонецЕсли;
	
	Возврат СтрокаТовара;
	
КонецФункции

Функция ПолучитьСтрокуКонтейнера(Процессор, Контейнер, МастерКонтейнер=Неопределено, Ячейка=Неопределено)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	ТаблицаКонтейнеров = Процессор.ТаблицаКонтейнеров;
	ДанныеКонтейнеров = Процессор.ДанныеКонтейнеров;
	
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	ПустаяЯчейка = Процессор.ПустаяЯчейка;
	
	ДанныеКонтейнера = Новый Структура;
	ДанныеКонтейнера.Вставить("Контейнер", Контейнер);
	ДанныеКонтейнера.Вставить("МастерКонтейнер", МастерКонтейнер);
	ДанныеКонтейнера.Вставить("Ячейка", Ячейка);
	
	Если ДанныеКонтейнера.МастерКонтейнер = Неопределено Тогда
		ДанныеКонтейнера.МастерКонтейнер = ПустойКонтейнер;
	КонецЕсли;
	
	Если ДанныеКонтейнера.Ячейка = Неопределено Тогда
		ДанныеКонтейнера.Ячейка = ПустаяЯчейка;
	КонецЕсли;
	
	ПоискКонтейнера = РК.СкопироватьОбъект(ДанныеКонтейнера);
	
	Если ПоискКонтейнера.МастерКонтейнер <> ПустойКонтейнер Тогда
		ПоискКонтейнера.Удалить("Ячейка");
	ИначеЕсли ПоискКонтейнера.Ячейка = ПустаяЯчейка Тогда
		ПоискКонтейнера.Удалить("МастерКонтейнер");
		ПоискКонтейнера.Удалить("Ячейка");
	КонецЕсли;
	
	НайденныеСтрокиПоКонтейнеру = РК.НайтиСтрокиКвазиТаблицыЗначений(ТаблицаКонтейнеров, ПоискКонтейнера);
	
	Если НайденныеСтрокиПоКонтейнеру.Количество() > 0 Тогда
		
		Возврат НайденныеСтрокиПоКонтейнеру[0];
		
	КонецЕсли;
	
	СтрокаКонтейнера = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаКонтейнеров);
	СтрокаКонтейнера.Уровень = 0;
	СтрокаКонтейнера.Ячейка = ДанныеКонтейнера.Ячейка;
	СтрокаКонтейнера.КонтейнерВерхнегоУровня = ДанныеКонтейнера.Контейнер;
	СтрокаКонтейнера.МастерКонтейнер = ПустойКонтейнер;
	Если ДанныеКонтейнера.МастерКонтейнер <> ПустойКонтейнер Тогда
		СтрокаМастерКонтейнера = ПолучитьСтрокуКонтейнера(Процессор, ДанныеКонтейнера.МастерКонтейнер);
		Если СтрокаМастерКонтейнера <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаКонтейнера, СтрокаМастерКонтейнера, "Ячейка, КонтейнерВерхнегоУровня");
			СтрокаКонтейнера.МастерКонтейнер = ДанныеКонтейнера.МастерКонтейнер;
			СтрокаКонтейнера.Уровень = СтрокаМастерКонтейнера.Уровень + 1;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаКонтейнера.Контейнер = ДанныеКонтейнера.Контейнер;
	СтрокаКонтейнера.ПолныеДанные = Ложь;
	СтрокаКонтейнера.ОсновныеДанныеКонтейнера = Ложь;
	СтрокаКонтейнера.Количество = 0;
	
	ИнициализироватьСтрокиКонтейнеров(Процессор, СтрокаКонтейнера);
	
	СтрокаОсновныхДанныхПоКонтейнеру = ДанныеКонтейнеров[Контейнер];
	Если ДанныеКонтейнеров[Контейнер] <> Неопределено Тогда
		// не добавляем в данные контейнеров так, как это дополнительная строка
		// итоги по товарам при этом общие
		ЗаполнитьЗначенияСвойств(СтрокаКонтейнера, СтрокаОсновныхДанныхПоКонтейнеру, "СтрокиИтогов, СтрокиОтклонений, СтрокиОбщихИтогов");
	Иначе
		ДанныеКонтейнеров[Контейнер] = СтрокаКонтейнера;
	КонецЕсли;
	
	РК.ИндексироватьСтрокиКвазиТаблицы(ТаблицаКонтейнеров, СтрокаКонтейнера);
	
	Возврат СтрокаКонтейнера;
	
КонецФункции

Функция ПолучитьИерархиюКонтейнеров(Процессор, Контейнеры=Неопределено)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ТаблицаКонтейнеров = Процессор.ТаблицаКонтейнеров;
	
	Если Контейнеры = Неопределено Тогда
		
		Возврат РК.ВыгрузитьЭлементыКоллекцииВМассив(ТаблицаКонтейнеров);
		
	КонецЕсли;
	
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	
	МассивКонтейнеров = РК.ЗначениеВМассив(Контейнеры, , Ложь);
	
	ДобавленныеКонтейнеры = Новый Соответствие;
	ПоискДанныхКонтейнера = Новый Структура("Контейнер");
	ПоискДанныхМастерКонтейнера = Новый Структура("МастерКонтейнер");
	
	МассивДанныхКонтейнеров = Новый Массив;
	// получим данные входящих контейнеров
	Для Каждого Контейнер Из МассивКонтейнеров Цикл
		
		Если Контейнер = ПустойКонтейнер Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДобавленныеКонтейнеры[Контейнер] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавленныеКонтейнеры[Контейнер] = Истина;
		
		ПоискДанныхКонтейнера.Контейнер = Контейнер;
		МассивДанныхКонтейнера = РК.НайтиЭлементыКоллекции(ТаблицаКонтейнеров, ПоискДанныхКонтейнера); 
		Для Каждого ДанныеКонтейнера Из МассивДанныхКонтейнера Цикл
			МассивДанныхКонтейнеров.Добавить(ДанныеКонтейнера);
		КонецЦикла;
		
	КонецЦикла;
	
	// получим данные контейнеров вверх по иерархии
	Для Каждого ДанныеКонтейнера Из МассивДанныхКонтейнеров Цикл
		
		Контейнер = ДанныеКонтейнера.МастерКонтейнер;
		
		Если Контейнер = ПустойКонтейнер Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДобавленныеКонтейнеры[Контейнер] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавленныеКонтейнеры[Контейнер] = Истина;
		
		ПоискДанныхКонтейнера.Контейнер = Контейнер;
		МассивДанныхКонтейнера = РК.НайтиЭлементыКоллекции(ТаблицаКонтейнеров, ПоискДанныхКонтейнера); 
		Для Каждого ДанныеКонтейнера Из МассивДанныхКонтейнера Цикл
			МассивДанныхКонтейнеров.Добавить(ДанныеКонтейнера);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивДанныхКонтейнеров;
	
КонецФункции

Функция ПолучитьУнифицированнуюТаблицуИзменений(Процессор, ТаблицаИзменений)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ПустаяЯчейка = Процессор.ПустаяЯчейка;
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	ТипЯчейка = Процессор.ТипЯчейка;
	ТипКонтейнер = Процессор.ТипКонтейнер;
	ТипЧисло = Процессор.ТипЧисло;
	
	УнифицированнаяТаблицаИзменений = Новый Массив;
	ПоляТаблицыИзменений = СтрЗаменить("Ячейка, Контейнер, %ТОВАРНЫЕПОЛЯ%, Количество, ИсходноеКоличество, Разница", "%ТОВАРНЫЕПОЛЯ%", Процессор.ТоварныеПоля);
	Для Каждого СтрокаИзменений Из РК.ПолучитьЭлементыКоллекции(ТаблицаИзменений) Цикл
		УнифицированнаяСтрокаИзменений = Новый Структура(ПоляТаблицыИзменений);
		ЗаполнитьЗначенияСвойств(УнифицированнаяСтрокаИзменений, СтрокаИзменений);
		Если ТипЗнч(УнифицированнаяСтрокаИзменений.Ячейка) <> ТипЯчейка Тогда
			УнифицированнаяСтрокаИзменений.Ячейка = ПустаяЯчейка;
		КонецЕсли;
		
		Если ТипЗнч(УнифицированнаяСтрокаИзменений.Контейнер) <> ТипКонтейнер Тогда
			УнифицированнаяСтрокаИзменений.Контейнер = ПустойКонтейнер;
		КонецЕсли;
		
		Если ТипЗнч(УнифицированнаяСтрокаИзменений.Количество) <> ТипЧисло Тогда
			УнифицированнаяСтрокаИзменений.Количество = 0;
		КонецЕсли;
		
		Если ТипЗнч(УнифицированнаяСтрокаИзменений.ИсходноеКоличество) <> ТипЧисло Тогда
			УнифицированнаяСтрокаИзменений.ИсходноеКоличество = 0;
		КонецЕсли;
		
		УнифицированнаяСтрокаИзменений.Разница = УнифицированнаяСтрокаИзменений.Количество - УнифицированнаяСтрокаИзменений.ИсходноеКоличество;
		
		УнифицированнаяТаблицаИзменений.Добавить(УнифицированнаяСтрокаИзменений);
	КонецЦикла;
	
	Возврат УнифицированнаяТаблицаИзменений;
	
КонецФункции

Функция ПолучитьТаблицуТоваровДляПодгрузкиДанных(Процессор, ТаблицаИзменений)
	
	СтрокиТоваровДляЗагрузки = Новый Массив;
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	ТипКонтейнер = Процессор.ТипКонтейнер;
	ПустаяЯчейка = Процессор.ПустаяЯчейка;
	ПустойТовар = Процессор.ПустойТовар;
	
	СтрокиИзменений = РК.ПолучитьЭлементыКоллекции(ТаблицаИзменений);
	
	Для Каждого СтрокаИзменений Из СтрокиИзменений Цикл
		
		Если СтрокаИзменений.Разница = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не (СтрокаИзменений.Ячейка <> ПустаяЯчейка И СтрокаИзменений.Контейнер = ПустойКонтейнер И СтрокаИзменений.Товар <> ПустойТовар И ТипЗнч(СтрокаИзменений.Товар) <> ТипКонтейнер) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиТоваровДляЗагрузки.Добавить(СтрокаИзменений);
		
	КонецЦикла;
	
	Возврат СтрокиТоваровДляЗагрузки;
	
КонецФункции

Функция ПолучитьКонтейнерыДляПодгрузкиПолныхДанных(Процессор, ТаблицаИзменений)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	ТипКонтейнер = Процессор.ТипКонтейнер;
	ТаблицаКонтейнеров = Процессор.ТаблицаКонтейнеров;
	
	ПоискКонтейнера = Новый Структура("Контейнер");
	
	СтрокиИзменений = РК.ПолучитьЭлементыКоллекции(ТаблицаИзменений);
	
	МассивКонтейнеровЗагрузитьПолныеДанные = Новый Массив;
	
	Для Каждого СтрокаИзменений Из СтрокиИзменений Цикл
		
		Если СтрокаИзменений.Разница = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаИзменений.Товар) <> ТипКонтейнер Тогда
			Продолжить;
		КонецЕсли;
		
		Контейнер = СтрокаИзменений.Товар;
		Если МассивКонтейнеровЗагрузитьПолныеДанные.Найти(Контейнер) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПолныеДанныеЗагружены = Ложь;
		ПоискКонтейнера.Контейнер = Контейнер;
		НайденныеСтрокиКонтейнера = РК.НайтиЭлементыКоллекции(ТаблицаКонтейнеров, ПоискКонтейнера);
		Для Каждого СтрокаКонтейнера Из НайденныеСтрокиКонтейнера Цикл
			Если СтрокаКонтейнера.ПолныеДанные Тогда
				ПолныеДанныеЗагружены = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ПолныеДанныеЗагружены Тогда
			МассивКонтейнеровЗагрузитьПолныеДанные.Добавить(Контейнер);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивКонтейнеровЗагрузитьПолныеДанные;
	
КонецФункции

Функция ПолучитьКонтейнерыДляПодгрузкиНеполныхДанных(Процессор, ТаблицаИзменений)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	ТипКонтейнер = Процессор.ТипКонтейнер;
	ТаблицаКонтейнеров = Процессор.ТаблицаКонтейнеров;
	
	ПоискКонтейнера = Новый Структура("Контейнер");
	
	СтрокиИзменений = РК.ПолучитьЭлементыКоллекции(ТаблицаИзменений);
	
	МассивКонтейнеровЗагрузитьНеполныеДанные = Новый Массив;
	
	Для Каждого СтрокаИзменений Из СтрокиИзменений Цикл
		
		Контейнер = СтрокаИзменений.Контейнер;
		Если Контейнер = ПустойКонтейнер Тогда
			Продолжить;
		КонецЕсли;
		
		ПоискКонтейнера.Контейнер = Контейнер;
		НайденныеСтрокиКонтейнера = РК.НайтиЭлементыКоллекции(ТаблицаКонтейнеров, ПоискКонтейнера);
		
		Если НайденныеСтрокиКонтейнера.Количество() = 0 Тогда
			МассивКонтейнеровЗагрузитьНеполныеДанные.Добавить(Контейнер);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивКонтейнеровЗагрузитьНеполныеДанные;
	
КонецФункции

Функция ПолучитьТаблицуОборотовПриАгрегированииКонтейнеров(ПроцессорУО, ТаблицаОприходований, ТаблицыСписанийОстатковПоЯчейкам)
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаОборотов = РК.НоваяТаблицаЗначений(ПроцессорУО.ВсеПоляТаблицыОборотов);
	РК.ДобавитьЭлементыКоллекции(ТаблицаОборотов, ТаблицаОприходований);
	Если ТаблицыСписанийОстатковПоЯчейкам <> Неопределено Тогда
		Для Каждого ТаблицаСписанийОстатковПоЯчейкам Из ТаблицыСписанийОстатковПоЯчейкам Цикл
			Для Каждого СтрокаСписания Из РК.ПолучитьЭлементыКоллекции(ТаблицаСписанийОстатковПоЯчейкам) Цикл
				СтрокаТаблицыОборотов = ТаблицаОборотов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыОборотов, СтрокаСписания);
				СтрокаТаблицыОборотов.Количество = -СтрокаСписания.Количество;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	ТаблицаОборотов.Свернуть(ПроцессорУО.ПоляГруппыТаблицыОборотов, ПроцессорУО.ПоляИтоговТаблицыОборотов);
	РК.УдалитьПустыеСтрокиКоллекции(ТаблицаОборотов, ПроцессорУО.ПоляИтоговТаблицыОборотов);
	
	Возврат ТаблицаОборотов;
	
КонецФункции

Функция ПолучитьДокументАгрегированияКонтейнера(ПроцессорУО, РеквизитыДокументаОперации, МассивМастерКонтейнеров, ТаблицаДвижений, ПараметрыФункции = Неопределено)
	
	РК = вмс_РаботаСКоллекциями;
	
	ОперацияПоЯчейкам = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
	ОперацияПоЯчейкам.Заполнить(Неопределено);
	РК.УстановитьЭлементыКоллекции(ОперацияПоЯчейкам.Товары, ТаблицаДвижений);
	
	Если ОперацияПоЯчейкам.Товары.Количество() > 0 ИЛИ ОперацияПоЯчейкам.АгрегацияКонтейнеров.Количество() > 0 Тогда
		
		Комментарий = "Агрегирование " + ?(МассивМастерКонтейнеров.Количество() > 1, "контейнеров", "контейнера") + " ";
		Комментарий = Комментарий + вмс_РаботаСКоллекциями.МассивВСтроку(МассивМастерКонтейнеров);
		
		ОперацияПоЯчейкам.Дата = ТекущаяДата();
		ОперацияПоЯчейкам.Комментарий = Комментарий;
		
		Если ТипЗнч(РеквизитыДокументаОперации) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ОперацияПоЯчейкам, РеквизитыДокументаОперации);
		КонецЕсли; 
		
		Если РеквизитыДокументаОперации = Неопределено Тогда
			ОперацияПоЯчейкам.Ответственный = ПараметрыФункции.Ответственный;
			ОперацияПоЯчейкам.ВидОперации = ПараметрыФункции.ВидОперации;
		КонецЕсли;	
		
		ОперацияПоЯчейкам.ВидСубОперации = вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьСсылкуНаВидОперацииПоЯчейкам("ИзменитьПаллету");
		ОперацияПоЯчейкам.Записать(РежимЗаписиДокумента.Проведение);
		
		Возврат ОперацияПоЯчейкам.Ссылка;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМестаКонтейнеров(Контейнеры)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Место,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	НЕОПРЕДЕЛЕНО КАК МастерКонтейнер,
	|	вмс_ОперацияПоЯчейкамОстатки.Контейнер КАК Контейнер
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
	|			,
	|			Контейнер В (&Контейнеры)
	|				И Ячейка <> ЗНАЧЕНИЕ(Справочник.вмс_МестаХранения.ПустаяСсылка)) КАК вмс_ОперацияПоЯчейкамОстатки
	|ГДЕ
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток > 0
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	вмс_ОстаткиВКонтейнерахОстатки.Контейнер,
	|	НЕОПРЕДЕЛЕНО,
	|	вмс_ОстаткиВКонтейнерахОстатки.Контейнер,
	|	вмс_ОстаткиВКонтейнерахОстатки.Товар
	|ИЗ
	|	РегистрНакопления.вмс_ОстаткиВКонтейнерах.Остатки(
	|			,
	|			Товар В (&Контейнеры)
	|				И Контейнер <> ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка)) КАК вмс_ОстаткиВКонтейнерахОстатки
	|ГДЕ
	|	вмс_ОстаткиВКонтейнерахОстатки.КоличествоОстаток > 0";
	Запрос.УстановитьПараметр("Контейнеры", Контейнеры);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаМестКонтейнеров = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаМестКонтейнеров;
	
КонецФункции

Функция ПолучитьКонтейнерыНаМестах(Контейнеры)
	
	ТаблицаМестКонтейнеров = ПолучитьМестаКонтейнеров(Контейнеры);
	ТаблицаМестКонтейнеров.Свернуть("Контейнер");
	КонтейнерыНаМестах = ТаблицаМестКонтейнеров.ВыгрузитьКолонку("Контейнер");
	
	Возврат КонтейнерыНаМестах;
	
КонецФункции

Функция ВыполнитьСписанияОстатковПриАгрегированииКонтейнеров(ПроцессорУО, ТаблицаДвижений, ТаблицыОстатковДляСписанияПоЯчейкам)
	
	Если ТипЗнч(ТаблицыОстатковДляСписанияПоЯчейкам) <> Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РК = ПроцессорУО.ОбщиеМодули.РаботаСКоллекциями;
	ПустаяЯчейка = ПроцессорУО.ПустаяЯчейка;
	ТоварныеПоля = ПроцессорУО.ТоварныеПоля;
	
	СтрокиДвижений = РК.ПолучитьЭлементыКоллекции(ТаблицаДвижений);
	
	СтрокиСписанийПоЯчейкам = Новый Массив;
	Для Каждого СтрокаДвижения Из СтрокиДвижений Цикл
		Если СтрокаДвижения.Ячейка <> ПустаяЯчейка Тогда
			СтрокиСписанийПоЯчейкам.Добавить(СтрокаДвижения);
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиСписанийПоЯчейкам.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицыСписанийОстатковПоЯчейкам = Новый Массив;
	
	ПоляГруппыТаблицыТоваров = "Ячейка, Контейнер" + ", " + ТоварныеПоля;
	ПоляИтоговТаблицыТоваров = "Количество";
	ВсеПоляТаблицыТоваров = ПоляГруппыТаблицыТоваров + ", " + ПоляИтоговТаблицыТоваров;
	
	ПоискТовара = Новый Структура(ПоляГруппыТаблицыТоваров);
	Для Каждого ТаблицаОстатковДляСписанияПоЯчейкам Из ТаблицыОстатковДляСписанияПоЯчейкам Цикл
		ТаблицаСписанийОстатковПоЯчейкам = РК.НоваяТаблицаЗначений(ВсеПоляТаблицыТоваров);
		Для Каждого СтрокаСписания Из СтрокиСписанийПоЯчейкам Цикл
			ЗаполнитьЗначенияСвойств(ПоискТовара, СтрокаСписания);
			НайденныеСтрокиОстатков = РК.НайтиЭлементыКоллекции(ТаблицаОстатковДляСписанияПоЯчейкам, ПоискТовара);
			Для Каждого СтрокаОстатка Из НайденныеСтрокиОстатков Цикл
				МожноСписать = Мин(СтрокаОстатка.Количество, СтрокаСписания.Количество);
				Если МожноСписать > 0 Тогда
					НоваяСтрокаСписания = ТаблицаСписанийОстатковПоЯчейкам.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаСписания, ПоискТовара);
					НоваяСтрокаСписания.Количество = МожноСписать;
					СтрокаСписания.Количество = СтрокаСписания.Количество - МожноСписать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		ТаблицаСписанийОстатковПоЯчейкам.Свернуть(ПоляГруппыТаблицыТоваров, ПоляИтоговТаблицыТоваров);
		ТаблицыСписанийОстатковПоЯчейкам.Добавить(ТаблицаСписанийОстатковПоЯчейкам);
	КонецЦикла;
	
	УдаляемыеСтрокиДвижений = Новый Массив;
	Для Каждого СтрокаСписания Из СтрокиСписанийПоЯчейкам Цикл
		
		Если СтрокаСписания.Количество = 0 Тогда
			УдаляемыеСтрокиДвижений.Добавить(СтрокаСписания);
		КонецЕсли;
		
	КонецЦикла;
	РК.УдалитьЭлементыКоллекции(ТаблицаДвижений, УдаляемыеСтрокиДвижений);
	
	Возврат ТаблицыСписанийОстатковПоЯчейкам;
	
КонецФункции

Функция ПолучитьТаблицуОборотовБезИерархииПриАгрегированииКонтейнеров(ПроцессорУО, СтрокиДвижений)
	
	РК = вмс_РаботаСКоллекциями;
	
	ПустойКонтейнер = ПроцессорУО.ПустойКонтейнер;
	
	ТаблицаОборотовБезИерархии = РК.НоваяТаблицаЗначений(ПроцессорУО.ВсеПоляТаблицыОборотов);
	Для Каждого СтрокаДвижения Из СтрокиДвижений Цикл
		Если СтрокаДвижения.КонтейнерПриемник <> ПустойКонтейнер И СтрокаДвижения.Контейнер = ПустойКонтейнер Тогда
			СтрокаТаблицыОборотов = ТаблицаОборотовБезИерархии.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыОборотов, СтрокаДвижения);
			СтрокаТаблицыОборотов.Контейнер = СтрокаДвижения.КонтейнерПриемник;
		КонецЕсли;
		
		Если СтрокаДвижения.КонтейнерОтправитель <> ПустойКонтейнер И СтрокаДвижения.Контейнер = ПустойКонтейнер Тогда
			СтрокаТаблицыОборотов = ТаблицаОборотовБезИерархии.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыОборотов, СтрокаДвижения);
			СтрокаТаблицыОборотов.Контейнер = СтрокаДвижения.КонтейнерОтправитель;
			СтрокаТаблицыОборотов.Количество = -СтрокаДвижения.Количество;
		КонецЕсли;
	КонецЦикла;
	ТаблицаОборотовБезИерархии.Свернуть(ПроцессорУО.ПоляГруппыТаблицыОборотов, ПроцессорУО.ПоляИтоговТаблицыОборотов);
	РК.УдалитьПустыеСтрокиКоллекции(ТаблицаОборотовБезИерархии, ПроцессорУО.ПоляИтоговТаблицыОборотов);
	
	Возврат ТаблицаОборотовБезИерархии;
	
КонецФункции


Функция ПолучитьСуперКонтейнер()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипПартии", "Супер контейнер");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_Контейнеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_Контейнеры КАК вмс_Контейнеры
	|ГДЕ
	|	вмс_Контейнеры.ТипТары В
	|			(ВЫБРАТЬ
	|				ТипыКонтейнеров.Ссылка КАК Ссылка
	|			ИЗ
	|				ПланВидовХарактеристик.ТипыКонтейнеров КАК ТипыКонтейнеров
	|			ГДЕ
	|				ТипыКонтейнеров.Наименование = &ТипПартии)
	|	И НЕ вмс_Контейнеры.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.вмс_Контейнеры.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;	
КонецФункции

Функция ПолучитьПустойКонтейнер()
	Возврат Справочники.вмс_Контейнеры.ПустаяСсылка();	
КонецФункции

Функция ПроверитьЛицензию()
	
	Возврат вмс_ОбщегоНазначенияВызовСервера.Модуль("вмс_ЗащищенныйМодуль").вмс_ЛицензияКонтейнерыДоступна();
	
КонецФункции
