
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	ОсновныеДанныеЗаполнены = ЗаполнитьОсновныеДанныеОбработкиИзРегистра();    
	Если ОсновныеДанныеЗаполнены Тогда
		ЗаполнитьТаблицуОстаткиНаСкладе();
		Элементы.Декорация1.Видимость = Ложь;
	Иначе    
		Элементы.ГруппаКомандыШапки.Видимость = Ложь;
		Элементы.ГруппаТелаФормы.Видимость = Ложь;
		Элементы.Декорация1.Заголовок = "Обратитесь к хранителю оказывающему услуги! Необходимо выполнить настройки для вашего личного кабинета поклажедателя!";
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗавершениеРаботы Тогда
		ЭтоПоклажедатель = ВМС_ЛичныйКабинетПоклажедателяВызовСервер.ПроверитьНаРольПоклажедателя();
		Если ЭтоПоклажедатель Тогда	
			ЗавершитьРаботуСистемы(Истина);
		КонецЕсли;                    
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)  	
	ЗаполнитьТаблицуОстаткиНаСкладе();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)  	
	ЗаполнитьТаблицуОстаткиНаСкладе();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОстаткиНаСкладе

&НаСервере
Процедура ЗаполнитьТаблицуОстаткиНаСкладе()	
	
	УстановитьПривилегированныйРежим(Истина);
	
	лТекст = "ВЫБРАТЬ
	|	вмс_ТоварыПоклажедателей.Товар КАК Номенклатура,
	|	вмс_ТоварыПоклажедателей.Контрагент КАК Контрагент,
	|	вмс_ТоварыПоклажедателей.Организация КАК Организация,
	|	СУММА(ТоварыОрганизацийОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрСведений.вмс_ТоварыПоклажедателей КАК вмс_ТоварыПоклажедателей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки КАК ТоварыОрганизацийОстатки
	|		ПО вмс_ТоварыПоклажедателей.Товар = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	|			И вмс_ТоварыПоклажедателей.Организация = ТоварыОрганизацийОстатки.Организация
	|ГДЕ
	|	вмс_ТоварыПоклажедателей.Контрагент = &Контрагент
	|	И вмс_ТоварыПоклажедателей.Организация = &Организация
	|	И ТоварыОрганизацийОстатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_ТоварыПоклажедателей.Товар,
	|	вмс_ТоварыПоклажедателей.Контрагент,
	|	вмс_ТоварыПоклажедателей.Организация";
	
	лЗапрос = Новый Запрос(лТекст);
	
	лЗапрос.УстановитьПараметр("Контрагент", Контрагент);
	лЗапрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = лЗапрос.Выполнить();
	
	ОстаткиНаСкладе.Загрузить(РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиНаСкладеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;       
	ОбработкаВводаТовараВТаблицу("Возврат");
КонецПроцедуры      

&НаКлиенте
Процедура ВычестьКоличествоИзТаблицыОстатков(ДобавляемыйТовар)
	СтруктураОтбора = Новый Структура("Номенклатура", ДобавляемыйТовар.Номенклатура);
	НайденнаяСтрока = ОстаткиНаСкладе.НайтиСтроки(СтруктураОтбора);
	Если НайденнаяСтрока.Количество() > 0 Тогда
		Строка = НайденнаяСтрока[0];
		Строка.Количество = Строка.Количество - ДобавляемыйТовар.Количество;
		Если Строка.Количество = 0 Тогда
			ИндексТовара = Строка.ПОлучитьИдентификатор();
			ОстаткиНаСкладе.Удалить(Строка);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ВычестьКоличествоИзТаблицыОстатков()

&НаКлиенте
Процедура ОстаткиНаСкладеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыВозвратТовара
&НаКлиенте
Процедура ДобавитьТоварВВозвратТовара(ДанныеТовара, КоличествоТовара , Идентификатор = Неопределено)
	
	НоваяСтрока = ВозвратТоваров.Добавить();   
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеТовара);  
	
	НоваяСтрока.Количество = КоличествоТовара;
	ВычестьКоличествоВТаблицеИсточнике(ДанныеТовара, КоличествоТовара, Идентификатор);
	
КонецПроцедуры // ДобавитьТоварВВозвратТовара()

&НаКлиенте
Процедура ДобавитьТоварКВозврату(Команда) 
	
	ОбработкаВводаТовараВТаблицу("Возврат");    
	
КонецПроцедуры   

&НаКлиенте
Процедура УбратьТоварИзВозврата(Команда)
	УдалитьТоварИзТаблицы();
КонецПроцедуры       

&НаКлиенте
Процедура ВозвратТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыСдатьНаХранение
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьРаспоряжениеНаОтгрузку(Команда)
	СоздатьРаспоряжение("Реализация");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКарточкуТовара(Команда)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Контрагент", Контрагент);
	ДополнительныеПараметры.Вставить("Организация", Организация);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьКарточкуТовараЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.вмс_КабинетПоклажедателя.Форма.ФормаСозданияНоменклатуры",ДополнительныеПараметры,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры   

&НаКлиенте
Процедура СоздатьКарточкуТовараЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НоваяСтрокаТЧ = СдатьНаХранение.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, Результат);		
	КонецЕсли;
	
КонецПроцедуры // СоздатьКарточкуТовараЗавершение()
&НаКлиенте
Процедура ВыбратьИзСпискаТоваров(Команда)       
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Контрагент", Контрагент);
	ДополнительныеПараметры.Вставить("Организация", Организация);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьИзСпискаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.вмс_КабинетПоклажедателя.Форма.ФормаСпискаТоваровПоклажедателя",ДополнительныеПараметры,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый); 
	
КонецПроцедуры    

&НаКлиенте
Процедура ВыбратьИзСпискаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) И ТипЗнч(Результат) = Тип("Массив") Тогда
		Для каждого Строка Из Результат Цикл	
			НоваяСтрокаТЧ = СдатьНаХранение.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, Строка);	
		КонецЦикла;		
	КонецЕсли;    
	
КонецПроцедуры // ВыбратьИзСпискаЗавершение()

&НаКлиенте
Процедура ЗагрузитьИзЕксель(Команда)  
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ТаблицаПриемник", "СдатьНаХранение");   
	ДополнительныеПараметры.Вставить("Контрагент", Контрагент);  
	ДополнительныеПараметры.Вставить("Организация", Организация);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзЕксельЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.вмс_КабинетПоклажедателя.Форма.ФормаЗагрузкиТоваровИзЕксель",ДополнительныеПараметры,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьИзЕксельЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) И ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Для каждого Строка Из Результат.МассивОбработанныхТоваров Цикл  
			НоваяСтрокаТЧ = СдатьНаХранение.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, Строка);		
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры // ()         

&НаКлиенте
Процедура СоздатьРаспоряжениеНаПриемку(Команда)   
	
	СоздатьРаспоряжение("Приобретение");  
	
КонецПроцедуры    

&НаКлиенте
Процедура ЗагрузитьТоварыНаОтгрузкуИзЕксель(Команда)       
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ТаблицаПриемник", "ВозвратТоваров");
	ДополнительныеПараметры.Вставить("Контрагент", Контрагент);   
	ДополнительныеПараметры.Вставить("Организация", Организация);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьТоварыНаОтгрузкуИзЕксельЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.вмс_КабинетПоклажедателя.Форма.ФормаЗагрузкиТоваровИзЕксель",ДополнительныеПараметры,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры      

&НаКлиенте
Процедура ЗагрузитьТоварыНаОтгрузкуИзЕксельЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) И (ТипЗнч(Результат) = Тип("Структура") ИЛИ ТипЗнч(Результат) = Тип("Массив")) Тогда
		Для каждого Строка Из Результат.МассивОбработанныхТоваров Цикл  
			НоваяСтрокаТЧ = ВозвратТоваров.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, Строка);
			Если  Строка.Количество > Строка.КоличествоНаОстатках Тогда
				Сообщение = Новый СообщениеПользователю; 
				ТекстСообщения = СтрШаблон("Недостаточно товара %1. Добавляется к отгрузке - %2, в наличии на складе -  %3", Строка.Номенклатура, Строка.Количество, Строка.КоличествоНаОстатках);
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();	             
				НоваяСтрокаТЧ.Количество = Строка.КоличествоНаОстатках;
			КонецЕсли;
			ВычестьКоличествоИзТаблицыОстатков(НоваяСтрокаТЧ);	
		КонецЦикла;	
		
		Если Результат.МассивНеОбработанныхТоваров.Количество() > 0 Тогда
			Для каждого Строка Из Результат.МассивНеОбработанныхТоваров Цикл
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Товара %1 нет в базе данных!", Строка);
				Сообщение.Сообщить();		
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры // ЗагрузитьТоварыНаОтгрузкуИзЕксель()

&НаКлиенте
Процедура РаспоряженияНаЗабор(Команда)   
	ОткрытьСписокРаспоряжений("Забор");
КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьСписокРаспоряжений(ТипРаспоряжения)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Контрагент", Контрагент);
	ДополнительныеПараметры.Вставить("Организация", Организация); 
	ДополнительныеПараметры.Вставить("ТипРаспоряжения", ТипРаспоряжения); 
	ДополнительныеПараметры.Вставить("Пользователь", Пользователь);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьСписокРаспоряженийЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.вмс_КабинетПоклажедателя.Форма.ФормаСпискаРаспоряжений",ДополнительныеПараметры,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры // ()

&НаКлиенте
Процедура ОткрытьСписокРаспоряженийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТочкаОстановы = Истина;	
	
КонецПроцедуры // ОткрытьСписокРаспоряженийЗавершение()

&НаКлиенте
Процедура РаспоряженияНаОтгрузку(Команда)
	ОткрытьСписокРаспоряжений("Отгрузка");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьОсновныеДанныеОбработкиИзРегистра()
	
	УстановитьПривилегированныйРежим(Истина);
	
	лТекст = "ВЫБРАТЬ
	|	вмс_СписокПоклажедателей.Контрагент КАК Контрагент,
	|	вмс_СписокПоклажедателей.Организация КАК Организация,
	|	вмс_СписокПоклажедателей.Склад КАК Склад,
	|	вмс_СписокПоклажедателей.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.вмс_СписокПоклажедателей КАК вмс_СписокПоклажедателей
	|ГДЕ
	|	вмс_СписокПоклажедателей.Пользователь = &Пользователь";
	
	лЗапрос = Новый Запрос(лТекст);
	
	лЗапрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	РезультатЗапроса = лЗапрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Контрагент = Выборка.Контрагент; 
		Пользователь = Выборка.Пользователь;
		Организация = Выборка.Организация;
		Склад = Выборка.Склад;
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции // ЗаполнитьОсновныеДанныеОбработки()()
&НаКлиенте
Процедура ОбработкаВводаТовараВТаблицу(НаименованиеТаблицыПриемника)  
	
	ДополнительныеПараметры = Новый Структура("НаименованиеТаблицыПриемника", НаименованиеТаблицыПриемника);
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект, ДополнительныеПараметры);	
	ПоказатьВводЗначения(Оповещение,,"Введите количество товара","Число");       
	
КонецПроцедуры // ОбработкаВводаТовараВТаблицу()

&НаКлиенте
Процедура ПослеВводаКоличества(Результат, Параметры) Экспорт	
	
	Если Не Результат = Неопределено Тогда 
		Если Параметры.НаименованиеТаблицыПриемника = "Возврат" Тогда  
			// ТУ_Прошин_08.08.24+
			ВыделенныеСтроки = Элементы.ОстаткиНаСкладе.ВыделенныеСтроки;  
			Для Каждого Строка Из ВыделенныеСтроки Цикл
				ТекущиеДанные = ОстаткиНаСкладе.НайтиПоИдентификатору(Строка);
				Если ТекущиеДанные.Количество < Результат Тогда
					
					ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Некорректный ввод количества! Введено больше товара - %1 чем отдано на хранение - %2!",ТекущиеДанные.Номенклатура, ТекущиеДанные.Количество));
				Иначе
					ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор(); 
					ДобавитьТоварВВозвратТовара(ТекущиеДанные, Результат, ИдентификаторСтроки);
				КонецЕсли;
				
			КонецЦикла;	
			// ТУ_Прошин_08.08.24-
			
		ИначеЕсли Параметры.НаименованиеТаблицыПриемника = "Остатки" Тогда 
			
			// ТУ_Прошин_08.08.24+
			ВыделенныеСтроки = Элементы.ВозвратТоваров.ВыделенныеСтроки;  
			Для Каждого Строка Из ВыделенныеСтроки Цикл
				ТекущиеДанные = ВозвратТоваров.НайтиПоИдентификатору(Строка);
				Если ТекущиеДанные.Количество < Результат Тогда
					
					ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Некорректный ввод количества! Введено больше товара - %1 чем указано в таблице - %2!",ТекущиеДанные.Номенклатура, ТекущиеДанные.Количество));
				Иначе
					ОбработатьЧастичноеУдалениеТовараИзТаблицы(Результат, ТекущиеДанные, Строка);
				КонецЕсли;			
			КонецЦикла;	
			// ТУ_Прошин_08.08.24-
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры   
&НаКлиенте
Процедура ВычестьКоличествоВТаблицеИсточнике(ДанныеТовара, КоличествоТовара, Идентификатор)
	
	ДанныеТовара.Количество = ДанныеТовара.Количество - КоличествоТовара;	
	Если ДанныеТовара.Количество = 0 Тогда	
		ОстаткиНаСкладе.Удалить(ОстаткиНаСкладе.НайтиПоИдентификатору(Идентификатор));	 	
	КонецЕсли;
	
КонецПроцедуры // ВычестьКоличествоВТаблицеИсточнике()

&НаКлиенте
Процедура УдалитьТоварИзТаблицы()
	ТекущиеДанные = Элементы.ВозвратТоваров.ТекущиеДанные;  
	ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор();       
	// ТУ_Прошин_08.08.24+   
	ВыделенныеСтроки = Элементы.ВозвратТоваров.ВыделенныеСтроки;
	ДополнительныеПараметры = Новый Структура("ВыделенныеСтроки, ИдентификаторСтроки", ВыделенныеСтроки);
	//ДополнительныеПараметры = Новый Структура("ДанныеТовара, ИдентификаторСтроки", ТекущиеДанные, ИдентификаторСтроки); 
	// ТУ_Прошин_08.08.24-
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаУдалитьТоварЦеликом",
	ЭтотОбъект,ДополнительныеПараметры);	
	
	ПоказатьВопрос(Оповещение,
	"Удалить товар целиком?",
	РежимДиалогаВопрос.ДаНетОтмена,0,КодВозвратаДиалога.Да,"Отмена добавления товара");     
	
КонецПроцедуры      

&НаКлиенте
Процедура ПослеЗакрытияВопросаУдалитьТоварЦеликом(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		// ТУ_Прошин_08.08.24+                        
		МассивУдаляемыхСтрок = Новый Массив;
		//ДанныеТовара = Параметры.ДанныеТовара;    
		Для Каждого Строка Из Параметры.ВыделенныеСтроки Цикл    
			ДанныеТовара = ВозвратТоваров.НайтиПоИдентификатору(Строка);
			// ТУ_Прошин_08.08.24-
			ОтборТовара = Новый Структура("Номенклатура", ДанныеТовара.Номенклатура);
			НайденнаяСтрока = ОстаткиНаСкладе.НайтиСтроки(ОтборТовара);
			Если НайденнаяСтрока.Количество() > 0 Тогда
				НайденнаяСтрока[0].Количество = НайденнаяСтрока[0].Количество + ДанныеТовара.Количество; 
			Иначе
				НоваяСтрокаОстатков = ОстаткиНаСкладе.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаОстатков, ДанныеТовара);	
			КонецЕсли;   
			МассивУдаляемыхСтрок.Добавить(ДанныеТовара);
			//ВозвратТоваров.Удалить(ДанныеТовара);  
		КонецЦикла; 
		Если МассивУдаляемыхСтрок.Количество() > 0 Тогда
			Для Каждого Строка Из МассивУдаляемыхСтрок Цикл
				ВозвратТоваров.Удалить(Строка);		
			КонецЦикла;
		КонецЕсли;
		
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда 
		ОбработкаВводаТовараВТаблицу("Остатки");
	КонецЕсли;	
	
	
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработатьЧастичноеУдалениеТовараИзТаблицы(КоличествоНаУдаление, ДанныеТовара, Идентификатор)
	
	ДанныеТовара.Количество = ДанныеТовара.Количество - КоличествоНаУдаление;
	
	ОтборТовара = Новый Структура("Номенклатура", ДанныеТовара.Номенклатура);
	НайденнаяСтрока = ОстаткиНаСкладе.НайтиСтроки(ОтборТовара);
	Если НайденнаяСтрока.Количество() > 0 Тогда
		
		НайденнаяСтрока[0].Количество = НайденнаяСтрока[0].Количество + КоличествоНаУдаление;
	Иначе
		НоваяСтрокаОстатков = ОстаткиНаСкладе.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОстатков, ДанныеТовара);
		НоваяСтрокаОстатков.Количество = КоличествоНаУдаление;
	КонецЕсли;
	Если ДанныеТовара.Количество = 0 Тогда	
		ВозвратТоваров.Удалить(ВозвратТоваров.НайтиПоИдентификатору(Идентификатор));
	КонецЕсли;
	
КонецПроцедуры // ОбработатьЧастичноеУдалениеТовараИзТаблицы()

&НаСервере
Процедура СоздатьРаспоряжение(ТипРаспоряжения)
	
	ЭтоУТ =  вмс_АдаптацияКонфигураций.ЭтоУТ();
	ЭтоЕРП = вмс_АдаптацияКонфигураций.ЭтоЕРП();
	ЭтоУНФ = вмс_АдаптацияКонфигураций.ЭтоУНФ();
	
	Если ЭтоУТ Тогда
		ВалютаДокумента = Константы.ВалютаУправленческогоУчета.Получить(); 
		модОбработкаТабличнойЧастиКлиентСервер = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ОбщийМодуль("ОбработкаТабличнойЧастиКлиентСервер"); 
		модОбработкаТабличнойЧастиСервер = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ОбщийМодуль("ОбработкаТабличнойЧастиСервер");
	ИначеЕсли ЭтоЕРП Тогда
		ВалютаДокумента = Константы.ВалютаУправленческогоУчета.Получить(); 
		модОбработкаТабличнойЧастиКлиентСервер = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ОбщийМодуль("ПакетнаяОбработкаТабличнойЧастиКлиентСервер"); 
		модОбработкаТабличнойЧастиСервер = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ОбщийМодуль("ПакетнаяОбработкаТабличнойЧастиСервер");
	ИначеЕсли ЭтоУНФ Тогда
		ВалютаДокумента = Константы.ВалютаУчета.Получить();
		модОбработкаТабличнойЧастиКлиентСервер = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ОбщийМодуль("ТабличныеЧастиУНФКлиентСервер");
	КонецЕсли;
	
	Если ТипРаспоряжения = "Приобретение" Тогда
		
		ТаблицаТоваров = СдатьНаХранение;
		
		Если ЭтоУТ ИЛИ ЭтоЕРП Тогда
			НовыйДокумент = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Заполнить(Неопределено);
			
			НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
			НовыйДокумент.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;  
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;  
			НовыйДокумент.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
		ИначеЕсли ЭтоУНФ Тогда
			НовыйДокумент = Документы.ПриходнаяНакладная.СоздатьДокумент();
			
			НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;  
		КонецЕсли;
		
	ИначеЕсли ТипРаспоряжения = "Реализация" Тогда
		
		ТаблицаТоваров = ВозвратТоваров;	
		
		Если ЭтоУТ ИЛИ ЭтоЕРП Тогда
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;  
			НовыйДокумент.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
		ИначеЕсли ЭтоУНФ Тогда
			НовыйДокумент = Документы.РасходнаяНакладная.СоздатьДокумент();
			НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
			НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;  
		КонецЕсли;
	КонецЕсли;
	
	НовыйДокумент.Дата = ТекущаяДата();
	НовыйДокумент.Контрагент = Контрагент;
	НовыйДокумент.Организация = Организация; 
	НовыйДокумент.Автор = ИмяПользователя();
	Если ЭтоУТ ИЛИ ЭтоЕРП Тогда
		НовыйДокумент.Партнер = Контрагент.Партнер; 
		НовыйДокумент.Склад = Склад;
		НовыйДокумент.ЦенаВключаетНДС = Истина;
		НовыйДокумент.Валюта = ВалютаДокумента;
		НовыйДокумент.ВалютаВзаиморасчетов = ВалютаДокумента;
		ТабличнаяЧастьДокумента = НовыйДокумент.Товары;
	ИначеЕсли ЭтоУНФ Тогда
		НовыйДокумент.СтруктурнаяЕдиница = Склад;
		НовыйДокумент.СуммаВключаетНДС = Истина;
		НовыйДокумент.ВалютаДокумента = ВалютаДокумента;
		ТабличнаяЧастьДокумента = НовыйДокумент.Запасы;
	КонецЕсли;
	
	ТабличнаяЧастьДокумента.Загрузить(ТаблицаТоваров.Выгрузить());
	
	Если ЭтоУТ ИЛИ ЭтоЕРП Тогда 
		СтруктураПересчетаСуммы = модОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент);
		СтруктураДействий = Новый Структура; 
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
	КонецЕсли;
	
	Для Каждого Строка Из ТабличнаяЧастьДокумента Цикл
		Строка.Цена = 1;
		Если ЭтоУТ ИЛИ ЭтоЕРП Тогда
			Строка.Склад = НовыйДокумент.Склад;
			Строка.КоличествоУпаковок = Строка.Количество;
			Строка.СтавкаНДС = Строка.Номенклатура.СтавкаНДС;
			модОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, Неопределено);
		ИначеЕсли ЭтоУНФ Тогда
			Строка.СтруктурнаяЕдиница = НовыйДокумент.СтруктурнаяЕдиница;
			Строка.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(Строка.Номенклатура.ВидСтавкиНДС);
			ПараметрыРасчета = Новый Структура("РассчитатьСумму, СуммаВключаетНДС", Истина, Истина);
			АдаптацияУНФ = модОбработкаТабличнойЧастиКлиентСервер.РассчитатьСуммыВСтрокеТЧ(Строка, ПараметрыРасчета);
		КонецЕсли;
	КонецЦикла;
	
	Если ЭтоУТ ИЛИ ЭтоЕРП Тогда
		ИтоговаяСумма = ТабличнаяЧастьДокумента.Итог("СуммаСНДС");
		НовыйДокумент.СуммаВзаиморасчетов = ИтоговаяСумма;
		НовыйДокумент.СуммаДокумента = ИтоговаяСумма;
	ИначеЕсли ЭтоУНФ Тогда
		ИтоговаяСумма = ТабличнаяЧастьДокумента.Итог("Сумма");
		НовыйДокумент.СуммаДокумента = ИтоговаяСумма;
	КонецЕсли;
	
	НовыйДокумент.Комментарий = "Созданно программно в результате действий поклажедателя " + ИмяПользователя();
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		УдалостьПровести = Истина; 
		ОбщегоНазначения.СообщитьПользователю("Документ создан успешно!");
	Исключение 
		вмс_Журналирование.Ошибка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), СтрШаблон("Объект: %1", Строка(НовыйДокумент)));
		УдалостьПровести = Ложь;
	КонецПопытки;
	
	Если Не УдалостьПровести и не НовыйДокумент.Проведен Тогда
		Попытка
			вмс_ОперацииПоЯчейкамВызовСервера.ЗаписатьКлиентскуюИнформациюОбОшибкеВЖурнал();  
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	
	Если Не УдалостьПровести Тогда
		Если НовыйДокумент.Проведен Тогда
			НовыйДокумент.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись); 
			ОбщегоНазначения.СообщитьПользователю("Документ создан, но не проведен!");
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьТаблицуОстаткиНаСкладе();
	
	ТаблицаТоваров.Очистить();
КонецПроцедуры // СоздатьРаспоряжение()

#КонецОбласти










