Функция ПолучитьДанныеОСтатусеДокумента(Документ, Период=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_СтатусыДокументовСрезПоследних.Период КАК Период,
	|	вмс_СтатусыДокументовСрезПоследних.Документ КАК Документ,
	|	вмс_СтатусыДокументовСрезПоследних.Статус КАК Статус,
	|	вмс_СтатусыДокументовСрезПоследних.Статус.Наименование КАК СтатусНаименование,
	|	вмс_СтатусыДокументовСрезПоследних.Ответственный КАК Ответственный
	|ИЗ
	|	РегистрСведений.вмс_СтатусыДокументов.СрезПоследних(&Период, Документ = &Документ) КАК вмс_СтатусыДокументовСрезПоследних";
	
	Если Период <> Неопределено Тогда
		Запрос.УстановитьПараметр("Период", Период);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Период", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Новый Структура;
	Результат.Вставить("Период");
	Результат.Вставить("Статус");
	Результат.Вставить("СтатусНаименование", "");
	Результат.Вставить("Ответственный");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылкуСтатуса(Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Статус = Справочники.вмс_СтатусыДокументов.НайтиПоНаименованию(Значение, Истина);
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.вмс_СтатусыДокументов") Тогда
		Статус = Значение;
	Иначе
		Статус = Справочники.вмс_СтатусыДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

Функция ИзменитьСтатусДокумента(Документ, знач НовыйСтатус, знач Период=Неопределено, знач Ответственный=Неопределено) Экспорт
	
	НовыйСтатус = ПолучитьСсылкуСтатуса(НовыйСтатус);
	Если Не ЗначениеЗаполнено(НовыйСтатус) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеОСостоянии = ПолучитьДанныеОСтатусеДокумента(Документ, Период);
	Если ДанныеОСостоянии.Статус = НовыйСтатус Тогда
		//состояние не изменилось
		Возврат Ложь;
	КонецЕсли;
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДата();
	КонецЕсли;
	
	Если Ответственный = Неопределено Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Запись = РегистрыСведений.вмс_СтатусыДокументов.СоздатьМенеджерЗаписи();
	Запись.Заполнить(Неопределено);
	Запись.Период = Период;
	Запись.Документ = Документ;
	Запись.Статус = НовыйСтатус;
	Запись.Ответственный = Ответственный;
	
	Если Не ЗначениеЗаполнено(Запись.Документ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запись.Записать();
	Возврат Истина;
	
КонецФункции
