
Функция ДобавитьФотографиюТовара(Товар) Экспорт

	// Получить фотографию
#Если МобильноеПриложениеКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
			ДанныеМультимедиа = СредстваМультимедиа.СделатьФотоснимок();
			Если ДанныеМультимедиа <> Неопределено Тогда
				ДвоичныеДанные = ДанныеМультимедиа.ПолучитьДвоичныеДанные();
			Иначе
				ДвоичныеДанные = Неопределено;
			КонецЕсли;
		КонецЕсли;
#Иначе
		ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ВыборФайла.МножественныйВыбор = Ложь;
		ВыборФайла.Заголовок = НСтр("ru = 'Выбор файла'");
		ВыборФайла.Фильтр = НСтр("ru = 'Картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf'");
		Если ВыборФайла.Выбрать() Тогда
			ВыбранныйФайл = ВыборФайла.ВыбранныеФайлы;
			ДвоичныеДанные = Новый ДвоичныеДанные(ВыбранныйФайл[0]);
		Иначе
			ДвоичныеДанные = Неопределено;
		КонецЕсли;
#КонецЕсли 
	
	Если ДвоичныеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Изображение не получено");
		Возврат Неопределено;
	КонецЕсли;
	
	вмс_РаботаСКартинкамиВызовСервера.ПоместитьФотоВХранилищеИОтправитьВБД(Товар, ДвоичныеДанные);
	
	Возврат ДвоичныеДанные;
	
КонецФункции

