
//ТУ_Самойленко 04.07.23 ++ [Блокировка ячеек]
&НаСервере
Функция ВедетсяРаботаСЯчейками(Ячейки, ИсключаяИсточник=Неопределено) Экспорт

	Ответ = Новый Структура("ВедетсяРаботаСЯчейками, ПроводитсяИнвентаризацияЯчеек, ТекстСообщения, НедоступныеЯчейки", Ложь, Ложь, "", Новый Массив);
	Нумератор = 1;
	
	Если Не ЗначениеЗаполнено(Ячейки) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_ПроверяемыеСлужебныеЗоны.Операция КАК Операция,
	|	вмс_ПроверяемыеСлужебныеЗоны.ТипРаспоряжения.Имя КАК ТипРаспоряжения,
	|	вмс_ПроверяемыеСлужебныеЗоны.Реквизит КАК ИмяРеквизита,
	|	вмс_ПроверяемыеСлужебныеЗоны.СлужебнаяЗона КАК СлужебнаяЗона
	|ПОМЕСТИТЬ НастройкиАналитики
	|ИЗ
	|	РегистрСведений.вмс_ПроверяемыеСлужебныеЗоны КАК вмс_ПроверяемыеСлужебныеЗоны
	|ГДЕ
	|	вмс_ПроверяемыеСлужебныеЗоны.Используется = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_АктивныеСеансы.Оператор КАК Оператор,
	|	вмс_АктивныеСеансы.Операция КАК Операция,
	|	вмс_АктивныеСеансы.Распоряжение КАК Распоряжение,
	|	ЗНАЧЕНИЕ(Справочник.вмс_МестаХранения.ПустаяСсылка) КАК ИспользуемаяЗона
	|ПОМЕСТИТЬ ДанныеСеансов
	|ИЗ
	|	РегистрСведений.вмс_АктивныеСеансы КАК вмс_АктивныеСеансы
	|ГДЕ
	|	вмс_АктивныеСеансы.ВидВзаимодействия = ЗНАЧЕНИЕ(Перечисление.вмс_ВидыВзаимодействияСТерминалом.ВОперации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ссылка,
	|	вмс_МестаХранения.Владелец КАК Владелец,
	|	вмс_МестаХранения.ТипЯчейки КАК ТипЯчейки
	|ПОМЕСТИТЬ ВыгрузкаЯчеек
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.Ссылка В(&Ячейки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ЗаблокированныеЯчейки.Ячейка КАК Ячейка,
	|	вмс_ЗаблокированныеЯчейки.Источник КАК Источник
	|ПОМЕСТИТЬ ЗанятоИнвентой
	|ИЗ
	|	РегистрСведений.вмс_ЗаблокированныеЯчейки КАК вмс_ЗаблокированныеЯчейки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(вмс_ЗаблокированныеЯчейки.Источник) = ТИП(Документ.вмс_ВыборочнаяИнвентаризация)
	|	И вмс_ЗаблокированныеЯчейки.Ячейка В(&Ячейки)" + ?(ЗначениеЗаполнено(ИсключаяИсточник), " И вмс_ЗаблокированныеЯчейки.Источник <> &ИсключаяИсточник", "");
	
	Запрос.УстановитьПараметр("Ячейки", Ячейки);	 
	Если ЗначениеЗаполнено(ИсключаяИсточник) Тогда
		Запрос.УстановитьПараметр("ИсключаяИсточник", ИсключаяИсточник);	
	КонецЕсли;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	НастройкиАналитики = Запрос.МенеджерВременныхТаблиц.Таблицы["НастройкиАналитики"].ПолучитьДанные().Выгрузить();
	ДанныеСеансов = Запрос.МенеджерВременныхТаблиц.Таблицы["ДанныеСеансов"].ПолучитьДанные().Выгрузить();
	ВыгрузкаЯчеек = Запрос.МенеджерВременныхТаблиц.Таблицы["ВыгрузкаЯчеек"].ПолучитьДанные().Выгрузить();
	ЗанятоИнвентой = Запрос.МенеджерВременныхТаблиц.Таблицы["ЗанятоИнвентой"].ПолучитьДанные().Выгрузить();
	
	Если ЗначениеЗаполнено(ЗанятоИнвентой) Тогда
		Ответ.ПроводитсяИнвентаризацияЯчеек = Истина; 
		Для Каждого Строка Из ЗанятоИнвентой Цикл 
			Если Ответ.НедоступныеЯчейки.Найти(Строка.Ячейка) = Неопределено Тогда
				Ответ.НедоступныеЯчейки.Добавить(Строка.Ячейка);
				Ответ.ТекстСообщения = Ответ.ТекстСообщения + Нумератор + ") " + Строка.Ячейка + " недоступна до исполнения документа " + Строка.Источник + Символы.ПС;
				Нумератор = Нумератор + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеСеансов) Или Не ЗначениеЗаполнено(НастройкиАналитики) Тогда
		Возврат Ответ;	
	КонецЕсли;
			
	Для Каждого Строка Из НастройкиАналитики Цикл
		Позиция = СтрНайти(Строка.ТипРаспоряжения, ".");
		Строка.ТипРаспоряжения = Сред(Строка.ТипРаспоряжения, Позиция+1);
		НайденныеСтрокиСеансов = ДанныеСеансов.НайтиСтроки(Новый Структура("Операция", Строка.Операция));
		Если ЗначениеЗаполнено(НайденныеСтрокиСеансов) Тогда
			Для Каждого нСтрока Из НайденныеСтрокиСеансов Цикл
				Если Строка.ТипРаспоряжения = нСтрока.Распоряжение.МетаДанные().Имя Тогда
					ВладелецЯчейки = вмс_АдаптацияКонфигураций.ПолучитьВладельцаЯчейки(нСтрока.Распоряжение[Строка.ИмяРеквизита]); //Переобувка реквизита для ситуаций типа СкладОрдер в УПП
					НайденныеЗоны = ВыгрузкаЯчеек.НайтиСтроки(Новый Структура("Владелец, ТипЯчейки", ВладелецЯчейки, Строка.СлужебнаяЗона)); 					
					Если ЗначениеЗаполнено(НайденныеЗоны) Тогда
						нСтрока.ИспользуемаяЗона = НайденныеЗоны[0].Ссылка;
						Ответ.ВедетсяРаботаСЯчейками = Истина;
						Ответ.НедоступныеЯчейки.Добавить(нСтрока.ИспользуемаяЗона);
						Ответ.ТекстСообщения = Ответ.ТекстСообщения + Нумератор + ") " + нСтрока.Оператор + " работает с " + нСтрока.ИспользуемаяЗона + ", изменение вида блокировки временно недоступно." + Символы.ПС;	
						Нумератор = Нумератор + 1;	
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Ответ;
	
КонецФункции
//ТУ_Самойленко 04.07.23 -- [Блокировка ячеек]
