
#Область ПрограммныйИнтерфейс

Функция ОбработатьШтрихкодНовая(знач Штрихкод) Экспорт
	
	//3.2.5 - рефакторинг. Упрощено
	
	РК = вмс_РаботаСКоллекциями;
	ИнформацияОШтрихкоде = ПолучитьСтруктуруРезультатаОбработкиШтрихкода();
	ИнформацияОШтрихкоде.ШтрихкодНечищенный = Штрихкод;
	ИнформацияОШтрихкоде.ШтрихкодBase64 = вмс_ОбработкаМаркировкиСервер.ДвоичныеДанныеBase64(ПолучитьДвоичныеДанныеИзСтроки(Штрихкод, КодировкаТекста.UTF8));
	
	УдалитьНепечатныеСимволы(Штрихкод);
	
	НайденныеОбъекты = ИнформацияОШтрихкоде.НайденныеОбъекты;
	
	ДанныеКодаТовара = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовараСлужебная(ИнформацияОШтрихкоде.ШтрихкодНечищенный);
	ЗаполнитьЗначенияСвойств(ИнформацияОШтрихкоде.ДанныеМаркировки, ДанныеКодаТовара);
	
	ИнформацияОШтрихкоде.ЭтоКодТовара = ДанныеКодаТовара.Разобран;
	ИнформацияОШтрихкоде.ЭтоКодМаркировки = ИнформацияОШтрихкоде.ЭтоКодТовара И ДанныеКодаТовара.ДанныеШтрихкода["01"] <> Неопределено;
	ИнформацияОШтрихкоде.ЭтоТранспортныйКод = ДанныеКодаТовара.ДанныеШтрихкода["00"] <> Неопределено;
	ИнформацияОШтрихкоде.ШтрихкодНормализованный = НормализоватьШтрихкод(ИнформацияОШтрихкоде);
	ИнформацияОШтрихкоде.ШтрихкодНормализованныйПредставление = НормализоватьШтрихкодПредставление(ИнформацияОШтрихкоде);
	ИнформацияОШтрихкоде.Штрихкод = Штрихкод;
	
	//обратная совместимость
	ИнформацияОШтрихкоде.ДанныеМаркировки.Вставить("ЭтоТранспортныйКод", ИнформацияОШтрихкоде.ЭтоТранспортныйКод);
	ИнформацияОШтрихкоде.ДанныеМаркировки.Вставить("ЭтоКодМаркировки", ИнформацияОШтрихкоде.ЭтоКодМаркировки);
	
	//сборка штрихкодов для поиска
	МассивШтрихкодов = Новый Массив;
	Если ИнформацияОШтрихкоде.ЭтоКодТовара Тогда
		МассивШтрихкодов.Добавить(ИнформацияОШтрихкоде.Штрихкод);
		МассивШтрихкодов.Добавить(ИнформацияОШтрихкоде.ДанныеМаркировки.GTIN);
		МассивШтрихкодов.Добавить(ИнформацияОШтрихкоде.ДанныеМаркировки.EAN);
		МассивШтрихкодов.Добавить(ИнформацияОШтрихкоде.ШтрихкодНормализованный);
		МассивШтрихкодов.Добавить(ИнформацияОШтрихкоде.ШтрихкодНормализованныйПредставление);
		
		ПоляДанныхШтрихкода = ПолучитьЗначенияПолейИзДанныхШтрихкода(ДанныеКодаТовара.ДанныеШтрихкода);
		ИнформацияОШтрихкоде.ДанныеМаркировки.ПоляДанныхШтрихкода = ПоляДанныхШтрихкода;
	Иначе //остальные штрихкоды ищем по переданному штрихкоду.
		МассивШтрихкодов.Добавить(ИнформацияОШтрихкоде.Штрихкод);
	КонецЕсли;
	
	ТаблицаНайденныхОбъектов = НайтиОбъектыПоШтрихкодам(МассивШтрихкодов);
	
	ПоляОбъектаПоШтрихкоду = "Штрихкод, Объект, Тип, ИмяТипаОбъекта, НомерОбъекта";
	Если ИнформацияОШтрихкоде.ЭтоКодМаркировки Тогда
		
		НайденныеОбъектыПоGTIN = Новый Массив;
		
		КоэффициентУпаковки = 1;
		Для Каждого СтрокаОбъекта Из РК.ПолучитьЭлементыКоллекции(ТаблицаНайденныхОбъектов) Цикл
			ДанныеОбъектаПоШтрихкоду = Новый Структура(ПоляОбъектаПоШтрихкоду);
			ДанныеОбъектаПоШтрихкоду.Вставить("Маркировка", ИнформацияОШтрихкоде.Штрихкод);
			ЗаполнитьЗначенияСвойств(ДанныеОбъектаПоШтрихкоду, СтрокаОбъекта);
			Если СтрокаОбъекта.Штрихкод = ИнформацияОШтрихкоде.Штрихкод Тогда
				НайденныеОбъекты.Добавить(ДанныеОбъектаПоШтрихкоду);
			Иначе
				НайденныеОбъектыПоGTIN.Добавить(ДанныеОбъектаПоШтрихкоду);
			КонецЕсли;
			
			// ТУ_Алфимов Д.С.  22.04.26 ++ КИЗ может быть упаковочный
			Если СтрокаОбъекта.ИмяТипаОбъекта = "Упаковка" Тогда
				Если СтрокаОбъекта.Объект.Числитель > 0 Тогда 	
					КоэффициентУпаковки = СтрокаОбъекта.Объект.Числитель;
				КонецЕсли;
			КонецЕсли;
			// ТУ_Алфимов Д.С.  22.04.26 --
			
		КонецЦикла;
		
		ИнформацияОШтрихкоде.ДанныеМаркировки.НайденныеОбъектыПоGTIN = НайденныеОбъектыПоGTIN;
		РК.ДобавитьЭлементыКоллекции(НайденныеОбъекты, НайденныеОбъектыПоGTIN);
		
		ДанныеУпаковки = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьПоЗначениюШтрихкода(Штрихкод);
		Если ЗначениеЗаполнено(ДанныеУпаковки)Тогда 
			ИнформацияОШтрихкоде.ДанныеМаркировки.Вставить("Количество", ДанныеУпаковки.Количество);
		Иначе
			ИнформацияОШтрихкоде.ДанныеМаркировки.Вставить("Количество", КоэффициентУпаковки);
		КонецЕсли;
		
		ИнформацияОШтрихкоде.Количество = ИнформацияОШтрихкоде.ДанныеМаркировки.Количество;
		
	Иначе
		
		Для Каждого СтрокаОбъекта Из РК.ПолучитьЭлементыКоллекции(ТаблицаНайденныхОбъектов) Цикл
			ДанныеОбъектаПоШтрихкоду = Новый Структура(ПоляОбъектаПоШтрихкоду);
			ЗаполнитьЗначенияСвойств(ДанныеОбъектаПоШтрихкоду, СтрокаОбъекта);
			НайденныеОбъекты.Добавить(ДанныеОбъектаПоШтрихкоду);
			
			ДанныеОбъектаПоШтрихкоду.Тип = СтрокаОбъекта.ТипОбъекта;
			
			Если СтрокаОбъекта.ИмяТипаОбъекта = "Количество" Тогда
				ИнформацияОШтрихкоде.Количество = СтрокаОбъекта.Объект;
				ИнформацияОШтрихкоде.ДанныеМаркировки.Вставить("Количество", СтрокаОбъекта.Объект);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ИнформацияОШтрихкоде;
	
	
КонецФункции  

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает массив префиксов, по которым планируется определять, что именно сосканировано
//
// USER\ГЫУК - Пользователь
// ZX\ЯЧ     - Ячейка
// GK\ПЛ     - Паллета
//                    
// Штрихкоды номенклатуры не кодируются, и обрабатываются типовыми средствами
// Возвращаемое значение:
//   <Массив>   - Массив служебных префиксов в 2ух языковых раскладках//
Функция ПолучитьМассивСлужебныхПрефиксов()  Экспорт
	
	МассивПрефиксов = Новый Массив; 
	
	МассивПрефиксов.Добавить("USER");
	МассивПрефиксов.Добавить("ZX");
	МассивПрефиксов.Добавить("GK");
	МассивПрефиксов.Добавить("ГЫУК");
	МассивПрефиксов.Добавить("ЯЧ");
	МассивПрефиксов.Добавить("ПЛ");
	
	Возврат МассивПрефиксов;
	
	
КонецФункции

Функция ЗаполнитьПодменюСканирование(Форма, ИмяПодменю) Экспорт
	ПодменюСканирование = Форма.Элементы.Добавить(ИмяПодменю, Тип("ГруппаФормы"));
КонецФункции

Функция НайтиОбъектыПоТаблицеШтрихкодов(ТаблицаШтрихкодов) Экспорт       
	
	ТаблицаПравилПоиска = ТаблицаШтрихкодов.Скопировать();
	ТаблицаПравилПоиска.Свернуть("ПравилоПоиска");
	ПравилаПоиска = ТаблицаПравилПоиска.ВыгрузитьКолонку("ПравилоПоиска");
	
	ТаблицаНайденныхШтрихкодов = ТаблицаШтрихкодов.СкопироватьКолонки();
	ТаблицаНайденныхШтрихкодов.Колонки.Добавить("Объект");
	ТаблицаНайденныхШтрихкодов.Колонки.Добавить("НомерОбъекта");
	
	БазыНомеровОбъектовДляШтрихкодов = Новый Соответствие;
	
	Отбор = Новый Структура("СтрокаПоиска");
	Для Каждого СсылкаНаПравилоПоиска Из ПравилаПоиска Цикл
		
		Поиск = Новый Структура;
		Поиск.Вставить("ПравилоПоиска", СсылкаНаПравилоПоиска);
		СтрокиШтрихкодыПравила = ТаблицаШтрихкодов.НайтиСтроки(Поиск);
		ТаблицаПрефиксыПравила = ТаблицаШтрихкодов.Скопировать(СтрокиШтрихкодыПравила);
		ТаблицаПрефиксыПравила.Свернуть("Префикс");
		МассивПрефиксовПравила = ТаблицаПрефиксыПравила.ВыгрузитьКолонку("Префикс");
		
		ПравилоПоиска = СсылкаНаПравилоПоиска.ПолучитьОбъект();
		ИмяТаблицыДанныхИБ0 = ПравилоПоиска.ИмяТаблицыДанныхИБ;
		
		Для каждого Префикс Из МассивПрефиксовПравила Цикл
			Поиск.Вставить("Префикс", Префикс);
			ТаблицаШтрихкодовПравила = ТаблицаШтрихкодов.Скопировать(Поиск);
			ТаблицаШтрихкодовПравила.Свернуть("Штрихкод, СтрокаПоиска");
			ТаблицаСтрокПоискаПравила = ТаблицаШтрихкодов.Скопировать(СтрокиШтрихкодыПравила); 
			ТаблицаСтрокПоискаПравила.Свернуть("СтрокаПоиска");
			МассивСтрокПоискаПравила = ТаблицаСтрокПоискаПравила.ВыгрузитьКолонку("СтрокаПоиска"); 
			ПравилоПоиска.ИмяТаблицыДанныхИБ = вмс_РаботаСКоллекциями.ТекстовыйПарсер_ПодставитьПараметрыВСтроку(ИмяТаблицыДанныхИБ0, Новый Структура("Префикс", Префикс));
			ТаблицаОбъектовПоПравилу = ПравилоПоиска.НайтиОбъекты(МассивСтрокПоискаПравила);
			Если ТаблицаОбъектовПоПравилу.Количество()=0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого СтрокаШтрихкодаПравила Из ТаблицаШтрихкодовПравила Цикл
				Отбор.СтрокаПоиска = СтрокаШтрихкодаПравила.СтрокаПоиска; 
				НайденныеОбъектыПоШтрихкоду = ТаблицаОбъектовПоПравилу.НайтиСтроки(Отбор);
				Если НайденныеОбъектыПоШтрихкоду.Количество()=0 Тогда
					Продолжить;
				КонецЕсли;
				
				Штрихкод = СтрокаШтрихкодаПравила.Штрихкод;
				БазаНомеровОбъектов = БазыНомеровОбъектовДляШтрихкодов[Штрихкод];
				Если БазаНомеровОбъектов=Неопределено Тогда
					БазаНомеровОбъектов = 0;
				КонецЕсли;
				БазаНомеровОбъектовСледующегоПравила = БазаНомеровОбъектов;
				
				Для Каждого Строка Из НайденныеОбъектыПоШтрихкоду Цикл
					
					НомерОбъекта = Строка.НомерОбъекта + БазаНомеровОбъектов;
					Если НомерОбъекта > БазаНомеровОбъектовСледующегоПравила Тогда
						БазаНомеровОбъектовСледующегоПравила = НомерОбъекта;
					КонецЕсли;
					
					нСтрока = ТаблицаНайденныхШтрихкодов.Добавить();
					ЗаполнитьЗначенияСвойств(нСтрока, Строка);
					ЗаполнитьЗначенияСвойств(нСтрока, СтрокаШтрихкодаПравила);
					нСтрока.Объект = Строка.Объект;
					нСтрока.НомерОбъекта = НомерОбъекта;
					
				КонецЦикла;
				
				БазыНомеровОбъектовДляШтрихкодов[Штрихкод] = БазаНомеровОбъектовСледующегоПравила;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаНайденныхШтрихкодов.Сортировать("НомерОбъекта");
	
	Возврат ТаблицаНайденныхШтрихкодов;
	
	
КонецФункции

Функция ПолучитьШтрихкодыОбъектовСтар(МассивОбъектов) Экспорт
	
	ТаблицаШтрихкодов = Новый ТаблицаЗначений;
	ТаблицаШтрихкодов.Колонки.Добавить("Объект");
	ТаблицаШтрихкодов.Колонки.Добавить("Штрихкод");
	ТаблицаШтрихкодов.Колонки.Добавить("ТипОбъекта");
	ТаблицаШтрихкодов.Колонки.Добавить("ИмяТипаОбъекта");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_СоответствиеМетаданных.Ссылка КАК Ссылка,
	|	вмс_СоответствиеМетаданных.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.вмс_СоответствиеМетаданных КАК вмс_СоответствиеМетаданных";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаСоответствияМетаданных0 = РезультатЗапроса.Выгрузить();
	
	ТаблицаСоответствияМетаданных = Новый ТаблицаЗначений;
	ТаблицаСоответствияМетаданных.Колонки.Добавить("Ссылка");
	ТаблицаСоответствияМетаданных.Колонки.Добавить("ТипЗначения");
	
	Для Каждого СтрокаСоответствия0 Из ТаблицаСоответствияМетаданных0 Цикл
		Для Каждого Тип Из СтрокаСоответствия0.ТипЗначения.Типы() Цикл
			СтрокаСоответствия = ТаблицаСоответствияМетаданных.Добавить();
			СтрокаСоответствия.Ссылка = СтрокаСоответствия0.Ссылка;
			СтрокаСоответствия.ТипЗначения = Тип;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ТаблицаОбъектов.Колонки.Добавить("Объект");
	ТаблицаОбъектов.Колонки.Добавить("ТипЗначения");
	ТаблицаОбъектов.Колонки.Добавить("ТипОбъекта");
	Для Каждого Объект Из МассивОбъектов Цикл
		СтрокаОбъекта = ТаблицаОбъектов.Добавить();
		СтрокаОбъекта.Объект = Объект;
		СтрокаОбъекта.ТипЗначения = ТипЗнч(Объект);
		НайденныеСоответствия = ТаблицаСоответствияМетаданных.НайтиСтроки(Новый Структура("ТипЗначения", СтрокаОбъекта.ТипЗначения));
		Если НайденныеСоответствия.Количество() > 0 Тогда
			СтрокаОбъекта.ТипОбъекта = НайденныеСоответствия[0].Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипыОбъектов", ТаблицаОбъектов.ВыгрузитьКолонку("ТипОбъекта"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта КАК ТипОбъекта,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта.Наименование КАК ИмяТипаОбъекта,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_ПравилаПоискаОбъектов.ПолучаемыеОбъекты КАК вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты
	|ГДЕ
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта В(&ТипыОбъектов)";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПравилПоискаТипыОбъектов = РезультатЗапроса.Выгрузить();
	ТаблицаПравилПоиска = ТаблицаПравилПоискаТипыОбъектов.Скопировать();
	ТаблицаПравилПоиска.Свернуть("Ссылка");
	
	Для Каждого СтрокаПравилоПоиска Из ТаблицаПравилПоиска Цикл
		ТаблицаТипыОбъектовПравила = ТаблицаПравилПоискаТипыОбъектов.Скопировать(Новый Структура("Ссылка", СтрокаПравилоПоиска.Ссылка));
		МассивТипыОбъектовПравила = ТаблицаТипыОбъектовПравила.ВыгрузитьКолонку("ТипОбъекта");
		СтрокиОбъектыПравила = Новый Массив;
		Для Каждого ТипОбъектаПравила Из МассивТипыОбъектовПравила Цикл
			СтрокиОбъектыПравилаПоТипуОбъектов = ТаблицаОбъектов.НайтиСтроки(Новый Структура("ТипОбъекта", ТипОбъектаПравила));
			вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(СтрокиОбъектыПравила, СтрокиОбъектыПравилаПоТипуОбъектов);
		КонецЦикла;
		
		ТаблицаОбъектыПравила = ТаблицаОбъектов.Скопировать(СтрокиОбъектыПравила);
		МассивОбъектовПравила = ТаблицаОбъектыПравила.ВыгрузитьКолонку("Объект");
		ПравилоПоиска = СтрокаПравилоПоиска.Ссылка.ПолучитьОбъект();
		ТаблицаШтрихкодовПравила = ПравилоПоиска.НайтиШтрихкодыОбъектов(МассивОбъектовПравила);
		Для Каждого СтрокаШтрихкодаПравила Из ТаблицаШтрихкодовПравила Цикл
			СтрокаШтрихкодов = ТаблицаШтрихкодов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаШтрихкодов, СтрокаШтрихкодаПравила);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаШтрихкодов;
	
КонецФункции

Функция ПолучитьШтрихкодыОбъектов(Объекты) Экспорт
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = вмс_РаботаСКоллекциями;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_СоответствиеМетаданных.Ссылка КАК Ссылка,
	|	вмс_СоответствиеМетаданных.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.вмс_СоответствиеМетаданных КАК вмс_СоответствиеМетаданных";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаСоответствияМетаданных0 = РезультатЗапроса.Выгрузить();
	
	ТаблицаСоответствияМетаданных = Новый ТаблицаЗначений;
	ТаблицаСоответствияМетаданных.Колонки.Добавить("Ссылка");
	ТаблицаСоответствияМетаданных.Колонки.Добавить("ТипЗначения");
	
	Для Каждого СтрокаСоответствия0 Из ТаблицаСоответствияМетаданных0 Цикл
		Для Каждого Тип Из СтрокаСоответствия0.ТипЗначения.Типы() Цикл
			СтрокаСоответствия = ТаблицаСоответствияМетаданных.Добавить();
			СтрокаСоответствия.Ссылка = СтрокаСоответствия0.Ссылка;
			СтрокаСоответствия.ТипЗначения = Тип;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаОбъектов = РаботаСКоллекциями.ЗначениеВТаблицуЗначений(Объекты);
	МассивОбъектов = РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(ТаблицаОбъектов);
	
	ТаблицаТиповОбъектов = Новый ТаблицаЗначений;
	ТаблицаТиповОбъектов.Колонки.Добавить("Объект");
	ТаблицаТиповОбъектов.Колонки.Добавить("ТипЗначения");
	ТаблицаТиповОбъектов.Колонки.Добавить("ТипОбъекта");
	Для Каждого Объект Из МассивОбъектов Цикл
		СтрокаОбъекта = ТаблицаТиповОбъектов.Добавить();
		СтрокаОбъекта.Объект = Объект;
		СтрокаОбъекта.ТипЗначения = ТипЗнч(Объект);
		НайденныеСоответствия = ТаблицаСоответствияМетаданных.НайтиСтроки(Новый Структура("ТипЗначения", СтрокаОбъекта.ТипЗначения));
		Если НайденныеСоответствия.Количество() > 0 Тогда
			СтрокаОбъекта.ТипОбъекта = НайденныеСоответствия[0].Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипыОбъектов", ТаблицаТиповОбъектов.ВыгрузитьКолонку("ТипОбъекта"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ПравилаПоискаОбъектов.Ссылка КАК Правило,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ИмяРеквизитаОбъекта КАК ИмяРеквизитаОбъекта,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта КАК ТипОбъекта,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта.Наименование КАК ИмяТипаОбъекта,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта.ТипЗначения КАК ТипЗначения,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ИспользоватьЗначениеПоУмолчанию КАК ИспользоватьЗначениеПоУмолчанию,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.НеИскатьШтрихкод КАК НеИскатьШтрихкод
	|ИЗ
	|	Справочник.вмс_ПравилаПоискаОбъектов КАК вмс_ПравилаПоискаОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_ПравилаПоискаОбъектов.ПолучаемыеОбъекты КАК вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты
	|		ПО вмс_ПравилаПоискаОбъектов.Ссылка = вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.Ссылка
	|ГДЕ
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта В(&ТипыОбъектов)
	|	И НЕ вмс_ПравилаПоискаОбъектов.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПравилПоискаТипыОбъектов = РезультатЗапроса.Выгрузить();
	ТаблицаПравилПоиска = ТаблицаПравилПоискаТипыОбъектов.Скопировать();
	ТаблицаПравилПоиска.Свернуть("Правило");
	
	// Распределим объекты по правилам поиска и по реквизитам поиска
	// подбор сделаем по типам объектов
	ПравилаПоискаОбъектов = Новый Соответствие;
	ПоляОбъектов = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(ТаблицаОбъектов.Колонки, "Имя");
	ТаблицаОбъектовПоПравилам = РаботаСКоллекциями.НоваяТаблицаЗначений("Правило, Реквизиты, ТаблицаОбъектов");
	ТаблицаОбъектовПоПравилам.Индексы.Добавить("Правило, Реквизиты");
	Для Каждого СтрокаОбъектов Из ТаблицаОбъектов Цикл
		Ошибка = Ложь;
		ОбъектыПоТипамИРеквизитам = Новый Массив;
		Для Каждого ПолеОбъекта Из ПоляОбъектов Цикл
			Объект = СтрокаОбъектов[ПолеОбъекта];
			Если Объект = Null Тогда
				Продолжить;
			КонецЕсли;
			
			НайденныеСтроки = ТаблицаТиповОбъектов.НайтиСтроки(Новый Структура("Объект", Объект));
			Если НайденныеСтроки.Количество() = 0 Тогда
				// тип не найден
				Ошибка = Истина;
				Прервать;
			КонецЕсли;
			
			СтрокаТипаОбъекта = НайденныеСтроки[0];
			ОбъектыПоТипамИРеквизитам.Добавить(Новый Структура("ТипОбъекта, ТипЗначения, Объект, Реквизит", СтрокаТипаОбъекта.ТипОбъекта, СтрокаТипаОбъекта.ТипЗначения, Объект));
		КонецЦикла;
		
		Если ОбъектыПоТипамИРеквизитам.Количество() = 0 Тогда
			Ошибка = Истина;
		КонецЕсли;
		
		Если Ошибка Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаПравилоПоиска Из ТаблицаПравилПоиска Цикл
			
			Ошибка = Ложь;
			Правило = СтрокаПравилоПоиска.Правило;
			РеквизитыМассив = Новый Массив;
			Для Каждого СтрокаОбъекта Из ОбъектыПоТипамИРеквизитам Цикл
				ТипОбъекта = СтрокаОбъекта.ТипОбъекта;
				НайденныеРеквизитыПравила = ТаблицаПравилПоискаТипыОбъектов.НайтиСтроки(Новый Структура("Правило, ТипОбъекта", Правило, ТипОбъекта));
				Ошибка = Истина;
				Для Каждого НайденныйРеквизитПравила Из НайденныеРеквизитыПравила Цикл
					Если РеквизитыМассив.Найти(НайденныйРеквизитПравила.ИмяРеквизитаОбъекта) = Неопределено Тогда
						СтрокаОбъекта.Реквизит = НайденныеРеквизитыПравила[0].ИмяРеквизитаОбъекта;
						РеквизитыМассив.Добавить(СтрокаОбъекта.Реквизит);
						Ошибка = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Ошибка Тогда
					// реквизит в правиле не найден
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Ошибка Тогда
				Продолжить;
			КонецЕсли;
			
			Реквизиты = РаботаСКоллекциями.МассивВСтроку(РеквизитыМассив);
			НайденныеТаблицыОбъектовПравила = ТаблицаОбъектовПоПравилам.НайтиСтроки(Новый Структура("Правило, Реквизиты", Правило, Реквизиты));
			Если НайденныеТаблицыОбъектовПравила.Количество() = 0 Тогда
				ТаблицаОбъектовПравила = Новый ТаблицаЗначений;
				Для Каждого СтрокаОбъекта Из ОбъектыПоТипамИРеквизитам Цикл
					ТаблицаОбъектовПравила.Колонки.Добавить(СтрокаОбъекта.Реквизит);
				КонецЦикла;
				СтрокаТаблицыОбъектовПравила = ТаблицаОбъектовПоПравилам.Добавить();
				СтрокаТаблицыОбъектовПравила.Правило = Правило;
				СтрокаТаблицыОбъектовПравила.Реквизиты = Реквизиты;
				СтрокаТаблицыОбъектовПравила.ТаблицаОбъектов = ТаблицаОбъектовПравила;
			Иначе
				ТаблицаОбъектовПравила = НайденныеТаблицыОбъектовПравила[0].ТаблицаОбъектов;
			КонецЕсли;
			
			СтрокаОбъектаПравила = ТаблицаОбъектовПравила.Добавить();
			Для каждого СтрокаОбъекта Из ОбъектыПоТипамИРеквизитам Цикл
				СтрокаОбъектаПравила[СтрокаОбъекта.Реквизит] = СтрокаОбъекта.Объект;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	
	ТаблицаШтрихкодов = Новый ТаблицаЗначений;
	ТаблицаШтрихкодов.Колонки.Добавить("Объект");
	ТаблицаШтрихкодов.Колонки.Добавить("ТипОбъекта");
	ТаблицаШтрихкодов.Колонки.Добавить("ИмяТипаОбъекта");
	ТаблицаШтрихкодов.Колонки.Добавить("НомерОбъекта");
	ТаблицаШтрихкодов.Колонки.Добавить("Штрихкод");
	
	// для сквозной нумерации объектов по разным правилам поиска в разрезе штрихкодов
	БазыНомеровОбъектовДляШтрихкодов = Новый Соответствие;
	
	Для Каждого СтрокаПравилоПоиска Из ТаблицаПравилПоиска Цикл
		Правило = СтрокаПравилоПоиска.Правило;
		ПравилоПоискаОбъект = Правило.ПолучитьОбъект();
		НайденныеТаблицыОбъектовПравила = ТаблицаОбъектовПоПравилам.НайтиСтроки(Новый Структура("Правило", Правило));
		Для Каждого СтрокаТаблицыОбъектовПравила Из НайденныеТаблицыОбъектовПравила Цикл
			ТаблицаОбъектовПравила = СтрокаТаблицыОбъектовПравила.ТаблицаОбъектов;
			ТаблицаШтрихкодовПравила = ПравилоПоискаОбъект.НайтиШтрихкодыОбъектов(ТаблицаОбъектовПравила);
			Для Каждого СтрокаШтрихкодаПравила Из ТаблицаШтрихкодовПравила Цикл
				БазаНомеровОбъектовДляШтрихкода = БазыНомеровОбъектовДляШтрихкодов[СтрокаШтрихкодаПравила.Штрихкод];
				Если БазаНомеровОбъектовДляШтрихкода=Неопределено Тогда
					БазаНомеровОбъектовДляШтрихкода = 0;
				КонецЕсли;
				
				СтрокаШтрихкодаПравила.НомерОбъекта = БазаНомеровОбъектовДляШтрихкода + СтрокаШтрихкодаПравила.НомерОбъекта;
				
				СтрокаШтрихкода = ТаблицаШтрихкодов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаШтрихкода, СтрокаШтрихкодаПравила);
			КонецЦикла;
			
			// обновим базу номеров для следующего правила поиска
			Для Каждого СтрокаШтрихкодаПравила Из ТаблицаШтрихкодовПравила Цикл
				БазаНомеровОбъектовДляШтрихкода = БазыНомеровОбъектовДляШтрихкодов[СтрокаШтрихкодаПравила.Штрихкод];
				Если БазаНомеровОбъектовДляШтрихкода=Неопределено ИЛИ БазаНомеровОбъектовДляШтрихкода < СтрокаШтрихкодаПравила.НомерОбъекта Тогда
					БазыНомеровОбъектовДляШтрихкодов[СтрокаШтрихкодаПравила.Штрихкод] = СтрокаШтрихкодаПравила.НомерОбъекта;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаШтрихкодов;
	
КонецФункции

Функция ПолучитьШтрихкодыОбъектовПоЗапросу(Запрос) Экспорт
	
	МассивОбъектов = Новый Массив;
	ТаблицаОбъектов = Запрос.Выполнить().Выгрузить();
	Для Каждого Колонка Из ТаблицаОбъектов.Колонки Цикл
		Для Каждого Строка Из ТаблицаОбъектов Цикл
			Значение = Строка[Колонка.Имя];
			Если ЗначениеЗаполнено(Значение) Тогда
				МассивОбъектов.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаШтрихкодовОбъектов = ПолучитьШтрихкодыОбъектов(МассивОбъектов);
	
	Возврат ТаблицаШтрихкодовОбъектов;
	
КонецФункции

Функция ПолучитьСписокРегистровДляЗаписиШтрихкода() Экспорт
	
	СписокРегистров = Новый Массив;
	СписокРегистров.Добавить("ШтрихкодыНоменклатуры");
	СписокРегистров.Добавить("Штрихкоды");
	СписокРегистров.Добавить("вмс_ШтрихкодыРасширенный");
	
	Возврат СписокРегистров;
	
КонецФункции

Функция ПодобратьРегистрДляЗаписиШтрихкода(ПоляДанныхШтрихкода) Экспорт
	
	Если ТипЗнч(ПоляДанныхШтрихкода) = Тип("Структура") Тогда
		ПоляДанныхШтрихкодаМассив = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(ПоляДанныхШтрихкода, "Ключ");
	Иначе
		ПоляДанныхШтрихкодаМассив = вмс_РаботаСКоллекциями.ЗначениеВМассив(ПоляДанныхШтрихкода, , Ложь);
	КонецЕсли;
	
	ТаблицаРегистров = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("Имя, Приоритет, Номер");
	
	СписокРегистров = ПолучитьСписокРегистровДляЗаписиШтрихкода();
	Для Каждого ИмяРегистра Из СписокРегистров Цикл
		вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТаблицаРегистров, ИмяРегистра, 0, ТаблицаРегистров.Количество()+1);
	КонецЦикла;
	
	Для Каждого СтрокаРегистра Из ТаблицаРегистров Цикл
		
		МетаданныеРегистра = Метаданные.РегистрыСведений.Найти(СтрокаРегистра.Имя);
		Если МетаданныеРегистра = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПоляРегистраМассив = Новый Массив;
		вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(ПоляРегистраМассив, вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(МетаданныеРегистра.Измерения, "Имя"));
		вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(ПоляРегистраМассив, вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(МетаданныеРегистра.Ресурсы, "Имя"));
		
		Если Не (ПоляРегистраМассив.Найти("Штрихкод") <> Неопределено И ПоляРегистраМассив.Найти("Номенклатура") <> Неопределено) Тогда
			Продолжить;
		КонецЕсли;
		
		ПриоритетРегистра = 0;
		Для Каждого ПолеДанныхШтрихкода Из ПоляДанныхШтрихкодаМассив Цикл
			Если ПоляРегистраМассив.Найти(ПолеДанныхШтрихкода) <> Неопределено Тогда
				ПриоритетРегистра = ПриоритетРегистра + 1;
			КонецЕсли;
		КонецЦикла;
		
		СтрокаРегистра.Приоритет = ПриоритетРегистра;
		
	КонецЦикла;
	
	ТаблицаРегистров.Сортировать("Приоритет УБЫВ, Номер");
	Если ТаблицаРегистров.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаРегистра = ТаблицаРегистров[0];
	Если СтрокаРегистра.Приоритет = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтрокаРегистра.Имя;
	
КонецФункции

Функция ПрисвоитьШтрихкодНоменклатуре(ВходящиеПараметры) Экспорт 
	
	ДанныеШтрихкода = ВходящиеПараметры.ВыбранныйЭлемент;
	
	// ТУ_Мовчан 04.08.23
	Если ВходящиеПараметры.Коэффициент > 0 Тогда
		Результат = вмс_АдаптацияКонфигураций.СоздатьИПолучитьУпаковкуТовара(ДанныеШтрихкода.Номенклатура, ВходящиеПараметры.Коэффициент);	
		Если Результат <> Неопределено Тогда
			ДанныеШтрихкода.Вставить("Упаковка", Результат);
		Иначе
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;   
	
	ИмяРегистра = ПодобратьРегистрДляЗаписиШтрихкода(ДанныеШтрихкода);
	Если ИмяРегистра = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НовыйШтрихкод = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(НовыйШтрихкод, ДанныеШтрихкода);
	НовыйШтрихкод.Штрихкод = ВходящиеПараметры.Штрихкод;
	Попытка
		НовыйШтрихкод.Записать();
		Возврат Истина;
	Исключение
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьСтруктуруРезультатаОбработкиШтрихкода() Экспорт
	
	ДанныеМаркировки = ЗаполнитьИменаРеквизитовКодаТовара();
	ДанныеМаркировки.Вставить("НайденныеОбъектыПоGTIN");
	ДанныеМаркировки.Вставить("ПоляДанныхШтрихкода", Новый Структура);
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ДанныеМаркировки", ДанныеМаркировки);
	РезультатОбработки.Вставить("НайденныеОбъекты", Новый Массив);
	РезультатОбработки.Вставить("Штрихкод");
	РезультатОбработки.Вставить("ШтрихкодНечищенный");
	//3.2.5
	РезультатОбработки.Вставить("ШтрихкодBase64");
	РезультатОбработки.Вставить("ШтрихкодНормализованный");
	РезультатОбработки.Вставить("ШтрихкодНормализованныйПредставление");
	РезультатОбработки.Вставить("ЭтоКодТовара");
	РезультатОбработки.Вставить("ЭтоКодМаркировки");
	РезультатОбработки.Вставить("ЭтоТранспортныйКод");
	РезультатОбработки.Вставить("Количество", 1);
	
	РезультатОбработки.Вставить("Удостоверение", "РезультатОбработкиШтрихкода");
	
	Возврат РезультатОбработки;
	
КонецФункции  

Функция ПолучитьЗначенияПолейИзДанныхШтрихкода(ДанныеШтрихкода) Экспорт
	
	КодыGS1 = МенеджерОборудованияМаркировкаКлиентСервер.КодыGS1Служебный();
	ДанныеПолей = Новый Структура;
	Для каждого Поле Из ДанныеШтрихкода Цикл
		ИмяПоля = КодыGS1[Поле.Ключ].Имя;
		ЗначениеПоляСтрока = Поле.Значение.Значение;
		
		Если ИмяПоля = "EXPIRE" ИЛИ ИмяПоля = "BEST_BEFORE" Тогда
			ЗначениеПоля = ОбщегоНазначенияКлиентСервер.ПолучитьДатуИзСтроки(ЗначениеПоляСтрока);
		Иначе
			ЗначениеПоля = ЗначениеПоляСтрока;
		КонецЕсли;
		
		ДанныеПолей.Вставить(ИмяПоля, ЗначениеПоля);
	КонецЦикла;
	
	Возврат ДанныеПолей;
	
КонецФункции

Функция НайтиОбъектыПоТаблицеШтрихкодовВОсновнойБД(ТаблицаШтрихкодов) Экспорт
	
	ТаблицаШтрихкодов = НайтиОбъектыПоТаблицеШтрихкодов(ТаблицаШтрихкодов);
	Возврат ТаблицаШтрихкодов;
	
КонецФункции

Функция ПолучитьШтриходыОбъектов(МассивОбъектов) Экспорт
	
	ТаблицаШтрихкодов = Новый ТаблицаЗначений;
	ТаблицаШтрихкодов.Колонки.Добавить("Объект");
	ТаблицаШтрихкодов.Колонки.Добавить("Штрихкод");
	ТаблицаШтрихкодов.Колонки.Добавить("ТипОбъекта");
	ТаблицаШтрихкодов.Колонки.Добавить("ИмяТипаОбъекта");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_СоответствиеМетаданных.Ссылка КАК Ссылка,
	|	вмс_СоответствиеМетаданных.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.вмс_СоответствиеМетаданных КАК вмс_СоответствиеМетаданных";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаСоответствияМетаданных0 = РезультатЗапроса.Выгрузить();
	
	ТаблицаСоответствияМетаданных = Новый ТаблицаЗначений;
	ТаблицаСоответствияМетаданных.Колонки.Добавить("Ссылка");
	ТаблицаСоответствияМетаданных.Колонки.Добавить("ТипЗначения");
	
	Для Каждого СтрокаСоответствия0 Из ТаблицаСоответствияМетаданных0 Цикл
		Для Каждого Тип Из СтрокаСоответствия0.ТипЗначения.Типы() Цикл
			СтрокаСоответствия = ТаблицаСоответствияМетаданных.Добавить();
			СтрокаСоответствия.Ссылка = СтрокаСоответствия0.Ссылка;
			СтрокаСоответствия.ТипЗначения = Тип;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ТаблицаОбъектов.Колонки.Добавить("Объект");
	ТаблицаОбъектов.Колонки.Добавить("ТипЗначения");
	ТаблицаОбъектов.Колонки.Добавить("ТипОбъекта");
	Для Каждого Объект Из МассивОбъектов Цикл
		СтрокаОбъекта = ТаблицаОбъектов.Добавить();
		СтрокаОбъекта.Объект = Объект;
		СтрокаОбъекта.ТипЗначения = ТипЗнч(Объект);
		НайденныеСоответствия = ТаблицаСоответствияМетаданных.НайтиСтроки(Новый Структура("ТипЗначения", СтрокаОбъекта.ТипЗначения));
		Если НайденныеСоответствия.Количество() > 0 Тогда
			СтрокаОбъекта.ТипОбъекта = НайденныеСоответствия[0].Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипыОбъектов", ТаблицаОбъектов.ВыгрузитьКолонку("ТипОбъекта"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта КАК ТипОбъекта,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта.Наименование КАК ИмяТипаОбъекта,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_ПравилаПоискаОбъектов.ПолучаемыеОбъекты КАК вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты
	|ГДЕ
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта В(&ТипыОбъектов)";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПравилПоискаТипыОбъектов = РезультатЗапроса.Выгрузить();
	ТаблицаПравилПоиска = ТаблицаПравилПоискаТипыОбъектов.Скопировать();
	ТаблицаПравилПоиска.Свернуть("Ссылка");
	
	Для Каждого СтрокаПравилоПоиска Из ТаблицаПравилПоиска Цикл
		ТаблицаТипыОбъектовПравила = ТаблицаПравилПоискаТипыОбъектов.Скопировать(Новый Структура("Ссылка", СтрокаПравилоПоиска.Ссылка));
		МассивТипыОбъектовПравила = ТаблицаТипыОбъектовПравила.ВыгрузитьКолонку("ТипОбъекта");
		СтрокиОбъектыПравила = Новый Массив;
		Для Каждого ТипОбъектаПравила Из МассивТипыОбъектовПравила Цикл
			СтрокиОбъектыПравилаПоТипуОбъектов = ТаблицаОбъектов.НайтиСтроки(Новый Структура("ТипОбъекта", ТипОбъектаПравила));
			вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(СтрокиОбъектыПравила, СтрокиОбъектыПравилаПоТипуОбъектов);
		КонецЦикла;
		
		ТаблицаОбъектыПравила = ТаблицаОбъектов.Скопировать(СтрокиОбъектыПравила);
		МассивОбъектовПравила = ТаблицаОбъектыПравила.ВыгрузитьКолонку("Объект");
		ПравилоПоиска = СтрокаПравилоПоиска.Ссылка.ПолучитьОбъект();
		ТаблицаШтрихкодовПравила = ПравилоПоиска.НайтиШтрихкодыОбъектов(МассивОбъектовПравила);
		Для Каждого СтрокаШтрихкодаПравила Из ТаблицаШтрихкодовПравила Цикл
			СтрокаШтрихкодов = ТаблицаШтрихкодов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаШтрихкодов, СтрокаШтрихкодаПравила);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаШтрихкодов;
	
КонецФункции

Функция ПолучитьПравилаПоискаПоШтрихкодам(знач МассивШтрихкодов) Экспорт
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = глОбщийМодуль("РаботаСКоллекциями");
	
	МассивШтрихкодов = РаботаСКоллекциями.ЗначениеВМассив(МассивШтрихкодов, , Ложь);
	
	/////////////////////////////////////////////////////////////////////////////////
	// получение префиксов типов объектов
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_СоответствиеМетаданных.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА вмс_СоответствиеМетаданных.ИмяПредопределенныхДанных <> """"
	|			ТОГДА вмс_СоответствиеМетаданных.ИмяПредопределенныхДанных
	|		ИНАЧЕ вмс_СоответствиеМетаданных.Наименование
	|	КОНЕЦ КАК Имя,
	|	ЕСТЬNULL(вмс_СоответствиеМетаданныхПрефиксыШтрихкодов.Префикс, """") КАК Префикс
	|ИЗ
	|	ПланВидовХарактеристик.вмс_СоответствиеМетаданных КАК вмс_СоответствиеМетаданных
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.вмс_СоответствиеМетаданных.ПрефиксыШтрихкодов КАК вмс_СоответствиеМетаданныхПрефиксыШтрихкодов
	|		ПО вмс_СоответствиеМетаданных.Ссылка = вмс_СоответствиеМетаданныхПрефиксыШтрихкодов.Ссылка
	|ГДЕ
	|	НЕ вмс_СоответствиеМетаданных.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПрефиксовЗапрос = РезультатЗапроса.Выгрузить();
	ТаблицаПрефиксов = ТаблицаПрефиксовЗапрос.СкопироватьКолонки();
	ТаблицаПрефиксов.Колонки.Добавить("ДлинаПрефикса");
	ТаблицаПрефиксов.Колонки.Добавить("СтруктураПрефикса");
	ТаблицаПрефиксовПараметризированные = ТаблицаПрефиксов.СкопироватьКолонки();
	Для Каждого СтрокаПрефиксаЗапрос Из ТаблицаПрефиксовЗапрос Цикл
		Префикс = СтрокаПрефиксаЗапрос.Префикс;
		Если Найти(Префикс, "[") > 0 Тогда
			СтрокаПрефикса = ТаблицаПрефиксовПараметризированные.Добавить();
			СтрокаПрефикса.СтруктураПрефикса = РаботаСКоллекциями.ТекстовыйПарсер_ПолучитьСтруктуруШаблона(Префикс);
		Иначе
			СтрокаПрефикса = ТаблицаПрефиксов.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаПрефикса, СтрокаПрефиксаЗапрос);
		СтрокаПрефикса.ДлинаПрефикса = СтрДлина(Префикс);
	КонецЦикла;
	ТаблицаПрефиксов.Сортировать("ДлинаПрефикса убыв");
	ТаблицаПрефиксов.Индексы.Добавить("ДлинаПрефикса, Префикс");
	ТаблицаВариантыДлиныПрефиксов = ТаблицаПрефиксов.Скопировать();
	ТаблицаВариантыДлиныПрефиксов.Свернуть("ДлинаПрефикса");
	МассивВариантыДлиныПрефиксов = ТаблицаВариантыДлиныПрефиксов.ВыгрузитьКолонку("ДлинаПрефикса");
	
	
	// определение типов объектов по префиксу штрихкода
	ТаблицаШтрихкодов = Новый ТаблицаЗначений;
	ТаблицаШтрихкодов.Колонки.Добавить("Штрихкод");
	ТаблицаШтрихкодов.Колонки.Добавить("Префикс");
	ТаблицаШтрихкодов.Колонки.Добавить("Код");
	ТаблицаШтрихкодов.Колонки.Добавить("ТипОбъекта");
	ТаблицаШтрихкодов.Колонки.Добавить("ИмяТипаОбъекта");
	
	ОтборТиповОбъектов = Новый Структура("ДлинаПрефикса, Префикс");
	Для Каждого Штрихкод Из МассивШтрихкодов Цикл
		
		ТипОбъектаНайден = Ложь;
		Для Каждого ДлинаПрефикса Из МассивВариантыДлиныПрефиксов Цикл
			Если ТипОбъектаНайден И ДлинаПрефикса = 0 Тогда
				// найден тип с префиксом для штрих-кода, не использовать тип без префикса
				Прервать;
			КонецЕсли;
			
			ПрефиксШтрихкода = Лев(Штрихкод, ДлинаПрефикса);
			ОтборТиповОбъектов.ДлинаПрефикса = ДлинаПрефикса;
			ОтборТиповОбъектов.Префикс = ПрефиксШтрихкода;
			МассивСтрокНайденныеПрефиксы = ТаблицаПрефиксов.НайтиСтроки(ОтборТиповОбъектов);
			Для Каждого СтрокаНайденныйПрефикс Из МассивСтрокНайденныеПрефиксы Цикл
				СтрокаШтрихкода = ТаблицаШтрихкодов.Добавить();
				СтрокаШтрихкода.Штрихкод = Штрихкод;
				СтрокаШтрихкода.Префикс = СтрокаНайденныйПрефикс.Префикс;
				СтрокаШтрихкода.Код = Сред(Штрихкод, ДлинаПрефикса+1);
				СтрокаШтрихкода.ТипОбъекта = СтрокаНайденныйПрефикс.Ссылка;
				СтрокаШтрихкода.ИмяТипаОбъекта = СтрокаНайденныйПрефикс.Имя;
				ТипОбъектаНайден = Истина;
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого СтрокаПрефикса Из ТаблицаПрефиксовПараметризированные Цикл
			ПараметрыСтроки = РаботаСКоллекциями.ТекстовыйПарсер_ПолучитьПараметрыИзСтроки(СтрокаПрефикса.СтруктураПрефикса, Штрихкод);
			Если ТипЗнч(ПараметрыСтроки) = Тип("Структура") И ПараметрыСтроки.Свойство("Префикс") И ПараметрыСтроки.Свойство("Код") Тогда
				СтрокаШтрихкода = ТаблицаШтрихкодов.Добавить();
				СтрокаШтрихкода.Штрихкод = Штрихкод;
				СтрокаШтрихкода.Префикс = ПараметрыСтроки.Префикс;
				СтрокаШтрихкода.Код = ПараметрыСтроки.Код;
				СтрокаШтрихкода.ТипОбъекта = СтрокаПрефикса.Ссылка;
				СтрокаШтрихкода.ИмяТипаОбъекта = СтрокаПрефикса.Имя;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	ТаблицаШтрихкодов.Свернуть("Штрихкод, Префикс, Код, ТипОбъекта, ИмяТипаОбъекта");
	
	// получение правил поиска по типам объектов
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипыОбъектов", ТаблицаШтрихкодов.ВыгрузитьКолонку("ТипОбъекта"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ПравилаПоискаОбъектов.Ссылка КАК ПравилоПоиска,
	|	вмс_ПравилаПоискаОбъектов.ИскатьЛокально КАК ИскатьЛокально,
	|	вмс_ПравилаПоискаОбъектов.УчитыватьПрефикс КАК УчитыватьПрефикс,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта КАК ТипОбъекта,
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта.Наименование КАК ИмяТипаОбъекта
	|ИЗ
	|	Справочник.вмс_ПравилаПоискаОбъектов КАК вмс_ПравилаПоискаОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_ПравилаПоискаОбъектов.ПолучаемыеОбъекты КАК вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты
	|		ПО вмс_ПравилаПоискаОбъектов.Ссылка = вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.Ссылка
	|ГДЕ
	|	вмс_ПравилаПоискаОбъектовПолучаемыеОбъекты.ТипОбъекта В(&ТипыОбъектов)";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПравилПоискаТипыОбъектов = РезультатЗапроса.Выгрузить();
	
	РаботаСКоллекциями.СоединитьТаблицы(ТаблицаШтрихкодов, ТаблицаПравилПоискаТипыОбъектов, "ТипОбъекта", "ПравилоПоиска, ИскатьЛокально, УчитыватьПрефикс", Ложь, Ложь);
	
	ТаблицаШтрихкодов.Колонки.Добавить("СтрокаПоиска");
	Для Каждого СтрокаШтрихкода Из ТаблицаШтрихкодов Цикл
		Если СтрокаШтрихкода.УчитыватьПрефикс Тогда
			СтрокаШтрихкода.СтрокаПоиска = СтрокаШтрихкода.Штрихкод;
		Иначе
			СтрокаШтрихкода.СтрокаПоиска = СтрокаШтрихкода.Код;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаШтрихкодов;
	
КонецФункции

Функция НайтиОбъектыПоШтрихкодам(знач МассивШтрихкодов) Экспорт
	
	ТаблицаШтрихкодов = ПолучитьПравилаПоискаПоШтрихкодам(МассивШтрихкодов);
	вмс_РаботаСКоллекциями.УдалитьПустыеСтрокиКоллекции(ТаблицаШтрихкодов, "ПравилоПоиска");
	
	Результат = НайтиОбъектыПоТаблицеШтрихкодов(ТаблицаШтрихкодов);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

Функция УдалитьНепечатныеСимволы(Данные)
	Данные = СтрЗаменить(Данные, Символ(29), "");
КонецФункции

Функция ЗаполнитьИменаРеквизитовКодаТовара(КодРазобран = Ложь)
	
	// Определяем структуру результата. 
	ДанныеКодаТовара = Новый Структура();
	ДанныеКодаТовара.Вставить("Разобран", КодРазобран);
	ДанныеКодаТовара.Вставить("ОписаниеОшибки");
	ДанныеКодаТовара.Вставить("ПредставлениеШтрихкода" , "");
	ДанныеКодаТовара.Вставить("ДанныеШтрихкода", Новый Соответствие);
	ДанныеКодаТовара.Вставить("ТипИдентификатораТовара"); // Тип идентификатора товара, Перечисление.ТипыИдентификаторовТовараККТ.
	ДанныеКодаТовара.Вставить("GTIN");          // GTIN
	ДанныеКодаТовара.Вставить("СерийныйНомер"); // Серийный номер с потребительской или групповой обработки.
	ДанныеКодаТовара.Вставить("EAN");           // Штрихкод товара преобразованный из GTIN
	ДанныеКодаТовара.Вставить("РеквизитКодаТовараHEX"); // Значение реквизита "код товара" , тег 1162 в бинарном виде.
	ДанныеКодаТовара.Вставить("РеквизитКодаТовара"); // Значение реквизита "код товара", тег 1162  в BASE64.
	ДанныеКодаТовара.Вставить("ИдентифицируетЭкземпляр", Ложь);  // Идентификатора товара идентифицирует экземпляр товара.
	
	Возврат ДанныеКодаТовара;
	
КонецФункции

Функция НормализоватьШтрихкод(ИнформацияОШтрихкоде)
	
	ЧастиШтрихкода = ИнформацияОШтрихкоде.ДанныеМаркировки.ДанныеШтрихкода;
	
	Если ИнформацияОШтрихкоде.ЭтоКодМаркировки Тогда
		Возврат СтрШаблон("01%(1)21%2", ЧастиШтрихкода["01"].Значение, ЧастиШтрихкода["21"].Значение);
	ИначеЕсли ИнформацияОШтрихкоде.ЭтоТранспортныйКод Тогда
		Возврат СтрШаблон("00%1", ЧастиШтрихкода["00"].Значение);
	Иначе
		Возврат ИнформацияОШтрихкоде.Штрихкод;
	КонецЕсли;
	
	
КонецФункции

Функция НормализоватьШтрихкодПредставление(ИнформацияОШтрихкоде)
	
	ЧастиШтрихкода = ИнформацияОШтрихкоде.ДанныеМаркировки.ДанныеШтрихкода;
	
	Если ИнформацияОШтрихкоде.ЭтоКодМаркировки Тогда
		Возврат СтрШаблон("(01)%1(21)%2", ЧастиШтрихкода["01"].Значение, ЧастиШтрихкода["21"].Значение);
	ИначеЕсли ИнформацияОШтрихкоде.ЭтоТранспортныйКод Тогда
		Возврат СтрШаблон("(00)%1", ЧастиШтрихкода["00"].Значение);
	Иначе
		Возврат ИнформацияОШтрихкоде.Штрихкод;
	КонецЕсли;
	
	
КонецФункции

#КонецОбласти








