
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицуРаспоряжений(); 
	Если Параметры.ТипРаспоряжения = "Забор" Тогда	  
		ЭтаФорма.Заголовок = "Список распоряжений на забор"; 
	ИначеЕсли Параметры.ТипРаспоряжения = "Отгрузка" Тогда		
		ЭтаФорма.Заголовок = "Список распоряжений на отгрузку";
	КонецЕсли;
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьТаблицуРаспоряжений()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Параметры.ТипРаспоряжения = "Забор" Тогда  
		
		лТекст = "
		|ВЫБРАТЬ
		|	ПриобретениеТоваровУслуг.Номер КАК Номер,
		|	ПриобретениеТоваровУслуг.Дата КАК Дата
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|ГДЕ
		|	ПриобретениеТоваровУслуг.Контрагент = &Контрагент
		|	И ПриобретениеТоваровУслуг.Организация = &Организация
		|	И ПриобретениеТоваровУслуг.Проведен
		|	И НЕ ПриобретениеТоваровУслуг.ПометкаУдаления
		|";
		
		Запрос = Новый Запрос(лТекст);
		
		// Установка параметров.
		Запрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);	
		
		СписокРаспоряжений.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли Параметры.ТипРаспоряжения = "Отгрузка" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Номер КАК Номер,
		|	РеализацияТоваровУслуг.Дата КАК Дата
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Контрагент = &Контрагент
		|	И РеализацияТоваровУслуг.Организация = &Организация
		| 	И РеализацияТоваровУслуг.Проведен
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
		Запрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		
		СписокРаспоряжений.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;	
		
	
КонецПроцедуры // ЗаполнитьТаблицуРаспоряжений()

