
Функция ПриОткрытии(Форма, Отказ, НастройкаИБ) Экспорт
	
	Контекст = НовыйКонтекст();
	вмс_РаботаСФормамиКлиент.ПолучитьКлиентскиеПеременные(Форма)["НастройкаПолей_Контекст"] = Контекст;
	ЗаполнитьДанныеКонтекстаНаСервере(Форма);
	
	ЗагрузитьНастройкуНаФорме(Форма, НастройкаИБ);
	
	ДобавитьПодключаемыеКоманды(Форма);
	
КонецФункции

Функция ЗаполнитьДанныеКонтекстаНаСервере(Форма)
	
	Контекст = Контекст(Форма);
	
	Контекст.СКДРеквизитовЗадания = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
	
	вмс_НастройкиПолейЗаданияВызовСервера1.ЗаполнитьСКДРеквизитовЗадания(Контекст.СКДРеквизитовЗадания);
	
КонецФункции

Функция ДобавитьПодключаемыеКоманды(Форма)
	
	РК = вмс_РаботаСКоллекциями;
	
	Команды = вмс_ПодключаемыеКомандыКлиентСервер.ТаблицаКоманд();
	
	ДополнительныеПараметрыКоманды = Новый Структура;
	ДополнительныеПараметрыКоманды.Вставить("ИмяТаблицы", "НастройкаПолей_ЭлементыВывода");

	ДобавитьПодключаемуюКоманду(Команды, "НастройкаПолей_ЭлементыВыводаКонтекстноеМеню", "Добавить", "Добавить", БиблиотекаКартинок.ДобавитьЭлементСписка, "Подменю");
	ДобавитьПодключаемуюКоманду(Команды, "НастройкаПолей_ЭлементыВыводаКонтекстноеМенюДобавить", "ПолеДанных", "Поле данных", БиблиотекаКартинок.вмс_Реквизит, "Кнопка", "вмс_НастройкиПолейЗаданияКлиент1.ОбработчикДобавленияПоляДанных");
	ДобавитьПодключаемуюКоманду(Команды, "НастройкаПолей_ЭлементыВыводаКонтекстноеМенюДобавить", "ЭлементФормы", "Элемент формы", БиблиотекаКартинок.вмс_ПолеФормы, "Кнопка", "вмс_НастройкиПолейЗаданияКлиент1.ОбработчикДобавленияЭлементаФормы");
	ДобавитьПодключаемуюКоманду(Команды, "НастройкаПолей_ЭлементыВыводаКонтекстноеМеню", "ПереместитьВверх", "Переместить вверх", БиблиотекаКартинок.ПереместитьВверх, "Кнопка", "вмс_НастройкиПолейЗаданияКлиент1.ОбработчикПереместитьЭлемент", ДополнительныеПараметрыКоманды);
	ДобавитьПодключаемуюКоманду(Команды, "НастройкаПолей_ЭлементыВыводаКонтекстноеМеню", "ПереместитьВниз", "Переместить вниз", БиблиотекаКартинок.ПереместитьВниз, "Кнопка", "вмс_НастройкиПолейЗаданияКлиент1.ОбработчикПереместитьЭлемент", ДополнительныеПараметрыКоманды);
	ДобавитьПодключаемуюКоманду(Команды, "НастройкаПолей_ЭлементыВыводаКоманднаяПанель", "ПереместитьВверх", "", БиблиотекаКартинок.ПереместитьВверх, "Кнопка", "вмс_НастройкиПолейЗаданияКлиент1.ОбработчикПереместитьЭлемент", ДополнительныеПараметрыКоманды);
	ДобавитьПодключаемуюКоманду(Команды, "НастройкаПолей_ЭлементыВыводаКоманднаяПанель", "ПереместитьВниз", "", БиблиотекаКартинок.ПереместитьВниз, "Кнопка", "вмс_НастройкиПолейЗаданияКлиент1.ОбработчикПереместитьЭлемент", ДополнительныеПараметрыКоманды);

	ДобавитьПодключаемуюКоманду(Команды, "НастройкаПолей_ПоляДанныхКонтекстноеМеню", "ДобавитьКолонкуТаблицыДанных", "Добавить колонку таблицы", Неопределено, "Кнопка", "вмс_НастройкиПолейЗаданияКлиент1.ОбработчикДобавленияКолонкиТаблицыДанных");
	
	вмс_ПодключаемыеКомандыКлиент.ВывестиКоманды(Форма, Команды);
	
КонецФункции

Функция ДобавитьПодключаемуюКоманду(Команды, Группа, Имя, Представление, Картинка, Вид, Обработчик=Неопределено, ДополнительныеПараметры=Неопределено)
	
	РК = вмс_РаботаСКоллекциями;

	Команда = РК.ДобавитьЭлементКоллекции(Команды);
	Команда.ИмяВФорме = Группа + Имя;
	Команда.Вид = Вид;
	Команда.Представление = Представление;
	Команда.Подменю = Группа;
	Команда.Картинка = Картинка;
	Команда.Обработчик = Обработчик;
	Если ТипЗнч(ДополнительныеПараметры)=Тип("Структура") Тогда
		РК.СкопироватьПоляСтруктуры(ДополнительныеПараметры, Команда.ДополнительныеПараметры);
	КонецЕсли;

КонецФункции

Процедура ОбработчикДобавленияПоляДанных(Результат, КонтекстКоманды) Экспорт

	Форма = КонтекстКоманды.Форма;
	
	ЭлементыВывода_ПередНачаломДобавления(Форма, Форма.Элементы.НастройкаПолей_ЭлементыВывода, Ложь, Ложь, Неопределено, Неопределено, Неопределено, Истина);

КонецПроцедуры

Функция ПолучитьТекущуюСтраницуВводаДанных(Форма)
	
	РК = вмс_РаботаСКоллекциями;
	НПЗ = вмс_НастройкиПолейЗадания1;
	
	Контекст = Контекст(Форма);
	Настройка = Контекст.Настройка;
	
	ЭлементВыводаНаФорме = Форма.Элементы.НастройкаПолей_ЭлементыВывода.ТекущиеДанные;
	
	Если ЭлементВыводаНаФорме <> Неопределено Тогда
		ЭлементВывода = НПЗ.Элемент(Настройка, ЭлементВыводаНаФорме.ПолноеИмяЭлемента, "ЭлементыВывода");
		ПодчиненныеЭлементыВывода = НПЗ.ПолучитьПодчиненныеЭлементы(Настройка, ЭлементВывода, Истина);
		Для Каждого ПодчиненныйЭлементВывода Из ПодчиненныеЭлементыВывода Цикл
			Если ПодчиненныйЭлементВывода.ТипЭлемента="ГруппаФормы" И ПодчиненныйЭлементВывода.ВидЭлемента="СтраницаВводаДанных" Тогда
				Возврат ПодчиненныйЭлементВывода;
			КонецЕсли;
		КонецЦикла;
		
		ИерархияЭлементов = НПЗ.ПолучитьИерархиюЭлементов(Настройка, ЭлементВывода);
		ЭлементыИерархии = РК.ВыгрузитьЗначенияКолонкиКоллекции(ИерархияЭлементов, "Элемент");
		ЭлементыИерархии = РК.РазвернутьЭлементыМассива(ЭлементыИерархии);
		Для Каждого ЭлементИерархии Из ЭлементыИерархии Цикл
			Если ЭлементИерархии.ТипЭлемента="ГруппаФормы" И ЭлементИерархии.ВидЭлемента="СтраницаВводаДанных" Тогда
				Возврат ЭлементИерархии;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Процедура ОбработчикДобавленияЭлементаФормы(Результат, КонтекстКоманды) Экспорт

	Форма = КонтекстКоманды.Форма;
	
	ЭлементыВывода_ПередНачаломДобавления(Форма, Форма.Элементы.НастройкаПолей_ЭлементыВывода, Ложь, Ложь, Неопределено, Неопределено, Неопределено);

КонецПроцедуры

Процедура ОбработчикДобавленияКолонкиТаблицыДанных(Результат, КонтекстКоманды) Экспорт
	
	Форма = КонтекстКоманды.Форма;
	
	ЭлементНаФорме = Форма.Элементы.НастройкаПолей_ПоляДанных.ТекущиеДанные;
	
	Если ЭлементНаФорме.ТипЭлемента <> "Таблица" Тогда
		Возврат;
	КонецЕсли;
	
	Контекст = Контекст(Форма);
	
	ИмяТаблицы = ЭлементНаФорме.ПолноеИмяЭлемента;
	
	ЭлементКолонка = вмс_НастройкиПолейЗадания1.ДобавитьПолеДанных(Контекст.Настройка, ИмяТаблицы);
	
	ДобавитьЭлементыНаФорму(Форма, ЭлементКолонка);
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

Процедура ОбработчикПереместитьЭлемент(Результат, КонтекстКоманды) Экспорт

	РК = вмс_РаботаСКоллекциями;
	
	Форма = КонтекстКоманды.Форма;
	ИмяТаблицы = КонтекстКоманды.ОписаниеКоманды.ДополнительныеПараметры.ИмяТаблицы;
	ПереместитьВверх = СтрНайти(КонтекстКоманды.ОписаниеКоманды.ИмяВФорме, "ПереместитьВверх") > 0;
	ТаблицаФормы = Форма.Элементы.Найти(ИмяТаблицы);
	ДанныеТаблицыФормы = Форма[ИмяТаблицы];
	
	ЭлементНаФорме = ТаблицаФормы.ТекущиеДанные;
	РодительЭлемента = РК.ПолучитьРодителяЭлементаКоллекции(ЭлементНаФорме, ДанныеТаблицыФормы);
	ЭлементыРодителя = РодительЭлемента.ПолучитьЭлементы();
	ИндексЭлементаНаФорме = ЭлементыРодителя.Индекс(ЭлементНаФорме);
	
	Если ПереместитьВверх Тогда
		Если ИндексЭлементаНаФорме > 0 Тогда
			МестоНаФорме = ЭлементыРодителя[ИндексЭлементаНаФорме-1];
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		Если ИндексЭлементаНаФорме < ЭлементыРодителя.Количество()-1 Тогда
			Если ИндексЭлементаНаФорме = ЭлементыРодителя.Количество()-2 Тогда
				МестоНаФорме = РодительЭлемента; // переместить в конец группы
			Иначе
				МестоНаФорме = ЭлементыРодителя[ИндексЭлементаНаФорме+2];
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыПеретаскивания = Новый Структура;
	ПараметрыПеретаскивания.Вставить("Значение", Новый Массив);
	ПараметрыПеретаскивания.Значение.Добавить(ЭлементНаФорме.ПолучитьИдентификатор());
	Элементы_Перетаскивание(Форма, ТаблицаФормы, ПараметрыПеретаскивания, Ложь, МестоНаФорме.ПолучитьИдентификатор(), Неопределено, МестоНаФорме <> РодительЭлемента);

КонецПроцедуры

Функция Страницы_ПриСменеСтраницы(Форма, Элемент, ТекущаяСтраница) Экспорт
	
	ИмяТаблицыФормы = СтрЗаменить(ТекущаяСтраница.Имя, "ГруппаНастройкаПолей", "НастройкаПолей_");
	ТаблицаФормы = Форма.Элементы.Найти(ИмяТаблицыФормы);
	
	КлассЭлементов = СтрЗаменить(ТаблицаФормы.Имя, "НастройкаПолей_", "");
	ЗаполнитьСвойстваЭлементаНаФорме(Форма, КлассЭлементов, ТаблицаФормы.ТекущиеДанные);
	
КонецФункции

Функция Элементы_ПриАктивизацииСтроки(Форма, ТаблицаФормы) Экспорт
	
	КлассЭлементов = СтрЗаменить(ТаблицаФормы.Имя, "НастройкаПолей_", "");
	ЗаполнитьСвойстваЭлементаНаФорме(Форма, КлассЭлементов, ТаблицаФормы.ТекущиеДанные);
	
КонецФункции

Функция ЗаполнитьСвойстваЭлементаНаФорме(Форма, КлассЭлементов, ЭлементНаФорме)
	
	ИмяТекущегоКлассаЭлементов = СтрЗаменить(Форма.Элементы.ГруппаНастройкаПолейСтраницы.ТекущаяСтраница.Имя, "ГруппаНастройкаПолей", "");
	Если ИмяТекущегоКлассаЭлементов <> КлассЭлементов Тогда
		Возврат Ложь;
	КонецЕсли;

	РК = вмс_РаботаСКоллекциями;
	
	Контекст = Контекст(Форма);

	ДополнительныеДанныеСвойствЭлементов = Контекст.ДополнительныеДанныеСвойствЭлементов;
	ДополнительныеДанныеСвойствЭлементов.Очистить();
	
	СвойстваЭлементовНаФорме = Форма.НастройкаПолей_СвойстваЭлементов.ПолучитьЭлементы();
	СвойстваЭлементовНаФорме.Очистить();
	
	Если ЭлементНаФорме=Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Настройка = Контекст.Настройка;
	
	СвойстваЭлементовНаФорме = Форма.НастройкаПолей_СвойстваЭлементов;
	Если КлассЭлементов="ЭлементыВывода" Тогда
		Элемент = РК.НайтиЭлементКоллекции(Настройка[КлассЭлементов], Новый Структура("ПолноеИмя", ЭлементНаФорме.ПолноеИмяЭлемента));
		Если Элемент.Зависимый Тогда
			ПутьКДанным = Неопределено;
			Элемент.Свойства.Свойство("ПутьКДанным", ПутьКДанным);
			Если ЗначениеЗаполнено(ПутьКДанным) Тогда
				// выведим также свойства связанного поля
				СвойстваПоляДанныхНаФорме = СвойстваЭлементовНаФорме.ПолучитьЭлементы().Добавить();
				СвойстваПоляДанныхНаФорме.ИмяСвойства = "Свойства поля данных";
				ПолеДанных = РК.НайтиЭлементКоллекции(Настройка["ПоляДанных"], Новый Структура("ПолноеИмя", ПутьКДанным));
				ДобавитьСвойстваЭлементаНаФорме(Форма, ПолеДанных.КлассЭлемента, ПолеДанных.ЭлементНаФорме, СвойстваПоляДанныхНаФорме);
				Форма.Элементы.НастройкаПолей_СвойстваЭлементов.Развернуть(СвойстваПоляДанныхНаФорме.ПолучитьИдентификатор(), Истина);
				
				СвойстваЭлементовНаФорме = Форма.НастройкаПолей_СвойстваЭлементов.ПолучитьЭлементы().Добавить();
				СвойстваЭлементовНаФорме.ИмяСвойства = "Свойства элемента вывода";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ДобавитьСвойстваЭлементаНаФорме(Форма, КлассЭлементов, ЭлементНаФорме, СвойстваЭлементовНаФорме);
	
	Возврат Истина;
	
КонецФункции

Функция ДобавитьСвойстваЭлементаНаФорме(Форма, КлассЭлементов, ЭлементНаФорме, знач СвойстваЭлементовНаФорме=Неопределено)
	
	РК = вмс_РаботаСКоллекциями;
	
	Контекст = Контекст(Форма);

	ДополнительныеДанныеСвойствЭлементов = Контекст.ДополнительныеДанныеСвойствЭлементов;
	
	Если СвойстваЭлементовНаФорме=Неопределено Тогда
		СвойстваЭлементовНаФорме = Форма.НастройкаПолей_СвойстваЭлементов;
	КонецЕсли;
	
	Если ЭлементНаФорме=Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Если КлассЭлементов="ЭлементыВывода" Тогда
		ОписаниеСвойствЭлемента = вмс_КонструкторФорм.ПолучитьСвойстваЭлементаФормы(Контекст.СведенияОТипахЭлементовВывода, ЭлементНаФорме.ТипЭлемента, ЭлементНаФорме.ВидЭлемента);
	ИначеЕсли КлассЭлементов="ПоляДанных" Тогда
		ОписаниеСвойствЭлемента = РК.ПолучитьЭлементыКоллекции(Контекст.СведенияОСвойствахПолейОбработки);
	ИначеЕсли КлассЭлементов="СборщикиДанных" Тогда
		ОписаниеСвойствЭлемента = РК.ПолучитьЭлементыКоллекции(Контекст.СведенияОСвойствахСборщиковДанных);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Элемент = РК.НайтиЭлементКоллекции(Контекст.Настройка[КлассЭлементов], Новый Структура("ПолноеИмя", ЭлементНаФорме.ПолноеИмяЭлемента));
	ЗначенияСвойствЭлемента = Элемент.Свойства;
	
	Для Каждого ОписаниеСвойстваЭлемента Из ОписаниеСвойствЭлемента Цикл
		
		Если ОписаниеСвойстваЭлемента.СистемноеСвойство=Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначенияСвойствЭлемента.Свойство(ОписаниеСвойстваЭлемента.ИмяСвойства) Тогда
			ЗначениеСвойства = ЗначенияСвойствЭлемента[ОписаниеСвойстваЭлемента.ИмяСвойства];
		Иначе
			ЗначениеСвойства = ОписаниеСвойстваЭлемента.ЗначениеПоУмолчанию;
		КонецЕсли;
		
		СвойствоЭлементаНаФорме = СвойстваЭлементовНаФорме.ПолучитьЭлементы().Добавить();
		СвойствоЭлементаНаФорме.ПолноеИмяЭлемента = ЭлементНаФорме.ПолноеИмяЭлемента;
		СвойствоЭлементаНаФорме.КлассЭлемента = КлассЭлементов;
		СвойствоЭлементаНаФорме.ИмяСвойства = ОписаниеСвойстваЭлемента.ИмяСвойства;
		
		ДополнительныеДанныеСвойстваЭлемента = Новый Структура("ПолноеИмяЭлемента, ТипЭлемента, ИмяСвойства, Элемент, Значение, ОписаниеСвойства, СписокВыбора, ЭлементНаФорме, ЗначениеНаФорме");
		ЗаполнитьЗначенияСвойств(ДополнительныеДанныеСвойстваЭлемента, СвойствоЭлементаНаФорме);
		ДополнительныеДанныеСвойстваЭлемента.Элемент = Элемент;
		ДополнительныеДанныеСвойстваЭлемента.ЭлементНаФорме = ЭлементНаФорме;
		ДополнительныеДанныеСвойстваЭлемента.Значение = ЗначениеСвойства;
		ДополнительныеДанныеСвойстваЭлемента.ОписаниеСвойства = ОписаниеСвойстваЭлемента;

		Если КлассЭлементов="ЭлементыВывода" И ОписаниеСвойстваЭлемента.ИмяСвойства="Вид" Тогда
			// ограничим список доступных видов элемента вывода по родителю
			ДополнительныеДанныеСвойстваЭлемента.СписокВыбора = СписокДоступныхВидовЭлемента(Форма, ЭлементНаФорме);
		Иначе
			ДополнительныеДанныеСвойстваЭлемента.СписокВыбора = ОписаниеСвойстваЭлемента.СписокВыбора;
		КонецЕсли;
		
		ДополнительныеДанныеСвойствЭлементов[СвойствоЭлементаНаФорме.ПолучитьИдентификатор()] = ДополнительныеДанныеСвойстваЭлемента;
		
		// представление значения свойства на форме
		УстановитьЗначениеСвойстваНаФорме(Форма, СвойствоЭлементаНаФорме, ЗначениеСвойства);
		ДополнительныеДанныеСвойстваЭлемента.ЗначениеНаФорме = СвойствоЭлементаНаФорме.Значение;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСписокВыбораДоступныхТиповИВидовЭлементовВывода(Форма, РодительскиеЭлементы)
	
	СведенияОТипахЭлементовВывода = Контекст(Форма).СведенияОТипахЭлементовВывода;
	
	Возврат вмс_КонструкторФорм.ПолучитьСписокВыбораДоступныхТиповИВидовЭлементов(СведенияОТипахЭлементовВывода, , РодительскиеЭлементы);
	
КонецФункции

Функция ЭлементыВывода_ОбработчикВыбораПоля(ПолеСКД, ДополнительныеПараметры) Экспорт
	
	Если ПолеСКД=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	Контекст = Контекст(Форма);
	Настройка = Контекст.Настройка;
	СтраницаВводаДанных = ДополнительныеПараметры.СтраницаВводаДанных;

	РК = вмс_РаботаСКоллекциями;

	ПутьКДанным = Строка(ПолеСКД.Поле);
	ПутьКДаннымМассив = РК.ЗначениеВМассив(ПутьКДанным, ".", Ложь);
	
	Имя = ПутьКДаннымМассив[ПутьКДаннымМассив.ВГраница()];
	Синоним = Имя;
	ПутьКДаннымЗаполнения = ПутьКДанным;
	
	НПЗ = вмс_НастройкиПолейЗадания1;
	
	Настройка.ДополнительныеДанные.ПараметрыКонструирования.Начато = Ложь; // на случай крита при предыдущем конструировании
	НПЗ.НачатьКонструированиеЭлементов(Настройка);
	НПЗ.НачатьКонструированиеСтраницыВводаДанных(Настройка, СтраницаВводаДанных);
	НПЗ.ДобавитьПолеДанных(Настройка, , Имя);
	НПЗ.ЗакончитьКонструированиеЭлементов(Настройка);
	
	НовыеЭлементы = НПЗ.ПолучитьСконструированныеЭлементы(Настройка);
	
	ДобавитьЭлементыНаФорму(Форма, НовыеЭлементы);
	
	Форма.Модифицированность = Истина;
	
	ПараметрыПеретаскивания = Новый Структура;
	ПараметрыПеретаскивания.Вставить("Значение", Новый Массив);
	Для Каждого НовыйЭлемент Из НовыеЭлементы Цикл
		Если НовыйЭлемент.КлассЭлемента="ЭлементыВывода" Тогда
			ПараметрыПеретаскивания.Значение.Добавить(НовыйЭлемент.ЭлементНаФорме.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;

	Элементы_Перетаскивание(Форма, Форма.Элементы.НастройкаПолей_ЭлементыВывода, ПараметрыПеретаскивания, Ложь, ДополнительныеПараметры.Родители[0].ПолучитьИдентификатор(), Неопределено)

КонецФункции

Функция ЭлементыВывода_ОбработчикВыбораТипа(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РК = вмс_РаботаСКоллекциями;
	
	Форма = ДополнительныеПараметры.Форма;
	
	СведенияОТипеЭлементаВывода = ВыбранныйЭлемент.Значение;
	
	ДобавитьЭлементВыводаНаФорме(Форма, СведенияОТипеЭлементаВывода, ДополнительныеПараметры.Родители);
	
КонецФункции

Функция Элементы_ПроверкаПеретаскивания(Форма, ТабличноеПоле, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле) Экспорт

	РК = вмс_РаботаСКоллекциями;
	
	ЭлементыНаФорме = Форма[ТабличноеПоле.Имя];
	КлассЭлементов = Прав(ТабличноеПоле.Имя, СтрДлина(ТабличноеПоле.Имя)-СтрДлина("НастройкаПолей_"));

	ПеремещаемыеЭлементыНаФорме = Новый Массив;
	Для Каждого ИдентификаторПеремещаемогоЭлементаНаФорме Из ПараметрыПеретаскивания.Значение Цикл
		ПеремещаемыйЭлементНаФорме = ЭлементыНаФорме.НайтиПоИдентификатору(ИдентификаторПеремещаемогоЭлементаНаФорме);
		ПеремещаемыеЭлементыНаФорме.Добавить(ПеремещаемыйЭлементНаФорме);
	КонецЦикла;
	
	НовоеМестоЭлементовНаФорме = ?(Строка <> Неопределено, ЭлементыНаФорме.НайтиПоИдентификатору(Строка), Неопределено);
	Если КлассЭлементов="ЭлементыВывода" Тогда
		Если НовоеМестоЭлементовНаФорме=Неопределено Тогда
			НовоеМестоЭлементовНаФорме = ЭлементВыводаФорма(Форма);
		КонецЕсли;
	КонецЕсли;
	РодительНовогоМестаЭлементовНаФорме = РК.ПолучитьРодителяЭлементаКоллекции(НовоеМестоЭлементовНаФорме);
	
	Родители = Новый Массив;
	Родители.Добавить(НовоеМестоЭлементовНаФорме);
	Родители.Добавить(РодительНовогоМестаЭлементовНаФорме);
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ПроверитьВозможностьПодчиненияЭлементов(Форма, КлассЭлементов, Родители, ПеремещаемыеЭлементыНаФорме) Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;
	
КонецФункции

Функция Элементы_Перетаскивание(Форма, ТабличноеПоле, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле, ПомещатьПеред=Ложь) Экспорт

	СтандартнаяОбработка = Ложь;
	
	РК = вмс_РаботаСКоллекциями;
	
	Контекст = Контекст(Форма);

	ЭлементыНаФорме = Форма[ТабличноеПоле.Имя];
	ТипЭлементов = Прав(ТабличноеПоле.Имя, СтрДлина(ТабличноеПоле.Имя)-СтрДлина("НастройкаПолей_"));
	Элементы = Контекст.Настройка[ТипЭлементов];

	РодителиКопийЭлементов = Новый Соответствие;
	ИндексыКопийЭлементов = Новый Соответствие;
	СоответствиеЭлементов = Новый Соответствие;

	ПеремещаемыеЭлементыНаФорме = Новый Массив;
	Для Каждого ИдентификаторПеремещаемогоЭлементаНаФорме Из ПараметрыПеретаскивания.Значение Цикл
		ПеремещаемыйЭлементНаФорме = ЭлементыНаФорме.НайтиПоИдентификатору(ИдентификаторПеремещаемогоЭлементаНаФорме);
		ПеремещаемыеЭлементыНаФорме.Добавить(ПеремещаемыйЭлементНаФорме);
	КонецЦикла;
	
	НовоеМестоЭлементовНаФорме = ?(Строка <> Неопределено, ЭлементыНаФорме.НайтиПоИдентификатору(Строка), Неопределено);

	Если ТипЭлементов="ЭлементыВывода" Тогда
		Если НовоеМестоЭлементовНаФорме=Неопределено Тогда
			НовоеМестоЭлементовНаФорме = ЭлементВыводаФорма(Форма);
		КонецЕсли;
	КонецЕсли;
	
	Если НовоеМестоЭлементовНаФорме <> Неопределено Тогда
		
		РодительНовогоМестаЭлементовНаФорме = РК.ПолучитьРодителяЭлементаКоллекции(НовоеМестоЭлементовНаФорме);
		Если РодительНовогоМестаЭлементовНаФорме <> Неопределено Тогда
			ИндексНовогоМеста = РодительНовогоМестаЭлементовНаФорме.ПолучитьЭлементы().Индекс(НовоеМестоЭлементовНаФорме);
		Иначе
			ИндексНовогоМеста = ЭлементыНаФорме.ПолучитьЭлементы().Индекс(НовоеМестоЭлементовНаФорме);
		КонецЕсли;

		Для Каждого ПеремещаемыйЭлементНаФорме Из ПеремещаемыеЭлементыНаФорме Цикл
			
			Если ПомещатьПеред Тогда
				ПомещатьЭлементПеред = Истина;
			Иначе
				РодительНовогоЭлементаНаФорме = РК.ПолучитьРодителяЭлементаКоллекции(ПеремещаемыйЭлементНаФорме);
				Если РодительНовогоЭлементаНаФорме=НовоеМестоЭлементовНаФорме
					И РодительНовогоМестаЭлементовНаФорме <> Неопределено
					И ПроверитьВозможностьПодчиненияЭлементов(Форма, ТипЭлементов, РодительНовогоМестаЭлементовНаФорме, ПеремещаемыйЭлементНаФорме) Тогда
					// если перетягиваем элемент на группу, которая уже является родителем, то вместо помещения в группу расположим перед группой
					// если потом перетянуть на эту же группу, то элемент на этот раз добавится в конец группы
					// таким образом чтобы переместить элемент в конец группы надо перетянуть на группу дважды
					// зато при первом перетягивании будет иметься возможность достать элемент из группы и поставить перед группой
					// (больше возможностей, удобнее пользоваться, а вот в стандартном редакторе управляемых форм такой фичи нету)
					ПомещатьЭлементПеред = Истина;
				ИначеЕсли НЕ ПроверитьВозможностьПодчиненияЭлементов(Форма, ТипЭлементов, НовоеМестоЭлементовНаФорме, ПеремещаемыйЭлементНаФорме) Тогда
					ПомещатьЭлементПеред = Истина;
				Иначе
					ПомещатьЭлементПеред = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если ПомещатьЭлементПеред Тогда
				РодителиКопийЭлементов[ПеремещаемыйЭлементНаФорме] = РодительНовогоМестаЭлементовНаФорме;
				ИндексыКопийЭлементов[ПеремещаемыйЭлементНаФорме] = ИндексНовогоМеста;
				ИндексНовогоМеста = ИндексНовогоМеста + 1;
			Иначе
				РодителиКопийЭлементов[ПеремещаемыйЭлементНаФорме] = НовоеМестоЭлементовНаФорме;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	КопируемыеЭлементыНаФорме = РК.СкопироватьМассив(ПеремещаемыеЭлементыНаФорме);
	
	ПересчитатьНомераЭлементовРодителей = Новый Массив;
	ИзмененныеЭлементы = Новый Массив;
	Для Каждого КопируемыйЭлементНаФорме Из КопируемыеЭлементыНаФорме Цикл
		
		РодительНовогоЭлементаНаФорме = РодителиКопийЭлементов[КопируемыйЭлементНаФорме];
		Если РодительНовогоЭлементаНаФорме=Неопределено Тогда
			ИмяРодителя = Неопределено;
			РодительНовогоЭлементаНаФорме = ЭлементыНаФорме;
		Иначе
			ИмяРодителя = РодительНовогоЭлементаНаФорме.ПолноеИмяЭлемента;
		КонецЕсли;
		
		ИндексНовогоЭлемента = ИндексыКопийЭлементов[КопируемыйЭлементНаФорме];
		Если ИндексНовогоЭлемента <> Неопределено Тогда
			НовыйЭлементНаФорме = РодительНовогоЭлементаНаФорме.ПолучитьЭлементы().Вставить(ИндексНовогоЭлемента);
		Иначе
			НовыйЭлементНаФорме = РодительНовогоЭлементаНаФорме.ПолучитьЭлементы().Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовыйЭлементНаФорме, КопируемыйЭлементНаФорме);
		
		СоответствиеЭлементов[КопируемыйЭлементНаФорме] = НовыйЭлементНаФорме;
		
		Элемент = РК.НайтиЭлементКоллекции(Элементы, Новый Структура("ПолноеИмя", НовыйЭлементНаФорме.ПолноеИмяЭлемента));

		ПересчитатьНомераЭлементовРодителей.Добавить(Элемент.Родитель);
		ПересчитатьНомераЭлементовРодителей.Добавить(ИмяРодителя);
		
		Элемент.ДополнительныеДанные.Вставить("ПредыдущийРодитель", Элемент.Родитель);
		Элемент.Родитель = ИмяРодителя;
		РК.ИндексироватьКоллекцию(Элементы, Элемент);
		Если ИмяРодителя <> Неопределено Тогда
			Элемент.Свойства.Вставить("Родитель", ИмяРодителя);
		Иначе
			Элемент.Свойства.Удалить("Родитель");
		КонецЕсли;
		
		Элемент.ЭлементНаФорме = НовыйЭлементНаФорме;
		
		ИзмененныеЭлементы.Добавить(Элемент);
		
		Для Каждого ПодчиненныйЭлемент Из КопируемыйЭлементНаФорме.ПолучитьЭлементы() Цикл
			Если РодителиКопийЭлементов[ПодчиненныйЭлемент]=Неопределено Тогда
				КопируемыеЭлементыНаФорме.Добавить(ПодчиненныйЭлемент);
				РодителиКопийЭлементов[ПодчиненныйЭлемент] = НовыйЭлементНаФорме;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	// так как между перемещаемыми элементами возможна иерархия,
	// то удаляем их по обратному порядку иерархии
	ВложенныеЭлементыНаФорме = РК.ПолучитьПодчиненныеЭлементыКоллекции(ПеремещаемыеЭлементыНаФорме);
	УдаляемыеЭлементыНаФорме = РК.СложениеМассивов(ПеремещаемыеЭлементыНаФорме, ВложенныеЭлементыНаФорме);
	РК.РазвернутьЭлементыМассива(УдаляемыеЭлементыНаФорме);
	РК.УдалитьДублиВМассиве(УдаляемыеЭлементыНаФорме);
	
	НовыйЭлементНаФорме = СоответствиеЭлементов[ТабличноеПоле.ТекущиеДанные];

	Для Каждого УдаляемыйЭлементНаФорме Из УдаляемыеЭлементыНаФорме Цикл
		РК.ПолучитьРодителяЭлементаКоллекции(УдаляемыйЭлементНаФорме, ЭлементыНаФорме).ПолучитьЭлементы().Удалить(УдаляемыйЭлементНаФорме);
	КонецЦикла;
	
	РК.УдалитьДублиВМассиве(ПересчитатьНомераЭлементовРодителей);
	Для Каждого Родитель Из ПересчитатьНомераЭлементовРодителей Цикл
		ЭлементыРодителя = РК.НайтиЭлементыКоллекции(Элементы, Новый Структура("Родитель", Родитель));
		Для Каждого Элемент Из ЭлементыРодителя Цикл
			ЭлементНаФорме = Элемент.ЭлементНаФорме;
			НомерЭлемента = РК.ПолучитьРодителяЭлементаКоллекции(ЭлементНаФорме, ЭлементыНаФорме).ПолучитьЭлементы().Индекс(ЭлементНаФорме);
			Элемент.Номер = НомерЭлемента;
			Элемент.Свойства.Вставить("Номер", НомерЭлемента);
		КонецЦикла;
	КонецЦикла;
	
	вмс_НастройкиПолейЗадания1.ПриИзмененииРодителейЭлементов(Контекст.Настройка, ИзмененныеЭлементы);
	вмс_НастройкиПолейЗадания1.ПриИзмененииПорядкаЭлементовВыводаПолейДанных(Контекст.Настройка, ИзмененныеЭлементы);
	
	Для Каждого Элемент Из ИзмененныеЭлементы Цикл
		Элемент.ДополнительныеДанные.Вставить("ПредыдущийРодитель", Элемент.Родитель);
	КонецЦикла;
	
	ТабличноеПоле.ТекущаяСтрока = НовыйЭлементНаФорме.ПолучитьИдентификатор();
	
	Форма.Модифицированность = Истина;
	
КонецФункции

Функция Элементы_ОкончаниеПеретаскивания(Форма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка) Экспорт
КонецФункции

Функция ПроверитьВозможностьПодчиненияЭлементов(Форма, КлассЭлементов, знач Элементы, знач ПодчиненныеЭлементы)
	
	РК = вмс_РаботаСКоллекциями;

	Элементы = РК.ЗначениеВМассив(Элементы);
	ПодчиненныеЭлементы = РК.ЗначениеВМассив(ПодчиненныеЭлементы);
	
	// проверим, что элементы для подчинения не содержат родительские элементы
	ПодчиненныеЭлементыСИерархией = РК.СложениеМассивов(ПодчиненныеЭлементы, РК.ПолучитьПодчиненныеЭлементыКоллекции(ПодчиненныеЭлементы));
	Если РК.ПересечениеМассивов(Элементы, ПодчиненныеЭлементыСИерархией).Количество() > 0 Тогда
		// попытка поместить элемент в собственную иерархию
		Возврат Ложь;
	КонецЕсли;
	
	Если КлассЭлементов="ЭлементыВывода" Тогда
		
		Возврат вмс_КонструкторФорм.ПроверитьВозможностьПодчиненияЭлементов(Контекст(Форма).СведенияОТипахЭлементовВывода, Элементы, ПодчиненныеЭлементы);
		
	Иначе
		
		Для Каждого ПодчиненныйЭлемент Из ПодчиненныеЭлементы Цикл
			
			Если Элементы.Найти(ПодчиненныйЭлемент.ПолучитьРодителя())=Неопределено Тогда
				// возможность перемещения только в пределах родителя
				Возврат Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

Функция Элементы_ПередУдалением(Форма, ТабличноеПоле, Отказ) Экспорт
	
	Отказ = Истина;
	
	РК = вмс_РаботаСКоллекциями;
	
	Контекст = Контекст(Форма);
	
	КлассЭлементов = СтрЗаменить(ТабличноеПоле.Имя, "НастройкаПолей_", "");
	Элементы = Контекст.Настройка[КлассЭлементов];
	ЭлементыНаФорме = Форма[ТабличноеПоле.Имя];
	
	ВыделенныеЭлементыНаФорме = Новый Массив;
	Для Каждого ИдентификаторВыделенногоЭлементаНаФорме Из ТабличноеПоле.ВыделенныеСтроки Цикл
		ВыделенныйЭлементНаФорме = ЭлементыНаФорме.НайтиПоИдентификатору(ИдентификаторВыделенногоЭлементаНаФорме);
		Если КлассЭлементов="ЭлементыВывода" Тогда
			Если ВыделенныйЭлементНаФорме.ТипЭлемента="ФормаКлиентскогоПриложения" Тогда
				// не удалять корневой узел
			Иначе
				ВыделенныеЭлементыНаФорме.Добавить(ВыделенныйЭлементНаФорме);
			КонецЕсли;
		Иначе
			ВыделенныеЭлементыНаФорме.Добавить(ВыделенныйЭлементНаФорме);
		КонецЕсли;
	КонецЦикла;
	
	// удалим элемент вместе с подчиненными элементами
	ЭлементыДляУдаленияНаФорме = Новый Массив;
	РК.ДобавитьЭлементыКоллекции(ЭлементыДляУдаленияНаФорме, ВыделенныеЭлементыНаФорме);
	РК.ДобавитьЭлементыКоллекции(ЭлементыДляУдаленияНаФорме, РК.ПолучитьПодчиненныеЭлементыКоллекции(ВыделенныеЭлементыНаФорме));
	РК.РазвернутьЭлементыМассива(ЭлементыДляУдаленияНаФорме);
	РК.УдалитьДублиВМассиве(ЭлементыДляУдаленияНаФорме);
	
	ЭлементыДляУдаления = Новый Массив;
	Для Каждого ЭлементДляУдаленияНаФорме Из ЭлементыДляУдаленияНаФорме Цикл
		ЭлементДляУдаления = РК.НайтиЭлементыКоллекции(Элементы, Новый Структура("ПолноеИмя", ЭлементДляУдаленияНаФорме.ПолноеИмяЭлемента));
		РК.ДобавитьЭлементыКоллекции(ЭлементыДляУдаления, ЭлементДляУдаления);
	КонецЦикла;
	
	// также могли быть удалены связанные элементы
	РезультатУдаленияЭлементов = вмс_НастройкиПолейЗадания1.УдалитьЭлементы(Контекст.Настройка, ЭлементыДляУдаления);
	
	ОбработатьРезультатИзмененияЭлементовНаФорме(Форма, РезультатУдаленияЭлементов);
	
	Форма.Модифицированность = Истина;
	
КонецФункции

Функция ОбработатьРезультатИзмененияЭлементовНаФорме(Форма, РезультатДействия)

	РК = вмс_РаботаСКоллекциями;
	Для Каждого УдаленныйЭлемент Из РезультатДействия.УдаленныеЭлементы Цикл
		
		ЭлементыНаФорме = Форма["НастройкаПолей_" + УдаленныйЭлемент.КлассЭлемента];
		ЭлементДляУдаленияНаФорме = УдаленныйЭлемент.ЭлементНаФорме;
		РК.ПолучитьРодителяЭлементаКоллекции(ЭлементДляУдаленияНаФорме, ЭлементыНаФорме).ПолучитьЭлементы().Удалить(ЭлементДляУдаленияНаФорме);
		
	КонецЦикла;
	
КонецФункции

Функция СписокДоступныхВидовЭлемента(Форма, ЭлементНаФорме)

	РК = вмс_РаботаСКоллекциями;
	
	Контекст = Контекст(Форма);
	СведенияОТипахЭлементовВывода = Контекст.СведенияОТипахЭлементовВывода;
	ДоступныеВидыЭлемента = вмс_КонструкторФорм.ПолучитьДоступныеВидыЭлемента(СведенияОТипахЭлементовВывода, ЭлементНаФорме.ТипЭлемента, ЭлементНаФорме.ВидЭлемента, РК.ПолучитьРодителяЭлементаКоллекции(ЭлементНаФорме));
	СписокВыбора = Новый СписокЗначений;
	Для Каждого ДоступныйВидЭлемента Из ДоступныеВидыЭлемента Цикл
		Если ТипЗнч(ДоступныйВидЭлемента.ЗначениеСвойстваВидЭлемента)=Тип("Структура") Тогда
			ПредставлениеЗначенияВидЭлемента = ДоступныйВидЭлемента.ЗначениеСвойстваВидЭлемента.Представление;
		Иначе
			ПредставлениеЗначенияВидЭлемента = Строка(ДоступныйВидЭлемента.ЗначениеСвойстваВидЭлемента);
		КонецЕсли;
		СписокВыбора.Добавить(ДоступныйВидЭлемента.ЗначениеСвойстваВидЭлемента, ПредставлениеЗначенияВидЭлемента);
	КонецЦикла;
	
	Возврат СписокВыбора;

КонецФункции

Функция СвойстваЭлементов_ПриАктивизацииСтроки(Форма, ТабличноеПоле) Экспорт

	СвойствоЭлементаНаФорме = ТабличноеПоле.ТекущиеДанные;
	Если СвойствоЭлементаНаФорме=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Контекст = Контекст(Форма);
	ДополнительныеДанныеСвойстваЭлемента = Контекст.ДополнительныеДанныеСвойствЭлементов[СвойствоЭлементаНаФорме.ПолучитьИдентификатор()];
	Если ДополнительныеДанныеСвойстваЭлемента=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭлементЗначение = Форма.Элементы.НастройкаПолей_СвойстваЭлементовЗначение;
	
	ТипЗначенияСвойства = ДополнительныеДанныеСвойстваЭлемента.ОписаниеСвойства.Тип;
	
	СписокВыбораНаФорме = ЭлементЗначение.СписокВыбора;
	СписокВыбораНаФорме.Очистить();
	Если ДополнительныеДанныеСвойстваЭлемента.СписокВыбора <> Неопределено Тогда
		Для Каждого ЭлементСпискаВыбора Из ДополнительныеДанныеСвойстваЭлемента.СписокВыбора Цикл
			ЭлементСпискаВыбораНаФорме = СписокВыбораНаФорме.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементСпискаВыбораНаФорме, ЭлементСпискаВыбора);
			ЭлементСпискаВыбораНаФорме.Значение = ЭлементСпискаВыбора.Представление; // не все типы можно хранить в данных формы, сохраним в виде представления
		КонецЦикла;
		ЭлементЗначение.РежимВыбораИзСписка = Истина;
		ЭлементЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка");
	ИначеЕсли вмс_НастройкиПолейЗадания1.ЭтоСсылочныйТипНаЭлементНастройки(ТипЗначенияСвойства) Тогда 
		ЭлементЗначение.РежимВыбораИзСписка = Ложь;
		ЭлементЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка"); // значение свойства будет содержать список имен элементов, на которые ссылается текущий элемент
	Иначе
		ЭлементЗначение.РежимВыбораИзСписка = Ложь;
		ЭлементЗначение.ОграничениеТипа = Новый ОписаниеТипов(ТипЗначенияСвойства);
	КонецЕсли;
	
КонецФункции

Функция СвойстваЭлементов_Выбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
	Отказ = Ложь;
	СвойстваЭлементов_ПередНачаломИзменения(Форма, Элемент, Отказ);
	Если Отказ Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецФункции

Функция СвойстваЭлементов_ПередНачаломИзменения(Форма, Элемент, Отказ) Экспорт

	Контекст = Контекст(Форма);

	СвойствоЭлементаНаФорме = Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущиеДанные;
	ДополнительныеДанныеСвойстваЭлемента = Контекст.ДополнительныеДанныеСвойствЭлементов[СвойствоЭлементаНаФорме.ПолучитьИдентификатор()];
	Если ДополнительныеДанныеСвойстваЭлемента=Неопределено Тогда
		Отказ = Истина;
		Возврат Ложь;
	КонецЕсли;
	
	ТипСвойства = ДополнительныеДанныеСвойстваЭлемента.ОписаниеСвойства.Тип;
	
	ОписаниеСвойства = ДополнительныеДанныеСвойстваЭлемента.ОписаниеСвойства;
	
	КлассЭлементовЗначенияСвойства = Неопределено;
	Если вмс_НастройкиПолейЗадания1.ЭтоСсылочныйТипНаЭлементНастройки(ОписаниеСвойства.Тип, КлассЭлементовЗначенияСвойства) Тогда
		
		Отказ = Истина;
		
		Параметры = Новый Структура;
		Параметры.Вставить("ИдентификаторСвойства", СвойствоЭлементаНаФорме.ПолучитьИдентификатор());
		Параметры.Вставить("КлассЭлементов", КлассЭлементовЗначенияСвойства);
		Параметры.Вставить("НесколькоЗначений", ОписаниеСвойства.НесколькоЗначений=Истина);
		Параметры.Вставить("Форма", Форма);
		
		ОО = НовыйОписаниеОповещения("НачалоВыбораЭлементовНастройки"); 
		ВыполнитьОбработкуОповещения(ОО, Параметры);
		
	ИначеЕсли ТипСвойства="Картинка" Тогда

		Отказ = Истина;

		ДополнительныеПараметрыОповещения = Новый Структура;
		ДополнительныеПараметрыОповещения.Вставить("Форма", Форма);
		ДополнительныеПараметрыОповещения.Вставить("СвойствоЭлементаНаФорме", СвойствоЭлементаНаФорме);
		
		ОО = НовыйОписаниеОповещения("ОбработчикВыбораЗначенияКартинкиСвойства", , ДополнительныеПараметрыОповещения);
		
		вмс_РаботаСФормамиКлиент.ОткрытьДиалогВыбораКартинки(ОО, Форма, СвойствоЭлементаНаФорме.ЗначениеКартинка);
		
	ИначеЕсли ТипСвойства="ОписаниеТипов" Тогда

		Отказ = Истина;

		ДополнительныеПараметрыОповещения = Новый Структура;
		ДополнительныеПараметрыОповещения.Вставить("Форма", Форма);
		ДополнительныеПараметрыОповещения.Вставить("СвойствоЭлементаНаФорме", СвойствоЭлементаНаФорме);
		ОписаниеОповещенияОЗакрытии = НовыйОписаниеОповещения("ОбработчикРедактированияТипаРеквизита", , ДополнительныеПараметрыОповещения);

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОписаниеТипов", ДополнительныеДанныеСвойстваЭлемента.Значение);
		вмс_РаботаСФормамиКлиент.ОткрытьФормуУлучшенная("ОбщаяФорма.ФормаРедактированияТипаДанных", ПараметрыФормы, Форма, , , , ОписаниеОповещенияОЗакрытии);
		
	КонецЕсли;
	
КонецФункции


Функция НачалоВыбораЭлементовНастройки(Параметры, ДополнительныеПараметры) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	Форма = Параметры.Форма;
	Контекст = Контекст(Форма);
	
	ДополнительныеДанныеСвойстваЭлемента = Контекст.ДополнительныеДанныеСвойствЭлементов[Параметры.ИдентификаторСвойства];
	Элементы = Контекст.Настройка[Параметры.КлассЭлементов];
	ВыбранныеЭлементы = Новый Массив;
	Для Каждого ИмяЭлемента Из РК.ЗначениеВМассив(ДополнительныеДанныеСвойстваЭлемента.Значение) Цикл
		РК.ДобавитьЭлементыКоллекции(ВыбранныеЭлементы, РК.НайтиЭлементыКоллекции(Элементы, Новый Структура("ПолноеИмя", ИмяЭлемента)));
	КонецЦикла;
	
	ОО = НовыйОписаниеОповещения("ПриВыбореЭлементовНастройки", , Параметры);
	МножественныйВыбор = Параметры.НесколькоЗначений=Истина;
	ОткрытьФормуВыбораЭлемента(Элементы, ОО, ВыбранныеЭлементы, МножественныйВыбор, , Форма);
	
КонецФункции

Функция ПриВыбореЭлементовНастройки(знач ВыбранныеЭлементы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеЭлементы=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РК = вмс_РаботаСКоллекциями;

	Форма = ДополнительныеПараметры.Форма;
	ИдентификаторСвойства = ДополнительныеПараметры.ИдентификаторСвойства;
	
	СвойствоЭлементаНаФорме = Форма.НастройкаПолей_СвойстваЭлементов.НайтиПоИдентификатору(ИдентификаторСвойства);
	Если СвойствоЭлементаНаФорме=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВыбранныеЭлементы = РК.ЗначениеВМассив(ВыбранныеЭлементы);
	ИменаЭлементовМассив = РК.ВыгрузитьЗначенияКолонкиКоллекции(ВыбранныеЭлементы, "ПолноеИмя");
	ИменаЭлементов = РК.МассивВСтроку(ИменаЭлементовМассив);
	
	УстановитьЗначениеСвойстваЭлемента(Форма, СвойствоЭлементаНаФорме, ИменаЭлементов);
	
КонецФункции

Функция ОткрытьФормуВыбораЭлемента(ЭлементыДляВыбора, ОписаниеОповещенияОЗакрытии, ВыбранныеЭлементы, МножественныйВыбор=Ложь, УказыватьПорядокЭлементов=Неопределено, Владелец=Неопределено)
	
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("ЭлементыДляВыбора", ЭлементыДляВыбора);
	ПараметрыНовойФормы.Вставить("ВыбранныеЭлементы", ВыбранныеЭлементы);
	ПараметрыНовойФормы.Вставить("МножественныйВыбор", МножественныйВыбор);
	ПараметрыНовойФормы.Вставить("УказыватьПорядокЭлементов", УказыватьПорядокЭлементов);
	вмс_РаботаСФормамиКлиент.ОткрытьФормуУлучшенная("ОбщаяФорма.вмс_ФормаВыбораЭлемента", ПараметрыНовойФормы, Владелец, , , , ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

Функция СвойстваЭлементов_Значение_ПриИзменении(Форма, Элемент) Экспорт
	
	СвойствоЭлементаНаФорме = Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущиеДанные;
	УстановитьЗначениеСвойстваЭлемента(Форма, СвойствоЭлементаНаФорме, СвойствоЭлементаНаФорме.Значение);

КонецФункции

Функция УстановитьЗначениеСвойстваЭлемента(Форма, СвойствоЭлементаНаФорме, знач ЗначениеСвойства)

	РК = вмс_РаботаСКоллекциями;
	
	Контекст = Контекст(Форма);
	Настройка = Контекст.Настройка;
	
	Элементы = Настройка[СвойствоЭлементаНаФорме.КлассЭлемента];
	
	ИмяСвойства = СвойствоЭлементаНаФорме.ИмяСвойства;
	КлассЭлементаСвойства = СвойствоЭлементаНаФорме.КлассЭлемента;
	
	ДополнительныеДанныеСвойстваЭлемента = Контекст.ДополнительныеДанныеСвойствЭлементов[СвойствоЭлементаНаФорме.ПолучитьИдентификатор()];
	Элемент = ДополнительныеДанныеСвойстваЭлемента.Элемент;
	ЭлементНаФорме = ДополнительныеДанныеСвойстваЭлемента.ЭлементНаФорме;
	
	ИмяТекущегоКлассаЭлементов = СтрЗаменить(Форма.Элементы.ГруппаНастройкаПолейСтраницы.ТекущаяСтраница.Имя, "ГруппаНастройкаПолей", "");
	ТабличноеПолеЭлементовНаФорме = Форма.Элементы.Найти("НастройкаПолей_" + ИмяТекущегоКлассаЭлементов);
	ОсновнойЭлементНаФорме = ТабличноеПолеЭлементовНаФорме.ТекущиеДанные;
	
	Попытка
		РезультатИзмененияЭлементов = вмс_НастройкиПолейЗадания1.УстановитьСвойстваЭлементов(Настройка, Элемент, Новый Структура(ИмяСвойства, ЗначениеСвойства));
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Если ИнформацияОбОшибке.Код="ОшибкаИзмененияЭлементовНастройкиПолей" Тогда
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			ОО = НовыйОписаниеОповещения("ОбработчикОтменаИзмененияСвойства", , Новый Структура("Форма, СвойствоЭлементаНаФорме", Форма, СвойствоЭлементаНаФорме));
			ПоказатьПредупреждение(ОО, ТекстОшибки);
			Возврат Ложь;
		КонецЕсли;
		
		ВызватьИсключение(,,,,ИнформацияОбОшибке);
	КонецПопытки;
	
	// значение могло сконвертироваться при установке свойства
	// перечитаем значение
	ЗначениеСвойства = вмс_НастройкиПолейЗадания1.ПолучитьЗначениеСвойстваЭлемента(Настройка, Элемент, ИмяСвойства);
	
	ПерезаполнитьСвойстваЭлемента = Ложь;
	Если ИмяСвойства="Имя" Тогда
		
		ПриИзмененииИмениЭлемента(Форма, Элемент);
		
		Если Элемент.КлассЭлемента="ЭлементыВывода" И Элемент.Зависимый Тогда
			// перезаполнить свойства поля данных, которые выводятся на одной странице со свойствами элемента вывода
			ПерезаполнитьСвойстваЭлемента = Истина;
		КонецЕсли;
		
	ИначеЕсли ИмяСвойства="Вид" Тогда
		
		Если Элемент.КлассЭлемента="ЭлементыВывода" Тогда
			ЭлементНаФорме.ВидЭлемента = Элемент.ВидЭлемента;
			ПриИзмененииТипаЭлемента(Форма, Элемент);
			ПерезаполнитьСвойстваЭлемента = Истина;
		КонецЕсли;
		
	ИначеЕсли ИмяСвойства="ТипЗначения" Тогда
		
		Если Элемент.КлассЭлемента="ПоляДанных" Тогда
			ЭлементНаФорме.ТипЭлемента = Элемент.ТипЭлемента;
			ПриИзмененииТипаЭлемента(Форма, Элемент);
		КонецЕсли;

	ИначеЕсли ИмяСвойства="ПутьКДанным" Тогда
		
		Если Элемент.КлассЭлемента="ЭлементыВывода" И Элемент.Зависимый Тогда
			// перезаполнить свойства поля данных, которые выводятся на одной странице со свойствами элемента вывода
			ПерезаполнитьСвойстваЭлемента = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьЗначениеСвойстваНаФорме(Форма, СвойствоЭлементаНаФорме, ЗначениеСвойства);

	ДополнительныеДанныеСвойстваЭлемента.Значение = ЗначениеСвойства;
	ДополнительныеДанныеСвойстваЭлемента.ЗначениеНаФорме = СвойствоЭлементаНаФорме.Значение;
	
	Если ПерезаполнитьСвойстваЭлемента Тогда
		ЗаполнитьСвойстваЭлементаНаФорме(Форма, ИмяТекущегоКлассаЭлементов, ОсновнойЭлементНаФорме);
		СвойствоЭлементаНаФорме = РК.НайтиЭлементКоллекции(РК.ПолучитьПодчиненныеЭлементыКоллекции(Форма.НастройкаПолей_СвойстваЭлементов), Новый Структура("ИмяСвойства, КлассЭлемента", ИмяСвойства, КлассЭлементаСвойства));
		Если СвойствоЭлементаНаФорме <> Неопределено Тогда
			Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущаяСтрока = СвойствоЭлементаНаФорме.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	ОбработатьРезультатИзмененияЭлементовНаФорме(Форма, РезультатИзмененияЭлементов);
	
	Форма.Модифицированность = Истина;
	
КонецФункции

Функция УстановитьЗначениеСвойстваНаФорме(Форма, СвойствоЭлементаНаФорме, ЗначениеСвойства)
	
	Перем КлассЭлементовЗначенияСвойства;
	
	РК = вмс_РаботаСКоллекциями;
	
	Контекст = Контекст(Форма);

	ДополнительныеДанныеСвойстваЭлемента = Контекст.ДополнительныеДанныеСвойствЭлементов[СвойствоЭлементаНаФорме.ПолучитьИдентификатор()];
	СписокВыбора = ДополнительныеДанныеСвойстваЭлемента.СписокВыбора;
	ОписаниеСвойстваЭлемента = ДополнительныеДанныеСвойстваЭлемента.ОписаниеСвойства;
	
	Если СписокВыбора <> Неопределено Тогда
		ЭлементСпискаВыбора = СписокВыбора.НайтиПоЗначению(ЗначениеСвойства);
		Если ЭлементСпискаВыбора <> Неопределено Тогда
			ЗначениеСвойстваНаФорме = ЭлементСпискаВыбора.Представление;
		Иначе
			ЗначениеСвойстваНаФорме = "";
		КонецЕсли;
	ИначеЕсли вмс_НастройкиПолейЗадания1.ЭтоСсылочныйТипНаЭлементНастройки(ОписаниеСвойстваЭлемента.Тип, КлассЭлементовЗначенияСвойства) Тогда
		ЗначениеСвойстваНаФормеМассив = Новый Массив;
		ЭлементыТипаСвойства = Контекст.Настройка[КлассЭлементовЗначенияСвойства];
		Для Каждого ИмяЭлементаПоСсылке Из РК.ЗначениеВМассив(ЗначениеСвойства) Цикл
			ЭлементПоСсылке = РК.НайтиЭлементКоллекции(ЭлементыТипаСвойства, Новый Структура("ПолноеИмя", ИмяЭлементаПоСсылке));
			Если ЭлементПоСсылке <> Неопределено Тогда
				ПредставлениеЭлемента = ПредставлениеЭлемента(ЭлементыТипаСвойства, ЭлементПоСсылке);
				ЗначениеСвойстваНаФормеМассив.Добавить(ПредставлениеЭлемента);
			Иначе
				ЗначениеСвойстваНаФормеМассив.Добавить("<!!ЭЛЕМЕНТ НЕ НАЙДЕН!!>");
			КонецЕсли;
		КонецЦикла;
		ЗначениеСвойстваНаФорме = РК.МассивВСтроку(ЗначениеСвойстваНаФормеМассив);
	Иначе
		ЗначениеСвойстваНаФорме = ЗначениеСвойства;
	КонецЕсли;
	
	Если ОписаниеСвойстваЭлемента.Тип="Картинка" Тогда
		СвойствоЭлементаНаФорме.ЗначениеКартинка = ЗначениеСвойстваНаФорме;
	Иначе
		СвойствоЭлементаНаФорме.Значение = ЗначениеСвойстваНаФорме;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПредставлениеЭлемента(Элементы, Элемент)
	
	РК = вмс_РаботаСКоллекциями;

	Имя = Элемент.Имя;
	
	Если Элемент.КлассЭлемента="ПоляДанных" Тогда
		ОтборПоПолномуИмени = Новый Структура("ПолноеИмя");
		ТекущийЭлемент = Элемент;
		Пока ЗначениеЗаполнено(ТекущийЭлемент.Родитель) Цикл
			ОтборПоПолномуИмени.ПолноеИмя = ТекущийЭлемент.Родитель;
			ТекущийЭлемент = РК.НайтиЭлементКоллекции(Элементы, ОтборПоПолномуИмени);
			Имя = ТекущийЭлемент.Имя + "." + Имя;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

Функция ПриИзмененииИмениЭлемента(Форма, знач Элемент)
	
	// обновим имя элемента и его подчиненных элементов на форме
	Контекст = Контекст(Форма);

	Элементы = вмс_НастройкиПолейЗадания1.ПолучитьПодчиненныеЭлементы(Контекст.Настройка, Элемент, Истина);
	Элементы.Добавить(Элемент);
	
	Для Каждого Элемент Из Элементы Цикл
		ЭлементНаФорме = Элемент.ЭлементНаФорме;
		ЭлементНаФорме.ИмяЭлемента = Элемент.Имя;
		ЭлементНаФорме.ПолноеИмяЭлемента = Элемент.ПолноеИмя;
	КонецЦикла;
	
КонецФункции

Функция ПриИзмененииТипаЭлемента(Форма, Элемент)

	ЭлементНаФорме = Элемент.ЭлементНаФорме;
	ЭлементНаФорме.Картинка = Элемент.Картинка;
	
КонецФункции

Функция ОбработчикОтменаИзмененияСвойства(ДополнительныеПараметры) Экспорт

	Форма = ДополнительныеПараметры.Форма;
	СвойствоЭлементаНаФорме = ДополнительныеПараметры.СвойствоЭлементаНаФорме;
	
	Контекст = Контекст(Форма);

	ДополнительныеДанныеСвойстваЭлемента = Контекст.ДополнительныеДанныеСвойствЭлементов[СвойствоЭлементаНаФорме.ПолучитьИдентификатор()];
	
	СвойствоЭлементаНаФорме.Значение = ДополнительныеДанныеСвойстваЭлемента.ЗначениеНаФорме;

КонецФункции

Функция ОбработчикВыбораЗначенияКартинкиСвойства(Картинка, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	ДополнительныеПараметры.Форма = Неопределено;

	Если Картинка=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СвойствоЭлементаНаФорме = ДополнительныеПараметры.СвойствоЭлементаНаФорме;
	УстановитьЗначениеСвойстваЭлемента(Форма, СвойствоЭлементаНаФорме, Картинка);
	
КонецФункции

Функция ОбработчикРедактированияТипаРеквизита(КвазиОписаниеТипов, ДополнительныеПараметры) Экспорт

	Форма = ДополнительныеПараметры.Форма;
	ДополнительныеПараметры.Форма = Неопределено;

	Если КвазиОписаниеТипов=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РК = вмс_РаботаСКоллекциями;
	
	ОписаниеТипов = Новый ОписаниеТипов(РК.МассивВСтроку(КвазиОписаниеТипов.МассивИменТипов));
	
	СвойствоЭлементаНаФорме = ДополнительныеПараметры.СвойствоЭлементаНаФорме;
	СвойствоЭлементаНаФорме.Значение = ОписаниеТипов;
	УстановитьЗначениеСвойстваЭлемента(Форма, СвойствоЭлементаНаФорме, ОписаниеТипов);
	
КонецФункции

Функция СвойстваЭлементов_Значение_НачалоВыбораИзСписка(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Контекст = Контекст(Форма);

	СвойствоЭлементаНаФорме = Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущиеДанные;
	ДополнительныеДанныеСвойстваЭлемента = Контекст.ДополнительныеДанныеСвойствЭлементов[СвойствоЭлементаНаФорме.ПолучитьИдентификатор()];
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СвойствоЭлементаНаФорме", СвойствоЭлементаНаФорме);
	
	ОО = НовыйОписаниеОповещения("СвойстваЭлементов_Значение_ОбработкаВыбораИзСписка", , ДополнительныеПараметры);
	Форма.ПоказатьВыборИзСписка(ОО, ДополнительныеДанныеСвойстваЭлемента.СписокВыбора, Элемент, ДополнительныеДанныеСвойстваЭлемента.Значение);
	
КонецФункции

Функция СвойстваЭлементов_Значение_ОбработкаВыбораИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	СвойствоЭлементаНаФорме = ДополнительныеПараметры.СвойствоЭлементаНаФорме;
	ЗначениеСвойства = ВыбранныйЭлемент.Значение;
	
	УстановитьЗначениеСвойстваЭлемента(Форма, СвойствоЭлементаНаФорме, ЗначениеСвойства)
	
КонецФункции

Функция СвойстваЭлементов_Значение_ОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Контекст = Контекст(Форма);
	
	СписокВыбораНаФорме = Элемент.СписокВыбора;
	СвойствоЭлементаНаФорме = Форма.Элементы.НастройкаПолей_СвойстваЭлементов.ТекущиеДанные;
	ДополнительныеДанныеСвойстваЭлемента = Контекст.ДополнительныеДанныеСвойствЭлементов[СвойствоЭлементаНаФорме.ПолучитьИдентификатор()];
	СписокВыбора = ДополнительныеДанныеСвойстваЭлемента.СписокВыбора;
	
	Если СписокВыбора <> Неопределено Тогда
		ЭлементСпискаВыбораНаФорме = СписокВыбораНаФорме.НайтиПоЗначению(ВыбранноеЗначение);
		ИндексЭлемента = СписокВыбораНаФорме.Индекс(ЭлементСпискаВыбораНаФорме);
		
		ЭлементСпискаВыбора = СписокВыбора.Получить(ИндексЭлемента);
		ЗначениеСвойства = ЭлементСпискаВыбора.Значение;
	Иначе
		ЗначениеСвойства = ВыбранноеЗначение;
	КонецЕсли;
	
	УстановитьЗначениеСвойстваЭлемента(Форма, СвойствоЭлементаНаФорме, ЗначениеСвойства);
	
КонецФункции

Функция Элементы_ПередНачаломДобавления(Форма, ТаблицаФормы, Отказ, Копирование, Родитель, Группа, Параметр) Экспорт
	
	ИмяТаблицыФормы = ТаблицаФормы.Имя;
	
	Если ИмяТаблицыФормы="НастройкаПолей_ЭлементыВывода" Тогда
		ЭлементыВывода_ПередНачаломДобавления(Форма, ТаблицаФормы, Отказ, Копирование, Родитель, Группа, Параметр, Истина);
	ИначеЕсли ИмяТаблицыФормы="НастройкаПолей_ПоляДанных" Тогда
		ПоляДанных_ПередНачаломДобавления(Форма, ТаблицаФормы, Отказ, Копирование, Родитель, Группа, Параметр);
	ИначеЕсли ИмяТаблицыФормы="НастройкаПолей_СборщикиДанных" Тогда
		СборщикиДанных_ПередНачаломДобавления(Форма, ТаблицаФормы, Отказ, Копирование, Родитель, Группа, Параметр);
	КонецЕсли;
	
КонецФункции

Функция ЭлементыВывода_ПередНачаломДобавления(Форма, ТаблицаФормы, Отказ, Копирование, Родитель, Группа, Параметр, ДобавитьВместеСПолемДанных=Ложь)
	
	Отказ = Истина;
	
	СтрокаТекущегоЭлементаВывода = ТаблицаФормы.ТекущиеДанные;
	Если СтрокаТекущегоЭлементаВывода=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаРодителяТекущегоЭлементаВывода = СтрокаТекущегоЭлементаВывода.ПолучитьРодителя();
	
	РодительскиеЭлементы = Новый Массив;
	РодительскиеЭлементы.Добавить(СтрокаТекущегоЭлементаВывода);
	Если СтрокаРодителяТекущегоЭлементаВывода <> Неопределено Тогда
		// для возможности добавления соседнего элемента рядом с текущим
		РодительскиеЭлементы.Добавить(СтрокаРодителяТекущегоЭлементаВывода);
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Родители", РодительскиеЭлементы);
	
	Контекст = Контекст(Форма);
	
	Если ДобавитьВместеСПолемДанных Тогда
		СтраницаВводаДанных = ПолучитьТекущуюСтраницуВводаДанных(Форма);
		Если СтраницаВводаДанных=Неопределено Тогда
			ПоказатьПредупреждение(, "Не указана страница для ввода данных");
			Возврат Ложь;
		КонецЕсли;
		
		ДополнительныеПараметры.Вставить("СтраницаВводаДанных", СтраницаВводаДанных);
		
		ФормаВыбораРеквизитаОбъекта = ОткрытьФорму("ОбщаяФорма.вмс_ФормаВыбораРеквизитаОбъекта", Новый Структура("Объект", Контекст.СКДРеквизитовЗадания), Форма);
		ФормаВыбораРеквизитаОбъекта.ОписаниеОповещенияОЗакрытии = НовыйОписаниеОповещения("ЭлементыВывода_ОбработчикВыбораПоля", , ДополнительныеПараметры);
	Иначе
		ОО = НовыйОписаниеОповещения("ЭлементыВывода_ОбработчикВыбораТипа", , ДополнительныеПараметры);
		СписокВыбораТиповЭлементов = ПолучитьСписокВыбораДоступныхТиповИВидовЭлементовВывода(Форма, РодительскиеЭлементы);
		СписокВыбораТиповЭлементов.ПоказатьВыборЭлемента(ОО, "Тип элемента");
	КонецЕсли;

КонецФункции

Функция ПоляДанных_ПередНачаломДобавления(Форма, ТаблицаФормы, Отказ, Копирование, Родитель, Группа, Параметр)
	
	РК = вмс_РаботаСКоллекциями;
	
	Отказ = Истина;
	
	Контекст = Контекст(Форма);
	
	ПолеДанных = вмс_НастройкиПолейЗадания1.ДобавитьПолеДанных(Контекст.Настройка);
	
	ДобавитьЭлементыНаФорму(Форма, ПолеДанных);
	
	Форма.Модифицированность = Истина;
	
КонецФункции

Функция СборщикиДанных_ПередНачаломДобавления(Форма, ТаблицаФормы, Отказ, Копирование, Родитель, Группа, Параметр)
	
	РК = вмс_РаботаСКоллекциями;
	
	Отказ = Истина;
	
	Контекст = Контекст(Форма);
	
	СборщикДанных = вмс_НастройкиПолейЗадания1.ДобавитьСборщикДанных(Контекст.Настройка);
	
	ДобавитьЭлементыНаФорму(Форма, СборщикДанных);
	
	Форма.Модифицированность = Истина;
	
КонецФункции

Функция ПередЗаписью(Форма, Отказ, ПараметрыЗаписи, НастройкаИБ) Экспорт
	
	Контекст = Контекст(Форма);
	
	вмс_НастройкиПолейЗадания1.СохранитьНастройку(Контекст.Настройка, НастройкаИБ);
	
КонецФункции

Функция ДобавитьЭлементВыводаНаФорме(Форма, знач ТипЭлементаВывода, знач Родитель=Неопределено, знач ИмяЭлемента=Неопределено) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	СведенияОТипеЭлементаВывода = Новый Структура;
	СведенияОТипеЭлементаВывода.Вставить("ТипЭлемента", "");
	СведенияОТипеЭлементаВывода.Вставить("ВидЭлемента", "");
	СведенияОТипеЭлементаВывода.Вставить("ЗначенияСвойствЭлементаПоУмолчанию");
	Если ТипЗнч(ТипЭлементаВывода)=Тип("Строка") Тогда
		ТипИВидЭлементаВывода = РК.СтрокуВМассив(ТипЭлементаВывода);
		Если ТипИВидЭлементаВывода.Количество() >= 1 Тогда
			СведенияОТипеЭлементаВывода.ТипЭлемента = ТипИВидЭлементаВывода[0];
		КонецЕсли;
		Если ТипИВидЭлементаВывода.Количество() >= 2 Тогда
			СведенияОТипеЭлементаВывода.ВидЭлемента = ТипИВидЭлементаВывода[1];
		КонецЕсли;
	Иначе
		ЗаполнитьЗначенияСвойств(СведенияОТипеЭлементаВывода, ТипЭлементаВывода);
	КонецЕсли;
	
	ТипЭлемента = СведенияОТипеЭлементаВывода.ТипЭлемента;
	ВидЭлемента = СведенияОТипеЭлементаВывода.ВидЭлемента;
	ЗначенияСвойствЭлементаПоУмолчанию = СведенияОТипеЭлементаВывода.ЗначенияСвойствЭлементаПоУмолчанию;
	
	Контекст = Контекст(Форма);

	СведенияОТипахЭлементовВывода = Контекст.СведенияОТипахЭлементовВывода;
	
	ПолныеСведенияОТипеЭлементаВывода = вмс_КонструкторФорм.ПолучитьСведенияОТипеЭлементаФормы(СведенияОТипахЭлементовВывода, ТипЭлемента, ВидЭлемента);
	Если ПолныеСведенияОТипеЭлементаВывода=Неопределено Тогда
		ТекстОшибки = "Не известный тип элемента """ + ТипЭлемента;
		Если ЗначениеЗаполнено(ВидЭлемента) Тогда
			ТекстОшибки = ТекстОшибки + " - " + ВидЭлемента;
		КонецЕсли;
		ТекстОшибки = ТекстОшибки + """";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если ЗначенияСвойствЭлементаПоУмолчанию=Неопределено Тогда
		ЗначенияСвойствЭлементаПоУмолчанию = ПолныеСведенияОТипеЭлементаВывода.ЗначенияСвойствЭлементаПоУмолчанию;
	КонецЕсли;
	
	ЭлементыВывода = Контекст.Настройка.ЭлементыВывода;
	
	ЭлементВыводаРодительНаФорме = Неопределено;
	Если Родитель <> Неопределено Тогда
		Если ТипЗнч(Родитель)=Тип("Строка") Тогда
			ЭлементВыводаРодительНаФорме = РК.НайтиЭлементКоллекции(РК.ПолучитьПодчиненныеЭлементыКоллекции(Форма.НастройкаПолей_ЭлементыВывода), Новый Структура("ПолноеИмяЭлемента", ВРЕГ(Родитель)));
			Если ЭлементВыводаРодительНаФорме=Неопределено Тогда
				ВызватьИсключение "Не найден родитель """ + Родитель + """";
			КонецЕсли;
		ИначеЕсли ТипЗнч(Родитель)=Тип("Массив") Тогда
			МассивРодителей = Родитель;
			Для Каждого Родитель Из МассивРодителей Цикл
				ДоступныеТипыЭлементов = вмс_КонструкторФорм.ПолучитьДоступныеТипыИВидыЭлементов(СведенияОТипахЭлементовВывода, ТипЭлемента, Родитель);
				Если ДоступныеТипыЭлементов.Найти(ПолныеСведенияОТипеЭлементаВывода) <> Неопределено Тогда
					ЭлементВыводаРодительНаФорме = Родитель;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ЭлементВыводаРодительНаФорме = Родитель;
		КонецЕсли;
	КонецЕсли;

	Если ЭлементВыводаРодительНаФорме <> Неопределено Тогда
		ИмяРодителя = ЭлементВыводаРодительНаФорме.ПолноеИмяЭлемента;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидЭлемента) Тогда
		СвойствоВид = вмс_КонструкторФорм.ПолучитьСвойствоЭлементаФормы(СведенияОТипахЭлементовВывода, ТипЭлемента, ВидЭлемента, "Вид");
		Если СвойствоВид <> Неопределено Тогда
			ВидЭлемента = Контекст.СведенияОТипахЭлементовВывода.ВидыЭлементовПоЗначениям[СвойствоВид.ЗначениеПоУмолчанию].ВидЭлемента;
		КонецЕсли;
	КонецЕсли;
	
	ЭлементВывода = вмс_НастройкиПолейЗадания1.ДобавитьЭлементВывода(Контекст.Настройка, ТипЭлемента, ВидЭлемента, ИмяРодителя, ИмяЭлемента);
	Для Каждого ЗначениеПоУмолчанию Из ЗначенияСвойствЭлементаПоУмолчанию Цикл
		ЭлементВывода.Свойства.Вставить(ЗначениеПоУмолчанию.Ключ, ЗначениеПоУмолчанию.Значение);
	КонецЦикла;
	ДобавитьЭлементыНаФорму(Форма, ЭлементВывода);

	Форма.Модифицированность = Истина;

	Возврат ЭлементВывода.ЭлементНаФорме;
	
КонецФункции

Функция ЗагрузитьНастройкуНаФорме(Форма, НастройкаИБ) Экспорт
	
	РК = вмс_РаботаСКоллекциями;

	Контекст = Контекст(Форма);
	Настройка = Контекст.Настройка;
	
	ОчиститьНастройкуНаФорме(Форма);
	
	вмс_НастройкиПолейЗадания1.ЗагрузитьНастройку(Настройка, НастройкаИБ);
	Если РК.ПолучитьЭлементыКоллекции(Настройка.ЭлементыВывода).Количество()=0 Тогда
		вмс_НастройкиПолейЗадания1.ДобавитьЭлементВывода(Настройка, "ФормаКлиентскогоПриложения", , , "Форма");
	КонецЕсли;
	
	КлассыЭлементов = РК.ЗначениеВМассив("ЭлементыВывода, ПоляДанных, СборщикиДанных");
	Для Каждого КлассЭлемента Из КлассыЭлементов Цикл
		Элементы = Настройка[КлассЭлемента];
		РК.ДобавитьКолонкуКоллекции(Элементы, "ЭлементНаФорме");
		ДобавитьЭлементыНаФорму(Форма, Элементы);
	КонецЦикла;
	
КонецФункции

Функция ОчиститьНастройкуНаФорме(Форма)

	РК = вмс_РаботаСКоллекциями;
	
	Контекст = Контекст(Форма);

	КлассыЭлементов = РК.ЗначениеВМассив("ЭлементыВывода, ПоляДанных, СборщикиДанных");
	Для Каждого КлассЭлемента Из КлассыЭлементов Цикл
		ДанныеТаблицыФормы = Форма["НастройкаПолей_" + КлассЭлемента];
		ДанныеТаблицыФормы.ПолучитьЭлементы().Очистить();
	КонецЦикла;
	
	РК.ОчиститьЭлементыКоллекции(Контекст.ДополнительныеДанныеСвойствЭлементов);
	
КонецФункции

Функция ДобавитьЭлементыНаФорму(Форма, знач ЭлементыДляДобавления)
	
	РК = вмс_РаботаСКоллекциями;
	
	ЭлементыДляДобавления = РК.ЗначениеВМассив(РК.ПолучитьЭлементыКоллекции(ЭлементыДляДобавления), , Ложь);

	Настройка = Контекст(Форма).Настройка;
	
	ЭлементыКлассовДляДобавления = Новый Структура;
	Для Каждого ЭлементДляДобавления Из ЭлементыДляДобавления Цикл
		ЭлементыКлассаДляДобавления = Неопределено;
		ЭлементыКлассовДляДобавления.Свойство(ЭлементДляДобавления.КлассЭлемента, ЭлементыКлассаДляДобавления);
		Если ЭлементыКлассаДляДобавления=Неопределено Тогда
			ЭлементыКлассаДляДобавления = Новый Массив;
			ЭлементыКлассовДляДобавления.Вставить(ЭлементДляДобавления.КлассЭлемента, ЭлементыКлассаДляДобавления);
		КонецЕсли;
		
		ЭлементыКлассаДляДобавления.Добавить(ЭлементДляДобавления);
	КонецЦикла;
	
	Для Каждого КЗЭлементыКлассаДляДобавления Из ЭлементыКлассовДляДобавления Цикл
		КлассЭлементов = КЗЭлементыКлассаДляДобавления.Ключ;
		ЭлементыКлассаДляДобавления = КЗЭлементыКлассаДляДобавления.Значение;

		ЭлементыНаФорме = Форма["НастройкаПолей_" + КлассЭлементов];
		ТаблицаФормы = Форма.Элементы.Найти("НастройкаПолей_" + КлассЭлементов);
		
		Элементы = Настройка[КлассЭлементов];
		
		УдаляемыеЭлементы = Новый Массив;
		
		ПоискПоПолномуИмени = Новый Структура("ПолноеИмя");
		НовыеЭлементыНаФорме = Новый Массив;
		Для Каждого ЭлементДляДобавления Из ЭлементыКлассаДляДобавления Цикл

			Если КлассЭлементов="ЭлементыВывода" И ЭлементДляДобавления.ПолноеИмя="ФОРМА" Тогда
				ЭлементРодительНаФорме = ЭлементыНаФорме;
			Иначе
				Родитель = ЭлементДляДобавления.Родитель;
				Если Родитель=Неопределено И КлассЭлементов="ЭлементыВывода" Тогда
					Родитель = "ФОРМА";
				КонецЕсли;
				
				Если Родитель=Неопределено Тогда
					ЭлементРодительНаФорме = ЭлементыНаФорме;
				Иначе
					ПоискПоПолномуИмени.ПолноеИмя = Родитель;
					ЭлементРодитель = РК.НайтиЭлементКоллекции(Элементы, ПоискПоПолномуИмени);
					Если ЭлементРодитель <> Неопределено Тогда
						ЭлементРодительНаФорме = ЭлементРодитель.ЭлементНаФорме;
					Иначе
						ЭлементРодительНаФорме = Неопределено;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ЭлементРодительНаФорме=Неопределено Тогда
				УдаляемыеЭлементы.Добавить(ЭлементДляДобавления);
				Продолжить;
			КонецЕсли;
			
			ЭлементНаФорме = ЭлементРодительНаФорме.ПолучитьЭлементы().Добавить();
			
			ЭлементНаФорме.ПолноеИмяЭлемента = ЭлементДляДобавления.ПолноеИмя;
			ЭлементНаФорме.ИмяЭлемента = ЭлементДляДобавления.Имя;
			ЗаполнитьЗначенияСвойств(ЭлементНаФорме, ЭлементДляДобавления);
			ЭлементДляДобавления.ЭлементНаФорме = ЭлементНаФорме;
			
			ПриИзмененииТипаЭлемента(Форма, ЭлементДляДобавления);
			
			НовыеЭлементыНаФорме.Добавить(ЭлементНаФорме);
			
		КонецЦикла;

		РК.УдалитьЭлементыКоллекции(Элементы, УдаляемыеЭлементы);
		
		Если НовыеЭлементыНаФорме.Количество() > 0 Тогда
			ТаблицаФормы.ТекущаяСтрока = НовыеЭлементыНаФорме[0].ПолучитьИдентификатор();
			Для Каждого ЭлементНаФорме Из НовыеЭлементыНаФорме Цикл
				ТаблицаФормы.Развернуть(ЭлементНаФорме.ПолучитьИдентификатор(), Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецФункции

Функция ПриЗакрытии(Форма, ЗавершениеРаботы) Экспорт

	вмс_РаботаСФормамиКлиент.ПриЗакрытии(Форма, ЗавершениеРаботы);
	
КонецФункции

Функция Контекст(Форма) Экспорт
	
	Возврат вмс_РаботаСФормамиКлиент.ПолучитьКлиентскиеПеременные(Форма)["НастройкаПолей_Контекст"];
	
КонецФункции

Функция НовыйКонтекст() Экспорт
	
	Контекст = Новый Структура;
	
	Настройка = вмс_НастройкиПолейЗадания1.НоваяНастройка();
	Настройка.ДополнительныеДанные.ДополнительныеПоляКлючаЭлемента = "ЭлементНаФорме";
	
	Контекст.Вставить("СведенияОТипахЭлементовВывода", Настройка.ДополнительныеДанные.СведенияОТипахЭлементовВывода);
	Контекст.Вставить("СведенияОСвойствахПолейОбработки", Настройка.ДополнительныеДанные.СведенияОСвойствахПолейОбработки);
	Контекст.Вставить("СведенияОСвойствахСборщиковДанных", Настройка.ДополнительныеДанные.СведенияОСвойствахСборщиковДанных);
	Контекст.Вставить("ДополнительныеДанныеСвойствЭлементов", Новый Соответствие); // для хранения данных свойств, которые нельзя разместить в таблице на форме
	Контекст.Вставить("СКДРеквизитовЗадания");
	Контекст.Вставить("Настройка", Настройка);
	
	Возврат Контекст;
	
КонецФункции

Функция ЭлементВыводаФорма(Форма)
	РК = вмс_РаботаСКоллекциями;
	Контекст = Контекст(Форма);
	НастройкаЭлементаВыводаФорма = РК.НайтиЭлементКоллекции(Контекст.Настройка.ЭлементыВывода, Новый Структура("ПолноеИмя", "ФОРМА"));
	Если НастройкаЭлементаВыводаФорма <> Неопределено Тогда
		Возврат НастройкаЭлементаВыводаФорма.ЭлементНаФорме;
	КонецЕсли;
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, знач Модуль=Неопределено, ДополнительныеПараметры=Неопределено, ИмяПроцедурыОбработкиОшибки=Неопределено, МодульОбработкиОшибки=Неопределено)
	
	Если Модуль=Неопределено Тогда
		Модуль = вмс_НастройкиПолейЗаданияКлиент1;
	КонецЕсли;
	
	Если ИмяПроцедурыОбработкиОшибки <> Неопределено Тогда
		Возврат Новый ОписаниеОповещения(ИмяПроцедуры, Модуль, ДополнительныеПараметры, ИмяПроцедурыОбработкиОшибки, МодульОбработкиОшибки);
	Иначе
		Возврат Новый ОписаниеОповещения(ИмяПроцедуры, Модуль, ДополнительныеПараметры);
	КонецЕсли;
	
КонецФункции
