&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьЭлементов();
	
	вмс_РаботаСКоллекциями.УстановитьЭлементыКоллекции(Элементы.ПутьКПринтеру.СписокВыбора, вмс_Печать.ПолучитьСписокПринтеров());
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПринтераПриИзменении(Элемент)
	
	Если Объект.ТипПринтера=ПредопределенноеЗначение("Перечисление.ТипыПринтеров.ЛокальныйПринтер") Тогда
		Объект.ИмяКомпьютера = вмс_ПараметрыПриложения["ИмяКомпьютера"];
	ИначеЕсли Объект.ТипПринтера=ПредопределенноеЗначение("Перечисление.ТипыПринтеров.СерверныйПринтер") Тогда
		Объект.ПутьСервернаяКомпонентаПечати = вмс_ПечатьКлиентСервер.ПолучитьПутьКФайлуКомпонентуСетевойПечатиПоУмолчанию();
	КонецЕсли;
	
	НастроитьВидимостьЭлементов();
	
КонецПроцедуры 

Функция НастроитьВидимостьЭлементов()
	Если Объект.ТипПринтера=ПредопределенноеЗначение("Перечисление.ТипыПринтеров.ЛокальныйПринтер") Тогда
		Элементы.ПутьСервернаяКомпонентаПечати.Видимость = Ложь;
	ИначеЕсли Объект.ТипПринтера=ПредопределенноеЗначение("Перечисление.ТипыПринтеров.СерверныйПринтер") Тогда
		Элементы.ПутьСервернаяКомпонентаПечати.Видимость = Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПутьКПринтеруНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	вмс_РаботаСКоллекциями.УстановитьЭлементыКоллекции(Элемент.СписокВыбора, вмс_Печать.ПолучитьСписокПринтеров());
	
КонецПроцедуры
