
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РК = вмс_РаботаСКоллекциями;

	РежимРаботы = Параметры.РежимРаботы;
	
	Если РежимРаботы = 1 Тогда
		Элементы.Сохранить.Видимость = Истина;
		Элементы.Загрузить.Видимость = Ложь;
		Элементы.ИмяТекущейНастройки.ТолькоПросмотр = Ложь;
	ИначеЕсли РежимРаботы = 2 Тогда
		Элементы.Сохранить.Видимость = Ложь;
		Элементы.Загрузить.Видимость = Истина;
		Элементы.ИмяТекущейНастройки.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ТаблицаНастроек.Очистить();
	
	Если Параметры.СписокНастроек <> Неопределено Тогда
		
		МассивНастроек = РК.ЗначениеВМассив(Параметры.СписокНастроек);
		
		Для Каждого ИмяНастройки Из МассивНастроек Цикл
			РК.ДобавитьЭлементКоллекции(ТаблицаНастроек, Новый Структура("Имя", ИмяНастройки)); 
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ИмяТекущейНастройки = Элемент.ТекущиеДанные.Имя;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикКомандыСохранить(Команда)
	
	Если ЗначениеЗаполнено(ИмяТекущейНастройки) Тогда
		ОповеститьОВыборе(ИмяТекущейНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикКомандыЗагрузить(Команда)
	
	Если ЗначениеЗаполнено(ИмяТекущейНастройки) Тогда
		ОповеститьОВыборе(ИмяТекущейНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если РежимРаботы = 1 ИЛИ РежимРаботы = 2 Тогда

		ОповеститьОВыборе(ИмяТекущейНастройки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры
