#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор 	= Пользователи.ТекущийПользователь();
	Статус 	= Справочники.вмс_СтатусыДокументов.ПолучитьСтатус("Подготовка", "Выборочная инвентаризация");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СтатусыДляБлокировки = ПолучитьМассивСтатусовДляБлокировкиЯчеек();	
	ЯчейкиТаблицы = ПолучитьЯчейкиТаблицыСРазделениемПоНаличиюБлокировки();
	
	Если СтатусыДляБлокировки.Найти(Статус) <> Неопределено Тогда
		Если ЗначениеЗаполнено(ЯчейкиТаблицы.Доступны) Тогда
			ЗаблокироватьЯчейки(ЯчейкиТаблицы.Доступны);
		КонецЕсли;	
	Иначе
		Если ЗначениеЗаполнено(ЯчейкиТаблицы.Заблокированы) Тогда
			РазблокироватьЯчейки();
		КонецЕсли;	
	КонецЕсли;  
	//Кукушкин 04.04.2024 ++ При отмене проведения (либо пометки удаления документа необходимо разблокировать ячейки) 
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		РазблокироватьЯчейки();
	КонецЕсли; 
	//Кукушкин 04.04.2024 --
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ПроверитьОбновитьСтатусДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьОбновитьСтатусДокумента()
	
	СтатусДокумента = ПолучитьПоследнийСтатусДокумента();	
	
	Если Статус <> СтатусДокумента Тогда
		УстановитьСтатусДокумента(Статус);
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПоследнийСтатусДокумента()
	
	СтатусДокумента = Справочники.вмс_СтатусыДокументов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_СтатусыДокументов.Статус.Ссылка КАК Статус,
	|	вмс_СтатусыДокументов.Период КАК Период
	|ИЗ
	|	РегистрСведений.вмс_СтатусыДокументов КАК вмс_СтатусыДокументов
	|ГДЕ
	|	вмс_СтатусыДокументов.Документ = &Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		СтатусДокумента = Результат[0].Статус;
	КонецЕсли;
	
	Возврат СтатусДокумента;	
	
КонецФункции

Функция УстановитьСтатусДокумента(НовыйСтатус) 
	
	МенеджерЗаписи = РегистрыСведений.вмс_СтатусыДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заполнить(Неопределено);
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Документ = Ссылка;
	МенеджерЗаписи.Статус = НовыйСтатус;
	МенеджерЗаписи.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	МенеджерЗаписи.Записать();
	
	ПроверитьОбновитьСтатусДокумента(); 
	
КонецФункции

Функция ПолучитьМассивСтатусовДляБлокировкиЯчеек() 

	НовыйМассив = Новый Массив;
	НовыйМассив.Добавить(Справочники.вмс_СтатусыДокументов.ПолучитьСтатус("В работе", "Выборочная инвентаризация"));
	НовыйМассив.Добавить(Справочники.вмс_СтатусыДокументов.ПолучитьСтатус("Ожидает подтверждения", "Выборочная инвентаризация"));
	Возврат НовыйМассив;
	
КонецФункции 

Функция ПолучитьЯчейкиТаблицыСРазделениемПоНаличиюБлокировки()
	
	ЯчейкиТаблицы = Новый Структура("Доступны, Заблокированы", Новый Массив, Новый Массив);
	
	Для Каждого Строка Из Товары Цикл
		Если ЯчейкиТаблицы.Доступны.Найти(Строка.Ячейка) = Неопределено Тогда
			ЯчейкиТаблицы.Доступны.Добавить(Строка.Ячейка);
		КонецЕсли;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	вмс_ЗаблокированныеЯчейки.Ячейка КАК Ячейка
	               |ИЗ
	               |	РегистрСведений.вмс_ЗаблокированныеЯчейки КАК вмс_ЗаблокированныеЯчейки
	               |ГДЕ
	               |	вмс_ЗаблокированныеЯчейки.Ячейка В(&Ячейки) И вмс_ЗаблокированныеЯчейки.Источник = &Источник";
	Запрос.УстановитьПараметр("Ячейки", ЯчейкиТаблицы.Доступны);
	Запрос.УстановитьПараметр("Источник", Ссылка);
	ЯчейкиТаблицы.Заблокированы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ячейка");
	вмс_РаботаСКоллекциями.ВычестьМассив(ЯчейкиТаблицы.Доступны, ЯчейкиТаблицы.Заблокированы);
	
	Возврат ЯчейкиТаблицы;
	
КонецФункции

Функция ЗаблокироватьЯчейки(Ячейки)
	
	Для Каждого Ячейка Из Ячейки Цикл
		МенеджерЗаписи = РегистрыСведений.вмс_ЗаблокированныеЯчейки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Заполнить(Неопределено);
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			МенеджерЗаписи.Источник = ПолучитьСсылкуНовогоДокумента();
		Иначе
			МенеджерЗаписи.Источник = Ссылка;
		КонецЕсли;

		МенеджерЗаписи.Ячейка = Ячейка;
		МенеджерЗаписи.ВидБлокировки = Перечисления.вмс_ВидыБлокировокЯчеек.Полная;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецФункции  

Функция ПолучитьСсылкуНовогоДокумента()   
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПолучитьСсылкуНового()) Тогда
		УИД = новый УникальныйИдентификатор;
		НоваяСсылка = Документы.вмс_ВыборочнаяИнвентаризация.ПолучитьСсылку(УИД);
		ЭтотОбъект.УстановитьСсылкуНового(НоваяСсылка);   
	КонецЕсли; 
	
	Возврат ЭтотОбъект.ПолучитьСсылкуНового();
	
КонецФункции

Функция РазблокироватьЯчейки()
	
	НаборЗаписей = РегистрыСведений.вмс_ЗаблокированныеЯчейки.СоздатьНаборЗаписей();
	НаборЗаписей.Заполнить(Неопределено);
	НаборЗаписей.Отбор.Источник.Установить(Ссылка);
	НаборЗаписей.Записать();
	
КонецФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
