#Область ОбработчикиСобытийЭлементовШапкиФормы
//3.2.5 - Добавлены отборы по журналу событий

&НаКлиенте
Процедура УровеньСообщенияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(УровеньСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Уровень", УровеньСообщения, ВидСравненияКомпоновкиДанных.Равно);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Уровень");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СеансПользователяПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Сеанс) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Сеанс", Сеанс, ВидСравненияКомпоновкиДанных.Равно);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Сеанс");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаНачала", Период.ДатаНачала, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаОкончания", Период.ДатаОкончания, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаНачала", Период.ДатаНачала, Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаОкончания", Период.ДатаОкончания, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

