
Процедура вмс_ПриПроведенииДокументаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт 
	
	// Кулалаев. 29.06.23: Отключено
	
	//Если Ложь Тогда
	//	//Установка потребности по комплектам
	//	вмс_КомплектованиеТоваровСервер.ЗавестиПотребностиКомплектовИКомплектующих(Источник, Отказ, РежимПроведения); 
	//	
	//	//Установка потребности по распоряжению
	//	вмс_УправлениеРаспоряжениями.ДобавитьПотребностьПоРаспоряжению(Источник, Отказ, РежимПроведения);
	//	
	//КонецЕсли;
	
КонецПроцедуры
