
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент) 
	
	Для каждого Стр ИЗ Объект.Операции Цикл 
		 СтрокаПриИзмененииДанных(Стр);
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	Для каждого Стр ИЗ Объект.Операции Цикл 
		 СтрокаПриИзмененииДанных(Стр);
	КонецЦикла;

КонецПроцедуры


#Область ТЧ_Операции 

&НаКлиенте
Процедура ОперацииКоличествоПриИзменении(Элемент) 
	
	Стр = Элементы.Операции.ТекущиеДанные;
	РассчитатьСуммуПоСтроке(Стр);   
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацииЦенаПриИзменении(Элемент)
	
	Стр = Элементы.Операции.ТекущиеДанные;
	РассчитатьСуммуПоСтроке(Стр);
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацииСуммаПриИзменении(Элемент)  
	
	Стр = Элементы.Операции.ТекущиеДанные;
	Если Стр.Сумма = 0 Или Стр.Количество = 0 Тогда
		Стр.Цена = 0;
	Иначе
		Стр.Цена = Окр(Стр.Сумма / Стр.Количество, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуПоСтроке(Стр)	
	
	//Считаем по модулю, потому что при выбытии контейнера с хранения в движениях отрицательное количество
	Стр.Сумма = Стр.Цена * Макс(-Стр.Количество, Стр.Количество); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацииКонтейнерПриИзменении(Элемент) 
	
	Стр = Элементы.Операции.ТекущиеДанные;
	СтрокаПриИзмененииДанных(Стр);  
	
КонецПроцедуры     

&НаКлиенте
Процедура ОперацииУпаковкаПриИзменении(Элемент)
	
	Стр = Элементы.Операции.ТекущиеДанные;
	СтрокаПриИзмененииДанных(Стр);   
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацииОперацияПриИзменении(Элемент)
	
	Стр = Элементы.Операции.ТекущиеДанные;
	СтрокаПриИзмененииДанных(Стр); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПриИзмененииДанных(Стр)    
	
	ДатаСоВременем = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, Объект.Дата + (ТекущаяДата() - НачалоДня(ТекущаяДата())));
	
	Если НЕ (ЗначениеЗаполнено(Стр.Контейнер) И ТипЗнч(Стр.Контейнер) = Тип("СправочникСсылка.Номенклатура")) Тогда 
		
		Если ЗначениеЗаполнено(Стр.Операция) И ЗначениеЗаполнено(Объект.Контрагент) Тогда
			//ТУ_Кошелев 12.12.24 - адаптация под УНФ
			ЭтоУНФ = вмс_АдаптацияКонфигураций.ЭтоУНФ();
			
			Если ЭтоУНФ Тогда
				ВремяЯвляетсяРабочим = вмс_ОбщегоНазначенияСервер.ДатаВремяРабочее(ДатаСоВременем);
			Иначе
				ВремяЯвляетсяРабочим = вмс_ОбщегоНазначенияСервер.ОпределитьЯвляетсяЛиВремяРабочим(ДатаСоВременем)
									 И вмс_ОбщегоНазначенияСервер.ОпределитьЯвляетсяЛиДеньРабочим(ДатаСоВременем); 
			КонецЕсли;

			КоэффициентИОписание = КоэффициентЦеныСОписанием(Объект.Контрагент, Стр.Операция, ВремяЯвляетсяРабочим); 
			
			Стр.Цена = КоэффициентИОписание.Коэффициент * ОХР_ОтветственноеХранениеСервер.ПолучитьЦенуКонтейнера(Стр.Контейнер, Стр.Операция, Объект.Контрагент, ДатаСоВременем); 
			Описание = Новый ФорматированнаяСтрока(КоэффициентИОписание.Описание, , вмс_ОбщегоНазначенияВызовСервера.ВернутьЦветОсобогоТекстаНаСервере());
			ЭтотОбъект.Элементы.ГруппаНомерДата.ПодчиненныеЭлементы.СообщениеНерабочееВремя.Заголовок = Описание; 
		КонецЕсли;
		
		Стр.Количество = ?(ЗначениеЗаполнено(Стр.Количество), Стр.Количество, 1);  
		
	КонецЕсли;   
	
	РассчитатьСуммуПоСтроке(Стр);   
	
КонецПроцедуры

&НаСервереБезКонтекста                                                                                                               
Функция КоэффициентЦеныСОписанием(Контрагент, Операция, ВремяЯвляетсяРабочим) 
	
	//ТУ_Кошелев 19.10.23 ОХР 
	//Рабочее время, или услуга с видом хранение - коэффициент = 1. 
	ВидДвиженияХранение = (Операция.ВидДвижения = Перечисления.вмс_ВидыДвиженияУслугОтветственногоХранения.Хранение);
	
	Если НЕ ВремяЯвляетсяРабочим Тогда
		Результат = РегистрыСведений.КоэффициентыНерабочегоВремени.КоэффициентНерабочегоВремениСОписанием(Контрагент, Операция.Родитель);
	Иначе
		Результат = Новый Структура;
		Результат.Вставить("Описание", "");
		Результат.Вставить("Коэффициент", 1);
	КонецЕсли; 
	//Если услуга хранения то устанавливаем коэффициент 1, нельзя объединить с предыдущим условием, чтобы не сбросить описание для нерабочего времени
	Если ВидДвиженияХранение Тогда
		Результат.Коэффициент = 1;
	КонецЕсли;

	Возврат Результат;   
	
КонецФункции     

#КонецОбласти

