
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицуСписокТоваров();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСписокТоваров()
	
	УстановитьПривилегированныйРежим(Истина);
	лТекст = "
	|ВЫБРАТЬ
	|	вмс_ТоварыПоклажедателей.Товар КАК Номенклатура
	|ИЗ
	|	РегистрСведений.вмс_ТоварыПоклажедателей КАК вмс_ТоварыПоклажедателей
	|ГДЕ
	|	вмс_ТоварыПоклажедателей.Контрагент = &Контрагент
	|	И вмс_ТоварыПоклажедателей.Организация = &Организация
	|";
	
	лЗапрос = Новый Запрос(лТекст);
	
	// Установка параметров.
	лЗапрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
	лЗапрос.УстановитьПараметр("Организация", Параметры.Организация);
	
	СписокТоваровПоклажедателя.Загрузить(лЗапрос.Выполнить().Выгрузить());	

КонецПроцедуры // ЗаполнитьТаблицуСписокТоваров()

&НаКлиенте
Процедура Перенести(Команда)   
	МассивИдентификаторов = Элементы.СписокТоваровПоклажедателя.ВыделенныеСтроки;
	МассивТоваров = ОбработатьВыделенныеСтроки(МассивИдентификаторов);
	
	Закрыть(МассивТоваров);	
КонецПроцедуры     

&НаКлиенте
Функция ОбработатьВыделенныеСтроки(МассивИдентификаторов)
	
	МассивТоваров = Новый Массив;
	
	Для каждого Идентификатор Из МассивИдентификаторов Цикл	
		МассивТоваров.Добавить(СписокТоваровПоклажедателя.НайтиПоИдентификатору(Идентификатор));
	КонецЦикла;	
	
	Возврат МассивТоваров;

КонецФункции // ОбработатьВыделенныеСтроки()

