
Функция ЗахватитьЛицензию(Лицензия) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("Ошибка", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_Лицензии.Лицензия КАК Лицензия,
	|	вмс_Лицензии.НомерСеанса КАК НомерСеанса,
	|	вмс_Лицензии.НачалоСеанса КАК НачалоСеанса
	|ИЗ
	|	РегистрСведений.вмс_Лицензии КАК вмс_Лицензии
	|ГДЕ
	|	вмс_Лицензии.Лицензия = &Лицензия";
	Запрос.УстановитьПараметр("Лицензия", Лицензия);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат.Ошибка = "Лицензия не обнаружена";
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ТекущийСеанс = ПолучитьТекущийСеансИнформационнойБазы();
	
	Если Не (ТекущийСеанс.НомерСеанса=Выборка.НомерСеанса И ТекущийСеанс.НачалоСеанса=Выборка.НачалоСеанса) Тогда
		Если вмс_ОбщегоНазначенияВызовСервера.СеансСуществует(Выборка.НомерСеанса, Выборка.НачалоСеанса) Тогда
			Результат.Ошибка = "Лицензия занята";
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Лицензия = Выборка.Лицензия;
	Запись.НомерСеанса = ТекущийСеанс.НомерСеанса;
	Запись.НачалоСеанса = ТекущийСеанс.НачалоСеанса;
	Запись.Записать();
	
	Результат.Успешно = Истина;
	Возврат Результат;
	
КонецФункции

Функция ЗахватитьЛицензиюАвтоматически(ИдентификаторКлиента) Экспорт
	
	НачатьТранзакцию();
	
	ТекущийСеанс = ПолучитьТекущийСеансИнформационнойБазы();
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("Ошибка", "");
	Результат.Вставить("Лицензия", "");
	Результат.Вставить("ПубличныйКлюч", "");
	
	ЗапросТекущаяЛицензия = Новый Запрос;
	ЗапросТекущаяЛицензия.Текст =
	"ВЫБРАТЬ
	|	вмс_Лицензии.Лицензия КАК Лицензия,
	|	вмс_Лицензии.ПубличныйКлюч КАК ПубличныйКлюч,
	|	вмс_Лицензии.НомерСеанса КАК НомерСеанса,
	|	вмс_Лицензии.НачалоСеанса КАК НачалоСеанса
	|ИЗ
	|	РегистрСведений.вмс_Лицензии КАК вмс_Лицензии
	|ГДЕ
	|	вмс_Лицензии.ИдентификаторКлиента = &ИдентификаторКлиента";
	
	ЗапросТекущаяЛицензия.УстановитьПараметр("ИдентификаторКлиента", ИдентификаторКлиента);
	
	РезультатЗапроса = ЗапросТекущаяЛицензия.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат.Успешно = Истина;
		Результат.Лицензия = Выборка.Лицензия;
		Результат.ПубличныйКлюч = Выборка.ПубличныйКлюч;
		Возврат Результат;
	КонецЕсли;
	
	ЗапросПустые = Новый Запрос;
	ЗапросПустые.Текст =
	"ВЫБРАТЬ
	|	вмс_Лицензии.Лицензия КАК Лицензия,
	|	вмс_Лицензии.ПубличныйКлюч КАК ПубличныйКлюч,
	|	вмс_Лицензии.НомерСеанса КАК НомерСеанса,
	|	вмс_Лицензии.НачалоСеанса КАК НачалоСеанса
	|ИЗ
	|	РегистрСведений.вмс_Лицензии КАК вмс_Лицензии
	|ГДЕ
	|	вмс_Лицензии.НомерСеанса = &ПустойНомерСеанса
	|	И вмс_Лицензии.НачалоСеанса = &ПустаяДатаНачала";
	
	ЗапросПустые.УстановитьПараметр("ПустойНомерСеанса", 0);
	ЗапросПустые.УстановитьПараметр("ПустаяДатаНачала", Дата(1,1,1));
	
	РезультатЗапроса = ЗапросПустые.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат.Ошибка = "Не найдено ни одной свободной лицензии в системе!";
		Возврат Результат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.вмс_Лицензии");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	Блокировка.Заблокировать(); 
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Лицензия = Выборка.Лицензия;
	Запись.ПубличныйКлюч = Выборка.ПубличныйКлюч;
	Запись.ИдентификаторКлиента = ИдентификаторКлиента;
	Запись.НомерСеанса = ТекущийСеанс.НомерСеанса;
	Запись.НачалоСеанса = ТекущийСеанс.НачалоСеанса;
	Запись.Записать();
	
	Результат.Успешно = Истина;
	Результат.Лицензия = Выборка.Лицензия;
	Результат.ПубличныйКлюч = Выборка.ПубличныйКлюч;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Результат;
	
КонецФункции

Функция ОсвободитьЛицензию(Лицензия, ПубличныйКлюч) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Лицензия = Лицензия;
	Запись.ПубличныйКлюч = ПубличныйКлюч;
	Запись.НомерСеанса = Неопределено;
	Запись.НачалоСеанса = Неопределено;
	Запись.ИдентификаторКлиента = Неопределено;
	Запись.Записать();
		
КонецФункции

Функция ОчиститьУстаревшиеЛицензии() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Сеансы =  ПолучитьСеансыИнформационнойБазы();
	НомераСеансов = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("НомерСеанса, НачалоСеанса");
	
	Для каждого Сеанс Из Сеансы Цикл
		вмс_РаботаСКоллекциями.ДобавитьЭлементКоллекции(НомераСеансов, Сеанс);	
	КонецЦикла;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Для каждого Запись Из НаборЗаписей Цикл
		
		Отбор = Новый Структура("НомерСеанса, НачалоСеанса");
		ЗаполнитьЗначенияСвойств(Отбор, Запись);
		
		НайденныеСтроки = НомераСеансов.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Запись.НомерСеанса = Неопределено;
			Запись.НачалоСеанса = Неопределено;
			Запись.ИдентификаторКлиента = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецФункции

