#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
Функция СкопироватьЭлементФормы(знач ПанельПриемник, ЭлементШаблон) Экспорт
	
	ФормаЭлемента = вмс_РаботаСФормамиКлиентСервер.ПолучитьФормуЭлемента(ПанельПриемник);
	ИмяНовогоЭлемента = вмс_РаботаСФормамиКлиентСервер.ПолучитьНовоеИмяЭлементаФормы(ФормаЭлемента, ЭлементШаблон.Имя);
	ТипЭлемента = ЭлементШаблон.ТипЭлемента;
	НовыйЭлемент = ФормаЭлемента.Элементы.Добавить(ИмяНовогоЭлемента, ТипЭлемента, ПанельПриемник);
	вмс_РаботаСФормамиКлиентСервер.СкопироватьСвойстваЭлементаФормы(НовыйЭлемент, ЭлементШаблон);
	Возврат НовыйЭлемент;
	
КонецФункции

Функция ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецФункции

Функция ПриОткрытииФормы(Форма, Отказ, ДанныеПриОткрытииНаСервере=Неопределено) Экспорт
КонецФункции

Функция ДобавитьРеквизитФормыТаблица(Форма, ИмяТаблицы, Колонки) Экспорт

	Перем РК;
	
	РК = вмс_РаботаСКоллекциями;
	
	НовыеРеквизиты = Новый Массив;
	НовыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
	
	МассивКолонок = РК.ЗначениеВМассив(Колонки);
	
	Для Каждого Колонка Из МассивКолонок Цикл
		НовыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка, Новый ОписаниеТипов, ИмяТаблицы));
	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);
	
	Возврат Форма[ИмяТаблицы];
	
КонецФункции

Функция ДобавитьРеквизитыФормы(Форма, знач Реквизиты, Путь=Неопределено) Экспорт

	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Реквизиты = Новый Структура(Реквизиты);
	ИначеЕсли  ТипЗнч(Реквизиты) = Тип("Массив") Тогда
		МассивИмен = Реквизиты;
		Реквизиты = Новый Структура;
		Для Каждого Имя Из МассивИмен Цикл
			Реквизиты.Вставить(Имя);
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(Реквизиты) <> Тип("Структура") ИЛИ Реквизиты.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НовыеРеквизиты = Новый Массив;
	Для Каждого Реквизит Из Реквизиты Цикл
		ОписаниеТиповРеквизита = Реквизит.Значение;
		Если ОписаниеТиповРеквизита = Неопределено ИЛИ ТипЗнч(ОписаниеТиповРеквизита) = Тип("Строка") ИЛИ ТипЗнч(ОписаниеТиповРеквизита) = Тип("Массив") Тогда
			ОписаниеТиповРеквизита = Новый ОписаниеТипов(ОписаниеТиповРеквизита);
		КонецЕсли;
		
		ИмяРеквизита = Реквизит.Ключ;
		НовыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита, ОписаниеТиповРеквизита, Путь));
	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);

КонецФункции

Функция СоздатьТаблицуФормы(Форма, ИмяТаблицы, знач Колонки) Экспорт

	ТаблицаКолонок = Новый ТаблицаЗначений;
	ТаблицаКолонок.Колонки.Добавить("Имя");
	ТаблицаКолонок.Колонки.Добавить("Тип");
	
	Если ТипЗнч(Колонки) = Тип("Строка") Тогда
		Колонки = вмс_РаботаСКоллекциями.СтрокуВМассив(Колонки);
	КонецЕсли;
	
	Если ТипЗнч(Колонки) = Тип("Массив") Тогда
		Для Каждого Колонка Из Колонки Цикл
			СтрокаКолонки = ТаблицаКолонок.Добавить();
			СтрокаКолонки.Имя = Колонка;
			СтрокаКолонки.Тип = Новый ОписаниеТипов;
		КонецЦикла;
	КонецЕсли;
	
	НовыеРеквизиты = Новый Массив;
	НовыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
	
	Для Каждого СтрокаКолонки Из ТаблицаКолонок Цикл
		НовыеРеквизиты.Добавить(Новый РеквизитФормы(СтрокаКолонки.Имя, СтрокаКолонки.Тип, ИмяТаблицы));
	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);
		
КонецФункции

Функция НайтиРеквизит(Форма, ПолноеИмяРеквизита) Экспорт
	
	ИмяРеквизита = "";
	ПутьРеквизита = "";
	ПолучитьИмяИПутьРеквизита(ПолноеИмяРеквизита, ИмяРеквизита, ПутьРеквизита);
	
	МассивРеквизитов = Форма.ПолучитьРеквизиты(ПутьРеквизита);
	РеквизитФормы = вмс_РаботаСКоллекциями.НайтиЭлементКоллекции(МассивРеквизитов, Новый Структура("Имя", ИмяРеквизита));
	Возврат РеквизитФормы;
	
КонецФункции

Функция ПолучитьИмяИПутьРеквизита(ПолноеИмяРеквизита, ИмяРеквизита, ПутьРеквизита) Экспорт

	ПолноеИмяРеквизитаМассив = вмс_РаботаСКоллекциями.ЗначениеВМассив(ПолноеИмяРеквизита, ".");

	Если ПолноеИмяРеквизитаМассив.Количество() > 0 Тогда
		ИмяРеквизита = ПолноеИмяРеквизитаМассив[ПолноеИмяРеквизитаМассив.ВГраница()];
		ПолноеИмяРеквизитаМассив.Удалить(ПолноеИмяРеквизитаМассив.ВГраница());
	Иначе
		ИмяРеквизита = Неопределено;
	КонецЕсли;
	
	ПутьРеквизита = вмс_РаботаСКоллекциями.МассивВСтроку(ПолноеИмяРеквизитаМассив, ".");
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////////////////
//
//						Клавиатурная панель через горячие клавиши+
//

Функция КлавиатурнаяПанель_УпорядочитьКнопки(Форма, КлавиатурнаяПанель) Экспорт
	
	МассивКнопки = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(КлавиатурнаяПанель.Кнопки, "Значение");
	вмс_РаботаСКоллекциями.СортироватьКоллекцию(МассивКнопки, "Шифт УБЫВ, Номер");
	
	КнопкиСтраниц = Новый Соответствие;
	Для Каждого ДанныеКнопки Из МассивКнопки Цикл
		КнопкиСтраниц[ДанныеКнопки.ИмяСтраницы] = ДанныеКнопки;
	КонецЦикла;
	
	ПанельКлавиатуры = Форма.Элементы.Найти(КлавиатурнаяПанель.ИмяПанели);
	СтраницыПанели = ПанельКлавиатуры.ПодчиненныеЭлементы;
	НомерКнопки = 1;
	Для Каждого ДанныеКнопки Из МассивКнопки Цикл
		СтраницаКнопки = Форма.Элементы.Найти(ДанныеКнопки.ИмяСтраницы);
		ТекущийНомер = СтраницыПанели.Индекс(СтраницаКнопки);
		Если ТекущийНомер <> НомерКнопки Тогда
			НоваяСтраница = СтраницыПанели[НомерКнопки];
			Кнопка = Форма.Элементы.Найти(ДанныеКнопки.ИмяКнопки);
			Форма.Элементы.Переместить(Кнопка, НоваяСтраница);
			ДанныеКнопки.ИмяСтраницы = НоваяСтраница.Имя;
			ДанныеКнопки.Номер = НомерКнопки;
		КонецЕсли;
		НомерКнопки = НомерКнопки + 1;
	КонецЦикла;
	
КонецФункции

Функция КлавиатурнаяПанель_ДобавитьКнопкиИКоманды(Форма, КлавиатурнаяПанель, НовыеКнопки) Экспорт
	
	ПанельКлавиатуры = Форма.Элементы.Найти(КлавиатурнаяПанель.ИмяПанели);
	Если ПанельКлавиатуры = Неопределено Тогда
		ГруппаРазмещения = Форма.Элементы.Найти(КлавиатурнаяПанель.ИмяГруппыРазмещения);
		Если ГруппаРазмещения = Неопределено И КлавиатурнаяПанель.Скрывать Тогда
			КлавиатурнаяПанель_НастроитьСтруктуруЭлементовФормы(Форма, КлавиатурнаяПанель);
			ГруппаРазмещения = Форма.Элементы.Найти(КлавиатурнаяПанель.ИмяГруппыРазмещения);
		КонецЕсли;
		
		ИмяПанели = вмс_РаботаСКоллекциями.ПолучитьИмяНовогоЭлементаКоллекции("ПанельКнопокВводШтрихкода", Форма.Элементы);
		ПанельКлавиатуры = Форма.Элементы.Добавить(ИмяПанели, Тип("ГруппаФормы"), ГруппаРазмещения);
		ПанельКлавиатуры.Вид = ВидГруппыФормы.Страницы;
		Если КлавиатурнаяПанель.Скрывать Тогда
			ПанельКлавиатуры.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		КонецЕсли;
		КлавиатурнаяПанель.ИмяПанели = ИмяПанели;
		
		ИмяСтраницыПанелиРазмещения = вмс_РаботаСКоллекциями.ПолучитьИмяНовогоЭлементаКоллекции("СтраницаКнопокВводШтрихкода", Форма.Элементы);
		СтраницаПанелиРазмещения = Форма.Элементы.Добавить(ИмяСтраницыПанелиРазмещения, Тип("ГруппаФормы"), ПанельКлавиатуры);
		СтраницаПанелиРазмещения.Вид = ВидГруппыФормы.Страница;
		
		ИмяКнопки = вмс_РаботаСКоллекциями.ПолучитьИмяНовогоЭлементаКоллекции("КнопкаВводСимволаКлавиатурыПоГорячейКлавишеБутафорскаяКнопка", Форма.Элементы);
		Кнопка = Форма.Элементы.Добавить(ИмяКнопки, Тип("ДекорацияФормы"), СтраницаПанелиРазмещения);
	КонецЕсли;
	
	Если ТипЗнч(НовыеКнопки) = Тип("Массив") Тогда
		МассивКнопок = НовыеКнопки;
	ИначеЕсли ТипЗнч(НовыеКнопки) = Тип("Строка") Тогда
		МассивКнопок = вмс_РаботаСКоллекциями.СтрокуВМассивПосимвольно(НовыеКнопки);
	Иначе
		МассивКнопок = Новый Массив;
		МассивКнопок.Добавить(НовыеКнопки);
	КонецЕсли; 
	
	ШифтСоответствиеСимволов = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ШифтСоответствиеСимволов();
	ШифтСоответствиеСимволовОбратное = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ШифтСоответствиеСимволовОбратное();
	
	Буквы = "QWERTYUIOPASDFGHJKLZXCVBNMqwertyuiopasdfghjklzxcvbnm";
	
	Для Каждого ЗначениеКнопки Из МассивКнопок Цикл
		Если ТипЗнч(ЗначениеКнопки) = Тип("Число") Тогда
			КодСимволаКнопки = ЗначениеКнопки;
			СимволКнопки = Символ(ЗначениеКнопки);
		Иначе
			КодСимволаКнопки = КодСимвола(ЗначениеКнопки);
			СимволКнопки = ЗначениеКнопки;
		КонецЕсли;
		
		Если КлавиатурнаяПанель.СимволыКнопок[КодСимволаКнопки] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКоманды = вмс_РаботаСКоллекциями.ПолучитьИмяНовогоЭлементаКоллекции("КомандаВводСимволаШтрихкодаПоГорячейКлавише", Форма.Команды);
		Команда = Форма.Команды.Добавить(ИмяКоманды);
		Команда.Действие = "Подключаемый_ВыполнитьКоманду";
		
		ЭтоБуква = Найти(Буквы, СимволКнопки) > 0;
		КодСимвола = КодСимволаКнопки;
		Если ЭтоБуква Тогда
			СимволКнопкиШифт = ШифтСоответствиеСимволов[СимволКнопки];
			Если СимволКнопкиШифт <> Неопределено Тогда
				КодСимвола = КодСимвола(СимволКнопкиШифт);
				Шифт = Ложь;
			Иначе
				Шифт = Истина;
			КонецЕсли;
		Иначе
			СимволКнопкиШифт = ШифтСоответствиеСимволовОбратное[СимволКнопки];
			Если СимволКнопкиШифт <> Неопределено Тогда
				КодСимвола = КодСимвола(СимволКнопкиШифт);
				Шифт = Истина;
			Иначе
				Шифт = Ложь;
			КонецЕсли; 
		КонецЕсли;
		
		Команда.СочетаниеКлавиш = вмс_ОбщегоНазначенияКлиентСервер.НовыйСочетаниеКлавиш(КодСимвола, , , Шифт);
		
		Если КодСимволаКнопки = 13 Тогда
			Заголовок = "↓";
		ИначеЕсли КодСимволаКнопки = 8 Тогда
			Заголовок = "←";
		Иначе
			Заголовок = СимволКнопки;
		КонецЕсли;
		Команда.Заголовок = Заголовок;

		ИмяСтраницыПанелиРазмещения = вмс_РаботаСКоллекциями.ПолучитьИмяНовогоЭлементаКоллекции("СтраницаКнопокВводШтрихкода", Форма.Элементы);
		СтраницаПанелиРазмещения = Форма.Элементы.Добавить(ИмяСтраницыПанелиРазмещения, Тип("ГруппаФормы"), ПанельКлавиатуры);
		СтраницаПанелиРазмещения.Вид = ВидГруппыФормы.Страница;
		
		ИмяКнопки = вмс_РаботаСКоллекциями.ПолучитьИмяНовогоЭлементаКоллекции("КнопкаВводСимволаКлавиатурыПоГорячейКлавише", Форма.Элементы);
		Кнопка = Форма.Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), СтраницаПанелиРазмещения);
		Кнопка.ИмяКоманды = ИмяКоманды;
		
		ДанныеКоманды = Новый Структура;
		ДанныеКоманды.Вставить("ИмяСтраницы", ИмяСтраницыПанелиРазмещения);
		ДанныеКоманды.Вставить("ИмяКоманды", ИмяКоманды);
		ДанныеКоманды.Вставить("ИмяКнопки", ИмяКнопки);
		ДанныеКоманды.Вставить("СимволКнопки", ""); //не все символы можно повертать до клиента, поэтому символы на сервере заполнять не будем, заполним опосля на клиенте
		ДанныеКоманды.Вставить("Заголовок", Заголовок);
		ДанныеКоманды.Вставить("КодСимволаКнопки", КодСимволаКнопки);
		ДанныеКоманды.Вставить("Шифт", Шифт);
		ДанныеКоманды.Вставить("Номер", КлавиатурнаяПанель.Кнопки.Количество()+1);
		
		КлавиатурнаяПанель.СимволыКнопок[КодСимволаКнопки] = ДанныеКоманды;
		КлавиатурнаяПанель.Кнопки[ИмяКоманды] = ДанныеКоманды;
	КонецЦикла;
	
	//отсортировать
	КлавиатурнаяПанель_УпорядочитьКнопки(Форма, КлавиатурнаяПанель);
	
КонецФункции

Функция КлавиатурнаяПанель_НастроитьСтруктуруЭлементовФормы(Форма, КлавиатурнаяПанель)
	// Будет создана панель, на одной странице будут размещены все элементы формы,
	// а на другой скрытой странице будет находится клавиатурная панель
	ИмяПанели = вмс_РаботаСКоллекциями.ПолучитьИмяНовогоЭлементаКоллекции("ВсеПанель", Форма.Элементы);
	ВсеПанель = Форма.Элементы.Добавить(ИмяПанели, Тип("ГруппаФормы"));
	ВсеПанель.Вид = ВидГруппыФормы.Страницы;
	ВсеПанель.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	ИмяСтраницыВидимой = вмс_РаботаСКоллекциями.ПолучитьИмяНовогоЭлементаКоллекции("ВсеПанельСтраницаВидимая", Форма.Элементы);
	СтраницаВидимая = Форма.Элементы.Добавить(ИмяСтраницыВидимой, Тип("ГруппаФормы"), ВсеПанель);
	СтраницаВидимая.Вид = ВидГруппыФормы.Страница;
	СтраницаВидимая.ОтображатьЗаголовок = Ложь;
	
	ИмяСтраницыНевидимой = вмс_РаботаСКоллекциями.ПолучитьИмяНовогоЭлементаКоллекции("ВсеПанельСтраницаНевидимая", Форма.Элементы);
	СтраницаНевидимая = Форма.Элементы.Добавить(ИмяСтраницыНевидимой, Тип("ГруппаФормы"), ВсеПанель);
	СтраницаНевидимая.Вид = ВидГруппыФормы.Страница;
	СтраницаНевидимая.ОтображатьЗаголовок = Ложь;
	
	Для Каждого Элемент Из Форма.Элементы Цикл
		Если Элемент.Родитель = Форма Тогда
			Форма.Элементы.Переместить(Элемент, СтраницаВидимая);
		КонецЕсли;
	КонецЦикла;
	
	КлавиатурнаяПанель.ИмяГруппыРазмещения = ИмяСтраницыНевидимой;
	КлавиатурнаяПанель.СобственнаяГруппаРазмещения = Истина;
КонецФункции

Функция КлавиатурнаяПанель_УдалитьГруппуРазмещения(Форма, КлавиатурнаяПанель)
	
	ИмяСтраницыНевидимой = КлавиатурнаяПанель.ИмяГруппыРазмещения;
	СтраницаНевидимая = Форма.Элементы.Найти(ИмяСтраницыНевидимой);
	ВсеПанель = СтраницаНевидимая.Родитель;
	СтраницаВидимая = ВсеПанель.ПодчиненныеЭлементы[0];
	
	Для Каждого Элемент Из СтраницаВидимая.ПодчиненныеЭлементы Цикл
		Форма.Элементы.Переместить(Элемент, Форма);
	КонецЦикла;
	
	Форма.Элементы.Удалить(ВсеПанель);
	
	КлавиатурнаяПанель.ИмяГруппыРазмещения = Неопределено;
	КлавиатурнаяПанель.СобственнаяГруппаРазмещения = Ложь;
	
КонецФункции

Функция КлавиатурнаяПанель_ОтломатьКнопки(Форма, КлавиатурнаяПанель) Экспорт
	
	Для Каждого ЭлементДанныеКнопки Из КлавиатурнаяПанель.Кнопки Цикл
		ДанныеКнопки = ЭлементДанныеКнопки.Значение;
		Элемент = Форма.Элементы.Найти(ДанныеКнопки.ИмяКнопки);
		Если Элемент <> Неопределено Тогда
			Форма.Элементы.Удалить(Элемент);
		КонецЕсли;
		Команда = Форма.Команды.Найти(ДанныеКнопки.ИмяКоманды);
		Если Команда <> Неопределено Тогда
			Форма.Команды.Удалить(Команда);
		КонецЕсли;
	КонецЦикла;
	
	Элемент = Форма.Элементы.Найти(КлавиатурнаяПанель.ИмяПанели);
	Если Элемент <> Неопределено Тогда
		Форма.Элементы.Удалить(Элемент);
	КонецЕсли;
	
КонецФункции

Функция КлавиатурнаяПанель_Поломать(Форма, КлавиатурнаяПанель) Экспорт
	КлавиатурнаяПанель_ОтломатьКнопки(Форма, КлавиатурнаяПанель);
	Если КлавиатурнаяПанель.СобственнаяГруппаРазмещения Тогда
		КлавиатурнаяПанель_УдалитьГруппуРазмещения(Форма, КлавиатурнаяПанель);
	КонецЕсли;
КонецФункции

//
//						Клавиатурная панель через горячие клавиши-
//
/////////////////////////////////////////////////////////////////////////////////////////////////////

Функция КвазиРеквизиты_ПолучитьТаблицуРеквизитов(СписокРеквизитов)

	ТаблицаРеквизитов = вмс_РаботаСКоллекциями.ЗначениеВТаблицуЗначений(СписокРеквизитов, "Имя");
	Если ТаблицаРеквизитов.Колонки.Найти("Имя") = Неопределено Тогда
		ТаблицаРеквизитов.Колонки.Добавить("Имя");
	КонецЕсли;
	
	Если ТаблицаРеквизитов.Колонки.Найти("Тип") = Неопределено Тогда
		ТаблицаРеквизитов.Колонки.Добавить("Тип");
	КонецЕсли;
	
	Возврат ТаблицаРеквизитов;
	
КонецФункции

Функция КвазиРеквизиты_ПриЧтенииНаСервере(Форма, ТекущийОбъект, СписокРеквизитов) Экспорт
	
	ТаблицаРеквизитов = КвазиРеквизиты_ПолучитьТаблицуРеквизитов(СписокРеквизитов);
	ИнициализированныеТаблицы = Новый Соответствие;
	
	Для Каждого СтрокаРеквизита Из ТаблицаРеквизитов Цикл
		Реквизит = СтрокаРеквизита.Имя;
		Если Не ЗначениеЗаполнено(Реквизит) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьРеквизита = вмс_РаботаСКоллекциями.ЗначениеВМассив(Реквизит, ".");
		Если ПутьРеквизита.Количество() = 2 Тогда
			ИмяТаблицы = ПутьРеквизита[0];
			Реквизит = ПутьРеквизита[1];
			ТаблицаИсточник = ТекущийОбъект[ИмяТаблицы];
			ТаблицаПриемник = Форма[ИмяТаблицы];
			Если ИнициализированныеТаблицы[ИмяТаблицы] <> Истина Тогда
				ТаблицаПриемник.Очистить();
				Для Каждого СтрокаИсточник Из ТаблицаИсточник Цикл
					СтрокаПриемник = ТаблицаПриемник.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник);
				КонецЦикла;
				ИнициализированныеТаблицы[ИмяТаблицы] = Истина;
			КонецЕсли;
			
			Для НомерСтроки=1 По ТаблицаИсточник.Количество() Цикл
				СтрокаИсточник = ТаблицаИсточник[НомерСтроки-1];
				СтрокаПриемник = ТаблицаПриемник[НомерСтроки-1];
				СтрокаПриемник[Реквизит] = КвазиРеквизиты_ПрочитатьЗначениеРеквизита(СтрокаИсточник[Реквизит]);
			КонецЦикла;
		Иначе
			Форма[Реквизит] = КвазиРеквизиты_ПрочитатьЗначениеРеквизита(ТекущийОбъект[Реквизит]);
		КонецЕсли;
		
	КонецЦикла;
	
	КвазиРеквизиты_ОбновитьЭлементыНаСервере(Форма, СписокРеквизитов);
	
	Возврат Истина;
	
КонецФункции

Функция КвазиРеквизиты_ПрочитатьЗначениеРеквизита(Значение)
	
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.КвазиСсылки") Тогда
		Возврат вмс_Обмен_с_КИС_ВызовСервера.ПолучитьСсылкуИзКвазиСсылки(Значение);
	Иначе
		Возврат Значение;
	КонецЕсли;

КонецФункции

Функция КвазиРеквизиты_ЗаписатьЗначениеРеквизита(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	Если вмс_ОбщегоНазначенияВызовСервера.ЭтоТипСсылкиОбъектаИБ(ТипЗначения) И Не ТипЗначения = Тип("СправочникСсылка.КвазиСсылки") Тогда
		Возврат вмс_Обмен_с_КИС_ВызовСервера.ПолучитьКвазиСсылкуИБИзСсылки(Значение);
	Иначе
		Возврат Значение;
	КонецЕсли;

КонецФункции

Функция КвазиРеквизиты_ОбновитьЭлементыНаСервере(Форма, СписокРеквизитов) Экспорт
	
	ТаблицаРеквизитов = КвазиРеквизиты_ПолучитьТаблицуРеквизитов(СписокРеквизитов);
	
	Для Каждого Элемент Из Форма.Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") И Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
			НайденныеСтрокиРеквизита = ТаблицаРеквизитов.НайтиСтроки(Новый Структура("Имя", Элемент.ПутьКДанным));
			Если НайденныеСтрокиРеквизита.Количество() > 0 Тогда
				СтрокаРеквизита = НайденныеСтрокиРеквизита[0];
				Элемент.ОграничениеТипа = вмс_ОбщегоНазначенияВызовСервера.ПолучитьОписаниеТипов(СтрокаРеквизита.Тип);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция КвазиРеквизиты_ПередЗаписьюНаСервере(Форма, ТекущийОбъект, СписокРеквизитов) Экспорт
	
	ТаблицаРеквизитов = КвазиРеквизиты_ПолучитьТаблицуРеквизитов(СписокРеквизитов);
	ИнициализированныеТаблицы = Новый Соответствие;
	
	Для Каждого СтрокаРеквизита Из ТаблицаРеквизитов Цикл
		Реквизит = СтрокаРеквизита.Имя;
		Если Не ЗначениеЗаполнено(Реквизит) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьРеквизита = вмс_РаботаСКоллекциями.ЗначениеВМассив(Реквизит, ".");
		Если ПутьРеквизита.Количество() = 2 Тогда
			ИмяТаблицы = ПутьРеквизита[0];
			Реквизит = ПутьРеквизита[1];
			ТаблицаИсточник = Форма[ИмяТаблицы];
			ТаблицаПриемник = ТекущийОбъект[ИмяТаблицы];
			Если ИнициализированныеТаблицы[ИмяТаблицы] <> Истина Тогда
				ТаблицаПриемник.Очистить();
				Для Каждого СтрокаИсточник Из ТаблицаИсточник Цикл
					СтрокаПриемник = ТаблицаПриемник.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник);
				КонецЦикла;
				ИнициализированныеТаблицы[ИмяТаблицы] = Истина;
			КонецЕсли;
			
			Для НомерСтроки=1 По ТаблицаИсточник.Количество() Цикл
				СтрокаИсточник = ТаблицаИсточник[НомерСтроки-1];
				СтрокаПриемник = ТаблицаПриемник[НомерСтроки-1];
				СтрокаПриемник[Реквизит] = КвазиРеквизиты_ЗаписатьЗначениеРеквизита(СтрокаИсточник[Реквизит]);
			КонецЦикла;
		Иначе
			ТекущийОбъект[Реквизит] = КвазиРеквизиты_ЗаписатьЗначениеРеквизита(Форма[Реквизит]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

#КонецЕсли
