
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ВременноеХранилищеДокументов = Новый Структура;
	ВременноеХранилищеДокументовНовый = Новый Структура;
	Сегодня = ТекущаяДата();
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = НачалоМесяца(Сегодня);
	Период.ДатаОкончания = КонецМесяца(Сегодня); 
	ТаблицаСводныхДанныхОпераций.Очистить();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
	Автообновление = Истина;
	ЧастотаАвтообновления = 30;
	Если Объект.КоличествоСтолбцов=0 Тогда
		Объект.КоличествоСтолбцов = 1;
	КонецЕсли;
	ПодключитьОбработчикОжидания("Автообновление", 10, Истина);
КонецПроцедуры                                                 

&НаКлиенте
Процедура ОперацииОперацияПриИзменении(Элемент) 
	Элементы.Операции.ТекущиеДанные.Представление = СтрЗаменить(Элементы.Операции.ТекущиеДанные.Операция, " ", "");
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьМониторПоОперациям();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьМониторПоОперациям();
	ЗаполнитьДанныеДиаграммы();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьДанныеДиаграммы()
	
	ДанныеОперцииДиаграмма.Очистить();
	ДанныеОперцииДиаграмма.АвтоТранспонирование = Ложь;
	ДанныеОперцииДиаграмма.Обновление = Ложь; 
	
	ДанныеОперцииДиаграмма.Серии.Добавить("К обработке");
	ДанныеОперцииДиаграмма.Серии[0].Цвет = WebЦвета.СветлоКоралловый;
	ДанныеОперцииДиаграмма.Серии.Добавить("В работе");
	ДанныеОперцииДиаграмма.Серии[1].Цвет = WebЦвета.СветлоЖелтый;
	ДанныеОперцииДиаграмма.Серии.Добавить("Завершено");
	ДанныеОперцииДиаграмма.Серии[2].Цвет = WebЦвета.СветлоЗеленый;

	
	Для Каждого ТекСтрока Из ТаблицаСводныхДанныхОпераций Цикл
		Точка = ДанныеОперцииДиаграмма.УстановитьТочку(ТекСтрока.Операция);
		
		ДанныеОперцииДиаграмма.УстановитьЗначение(Точка
		, ДанныеОперцииДиаграмма.Серии[0]
		, ТекСтрока.КОбработке
		, Неопределено
		, "КОбработке");
		ДанныеОперцииДиаграмма.УстановитьЗначение(Точка
		, ДанныеОперцииДиаграмма.Серии[1]
		, ТекСтрока.ВРаботе
		, Неопределено
		, "ВРаботе");
		ДанныеОперцииДиаграмма.УстановитьЗначение(Точка
		, ДанныеОперцииДиаграмма.Серии[2]
		, ТекСтрока.Завершена
		, Неопределено
		, "Завершена");

	КонецЦикла;
	
	ДанныеОперцииДиаграмма.АвтоТранспонирование 	= Истина;
	ДанныеОперцииДиаграмма.Обновление		= Истина;
	
КонецПроцедуры


&НаСервере
Функция ЗаполнитьМониторПоОперациям()  
	
	ТаблицаСводныхДанныхОпераций.Очистить();
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты = Новый Массив;
	Этапы = Новый Структура;
	Этапы.Вставить("КОбработке", "К обработке");
	Этапы.Вставить("ВРаботе", "В работе");
	Этапы.Вставить("Завершена", "Завершена");
		
	Для каждого КоллекцияДанных Из Объект.Операции Цикл
		
		Префикс = СтрЗаменить(КоллекцияДанных.Операция," ", "");
		
		Для каждого Этап Из Этапы Цикл
			
			ИскомыйРеквизит = Неопределено;
			Попытка
				ИскомыйРеквизит = ЭтотОбъект[Префикс + "Колонка" + Этап.Ключ];
				ЕстьРеквизит = Истина;
			Исключение
				ЕстьРеквизит = Ложь;
			КонецПопытки;  
			
			Если ЕстьРеквизит = Ложь Тогда
				Реквизит_ = Новый РеквизитФормы(Префикс + "Колонка" + Этап.Ключ,	Новый ОписаниеТипов("ТабличныйДокумент"), 	, Этап.Значение);
				ДобавляемыеРеквизиты.Добавить(Реквизит_);
				нСтрока = КолонкиДляОпераций.Добавить();
				нСтрока.Операция = КоллекцияДанных.Операция;
				нСтрока.Колонка = Реквизит_.Имя;
				нСтрока.Этап = Этап.Ключ;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Элементы.ГруппаШаблон.Видимость = Истина;
	
	//3.2.5
	Если НЕ СписокОперацийЗаполнен Тогда
		
		СписокОперацийЗаполнен = Истина;
		
		Для каждого ЗначениеИзСписка Из НовыеГруппыФормы Цикл
			
			ИмяДляПоиска = СтрЗаменить(ЗначениеИзСписка.Значение, "ГруппаШаблон", "");
			
			Если Объект.Операции.НайтиСтроки(Новый Структура("Представление", ИмяДляПоиска)).Количество() = 0  Тогда
				Элементы.Удалить(Элементы[ЗначениеИзСписка.Значение]);
				НовыеГруппыФормы.Удалить(ЗначениеИзСписка);
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого КоллекцияДанных Из Объект.Операции Цикл
			Элементы.ГруппаШаблон.Заголовок = Строка(КоллекцияДанных.Операция);
			
			Если Элементы.Найти(СтрЗаменить(КоллекцияДанных.Операция," ", "") + "ГруппаШаблон") = Неопределено Тогда
				НоваяГруппа = СоздатьКопиюЭлемента(Элементы.ГруппаШаблон, СтрЗаменить(КоллекцияДанных.Операция," ", ""),Элементы.СтраницаМонитор);
				НовыеГруппыФормы.Добавить(НоваяГруппа.Имя);
			Иначе
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли;
	//3.2.5
	
	Элементы.ГруппаШаблон.Видимость = Ложь;
	
	// ТУ_Прошин_25.09.23++
	//РК = вмс_РаботаСКоллекциями.Удалить;
	//Для каждого КоллекцияДанных Из Объект.Операции Цикл 
	//	Если КоллекцияДанных.Операция.Распоряжения.Количество() > 1 Тогда
	//		
	//	Иначе
	//	   ЗаполнитьМониторДокументамиПоОперации(КоллекцияДанных.Операция);
	//	КонецЕсли;
	//	//ЗаполнитьМониторДокументамиПоОперации(КоллекцияДанных.Операция);
	//КонецЦикла; 
	// ТУ_Прошин_25.09.23--
	
	Для Каждого КолонкаДляОперации Из КолонкиДляОпераций Цикл
		КолонкаДляОперации.НомерСтолбца = 1;
	КонецЦикла;
	
	Для каждого КоллекцияДанных Из Объект.Операции Цикл 
		ЗаполнитьМониторДокументамиПоОперации(КоллекцияДанных.Операция);
	КонецЦикла;

	
КонецФункции

&НаСервере
Функция ЗаполнитьМониторДокументамиПоОперации(Операция)  
	
	ФорматированноеНазвание = СтрЗаменить(Операция, " ", "");
	
	
	ЭтотОбъект["" + ФорматированноеНазвание + "КолонкаКОбработке"].Очистить();    
	ЭтотОбъект["" + ФорматированноеНазвание + "КолонкаВРаботе"].Очистить(); 
	ЭтотОбъект["" + ФорматированноеНазвание + "КолонкаЗавершена"].Очистить();
	
	Итоги = Новый Структура;
	Итоги.Вставить("" + ФорматированноеНазвание + "КолонкаКОбработке", 0); 
	Итоги.Вставить("" + ФорматированноеНазвание + "КолонкаВРаботе", 0);
	Итоги.Вставить("" + ФорматированноеНазвание + "КолонкаЗавершена", 0);
	
	ВсеЭтапы = Новый Массив;
	ВсеЭтапы.Добавить("КОбработке");
	ВсеЭтапы.Добавить("ВРаботе");
	ВсеЭтапы.Добавить("Завершена");
	
	Если Объект.Этапы.Количество() > 0 Тогда
		ВыбранныеЭтапы = Новый Массив;
		Для Каждого СтрокаЭтапа Из Объект.Этапы Цикл
			СсылкаНаЭтап = СтрокаЭтапа.Этап;
			ВыбранныеЭтапы.Добавить(СсылкаНаЭтап.Имя);
		КонецЦикла;
	Иначе
		ВыбранныеЭтапы = ВсеЭтапы;
	КонецЕсли;
	
	Для Каждого Этап Из ВсеЭтапы Цикл
		КолонкаЭтапа = Элементы.Найти(ФорматированноеНазвание + "Колонка" +  Этап);
		КолонкаЭтапа.Видимость = ВыбранныеЭтапы.Найти(Этап) <> Неопределено;
	КонецЦикла;
	
	ДоступныеРаспоряжения = Новый Массив;
	Для Каждого СтрокаРаспоряжение Из Объект.Распоряжения Цикл
		ДоступныеРаспоряжения.Добавить(СтрокаРаспоряжение.Распоряжение.РаспоряжениеКонфигуратор);
	КонецЦикла;
	
	Обработка =  РеквизитФормыВЗначение("Объект"); 
	Макет = Обработка.ПолучитьМакет("КарточкаДокумента");  
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Операция",Новый ОписаниеТипов("СправочникСсылка.вмс_Операции"));
	ТаблицаДанных.Колонки.Добавить("КОбработке",Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("ВРаботе",Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Завершена",Новый ОписаниеТипов("Число"));
	
	
	ТипыДокументов = Новый Соответствие; 
	// ТУ_Прошин_25.09.23
	// Поместил весь последующий код в цикл для того, чтобы работало корректно если в операции несколько распоряжений
	// Для каждого Распоряжение Из Операция.Распоряжения Цикл
	Распоряжение = "ДокументСсылка.вмс_ЗаданиеКладовщику";
	// ТУ_Прошин_20.05.24++
	ТипыДокументов.Вставить(Операция, Распоряжение);
	//ТипыДокументов.Вставить(Операция, Распоряжение.Имя);     
	// ТУ_Прошин_20.05.24--
	
	//КонецЦикла;	
	
	Шаблон = 
	"ВЫБРАТЬ
	|	ДокументпДокумент.Ссылка КАК Документ,
	|	ЕСТЬNULL(Статусы.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус,
	|	Статусы.Ответственный,
	|   %ОперацияНазвание% КАК Операция,
	|   НЕОПРЕДЕЛЕНО КАК пДокумент,
	|   Этапы.Этап
	|ИЗ
	|	%ИмяДокумента% КАК ДокументпДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК Статусы 
	|		ПО (ДокументпДокумент.Ссылка = Статусы.Документ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вмс_Операции.ЭтапыОперации КАК Этапы
	|		ПО (%ОперацияНазвание% = Этапы.Ссылка
	|			И Этапы.Статус = ЕСТЬNULL(Статусы.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)))
	|   ГДЕ ДокументпДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода И ДокументпДокумент.Проведен И НЕ Этапы.Этап ЕСТЬ NULL";
	
	Связка = Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС; 
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	ТекстЗапроса = "";
	
	Итератор = 1;
	
	Для каждого ТипДокумента Из ТипыДокументов Цикл
		ТекстЗапроса = ТекстЗапроса + СтрЗаменить(Шаблон, "%ИмяДокумента%", "Документ.вмс_ЗаданиеКладовщику");
		Если ТипДокумента.Значение = "ДокументСсылка.вмс_ЗаданиеКладовщику" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕОПРЕДЕЛЕНО КАК пДокумент", "ДокументпДокумент.Распоряжение КАК Распоряжение");
			ТекстЗапроса = ТекстЗапроса + " И ДокументпДокумент.Операция = %Операция%";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + ?(Итератор < ТипыДокументов.Количество(), Связка, "");
		
		НазваниеОперации = СтрЗаменить(ТипДокумента.Ключ, " ", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ОперацияНазвание%", "&" + НазваниеОперации);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Операция%", "&Операция");
		Запрос.УстановитьПараметр(НазваниеОперации, ТипДокумента.Ключ);
		Запрос.УстановитьПараметр("Операция", ТипДокумента.Ключ);
		Итератор = Итератор + 1;
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		
		Если ДоступныеРаспоряжения.Количество() > 0 Тогда
			МетаданныеРаспоряжение = Метаданные.НайтиПоТипу(ТипЗнч(Выборка.Распоряжение));
			Если МетаданныеРаспоряжение <> Неопределено Тогда
				ИмяРаспоряжения = МетаданныеРаспоряжение.ПолноеИмя();
				Если ДоступныеРаспоряжения.Найти(ИмяРаспоряжения)=Неопределено Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ДанныеПоКолонкеМассив = КолонкиДляОпераций.НайтиСтроки(Новый Структура("Операция, Этап", Операция, Выборка.Этап.Имя));
		ДанныеПоКолонке = ДанныеПоКолонкеМассив[0];
		КолонкаДляВывода = ДанныеПоКолонке.Колонка;
		
		ИмяЭтапа = Выборка.Этап.Имя;
		ГенерируемКарточкуДокумента(Выборка, ДанныеПоКолонке, Макет);
		
		Итоги.Вставить(КолонкаДляВывода, Итоги[КолонкаДляВывода] + 1);
	КонецЦикла;
	
	ЦветКОбработке = Новый Цвет(255, 182, 172);
	ЦветВРаботе = Новый Цвет(255, 254, 192);
	ЦветЗавершена = Новый Цвет(189, 255, 183);
	
	ЦветФонаОперации = ПолучитьЦветФонаОперации(Операция);
	Если ЦветФонаОперации <> Неопределено Тогда
		ЦветКОбработке = ЦветФонаОперации;
		ЦветВРаботе = ЦветФонаОперации;
		ЦветЗавершена = ЦветФонаОперации;
	КонецЕсли;
	
	ЭтотОбъект["" + СтрЗаменить(Операция, " ", "") + "КолонкаКОбработке"].Область().ЦветФона = ЦветКОбработке;
	ЭтотОбъект["" + СтрЗаменить(Операция, " ", "") + "КолонкаВРаботе"].Область().ЦветФона = ЦветВРаботе;
	ЭтотОбъект["" + СтрЗаменить(Операция, " ", "") + "КолонкаЗавершена"].Область().ЦветФона = ЦветЗавершена;
	
	Для каждого КлючЗначение Из Итоги Цикл  
		РабочееИмяКолонки = КлючЗначение.Ключ;
		КолонкаШаблон = Прав(РабочееИмяКолонки, СтрДлина(РабочееИмяКолонки) - СтрНайти(РабочееИмяКолонки, "Колонка") + 1);
		Элементы[СтрЗаменить(РабочееИмяКолонки, "Колонка", "Группа")].Заголовок = Элементы[КолонкаШаблон].Заголовок; 
		Элементы[СтрЗаменить(РабочееИмяКолонки, "Колонка", "Группа")].Заголовок = СтрШаблон(Элементы[РабочееИмяКолонки].Заголовок + " (%1)", КлючЗначение.Значение);
	КонецЦикла;
	
	РабочееИмяКолонки = СтрЗаменить(Строка(Операция)," ","");
	ИмяКолонкаКОбработке = РабочееИмяКолонки + "КолонкаКОбработке";
	ИмяКолонкаВРаботе    = РабочееИмяКолонки + "КолонкаВРаботе";
	ИмяКолонкаЗавершена  = РабочееИмяКолонки + "КолонкаЗавершена";
	
	СтрокаТЗ = ТаблицаДанных.Добавить();
	СтрокаТЗ.Операция = Операция;
	СтрокаТЗ.КОбработке = Итоги[ИмяКолонкаКОбработке];
	СтрокаТЗ.ВРаботе = Итоги[ИмяКолонкаВРаботе];
	СтрокаТЗ.Завершена = Итоги[ИмяКолонкаЗавершена];
	
	//КонецЦикла;
	
	ТаблицаДанных.Свернуть("Операция,КОбработке,ВРаботе,Завершена");
	КолВоСтрок = ТаблицаДанных.Количество();
	СтрокаТЗ = ТаблицаДанных[КолВоСтрок - 1];
	СтрокаТЧ = ТаблицаСводныхДанныхОпераций.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТЗ);
	
	
КонецФункции

&НаСервере
Функция ПолучитьЦветФонаОперации(Операция)
	
	НастройкиОперацииМассив = Объект.Операции.НайтиСтроки(Новый Структура("Операция", Операция));
	Если НастройкиОперацииМассив.Количество() > 0 Тогда
		НастройкиОперации = НастройкиОперацииМассив[0];
		ЦветСтрока = НастройкиОперации.Цвет;
		ЦветСтрока = СтрЗаменить(ЦветСтрока, ",", " ");
		КомпонентыЦвета = вмс_РаботаСКоллекциями.СтрокуВМассив(НастройкиОперации.Цвет, " ");
		Если КомпонентыЦвета.Количество() >= 3 Тогда
			Попытка
				ЦветФона = Новый Цвет(КомпонентыЦвета[0], КомпонентыЦвета[1], КомпонентыЦвета[2]);
			Исключение
			    
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЦветФона;
		
КонецФункции


&НаСервере
Функция ГенерируемКарточкуДокумента(Данные, ДанныеПоКолонке, Макет) 
	
	ТабДокОперация = ЭтотОбъект[ДанныеПоКолонке.Колонка];
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОблШапка|ШиринаКарточки");
	ЦветОформления = WebЦвета.Черный;
	
	Задание = "";
	//Если ЗначениеЗаполнено(Данные.Документ) Тогда
	//	Задание = Задание + Данные.Документ + Символы.ПС + Символы.ПС;
	//КонецЕсли;
	
	Если НЕ Объект.ОтображатьТолькоРаспоряжения Тогда
		ПредставлениеДокумента = Строка(Данные.Документ);
		ПредставлениеДокумента = СтрЗаменить(ПредставлениеДокумента, "Задание кладовщику", "Задание");
		Задание = Задание + ПредставлениеДокумента;
		Если ЗначениеЗаполнено(Данные.Ответственный) Тогда
			Задание = Задание + Символы.ПС + Символы.ПС + Данные.Ответственный;
		КонецЕсли;
	КонецЕсли;
	
	Задание = СокрЛП(Задание);
	
	ОбластьШапка.Параметры.Документ = Задание;
	ОбластьШапка.Параметры.Ссылка = Данные.Документ;
	ОбластьШапка.Параметры.Статус = ВРЕГ(Данные.Статус);
	
	Если ДанныеПоКолонке.НомерСтолбца=1 Тогда
		ТабДокОперация.Вывести(ОбластьШапка);
	Иначе
		ТабДокОперация.Присоединить(ОбластьШапка);
	КонецЕсли;
	
	Если ДанныеПоКолонке.НомерСтолбца < Объект.КоличествоСтолбцов Тогда
		ДанныеПоКолонке.НомерСтолбца = ДанныеПоКолонке.НомерСтолбца + 1;
	Иначе
		ДанныеПоКолонке.НомерСтолбца = 1;
	КонецЕсли;
	
	
КонецФункции // ()     


#Область ГенерацияЭлементов

&НаСервере
Функция СоздатьКопиюЭлемента(ЭлементИсточника, ПрефиксКопии, ГруппаЭлементов = Неопределено)
    
    Тип = ТипЗнч(ЭлементИсточника);
    
    ЭлементПриемника = Элементы.Добавить(ПрефиксКопии+ ЭлементИсточника.Имя, Тип, ГруппаЭлементов); 
	ЭлементПриемника.Видимость = Истина;
    
    Если Тип = Тип("ГруппаФормы") Тогда
        
        ЭлементПриемника.Вид = ЭлементИсточника.Вид;
        
        Если ЭлементИсточника.Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДаннымЗаголовка");
            
        ИначеЕсли ЭлементИсточника.Вид = ВидГруппыФормы.Страницы Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ТекущаяСтраница");
            
            СкопироватьСобытия(ЭлементПриемника, ЭлементИсточника);
            
        ИначеЕсли ЭлементИсточника.Вид = ВидГруппыФормы.Страница Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ПутьКДаннымЗаголовка");
            
        ИначеЕсли ЭлементИсточника.Вид = ВидГруппыФормы.ГруппаКолонок Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ПутьКДаннымШапки");
            
        Иначе
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
            
        КонецЕсли;
        
        СкопироватьПодчиненныеЭлементы(ЭлементПриемника, ЭлементИсточника, ПрефиксКопии);
        
    ИначеЕсли Тип = Тип("ПолеФормы") Тогда
        
        ЭлементПриемника.Вид = ЭлементИсточника.Вид;
        
        ЭлементПриемника.ПутьКДанным = ПрефиксКопии + ЭлементИсточника.ПутьКДанным;
        
        Если ЭлементИсточника.Вид = ВидПоляФормы.ПолеВвода Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ВыделенныйТекст, СвязьПоТипу, ПутьКДанным, ЦветФона");
            
            Если  ЭлементИсточника.СвязьПоТипу.ПутьКДанным <> "" Тогда
                ПутьКДаннымСвязиПриемника = СтрЗаменить(ЭлементИсточника.СвязьПоТипу.ПутьКДанным, "Элементы." , "Элементы." + ПрефиксКопии);
                ЭлементПриемника.СвязьПоТипу = Новый СвязьПоТипу(ПутьКДаннымСвязиПриемника, ЭлементИсточника.СвязьПоТипу.ЭлементСвязи);    
            КонецЕсли;
            ЗаполнитьКоллекциюСвойств(ЭлементПриемника.СписокВыбора, ЭлементИсточника.СписокВыбора);
            
        ИначеЕсли ЭлементИсточника.Вид = ВидПоляФормы.ПолеПереключателя Тогда
            
            ЗаполнитьКоллекциюСвойств(ЭлементПриемника.СписокВыбора, ЭлементИсточника.СписокВыбора);
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДанным");
            
        ИначеЕсли ЭлементИсточника.Вид = ВидПоляФормы.ПолеТекстовогоДокумента Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДанным, ВыделенныйТекст");
            
        ИначеЕсли ЭлементИсточника.Вид = ВидПоляФормы.ПолеФорматированногоДокумента Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДанным, ВыделенныйТекст");
            
        Иначе
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДанным"); 
			
			Если ЭлементИсточника.Вид = ВидПоляФормы.ПолеТабличногоДокумента Тогда
				ЭлементПриемника.ТекущаяОбласть.ЦветФона = ЭлементИсточника.ТекущаяОбласть.ЦветФона;	
			КонецЕсли;
            
        КонецЕсли;
        
        СкопироватьСобытия(ЭлементПриемника, ЭлементИсточника);
        
    ИначеЕсли Тип = Тип("ТаблицаФормы") Тогда
        
        ЭлементПриемника.ПутьКДанным = ПрефиксКопии + ЭлементИсточника.ПутьКДанным;
        
        ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ПутьКДаннымКартинкиСтроки, ПутьКДанным, ДополнительныеПараметрыСоздания, ЗапросОбновления");
        
        СкопироватьПодчиненныеЭлементы(ЭлементПриемника, ЭлементИсточника, ПрефиксКопии);
        
        СкопироватьКнопкиКоманднойПанелиТаблицы(ЭлементПриемника.КоманднаяПанель, ЭлементИсточника.КоманднаяПанель, ПрефиксКопии);
        
        СкопироватьСобытия(ЭлементПриемника, ЭлементИсточника);
        
    ИначеЕсли Тип = Тип("КнопкаФормы") Тогда
        
        ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
        
        СкопироватьКоманду(ЭлементПриемника, ЭлементИсточника, ПрефиксКопии);
        
    Иначе
        
        ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
        
	КонецЕсли; 
	
	Возврат ЭлементПриемника;
    
КонецФункции

&НаСервере
Процедура СкопироватьПодчиненныеЭлементы(Приемник, Источник, ПрефиксКопии) Экспорт
    
    Для Каждого ЭлементИсточника Из Источник.ПодчиненныеЭлементы Цикл
        СоздатьКопиюЭлемента(ЭлементИсточника, ПрефиксКопии, Приемник);
    КонецЦикла;
    
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьКоллекциюСвойств(КоллекцияПриемник, КоллекцияИсточник)
    
    Для Каждого Элемент Из КоллекцияИсточник Цикл
        ЗаполнитьЗначенияСвойств(КоллекцияПриемник.Добавить(), Элемент);
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура СкопироватьКнопкиКоманднойПанелиТаблицы(ГруппаКнопокПриемник, ГруппаКнопокИсточник,ПрефиксКопии) Экспорт
    
    Для Каждого ЭлементИсточника из ГруппаКнопокИсточник.ПодчиненныеЭлементы Цикл
        // Созданные элементы командных панелей таблиц должны содержать слово "кнопка" или "кнопки".
        // Это необходимо, чтобы отличить их от стандартных элементов, которые генерируются в источнике сами
        Если Найти(НРег(ЭлементИсточника.Имя), "кнопк") > 0 Тогда
            
            Тип = ТипЗнч(ЭлементИсточника);
            ЭлементПриемника = Элементы.Добавить(ПрефиксКопии + ЭлементИсточника.Имя, Тип, ГруппаКнопокПриемник);
            
            Если Тип = Тип("ГруппаФормы") Тогда
                
                ЭлементПриемника.Вид = ЭлементИсточника.Вид;
                
                ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
                
                СкопироватьКнопкиКоманднойПанелиТаблицы(ЭлементПриемника, ЭлементИсточника, ПрефиксКопии);
                
            ИначеЕсли Тип = Тип("КнопкаФормы") Тогда
                
                ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
                
                СкопироватьКоманду(ЭлементПриемника, ЭлементИсточника, ПрефиксКопии);
                
            КонецЕсли;    
            
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура СкопироватьКоманду(ЭлементПриемник, ЭлементИсточник, ПрефиксКопии) Экспорт
    
    КомандаИсточник = Команды.Найти(ЭлементИсточник.ИмяКоманды);
    
    КомандаПриемник = Команды.Найти(ПрефиксКопии + КомандаИсточник.Имя); //Две кнопки могут ссылаться на одну команду
    
    Если КомандаПриемник = Неопределено Тогда
        КомандаПриемник = Команды.Добавить(ПрефиксКопии + КомандаИсточник.Имя);
    КонецЕсли;     
    
    ЗаполнитьЗначенияСвойств(КомандаПриемник, КомандаИсточник, , "Имя");
    
    ЭлементПриемник.ИмяКоманды = КомандаПриемник.Имя;
    
КонецПроцедуры

&НаСервере
Процедура СкопироватьСобытия(ЭлементПриемник, ЭлементИсточник) Экспорт
    
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПриИзменении");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "НачалоВыбора");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "НачалоВыбораИзСписка");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "Очистка");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "Выбор");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "Регулирование");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "Открытие");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ОбработкаВыбора");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "АвтоПодбор");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ОкончаниеВводаТекста");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПриОбновленииСоставаПользовательскихНастроекНаСервере");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПриНачалеРедактирования");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПередНачаломДобавления");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПередНачаломИзменения");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПриАктивизацииСтроки");
    
КонецПроцедуры

&НаСервере
Процедура СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, ИмяСобытия) Экспорт
    
    Действие = ЭлементИсточник.ПолучитьДействие(ИмяСобытия);
    
    Если Действие <> "" Тогда
        ЭлементПриемник.УстановитьДействие(ИмяСобытия, Действие);
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти


#Область Автообновление

&НаКлиенте
Процедура АвтообновлениеПриИзменении(Элемент)
	Если Автообновление Тогда
		ПодключитьОбработчикОжидания("Автообновление", ЧастотаАвтообновления, Истина);  
		Элементы.ЧастотаАвтообновления.Доступность = Истина;
	Иначе
		ОтключитьОбработчикОжидания("Автообновление"); 
		Элементы.ЧастотаАвтообновления.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧастотаАвтообновленияПриИзменении(Элемент)
	ОтключитьОбработчикОжидания("Автообновление");   
	ПодключитьОбработчикОжидания("Автообновление", ЧастотаАвтообновления, Истина); 	
КонецПроцедуры

&НаКлиенте
Процедура Автообновление()
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница=Элементы.СтраницаМонитор Тогда
		ЗаполнитьМониторПоОперациям();
	КонецЕсли;
	ПодключитьОбработчикОжидания("Автообновление", ЧастотаАвтообновления, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница=Элементы.СтраницаМонитор Тогда
		ЗаполнитьМониторПоОперациям();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоДокументам(Команда)
	ЗаполнитьМониторПоОперациям();
	ЗаполнитьДанныеДиаграммы();
КонецПроцедуры


#КонецОбласти

