
Функция ПолучитьИмяИПутьФайла(знач ПолноеИмяФайла, ИмяФайла, ПутьФайла="") Экспорт
	
	ПолноеИмяФайла = СтрЗаменить(ПолноеИмяФайла, "/", "\");
	
	ЧастиФайла = вмс_РаботаСКоллекциями.СтрокуВМассив(ПолноеИмяФайла, "\");
	
	Если ЧастиФайла.Количество() = 1 Тогда
		ИмяФайла = ПолноеИмяФайла;
		ПутьФайла = "";
	Иначе
		ИмяФайла = ЧастиФайла[ЧастиФайла.ВГраница()];
		ПутьФайла = Лев(ПолноеИмяФайла, СтрДлина(ПолноеИмяФайла)-СтрДлина(ИмяФайла));
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьРасширениеФайла(ПолноеИмяФайла, ИмяФайлаБезРасширения="") Экспорт
	
	ЧастиФайла = вмс_РаботаСКоллекциями.СтрокуВМассив(ПолноеИмяФайла, ".");
	Если ЧастиФайла.Количество() > 1 Тогда
		РасширениеФайла = ЧастиФайла[ЧастиФайла.ВГраница()];
		ЧастиФайла.Удалить(ЧастиФайла.ВГраница());
		ИмяФайлаБезРасширения = вмс_РаботаСКоллекциями.МассивВСтроку(ЧастиФайла, ".");
	Иначе
		РасширениеФайла = "";
		ИмяФайлаБезРасширения = ПолноеИмяФайла;
	КонецЕсли;

	Возврат РасширениеФайла;
	
КонецФункции

