
#Область ДОКУМЕНТЫ



Функция ИмяТабличнойЧастиПоУмолчанию() Экспорт
	
	Возврат вмс_РаботаСКоллекциями.СтрокуВМассив("Запасы");
	
КонецФункции

Функция ИмяТабличнойЧастиПроизводство() Экспорт
	
	Возврат "Продукция";
	
КонецФункции 

Функция ИмяБазовогоДокумента() Экспорт
	
	Возврат "Документ.РасходнаяНакладная";
		
КонецФункции

Функция ИмяПриходногоДокумента() Экспорт
	
	Возврат "ПриходнаяНакладная";
		
КонецФункции  

// ТУ_Васильев 25.04.25 ++
// Дозаполняет обработанный программно документ.
//
// Параметры:
//  Документ - ДокументОбъект	 -объект для перезаполнения данных в строке.
//
Функция ДозаполнитьДокумент(Документ) Экспорт 
	
	ТаблицаТоваров = Документ.Запасы.Выгрузить();
	Документ.Запасы.Очистить();
	Документ.Заполнить(Новый Структура("Запасы", ТаблицаТоваров));
		
	Возврат Документ;
	
КонецФункции
// ТУ_Васильев 25.04.25 --



#КонецОбласти

#Область СПРАВОЧНИКИ



Функция ИмяСправочникаСерии() Экспорт
	Возврат "Справочник.СерииНоменклатуры";
КонецФункции

Функция ИмяКолонкиХарактеристика() Экспорт
	
	Возврат "Характеристика";
		
КонецФункции 

Функция ИмяКолонкиФизЛицо() Экспорт
	
	Возврат "ФизическоеЛицо";
		
КонецФункции 

Функция ИмяКолонкиФайлКартинки() Экспорт
	
	Возврат "ФайлКартинки";
		
КонецФункции 

Функция ИмяСправочникаНоменклатураПрисоединенныеФайлы() Экспорт
	
	Возврат "НоменклатураПрисоединенныеФайлы";
		
КонецФункции

Функция ИспользуютсяХарактеристики() Экспорт
	Возврат Константы.ФункциональнаяОпцияИспользоватьХарактеристики.Получить();
КонецФункции

Функция ИспользуютсяСерии() Экспорт
	Возврат Константы.ИспользоватьСерииНоменклатуры.Получить();
КонецФункции

Функция ПустаяХарактеристика() Экспорт
	Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
КонецФункции

#КонецОбласти

#Область СКЛАДЫ



Функция ИмяСправочникаСклады() Экспорт
	
	Возврат "СтруктурныеЕдиницы";
		
КонецФункции  

Функция ИмяСкладаЗапрос() Экспорт
	
	Возврат вмс_РаботаСКоллекциями.СтрокуВМассив("СтруктурнаяЕдиницаРезерв, СтруктурнаяЕдиница"); //Порядок важен, СтруктурнаяЕдиницаРезерв с приоритетом
		
КонецФункции  

Функция ИмяПараметраТипСклада() Экспорт
	
	Возврат "ТипСтруктурнойЕдиницы";
		
КонецФункции

Функция ТипОптовогоСклада() Экспорт
	
	//@skip-check wrong-string-literal-content
	Возврат ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад");
	
КонецФункции

Функция ПустойСклад() Экспорт
	
	Возврат Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		
КонецФункции

#КонецОбласти

#Область УПАКОВКИ



Функция ИмяСправочникаУпаковки() Экспорт
	Возврат "Справочник.ЕдиницыИзмерения";		
КонецФункции

Функция КоэффициентУпаковки(Упаковка, Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УпаковкиСправочник.Коэффициент КАК Коэффициент                
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК УпаковкиСправочник
	|ГДЕ
	|	УпаковкиСправочник.Ссылка = &Упаковка И УпаковкиСправочник.Коэффициент <> 0";

	Запрос.УстановитьПараметр("Упаковка", Упаковка);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 1;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Коэффициент;

КонецФункции

Функция ИмяТипаСправочникаУпаковки() Экспорт
	Возврат "СправочникСсылка.ЕдиницыИзмерения";		
КонецФункции

Функция ТекстЗапросаОбъемНоменклатуры(ИсточникУпаковки = "", ИсточникНоменклатуры = "") Экспорт
	Возврат "" + ИсточникНоменклатуры + ".Объем";
КонецФункции

Функция ТекстЗапросаВесНоменклатуры(ИсточникУпаковки = "", ИсточникНоменклатуры = "") Экспорт
	Возврат "" + ИсточникНоменклатуры + ".Вес";
КонецФункции

Функция ПустаяУпаковка() Экспорт
	Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
КонецФункции

Функция ИмяКолонкиЕдиницыИзмерения() Экспорт
	
	Возврат "ЕдиницаИзмерения";
		
КонецФункции 

Функция ИмяРеквизитаНоменклатурыЕдиницаИзмерения() Экспорт
	
	Возврат "ЕдиницаИзмерения";
	
КонецФункции

Функция ПолучитьЕдиницыИзмеренияТоваров(Строки) Экспорт
	
	Текст = 
	"ВЫБРАТЬ 
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.ЕдиницаИзмерения КАК Упаковка,
	|	ШтрихкодыНоменклатуры.ЕдиницаИзмерения.Коэффициент КАК Коэффициент
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура В (&Строки)
	|";
	
	Запрос = Новый Запрос(Текст);
	
	// Установка параметров.
	Запрос.УстановитьПараметр("Строки", Строки);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция ПолучитьУпаковкиТоваров(Товары) Экспорт
	
	//Кулалаев 
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	ЕдиницыИзмерения.Ссылка КАК Упаковка,
	|	ЕдиницыИзмерения.Коэффициент КАК Коэффициент,
	|	ЕдиницыИзмерения.Коэффициент = 1 КАК ЭтоБаза
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО (Номенклатура.Ссылка = ЕдиницыИзмерения.Владелец
	|				ИЛИ Номенклатура.КатегорияНоменклатуры = ЕдиницыИзмерения.Владелец)
	|ГДЕ
	|	Номенклатура.Ссылка В (&Товары)
	|";
	
	
	// Установка параметров.
	Запрос.УстановитьПараметр("Товары", Товары);
	Возврат Запрос.Выполнить().Выгрузить();    
	
КонецФункции

Функция СоздатьИПолучитьУпаковкуТовара(Товар, Коэффициент) Экспорт
	
	НаименованиеПолное = "" + Коэффициент + " шт";
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЕдиницыИзмерения.Ссылка КАК Упаковка
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Владелец = &Товар
	|   И ЕдиницыИзмерения.Коэффициент = &Коэффициент
	|";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	Запрос.УстановитьПараметр("Коэффициент", Коэффициент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Упаковка = Выборка.Упаковка;
		Прервать;
	КонецЦикла;	
	
	Если Упаковка = Неопределено Тогда
	
		НовыйЭлемент = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		НовыйЭлемент.Заполнить(Неопределено);
		НовыйЭлемент.Владелец = Товар;
		НовыйЭлемент.Коэффициент = Коэффициент;
		НовыйЭлемент.Наименование = НаименованиеПолное;
		
		НовыйЭлемент.Записать();
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Упаковка = Выборка.Упаковка;
			Прервать;
		КонецЦикла;  
		
	КонецЕсли;
	
	Возврат Упаковка;
		
КонецФункции

Функция ВесОбъемБазовойУпаковки(Товар) Экспорт
	
	Возврат Новый Структура("Вес, Объем", Товар.Вес, Товар.Объем);
		
КонецФункции



#КонецОбласти

#Область ПАРАМЕТРЫ_УЧЕТА

Функция ОпределитьМаркируемыеТовары(знач Товары) Экспорт
	
	// 3.2.5
	// Функция доработана для проверки маркировки на дату.
	Товары = вмс_РаботаСКоллекциями.ЗначениеВМассив(Товары);
	
	МаркируемыеТовары = Новый Массив;
	ДатаПроверки = НачалоДня(ТекущаяДатаСеанса());
	МаркируемыеВидыПродукции = ИнтеграцияИСМП.ИспользуемыеВидыМаркируемойПродукцииИСМП();
	
	Для каждого Товар Из Товары Цикл
		
		ВидПродукцииИС = Товар.ВидПродукцииИС;
		
		Если ЗначениеЗаполнено(ВидПродукцииИС) Тогда
			ДатаОбязательнойМаркировки = ИнтеграцияИСМПКлиентСерверПовтИсп.ДатаОбязательнойМаркировкиПродукции(ВидПродукцииИС);
			
			Если ДатаПроверки >= ДатаОбязательнойМаркировки Тогда
				МаркируемыеТовары.Добавить(Товар);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МаркируемыеТовары;
	
КонецФункции

Функция ПолучитьИспользованиеХарактеристикТоваровИПолучитьВладельцаДляВыбора(ВходящиеДанные) Экспорт
	
	Возврат ВходящиеДанные.Товар.ИспользоватьХарактеристики;
		
КонецФункции

Функция ПолучитьВидыТоваров(Товары) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	Номенклатура.КатегорияНоменклатуры КАК ВидТовара
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&Товары)";
	Запрос.УстановитьПараметр("Товары", Товары);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаВидыНоменклатуры = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаВидыНоменклатуры;
	
КонецФункции

Функция ПолучитьТипыДанныхКонфигурации(ТипыДанных) Экспорт

	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Партия", "Справочник.ПартииНоменклатуры");
	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Характеристика", "Справочник.ХарактеристикиНоменклатуры");
	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Серия", "Справочник.СерииНоменклатуры");
	
КонецФункции
// ТУ_Самойленко 30.03.23 --

// ТУ_Прошин_20.06.23++
Функция ПолучитьСписокТоваровПоВводуСтроки(Текст) Экспорт
		Запрос = Новый Структура("Текст, Параметры");
		ЗапросТекст =
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	Номенклатура.Ссылка КАК Товар,
		|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|   Неопределено КАК ПредставлениеТовара
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО (Номенклатура.ТипНоменклатуры = ХарактеристикиНоменклатуры.Владелец
		|				ИЛИ Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец)
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ";   
		
		МассивПоиска = СтрРазделить(Текст, " ");
		Для каждого ЧастьСтроки Из МассивПоиска Цикл
			ЗапросТекст = ЗапросТекст + 
			"  И СТРНАЙТИ(Номенклатура.Ссылка.Код +"" ""+Номенклатура.Ссылка.Артикул +"" ""+Номенклатура.Ссылка.Наименование +"" ""+ ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка.Наименование, """"), """+ЧастьСтроки+""") >= 1"; 
		КонецЦикла;
		
		Запрос.Текст = ЗапросТекст;  
		Запрос.Параметры = Новый Структура("",);   

	Возврат Запрос;
КонецФункции
// ТУ_Прошин_20.06.23--

// ТУ_Самойленко 04.07.23 ++ [Блокировка ячеек]
Функция ПолучитьВладельцаЯчейки(ИзначальныйВладелец) Экспорт
	
	Возврат ИзначальныйВладелец;
	
КонецФункции
// ТУ_Самойленко 04.07.23 ++ [Блокировка ячеек]

Функция ПолучитьКлючиАналитикиНоменклатуры() Экспорт
	
	// Допустимо переопределять запрос для фильтра по нужной номенклатуре
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	СерииНоменклатуры.Ссылка КАК Серия
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец)
	|			И (ХарактеристикиНоменклатуры.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (Номенклатура.Ссылка = СерииНоменклатуры.Владелец
	|				И СерииНоменклатуры.ПометкаУдаления = ЛОЖЬ)
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	|";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
		
КонецФункции

Функция ПривязатьФотографиюКНоменклатуре(Номенклатура, ХранилищеФайла) Экспорт
	
	ДвоичныеДанные = ХранилищеФайла.Получить();
	АдресВременноеХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	// Создание карточки Файла в базе данных.
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.ВладелецФайлов = Номенклатура;
	ПараметрыФайла.ИмяБезРасширения = Строка(Номенклатура);
	ПараметрыФайла.РасширениеБезТочки = "jpg";
	ПараметрыФайла.ВремяИзмененияУниверсальное = ТекущаяДата(); 
	
	НачатьТранзакцию();
	
	Попытка	
		ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(
		ПараметрыФайла,
		АдресВременноеХранилище); 
		
		обНоменклатура = Номенклатура.ПолучитьОбъект();
		обНоменклатура.ФайлКартинки = ПрисоединенныйФайл;
		обНоменклатура.Записать(); 
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Возврат Ложь;		
	КонецПопытки;
		
	Возврат Истина;
		
КонецФункции

Функция ПолучитьИменаРаспоряжений() Экспорт
	Результат = Новый Структура;
	
	Результат.Вставить("Поступление", Новый Массив);
	Результат.Вставить("Гибрид", Новый Массив);
	Результат.Вставить("Выбытие", Новый Массив);
	
	// Из распоряжений документов ПриходныйОрдер, РасходныйОрдер
	Результат.Поступление.Добавить("Документ.ПриходныйОрдер");
	Результат.Поступление.Добавить("Документ.ПриходнаяНакладная"); 	
	Результат.Поступление.Добавить("Документ.ОприходованиеЗапасов");
	Результат.Поступление.Добавить("Документ.ОтчетПереработчика");	//ТЧ Продукция и Отходы формируют приход на склад, Запасы - только по запасам, уже переданным в переработку, не влияют на склад 
	                                                       
	Результат.Гибрид.Добавить("Документ.КомплектацияЗапасов");      //Приход - номенклатура, количество (реквизит), расход - Товары (ТЧ)
	Результат.Гибрид.Добавить("Документ.ПеремещениеЗапасов");		//Передача в эксплуатацию, Перемещение, Возврат из эксплуатации - приход + расход, Списание на расходы - расход
	Результат.Гибрид.Добавить("Документ.СборкаЗапасов");			//Приход - ТЧ Продукция, Отходы, Расход - ТЧ Материалы
	Результат.Гибрид.Добавить("Документ.ПересортицаЗапасов");		//В одной ТЧ смешаны НоменклатураСписание и НоменклатураОприходование       
	Результат.Гибрид.Добавить("Документ.ЗаказПокупателя");			//ВидОперации МатериалыЗаказчика - Поступление, остальные ТЧ - Выбытие
	Результат.Гибрид.Добавить("Документ.ЗаказПоставщику");			//ВидОперации ЗаказНаЗакупку - Поступление, ЗаказНаПереработку - Поступление + Выбытие
	// Результат.Гибрид.Добавить("Документ.ПередачаТоваровМеждуОрганизациями"); //Передача в демо базе не включается т.к.
	// есть проведенные документы по организации, не тестировалась. Есть ТЧ ДобавленныеНаборы, судя по коду
	// разукомплектация делается автоматически
	
	Результат.Выбытие.Добавить("Документ.РасходныйОрдер");
	Результат.Выбытие.Добавить("Документ.СписаниеЗапасов");
	Результат.Выбытие.Добавить("Документ.РасходнаяНакладная");		//Расход - Запасы (Товары и услуги), ТЧ Подарки не меняет остатки по складу
	Результат.Выбытие.Добавить("Документ.ОтчетОПереработке");		//ТЧ Продукция и Отходы формируют расход по складу, Материалы не делает движений
	// Результат.Выбытие.Добавить("Документ.ПринятиеКУчетуВА");		//Не тестировалось, т.к. не складской учет
	
	Возврат Результат;
КонецФункции

//@skip-check module-unused-method
Функция ПолучитьСоответствияИменСправочников() Экспорт
	Результат = Новый Структура;                                                        
	
	Результат.Вставить("ВидыНоменклатуры", "КатегорииНоменклатуры"); 
	Результат.Вставить("Склады", "СтруктурныеЕдиницы");
	Результат.Вставить("ЕдиницыИзмерения", "ЕдиницыИзмерения");
	Результат.Вставить("ЗоныДоставки", "");
	Результат.Вставить("Назначения", "ПартииНоменклатуры");
	Результат.Вставить("Контрагенты", "Контрагенты");
	Результат.Вставить("Номенклатура", "Номенклатура");
	Результат.Вставить("Организации", "Организации");   
	Результат.Вставить("Пользователи", "Пользователи");   
	Результат.Вставить("СерииНоменклатуры", "СерииНоменклатуры");   
	Результат.Вставить("ФизическиеЛица", "ФизическиеЛица");   
	Результат.Вставить("ХарактеристикиНоменклатуры", "ХарактеристикиНоменклатуры");   
	
	Возврат Результат;
КонецФункции

Функция ПолучитьДокументыСНесколькимиТЧ() Экспорт
	РК = вмс_РаботаСКоллекциями;
	
	Результат = Новый Соответствие;    
	Результат.Вставить("Документ.ОтчетПереработчика", РК.СтрокуВМассив("Продукция, Отходы"));
	Результат.Вставить("Документ.ПеремещениеЗапасов", РК.СтрокуВМассив("Запасы, Спецоснастка, ИнвентарьИХозяйственныеПринадлежности"));
	Результат.Вставить("Документ.СборкаЗапасов", 	  Новый Структура("Поступление, Выбытие", РК.СтрокуВМассив("Продукция, Отходы"), РК.СтрокуВМассив("Запасы")));
	Результат.Вставить("Документ.ЗаказПокупателя",	  Новый Структура("Поступление, Выбытие", РК.СтрокуВМассив("МатериалыЗаказчика"), РК.СтрокуВМассив("Материалы, Запасы")));
	Результат.Вставить("Документ.ЗаказПоставщику",	  Новый Структура("Поступление, Выбытие", РК.СтрокуВМассив("Запасы"), РК.СтрокуВМассив("Материалы")));
	Результат.Вставить("Документ.ОтчетОПереработке",  РК.СтрокуВМассив("Продукция, Отходы"));
	Возврат Результат;
КонецФункции

Функция ИмяРеквизитаНоменклатурыВладелецСерии() Экспорт
	
	Возврат "Ссылка"; //сама номенклатура
	
КонецФункции

Функция ИмяРеквизитаВладелецСерии() Экспорт
	
	Возврат "Владелец";
	
КонецФункции

Функция ИмяРеквизитаНомерСерии() Экспорт
	
	Возврат "Наименование";
	
КонецФункции

// ТУ_Августинович 25.08.2025 ++
// Добавил метод из вмс_АдаптацияКонфигурацийУТ и адаптировал под УНФ
//
Функция СтроковоеПредставлениеОстатковНаСкладе(Товар) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаТоваров = РК.ЗначениеВТаблицуЗначений(Товар, "Номенклатура");
	КолонкаТовар = ТаблицаТоваров.Колонки.Найти("Товар");
	Если КолонкаТовар <> Неопределено Тогда
		КолонкаТовар.Имя = "Номенклатура";
	КонецЕсли;
		
	ИмяРегистраОсновногоУчета = "РегистрНакопления.ЗапасыНаСкладах";
	МетаданныеРегистра = Метаданные.НайтиПоПолномуИмени(ИмяРегистраОсновногоУчета);
	Если МетаданныеРегистра=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПоляСоединенияМассив = Новый Массив;
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		Если ТаблицаТоваров.Колонки.Найти(Измерение.Имя) <> Неопределено Тогда
			ПоляСоединенияМассив.Добавить(Измерение.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если ПоляСоединенияМассив.Найти("Номенклатура")=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПоляСоединения = РК.МассивВСтроку(ПоляСоединенияМассив);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ТаблицаТоваров_ТоварныеПоля КАК ТоварныеПоля
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ТоварныеПоля КАК ТоварныеПоля, 
	|	Остатки.Склад КАК Склад,
	|	Остатки.ВНаличииОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			(&ТоварныеПоля, 1) В
	|				(ВЫБРАТЬ
	|					&ТоварныеПоля,
	|					1
	|				ИЗ
	|					ТаблицаТоваров)) КАК Остатки";
	РК.ТипизироватьТаблицуЗначений(ТаблицаТоваров);
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	
	ПоляТаблицыТоваровМассив = Новый Массив;
	Для Каждого Поле Из ПоляСоединенияМассив Цикл
		ПоляТаблицыТоваровМассив.Добавить("ТаблицаТоваров." + Поле + " КАК " + Поле);
	КонецЦикла;
	ПоляТаблицыТоваров = РК.МассивВСтроку(ПоляТаблицыТоваровМассив);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТаблицаТоваров_ТоварныеПоля КАК ТоварныеПоля", ПоляТаблицыТоваров);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрНакопления.ТоварыНаСкладах", ИмяРегистраОсновногоУчета);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТоварныеПоля КАК ТоварныеПоля", ПоляСоединения);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТоварныеПоля", ПоляСоединения);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Остатки.Склад", "Остатки.СтруктурнаяЕдиница");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Остатки.ВНаличииОстаток", "Остатки.КоличествоОстаток");
	РезультатЗапроса = Запрос.Выполнить();
	
	ПредставлениеОстатков = "";
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПредставлениеОстатков = ПредставлениеОстатков + СтрШаблон("%1: %2 ед.", Выборка.Склад, Выборка.Остаток) + Символы.ПС;
	КонецЦикла;
	
	Возврат ПредставлениеОстатков;
		
КонецФункции
// ТУ_Августинович 25.08.2025 --



#КонецОбласти

#Область ПЕЧАТЬ_ЭТИКЕТКИ




Процедура Печать(Знач МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	МенеджерОбработки = Обработки["ПечатьЭтикетокИЦенников"];
	
	// Вытаскиваем данные для печати в массив объектов для совместимости обработки с Розницей 
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПараметрыПечати.ДанныеПечати[0]);
	
	НастройкиПечати = МенеджерОбработки.НовыеНастройкиПечати();
	СоответствиеШаблонов = Новый Соответствие;
	
	НастройкиПечати.ОбязательныеПоля.Добавить("КоличествоЦенниковДляПечати");
	НастройкиПечати.ОбязательныеПоля.Добавить("КоличествоЭтикетокДляПечати");
	НастройкиПечати.ОбязательныеПоля.Добавить("ШаблонЦенникаДляПечати");
	НастройкиПечати.ОбязательныеПоля.Добавить("ШаблонЭтикеткиДляПечати");
	НастройкиПечати.ОбязательныеПоля.Добавить("Номенклатура");

	НастройкиПечати.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблона";

	// Собираем используемые поля из шаблонов.
	ТаблицаТоваров = МассивОбъектов[0].Товары.Выгрузить(); 
	ТаблицаШаблонов = ТаблицаТоваров.Скопировать(,"ШаблонЭтикетки, ШаблонЦенника"); 

	ПечататьЭтикетки = Истина;
	ПечататьЦенники = Истина;
	Если КоллекцияПечатныхФорм.Количество() > 0 Тогда
		ПечататьЦенники = КоллекцияПечатныхФорм[0].ИмяМакета = "Ценники";
		ПечататьЭтикетки = КоллекцияПечатныхФорм[0].ИмяМакета = "Этикетки";
	КонецЕсли;
	
	//@skip-check wrong-string-literal-content
	ТипШаблонаЦенник = ПредопределенноеЗначение("Перечисление.ТипыШаблонов.ЭтикеткаЦенникПринтераЭтикеток");

	Для Каждого СтрокаТЧ Из ТаблицаШаблонов Цикл

		Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) И ПечататьЭтикетки
				И СтрокаТЧ.ШаблонЭтикетки.ТипШаблона <> ТипШаблонаЦенник Тогда
			СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЭтикетки);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) И ПечататьЦенники
				И СтрокаТЧ.ШаблонЦенника.ТипШаблона <> ТипШаблонаЦенник Тогда
			СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЦенника);
		КонецЕсли;

	КонецЦикла;

	// Заполняем коллекцию обязательных полей и формируем соответствие шаблонов.
	Для Каждого КлючИЗначение Из СоответствиеШаблонов Цикл
		СтруктураШаблона = КлючИЗначение.Ключ.Шаблон.Получить();

		// Структура шаблонов.
		НастройкиПечати.СоответствиеШаблоновИСтруктурыШаблонов.Вставить(КлючИЗначение.Ключ, СтруктураШаблона);

		// Добавляем в массив обязательных полей поля, присутствующие в печатной форме ценника.
		Если СтруктураШаблона <> Неопределено
				И ТипЗнч(СтруктураШаблона) = Тип("Структура")
				И СтруктураШаблона.Свойство("ПараметрыШаблона") Тогда
			Для Каждого Элемент Из СтруктураШаблона.ПараметрыШаблона Цикл
				НастройкиПечати.ОбязательныеПоля.Добавить(Элемент.Ключ);
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;

	// Подготовка исходных данных.
	ИсходныеДанныеПодготовка = МассивОбъектов[0].Товары.Выгрузить();
	// ТУ_Прошин_22.05.24++
	//ИсходныеДанные = ИсходныеДанныеПодготовка.Скопировать(,"Номенклатура,Характеристика,Партия,ЕдиницаИзмерения,КоличествоЭтикеток,КоличествоЦенников,ШаблонЭтикетки,ШаблонЦенника,Организация,Штрихкод");
	ИсходныеДанные = ИсходныеДанныеПодготовка.Скопировать(,"Номенклатура, Характеристика, Серия, ШтрихАвтопроверки, Партия,ЕдиницаИзмерения,КоличествоЭтикеток,КоличествоЦенников,ШаблонЭтикетки,ШаблонЦенника,Организация,Штрихкод");	
	// ТУ_Прошин_22.05.24--
	
	Для Каждого СтрокаТЧ Из ИсходныеДанные Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) Тогда
			СтрокаТЧ.КоличествоЭтикеток = 0;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) Тогда
			СтрокаТЧ.КоличествоЦенников = 0;
		КонецЕсли;
	КонецЦикла;
	Если ПараметрыПечати.Режим = "ПечатьЭтикеток" Тогда
		ИсходныеДанные.ЗаполнитьЗначения(0, "КоличествоЦенников");
	КонецЕсли;
	Если ПараметрыПечати.Режим = "ПечатьЦенников" Тогда
		ИсходныеДанные.ЗаполнитьЗначения(0, "КоличествоЭтикеток");
	КонецЕсли;

	НастройкиПечати.ПараметрыДанных.Вставить("ВидЦен", МассивОбъектов[0].ВидЦен);
	НастройкиПечати.ПараметрыДанных.Вставить("Организация", МассивОбъектов[0].Организация);
	НастройкиПечати.ПараметрыДанных.Вставить("ЦеныПоВидуЦены", МассивОбъектов[0].ЦеныПоВидуЦены);
	НастройкиПечати.ПараметрыДанных.Вставить("ЦеныНаДату", МассивОбъектов[0].ЦеныНаДату);
	НастройкиПечати.ПараметрыДанных.Вставить("ЦеныНаДатуАкционные", МассивОбъектов[0].ЦеныНаДатуАкционные);
	НастройкиПечати.ПараметрыДанных.Вставить("ВидЦенАкционный", Справочники.ВидыЦен.ПустаяСсылка()); // ТУ_Кошелев 12.12.24 - выдавало ошибку, заменил на пустую ссылку

	НастройкиПечати.ИсходныеДанные = ИсходныеДанные;

	// Вывод табличных документов в коллекцию.
	КоллекцияПечатныхФормВнутренняя = СформироватьПечатныеФормыЭтикетокИЦенников(НастройкиПечати, ПечататьЭтикетки, ПечататьЦенники);
	КоллекцияПечатныхФорм.Очистить();
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФормВнутренняя Цикл

		НоваяФорма = КоллекцияПечатныхФорм.Добавить();
		НоваяФорма.ИмяМакета = ПечатнаяФорма.ИмяМакета;
		НоваяФорма.СинонимМакета = ПечатнаяФорма.ИмяМакета;
		НоваяФорма.ИмяВРЕГ = ВРег(ПечатнаяФорма.ИмяМакета);
		НоваяФорма.ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
		НоваяФорма.Экземпляров = 1;

	КонецЦикла;

КонецПроцедуры 

Функция ПечатьЭтикеткиТовара(ВходящиеПараметры) Экспорт
	
	// ТУ_Прошин_21.05.24++
	Если Не ВходящиеПараметры.Свойство("Номенклатура") Тогда
		Если ВходящиеПараметры.Свойство("Товар") Тогда
			ВходящиеПараметры.Вставить("Номенклатура", ВходящиеПараметры.Товар);	
		КонецЕсли;
	КонецЕсли;  
	
	Если НЕ ВходящиеПараметры.Свойство("Серия") Тогда
			ВходящиеПараметры.Вставить("Серия", Справочники.СерииНоменклатуры.ПустаяСсылка());	
	КонецЕсли;

	// ТУ_Прошин_21.05.24--

	
	Если ВходящиеПараметры.Свойство("Характеристика") = Ложь Тогда
		ВходящиеПараметры.Вставить("Характеристика", ПустаяХарактеристика());	
	КонецЕсли;	

	// ТУДУ+
	лТекст = "
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	|	И ШтрихкодыНоменклатуры.Характеристика = &Характеристика
	|";
	
	лЗапрос = Новый Запрос(лТекст);
		
	// Установка параметров.
	лЗапрос.УстановитьПараметр("Номенклатура", ВходящиеПараметры.Номенклатура);
	лЗапрос.УстановитьПараметр("Характеристика", ВходящиеПараметры.Характеристика);
	
	Выборка = лЗапрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВходящиеПараметры.Вставить("Штрихкод", Выборка.Штрихкод);
	КонецЦикла;
	
	// ТУДУ-
	
	
	ПараметрыПечати = Новый Структура("",);
	ПараметрыПечати.Вставить("Режим", "ПечатьЭтикеток");
	ПараметрыПечати.Вставить("РежимПечати", "Этикетки");
	ПараметрыПечати.Вставить("ДанныеПечати", Новый Массив);
	
	СтруктураДанныхПечати = Новый Структура("",);
	// ТУ_Прошин_21.05.24++
	//СтруктураДанныхПечати.Вставить("ВидЦен", Справочники["ВидыЦен"]["Учетная"]);
	СтруктураДанныхПечати.Вставить("ВидЦен", Справочники["ВидыЦен"].ПустаяСсылка());
	// ТУ_Прошин_21.05.24--	СтруктураДанныхПечати.Вставить("ВидЦенАкционные", Справочники["ВидыЦен"].ПустаяСсылка());
	СтруктураДанныхПечати.Вставить("НажатаПечать", Истина);
	СтруктураДанныхПечати.Вставить("Организация", Справочники["Организации"].ОрганизацияПоУмолчанию());
	СтруктураДанныхПечати.Вставить("ПечатьИзДокумента", Ложь);
	СтруктураДанныхПечати.Вставить("ПечатьИзОбработки", Ложь);
	СтруктураДанныхПечати.Вставить("Режим", "ПечатьЭтикеток");
	СтруктураДанныхПечати.Вставить("СтраницаПечати", "СтраницаТовары");
	СтруктураДанныхПечати.Вставить("СтруктурнаяЕдиница", Справочники["СтруктурныеЕдиницы"].ПустаяСсылка()); 
	СтруктураДанныхПечати.Вставить("ЦеныНаДату", ТекущаяДатаСеанса());
	СтруктураДанныхПечати.Вставить("ЦеныНаДатуАкционные", ТекущаяДатаСеанса());
	СтруктураДанныхПечати.Вставить("ЦеныПоВидуЦены", Ложь);
	//таблицы
	СтруктураДанныхПечати.Вставить("Запасы", Новый Структура());
	СтруктураДанныхПечати.Вставить("ИсходныеДанные", Новый Структура());
	СтруктураДанныхПечати.Вставить("Товары", Новый Массив);  
	
	СтруктураТоваров = Новый Структура();
	СтруктураТоваров.Вставить("SKU", 0);
    СтруктураТоваров.Вставить("Весовой", Ложь);
	СтруктураТоваров.Вставить("Выбран", Истина);
	СтруктураТоваров.Вставить("КоличествоЭтикеток", ВходящиеПараметры.Количество);
	СтруктураТоваров.Вставить("КоличествоЦенников", ВходящиеПараметры.Количество);
	СтруктураТоваров.Вставить("КоличествоВДокументе", ВходящиеПараметры.Количество);
	СтруктураТоваров.Вставить("ИсходныйНомерСтроки", 1);
	СтруктураТоваров.Вставить("ЕдиницаИзмерения", Справочники["ЕдиницыИзмерения"].ПустаяСсылка());
	СтруктураТоваров.Вставить("Номенклатура", ВходящиеПараметры.Номенклатура);
	СтруктураТоваров.Вставить("НаименованиеПолное", "");
	СтруктураТоваров.Вставить("НомерСтроки", 1);
	СтруктураТоваров.Вставить("Организация", СтруктураДанныхПечати.Организация);
	СтруктураТоваров.Вставить("ОстатокНаСкладе", 0);
	СтруктураТоваров.Вставить("Партия", Справочники["ПартииНоменклатуры"].ПустаяСсылка()); 
	СтруктураТоваров.Вставить("Характеристика", ВходящиеПараметры.Характеристика);
	СтруктураТоваров.Вставить("Склад", "");
	СтруктураТоваров.Вставить("Штрихкод", ВходящиеПараметры.Штрихкод);
	СтруктураТоваров.Вставить("ШаблонЭтикетки", ВходящиеПараметры.Номенклатура["КатегорияНоменклатуры"]["ШаблонЭтикетки"]);
	СтруктураТоваров.Вставить("ШаблонЦенника", ВходящиеПараметры.Номенклатура["КатегорияНоменклатуры"]["ШаблонЦенника"]); 
	// ТУ_Прошин_21.05.24++
	СтруктураТоваров.Вставить("Серия", ВходящиеПараметры.Серия); 
	СтруктураТоваров.Вставить("ШтрихАвтопроверки", ВходящиеПараметры.Штрихкод);
	// ТУ_Прошин_21.05.24--
	СтруктураТоваров.Вставить("Цена", 0);
    СтруктураТоваров.Вставить("ТипШаблонаЦенника", 0);
	СтруктураТоваров.Вставить("ТипШаблонаЭтикетки", 0); 

	ТекстПараметра = "&Параметр КАК Параметр,";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ" + Символы.ПС;
	
	Для каждого КлючЗначение Из СтруктураТоваров Цикл 
		
		ВставкаТекст = СтрЗаменить(ТекстПараметра,"Параметр",КлючЗначение.Ключ);
		Запрос.Текст = Запрос.Текст + ВставкаТекст + Символы.ПС;  
		Запрос.Параметры.Вставить(КлючЗначение.Ключ,КлючЗначение.Значение);
		
	КонецЦикла;
	
	Запрос.Текст = Лев(Запрос.Текст,СтрДлина(Запрос.Текст) - 2);
		
	РезультатЗапроса = Запрос.Выполнить();
		
	СтруктураДанныхПечати.Товары = РезультатЗапроса;
	ПараметрыПечати.ДанныеПечати.Добавить(СтруктураДанныхПечати);
	модУправлениеПечатью = вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеПечатью");
	КоллекцияПечатныхФорм = модУправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("Этикетки");
	ОбъектыПечати = Новый СписокЗначений;   
	
	Печать(Новый Массив,ПараметрыПечати,КоллекцияПечатныхФорм,ОбъектыПечати,Новый Структура("",));
	
	Если ЗначениеЗаполнено(КоллекцияПечатныхФорм) Тогда
		Возврат КоллекцияПечатныхФорм[0].ТабличныйДокумент; 
	КонецЕсли; 
	
КонецФункции 

Функция КолонкиИсходныхДанных() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Номенклатура");
	Результат.Добавить("Характеристика");
	Результат.Добавить("Партия");
	Результат.Добавить("ЕдиницаИзмерения");
	Результат.Добавить("КоличествоЭтикеток");
	Результат.Добавить("КоличествоЦенников");
	Результат.Добавить("ШаблонЭтикетки");
	Результат.Добавить("ШаблонЦенника");
	Результат.Добавить("Организация");
	Результат.Добавить("Штрихкод");
	
	Возврат СтрСоединить(Результат, ",");
	
КонецФункции

// Функция формирует табличный документ с ценниками и этикетками.
// 
// Параметры:
//  НастройкиПечати - Структура
//  ПечататьЭтикетки - Булево - печатать этикетки
//  ПечататьЦенники - Булево - печатать ценники
// 
// Возвращаемое значение:
//  ТабличныйДокумент -табличный документ - печатная форма с ценниками и этикетками.
//
Функция СформироватьПечатныеФормыЭтикетокИЦенников(НастройкиПечати, ПечататьЭтикетки, ПечататьЦенники) Экспорт
	
	МенеджерОбработки = Обработки["ПечатьЭтикетокИЦенников"];
	
	Эталон = МенеджерОбработки.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	// Подготовка коллекции печатных форм.
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяКолонкиКоличество");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяКолонкиШаблон");
	КоллекцияПечатныхФорм.Колонки.Добавить("Шаблон");
	
	Для Каждого КлючИЗначение Из НастройкиПечати.СоответствиеШаблоновИСтруктурыШаблонов Цикл
		Если ПечататьЭтикетки Тогда
			ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
			ПечатнаяФорма.ИмяМакета            = "Этикетка"+КлючИЗначение.Ключ;
			ПечатнаяФорма.ИмяКолонкиКоличество = "КоличествоЭтикетокДляПечати";
			ПечатнаяФорма.ИмяКолонкиШаблон     = "ШаблонЭтикеткиДляПечати";
			ПечатнаяФорма.Шаблон = КлючИЗначение.Ключ;
		КонецЕсли;
		
		Если ПечататьЦенники Тогда
			ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
			ПечатнаяФорма.ИмяМакета            = "Ценник" + КлючИЗначение.Ключ;
			ПечатнаяФорма.ИмяКолонкиКоличество = "КоличествоЦенниковДляПечати";
			ПечатнаяФорма.ИмяКолонкиШаблон     = "ШаблонЦенникаДляПечати";
			ПечатнаяФорма.Шаблон = КлючИЗначение.Ключ;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		
		НомерКолонки = 0;
		НомерРяда = 0;
		
		ОписаниеШаблона = Новый Структура;
		ОписаниеШаблона.Вставить("Шаблон", ПечатнаяФорма.Шаблон);
		ОписаниеШаблона.Вставить("ИмяКолонкиШаблон", ПечатнаяФорма.ИмяКолонкиШаблон);
		ДанныеДляПечати = МенеджерОбработки.ПодготовитьДанныеДляПечати(НастройкиПечати, ОписаниеШаблона);
		
		ВременныйТабличныйДокумент = Новый ТабличныйДокумент;
		
		Для Каждого СтрокаТовары Из ДанныеДляПечати.ТаблицаТоваров Цикл
			
			Если СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество] > 0
				И СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон] = ПечатнаяФорма.Шаблон Тогда
				
				ОписаниеШаблона = НастройкиПечати.СоответствиеШаблоновИСтруктурыШаблонов.Получить(СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон]);
				
				Если ПечатнаяФорма.ТабличныйДокумент = Неопределено Тогда
					
					Если СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон].ТипШаблона <> Перечисления.ТипыШаблонов.ЭтикеткаЦенникПринтераЭтикеток Тогда
						ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
					Иначе
						ПечатнаяФорма.ТабличныйДокумент = Новый Структура;
						ПечатнаяФорма.ТабличныйДокумент.Вставить("XML", ОписаниеШаблона.XMLОписаниеМакета);
						ПечатнаяФорма.ТабличныйДокумент.Вставить("Этикетки", Новый Массив);
					КонецЕсли;
					
				КонецЕсли;
				
				Если ОписаниеШаблона <> Неопределено 
					И ТипЗнч(ОписаниеШаблона) = Тип("Структура")
					И СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон].ТипШаблона <> Перечисления.ТипыШаблонов.ЭтикеткаЦенникПринтераЭтикеток Тогда
					
					Область = ОписаниеШаблона.МакетЭтикетки.ПолучитьОбласть(ОписаниеШаблона.ИмяОбластиПечати);
					
					ПроверятьВывод = Ложь;
					
					Для ИндексСтроки = 1 По Область.ВысотаТаблицы Цикл
						
						Если Область.Область("R" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0")).АвтоВысотаСтроки Тогда
							ПроверятьВывод = Истина;
							Прервать;
						КонецЕсли;
						
					КонецЦикла;
					
					// Применение настроек табличного документа.
					ЗаполнитьЗначенияСвойств(ПечатнаяФорма.ТабличныйДокумент, ОписаниеШаблона.МакетЭтикетки, , "ОбластьПечати");
					
					// Установка параметров печати
					ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Этикетки_и_ценники" + ПечатнаяФорма.ИмяМакета;
					
					Для каждого ПараметрШаблона Из ОписаниеШаблона.ПараметрыШаблона Цикл
						Если ЕстьРеквизитОбъекта(Область.Параметры, ПараметрШаблона.Значение) Тогда
							НаименованиеКолонки = ДанныеДляПечати.СоответствиеПолейСКДКолонкамТаблицыТоваров.Получить(Справочники.ХранилищеШаблонов.ИмяПоляВШаблоне(ПараметрШаблона.Ключ));
							Если НаименованиеКолонки <> Неопределено Тогда
								// служебные поля
								Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					Для каждого Рисунок Из Область.Рисунки Цикл
						Если Лев(Рисунок.Имя,8) = ИмяПараметраШтрихкод() ИЛИ Лев(Рисунок.Имя,13) = ИмяПараметраШтрихкодСправкиБ() Тогда
							
							Если Лев(Рисунок.Имя,8) = ИмяПараметраШтрихкод() Тогда
								ЗначениеШтрихкода = СтрокаТовары[ДанныеДляПечати.СоответствиеПолейСКДКолонкамТаблицыТоваров.Получить(ИмяПараметраШтрихкод())];
							ИначеЕсли Лев(Рисунок.Имя,13) = ИмяПараметраШтрихкодСправкиБ() Тогда
								ЗначениеШтрихкода = СтрокаТовары[ДанныеДляПечати.СоответствиеПолейСКДКолонкамТаблицыТоваров.Получить(ИмяПараметраШтрихкодСправкиБ())];
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
								
								ПараметрыШтрихкода = Новый Структура;
								ПараметрыШтрихкода.Вставить("Ширина",	Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
								ПараметрыШтрихкода.Вставить("Высота",	Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
								
								Если ОписаниеШаблона.ТипКода = 16 Тогда
									МинСторона = Мин(ПараметрыШтрихкода.Ширина, ПараметрыШтрихкода.Высота);
									ПараметрыШтрихкода.Ширина = МинСторона;
									ПараметрыШтрихкода.Высота = МинСторона;
								КонецЕсли;
								
								Если ОписаниеШаблона.Свойство("УровеньКоррекцииQR") Тогда
									ПараметрыШтрихкода.Вставить("УровеньКоррекцииQR", ОписаниеШаблона.УровеньКоррекцииQR);
								Иначе
									ПараметрыШтрихкода.Вставить("УровеньКоррекцииQR", 0);
								КонецЕсли;
								
								ПараметрыШтрихкода.Вставить("Штрихкод",				ЗначениеШтрихкода);
								ПараметрыШтрихкода.Вставить("ТипКода",				ОписаниеШаблона.ТипКода);
								
								Если ОписаниеШаблона.Свойство("ОтображатьТекст") Тогда
									ПараметрыШтрихкода.Вставить("ОтображатьТекст",		ОписаниеШаблона.ОтображатьТекст);
								Иначе
									ПараметрыШтрихкода.Вставить("ОтображатьТекст",		Истина);
								КонецЕсли;
								
								Если ОписаниеШаблона.Свойство("РазмерШрифта") Тогда
									ПараметрыШтрихкода.Вставить("РазмерШрифта",			ОписаниеШаблона.РазмерШрифта);
								КонецЕсли;
								
								Если ОписаниеШаблона.Свойство("УголПоворота") Тогда
									ПараметрыШтрихкода.Вставить("УголПоворота", ОписаниеШаблона.УголПоворота);
								КонецЕсли;
								
								ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0);
								
								// ТУ Алфимов 01.03.2024++
								//модМенеджерОборудованияВызовСервера = вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("МенеджерОборудованияВызовСервера");
								//Картинка = модМенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода); 
								
								// ТУ_Кулалаев Е.С ++ 31.05.2024 17:59:26 
								// Рефакторинг: Заменил вмс_Печать на вмс_Печать
								
								Картинка = вмс_Печать.ИзображениеШтрихкода(ПараметрыШтрихкода);
								// ТУ Алфимов 01.03.2024--
								
								Если Картинка <> Неопределено Тогда
									Рисунок.Картинка = Картинка;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
					КонецЦикла;
					
					Для Инд = 1 По СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество] Цикл // Цикл по количеству экземпляров.
						
						МассивОбластей = Новый Массив;
						МассивОбластей.Добавить(Область);
						
						НомерКолонки = НомерКолонки + 1;
						
						Если ПроверятьВывод Тогда
							
							Если НомерКолонки = 1 Тогда
								Если Не ВременныйТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
									ПечатнаяФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
									НомерРяда = 0;
									ВременныйТабличныйДокумент.Очистить();
								КонецЕсли;
							Иначе
								Если Не ВременныйТабличныйДокумент.ПроверитьПрисоединение(МассивОбластей) Тогда
									ПечатнаяФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
									НомерРяда    = 0;
									ВременныйТабличныйДокумент.Очистить();
								КонецЕсли;
							КонецЕсли;
							
						КонецЕсли;
						
						Если НомерКолонки = 1 Тогда
							
							НомерРяда = НомерРяда + 1;
							
							ПечатнаяФорма.ТабличныйДокумент.Вывести(Область);
							ВременныйТабличныйДокумент.Вывести(Область);
							
						Иначе
							
							ПечатнаяФорма.ТабличныйДокумент.Присоединить(Область);
							ВременныйТабличныйДокумент.Присоединить(Область);
							
						КонецЕсли;
						
						Если НомерКолонки = ОписаниеШаблона.КоличествоПоГоризонтали И НомерРяда = ОписаниеШаблона.КоличествоПоВертикали Тогда
							
							НомерРяда    = 0;
							НомерКолонки = 0;
							
							ПечатнаяФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							ВременныйТабличныйДокумент.Очистить();
							
						ИначеЕсли НомерКолонки = ОписаниеШаблона.КоличествоПоГоризонтали Тогда
							
							НомерКолонки = 0;
							
						КонецЕсли;
						
					КонецЦикла; // Цикл по количеству экземпляров.
					
				КонецЕсли;
				
				Если ОписаниеШаблона <> Неопределено 
					И ТипЗнч(ОписаниеШаблона) = Тип("Структура")
					И СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон].ТипШаблона = Перечисления.ТипыШаблонов.ЭтикеткаЦенникПринтераЭтикеток Тогда
					Поля = Новый Массив;
					Для Каждого ТекПоле Из ОписаниеШаблона.ПоляМакета Цикл			
						Если ТекПоле.ТипЗаполнения = "Parameter" Тогда							
							НовоеПоле = Новый Структура;
							НовоеПоле.Вставить("ИмяПоля", ТекПоле.Наименование);							
							Попытка
								Значение = СтрокаТовары[ТекПоле.Значение];
							Исключение
								Значение = "";
							КонецПопытки;
							Если Значение = "" Тогда
								Попытка
									ИмяКолонки = ДанныеДляПечати.СоответствиеПолейСКДКолонкамТаблицыТоваров.Получить(ТекПоле.Значение);
									Значение = СтрокаТовары[ИмяКолонки];
								Исключение
									Значение = "";
								КонецПопытки;
							КонецЕсли;
							//@skip-check wrong-string-literal-content
							Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда								
								Значение = Значение.Получить();								
								Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
									Значение = Base64Строка(Значение);
								Иначе
									Значение = Строка(Значение);
								КонецЕсли;								
							ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.НоменклатураПрисоединенныеФайлы") Тогда
								
								//@skip-check wrong-string-literal-content
								Если Значение.ТипХраненияФайла = ПредопределенноеЗначение("Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе") Тогда
									модРаботаСФайлами = вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РаботаСФайлами");
									АдресХранилища = модРаботаСФайлами.ДанныеФайла(Значение).СсылкаНаДвоичныеДанныеФайла;
									Значение = ПолучитьИзВременногоХранилища(АдресХранилища);
								КонецЕсли;
								
								Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
									Значение = Base64Строка(Значение);
								Иначе
									Значение = Строка(Значение);
								КонецЕсли;
								
							КонецЕсли;							
							Если ЗначениеЗаполнено(Значение) Тогда
								НовоеПоле.Вставить("Значение", Значение);
							Иначе								
								Если ЗначениеЗаполнено(ТекПоле.ЗначениеПоУмолчанию) Тогда						
									НовоеПоле.Вставить("Значение", ТекПоле.ЗначениеПоУмолчанию);
								Иначе
									НовоеПоле.Вставить("Значение", "");
								КонецЕсли;								
							КонецЕсли;
							
							Поля.Добавить(НовоеПоле);
														
						КонецЕсли;
						
					КонецЦикла;
					НоваяЭтикетка = Новый Структура;
					НоваяЭтикетка.Вставить("Количество", СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество]);
					НоваяЭтикетка.Вставить("ЗначенияПолей", Поля);
					ПечатнаяФорма.ТабличныйДокумент.Этикетки.Добавить(НоваяЭтикетка);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла; // Цикл по строкам таблицы товаров.
		
	КонецЦикла;
	
	МассивСтрокДляУдаления = Новый Массив;
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		Если ПечатнаяФорма.ТабличныйДокумент = Неопределено Тогда
			МассивСтрокДляУдаления.Добавить(ПечатнаяФорма);  
		Иначе
			// ТУ_Кошелев поменял чтобы бралась версия шаблона, которая доступна в предприятии при включенной опции
			// "ИспользоватьСтаруюОбработкуПечатиЦенников" / "Использовать старую обработку печати ценников" в предприятии
			СтарыйШаблонУНФ = ПечатнаяФорма.Шаблон.Шаблон.Получить().РедакторТабличныйДокумент;
			ПечатнаяФорма.ТабличныйДокумент.ВысотаСтраницы = СтарыйШаблонУНФ.ВысотаСтраницы;
			ПечатнаяФорма.ТабличныйДокумент.ШиринаСтраницы = СтарыйШаблонУНФ.ШиринаСтраницы;
			вмс_Печать.УстановитьБазовыеПараметрыТабличногоДокумента(СтарыйШаблонУНФ);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ПечатнаяФорма Из МассивСтрокДляУдаления Цикл
		КоллекцияПечатныхФорм.Удалить(ПечатнаяФорма);
	КонецЦикла;
	
	Возврат КоллекцияПечатныхФорм;
	
КонецФункции  

// Функция определяет существует ли реквизит у формы.
//
Функция ЕстьРеквизитОбъекта(Объект, ИмяРеквизита) Экспорт
	
	пКлючУникальности   = Новый УникальныйИдентификатор;

	СтруктураРеквизита = Новый Структура(ИмяРеквизита, пКлючУникальности);

	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> пКлючУникальности;
	
КонецФункции

Функция ИмяПараметраШтрихкод() Экспорт
	
	Возврат "Штрихкод";
	
КонецФункции

Функция ИмяПараметраШтрихкодСправкиБ() Экспорт
	
	Возврат "ШтрихСправкиБ";
	
КонецФункции




#КонецОбласти

Функция ИмяРеквизитаНоменклатурыВид() Экспорт
	
	Возврат "КатегорияНоменклатуры";
	
КонецФункции

Функция ПолучитьИмяТипаНоменклатурыТовар() Экспорт
	Возврат "Запас";
КонецФункции