&НаКлиенте
Перем Переменные;

&НаСервере
Процедура ЗаполнитьСписокОбъектовМетаданных()

	ТаблицаГруппыМетаданных = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("Объект, Синоним");
	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТаблицаГруппыМетаданных, МетаДанные.Справочники, "Справочники");
	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТаблицаГруппыМетаданных, МетаДанные.Документы, "Документы");
	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТаблицаГруппыМетаданных, МетаДанные.ПланыВидовХарактеристик, "Планы видов характеристик");
	
	ЭлементыГрупп = ТаблицаОбъектовМетаданных.ПолучитьЭлементы();
	ЭлементыГрупп.Очистить();
	
	Для Каждого СтрокаГруппаМетаданных Из ТаблицаГруппыМетаданных Цикл
		СтрокаГруппы = ЭлементыГрупп.Добавить();
		СтрокаГруппы.Синоним = СтрокаГруппаМетаданных.Синоним;
		СтрокаГруппы.ЭтоГруппа = Истина;
		Для Каждого ОбъектМетаданных Из СтрокаГруппаМетаданных.Объект Цикл
			СтрокаОбъекта = СтрокаГруппы.ПолучитьЭлементы().Добавить();
			СтрокаОбъекта.Имя = ОбъектМетаданных.ПолноеИмя();
			СтрокаОбъекта.Синоним = ОбъектМетаданных.Синоним;
			СтрокаОбъекта.ЭтоГруппа = Ложь;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбъектовМетаданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//СтрокаОбъекта = ТаблицаОбъектовМетаданных.НайтиПоИдентификатору(ВыбраннаяСтрока);
	//Если СтрокаОбъекта.ЭтоГруппа Тогда
	//Иначе
	//	ОповеститьОВыборе(СтрокаОбъекта.Имя);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокОбъектовМетаданных();
	Инициализация();
КонецПроцедуры

&НаКлиенте
Процедура Инициализация()
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = вмс_РаботаСКоллекциями;
	
	Если Переменные = Неопределено Тогда
		ТаблицаНастроекОтборов = РаботаСКоллекциями.НоваяКвазиТаблицаЗначений("Объект, Использование, Настройки, АдресСхемыКомпоновки");
		РаботаСКоллекциями.ДобавитьИндексыКвазиТаблицыЗначений(ТаблицаНастроекОтборов, "Объект");
		
		Переменные = Новый Структура;
		Переменные.Вставить("ТаблицаНастроекОтборов", ТаблицаНастроекОтборов);
	Иначе
		// восстановим пометки объектов
		ЗаполнитьПометкиОбъектов();
	КонецЕсли;
	Переменные.Вставить("ИмяТекущегоОбъекта", "");
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьПометкиОбъектов()

	РК = вмс_РаботаСКоллекциями;

	ТаблицаНастроекОтборов = Переменные.ТаблицаНастроекОтборов;
	СтрокиОбъектов = ПолучитьСтрокиОбъектовБезИерархии();
	Для Каждого СтрокаОбъекта Из СтрокиОбъектов Цикл
		СтрокаНастроекОтборовОбъекта = РК.НайтиЭлементКоллекции(ТаблицаНастроекОтборов, Новый Структура("Объект", СтрокаОбъекта.Имя));
		СтрокаОбъекта.Пометка = СтрокаНастроекОтборовОбъекта <> Неопределено И СтрокаНастроекОтборовОбъекта.Использование;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаОбъектовМетаданныхПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаОбъектаНаФорме = ТаблицаОбъектовМетаданных.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
	ИмяОбъекта = СтрокаОбъектаНаФорме.Имя;
	СтрокаНастроекОтборовОбъекта = ПолучитьСтрокуНастроекОтборовОбъекта(ИмяОбъекта);
	
	СохранитьНастройкиОтборовТекущегоОбъекта();
	Переменные.ИмяТекущегоОбъекта = ИмяОбъекта;
	
	Если СтрокаНастроекОтборовОбъекта = Неопределено Тогда
		Элементы.ПанельОтборов.ТекущаяСтраница = Элементы.НедоступныеОтборы;
	Иначе
		Элементы.ПанельОтборов.ТекущаяСтраница = Элементы.СписокОтборов;
		ИнициализироватьКомпоновщикНастроекКомпоновкиДанных(СтрокаНастроекОтборовОбъекта.АдресСхемыКомпоновки, СтрокаНастроекОтборовОбъекта.Настройки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИнициализироватьКомпоновщикНастроекКомпоновкиДанных(СхемаКомпоновки, Настройки)
	ИсточникДоступныхНастроекКомпоновкиДанных = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки);
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(ИсточникДоступныхНастроекКомпоновкиДанных);
	КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
	КомпоновщикНастроекКомпоновкиДанных.Восстановить();
КонецФункции

&НаСервере
Функция ПолучитьТекущиеНастройкиКомпоновщикаНастроекКомпоновкиДанных()

	Настройки = КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();
	
	Возврат Настройки;
	
КонецФункции

&НаКлиенте
Функция СохранитьНастройкиОтборовОбъекта(ИмяОбъекта)
	
	СтрокаНастроекОтборовОбъекта = ПолучитьСтрокуНастроекОтборовОбъекта(ИмяОбъекта);
	Если СтрокаНастроекОтборовОбъекта = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаНастроекОтборовОбъекта.Настройки = ПолучитьТекущиеНастройкиКомпоновщикаНастроекКомпоновкиДанных();
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция СохранитьНастройкиОтборовТекущегоОбъекта()
	
	Если Переменные.ИмяТекущегоОбъекта <> "" Тогда
		СохранитьНастройкиОтборовОбъекта(Переменные.ИмяТекущегоОбъекта);
		Переменные.ИмяТекущегоОбъекта = "";
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Функция ПолучитьСтрокуНастроекОтборовОбъекта(ИмяОбъекта)
	
	Перем РаботаСКоллекциями;
	
	Если ИмяОбъекта = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РаботаСКоллекциями = вмс_РаботаСКоллекциями;
	ПоискОбъекта = Новый Структура("Объект", ИмяОбъекта);
	СтрокаОбъекта = РаботаСКоллекциями.НайтиЭлементКоллекции(Переменные.ТаблицаНастроекОтборов, ПоискОбъекта);
	Если СтрокаОбъекта <> Неопределено Тогда
		Возврат СтрокаОбъекта;
	КонецЕсли;
	
	НастройкиКомпоновкиДанных = Новый НастройкиКомпоновкиДанных;
	Поле = НастройкиКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
	
	ГруппировкаНастроек = НастройкиКомпоновкиДанных.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаНастроек.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));

	СтрокаОбъекта = РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Переменные.ТаблицаНастроекОтборов, ПоискОбъекта);
	СтрокаОбъекта.Использование = Ложь;
	СтрокаОбъекта.Настройки = НастройкиКомпоновкиДанных;
	СтрокаОбъекта.АдресСхемыКомпоновки = ПолучитьСхемуКомпоновкиДляОбъекта(ИмяОбъекта);
	Возврат СтрокаОбъекта;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикКомандыВыбрать(Команда)
	
	МассивСсылокНаОбъекты = ПолучитьСсылкиНаВыбранныеОбъекты();
	
	ОповеститьОВыборе(МассивСсылокНаОбъекты);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокиОбъектовБезИерархии()
	
	ОбходОбъектов = Новый Массив;
	
	СтрокиОбъектов = ТаблицаОбъектовМетаданных.ПолучитьЭлементы();
	Для Каждого СтрокаОбъекта Из СтрокиОбъектов Цикл
		ОбходОбъектов.Добавить(СтрокаОбъекта);
	КонецЦикла;
	
	МассивСсылокНаОбъекты = Новый Массив;
	Для Каждого СтрокаОбъекта Из ОбходОбъектов Цикл
		
		ВложенныеСтрокиОбъектов = СтрокаОбъекта.ПолучитьЭлементы();
		Для Каждого ВложеннаяСтрокаОбъекта Из ВложенныеСтрокиОбъектов Цикл
			ОбходОбъектов.Добавить(ВложеннаяСтрокаОбъекта);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ОбходОбъектов;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСсылкиНаВыбранныеОбъекты()
	
	СохранитьНастройкиОтборовТекущегоОбъекта();
	
	МассивСсылокНаОбъекты = Новый Массив;
	Для Каждого СтрокаОбъекта Из ПолучитьСтрокиОбъектовБезИерархии() Цикл
		
		Если СтрокаОбъекта.Пометка Тогда
			МассивСсылокНаОбъектыПоТипу = ПолучитьСсылкиНаОбъекты(СтрокаОбъекта.Имя);
			Для Каждого СсылкаНаОбъект Из МассивСсылокНаОбъектыПоТипу Цикл
				МассивСсылокНаОбъекты.Добавить(СсылкаНаОбъект);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивСсылокНаОбъекты;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСсылкиНаОбъекты(ИмяОбъекта)
	
	СтрокаНастроекОтборовОбъекта = ПолучитьСтрокуНастроекОтборовОбъекта(ИмяОбъекта);
	Если СтрокаНастроекОтборовОбъекта = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	МассивСсылокНаОбъекты = ПолучитьСсылкиНаОбъектыНаСервере(СтрокаНастроекОтборовОбъекта.АдресСхемыКомпоновки, СтрокаНастроекОтборовОбъекта.Настройки);
	
	Возврат МассивСсылокНаОбъекты;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылкиНаОбъектыНаСервере(АдресСхемыКомпоновки, Настройки)
	
	СхемаКомпоновки = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновки);
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновки, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , Истина);
	
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаОбъектов = ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений.Вывести(ПроцессорКомпоновкиДанных);
	
	МассивСсылокНаОбъекты = Новый Массив;
	Для Каждого СтрокаОбъекта Из ТаблицаОбъектов Цикл
		МассивСсылокНаОбъекты.Добавить(СтрокаОбъекта.Ссылка);
	КонецЦикла;
	
	Возврат МассивСсылокНаОбъекты;
	
КонецФункции

&НаСервере
Функция ПолучитьСхемуКомпоновкиДляОбъекта(ИмяОбъекта)

	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных1";
	НаборДанных.ИсточникДанных = ИсточникДанных.Имя;
	НаборДанных.Запрос = "ВЫБРАТЬ ТаблицаОбъекта.Ссылка ИЗ " + ИмяОбъекта + " КАК ТаблицаОбъекта";
	
	АдресСхемыКомпоновки = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
	
	Возврат АдресСхемыКомпоновки;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаОбъектовМетаданныхПометкаПриИзменении(Элемент)
	СтрокаОбъекта = ТаблицаОбъектовМетаданных.НайтиПоИдентификатору(Элементы.ТаблицаОбъектовМетаданных.ТекущаяСтрока);
	СтрокаНастроекОтборовОбъекта = ПолучитьСтрокуНастроекОтборовОбъекта(СтрокаОбъекта.Имя);
	СтрокаНастроекОтборовОбъекта.Использование = СтрокаОбъекта.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикКомандыСохранить(Команда)
	
	ОткрытьФормуУправленияСохраняемымиНастройками(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикКомандыЗагрузить(Команда)
	
	ОткрытьФормуУправленияСохраняемымиНастройками(2);
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуУправленияСохраняемымиНастройками(РежимРаботы)
	
	СписокНастроек = ПолучитьСписокНастроек();
	
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("РежимРаботы", РежимРаботы);
	ПараметрыНовойФормы.Вставить("СписокНастроек", СписокНастроек);
	ОткрытьФорму("ОбщаяФорма.ФормаУправленияСохраняемымиНастройками", ПараметрыНовойФормы, ЭтаФорма, );
	
КонецФункции

&НаКлиенте
Функция СохранитьТекущиеНастройки(ИмяНастройки)
	
	СохранитьНастройкиОтборовТекущегоОбъекта();
	Настройки = Переменные.ТаблицаНастроекОтборов;
	вмс_ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроек_Сохранить(ИмяФормы, "Настройка\" + ИмяНастройки, Настройки);
	СписокНастроек = ПолучитьСписокНастроек();
	Если СписокНастроек.Найти(ИмяНастройки) = Неопределено Тогда
		СписокНастроек.Добавить(ИмяНастройки);
		СохранитьСписокНастроек(СписокНастроек);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокНастроек()
	
	СписокНастроек = вмс_ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроек_Загрузить(ИмяФормы, "СписокНастроек");
	
	Если ТипЗнч(СписокНастроек) <> Тип("Массив") Тогда
		СписокНастроек = Новый Массив;
	КонецЕсли;
	
	Возврат СписокНастроек;
	
КонецФункции

&НаКлиенте
Функция СохранитьСписокНастроек(СписокНастроек)
	
	СписокНастроек = вмс_ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроек_Сохранить(ИмяФормы, "СписокНастроек", СписокНастроек);
	
КонецФункции

&НаКлиенте
Функция ЗагрузитьНастройки(ИмяНастройки)
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаНастроекОтборов = Переменные.ТаблицаНастроекОтборов;
	РК.УдалитьСтрокиКвазиТаблицыЗначений(ТаблицаНастроекОтборов);
	
	СохраненныеНастройки = вмс_ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроек_Загрузить(ИмяФормы, "Настройка\" + ИмяНастройки);
	Если СохраненныеНастройки <> Неопределено Тогда
		
		Для Каждого СохраненнаяНастройка Из РК.ПолучитьЭлементыКоллекции(СохраненныеНастройки) Цикл
			
			Настройка = ПолучитьСтрокуНастроекОтборовОбъекта(СохраненнаяНастройка.Объект);
			ЗаполнитьЗначенияСвойств(Настройка, СохраненнаяНастройка, "Использование, Настройки");
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьПометкиОбъектов();
	
	Переменные.ИмяТекущегоОбъекта = "";
	
	ТаблицаОбъектовМетаданныхПриАктивизацииСтроки(Элементы.ТаблицаОбъектовМетаданных);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения") И ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаУправленияСохраняемымиНастройками" Тогда
		
		Если ВыбранноеЗначение <> Неопределено Тогда
			
			ОбработатьУдалениеНастроек(ИсточникВыбора);
			
			ИмяНастройки = ВыбранноеЗначение;
			Если ИсточникВыбора.РежимРаботы = 1 Тогда
				СохранитьТекущиеНастройки(ИмяНастройки);
			ИначеЕсли ИсточникВыбора.РежимРаботы = 2 Тогда
				ЗагрузитьНастройки(ИмяНастройки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбработатьУдалениеНастроек(ФормаУправленияНастройками)
	
	РК = вмс_РаботаСКоллекциями;
	
	СписокНастроек = ПолучитьСписокНастроек();
	
	НовыйСписокНастроек = РК.ВыгрузитьЗначенияКолонкиКоллекции(ФормаУправленияНастройками.ТаблицаНастроек, "Имя");
	
	УдаленныеНастройки = РК.ВычитаниеМассивов(СписокНастроек, НовыйСписокНастроек);
	
	Если УдаленныеНастройки.Количество() > 0 Тогда
		
		Для Каждого ИмяНастройки Из УдаленныеНастройки Цикл
			вмс_ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроек_Удалить(ИмяФормы, "Настройка\" + ИмяНастройки);
		КонецЦикла;
		
		СохранитьСписокНастроек(НовыйСписокНастроек);
		
	КонецЕсли;
	
КонецФункции

