#Область ДОКУМЕНТЫ

// ТУ_Васильев 25.04.25 ++
Функция ДозаполнитьДокумент(Документ) Экспорт
		Возврат Документ;
КонецФункции	
// ТУ_Васильев 25.04.25 --

Функция ИмяТабличнойЧастиПоУмолчанию() Экспорт
	
	// ТУ_Мовчан 12.12.23
	Возврат вмс_РаботаСКоллекциями.СтрокуВМассив("Товары, ВыходныеИзделия, ВозвращаемыеТовары, МатериалыИРаботы, ТоварыПоРаспоряжениям");  
	//Возврат "Товары";
	
КонецФункции  

Функция ИмяТабличнойЧастиПроизводство() Экспорт
	
	Возврат "Продукция";
	
КонецФункции 

Функция ИмяБазовогоДокумента() Экспорт
	
	Возврат "Документ.РеализацияТоваровУслуг";
		
КонецФункции

Функция ИмяПриходногоДокумента() Экспорт
	
	Возврат "ПриобретениеТоваровУслуг";
		
КонецФункции


#КонецОбласти

#Область СПРАВОЧНИКИ


Функция ИмяСправочникаСерии() Экспорт
	Возврат Неопределено;
КонецФункции

Функция ИмяСправочникаФизЛица() Экспорт
	
	Возврат "Сотрудники";
		
КонецФункции 

// Мовчан 20.03.23++
Функция ИмяКолонкиХарактеристика() Экспорт
	
	Возврат "Характеристика";
		
КонецФункции 

Функция ИмяКолонкиФизЛицо() Экспорт
	
	Возврат "Сотрудник";
		
КонецФункции 

Функция ИмяКолонкиФайлКартинки() Экспорт
	
	Возврат "ФайлКартинки";
		
КонецФункции 

Функция ИмяСправочникаНоменклатураПрисоединенныеФайлы() Экспорт
	
	Возврат "НоменклатураПрисоединенныеФайлы";
		
КонецФункции
// Мовчан 20.03.23--  

Функция ИспользуютсяХарактеристики() Экспорт
	Возврат Константы.ИспользоватьХарактеристики.Получить();
КонецФункции

Функция ИспользуютсяСерии() Экспорт
	Возврат Ложь;
КонецФункции

Функция ПустаяХарактеристика() Экспорт
	Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
КонецФункции

#КонецОбласти

#Область СКЛАДЫ



Функция ИмяСправочникаСклады() Экспорт
	
	Возврат "СкладыКомпании";
		
КонецФункции  

Функция ИмяСкладаЗапрос() Экспорт
	
	Возврат вмс_РаботаСКоллекциями.СтрокуВМассив("Склад");
		
КонецФункции

Функция ТипОптовогоСклада() Экспорт
	
	//@skip-check wrong-string-literal-content
	Возврат ПредопределенноеЗначение("Перечисление.ТипыСкладов.ОптовыйСклад");
	
КонецФункции

Функция ИмяПараметраТипСклада() Экспорт
	
	Возврат "ТипСклада";
		
КонецФункции

Функция ПустойСклад() Экспорт
	
	Возврат Справочники.СкладыКомпании.ПустаяСсылка();
		
КонецФункции



#КонецОбласти

#Область УПАКОВКИ



Функция ИмяСправочникаУпаковки() Экспорт
	Возврат "Справочник.УпаковкиЕдиницыИзмерения";
КонецФункции

Функция ИмяТипаСправочникаУпаковки() Экспорт
	Возврат "СправочникСсылка.УпаковкиЕдиницыИзмерения";
КонецФункции

Функция ПустаяУпаковка() Экспорт
	Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
КонецФункции

Функция ТекстЗапросаОбъемНоменклатуры(ИсточникУпаковки = "", ИсточникНоменклатуры = "") Экспорт
	Возврат "1";
КонецФункции

Функция ТекстЗапросаВесНоменклатуры(ИсточникУпаковки = "", ИсточникНоменклатуры = "") Экспорт
	Возврат "1";
КонецФункции

Функция ИмяКолонкиЕдиницыИзмерения() Экспорт
	
	Возврат "Упаковка";
		
КонецФункции 

Функция ИмяРеквизитаНоменклатурыЕдиницаИзмерения() Экспорт
	
	Возврат "ЕдиницаИзмерения";
		
КонецФункции

Функция ПолучитьУпаковкиТоваров(Товары) Экспорт
	
	//Кулалаев 
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	ЕдиницыИзмерения.Ссылка КАК Упаковка,
	|	ЕдиницыИзмерения.Коэффициент КАК Коэффициент,
	|	ЕдиницыИзмерения.Коэффициент = 1 КАК ЭтоБаза
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО (Номенклатура.Ссылка = ЕдиницыИзмерения.Владелец
	|				ИЛИ Номенклатура.ТипНоменклатуры = ЕдиницыИзмерения.Владелец)
	|ГДЕ
	|	Номенклатура.Ссылка В(&Товары)";
	
	// Установка параметров.
	Запрос.УстановитьПараметр("Товары", Товары);
	Возврат Запрос.Выполнить().Выгрузить();    
	
КонецФункции

// ТУ_Мовчан 04.08.23
Функция СоздатьИПолучитьУпаковкуТовара(Товар, Коэффициент) Экспорт    
		
	НаименованиеПолное = "" + Коэффициент + " шт";
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЕдиницыИзмерения.Ссылка КАК Упаковка
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Владелец = &Владелец
	|   И ЕдиницыИзмерения.Коэффициент = &Коэффициент
	|";     
	
	Если Товар.ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 1 Тогда    
		Запрос.УстановитьПараметр("Владелец", Товар.ТипНоменклатуры);		 
	Иначе
		Запрос.УстановитьПараметр("Владелец", Товар);	
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Товар", Товар);
	Запрос.УстановитьПараметр("Коэффициент", Коэффициент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Упаковка = Выборка.Упаковка;
		Прервать;
	КонецЦикла;	
	
	Если Упаковка = Неопределено Тогда
	
		НовыйЭлемент = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		НовыйЭлемент.Заполнить(Неопределено);
		Если Товар.ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 1 Тогда 
			НовыйЭлемент.Владелец = Товар.ТипНоменклатуры;  
		Иначе 
			НовыйЭлемент.Владелец = Товар; 
		КонецЕсли;  
		НовыйЭлемент.ЕдиницаПоКлассификатору = Товар.БазоваяЕдиницаИзмерения;
		НовыйЭлемент.Коэффициент = Коэффициент;
		НовыйЭлемент.Наименование = НаименованиеПолное;
		
		НовыйЭлемент.Записать();
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Упаковка = Выборка.Упаковка;
			Прервать;
		КонецЦикла;  
		
	КонецЕсли;
	
	Возврат Упаковка;
	
КонецФункции



#КонецОбласти

#Область ПЕЧАТЬ_ЭТИКЕТОК



// ТУ_Самойленко 10.08.23 ++
Функция ПечатьЭтикеткиТовара(ВходящиеПараметры) Экспорт
	
	// Дозаполнение базовых полей в случае их отсутствия
	Если Не ВходящиеПараметры.Свойство("Номенклатура") Тогда
		Если ВходящиеПараметры.Свойство("Товар") Тогда
			ВходящиеПараметры.Вставить("Номенклатура", ВходящиеПараметры.Товар);	
		КонецЕсли;
	КонецЕсли;
	
	Если Не ВходящиеПараметры.Свойство("Характеристика") Тогда
		ВходящиеПараметры.Вставить("Характеристика", ПустаяХарактеристика());	
	КонецЕсли;
	
	// ТУ_Самойленко 10.08.23 ++
	Если Не ВходящиеПараметры.Свойство("Упаковка") Тогда
		ВходящиеПараметры.Вставить("Упаковка", ПустаяУпаковка());	
	КонецЕсли;	
	// ТУ_Самойленко 10.08.23 --

	// ТУДУ+
	лТекст = "
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	|	И ШтрихкодыНоменклатуры.Характеристика = &Характеристика
	|";
	
	лЗапрос = Новый Запрос(лТекст);
		
	// Установка параметров.
	лЗапрос.УстановитьПараметр("Номенклатура", ВходящиеПараметры.Номенклатура);
	лЗапрос.УстановитьПараметр("Характеристика", ВходящиеПараметры.Характеристика);
	
	Выборка = лЗапрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВходящиеПараметры.Вставить("Штрихкод", Выборка.Штрихкод);	
	КонецЦикла;
	
	// ТУДУ-
	
	ПараметрыПечати = Новый Структура("",);
	ПараметрыПечати.Вставить("Режим", "ПечатьЭтикеток");
	ПараметрыПечати.Вставить("РежимПечати", "Этикетки");
	ПараметрыПечати.Вставить("ДанныеПечати", Новый Массив);
	
	СтруктураДанныхПечати = Новый Структура("",);
	//@skip-check wrong-string-literal-content
	// ТУ_Прошин_13.05.24++  
	// Уже в двух проектах на базах клиента ругалось на вид цен Учетная, исправлял таким способом.
	//СтруктураДанныхПечати.Вставить("ВидЦен", Справочники["ВидыЦен"]["Учетная"]);
	СтруктураДанныхПечати.Вставить("ВидЦен", Справочники["ВидыЦен"].ПустаяСсылка()); 
	// ТУ_Прошин_13.05.24--
	СтруктураДанныхПечати.Вставить("ВидЦенАкционные", Справочники["ВидыЦен"].ПустаяСсылка());
	СтруктураДанныхПечати.Вставить("НажатаПечать", Истина);
	СтруктураДанныхПечати.Вставить("Организация", Справочники["Организации"].ОрганизацияПоУмолчанию());
	СтруктураДанныхПечати.Вставить("ПечатьИзДокумента", Ложь);
	СтруктураДанныхПечати.Вставить("ПечатьИзОбработки", Ложь);
	СтруктураДанныхПечати.Вставить("Режим", "ПечатьЭтикеток");
	СтруктураДанныхПечати.Вставить("СтраницаПечати", "СтраницаТовары");
	СтруктураДанныхПечати.Вставить("Склад", Справочники["Склады"].ПустаяСсылка()); 
	СтруктураДанныхПечати.Вставить("ЦеныНаДату", ТекущаяДатаСеанса());
	СтруктураДанныхПечати.Вставить("ЦеныНаДатуАкционные", ТекущаяДатаСеанса());
	СтруктураДанныхПечати.Вставить("ЦеныПоВидуЦены", Ложь);
	//таблицы
	СтруктураДанныхПечати.Вставить("Запасы", Новый Структура());
	СтруктураДанныхПечати.Вставить("ИсходныеДанные", Новый Структура());
	СтруктураДанныхПечати.Вставить("Товары", Новый Массив);  
	
	СтруктураТоваров = Новый Структура();
	СтруктураТоваров.Вставить("SKU", 0);
	СтруктураТоваров.Вставить("Весовой", Ложь);
	СтруктураТоваров.Вставить("Выбран", Истина);
	СтруктураТоваров.Вставить("КоличествоЭтикеток", ВходящиеПараметры.Количество);
	СтруктураТоваров.Вставить("КоличествоЦенников", ВходящиеПараметры.Количество);
	СтруктураТоваров.Вставить("КоличествоВДокументе", ВходящиеПараметры.Количество);
	СтруктураТоваров.Вставить("ИсходныйНомерСтроки", 1);
	СтруктураТоваров.Вставить("ЕдиницаИзмерения", Справочники["ЕдиницыИзмеренияВЕТИС"].ПустаяСсылка());
	СтруктураТоваров.Вставить("Упаковка", ВходящиеПараметры.Упаковка); // ТУ_Самойленко 10.08.23
	СтруктураТоваров.Вставить("Номенклатура", ВходящиеПараметры.Номенклатура);
	СтруктураТоваров.Вставить("НаименованиеПолное", "");
	СтруктураТоваров.Вставить("НомерСтроки", 1);
	СтруктураТоваров.Вставить("Организация", СтруктураДанныхПечати.Организация);
	СтруктураТоваров.Вставить("ОстатокНаСкладе", 0);
	СтруктураТоваров.Вставить("Характеристика", ВходящиеПараметры.Характеристика);
	СтруктураТоваров.Вставить("Склад", СтруктураДанныхПечати.Склад);
	СтруктураТоваров.Вставить("Штрихкод", ВходящиеПараметры.Штрихкод); 
	// ТУ_Кулалаев Е.С ++ 31.05.2024 17:59:26 
	// Рефакторинг: Заменил вмс_Печать на вмс_Печать
	СтруктураТоваров.Вставить("ШаблонЭтикетки", вмс_Печать.ПолучитьШаблонЭтикетки(ВходящиеПараметры.Номенклатура));
	СтруктураТоваров.Вставить("ШаблонЦенника", вмс_Печать.ПолучитьШаблонЦенника(ВходящиеПараметры.Номенклатура));
	СтруктураТоваров.Вставить("Цена", 0);
	СтруктураТоваров.Вставить("ТипШаблонаЦенника", 0);
	СтруктураТоваров.Вставить("ТипШаблонаЭтикетки", 0); 

	ТекстПараметра = "&Параметр КАК Параметр,";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ" + Символы.ПС;
	
	Для каждого КлючЗначение Из СтруктураТоваров Цикл 
		
		ВставкаТекст = СтрЗаменить(ТекстПараметра,"Параметр",КлючЗначение.Ключ);
		Запрос.Текст = Запрос.Текст + ВставкаТекст + Символы.ПС;  
		Запрос.Параметры.Вставить(КлючЗначение.Ключ,КлючЗначение.Значение);
		
	КонецЦикла;
	
	Запрос.Текст = Лев(Запрос.Текст,СтрДлина(Запрос.Текст) - 2);
		
	РезультатЗапроса = Запрос.Выполнить();
		
	СтруктураДанныхПечати.Товары = РезультатЗапроса;
	ПараметрыПечати.ДанныеПечати.Добавить(СтруктураДанныхПечати);
	модУправлениеПечатью = вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеПечатью");
	КоллекцияПечатныхФорм = модУправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("Этикетки");
	ОбъектыПечати = Новый СписокЗначений;   
		
	ПолучитьТаблицуЭтикеток(Новый Массив,ПараметрыПечати,КоллекцияПечатныхФорм,ОбъектыПечати,Новый Структура("",));
	Если ЗначениеЗаполнено(КоллекцияПечатныхФорм) Тогда
		Возврат КоллекцияПечатныхФорм[0].ТабличныйДокумент; 
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьТаблицуЭтикеток(Знач МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	МенеджерОбработки = Обработки["ПечатьЭтикетокИЦенников"]; 
	
	// Вытаскиваем данные для печати в массив объектов для совместимости обработки с Розницей 
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПараметрыПечати.ДанныеПечати[0]);
	
	НастройкиПечати = МенеджерОбработки.СтруктураНастроек(); //.НовыеНастройкиПечати();  // ТУ_СКВ 10.08.23
	СоответствиеШаблонов = Новый Соответствие;
	
	НастройкиПечати.ОбязательныеПоля.Добавить("КоличествоЦенниковДляПечати");
	НастройкиПечати.ОбязательныеПоля.Добавить("КоличествоЭтикетокДляПечати");
	НастройкиПечати.ОбязательныеПоля.Добавить("ШаблонЦенникаДляПечати");
	НастройкиПечати.ОбязательныеПоля.Добавить("ШаблонЭтикеткиДляПечати");
	НастройкиПечати.ОбязательныеПоля.Добавить("Номенклатура");

	НастройкиПечати.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаПечатьТовары"; //"ПоляШаблона"; // ТУ_СКВ 10.08.23

	// Собираем используемые поля из шаблонов.
	ТаблицаТоваров = МассивОбъектов[0].Товары.Выгрузить(); 
	ТаблицаШаблонов = ТаблицаТоваров.Скопировать(,"ШаблонЭтикетки, ШаблонЦенника"); 

	ПечататьЭтикетки = Истина;
	ПечататьЦенники = Истина;
	Если КоллекцияПечатныхФорм.Количество() > 0 Тогда
		ПечататьЦенники = КоллекцияПечатныхФорм[0].ИмяМакета = "Ценники";
		ПечататьЭтикетки = КоллекцияПечатныхФорм[0].ИмяМакета = "Этикетки";
	КонецЕсли;
	
	//@skip-check wrong-string-literal-content
	ТипШаблонаЦенник = ПредопределенноеЗначение("Перечисление.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров");
	ТипШаблонаЭтикетка = ПредопределенноеЗначение("Перечисление.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров");
	
	Для Каждого СтрокаТЧ Из ТаблицаШаблонов Цикл

		Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) И ПечататьЭтикетки
				И СтрокаТЧ.ШаблонЭтикетки.Назначение <> ТипШаблонаЦенник Тогда
			СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЭтикетки);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) И ПечататьЦенники
				И СтрокаТЧ.ШаблонЦенника.ТипШаблона <> ТипШаблонаЭтикетка Тогда
			СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЦенника);
		КонецЕсли;

	КонецЦикла;

	// Заполняем коллекцию обязательных полей и формируем соответствие шаблонов.
	Для Каждого КлючИЗначение Из СоответствиеШаблонов Цикл
		СтруктураШаблона = КлючИЗначение.Ключ.Шаблон.Получить();

		// Структура шаблонов.
		НастройкиПечати.СоответствиеШаблоновИСтруктурыШаблонов.Вставить(КлючИЗначение.Ключ, СтруктураШаблона);

		// Добавляем в массив обязательных полей поля, присутствующие в печатной форме ценника.
		Если СтруктураШаблона <> Неопределено
				И ТипЗнч(СтруктураШаблона) = Тип("Структура")
				И СтруктураШаблона.Свойство("ПараметрыШаблона") Тогда
			Для Каждого Элемент Из СтруктураШаблона.ПараметрыШаблона Цикл
				НастройкиПечати.ОбязательныеПоля.Добавить(Элемент.Ключ);
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;

	// Подготовка исходных данных.
	ИсходныеДанныеПодготовка = МассивОбъектов[0].Товары.Выгрузить();
	ИсходныеДанные = ИсходныеДанныеПодготовка.Скопировать(,"Номенклатура,Характеристика,ЕдиницаИзмерения,КоличествоЭтикеток,КоличествоЦенников,ШаблонЭтикетки,ШаблонЦенника,Организация,Штрихкод,Упаковка,Цена");
	
	Для Каждого СтрокаТЧ Из ИсходныеДанные Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) Тогда
			СтрокаТЧ.КоличествоЭтикеток = 0;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) Тогда
			СтрокаТЧ.КоличествоЦенников = 0;
		КонецЕсли;
	КонецЦикла;
	Если ПараметрыПечати.Режим = "ПечатьЭтикеток" Тогда
		ИсходныеДанные.ЗаполнитьЗначения(0, "КоличествоЦенников");
	КонецЕсли;
	Если ПараметрыПечати.Режим = "ПечатьЦенников" Тогда
		ИсходныеДанные.ЗаполнитьЗначения(0, "КоличествоЭтикеток");
	КонецЕсли;

	НастройкиПечати.ПараметрыДанных.Вставить("ВидЦен", МассивОбъектов[0].ВидЦен);
	НастройкиПечати.ПараметрыДанных.Вставить("Организация", МассивОбъектов[0].Организация);
	НастройкиПечати.ПараметрыДанных.Вставить("ЦеныПоВидуЦены", МассивОбъектов[0].ЦеныПоВидуЦены);
	НастройкиПечати.ПараметрыДанных.Вставить("ЦеныНаДату", МассивОбъектов[0].ЦеныНаДату);
	НастройкиПечати.ПараметрыДанных.Вставить("ЦеныНаДатуАкционные", МассивОбъектов[0].ЦеныНаДатуАкционные);
	НастройкиПечати.ПараметрыДанных.Вставить("ВидЦенАкционный", МассивОбъектов[0].ВидЦенАкционные);

	НастройкиПечати.ИсходныеДанные = ИсходныеДанные;

	// Вывод табличных документов в коллекцию.
	КоллекцияПечатныхФормВнутренняя = СформироватьПечатныеФормыЭтикетокИЦенников(НастройкиПечати, ПечататьЭтикетки, ПечататьЦенники);
	КоллекцияПечатныхФорм.Очистить();
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФормВнутренняя Цикл

		НоваяФорма = КоллекцияПечатныхФорм.Добавить();
		НоваяФорма.ИмяМакета = ПечатнаяФорма.ИмяМакета;
		НоваяФорма.СинонимМакета = ПечатнаяФорма.ИмяМакета;
		НоваяФорма.ИмяВРЕГ = ВРег(ПечатнаяФорма.ИмяМакета);
		НоваяФорма.ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
		НоваяФорма.Экземпляров = 1;

	КонецЦикла;

КонецПроцедуры 

Функция СформироватьПечатныеФормыЭтикетокИЦенников(НастройкиПечати, ПечататьЭтикетки, ПечататьЦенники) Экспорт
	
	// ТУ_Самойленко 10.08.23 ++
	ТипШаблонаЦенник = ПредопределенноеЗначение("Перечисление.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров");
	ТипШаблонаЭтикетка = ПредопределенноеЗначение("Перечисление.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров");
	// ТУ_Самойленко 10.08.23 --
	
	МенеджерОбработки = Обработки["ПечатьЭтикетокИЦенников"];
	
	Эталон = МенеджерОбработки.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	// Подготовка коллекции печатных форм.
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяКолонкиКоличество");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяКолонкиШаблон");
	КоллекцияПечатныхФорм.Колонки.Добавить("Шаблон");
	
	Для Каждого КлючИЗначение Из НастройкиПечати.СоответствиеШаблоновИСтруктурыШаблонов Цикл
		Если ПечататьЭтикетки Тогда
			ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
			ПечатнаяФорма.ИмяМакета            = "Этикетка"+КлючИЗначение.Ключ;
			ПечатнаяФорма.ИмяКолонкиКоличество = "КоличествоЭтикетокДляПечати";
			ПечатнаяФорма.ИмяКолонкиШаблон     = "ШаблонЭтикеткиДляПечати";
			ПечатнаяФорма.Шаблон = КлючИЗначение.Ключ;
		КонецЕсли;
		
		Если ПечататьЦенники Тогда
			ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
			ПечатнаяФорма.ИмяМакета            = "Ценник" + КлючИЗначение.Ключ;
			ПечатнаяФорма.ИмяКолонкиКоличество = "КоличествоЦенниковДляПечати";
			ПечатнаяФорма.ИмяКолонкиШаблон     = "ШаблонЦенникаДляПечати";
			ПечатнаяФорма.Шаблон = КлючИЗначение.Ключ;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		
		НомерКолонки = 0;
		НомерРяда = 0;
		
		// ТУ_Самойленко 10.08.23 ++
		
		//ОписаниеШаблона = Новый Структура;
		//ОписаниеШаблона.Вставить("Шаблон", ПечатнаяФорма.Шаблон);
		//ОписаниеШаблона.Вставить("ИмяКолонкиШаблон", ПечатнаяФорма.ИмяКолонкиШаблон);
		ДанныеДляПечати = МенеджерОбработки.ПодготовитьСтруктуруДанных(НастройкиПечати, "Товары"); // ОписаниеШаблона);
		
		// ТУ_Самойленко 10.08.23 --
		
		ВременныйТабличныйДокумент = Новый ТабличныйДокумент;
		
		Для Каждого СтрокаТовары Из ДанныеДляПечати.Таблица Цикл
			
			Если СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество] > 0
				И СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон] = ПечатнаяФорма.Шаблон Тогда
				
				ОписаниеШаблона = НастройкиПечати.СоответствиеШаблоновИСтруктурыШаблонов.Получить(СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон]);
				
				Если ПечатнаяФорма.ТабличныйДокумент = Неопределено Тогда
					
					Если СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон].Назначение <> ТипШаблонаЦенник Тогда
						ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
					Иначе
						ПечатнаяФорма.ТабличныйДокумент = Новый Структура;
						ПечатнаяФорма.ТабличныйДокумент.Вставить("XML", ОписаниеШаблона.XMLОписаниеМакета);
						ПечатнаяФорма.ТабличныйДокумент.Вставить("Этикетки", Новый Массив);
					КонецЕсли;
					
				КонецЕсли;
				
				Если ОписаниеШаблона <> Неопределено 
					И ТипЗнч(ОписаниеШаблона) = Тип("Структура")
					И СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон].Назначение <> ТипШаблонаЦенник Тогда
					
					Область = ОписаниеШаблона.МакетЭтикетки.ПолучитьОбласть(ОписаниеШаблона.ИмяОбластиПечати);
					
					ПроверятьВывод = Ложь;
					
					Для ИндексСтроки = 1 По Область.ВысотаТаблицы Цикл
						
						Если Область.Область("R" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0")).АвтоВысотаСтроки Тогда
							ПроверятьВывод = Истина;
							Прервать;
						КонецЕсли;
						
					КонецЦикла;
					
					// Применение настроек табличного документа.
					ЗаполнитьЗначенияСвойств(ПечатнаяФорма.ТабличныйДокумент, ОписаниеШаблона.МакетЭтикетки, , "ОбластьПечати");
					
					// Установка параметров печати
					ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Этикетки_и_ценники" + ПечатнаяФорма.ИмяМакета;
					
					Для каждого ПараметрШаблона Из ОписаниеШаблона.ПараметрыШаблона Цикл
						Если ЕстьРеквизитОбъекта(Область.Параметры, ПараметрШаблона.Значение) Тогда
							НаименованиеКолонки = ДанныеДляПечати.СоответствиеПолейСКДКолонкамТаблицы.Получить(Справочники.ШаблоныЭтикетокИЦенников.ИмяПоляВШаблоне(ПараметрШаблона.Ключ)); // ТУ_Самойленко 10.08.23
							Если НаименованиеКолонки <> Неопределено Тогда
								// служебные поля
								Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					Для каждого Рисунок Из Область.Рисунки Цикл
						Если Лев(Рисунок.Имя,8) = ИмяПараметраШтрихкод() ИЛИ Лев(Рисунок.Имя,13) = ИмяПараметраШтрихкодСправкиБ() Тогда
							
							Если Лев(Рисунок.Имя,8) = ИмяПараметраШтрихкод() Тогда
								ЗначениеШтрихкода = СтрокаТовары[ДанныеДляПечати.СоответствиеПолейСКДКолонкамТаблицы.Получить(ИмяПараметраШтрихкод())];
							ИначеЕсли Лев(Рисунок.Имя,13) = ИмяПараметраШтрихкодСправкиБ() Тогда
								ЗначениеШтрихкода = СтрокаТовары[ДанныеДляПечати.СоответствиеПолейСКДКолонкамТаблицы.Получить(ИмяПараметраШтрихкодСправкиБ())];
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
								
								ПараметрыШтрихкода = Новый Структура;
								ПараметрыШтрихкода.Вставить("Ширина",	Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
								ПараметрыШтрихкода.Вставить("Высота",	Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
								
								Если ОписаниеШаблона.ТипКода = 16 Тогда
									МинСторона = Мин(ПараметрыШтрихкода.Ширина, ПараметрыШтрихкода.Высота);
									ПараметрыШтрихкода.Ширина = МинСторона;
									ПараметрыШтрихкода.Высота = МинСторона;
								КонецЕсли;
								
								Если ОписаниеШаблона.Свойство("УровеньКоррекцииQR") Тогда
									ПараметрыШтрихкода.Вставить("УровеньКоррекцииQR", ОписаниеШаблона.УровеньКоррекцииQR);
								Иначе
									ПараметрыШтрихкода.Вставить("УровеньКоррекцииQR", 0);
								КонецЕсли;
								
								ПараметрыШтрихкода.Вставить("Штрихкод",				ЗначениеШтрихкода);
								ПараметрыШтрихкода.Вставить("ТипКода",				ОписаниеШаблона.ТипКода);
								
								Если ОписаниеШаблона.Свойство("ОтображатьТекст") Тогда
									ПараметрыШтрихкода.Вставить("ОтображатьТекст",		ОписаниеШаблона.ОтображатьТекст);
								Иначе
									ПараметрыШтрихкода.Вставить("ОтображатьТекст",		Истина);
								КонецЕсли;
								
								Если ОписаниеШаблона.Свойство("РазмерШрифта") Тогда
									ПараметрыШтрихкода.Вставить("РазмерШрифта",			ОписаниеШаблона.РазмерШрифта);
								КонецЕсли;
								
								Если ОписаниеШаблона.Свойство("УголПоворота") Тогда
									ПараметрыШтрихкода.Вставить("УголПоворота", ОписаниеШаблона.УголПоворота);
								КонецЕсли;
								
								ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0);
								
								// ТУ Алфимов 01.03.2024++
								//модМенеджерОборудованияВызовСервера = вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("МенеджерОборудованияВызовСервера");
								//Картинка = модМенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода); 
								
								// ТУ_Кулалаев Е.С ++ 31.05.2024 17:59:26 
								// Рефакторинг: Заменил вмс_Печать на вмс_Печать
								
								Картинка = вмс_Печать.ИзображениеШтрихкода(ПараметрыШтрихкода);
								// ТУ Алфимов 01.03.2024--
								
								Если Картинка <> Неопределено Тогда
									Рисунок.Картинка = Картинка;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
					КонецЦикла;
					
					Для Инд = 1 По СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество] Цикл // Цикл по количеству экземпляров.
						
						МассивОбластей = Новый Массив;
						МассивОбластей.Добавить(Область);
						
						НомерКолонки = НомерКолонки + 1;
						
						Если ПроверятьВывод Тогда
							
							Если НомерКолонки = 1 Тогда
								Если Не ВременныйТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
									ПечатнаяФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
									НомерРяда = 0;
									ВременныйТабличныйДокумент.Очистить();
								КонецЕсли;
							Иначе
								Если Не ВременныйТабличныйДокумент.ПроверитьПрисоединение(МассивОбластей) Тогда
									ПечатнаяФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
									НомерРяда    = 0;
									ВременныйТабличныйДокумент.Очистить();
								КонецЕсли;
							КонецЕсли;
							
						КонецЕсли;
						
						Если НомерКолонки = 1 Тогда
							
							НомерРяда = НомерРяда + 1;
							
							ПечатнаяФорма.ТабличныйДокумент.Вывести(Область);
							ВременныйТабличныйДокумент.Вывести(Область);
							
						Иначе
							
							ПечатнаяФорма.ТабличныйДокумент.Присоединить(Область);
							ВременныйТабличныйДокумент.Присоединить(Область);
							
						КонецЕсли;
						
						Если НомерКолонки = ОписаниеШаблона.КоличествоПоГоризонтали И НомерРяда = ОписаниеШаблона.КоличествоПоВертикали Тогда
							
							НомерРяда    = 0;
							НомерКолонки = 0;
							
							ПечатнаяФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							ВременныйТабличныйДокумент.Очистить();
							
						ИначеЕсли НомерКолонки = ОписаниеШаблона.КоличествоПоГоризонтали Тогда
							
							НомерКолонки = 0;
							
						КонецЕсли;
						
					КонецЦикла; // Цикл по количеству экземпляров.
					
				КонецЕсли;
				
				Если ОписаниеШаблона <> Неопределено 
					И ТипЗнч(ОписаниеШаблона) = Тип("Структура")
					И СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон].Назначение <> ТипШаблонаЭтикетка Тогда
					Поля = Новый Массив;
					Для Каждого ТекПоле Из ОписаниеШаблона.ПоляМакета Цикл			
						Если ТекПоле.ТипЗаполнения = "Parameter" Тогда							
							НовоеПоле = Новый Структура;
							НовоеПоле.Вставить("ИмяПоля", ТекПоле.Наименование);							
							Попытка
								Значение = СтрокаТовары[ТекПоле.Значение];
							Исключение
								Значение = "";
							КонецПопытки;
							Если Значение = "" Тогда
								Попытка
									ИмяКолонки = ДанныеДляПечати.СоответствиеПолейСКДКолонкамТаблицыТоваров.Получить(ТекПоле.Значение);
									Значение = СтрокаТовары[ИмяКолонки];
								Исключение
									Значение = "";
								КонецПопытки;
							КонецЕсли;
							//@skip-check wrong-string-literal-content
							Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда								
								Значение = Значение.Получить();								
								Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
									Значение = Base64Строка(Значение);
								Иначе
									Значение = Строка(Значение);
								КонецЕсли;								
							ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.НоменклатураПрисоединенныеФайлы") Тогда
								
								//@skip-check wrong-string-literal-content
								Если Значение.ТипХраненияФайла = ПредопределенноеЗначение("Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе") Тогда
									модРаботаСФайлами = вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РаботаСФайлами");
									АдресХранилища = модРаботаСФайлами.ДанныеФайла(Значение).СсылкаНаДвоичныеДанныеФайла;
									Значение = ПолучитьИзВременногоХранилища(АдресХранилища);
								КонецЕсли;
								
								Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
									Значение = Base64Строка(Значение);
								Иначе
									Значение = Строка(Значение);
								КонецЕсли;
								
							КонецЕсли;							
							Если ЗначениеЗаполнено(Значение) Тогда
								НовоеПоле.Вставить("Значение", Значение);
							Иначе								
								Если ЗначениеЗаполнено(ТекПоле.ЗначениеПоУмолчанию) Тогда						
									НовоеПоле.Вставить("Значение", ТекПоле.ЗначениеПоУмолчанию);
								Иначе
									НовоеПоле.Вставить("Значение", "");
								КонецЕсли;								
							КонецЕсли;
							
							Поля.Добавить(НовоеПоле);
														
						КонецЕсли;
						
					КонецЦикла;
					НоваяЭтикетка = Новый Структура;
					НоваяЭтикетка.Вставить("Количество", СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество]);
					НоваяЭтикетка.Вставить("ЗначенияПолей", Поля);
					ПечатнаяФорма.ТабличныйДокумент.Этикетки.Добавить(НоваяЭтикетка);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла; // Цикл по строкам таблицы товаров.
		
	КонецЦикла;
	
	МассивСтрокДляУдаления = Новый Массив;
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		Если ПечатнаяФорма.ТабличныйДокумент = Неопределено Тогда
			МассивСтрокДляУдаления.Добавить(ПечатнаяФорма); 
		Иначе
			ПечатнаяФорма.ТабличныйДокумент.ВысотаСтраницы = ПечатнаяФорма.Шаблон.Высота;
			ПечатнаяФорма.ТабличныйДокумент.ШиринаСтраницы = ПечатнаяФорма.Шаблон.Ширина;
			вмс_Печать.УстановитьБазовыеПараметрыТабличногоДокумента(ПечатнаяФорма.ТабличныйДокумент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ПечатнаяФорма Из МассивСтрокДляУдаления Цикл
		КоллекцияПечатныхФорм.Удалить(ПечатнаяФорма);
	КонецЦикла;
	
	Возврат КоллекцияПечатныхФорм;
	
КонецФункции  

Функция ПолучитьКлючиАналитикиНоменклатуры() Экспорт 
	// Допустимо переопределять запрос для фильтра по нужной номенклатуре
	ИспользуемыеТоварныеПоляМассив = вмс_ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля(); 
	
	ИндексТовара =  ИспользуемыеТоварныеПоляМассив.Найти("Товар");
	Если ИндексТовара <> Неопределено Тогда
		ИспользуемыеТоварныеПоляМассив.Удалить(ИндексТовара);
	КонецЕсли;
	
	// ТУ_Кошелев 07.03.24 Качество удаляется, не используется в штрихкодах
	ИндексКачества =  ИспользуемыеТоварныеПоляМассив.Найти("Качество");
	Если ИндексКачества <> Неопределено Тогда
		ИспользуемыеТоварныеПоляМассив.Удалить(ИндексКачества);
	КонецЕсли;
	
	ИспользуемыеТоварныеПоляМассив.Добавить("Артикул");
	ИспользуемыеТоварныеПоляМассив.Добавить("Штрихкод");

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура КАК Товар,
	|	КлючиАналитикиУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	КлючиАналитикиУчетаНоменклатуры.Серия КАК Серия,
	|	КлючиАналитикиУчетаНоменклатуры.Назначение КАК Партия,
	|	ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка) КАК Контейнер,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
	|	"""" КАК Штрихкод
	|ПОМЕСТИТЬ КлючиУчета
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|ГДЕ
	|	КлючиАналитикиУчетаНоменклатуры.ПометкаУдаления = ЛОЖЬ

	|СГРУППИРОВАТЬ ПО
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура,
	|	КлючиАналитикиУчетаНоменклатуры.Характеристика,
	|	КлючиАналитикиУчетаНоменклатуры.Серия,
	|	КлючиАналитикиУчетаНоменклатуры.Назначение
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ШтрихкодыРасширенный.Номенклатура КАК Товар,
	|	вмс_ШтрихкодыРасширенный.Характеристика КАК Характеристика,
	|	вмс_ШтрихкодыРасширенный.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА вмс_ШтрихкодыРасширенный.Часть = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		ИНАЧЕ вмс_ШтрихкодыРасширенный.Часть
	|	КОНЕЦ КАК Часть,
	|	вмс_ШтрихкодыРасширенный.Контейнер КАК Контейнер,
	|	вмс_ШтрихкодыРасширенный.Упаковка КАК Упаковка,
	|	вмс_ШтрихкодыРасширенный.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ШК_ВМС
	|ИЗ
	|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК вмс_ШтрихкодыРасширенный

	|СГРУППИРОВАТЬ ПО
	|	вмс_ШтрихкодыРасширенный.Номенклатура,
	|	вмс_ШтрихкодыРасширенный.Характеристика,
	|	вмс_ШтрихкодыРасширенный.Серия,
	|	ВЫБОР
	|		КОГДА вмс_ШтрихкодыРасширенный.Часть = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		ИНАЧЕ вмс_ШтрихкодыРасширенный.Часть
	|	КОНЕЦ,
	|	вмс_ШтрихкодыРасширенный.Контейнер,
	|	вмс_ШтрихкодыРасширенный.Упаковка,
	|	вмс_ШтрихкодыРасширенный.Штрихкод
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Товар,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Часть,
	|	ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка) КАК Контейнер,
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ШтрихкодыУчетки
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючиУчета.Товар КАК Товар, 
	|	КлючиУчета.Товар.Артикул КАК Артикул,
	|	КлючиУчета.Характеристика КАК Характеристика,
	|	КлючиУчета.Серия КАК Серия,
	|	КлючиУчета.Часть КАК Часть,
	|	КлючиУчета.Контейнер КАК Контейнер,
	|	КлючиУчета.Упаковка КАК Упаковка,
	|	КлючиУчета.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	КлючиУчета КАК КлючиУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ШК_ВМС КАК ШК_ВМС
	|		ПО КлючиУчета.Товар = ШК_ВМС.Товар
	|			И КлючиУчета.Характеристика = ШК_ВМС.Характеристика
	|			И КлючиУчета.Серия = ШК_ВМС.Серия
	|			И КлючиУчета.Часть = ШК_ВМС.Часть
	|			И КлючиУчета.Контейнер = ШК_ВМС.Контейнер
	|			И КлючиУчета.Упаковка = ШК_ВМС.Упаковка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрихкодыУчетки КАК ШтрихкодыУчетки
	|		ПО КлючиУчета.Товар = ШтрихкодыУчетки.Товар
	|			И КлючиУчета.Характеристика = ШтрихкодыУчетки.Характеристика
	|			И КлючиУчета.Серия = ШтрихкодыУчетки.Серия
	|			И КлючиУчета.Часть = ШтрихкодыУчетки.Часть
	|			И КлючиУчета.Контейнер = ШтрихкодыУчетки.Контейнер
	|			И КлючиУчета.Упаковка = ШтрихкодыУчетки.Упаковка
	|ГДЕ
	|	ШК_ВМС.Штрихкод ЕСТЬ NULL
	|	И ШтрихкодыУчетки.Штрихкод ЕСТЬ NULL

	|ОБЪЕДИНИТЬ ВСЕ

	|ВЫБРАТЬ
	|	ШК_ВМС.Товар, 
	|	ШК_ВМС.Товар.Артикул КАК Артикул,
	|	ШК_ВМС.Характеристика,
	|	ШК_ВМС.Серия,
	|	ШК_ВМС.Часть,
	|	ШК_ВМС.Контейнер,
	|	ШК_ВМС.Упаковка,
	|	ШК_ВМС.Штрихкод
	|ИЗ
	|	ШК_ВМС КАК ШК_ВМС

	|ОБЪЕДИНИТЬ ВСЕ

	|ВЫБРАТЬ
	|	ШтрихкодыУчетки.Товар,
	|	ШтрихкодыУчетки.Товар.Артикул КАК Артикул,
	|	ШтрихкодыУчетки.Характеристика,
	|	ШтрихкодыУчетки.Серия,
	|	ШтрихкодыУчетки.Часть,
	|	ШтрихкодыУчетки.Контейнер,
	|	ШтрихкодыУчетки.Упаковка,
	|	ШтрихкодыУчетки.Штрихкод
	|ИЗ
	|	ШтрихкодыУчетки КАК ШтрихкодыУчетки
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.Товар КАК Товар"; 
	
	Для Каждого ИмяПоля Из ИспользуемыеТоварныеПоляМассив Цикл
		ТекстЗапроса = ТекстЗапроса + "," + Символы.ПС + "	ИтоговаяТаблица." + ИмяПоля + " КАК " + ИмяПоля;	
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтоговаяТаблица.Товар";
	Для Каждого ИмяПоля Из ИспользуемыеТоварныеПоляМассив Цикл
		ТекстЗапроса = ТекстЗапроса + "," + Символы.ПС + "ИтоговаяТаблица." + ИмяПоля;	
	КонецЦикла; 
	
	ТекстЗапроса = ТекстЗапроса + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	Товар";
	Для Каждого ИмяПоля Из ИспользуемыеТоварныеПоляМассив Цикл
		ТекстЗапроса = ТекстЗапроса + "," + Символы.ПС + ИмяПоля;	
	КонецЦикла;  
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "АВТОУПОРЯДОЧИВАНИЕ";

	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
		
КонецФункции

Функция ПолучитьИменаРаспоряжений() Экспорт
	Результат = Новый Структура;  
	
	Результат.Вставить("Поступление", Новый Массив);
	Результат.Вставить("Гибрид", Новый Массив);
	Результат.Вставить("Выбытие", Новый Массив);    
	
	//Дополнительные
	Результат.Поступление.Добавить("Документ.ОприходованиеИзлишковТоваров");
	Результат.Поступление.Добавить("Документ.ПриходныйОрдерНаТовары");  
	
	Результат.Выбытие.Добавить("Документ.РасходныйОрдерНаТовары");
	Результат.Выбытие.Добавить("Документ.СписаниеНедостачТоваров");
	
	// Из определяемых типов РаспоряжениеНаПоступление, РаспоряжениеНаОтгрузку
	Результат.Поступление.Добавить("Документ.ВозвратТоваровОтКлиента");
	Результат.Поступление.Добавить("Документ.ЗаказПоставщику");     
	Результат.Поступление.Добавить("Документ.ПоступлениеТоваровОтХранителя");           
	Результат.Поступление.Добавить("Документ.ПриемкаТоваровНаХранение");
	Результат.Поступление.Добавить("Документ.ПриобретениеТоваровУслуг");
	Результат.Поступление.Добавить("Документ.ПрочееОприходованиеТоваров"); 
	
	Результат.Гибрид.Добавить("Документ.АктОРасхожденияхПослеПеремещения"); //Не тестировалось, т.к. не заполняется ТЧ в 1С, сделал запросы по аналогии с АктОРасхожденияхПослеПриемки, который имеет похожую структуру
	Результат.Гибрид.Добавить("Документ.АктОРасхожденияхПослеОтгрузки");
	Результат.Гибрид.Добавить("Документ.АктОРасхожденияхПослеПриемки");
	Результат.Гибрид.Добавить("Документ.ЗаказНаПеремещение");
	Результат.Гибрид.Добавить("Документ.ЗаказНаСборку");  
	Результат.Гибрид.Добавить("Документ.ЗаявкаНаВозвратТоваровОтКлиента");
	Результат.Гибрид.Добавить("Документ.ПеремещениеТоваров");        
	Результат.Гибрид.Добавить("Документ.СборкаТоваров"); 

	Результат.Выбытие.Добавить("Документ.ВнутреннееПотреблениеТоваров");	 // Один документ, разные версии УТ11
	Результат.Выбытие.Добавить("Документ.ВнутреннееПотребление");			 // Один документ, разные версии УТ11
	Результат.Выбытие.Добавить("Документ.ВозвратТоваровПоставщику");
	Результат.Выбытие.Добавить("Документ.ЗаказКлиента");
	Результат.Выбытие.Добавить("Документ.ЗаказНаВнутреннееПотребление");
	Результат.Выбытие.Добавить("Документ.ОтгрузкаТоваровСХранения");
	Результат.Выбытие.Добавить("Документ.ПередачаТоваровХранителю");
	Результат.Выбытие.Добавить("Документ.РеализацияТоваровУслуг"); 
	
	Возврат Результат;
КонецФункции

//@skip-check module-unused-method
Функция ПолучитьСоответствияИменСправочников() Экспорт
	// Адаптация не требуется
	Возврат Новый Структура;
КонецФункции   

Функция ПолучитьДокументыСНесколькимиТЧ() Экспорт
	РК = вмс_РаботаСКоллекциями;
	
	Результат = Новый Соответствие;
	Результат.Вставить("Документ.ЗаявкаНаВозвратТоваровОтКлиента", Новый Структура("Поступление, Выбытие", РК.СтрокуВМассив("ВозвращаемыеТовары"), РК.СтрокуВМассив("ЗаменяющиеТовары")));
	Возврат Результат;
КонецФункции

// Функция определяет существует ли реквизит у формы.
//
Функция ЕстьРеквизитОбъекта(Объект, ИмяРеквизита) Экспорт
	
	пКлючУникальности   = Новый УникальныйИдентификатор;

	СтруктураРеквизита = Новый Структура(ИмяРеквизита, пКлючУникальности);

	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> пКлючУникальности;
	
КонецФункции

Функция ИмяПараметраШтрихкод() Экспорт
	
	Возврат "Штрихкод";
	
КонецФункции

Функция ИмяПараметраШтрихкодСправкиБ() Экспорт
	
	Возврат "ШтрихСправкиБ";
	
КонецФункции



#КонецОбласти

#Область ПАРАМЕТРЫ_УЧЕТА




Функция ПолучитьИспользованиеХарактеристикТоваровИПолучитьВладельцаДляВыбора(ВходящиеДанные) Экспорт
	
	Возврат Справочники.Номенклатура.ПроверитьИспользованиеХарактеристикИПолучитьВладельцаДляВыбора(ВходящиеДанные.Товар, ВходящиеДанные.ВладелецХарактеристики);
		
КонецФункции

Функция ОпределитьМаркируемыеТовары(Товары) Экспорт
	
	//3.2.5
	ВызватьИсключение "Адаптация: Определение маркируемых товаров не поддерживается в текущей конфигурации";

	//ОсобенностиУчетаНоменклатурыМаркировка = Новый Массив;
	////@skip-check unknown-method-property
	//СвязьОсобенностейУчетаИФО = Перечисления.ОсобенностиУчетаНоменклатуры.СвязьОсобенностейУчетаИФО();
	//Для Каждого ЭлементСвязьОсобенностейУчетаИФО Из СвязьОсобенностейУчетаИФО Цикл
	//	
	//	Если ЭлементСвязьОсобенностейУчетаИФО.Значение = "ВестиУчетМаркируемойПродукцииИСМП" Тогда
	//		
	//		ОсобенностиУчетаНоменклатурыМаркировка.Добавить(ЭлементСвязьОсобенностейУчетаИФО.Ключ);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	Номенклатура.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|ГДЕ
	//|	Номенклатура.ВидНоменклатуры.ОсобенностьУчета В(&ОсобенностиУчетаНоменклатурыМаркировка)
	//|	И Номенклатура.Ссылка В ИЕРАРХИИ(&Товары)";
	//Запрос.УстановитьПараметр("Товары", Товары);
	//Запрос.УстановитьПараметр("ОсобенностиУчетаНоменклатурыМаркировка", ОсобенностиУчетаНоменклатурыМаркировка);
	//РезультатЗапроса = Запрос.Выполнить();
	//МаркируемыеТовары = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	//
	//Возврат МаркируемыеТовары;
	
КонецФункции

Функция ПолучитьВидыТоваров(Товары) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	Номенклатура.ВидНоменклатуры КАК ВидТовара
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&Товары)";
	Запрос.УстановитьПараметр("Товары", Товары);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаВидыНоменклатуры = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаВидыНоменклатуры;
	
КонецФункции

// ТУ_Самойленко 28.02.23 ++
Функция ПолучитьДинамическиеПараметрыНоменклатуры(ПараметрыОтбора) Экспорт
		
	// ТУ_Мовчан 06.06.23 ++
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Номенклатура КАК Товар,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Назначение КАК Партия,
	|	Таблица.Серия КАК Серия,
	|	НЕОПРЕДЕЛЕНО КАК УчетныйПараметр1,
	|	НЕОПРЕДЕЛЕНО КАК УчетныйПараметр2
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаНоменклатуры КАК Таблица
	|ГДЕ
	|	Таблица.Номенклатура = &Товар
	| 	И &ДопОтбор 
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика,
	|	Таблица.Назначение,
	|	Таблица.Серия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Таблица.Назначение УБЫВ";
	
	ДопОтбор = "";
	
	Для каждого Строка Из ПараметрыОтбора Цикл	
		Если Строка.Ключ <> "Товар" Тогда
			ДопОтбор = ДопОтбор + "
			|	И Таблица." + Строка.Ключ + " = &" + Строка.Ключ;
		КонецЕсли;
		
		Запрос.УстановитьПараметр(Строка.Ключ, Строка.Значение);
	КонецЦикла;     
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ДопОтбор", ДопОтбор);  
	// ТУ_Мовчан 06.06.23 --
	ТаблицаВозможных = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаВозможных;
	
КонецФункции

Функция ПолучитьСтатическиеПараметрыНоменклатуры() Экспорт

	ТаблицаВозможных = Новый ТаблицаЗначений;
	ТаблицаВозможных.Колонки.Добавить("Качество");
	
	ИндексКачествоТовара = 0;
	Пока ИндексКачествоТовара < Перечисления.вмс_КачествоТовара.Количество() Цикл
		Строка = ТаблицаВозможных.Добавить();
		Строка.Качество = Перечисления.вмс_КачествоТовара.Получить(ИндексКачествоТовара);
		ИндексКачествоТовара = ИндексКачествоТовара + 1;
	КонецЦикла;
	
	Возврат ТаблицаВозможных;

КонецФункции
// ТУ_Самойленко 28.02.23 --

// ТУ_Самойленко 30.03.23 ++
Функция ПолучитьТипыДанныхКонфигурации(ТипыДанных) Экспорт

	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Партия", "Справочник.Назначения");
	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Характеристика", "Справочник.ХарактеристикиНоменклатуры");
	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Серия", "Справочник.СерииНоменклатуры");
	
КонецФункции
// ТУ_Самойленко 30.03.23 --  

// ТУ_Кулалаев+
Функция ПолучитьЕдиницыИзмеренияТоваров(Строки) Экспорт
	
	Текст = 
	"ВЫБРАТЬ	
	|   *	
	|ПОМЕСТИТЬ ТоварыДокумента
	|ИЗ
	|   &Строки КАК ТоварыДокумента 
	|;
	|//////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
	|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Числитель, 1) / ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Знаменатель, 1) КАК Коэффициент
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					ТоварыДокумента.Товар
	|				ИЗ
	|					ТоварыДокумента КАК Таблица)
	|";
	
	Запрос = Новый Запрос(Текст);
	
	// Установка параметров.
	Запрос.УстановитьПараметр("Строки", Строки);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции
// ТУ_Кулалаев- 

// ТУ_Прошин_20.06.23++
Функция ПолучитьСписокТоваровПоВводуСтроки(Текст) Экспорт       
		Запрос = Новый Структура("Текст, Параметры");
		ЗапросТекст =
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	Номенклатура.Ссылка КАК Товар,
		|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|   Неопределено КАК ПредставлениеТовара
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО (Номенклатура.ВидНоменклатуры = ХарактеристикиНоменклатуры.Владелец
		|				ИЛИ Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец)
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ";   
		
		МассивПоиска = СтрРазделить(Текст, " ");
		Для каждого ЧастьСтроки Из МассивПоиска Цикл
			ЗапросТекст = ЗапросТекст + 
			"  И СТРНАЙТИ(Номенклатура.Ссылка.Код +"" ""+Номенклатура.Ссылка.Артикул +"" ""+Номенклатура.Ссылка.Наименование +"" ""+ ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка.Наименование, """"), """+ЧастьСтроки+""") >= 1"; 
		КонецЦикла;
		
		Запрос.Текст = ЗапросТекст;              
		Запрос.Параметры = Новый Структура("",); 
		Возврат Запрос;
КонецФункции
// ТУ_Прошин_20.06.23--

// ТУ_Самойленко 04.07.23 ++ [Блокировка ячеек]
Функция ПолучитьВладельцаЯчейки(ИзначальныйВладелец) Экспорт
	
	Возврат ИзначальныйВладелец;
	
КонецФункции
// ТУ_Самойленко 04.07.23 -- [Блокировка ячеек]

// ТУ_Кошелев 17.08.2023++
Функция ПривязатьФотографиюКНоменклатуре(Номенклатура, ХранилищеФайла) Экспорт 
	
	ДвоичныеДанные = ХранилищеФайла.Получить();
	АдресВременноеХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	// Создание карточки Файла в базе данных.
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.ВладелецФайлов = Номенклатура;
	ПараметрыФайла.ИмяБезРасширения = Строка(Номенклатура);
	ПараметрыФайла.РасширениеБезТочки = "jpg";
	ПараметрыФайла.ВремяИзмененияУниверсальное = ТекущаяДата(); 
	
	НачатьТранзакцию();
	
	Попытка	
		ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(
		ПараметрыФайла,
		АдресВременноеХранилище); 
		
		обНоменклатура = Номенклатура.ПолучитьОбъект();
		обНоменклатура.ФайлКартинки = ПрисоединенныйФайл;
		обНоменклатура.Записать(); 
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Возврат Ложь;		
	КонецПопытки;
		
	Возврат Истина;
		
КонецФункции
// ТУ_Кошелев 17.08.2023--



#КонецОбласти

Функция ИмяРеквизитаНоменклатурыВид() Экспорт
	
	Возврат "ВидНоменклатуры";
	
КонецФункции

Функция ПолучитьИмяТипаНоменклатурыТовар() Экспорт
	Возврат Неопределено;
КонецФункции
