
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	ЗаполнитьСпискиВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗавершитьРедактирование", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда, ДопПараметры = Неопределено) Экспорт
	
	Если НЕ ПроверитьЗаполнение()
		Или НЕ ПроверитьЗаполнениеРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	ЭтаФорма.ОповеститьОВыборе(НастройкиСортировкиПоКонтекстуФормы());
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиСортировки

&НаКлиенте
Процедура НастройкиСортировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ВсегоПараметров = МодульКлиента().КоличествоПараметровСортировкиЭтикеток();
	Если НастройкиСортировки.Количество() >= ВсегоПараметров Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru='Превышено доступное количество полей сортировки. Максимум 3.'");
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	Если НЕ Параметры.Свойство("НастройкиСортировкиЭтикеток") Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиСортировки.Очистить();
	
	ВсегоПараметров = МодульОбъекта().КоличествоПараметровСортировкиЭтикеток();
	НастройкиСортировкиЭтикеток = Параметры.НастройкиСортировкиЭтикеток;
	
	Для Сч = 1 По ВсегоПараметров Цикл
		
		ДопПараметрСортировки = НастройкиСортировкиЭтикеток["ПолеСортировкиЭтикеток" + Сч];
		НаправлениеДопПараметраСортировки = НастройкиСортировкиЭтикеток["НаправлениеСортировкиЭтикеток" + Сч];
		
		Если ЗначениеЗаполнено(ДопПараметрСортировки) Тогда
			
			НоваяСтр = НастройкиСортировки.Добавить();
			
			НоваяСтр.Поле = ДопПараметрСортировки;
			НоваяСтр.НаправлениеСортировки = НаправлениеДопПараметраСортировки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	ЗаполнитьСпискиВыбора_ПоляСортировки();
	ЗаполнитьСпискиВыбора_НаправленияСортировки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора_ПоляСортировки()
	
	СписокВыбора = Элементы.НастройкиСортировкиПоле.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ПоляСортировкиЭтикеток();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора_НаправленияСортировки()
	
	СписокВыбора = Элементы.НастройкиСортировкиНаправлениеСортировки.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_НаправленияСортировки();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	
	ЕстьОшибки = Ложь;
	
	ПроверитьУникальностьПолейСортировки(ЕстьОшибки);
	
	Возврат НЕ ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьУникальностьПолейСортировки(ЕстьОшибки)
	
	ШаблонОшибки = НСтр("ru = 'Удалите дублируемое поле сортировки: %1'");
	
	Для Каждого Стр Из НастройкиСортировки Цикл
		
		ИмяПоля = Стр.Поле;
		
		ПараметрыОтбора = Новый Структура("Поле", ИмяПоля);
		НайденныеСтроки = НастройкиСортировки.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 1 Тогда
			ТекстОшибки = МодульКлиента().ПараметрыВстроку(ШаблонОшибки, ИмяПоля);
			МодульКлиента().СообщитьОбОшибкеВСтрокеТабЧасти(ТекстОшибки
			, УникальныйИдентификатор, Элементы.НастройкиСортировкиПоле
			, "ВидПродукции", НастройкиСортировки.Индекс(Стр));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НастройкиСортировкиПоКонтекстуФормы()
	
	Результат = МодульКлиента().Новый_ПараметрыСортировкиЭтикеток();
	
	Для Сч = 1 По НастройкиСортировки.Количество() Цикл
		
		Стр = НастройкиСортировки[Сч - 1];
		
		Результат["ПолеСортировкиЭтикеток" + Сч] = Стр.Поле;
		Результат["НаправлениеСортировкиЭтикеток" + Сч] = Стр.НаправлениеСортировки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


