
//////////////////////////////////////////////////////////
//
//			Операции с ссылками+
//

Функция ПолучитьСсылкуИзКвазиСсылки(КвазиСсылка) Экспорт

	ИмяМенеджера = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьИмяМенеджераОбъектаПоИмениТипа(КвазиСсылка.ИмяТипа);
	Если ИмяМенеджера <> Неопределено Тогда
		Менеджер = Вычислить(ИмяМенеджера);
		МетаданныеСсылки = Метаданные.НайтиПоПолномуИмени(КвазиСсылка.ИмяТипа);
		Если Метаданные.Перечисления.Содержит(МетаданныеСсылки) Тогда
			Если МетаданныеСсылки.ЗначенияПеречисления.Найти(КвазиСсылка.GUID) = Неопределено Тогда
				Ссылка = Менеджер.ПустаяСсылка();
			Иначе	
				Ссылка = Менеджер[КвазиСсылка.GUID];
			КонецЕсли;
		Иначе
			Ссылка = Менеджер.ПолучитьСсылку(КвазиСсылка.GUID);
		КонецЕсли;
		Возврат Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ПреобразоватьКвазиСсылкиВСсылкиВМассивеСсылокНаЗначения(МассивСсылокНаКвазиСсылки) Экспорт
	
	Для Каждого СсылкаНаКвазиСсылку Из МассивСсылокНаКвазиСсылки Цикл
		СсылкаНаКвазиСсылку.Коллекция[СсылкаНаКвазиСсылку.ИмяПоля] = ПолучитьСсылкуИзКвазиСсылки(СсылкаНаКвазиСсылку.Значение);
	КонецЦикла;
	
КонецФункции

Функция ПолучитьКвазиСсылкуИзСсылки(Ссылка) Экспорт

	МетаДанныеСсылки = МетаДанные.НайтиПоТипу(ТипЗнч(Ссылка));
	ИмяТипа = МетаДанныеСсылки.ПолноеИмя();
	ПредставлениеСсылки = Строка(Ссылка);
	Возврат вмс_Обмен_с_КИС_КлиентСервер.НоваяКвазиСсылкаНаОбъект(ИмяТипа, Ссылка.УникальныйИдентификатор(), ПредставлениеСсылки);
	
КонецФункции

Функция ПолучитьКвазиСсылкуИБИзСсылки(Ссылка) Экспорт
	
	КвазиСсылка = ПолучитьКвазиСсылкуИзСсылки(Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КвазиСсылки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КвазиСсылки КАК КвазиСсылки
	|ГДЕ
	|	КвазиСсылки.ИмяТипа = &ИмяТипа
	|	И КвазиСсылки.GUID = &GUID";
	Запрос.УстановитьПараметр("ИмяТипа", КвазиСсылка.ИмяТипа);
	Запрос.УстановитьПараметр("GUID", КвазиСсылка.GUID);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	КвазиСсылкаИБ = Справочники.КвазиСсылки.СоздатьЭлемент();
	КвазиСсылкаИБ.Заполнить(Неопределено);
	ЗаполнитьЗначенияСвойств(КвазиСсылкаИБ, КвазиСсылка);
	КвазиСсылкаИБ.Наименование = КвазиСсылка.Представление;
	КвазиСсылкаИБ.Записать();
	
	Возврат КвазиСсылкаИБ.Ссылка;
	
КонецФункции

Функция ПреобразоватьСсылкиИБВКвазиСсылкиВМассивеСсылокНаЗначения(МассивСсылокНаЗначения) Экспорт
	
	МассивСсылокНаКвазиСсылки = Новый Массив;
	
	Если МассивСсылокНаЗначения.Количество() = 0 Тогда
		Возврат МассивСсылокНаКвазиСсылки;
	КонецЕсли;
	
	КэшМетаДанных = Новый Соответствие;
	
	Для Каждого СсылкаНаЗначение Из МассивСсылокНаЗначения Цикл
		СсылкаИБ = СсылкаНаЗначение.Значение;
		ТипСсылки = ТипЗнч(СсылкаИБ);
		ДанныеТипа = КэшМетаДанных[ТипСсылки];
		Если ДанныеТипа = Неопределено Тогда
			МетаДанныеСсылки = МетаДанные.НайтиПоТипу(ТипСсылки);
			ДанныеТипа = Новый Структура;
			ДанныеТипа.Вставить("МетаДанные", МетаДанныеСсылки);
			Если МетаДанныеСсылки <> Неопределено Тогда
				ДанныеТипа.Вставить("ЭтоПеречисление", МетаДанные.Перечисления.Содержит(МетаДанныеСсылки));
				ДанныеТипа.Вставить("ПолноеИмя", МетаДанныеСсылки.ПолноеИмя());
			КонецЕсли;
			КэшМетаДанных[ТипСсылки] = ДанныеТипа;
		КонецЕсли;
		
		Если ДанныеТипа.МетаДанные <> Неопределено Тогда
			Если ДанныеТипа.ЭтоПеречисление Тогда
				КвазиСсылка = вмс_Обмен_с_КИС_КлиентСервер.НоваяКвазиСсылкаНаОбъект(ДанныеТипа.ПолноеИмя, XMLСтрока(СсылкаИБ), Строка(СсылкаИБ));
			Иначе
				КвазиСсылка = вмс_Обмен_с_КИС_КлиентСервер.НоваяКвазиСсылкаНаОбъект(ДанныеТипа.ПолноеИмя, СсылкаИБ.УникальныйИдентификатор(), Строка(СсылкаИБ));
			КонецЕсли;
			вмс_РаботаСКоллекциями.УстановитьЗначениеПоСсылкеНаЗначение(СсылкаНаЗначение, КвазиСсылка);
			МассивСсылокНаКвазиСсылки.Добавить(СсылкаНаЗначение);
		КонецЕсли; 
	КонецЦикла;
	
	Возврат МассивСсылокНаКвазиСсылки;
	
КонецФункции

Функция ПолучитьМассивСсылокНаСсылкиИБВДанных(Данные) Экспорт
	
	МассивСсылокНаЗначения = вмс_РаботаСКоллекциями.РазложитьСтруктуруДанныхВМассивСсылокНаЗначения(Данные);
	МассивСсылокНаСсылкиИБ = Новый Массив;
	Для Каждого СсылкаНаЗначение Из МассивСсылокНаЗначения Цикл
		Если вмс_ОбщегоНазначенияВызовСервера.ЭтоЗначениеСсылочногоТипа(СсылкаНаЗначение.Значение) Тогда
			МассивСсылокНаСсылкиИБ.Добавить(СсылкаНаЗначение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСсылокНаСсылкиИБ;

КонецФункции

Функция ПолучитьМассивСсылокИБВДанных(Данные) Экспорт
	
	Возврат вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(ПолучитьМассивСсылокНаСсылкиИБВДанных(Данные), "Значение");
	
КонецФункции

Функция НоваяТаблицаКвазиСсылок() Экспорт

	ТаблицаКвазиСсылок = Новый ТаблицаЗначений;
	ТаблицаКвазиСсылок.Колонки.Добавить("ИмяТипа", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТаблицаКвазиСсылок.Колонки.Добавить("GUID", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаКвазиСсылок.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаКвазиСсылок.Колонки.Добавить("Представление");
	ТаблицаКвазиСсылок.Колонки.Добавить("КвазиСсылкаИБ");
	
	Возврат ТаблицаКвазиСсылок;
	
КонецФункции

Функция ПолучитьКвазиСсылкиИБПоТаблицеКвазиСсылок(ТаблицаКвазиСсылок) Экспорт

	ПоляПоиска = "ИмяТипа, GUID, Имя";
	Поиск = Новый Структура(ПоляПоиска);

	ТаблицаКвазиСсылокПараметр = ТаблицаКвазиСсылок.Скопировать();
	ТаблицаКвазиСсылокПараметр.Свернуть(ПоляПоиска);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаКвазиСсылок", ТаблицаКвазиСсылокПараметр);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаКвазиСсылок.ИмяТипа КАК ИмяТипа,
	|	ТаблицаКвазиСсылок.GUID КАК GUID,
	|	ТаблицаКвазиСсылок.Имя КАК Имя
	|ПОМЕСТИТЬ ТаблицаКвазиСсылок
	|ИЗ
	|	&ТаблицаКвазиСсылок КАК ТаблицаКвазиСсылок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКвазиСсылок.ИмяТипа КАК ИмяТипа,
	|	ТаблицаКвазиСсылок.GUID КАК GUID,
	|	ТаблицаКвазиСсылок.Имя КАК Имя,
	|	КвазиСсылки.Ссылка КАК Ссылка,
	|	КвазиСсылки.Наименование КАК Наименование
	|ИЗ
	|	ТаблицаКвазиСсылок КАК ТаблицаКвазиСсылок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КвазиСсылки КАК КвазиСсылки
	|		ПО ТаблицаКвазиСсылок.ИмяТипа = КвазиСсылки.ИмяТипа
	|			И ТаблицаКвазиСсылок.GUID = КвазиСсылки.GUID
	|			И ТаблицаКвазиСсылок.Имя = КвазиСсылки.Имя";
	
	НачатьТранзакцию();
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаКвазиСсылокИБ = РезультатЗапроса.Выгрузить();
	ТаблицаКвазиСсылокИБ.Индексы.Добавить(ПоляПоиска);
	
	Для Каждого СтрокаКвазиСсылки Из ТаблицаКвазиСсылок Цикл
		ЗаполнитьЗначенияСвойств(Поиск, СтрокаКвазиСсылки);
		НайденныеКвазиСсылкиИБ = ТаблицаКвазиСсылокИБ.НайтиСтроки(Поиск);
		Если НайденныеКвазиСсылкиИБ.Количество() > 0 Тогда
			НайденнаяКвазиСсылкаИБ = НайденныеКвазиСсылкиИБ[0];
			КвазиСсылкаИБ = НайденнаяКвазиСсылкаИБ.Ссылка;
			Представление = СтрокаКвазиСсылки.Представление;
			Если Представление <> Неопределено И НайденнаяКвазиСсылкаИБ.Наименование <> Представление Тогда
				//обновить представление
				ЭлементКвазиСслыкаИБ = КвазиСсылкаИБ.ПолучитьОбъект();
				ЭлементКвазиСслыкаИБ.Наименование = Представление;
				ЭлементКвазиСслыкаИБ.Записать();
			КонецЕсли;
		Иначе
			ЭлементКвазиСслыкаИБ = Справочники.КвазиСсылки.СоздатьЭлемент();
			ЭлементКвазиСслыкаИБ.Заполнить(Неопределено);
			ЗаполнитьЗначенияСвойств(ЭлементКвазиСслыкаИБ, СтрокаКвазиСсылки);
			ЭлементКвазиСслыкаИБ.Наименование = СтрокаКвазиСсылки.Представление; 
			ЭлементКвазиСслыкаИБ.ОбменДанными.Загрузка = Истина;
			ЭлементКвазиСслыкаИБ.Записать();
			СтрокаКвазиСсылкиИБ = ТаблицаКвазиСсылокИБ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКвазиСсылкиИБ, ЭлементКвазиСслыкаИБ);
			КвазиСсылкаИБ = ЭлементКвазиСслыкаИБ.Ссылка;
		КонецЕсли;
		
		СтрокаКвазиСсылки.КвазиСсылкаИБ = КвазиСсылкаИБ;
		
	КонецЦикла; 
	ЗафиксироватьТранзакцию();

КонецФункции

//
//			Операции с ссылками-
//
//////////////////////////////////////////////////////////

Функция ПреобразоватьДанныеПослеПолучения(Данные) Экспорт
	
	РК = вмс_РаботаСКоллекциями;

	КонтейнерДанных = Новый Массив;
	КонтейнерДанных.Добавить(Данные);

	ДополнительныеПараметрыРазложенияДанных = Новый Структура;
	МассивСсылокНаЗначения = РК.РазложитьСтруктуруДанныхВМассивСсылокНаЗначения(КонтейнерДанных, ДополнительныеПараметрыРазложенияДанных);
    МассивСсылокНаКвазиСсылки = ДополнительныеПараметрыРазложенияДанных.МассивСсылокНаКвазиСсылки;
	
	ПреобразоватьКвазиСсылкиВСсылкиВМассивеСсылокНаЗначения(МассивСсылокНаКвазиСсылки);
	
	РК.ЗаменитьКлючиСоответствий(ДополнительныеПараметрыРазложенияДанных.МассивЗаменКлючейСоответствий);
	
	Данные = КонтейнерДанных[0];

КонецФункции

Функция ПреобразоватьДанныеПередОтправкой(Данные) Экспорт

	РК = вмс_РаботаСКоллекциями;
	
	КонтейнерДанных = Новый Массив;
	КонтейнерДанных.Добавить(Данные);
	
	ДополнительныеПараметрыРазложенияДанных = Новый Структура;
	МассивСсылокНаЗначения = РК.РазложитьСтруктуруДанныхВМассивСсылокНаЗначения(КонтейнерДанных, ДополнительныеПараметрыРазложенияДанных);
	
	МассивСсылокНаТаблицы = ДополнительныеПараметрыРазложенияДанных.МассивСсылокНаТаблицы;
	Для Каждого СсылкаНаТаблицу Из МассивСсылокНаТаблицы Цикл
		РК.РазтипизироватьТаблицуЗначений(СсылкаНаТаблицу.Значение);
	КонецЦикла;
	
	ПреобразоватьСсылкиИБВКвазиСсылкиВМассивеСсылокНаЗначения(МассивСсылокНаЗначения);
	
	РК.ЗаменитьКлючиСоответствий(ДополнительныеПараметрыРазложенияДанных.МассивЗаменКлючейСоответствий);
	
	Данные = КонтейнерДанных[0];

КонецФункции

Функция ТестовыйМетод(Параметр) Экспорт
	Возврат "Ты передал """ + Параметр + """";
КонецФункции

Функция ПолучитьКодНовогоУзлаОбмена()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МобильныйОбмен.Код КАК Код
	|ИЗ
	|	ПланОбмена.МобильныйОбмен КАК МобильныйОбмен";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		НовыйКод = "1";
	Иначе
		ТаблицаКодов = РезультатЗапроса.Выгрузить();
		ТаблицаКодов.Колонки.Добавить("Порядок");
		Нули = "";
		ДлинаКода = Метаданные.ПланыОбмена.МобильныйОбмен.ДлинаКода;
		Для НомерНуля=1 По ДлинаКода Цикл
			Нули = Нули + "0";
		КонецЦикла;
		
		Для Каждого СтрокаКода Из ТаблицаКодов Цикл
			СтрокаКода.Порядок = Прав(Нули+СтрокаКода.Код, ДлинаКода);
		КонецЦикла;
		ТаблицаКодов.Сортировать("Порядок УБЫВ");
		Код = ТаблицаКодов[0].Код;
		КодЧисло = Число(Код);
		НовыйКодЧисло = КодЧисло + 1;
		НовыйКод = Формат(НовыйКодЧисло, "ЧГ=0");
	КонецЕсли;
	
	Возврат НовыйКод;
	
КонецФункции

Функция ЗарегистрироватьНовыйУзелОбмена(ИмяУзла, КодУзла) Экспорт
	
	Перем Узел, НовыйКодУзла;
	
	НачатьТранзакцию();
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.МобильныйОбмен");
	Блокировка.Заблокировать();
	Если ЗначениеЗаполнено(КодУзла) Тогда
		Узел = ПланыОбмена.МобильныйОбмен.НайтиПоКоду(КодУзла);
		Если ЗначениеЗаполнено(Узел) Тогда
			СоздатьУзел = Ложь;
		Иначе
			// узел по каким-то причинам удален из основной базы
			НовыйКодУзла = КодУзла;
			СоздатьУзел = Истина;
		КонецЕсли;
	Иначе
		НовыйКодУзла = ПолучитьКодНовогоУзлаОбмена();
		СоздатьУзел = Истина;
	КонецЕсли;
	
	Если СоздатьУзел Тогда  
		
		// Кулалаев Е.С + 03.07.2023 17:43:35
		// Использую выборку, потому что на старых клиентах может быть много старых баз.
		//Выборка = ПланыОбмена.МобильныйОбмен.Выбрать(Новый Структура("Наименование", ИмяУзла));	
		//Пока Выборка.Следующий() Цикл
		//	СтарыйУзел = Выборка.Ссылка.ПолучитьОбъект();  
		//	СтарыйУзел.Удалить(); // ( ͡° ͜ʖ ͡°)
		//КонецЦикла;
		// Кулалаев Е.С -
				
		НовыйУзел = ПланыОбмена.МобильныйОбмен.СоздатьУзел();
		НовыйУзел.Заполнить(Неопределено);
		НовыйУзел.Код = НовыйКодУзла;
		НовыйУзел.Наименование = ИмяУзла;
		НовыйУзел.Записать();
	КонецЕсли;  
	
	ЗафиксироватьТранзакцию();
	
	Возврат НовыйКодУзла;
	
КонецФункции

Функция ЗарегистрироватьОбъектДляОбмена(Объект) Экспорт

	Если ТипЗнч(Объект) = Тип("УдалениеОбъекта") Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(ПолучитьУзлыДляОбмена(), Объект);
		Возврат Истина;
	КонецЕсли;
	
	Если вмс_ОбщегоНазначенияВызовСервера.ЭтоОбъектИБ(Объект) Тогда
		СсылкаОбъекта = Объект.Ссылка;
		Если ЗначениеЗаполнено(СсылкаОбъекта) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(ПолучитьУзлыДляОбмена(), СсылкаОбъекта);
		Иначе
			Для Каждого Узел Из ПолучитьУзлыДляОбмена() Цикл
				Объект.ОбменДанными.Получатели.Добавить(Узел);
			КонецЦикла;
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;

	Если вмс_ОбщегоНазначенияВызовСервера.ЭтоСсылкаОбъектаИБ(Объект) Тогда
		СсылкаОбъекта = Объект;
		Если ЗначениеЗаполнено(СсылкаОбъекта) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(ПолучитьУзлыДляОбмена(), СсылкаОбъекта);
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьУзлыДляОбмена() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МобильныйОбмен.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.МобильныйОбмен КАК МобильныйОбмен
	|ГДЕ
	|	НЕ МобильныйОбмен.ЭтотУзел";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Узлы = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Узлы.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Узлы;
	
КонецФункции
