// Шаблон второго параметра обработчика команды.
//
// Возвращаемое значение:
//  Структура - вспомогательные параметры:
//   * ОписаниеКоманды - Структура - описание команды(см. ПодключаемыеКоманды.ТаблицаКоманд):
//    ** Идентификатор - Строка - идентификатор команды.
//    ** Представление - Строка - представление команды в форме.
//    ** ДополнительныеПараметры - Структура - дополнительные параметры команды.
//   * Форма - ФормаКлиентскогоПриложения - форма, из которой вызвана команда.
//   * ЭтоФормаОбъекта - Булево - Истина, если команда вызвана из формы объекта.
//   * Источник - ТаблицаФормы, ДанныеФормыСтруктура - объект или список формы с полем "Ссылка".
//
Функция ШаблонПараметровВыполненияКоманды() Экспорт
	Структура = Новый Структура("ОписаниеКоманды, Форма, Источник");
	Структура.Вставить("ЭтоФормаОбъекта", Ложь);
	Возврат Структура;
КонецФункции

// Возвращает описание команды по имени элемента формы.
Функция ОписаниеКоманды(ИмяКомандыВФорме, ТаблицаКоманд) Экспорт
	
	//Команды = ПолучитьИзВременногоХранилища(АдресНастроек);
	//Команда = Команды.Найти(ИмяКомандыВФорме, "ИмяВФорме");
	Команда = вмс_РаботаСКоллекциями.НайтиСтрокуКвазиТаблицыЗначений(ТаблицаКоманд, "ИмяВФорме", ИмяКомандыВФорме);
	Если Команда = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сведения о команде ""%1"" не найдены.'"),
			ИмяКомандыВФорме);
	КонецЕсли;
	//ОписаниеКоманды = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Команда);
	ОписаниеКоманды = вмс_РаботаСКоллекциями.СкопироватьСтруктуру(Команда);
	
	Если ЗначениеЗаполнено(ОписаниеКоманды.ИмяФормы) Тогда
		ОписаниеКоманды.Вставить("Серверная", Ложь);
		МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОписаниеКоманды.ИмяФормы, ".", Истина, Истина);
		КоличествоПодстрок = МассивПодстрок.Количество();
		Если КоличествоПодстрок = 1
			Или (КоличествоПодстрок = 2 И ВРег(МассивПодстрок[0]) <> "ОБЩАЯФОРМА") Тогда
			ОписаниеКоманды.ИмяФормы = ОписаниеКоманды.Менеджер + "." + ОписаниеКоманды.ИмяФормы;
		КонецЕсли;
	Иначе
		ОписаниеКоманды.Вставить("Серверная", Истина);
		Если ЗначениеЗаполнено(ОписаниеКоманды.Обработчик) Тогда
			Если Не ПустаяСтрока(ОписаниеКоманды.Менеджер) И СтрНайти(ОписаниеКоманды.Обработчик, ".") = 0 Тогда
				ОписаниеКоманды.Обработчик = ОписаниеКоманды.Менеджер + "." + ОписаниеКоманды.Обработчик;
			КонецЕсли;
			Если СтрНачинаетсяС(ВРег(ОписаниеКоманды.Обработчик), ВРег("ОбщийМодуль.")) Тогда
				ПозицияТочки = СтрНайти(ОписаниеКоманды.Обработчик, ".");
				ОписаниеКоманды.Обработчик = Сред(ОписаниеКоманды.Обработчик, ПозицияТочки + 1);
			КонецЕсли;
			МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОписаниеКоманды.Обработчик, ".", Истина, Истина);
			КоличествоПодстрок = МассивПодстрок.Количество();
			Если КоличествоПодстрок = 2 Тогда
				ИмяМодуля = МассивПодстрок[0];
				//ОбъектМетаданныхОбщийМодуль = Метаданные.ОбщиеМодули.Найти(ИмяМодуля);
				ОбъектМетаданныхОбщийМодуль = ОписаниеКоманды.ОбъектМетаданныхОбщийМодуль;
				Если ОбъектМетаданныхОбщийМодуль = Неопределено Тогда
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Общий модуль ""%1"" не найден.'"),
						ИмяМодуля);
				КонецЕсли;
				Если ОбъектМетаданныхОбщийМодуль.КлиентУправляемоеПриложение Тогда
					ОписаниеКоманды.Серверная = Ложь;
				КонецЕсли;
			Иначе
				Вид = ВРег(МассивПодстрок[0]);
				ВидВоМножественномЧисле = ВидОбъектаМетаданныхВоМножественномЧисле(Вид);
				Если ВидВоМножественномЧисле <> Неопределено Тогда
					МассивПодстрок.Установить(0, ВидВоМножественномЧисле);
					ОписаниеКоманды.Обработчик = СтрСоединить(МассивПодстрок, ".");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ОписаниеКоманды.Удалить("Менеджер");
	
	//Возврат Новый ФиксированнаяСтруктура(ОписаниеКоманды);
	Возврат ОписаниеКоманды;
	
КонецФункции

// Возвращает вид объекта во множественном числе.
Функция ВидОбъектаМетаданныхВоМножественномЧисле(Знач Вид)
	Вид = ВРег(СокрЛП(Вид));
	Если Вид = "ПЛАНОБМЕНА" Тогда
		Возврат "ПланыОбмена";
	ИначеЕсли Вид = "СПРАВОЧНИК" Тогда
		Возврат "Справочники";
	ИначеЕсли Вид = "ДОКУМЕНТ" Тогда
		Возврат "Документы";
	ИначеЕсли Вид = "ЖУРНАЛДОКУМЕНТОВ" Тогда
		Возврат "ЖурналыДокументов";
	ИначеЕсли Вид = "ПЕРЕЧИСЛЕНИЕ" Тогда
		Возврат "Перечисления";
	ИначеЕсли Вид = "ОТЧЕТ" Тогда
		Возврат "Отчеты";
	ИначеЕсли Вид = "ОБРАБОТКА" Тогда
		Возврат "Обработки";
	ИначеЕсли Вид = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Возврат "ПланыВидовХарактеристик";
	ИначеЕсли Вид = "ПЛАНСЧЕТОВ" Тогда
		Возврат "ПланыСчетов";
	ИначеЕсли Вид = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Возврат "ПланыВидовРасчета";
	ИначеЕсли Вид = "РЕГИСТРСВЕДЕНИЙ" Тогда
		Возврат "РегистрыСведений";
	ИначеЕсли Вид = "РЕГИСТРНАКОПЛЕНИЯ" Тогда
		Возврат "РегистрыНакопления";
	ИначеЕсли Вид = "РЕГИСТРБУХГАЛТЕРИИ" Тогда
		Возврат "РегистрыБухгалтерии";
	ИначеЕсли Вид = "РЕГИСТРРАСЧЕТА" Тогда
		Возврат "РегистрыРасчета";
	ИначеЕсли Вид = "ПЕРЕРАСЧЕТ" Тогда
		Возврат "Перерасчеты";
	ИначеЕсли Вид = "БИЗНЕСПРОЦЕСС" Тогда
		Возврат "БизнесПроцессы";
	ИначеЕсли Вид = "ЗАДАЧА" Тогда
		Возврат "Задачи";
	ИначеЕсли Вид = "КОНСТАНТА" Тогда
		Возврат "Константы";
	ИначеЕсли Вид = "ПОСЛЕДОВАТЕЛЬНОСТЬ" Тогда
		Возврат "Последовательности";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Шаблон таблицы подключаемых команд.
//
// Возвращаемое значение:
//   ТаблицаЗначений - см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.Команды
//
Функция ТаблицаКоманд() Экспорт
	Таблица = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений();
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Вид", Новый ОписаниеТипов("Строка"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Идентификатор", Новый ОписаниеТипов("Строка"));
	// Настройки внешнего вида:
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Представление", Новый ОписаниеТипов("Строка"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Подменю", Новый ОписаниеТипов("Строка"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Важность", Новый ОписаниеТипов("Строка"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Порядок", Новый ОписаниеТипов("Число"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Картинка"); // Картинка.
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "СочетаниеКлавиш"); // СочетаниеКлавиш.
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ОтображениеКнопки");
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ТолькоВоВсехДействиях", Новый ОписаниеТипов("Булево"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ПоложениеКнопкиВКоманднойПанели");
	// Настройки видимости и доступность:
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ТипПараметра"); // ОписаниеТипов.
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ВидимостьВФормах", Новый ОписаниеТипов("Строка"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Назначение", Новый ОписаниеТипов("Строка"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ФункциональныеОпции", Новый ОписаниеТипов("Строка"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "УсловияВидимости", Новый ОписаниеТипов("Массив"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ИзменяетВыбранныеОбъекты"); // Булево или Неопределено.
	// Настройки процесса выполнения:
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "МножественныйВыбор"); // Булево или Неопределено.
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "РежимЗаписи", Новый ОписаниеТипов("Строка"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ТребуетсяРаботаСФайлами", Новый ОписаниеТипов("Булево"));
	// Настройки обработчика:
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Менеджер", Новый ОписаниеТипов("Строка"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "Обработчик", Новый ОписаниеТипов("Строка"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ДополнительныеПараметры", Новый ОписаниеТипов("Структура"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ИмяФормы", Новый ОписаниеТипов("Строка"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ПараметрыФормы"); // Структура или Неопределено.
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ИмяПараметраФормы", Новый ОписаниеТипов("Строка"));
	// Служебные:
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ПорядокВажности", Новый ОписаниеТипов("Число"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ИмяВФорме", Новый ОписаниеТипов("Строка"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ЕстьУсловияВидимости", Новый ОписаниеТипов("Булево"));
	вмс_РаботаСКоллекциями.ДобавитьКолонкуКвазиТаблицыЗначений(Таблица, "ОбъектМетаданныхОбщийМодуль");
	
	Возврат Таблица;
КонецФункции

Функция ДобавитьОписаниеКоманды(Форма, ОписаниеКоманды, ТаблицаКоманд=Неопределено) Экспорт
	
#Если Клиент Тогда
	Если ТаблицаКоманд = Неопределено Тогда
		ТаблицаКоманд = вмс_ПодключаемыеКомандыКлиент.ПолучитьТаблицуОписанияКомандФормы(Форма);
	КонецЕсли;
#КонецЕсли
	
	Если ТаблицаКоманд = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяСтрока = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(ТаблицаКоманд, ОписаниеКоманды);
	
	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НоваяСтрока.Обработчик, ".", Истина, Истина);
	Если МассивПодстрок.Количество() = 2 Тогда
		ИмяМодуля = МассивПодстрок[0];
		ОбъектМетаданныхОбщийМодульСтруктура = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьОписаниеМетаДанныхОбъекта("ОбщийМодуль." + ИмяМодуля);
		Если ОбъектМетаданныхОбщийМодульСтруктура = Неопределено Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Общий модуль ""%1"" не найден.'"),
				ИмяМодуля);
		КонецЕсли;
		
		НоваяСтрока.ОбъектМетаданныхОбщийМодуль = ОбъектМетаданныхОбщийМодульСтруктура;
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции
