
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	
	Если Параметры.Свойство("ДокументыУчета") Тогда
		ДокументыУчета.ЗагрузитьЗначения(Параметры.ДокументыУчета);
	КонецЕсли;
	
	ЗаполнитьСписокОпераций();
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийФормы

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		МодульКлиента().ОткрытьФормуОперации(ТекущиеДанные.Операция, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийЭлементовФормы

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодписатьИОтправить(Команда)
	
	Для Каждого КонтекстОбмена Из КонтекстыОбменаИзСпискаОпераций() Цикл
		МодульКлиента().ПодписатьФайлыОчередиОбменаНаКлиенте(КонтекстОбмена);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		МодульКлиента().ЗапуститьОбменПоОрганизации(ВладелецФормы, Организация, ДокументыУчета.ВыгрузитьЗначения());
	Иначе
		МодульКлиента().ЗапуститьОбменПоВсемОрганизациям(ВладелецФормы);
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Организация", Организация);
	ПараметрыОповещения.Вставить("ДокументыУчета", ДокументыУчета.ВыгрузитьЗначения());
	Оповестить("КонтурМаркировка_ЗапущенОбменССервисом", ПараметрыОповещения);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Пропустить(Команда)
	
	Если ЗначениеЗаполнено(Организация) Тогда
		МодульКлиента().ЗапуститьОбменПоОрганизации(ВладелецФормы, Организация, ДокументыУчета.ВыгрузитьЗначения());
	Иначе
		МодульКлиента().ЗапуститьОбменПоВсемОрганизациям(ВладелецФормы);
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Организация", Организация);
	ПараметрыОповещения.Вставить("ДокументыУчета", ДокументыУчета.ВыгрузитьЗначения());
	Оповестить("КонтурМаркировка_ЗапущенОбменССервисом", ПараметрыОповещения);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокОпераций(Команда)
	
	ЗаполнитьСписокОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьОперацииПоВозрастанию(Команда)
	
	Направление = "Возр";
	СортироватьОперацииНаСервере(Направление);
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьОперацииПоУбыванию(Команда)
	
	Направление = "Убыв";
	СортироватьОперацииНаСервере(Направление);
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиКомандФормы

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокОпераций()
	
	ТаблицаОпераций = МодульОбъекта().ОчередьОбмена_ОперацииТребуетсяПодписать(Организация, ДокументыУчета.ВыгрузитьЗначения());
	КоличествоОпераций = ТаблицаОпераций.Количество();
	
	СписокОпераций.Загрузить(ТаблицаОпераций);
	
КонецПроцедуры

&НаСервере
Процедура СортироватьОперацииНаСервере(Направление)
	
	Если Не ЗначениеЗаполнено(СписокОпераций) Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.СписокОпераций.ТекущийЭлемент;
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элемент.ПутьКДанным) Тогда
		ИмяКолонки = СтрЗаменить(Элемент.ПутьКДанным, "СписокОпераций.", "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяКолонки) Тогда
		ИмяКолонки = СтрЗаменить(Элемент.Имя, "СписокОпераций", "");
	КонецЕсли;
	
	СписокОпераций.Сортировать(ИмяКолонки + " " + Направление, Новый СравнениеЗначений);
	
КонецПроцедуры

&НаСервере
Функция КонтекстыОбменаИзСпискаОпераций()
	
	ТаблицаОрганизаций = СписокОпераций.Выгрузить(, "Организация");
	ТаблицаОрганизаций.Свернуть("Организация");
	МассивОрганизаций = ТаблицаОрганизаций.ВыгрузитьКолонку("Организация");
	
	Результат = Новый Массив;
	
	Для Каждого Организация Из МассивОрганизаций Цикл
		
		КонтекстОбмена = МодульОбъекта().КонтекстОбменаССервисом(Организация);
		КонтекстОбмена.ОтключитьПодписьФайлов = Истина;
		
		Если КонтекстОбмена.ОбменВозможен Тогда
			Результат.Добавить(КонтекстОбмена);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти // СлужебныеПроцедурыИФункции
