
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// Вставить содержимое обработчика.     
	
	ЭтоНастройкиОператора = ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.вмс_НастройкиОператора"); // Исключение
	
	ПараметрыФормы = Новый Структура("", ); 
	Форма = ПолучитьФорму("Обработка.ПечатьШтрихкода.Форма");
	ЧастиИменФормы = вмс_РаботаСКоллекциями.СтрокуВМассив(ПараметрыВыполненияКоманды.Источник.ИмяФормы,".");
	ОТ = Новый ОписаниеТипов(ЧастиИменФормы[0] + "Ссылка." + ЧастиИменФормы[1]); 
	
	ИмяТипаФизическиеЛица = "СправочникСсылка." + вмс_АдаптацияКонфигураций.ИмяСправочникаФизЛица();
	Если ЭтоНастройкиОператора Тогда  
		ОТ = Новый ОписаниеТипов(ИмяТипаФизическиеЛица);
	КонецЕсли;
	
	// ТУ_Алфимов 09.04.24 ++  Не давал печатать штрихкод из самой ячейки. Не удобен при добавлении новых ячеек
	
	// //ТУ_Самойленко 17.03.23 ++
	//Если ТипЗнч(ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент) <> Тип("ТаблицаФормы") Тогда
	//	Сообщить("Выберите одну или несколько строк таблицы для формирования штрихкодов");
	//	Возврат;
	//КонецЕсли;
	// //ТУ_Самойленко 17.03.23 --
	
	// ТУ_Алфимов 09.04.24 --
	
	МассивЗначений = Новый Массив;
	Если ЧастиИменФормы.Найти("ФормаСписка") <> Неопределено ИЛИ  ЧастиИменФормы.Найти("ФормаВыбора") <> Неопределено Тогда 
		МассивВыделенныхЗначений = ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент.ВыделенныеСтроки;
		Для каждого Элемент Из МассивВыделенныхЗначений Цикл
			Если ЭтоНастройкиОператора Тогда
				Оператор = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(Элемент,"Оператор");
				МассивЗначений.Добавить(Оператор);
			Иначе
				МассивЗначений.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла; 
	Иначе   
		Если ЭтоНастройкиОператора Тогда 
			ВыбранныйЭлемент = ПараметрыВыполненияКоманды.Источник.Объект.Оператор;
		Иначе
			ВыбранныйЭлемент = ПараметрыВыполненияКоманды.Источник.Объект.Ссылка;	
		КонецЕсли;
		МассивЗначений.Добавить(ВыбранныйЭлемент);
	КонецЕсли;
	
	Для Каждого Значение Из МассивЗначений Цикл
		СтрокаЗначения = Форма.Объект.КодируемыеЗначения.Добавить();
		СтрокаЗначения.Значение = Значение;
		
		Если ТипЗнч(Значение)=Тип("СправочникСсылка.вмс_МестаХранения") Тогда
			СтрокаЗначения.ТекстНадписиСлева = ПолучитьНомерЯруса(Значение);
		КонецЕсли;
	КонецЦикла;
	
	Префикс = "";
	Реквизит = "";
	
	Если ТипЗнч(ПараметрКоманды) = Тип(ИмяТипаФизическиеЛица)
		ИЛИ ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.вмс_НастройкиОператора") Тогда
		Префикс = "USER";
		Реквизит = "УникальныйИдентификатор()";
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.вмс_МестаХранения") Тогда
		Префикс = "ZX";
		Реквизит = "Код";
	КонецЕсли;
	
	Форма.Объект.Префикс = Префикс; 
	Форма.Объект.ТипОбъектов = ОТ;
	Форма.Объект.Реквизит = Реквизит;
	Форма.Открыть();
КонецПроцедуры

Функция ПолучитьНомерЯруса(Ячейка)
	
	Наименование = Строка(Ячейка);
	Разделитель = "\";
	Наименование = СтрЗаменить(Наименование, "/", Разделитель);
	Наименование = СтрЗаменить(Наименование, "-", Разделитель);
	Части = вмс_РаботаСКоллекциями.СтрокуВМассив(Наименование, Разделитель);
	Если Части.Количество() >= 3 Тогда
		Ярус = Части[2];
		НомерЯруса = Ярус;
		НомерЯруса = СтрЗаменить(НомерЯруса, "Я", "");
		НомерЯруса = СтрЗаменить(НомерЯруса, "я", "");
		Возврат НомерЯруса;
	КонецЕсли;
	
КонецФункции
