
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	 //П
	
	 ЗапуститьСканирование(ПараметрыВыполненияКоманды);

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСканирование(ПараметрыВыполненияКоманды)
	
	#Если МобильныйКлиент  Тогда
		Если НЕ СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ВызватьИсключение НСтр("ru='Сканирование штрихкодов не поддерживается';en='Barcode scanning is not supported'");
			Возврат;
		КонецЕсли;
		ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтотОбъект,ПараметрыВыполненияКоманды);
		ОбработчикЗакрытия = Новый ОписаниеОповещения("ОбработкаЗакрытияИнтерфейса", ЭтотОбъект,ПараметрыВыполненияКоманды);
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(НСтр("ru='Наведите камеру на штрихкод';en='Aim the camera at an barcode'"), ОбработчикСканирования, ОбработчикЗакрытия, ТипШтрихКода.Все);
	#Конецесли
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	
	
	Если Результат Тогда
		
		ОбработчикСканированияФормы = Новый ОписаниеОповещения("ОбработкаВводаШтрихкода",ДополнительныеПараметры.Источник);
		ВыполнитьОбработкуОповещения(ОбработчикСканированияФормы,Штрихкод);		
		#Если МобильныйКлиент  Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#конецесли
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не распознано");
		#Если МобильныйКлиент  Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#конецесли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияИнтерфейса(ДополнительныеПараметры) Экспорт
	
	//Если ЗначениеЗаполнено(пТовар) Тогда
	//	можем встроить код открытия формы ввода количества
	//КонецЕсли;	

КонецПроцедуры
