// ИСПОЛЬЗУЕТСЯ ДЛЯ ХРАНЕНИЯ КОДА

//#Область Переменные

//&НаКлиенте
//Перем ПеременныеКлиент Экспорт;

//&НаКлиенте
//Перем КонстантыКлиент;

//#КонецОбласти

//# Область ОбработчикиСобытийФормы

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	СерверныеПеременные = ОперацииПоЯчейкамВызовСервера.ПолучитьСерверныеПеременныеДляОперации();
//	
//	ЗаполнитьСвойстваЭлементовФормы();
//		
//КонецПроцедуры 

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)  
//	
//	ОбработкаШтрихкодовКлиент.ПодключитьСистемуШтрихкодирования(ЭтаФорма); 
//	РаботаСФормамиКлиент.ПриОткрытии(ЭтаФорма, Отказ);  

//	
//	РК = РаботаСКоллекциями;   
//	ИнициализацияКонстантОперации();    
//	
//	Если ЗначениеЗаполнено(КонстантыКлиент.Основание) Тогда
//		ЗапроситьДанныеИзОсновнойБазы();   
//	Иначе
//		ПриОткрытииПослеПолученияДанныхИзОсновнойБазы();	
//	КонецЕсли;  
//	
//КонецПроцедуры 

//&НаКлиенте
//Процедура ОсновнаяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
//	
//	Если ТекущаяСтраница.Имя = "ЗавершитьОперацию" Тогда
//		
//		Элемент.ТекущаяСтраница = Элементы.Товары;   			
//		
//		ОО = Новый ОписаниеОповещения("ОбработчикЗавершенияОперации", ЭтаФорма, Неопределено); 
//		Кнопки = Новый СписокЗначений;
//		Кнопки.Добавить(Истина, "Завершить");
//		Кнопки.Добавить(Ложь, "Сохранить");
//		Кнопки.Добавить(Неопределено, "Отмена");
//		
//		ПоказатьВопрос(ОО, "ЗавершитьОперацию?", Кнопки,, Истина);
//		
//		
//	КонецЕсли;  
//	
//КонецПроцедуры     

//&НаКлиенте
// Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
//	РаботаСФормамиКлиент.ПриЗакрытии(ЭтаФорма);   
// КонецПроцедуры
// 
// &НаКлиенте
//Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
//	Если ВводДоступен() Тогда
//		Если Источник = "ПодключаемоеОборудование" Тогда			
//			Данные = Параметр[0];
//			Если ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "ScanDataBase64"  Тогда
//				ОбработкаВводаШтрихкода(Данные,Неопределено);   
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры 

//&НаКлиенте
//Процедура ТаблицаПланФактВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	Если Не ПолучитьСвойствоОперации("РазрешитьРучнойВвод") Тогда
//		Возврат;	
//	КонецЕсли;
//	
//	СтрокаПланФакта = ТаблицаПланФакт.НайтиПоИдентификатору(ВыбраннаяСтрока);
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("Количество", СтрокаПланФакта.КоличествоФактВсего);
//	ПараметрыФормы.Вставить("ВведенноеКоличество", СтрокаПланФакта.КоличествоФактВсего);

//	ОО = Новый ОписаниеОповещения("ОбработчикВводаФакта", ЭтотОбъект, ПолучитьПоляДанныхТовара(СтрокаПланФакта));
//	ОткрытьФорму("ОбщаяФорма.ФормаВводаКоличества", ПараметрыФормы, ЭтаФорма,,,,ОО);
//	
//КонецПроцедуры

//#КонецОбласти

//#Область Инициализация

//&НаКлиенте
//Процедура ИнициализацияКонстантОперации()

//	РК = РаботаСКоллекциями;
//	
//	КонстантыКлиент = Новый Структура; 
//	
//	ПараметрыФорма = РаботаСФормамиКлиент.ПолучитьПараметрыФормыНаКлиенте(ЭтаФорма);
//	//Для тестирования  ++
//	//ПараметрыФорма = ПолучитьОснование();
//	/// --   
//	
//	Если ПараметрыФорма.Свойство("Основание") Тогда  
//		Основание = ПараметрыФорма.Основание;  
//		Если Основание <> Неопределено Тогда
//			СсылкаДокументаОснования = Основание.Ссылка; 
//		Иначе  
//			СсылкаДокументаОснования = Неопределено;
//		КонецЕсли;
//	Иначе 
//		Основание = Неопределено;
//		СсылкаДокументаОснования = Неопределено;
//	КонецЕсли;  
//	
//	ВидОперации = ПараметрыФорма.ВидОперации;
//	
//	ТоварныеПоляМассив = ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля();
//		
//	ДокументОперации = ИнициализироватьДокументыОперации(ВидОперации, СсылкаДокументаОснования);
//	
//	CсылкаДокументаОперации = ДокументОперации.Ссылка;

//	КонстантыКлиент.Вставить("ВидОперации", ВидОперации);
//	КонстантыКлиент.Вставить("Основание", Основание);
//	КонстантыКлиент.Вставить("СсылкаДокументаОснования", СсылкаДокументаОснования);
//	КонстантыКлиент.Вставить("ДокументОперации", ДокументОперации);
//	КонстантыКлиент.Вставить("CсылкаДокументаОперации", CсылкаДокументаОперации);
//	КонстантыКлиент.Вставить("ДанныеПоЗапросам", Новый Соответствие);   
//	КонстантыКлиент.Вставить("Оператор", СерверныеПеременные.Оператор);	
//	КонстантыКлиент.Вставить("ИспользоватьКодыМаркировкиТоваров", СерверныеПеременные.ИспользоватьКодыМаркировкиТоваров);
//	КонстантыКлиент.Вставить("ТоварныеПоляМассив", ТоварныеПоляМассив);
//	КонстантыКлиент.Вставить("ТоварныеПоля", РК.МассивВСтроку(ТоварныеПоляМассив)); 
//	КонстантыКлиент.Вставить("ФормаЗавершенияОперации", ПоучитьФормуЗавершенияОперации());

//	
//	УстановитьСвойстваОперации(ВидОперации);
//	
//КонецПроцедуры            

//&НаКлиенте
//Процедура ИнициализацияПеременных()
//		
//	РК = РаботаСКоллекциями;
//		
//	ПеременныеКлиент = Новый Структура();
//	
//	ПеременныеКлиент.Вставить("ПустСерия", СерверныеПеременные.ПустаяСерия);
//	ПеременныеКлиент.Вставить("ПустКачество", СерверныеПеременные.ПустоеКачество);
//	ПеременныеКлиент.Вставить("ПустМаркировка", "");	
//   	ПеременныеКлиент.Вставить("ПустУпаковка", СерверныеПеременные.ПустаяУпаковка);
//	ПеременныеКлиент.Вставить("План", РаботаСКоллекциями.НоваяКвазиТаблицаЗначений(КонстантыКлиент.ТоварныеПоля + ", Количество"));
//	
//	Если ЗначениеЗаполнено(КонстантыКлиент.ДанныеПоЗапросам.Получить("Факт0")) Тогда
//		
//		Если РК.ЭтоКвазиТаблицаЗначений(КонстантыКлиент.ДанныеПоЗапросам["Факт0"]) Тогда
//			
//			ПеременныеКлиент.Вставить("Факт0", КонстантыКлиент.ДанныеПоЗапросам["Факт0"]); 
//			
//		Иначе	
//			
//			ПеременныеКлиент.Вставить("Факт0", РК.СкопироватьКвазиТаблицуЗначений(КонстантыКлиент.ДанныеПоЗапросам["Факт0"].Товары)); 
//			ПеременныеКлиент.Вставить("КодыМаркировки0", РК.СкопироватьКвазиТаблицуЗначений(КонстантыКлиент.ДанныеПоЗапросам["Факт0"].КодыМаркировки));  	
//			
//			КолонкиКодаМаркировки= РК.ПолучитьКолонкиКоллекции(ПеременныеКлиент.КодыМаркировки0);
//			
//			Для каждого  Колонка Из КолонкиКодаМаркировки   Цикл
//				
//				Если  КонстантыКлиент.ТоварныеПоляМассив.Найти(Колонка) = Неопределено И   Колонка <> "Маркировка" Тогда
//					РК.УдалитьКолонкуКвазиТаблицы(ПеременныеКлиент.КодыМаркировки0, Колонка);
//				КонецЕсли;
//				
//			КонецЦикла;
//			
//			РК.СвернутьКоллекциюЗначений(ПеременныеКлиент.КодыМаркировки0, КонстантыКлиент.ТоварныеПоля + ", Маркировка" );  
//			ПеременныеКлиент.Вставить("КодыМаркировки", РК.СкопироватьКвазиТаблицуЗначений(ПеременныеКлиент.КодыМаркировки0));  
//		КонецЕсли;   
//		
//	Иначе  
//		
//		ПеременныеКлиент.Вставить("Факт0", РаботаСКоллекциями.НоваяКвазиТаблицаЗначений(КонстантыКлиент.ТоварныеПоля + ", Количество"));
//		
//		ПеременныеКлиент.Вставить("КодыМаркировки0", РаботаСКоллекциями.НоваяКвазиТаблицаЗначений(КонстантыКлиент.ТоварныеПоля + ", Маркировка"));
//		ПеременныеКлиент.Вставить("КодыМаркировки", РК.СкопироватьКвазиТаблицуЗначений(ПеременныеКлиент.КодыМаркировки0));  
//		
//	КонецЕсли;
//	
//	ПеременныеКлиент.Вставить("Факт", РК.СкопироватьКвазиТаблицуЗначений(ПеременныеКлиент.Факт0));  	
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьСвойстваОперации(ВидОперации)
//		
//	ТаблицаСвойствОперации = УправлениеСвойствамиВызовСервера.ПолучитьТаблицуДополнительныхРеквизитовОбъекта(ВидОперации);	
//	ОперацииПоЯчейкамКлиент.УстановитьСвойстваОперации(ЭтаФорма, ТаблицаСвойствОперации);
//	
//КонецПроцедуры   

//&НаКлиенте
//Функция ИнициализироватьДокументыОперации(ВидОперации, Основание)

//	Ответственный = ОперацииПоЯчейкамВызовСервера.ПолучитьАвторизованноеФизЛицо();
//	ТекущаяДата = ТекущаяДата();
//	ПустаяСсылкаНаДокументОперации = ПредопределенноеЗначение("Документ.вмс_ОперацияПоЯчейкам.ПустаяСсылка");
//	
//	ДокументОперации = Новый Структура;
//	ДокументОперации.Вставить("ДокументОснование", Основание);
//	ДокументОперации.Вставить("ВидОперации", ВидОперации);
//	ДокументОперации.Вставить("Ссылка",  ПустаяСсылкаНаДокументОперации);
//	ДокументОперации.Вставить("Дата", ТекущаяДата);
//	ДокументОперации.Вставить("Номер",  "");
//	ДокументОперации.Вставить("Готов",  Ложь);
//	ДокументОперации.Вставить("Проведен",  Ложь);
//	ДокументОперации.Вставить("ПометкаУдаления",  Ложь);
//	ДокументОперации.Вставить("Ответственный",  Ответственный); 
//	ДокументОперации.Вставить("ВремяНачалаОперации",  ТекущаяДата());
//		
//	Возврат ДокументОперации;

//КонецФункции


//  &НаКлиенте
//Функция ПолучитьСвойствоОперации(ИмяСвойства)

//	Возврат ОперацииПоЯчейкамКлиент.ПолучитьСвойствоОперации(ЭтаФорма, ИмяСвойства) = Истина;

//КонецФункции

//#КонецОбласти

//# Область ПолучениеДанныхИзОсовнойБД

//&НаКлиенте
//Процедура ЗапроситьДанныеИзОсновнойБазы()
//	
//	ОперацииПоЯчейкамКлиент.
//	ВыполнитьПакетЗапросовКОсновнойБазеСОбработкойРезультата
//	(СформироватьПакетЗапросовДанныхИзОсновнойБазы(), Новый ОписаниеОповещения("ПриПолученииДанныхИзОсновнойБазы", ЭтотОбъект, Неопределено), ЭтаФорма);
//	
//КонецПроцедуры     

//&НаКлиенте
//Процедура ПриПолученииДанныхИзОсновнойБазы(ПакетРезультатов, ДополнительныеПараметры) Экспорт
//		
//	Если ПакетРезультатов <> Неопределено Тогда                               
//		
//		ДанныеПоЗапросам = ПоместитьРезультатыЗапросаКОсновнойБДВХранилище(ПакетРезультатов);
//		
//		ШтрихкодыОбъектов = ДанныеПоЗапросам["ШтрихкодыОбъектов"];
//		ОбработкаШтрихкодовКлиент.ЗакэшироватьШтрихкодыНовая(ЭтаФорма, ШтрихкодыОбъектов);
//		
//		ПриОткрытииПослеПолученияДанныхИзОсновнойБазы();
//		
//	Иначе
//		
//		РаботаСоЗвукомКлиент.ЗвукОшибка();
//		ПоказатьПредупреждение(, ОбращенияКИСКлиентСервер.ТекстОшибкиСоединенияСОсновнойБазой());
//		Закрыть();

//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Функция СформироватьПакетЗапросовДанныхИзОсновнойБазы()
//	
//	ПакетМетодов = Новый Массив;	
//	
//	ПакетМетодов.Добавить(ОперацииПоЯчейкамКлиентСервер.ПолучитьОписаниеМетодаОсновнойБД_ПолучитьТоварыПоДокументам(КонстантыКлиент.СсылкаДокументаОснования, "ТоварыПоОснованию", КонстантыКлиент.ВидОперации));
//	ПакетМетодов.Добавить(ПолучитьОписаниеМетодаОсновнойБД_ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру()); 
//	ПакетМетодов.Добавить(ПолучитьОписаниеМетодаОсновнойБД_ПолучитьШтрихкодыОбъектов());
//		
//	Возврат ПакетМетодов;
//	
//КонецФункции    

//&НаКлиенте
//Функция ПолучитьОписаниеМетодаОсновнойБД_ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру()
//	
//	ПараметрыФункции = Новый Структура;   
//	ПараметрыФункции.Вставить( "ДокументОснование", КонстантыКлиент.СсылкаДокументаОснования); 
//	ПараметрыФункции.Вставить( "ВидОперации", КонстантыКлиент.ВидОперации);
//	ПараметрыФункции.Вставить( "ПолучитьКодыМаркировки", КонстантыКлиент.ИспользоватьКодыМаркировкиТоваров);  
//	ПараметрыФункции.Вставить( "ГруппировкаПолей", Новый Структура("ПоляГруппировки, ПоляСуммирования", КонстантыКлиент.ТоварныеПоля , "Количество"));
//	
//	Возврат ОперацииПоЯчейкамКлиентСервер.ПолучитьОписаниеМетодаОсновнойБД_ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру(ПараметрыФункции,"Факт0");  
//	
//КонецФункции

//&НаКлиенте
//Функция ПоместитьРезультатыЗапросаКОсновнойБДВХранилище(ПакетРезультатов) Экспорт
//	
//	Если КонстантыКлиент.Свойство("ДанныеПоЗапросам") Тогда
//		ДанныеПоЗапросам = КонстантыКлиент.ДанныеПоЗапросам;
//	Иначе
//		ДанныеПоЗапросам = Новый Соответствие;
//		КонстантыКлиент.Вставить("ДанныеПоЗапросам", ДанныеПоЗапросам);
//	КонецЕсли;
//	
//	Если ПеременныеКлиент <> Неопределено Тогда
//		ПеременныеКлиент.Вставить("ДанныеПоЗапросам", ДанныеПоЗапросам);
//	КонецЕсли;
//	
//	Для Каждого РезультатМетода Из ПакетРезультатов Цикл
//		Результат = РезультатМетода.Результат;
//		ДанныеПоЗапросам[РезультатМетода.Имя] = Результат;
//	КонецЦикла;
//	
//	Возврат ДанныеПоЗапросам;
//	
//КонецФункции

//&НаКлиенте
//Функция ПолучитьОписаниеМетодаОсновнойБД_ПолучитьШтрихкодыОбъектов()
//	
//	ОписаниеМетода = ОбработкаШтрихкодовКлиентСервер.ПолучитьОписаниеМетодаОсновнойБД_ПолучитьШтрихкодыОбъектов(КонстантыКлиент.ТоварныеПоляМассив);
//	ОписаниеМетода.ПакетнаяПредОбработкаОсновнойБД =
//	"РК = вмс_РаботаСКоллекциями;
//	|ИспользуемыеТоварныеПоляМассив = ОписаниеМетода.Параметры[0];
//	|ТаблицаТоваровПоОснованию = ПакетРезультатовСоответствие[""ТоварыПоОснованию""].Результат;
//	|ПоляТаблицыТоваровМассив = РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаТоваровПоОснованию.Колонки, ""Имя"");
//	|ДоступныеПоляМассив = РК.ПересечениеМассивов(ПоляТаблицыТоваровМассив, ИспользуемыеТоварныеПоляМассив);
//	|ДоступныеПоля = РК.МассивВСтроку(ДоступныеПоляМассив);
//	|ТаблицаТоваров = ТаблицаТоваровПоОснованию.Скопировать(, ДоступныеПоля);
//	|ТаблицаТоваров.Свернуть(ДоступныеПоля);
//	|ОписаниеМетода.Параметры[0] = ТаблицаТоваров;";
//	
//	ОписаниеМетода.Имя = "ШтрихкодыОбъектов";
//	Возврат ОписаниеМетода;
//	
//КонецФункции 

//#КонецОбласти 

//# Область ЗаполнениеФормы

//&НаКлиенте
//Процедура ПриОткрытииПослеПолученияДанныхИзОсновнойБазы()
//	
//	Если ЗначениеЗаполнено(КонстантыКлиент.Основание)Тогда
//		УстановитьУсловноеОформлениеТаблицыПланФакт() 
//	КонецЕсли;
//	
//	ОперацииПоЯчейкамКлиент.ПриОткрытии(ЭтаФорма);   
//	ИнициализацияПеременных();    
//	ДополнитьКолонокиТаблицыПланФакт(КонстантыКлиент.ТоварныеПоляМассив);  
//	ЗаполнитьФорму();
//	ЭтаФорма.ТолькоПросмотр = Ложь;
//	
//	//ОперацииПоЯчейкамКлиент.ПодключитьОбщиеКоманды(ЭтотОбъект);
//	
//КонецПроцедуры   

//&НаСервере
//Процедура ДополнитьКолонокиТаблицыПланФакт(ТоварныеПоля)
//	
//	РК = РаботаСКоллекциями;
//	
//	КолонкиТаблицыПланФакт = ТаблицаПланФакт.Выгрузить().Колонки;
//	ДобавленныеРеквизиты = Новый Массив;    
//	
//	Для каждого ТоварноеПоле  Из ТоварныеПоля Цикл
//		
//		Если КолонкиТаблицыПланФакт.Найти(ТоварноеПоле) = Неопределено Тогда 
//			
//			НовыйРеквизит = Новый РеквизитФормы(ТоварноеПоле, Новый ОписаниеТипов(), "ТаблицаПланФакт");      
//			НовыйРеквизит.Заголовок = ТоварноеПоле;		  
//			ДобавленныеРеквизиты.Добавить(НовыйРеквизит); 
//			
//		КонецЕсли;
//		
//	КонецЦикла;     
//	
//	
//	Если ДобавленныеРеквизиты.Количество() > 0 Тогда
//		ИзменитьРеквизиты(ДобавленныеРеквизиты);
//	КонецЕсли;  

//КонецПроцедуры      

//&НаКлиенте
//Процедура ЗаполнитьФорму() 
//	
//	ЗаполнитьКвазиТаблицуПланДаннимиИзОсновнойБД();	
//	
//	ЗаполнитьПланНаФорме();
//	
//	ОбновитьТаблицуПланФактНаФорме();
//	
//КонецПроцедуры  

// &НаКлиенте
//Процедура ЗаполнитьПланНаФорме()

//	РК = РаботаСКоллекциями;    
//	
//	ТоварыПлан= РК.ПолучитьЭлементыКоллекции(ПеременныеКлиент.План);
//	
//	Для каждого СтрокаПлана ИЗ ТоварыПлан Цикл	
//		
//		НоваяСтрокаПланФакта = ТаблицаПланФакт.Добавить();   
//		
//		Для каждого ТоварноеПоле Из КонстантыКлиент.ТоварныеПоляМассив Цикл
//			
//			Если  НоваяСтрокаПланФакта.Свойство(ТоварноеПоле) Тогда	
//				НоваяСтрокаПланФакта[ТоварноеПоле] = СтрокаПлана[ТоварноеПоле];	
//			КонецЕсли;
//			
//		КонецЦикла; 
//		
//		НоваяСтрокаПланФакта.КоличествоПлан =  СтрокаПлана.Количество; 
//		
//		НоваяСтрокаПланФакта.ПредставлениеТоварныхПолей = ПолучитьПредставлениеТовара(СтрокаПлана);
//		
//	КонецЦикла; 	
//		
//КонецПроцедуры      

//&НаКлиенте
//Процедура ЗаполнитьКвазиТаблицуПланДаннимиИзОсновнойБД()

//	РК = РаботаСКоллекциями;   
//	
//	ТоварыПоОснованию = РК.ПолучитьЭлементыКоллекции(КонстантыКлиент.ДанныеПоЗапросам.Получить("ТоварыПоОснованию"));
//	
//	Если ТоварыПоОснованию <> Неопределено Тогда
//				
//		Для каждого СтрокаТовараИЗОснования Из ТоварыПоОснованию Цикл
//			
//			РК.ДобавитьСтрокуКвазиТаблицыЗначений(ПеременныеКлиент.План, СтрокаТовараИЗОснования);
//			
//		КонецЦикла;	
//		
//	КонецЕсли;
//	
//		
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьТаблицуПланФактНаФорме()
//	
//	РК = РаботаСКоллекциями;    

//	ТоварыФакт = РК.ПолучитьЭлементыКоллекции(ПеременныеКлиент.Факт);  
//	
//	Для каждого СтрокаПланФакта Из ТаблицаПланФакт Цикл
//		СтрокаПланФакта.КоличествоФактВсего = 0; 
//	КонецЦикла;

//	
//	Для каждого СтрокаФакта Из ТоварыФакт Цикл
//		
//		Отбор = Новый Структура;  
//		
//		Для каждого ТоварноеПоле Из КонстантыКлиент.ТоварныеПоляМассив Цикл
//			Если ТоварноеПоле = "Упаковка" Тогда
//				Продолжить;
//			КонецЕсли;
//			Отбор.Вставить(ТоварноеПоле, СтрокаФакта[ТоварноеПоле]);	 			
//		КонецЦикла;   

//		
//		НайденыеСтрокиВТаблицеПлан = ТаблицаПланФакт.НайтиСтроки(Отбор);  
//		
//		Если НайденыеСтрокиВТаблицеПлан.Количество() = 0 Тогда
//			
//			СтрокаПланФакта = ТаблицаПланФакт.Добавить();
//			ЗаполнитьЗначенияСвойств(СтрокаПланФакта, Отбор);
//       	
//		Иначе            
//			
//			СтрокаПланФакта = НайденыеСтрокиВТаблицеПлан[0];
//			
//		КонецЕсли;  
//		
//		СтрокаПланФакта.КоличествоФактВсего = СтрокаПланФакта.КоличествоФактВсего + СтрокаФакта.Количество; 
//		ПредставлениеТоварныхПолей = ПолучитьПредставлениеТовара(СтрокаФакта);
//		СтрокаПланФакта.ПредставлениеТоварныхПолей = ПредставлениеТоварныхПолей;

//	КонецЦикла;
//	
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьУсловноеОформлениеТаблицыПланФакт()
//		
//	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
//	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаПланФакт"); 
//	
//	ОтборУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПланФакт.КоличествоФактВсего");
//	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
//	ОтборУО.ПравоеЗначение =  Новый ПолеКомпоновкиДанных("ТаблицаПланФакт.КоличествоПлан");
//	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(153,255,153));     
//	
//	
//	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
//	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаПланФакт"); 
//	
//	ОтборУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПланФакт.КоличествоФактВсего");
//	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше; 
//	ОтборУО.ПравоеЗначение =  Новый ПолеКомпоновкиДанных("ТаблицаПланФакт.КоличествоПлан");
//	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(250, 200, 200));    
//	
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьСвойстваЭлементовФормы()
//	
//	ЭтотОбъект.Элементы.ТаблицаПланФакт.ТолькоПросмотр = Истина;
//	ЭтотОбъект.Элементы.ТаблицаПланФакт.КоманднаяПанель.Видимость = Ложь;
//	
//	ЭтотОбъект.Элементы.ТаблицаПланФактГруппаФактПлан.Группировка = ГруппировкаКолонок.Вертикальная;   
//		
//	ЭтотОбъект.Элементы.ЗавершитьОперацию.Картинка =  БиблиотекаКартинок.вмс_ОформлениеЗнакФлажок;	
//	
//КонецПроцедуры

//# КонецОбласти

//  #Область УниверсальныеСлужебныеФункции

//&НаКлиенте
//Процедура Подключаемый_ВыполнитьКоманду(Команда)
//	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, Неопределено);
//КонецПроцедуры

//&НаСервере
//Функция СлужебнаяФункцияВызовСервера(ПрограммныйКод, ДополнительныеПараметры=Неопределено) Экспорт
//	Возврат ОбщегоНазначенияВызовСервера.СлужебнаяФункцияВызовСервераНаФорме(ЭтаФорма, ПрограммныйКод, ДополнительныеПараметры);
//КонецФункции

//#КонецОбласти

//# Область Штрихкод 

// &НаКлиенте
// Функция ОбработкаВводаШтрихкода(Штрихкод, ДополнительныеДанные);   
//	 
//	 РК = РаботаСКоллекциями;
//	 
//	 Результат = ОбработкаШтрихкодовКлиент.ОбработатьШтрихкодНовая(ЭтаФорма, Штрихкод);
//	 
//	 Если Результат = Неопределено Тогда
//		 ПоказатьПредупреждение(, "Ошбка при обработке штрихкода");
//		 Возврат Неопределено;
//	 КонецЕсли;      
//	 
//	 Если Результат.НайденныеОбъекты.Количество() <> 0 Тогда
//		 
//		 ПакетПолей = ПолучитьПакетПолейШтрихкода(Результат.НайденныеОбъекты);  
//		 
//		 Если КонстантыКлиент.ТоварныеПоляМассив.Найти("Упаковка") <> Неопределено Тогда
//			 ПрибавляемоеЗначение = ОбращенияКИСКлиентСервер.ВыполнитьМетодОсновнойБД("вмс_ОперацииПоЯчейкамСервер.ПолучитьКоэффициентУпаковкиПоШтрихкоду", Истина, Штрихкод);
//		 Иначе
//			 ПрибавляемоеЗначение = 1;		
//		 КонецЕсли;
//		 
//		 Если КонстантыКлиент.ИспользоватьКодыМаркировкиТоваров Тогда 
//			 Если ПакетПолей.Свойство("Товар") Тогда
//				 
//				 ДанныеМаркировки = Результат.ДанныеМаркировки;
//				 
//				 Если ДанныеМаркировки.Разобран И ДанныеМаркировки.ИдентифицируетЭкземпляр И ДанныеМаркировки.GTIN <> Неопределено Тогда
//					 
//					 Если Не МаркировкаУжеВведена(Результат.Штрихкод) Тогда
//						 
//						 ПакетПолей.Вставить("Маркировка",  Штрихкод);
//						 
//					 Иначе 
//						 
//						 ПоказатьПредупреждение(,"Маркировочный код уже был введен!");
//						 Возврат Ложь;
//						 
//					 КонецЕсли;
//					 
//				 КонецЕсли; 
//				 
//			 КонецЕсли;  
//			 
//		 КонецЕсли;  
//		 
//		 ВводКоличества(ПакетПолей, ПрибавляемоеЗначение, "Добавить");	
//	 Иначе     
//		 
//		РаботаСоЗвукомКлиент.ЗвукОшибка();
//				
//		Если ПолучитьСвойствоОперации("ИспользоватьПрисвоениеШтрихкода") Тогда
//			НачатьПрисвоениеШтрихкодаНоменклатуре(Штрихкод);    
//		Иначе
//			ПоказатьПредупреждение(, "Товар не найден");
//		КонецЕсли;

//	 КонецЕсли;
//	 
// КонецФункции    
// 
//  &НаКлиенте
//Функция НачатьПрисвоениеШтрихкодаНоменклатуре(Штрихкод)
//	
//	РК = РаботаСКоллекциями;
//	
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("Штрихкод", Штрихкод);
//	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьПрисвоениеШтрихкодаТовару", ЭтаФорма, ДополнительныеПараметры);
//	
//	Если РК.ЭтоКвазиТаблицаЗначений(ПеременныеКлиент.План) Тогда
//	
//		Если ПеременныеКлиент.План.Строки.Количество() = 0 Тогда
//			ТаблицаПлан = Неопределено;	
//		Иначе
//			ТаблицаПлан = ПеременныеКлиент.План;
//		КонецЕсли;   
//		
//	Иначе
//		ТаблицаПлан = ПеременныеКлиент.План;
//	КонецЕсли;
//	
//	ПрисвоениеШтрихкодаКлиент.ОбработатьНеизвестныйШтрихкод(Штрихкод, КонстантыКлиент.Основание, ТаблицаПлан, ЭтаФорма, ОписаниеОповещения);
//	
//КонецФункции 

//&НаКлиенте
//Функция ОбработатьПрисвоениеШтрихкодаТовару(Результат, ДополнительныеПараметры) Экспорт
//	Если Результат = Истина Тогда
//		ОбработкаШтрихкодовКлиент.УдалитьШтрихкодыИзКэша(ЭтаФорма, ДополнительныеПараметры.Штрихкод);
//		ОбработкаВводаШтрихкода(ДополнительныеПараметры.Штрихкод, Неопределено);
//	КонецЕсли;
//КонецФункции

//#КонецОбласти

//# Область КодыМаркировки 

//&НаКлиенте
// Функция ДобавитьКодыМаркировкиВТаблицуФакт(ТаблицаФакт, ТаблицаМаркировок)
//	 
//	 РК = РаботаСКоллекциями;	 
//	 Возврат РаботаСКоллекциями.СоединитьТаблицы(ТаблицаФакт,ТаблицаМаркировок, КонстантыКлиент.ТоварныеПоля,"Маркировка");
//	 
// КонецФункции 

// &НаКлиенте
// Функция МаркировкаУжеВведена(Маркировка)   
//	 
//	РК = РаботаСКоллекциями;
//	 
//	Возврат РК.НайтиСтрокиКвазиТаблицыЗначений(ПеременныеКлиент.КодыМаркировки, Новый Структура("Маркировка", Маркировка)).Количество() > 0;     
//	
//КонецФункции  

//&НаКлиенте
//Функция ПолучитьТаблицуВведенныхМаркировок()  
//	
//	Если НЕ ПеременныеКлиент.Свойство("КодыМаркировки") Тогда
//		Возврат Неопределено;	
//	КонецЕсли;
//	
//	РК = РаботаСКоллекциями; 
//	
//	РезультирующаяТаблица = РК.НоваяКвазиТаблицаЗначений(Рк.ПолучитьКолонкиКоллекции(ПеременныеКлиент.КодыМаркировки));
//	ЭлементыМаркировок= РК.ПолучитьЭлементыКоллекции(ПеременныеКлиент.КодыМаркировки);
//	
//	Для каждого  СтрокаМаркировоки Из ЭлементыМаркировок Цикл    
//				
//		СтрокиМаркировок0 = РК.НайтиСтрокиКвазиТаблицыЗначений(ПеременныеКлиент.КодыМаркировки0, СтрокаМаркировоки);
//		
//		Если СтрокиМаркировок0.Количество() = 0 Тогда
//			
//			НоваяСтрока = РК.ДобавитьСтрокуКвазиТаблицыЗначений(РезультирующаяТаблица, СтрокаМаркировоки);  
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Возврат РезультирующаяТаблица;
//	
//КонецФункции    

//#КонецОбласти  

//# Область РаботаСКвазиТаблицейФакт

//&НаКлиенте
//Процедура ОбработчикВводаФакта(Количество, ПакетПолей) Экспорт

//	Если  Количество <> Неопределено Тогда
//	
//		  ВводКоличества(ПакетПолей, Количество);
//		  
//	КонецЕсли;	

//КонецПроцедуры

//&НаКлиенте
//Функция ПолучитьТаблицуВведенныхТоваров()  
//		
//	РК = РаботаСКоллекциями; 
//	
//	РезультирующаяТаблица = РК.НоваяКвазиТаблицаЗначений(Рк.ПолучитьКолонкиКоллекции(ПеременныеКлиент.Факт));
//	ЭлементыФакта= РК.ПолучитьЭлементыКоллекции(ПеременныеКлиент.Факт);
//	
//	Для каждого  СтрокаФакта Из ЭлементыФакта Цикл    
//		
//		Отбор = Новый Структура;  
//		
//		Для каждого ТоварноеПоле Из КонстантыКлиент.ТоварныеПоляМассив Цикл 
//			Отбор.Вставить(ТоварноеПоле, СтрокаФакта[ТоварноеПоле]);	 			
//		КонецЦикла;   
//		
//		СтрокиФакт0 = РК.НайтиСтрокиКвазиТаблицыЗначений(ПеременныеКлиент.Факт0, Отбор);
//		
//		Если СтрокиФакт0.Количество() = 0 Тогда
//			
//			НоваяСтрока = РК.ДобавитьСтрокуКвазиТаблицыЗначений(РезультирующаяТаблица, СтрокаФакта);  
//			
//		Иначе
//			
//			СтрокаФакт0 = СтрокиФакт0[0];  
//			
//			Если СтрокаФакт0.Количество <> СтрокаФакта.Количество Тогда
//			
//				НоваяСтрока = РК.ДобавитьСтрокуКвазиТаблицыЗначений(РезультирующаяТаблица, СтрокаФакта);  
//				НоваяСтрока.Количество = СтрокаФакта.Количество -  СтрокаФакт0.Количество;
//				
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Возврат РезультирующаяТаблица;
//	
//КонецФункции    

//&НаКлиенте
//Процедура ВводКоличества(ПакетПолей, Количество, РежимВвода = "") 
//	
//	РК = РаботаСКоллекциями;
//	
//	ТоварыФакт = НайтиСтрокуТовараПоТоварнымПолям(ПеременныеКлиент.Факт, ПакетПолей);
//	ТоварыПлан = НайтиСтрокуТовараПоТоварнымПолям(ПеременныеКлиент.План,ПакетПолей); 
//	
//	Если ТоварыПлан.Количество() =  0  Тогда
//		
//		Если НЕ ПолучитьСвойствоОперации("РазрешитьВводОтсутствующегоТовара") Тогда
//			ПоказатьПредупреждение(, "Товар отсутсвует в плане");	  
//			Возврат;
//		КонецЕсли;
//		
//		Если Не ПолучитьСвойствоОперации("РазрешитьПревышениеКоличестваТовара")  Тогда
//			ПоказатьПредупреждение(, "Запрещено превышение плана");
//			Возврат;
//		КонецЕсли; 
//		
//		Если ТоварыФакт.Количество() = 0 Тогда  
//			СтрокаФакт = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ПеременныеКлиент.Факт, ПакетПолей);
//		Иначе  
//			СтрокаФакт = ТоварыФакт[0];  
//		КонецЕсли;      
//		
//	Иначе  
//		
//		СтрокаПлан = ТоварыПлан[0];  
//				
//		Если ТоварыФакт.Количество() = 0 Тогда  
//			
//			Если Количество > СтрокаПлан.Количество И  Не ПолучитьСвойствоОперации("РазрешитьПревышениеКоличестваТовара")  Тогда
//				ПоказатьПредупреждение(, "Запрещено превышение плана");
//				Возврат;
//			КонецЕсли;  
//			
//			
//			СтрокаФакт = РК.ДобавитьСтрокуКвазиТаблицыЗначений(ПеременныеКлиент.Факт, ПакетПолей);
//			
//		Иначе  
//			
//			СтрокаФакт = ТоварыФакт[0];      
//			КоличествоПослеВвода = 0;
//			Если РежимВвода = "Добавить" Тогда
//				КоличествоПослеВвода = СтрокаФакт.Количество + Количество;
//			ИначеЕсли  РежимВвода = "Отнять" Тогда
//				КоличествоПослеВвода = СтрокаФакт.Количество -  Количество;
//			Иначе
//				КоличествоПослеВвода =  Количество;
//			КонецЕсли;	
//			
//			Если КоличествоПослеВвода > СтрокаПлан.Количество Тогда
//				
//				Если Не ПолучитьСвойствоОперации("РазрешитьПревышениеКоличестваТовара")  Тогда
//					ПоказатьПредупреждение(, "Запрещено превышение плана");
//					Возврат;
//				КонецЕсли; 
//				
//			КонецЕсли;	
//			
//		КонецЕсли;      
//		
//	КонецЕсли;   
//	
//	Если ПакетПолей.Свойство("Маркировка") Тогда	
//		РК.ДобавитьСтрокуКвазиТаблицыЗначений(ПеременныеКлиент.КодыМаркировки, ПакетПолей);	
//	КонецЕсли;  
//	
//	Если СтрокаФакт.Количество = Неопределено Тогда	
//		СтрокаФакт.Количество = 0			
//	КонецЕсли;
//	
//	Если РежимВвода = "Добавить" Тогда
//		СтрокаФакт.Количество = СтрокаФакт.Количество + Количество;
//	ИначеЕсли  РежимВвода = "Отнять" Тогда
//		СтрокаФакт.Количество = СтрокаФакт.Количество - Количество;
//	Иначе
//		СтрокаФакт.Количество =  Количество;
//	КонецЕсли;

//	
//	ОбновитьТаблицуПланФактНаФорме();
//	
//КонецПроцедуры    

//#КонецОбласти  

//# Область РаботаСТоварнымиПолями

//&НаКлиенте
//Функция ПолучитьПоляДанныхТовара(СтрокаТовара)
//	
//	ДанныеТовара = Новый Структура;
//	
//	Для каждого ТоварноеПоле Из КонстантыКлиент.ТоварныеПоляМассив Цикл
//		
//		Если СтрокаТовара.Свойство(ТоварноеПоле)Тогда
//		
//			ДанныеТовара.Вставить(ТоварноеПоле, СтрокаТовара[ТоварноеПоле]);	
//		
//		КонецЕсли;
//	
//	КонецЦикла;
//	
//	Возврат ДанныеТовара; 
//	
//КонецФункции  

// &НаКлиенте
//Функция ПолучитьПакетПолейШтрихкода(НайденныеОбъекты)
//	
//	ПоляТовара = Новый Структура(КонстантыКлиент.ТоварныеПоля);
//	
//	Для каждого ДанныеШтрихкода  Из НайденныеОбъекты Цикл
//		
//		Если ДанныеШтрихкода.ИмяТипаОбъекта = "Номенклатура" Тогда
//			ПоляТовара.Вставить("Товар", ДанныеШтрихкода.Ссылка);
//			Продолжить;
//		КонецЕсли;
//		
//		Если ПоляТовара.Свойство(ДанныеШтрихкода.ИмяТипаОбъекта)  Тогда	
//			ПоляТовара[ДанныеШтрихкода.ИмяТипаОбъекта] =  ДанныеШтрихкода.Ссылка;	
//		КонецЕсли;
//				
//	КонецЦикла; 

//   Возврат ПоляТовара;
//   
//КонецФункции  


// &НаКлиенте
//Функция  НайтиСтрокуТовараПоТоварнымПолям(КвазиТаблица, ПакетПолей)
//		
//	Отбор = Новый Структура;
//	
//	Для каждого ТоварноеПоле Из КонстантыКлиент.ТоварныеПоляМассив Цикл
//		
//		Если  ПакетПолей.Свойство(ТоварноеПоле) Тогда
//		
//			Отбор.Вставить(ТоварноеПоле, ПакетПолей[ТоварноеПоле]);
//		
//		КонецЕсли;
//	
//	КонецЦикла;   
//	
//	Возврат  РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(КвазиТаблица, Отбор); 

//КонецФункции

//&НаКлиенте
//Функция ПолучитьПредставлениеТовара(СтрокаИсточеик)
//	
//	РК = РаботаСКоллекциями;
//	
//	ДанныеТовара = Новый Массив; 
//	
//	Для каждого ТоварноеПоле Из КонстантыКлиент.ТоварныеПоляМассив Цикл  
//		
//		Если  СтрокаИсточеик.Свойство(ТоварноеПоле) Тогда
//			ДанныеТовара.Добавить(СтрокаИсточеик[ТоварноеПоле]);
//		Иначе
//			ДанныеТовара.Добавить(ПеременныеКлиент["Пуст" + ТоварноеПоле]);	
//		КонецЕсли;  
//		
//	КонецЦикла;       
//	
//	СисволПС = Символы.ПС;
//	
//	ПредставлениеТовара =  РК.МассивВСтроку(ДанныеТовара, СисволПС);  
//	
//	Возврат ПредставлениеТовара;
//	
//КонецФункции

// #КонецОбласти  

// # Область ЗавершениеОперации 
// 
//&НаСервере
//Процедура ЗавершитьОперацию(Завершить = Истина, СтруктураДокумента,  ТаблицаТоваров, ТаблицаМаркировки = Неопределено);  
//	
//	РК = РаботаСКоллекциями;
//	
//	ТаблицаТоваров = РК.ПолучитьЭлементыКоллекции(ТаблицаТоваров);	
//	
//	//Если  ТаблицаТоваров.Количество() = 0 И НЕ Завершить Тогда 	
//	//	Возврат; 	
//	//КонецЕсли;
//			
//	ДокументОперации = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
//	ДокументОперации.Заполнить(Неопределено);
//	ЗаполнитьЗначенияСвойств(ДокументОперации, СтруктураДокумента); 
//			
//	ДокументОперации.Готов = Завершить;             
//	
//	Для каждого  СтрокаТовара Из ТаблицаТоваров Цикл
//	
//		НоваяСтрока = ДокументОперации.Товары.Добавить();
//		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовара); 
//		НоваяСтрока.Количество = СтрокаТовара.Количество;
//	
//	КонецЦикла;    
//	
//	Если ТаблицаМаркировки <> Неопределено Тогда
//		ДокументОперации.КодыМаркировки.Загрузить(РК.ВыгрузитьКвазиТаблицуЗначенийВИстиннуюТаблицуЗначений(ТаблицаМаркировки));	
//	КонецЕсли;     
//		
//	ДокументОперации.Записать(); 
//	
//	ДокументОперации.Проведен = Истина;
//	
//	ДокументОперации.Записать(); 
//	
//	ДокументТСД = ДокументОперации.Ссылка;

//	
//	ПакетМетодов = Новый Массив;
//	ПакетМетодов.Добавить(ОбращенияКИСКлиентСервер.ПолучитьОписаниеМетодаОсновнойБД_ВыполнитьОбмен());
//		
//	Если Завершить Тогда
//		ПакетМетодов.Добавить(ОбращенияКИСКлиентСервер.ПолучитьОписаниеМетода("вмс_ОперацииПоЯчейкамВызовСервера.ЗавершитьОперациюПоДокументу", Истина, ДокументОперации.ДокументОснование, ДокументОперации.ВидОперации, РаботаСПользователямиСервер.ТекущийОтветственный(), Неопределено, ДокументТСД));
//	Иначе   
//		ПакетМетодов.Добавить(ОбращенияКИСКлиентСервер.ПолучитьОписаниеМетода("вмс_ОперацииПоЯчейкамВызовСервера.СохранитьОперациюПоДокументу", Истина, ДокументОперации.ДокументОснование, ДокументОперации.ВидОперации, РаботаСПользователямиСервер.ТекущийОтветственный(), Неопределено));
//	КонецЕсли;   
//	

//	ПакетРезультатов = ОбращенияКИСКлиентСервер.ВыполнитьПакетМетодовОсновнойБД(ПакетМетодов);
//   	
//	
//КонецПроцедуры          

//&НаКлиенте
//Процедура ОбработчикЗавершенияОперации(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если Результат <> Неопределено Тогда       
//		
//		Если Результат И ПолучитьСвойствоОперации("ЗапретитьРасхождения") Тогда
//		
//			Для каждого  СтрокаПланФакта Из ТаблицаПланФакт Цикл
//			
//				Если СтрокаПланФакта.КоличествоФактВсего <> СтрокаПланФакта.КоличествоПлан Тогда
//				
//				ПоказатьПредупреждение(,"Запрещено расхождение с планом");	
//				Возврат;
//				
//				КонецЕсли;	
//			
//			КонецЦикла;
//		
//		КонецЕсли;   

//	
//		ЗавершитьОперацию(Результат, КонстантыКлиент.ДокументОперации, ПолучитьТаблицуВведенныхТоваров(), ПолучитьТаблицуВведенныхМаркировок());
//	
//		ОО = Новый ОписаниеОповещения("ОбработчикЗакрытияФормыЗавершения", ЭтаФорма, Неопределено); 
//		РаботаСФормамиКлиент.ОткрытьФормуИзМакета(КонстантыКлиент.ФормаЗавершенияОперации, Неопределено, ЭтотОбъект,,,, ОО);
//		
//	КонецЕсли;  
//	
//КонецПроцедуры         

//&НаКлиенте
//Процедура ОбработчикЗакрытияФормыЗавершения(Результат, ДополнительныеПараметры) Экспорт
//	
//	РаботаСФормамиКлиент.ПриЗакрытии(ЭтаФорма,);  
//	Закрыть(Истина);   
//	
// КонецПроцедуры  
// 
// &НаСервере
//Функция ПоучитьФормуЗавершенияОперации()
//	Возврат Справочники.вмс_ИнтерфейсыТСД.НайтиПоНаименованию("Успешное завершение операции");
//КонецФункции

// #КонецОбласти
// 

//Функция СтруктуруВСтроку(Данные)
//	
//	ЗаписьJSON = Новый ЗаписьJSON;			
//	ЗаписьJSON.УстановитьСтроку();
//	ЗаписатьJSON(ЗаписьJSON,Данные);			
//	Возврат ЗаписьJSON.Закрыть();  
//	
//КонецФункции
// 
//  
// Функция ПолучитьОснование()
//	
//	Основание = Новый Структура("Ссылка", Справочники.КвазиСсылки.НайтиПоНаименованию("Заказ поставщику ЛКУТ-000041 от 01.04.2025 7:59:21",Истина ));
//	//Возврат Новый Структура("Основание, ВидОперации", Основание, Справочники.вмс_Операции.НайтиПоКоду("000000001"));	 
//	Возврат Новый Структура("ВидОперации", Справочники.вмс_Операции.НайтиПоКоду("000000001"));	


//КонецФункции 

// 
// 
// 
