#Область СлужебныйПрограммныйИнтерфейс

// вмс_Печать. Для формирования коллекции ПФ
Функция ИменаПолейКоллекцииПечатныхФорм() Экспорт
	
	Поля = Новый Массив;
	Поля.Добавить("ИмяМакета");
	Поля.Добавить("ИмяВРЕГ");
	Поля.Добавить("СинонимМакета");
	Поля.Добавить("ТабличныйДокумент");
	Поля.Добавить("Экземпляров");
	Поля.Добавить("Картинка");
	Поля.Добавить("ПолныйПутьКМакету");
	Поля.Добавить("ИмяФайлаПечатнойФормы");
	Поля.Добавить("ОфисныеДокументы");
	
	Возврат Поля;
	
КонецФункции

#КонецОбласти

Функция ВыполнитьПечатьЧерезКомпоненту(ТабличныйДокумент, ВыбранныйПринтер, ЖдатьЗавершения=Ложь) Экспорт
	
	Перем КодВозврата;
	
	КомандаПечати = ПолучитьКомандуПечатиСервернойКомпонентыПечати(ТабличныйДокумент, ВыбранныйПринтер);
	
	Попытка
		ЗапуститьПриложение(КомандаПечати, , ЖдатьЗавершения, КодВозврата);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
	КонецПопытки;
	
	Возврат КодВозврата;
	
КонецФункции

Функция ПолучитьКомандуПечатиСервернойКомпонентыПечати(ПечатнаяФорма, ВыбранныйПринтер) Экспорт

	пПутьКГХостСкрипт = вмс_ПечатьКлиентСервер.ПолучитьПутьКФайлуКомпонентуСетевойПечатиПоУмолчанию();

	ДанныеПринтера = вмс_Печать.ПолучитьДанныеПринтера(ВыбранныйПринтер);
	Размер = ?(ДанныеПринтера.ФорматПечати=ПредопределенноеЗначение("Перечисление.ФорматПечати.Этикетка"), "Custom", "A4");

	пПутьКГХостСкрипт = """" + пПутьКГХостСкрипт  + """";
	пПринтер =  """%printer%" +  ДанныеПринтера.ПутьКПринтеру + """";
	
	// ПечатнаяФорма - Табличный документ
	ПечатнаяФорма.ПолеСверху = 0;
	ПечатнаяФорма.ПолеСлева = 0;
	ПечатнаяФорма.ПолеСнизу = 0;
	ПечатнаяФорма.ПолеСправа = 0;
	
	ПечатнаяФорма.РазмерКолонтитулаСверху = 0;
	ПечатнаяФорма.РазмерКолонтитулаСнизу = 0;
	ПечатнаяФорма.РазмерСтраницы = Размер;
	
	РазмерБумаги = "";
	Если Размер = "Custom" Тогда
		ПечатнаяФорма.ВысотаСтраницы = ДанныеПринтера.ВысотаЭтикетки;
		ПечатнаяФорма.ШиринаСтраницы = ДанныеПринтера.ШиринаЭтикетки;
		// 1/72 дюйма
		ммВДюйме = 25.4;  
		РазмерБумаги = " -dDEVICEWIDTHPOINTS=" + Формат(ДанныеПринтера.ШиринаЭтикетки/ммВДюйме*72,"ЧДЦ=0; ЧГ=0") + " -dDEVICEHEIGHTPOINTS="+Формат(ДанныеПринтера.ВысотаЭтикетки/ммВДюйме*72,"ЧДЦ=0; ЧГ=0");
	Иначе
		РазмерБумаги = " -sPAPERSIZE=" + Размер;	
	КонецЕсли;
	
	ПечатнаяФорма.АвтоМасштаб = Истина;
	
	ФайлДляПечати = ПолучитьИмяВременногоФайла("pdf");
	ПечатнаяФорма.Записать(ФайлДляПечати, ТипФайлаТабличногоДокумента.PDF);
	
	ФайлНаДиске = Новый Файл(ФайлДляПечати);
	Если НЕ ФайлНаДиске.Существует() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден файл для печати!");
		Возврат Неопределено;
	КонецЕсли;	
	
	ФайлДляПечати = """" + ФайлДляПечати + """"; 
	
	ПараметрыКомандыПечати = Новый Массив;
	ПараметрыКомандыПечати.Добавить("-dPrinted");
	ПараметрыКомандыПечати.Добавить("-dBATCH");
	ПараметрыКомандыПечати.Добавить("-dNOPAUSE");
	ПараметрыКомандыПечати.Добавить("-dNOSAFER");
	ПараметрыКомандыПечати.Добавить("-q");
	ПараметрыКомандыПечати.Добавить("-dNumCopies=1"); // Отсутствует в документации?
	ПараметрыКомандыПечати.Добавить("-sDEVICE=mswinpr2");
	ПараметрыКомандыПечати.Добавить("-sOutputFile=" + пПринтер);
	ПараметрыКомандыПечати.Добавить("-dPDFFitPage" + РазмерБумаги + " "+ ФайлДляПечати);	
	
	КомандаПечати = пПутьКГХостСкрипт + " " + СтрСоединить(ПараметрыКомандыПечати, " ");
	
	Возврат КомандаПечати;

КонецФункции

Функция ПолучитьСписокПринтеров() Экспорт 
	
	СписокПринтеров = Новый СписокЗначений;
	
	Способ = 1;
	
	Попытка
		Если Способ=1 Тогда
			Сервер = ПолучитьCOMОбъект("winmgmts:\\.\root\CIMV2");
			Принтеры = Сервер.ExecQuery("SELECT * FROM Win32_Printer",,48);
			
			Для каждого Принтер Из Принтеры Цикл
				СписокПринтеров.Добавить(Принтер.Name);
			КонецЦикла;
		Иначе
			Скрипт = ПолучитьCOMОбъект("", "WScript.Network");
			Принтеры = Скрипт.EnumPrinterConnections();
			Для каждого Принтер Из Принтеры Цикл	
				СписокПринтеров.Добавить(Принтер);
			КонецЦикла;
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка" + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат СписокПринтеров;
	
КонецФункции

Функция УстановитьКомпонентуСетевойПечати() Экспорт
	
	Файл = ПолучитьФайлУстановщикаКомпонентыСетевойПечать();
	
	Если Файл = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Разрядность системы не подходит для установки компоненты!"); 
		Возврат Ложь;
	КонецЕсли; 
	
	НазваниеВременногоФайла = "ExternalComponent.exe";
	ПутьУстановщикаНаСервере = КаталогВременныхФайлов() + НазваниеВременногоФайла;
	
	Попытка
		Файл.Записать(ПутьУстановщикаНаСервере);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	
	ИсходныйФайлЗапускаКоманды = Новый ТекстовыйДокумент();
	КоманднаяСтрока = "CD " + КаталогВременныхФайлов() + Символы.ПС
	+ НазваниеВременногоФайла + " /S" + Символы.ПС
	+ "exit /B"; 
	
	ИсходныйФайлЗапускаКоманды.УстановитьТекст(КоманднаяСтрока);
	
	ИмяУстановщика = КаталогВременныхФайлов() + "ExternalComponentInstaller.bat";
	ИсходныйФайлЗапускаКоманды.Записать(ИмяУстановщика, КодировкаТекста.ANSI);
	
	ЗапуститьПриложение(ИмяУстановщика,,Истина);
	
	Возврат Истина;
	
КонецФункции

Функция КомпонентаСетевойПечатиУстановлена() Экспорт
	
	ПутьККомпоненте = ПолучитьПутьКФайлуКомпонентуСетевойПечатиПоУмолчанию();
	ФайлКомпоненты = Новый Файл(ПутьККомпоненте);
	Возврат ФайлКомпоненты.Существует();
	
КонецФункции

Функция ПолучитьПутьКФайлуКомпонентуСетевойПечатиПоУмолчанию() Экспорт

	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Если СистемнаяИнформация.ТипПлатформы=ТипПлатформы.Windows_x86_64 Тогда
		ПутьКФайлуПоУмолчанию = "C:\Program Files\gs\gs10.00.0\bin\gswin64c.exe";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы=ТипПлатформы.Windows_x86 Тогда
		ПутьКФайлуПоУмолчанию = "C:\Program Files (x86)\gs\gs10.00.0\bin\gswin32c.exe";
	КонецЕсли; 
	
	Возврат ПутьКФайлуПоУмолчанию;
	
КонецФункции

Функция ПолучитьФайлУстановщикаКомпонентыСетевойПечать() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Если СистемнаяИнформация.ТипПлатформы=ТипПлатформы.Windows_x86_64 Тогда
		Файл = вмс_ОбщегоНазначенияВызовСервера.ПолучитьМакет("КомпонентаСетевойПечати_x64"); 
	ИначеЕсли СистемнаяИнформация.ТипПлатформы=ТипПлатформы.Windows_x86 Тогда
		Файл = вмс_ОбщегоНазначенияВызовСервера.ПолучитьМакет("КомпонентаСетевойПечати_x32");
	КонецЕсли; 
	
	Возврат Файл;
	
КонецФункции

