
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)   
	
	ЗапуститьПроцедуруОбновленияСистемы();	
					
КонецПроцедуры  

&НаКлиенте
Функция ЗапуститьПроцедуруОбновленияСистемы()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаОбновлениеСистемыЗавершение", ЭтотОбъект);  
	Пароль = "";
	ПоказатьВводСтроки(ОписаниеОповещения, Пароль, "Введите пароль");  
	
КонецФункции

&НаКлиенте
Процедура КомандаОбновлениеСистемыЗавершение(ВведенныйПароль, ДополнительныеПараметры) Экспорт
	
	Эталон = "p/Q+Ll+BgCT3+17z0w1BYv5qAuKB7qfgfutyEXp0d14=";
	ХэшПароля = Base64Строка(вмс_РаботаСПользователямиСервер.ХешПароля(ВведенныйПароль)); 
	
	Если Эталон = ХэшПароля Тогда 
		вмс_Сервер.ИнициализироватьОбновлениеСистемы();
		ЗавершитьРаботуСистемы(Ложь,Истина);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Неправильно введен пароль");
	КонецЕсли; 
	
КонецПроцедуры

