&НаКлиенте
Перем Переменные Экспорт;

//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

&НаКлиентеНаСервереБезКонтекста
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

&НаКлиенте
Процедура СтруктураЭлементовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Перем РК;
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	Отказ = Истина;
	
	СтрокаТекущегоЭлемента = Элемент.ТекущиеДанные;
	Если СтрокаТекущегоЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРодителяТекущегоЭлемента = СтрокаТекущегоЭлемента.ПолучитьРодителя();
	Если Копирование Тогда
		Если СтрокаТекущегоЭлемента = Переменные.СтрокаФормы Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаНовогоЭлемента = СтрокаРодителяТекущегоЭлемента.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНовогоЭлемента, СтрокаТекущегоЭлемента);
		СтрокаНовогоЭлемента.ИмяЭлемента = ПолучитьИмяНовогоЭлемента(СтрокаНовогоЭлемента.ТипЭлемента);
		
		ЗначенияСвойствЭлемента = РК.НайтиЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойствЭлементов, Новый Структура("ИмяЭлемента", СтрокаТекущегоЭлемента.ИмяЭлемента));
		Для Каждого СтрокаЗначенияСвойстваЭлемента Из ЗначенияСвойствЭлемента Цикл
			СтрокаЗначенияСвойстваНовогоЭлемента = РК.ДобавитьЭлементКоллекции(Переменные.ТаблицаЗначенийСвойствЭлементов);
			ЗаполнитьЗначенияСвойств(СтрокаЗначенияСвойстваНовогоЭлемента, СтрокаЗначенияСвойстваЭлемента);
			СтрокаЗначенияСвойстваНовогоЭлемента.ИмяЭлемента = СтрокаНовогоЭлемента.ИмяЭлемента;
			РК.ИндексироватьСтрокиКвазиТаблицы(Переменные.ТаблицаЗначенийСвойствЭлементов, СтрокаЗначенияСвойстваНовогоЭлемента);
		КонецЦикла;
		
		Элементы.СтруктураЭлементов.ТекущаяСтрока = СтрокаНовогоЭлемента.ПолучитьИдентификатор();
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтрокаТекущегоЭлемента", СтрокаТекущегоЭлемента);
	
	ОО = Новый ОписаниеОповещения("ОбработчикВыбораТипаЭлемента", ЭтаФорма, ДополнительныеПараметры);
	
	РодительскиеЭлементы = Новый Массив;
	РодительскиеЭлементы.Добавить(СтрокаТекущегоЭлемента);
	Если СтрокаРодителяТекущегоЭлемента<>Неопределено Тогда
		РодительскиеЭлементы.Добавить(СтрокаРодителяТекущегоЭлемента);
	КонецЕсли;
	СписокВыбораТиповЭлементов = вмс_КонструкторФорм.ПолучитьСписокВыбораДоступныхТиповИВидовЭлементов(Переменные.СведенияОТипахЭлементовФормы, , РодительскиеЭлементы);
	СписокВыбораТиповЭлементов.ПоказатьВыборЭлемента(ОО, "Тип элемента");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораТипаЭлемента(ВыбранныйЭлементТипаЭлемента, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлементТипаЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРодителяЭлемента = ДополнительныеПараметры.СтрокаТекущегоЭлемента;
	
	СтрокаТипаЭлемента = ВыбранныйЭлементТипаЭлемента.Значение;
	
	ДоступныеТипыЭлементов = вмс_КонструкторФорм.ПолучитьДоступныеТипыИВидыЭлементов(Переменные.СведенияОТипахЭлементовФормы, , СтрокаРодителяЭлемента);
	Если ДоступныеТипыЭлементов.Найти(СтрокаТипаЭлемента)=Неопределено Тогда
		//не получается вставить в выделенную строку, тогда добавим в строку общего родителя перед выделенным элементом
		СтрокаРодителяЭлемента = СтрокаРодителяЭлемента.ПолучитьРодителя();
		ИндексНовогоЭлемента = СтрокаРодителяЭлемента.ПолучитьЭлементы().Индекс(ДополнительныеПараметры.СтрокаТекущегоЭлемента);
	Иначе
		ИндексНовогоЭлемента = СтрокаРодителяЭлемента.ПолучитьЭлементы().Количество();
	КонецЕсли;
	
	Если СтрокаТипаЭлемента.ТипЭлемента="ГруппаФормы" И СтрокаТипаЭлемента.ВидЭлемента="КоманднаяПанель" Тогда
		ИмяНовогоЭлемента = СтрокаРодителяЭлемента.ИмяЭлемента + "КоманднаяПанель";
		СтрокаЭлемента = НайтиЭлемент(ИмяНовогоЭлемента);
		Если СтрокаЭлемента<>Неопределено Тогда
			Элементы.СтруктураЭлементов.ТекущаяСтрока = СтрокаЭлемента.ПолучитьИдентификатор();
			Возврат;
		КонецЕсли;
		ИндексНовогоЭлемента = 0;
	Иначе
		ИмяНовогоЭлемента = ПолучитьИмяНовогоЭлемента(СтрокаТипаЭлемента.ТипЭлемента);;
	КонецЕсли;
	
	СтрокаНовогоЭлемента = СтрокаРодителяЭлемента.ПолучитьЭлементы().Вставить(ИндексНовогоЭлемента);
	СтрокаНовогоЭлемента.ИмяЭлемента = ИмяНовогоЭлемента;
	СтрокаНовогоЭлемента.ТипЭлемента = СтрокаТипаЭлемента.ТипЭлемента;
	СтрокаНовогоЭлемента.ВидЭлемента = СтрокаТипаЭлемента.ВидЭлемента;
	
	Если СтрокаНовогоЭлемента.ВидЭлемента="" Тогда
		ДоступныеВидыЭлемента = вмс_КонструкторФорм.ПолучитьДоступныеВидыЭлемента(Переменные.СведенияОТипахЭлементовФормы, СтрокаНовогоЭлемента.ТипЭлемента, СтрокаНовогоЭлемента.ВидЭлемента, СтрокаРодителяЭлемента);
		Если ДоступныеВидыЭлемента.Количество() > 0 Тогда
			ОписаниеВидаЭлемента = ДоступныеВидыЭлемента[0];
			СтрокаНовогоЭлемента.ВидЭлемента = ОписаниеВидаЭлемента.ВидЭлемента;
			УстановитьЗначениеСвойстваЭлемента(СтрокаНовогоЭлемента.ИмяЭлемента, "Вид", ОписаниеВидаЭлемента.ЗначениеСвойстваВидЭлемента);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьЗначенияСвойствЭлемента(СтрокаНовогоЭлемента.ИмяЭлемента, СтрокаТипаЭлемента.ЗначенияСвойствЭлементаПоУмолчанию);
	
	ОбновитьСтрокуЭлементаНаФорме(СтрокаНовогоЭлемента);
	
	Элементы.СтруктураЭлементов.ТекущаяСтрока = СтрокаНовогоЭлемента.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураЭлементовПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, ИдентификаторСтрокиРодителя, Поле)
	
	Если ИдентификаторСтрокиРодителя=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивРодителей = Новый Массив;
	
	СтрокаРодителя = СтруктураЭлементов.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
	МассивРодителей.Добавить(СтрокаРодителя);
	
	СтрокаРодителя = СтрокаРодителя.ПолучитьРодителя();
	Если СтрокаРодителя<>Неопределено Тогда
		МассивРодителей.Добавить(СтрокаРодителя);
	КонецЕсли;
	
	МассивПодчиненныхЭлементов = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ПараметрыПеретаскивания.Значение Цикл
		СтрокаЭлемента = СтруктураЭлементов.НайтиПоИдентификатору(ИдентификаторСтроки);
		МассивПодчиненныхЭлементов.Добавить(СтрокаЭлемента);
	КонецЦикла;
	
	Если Не вмс_КонструкторФорм.ПроверитьВозможностьПодчиненияЭлементов(Переменные.СведенияОТипахЭлементовФормы, МассивРодителей, МассивПодчиненныхЭлементов) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыПеретаскивания.Действие = Переменные.ДействиеПеретаскивания.Отмена;
		ПараметрыПеретаскивания.ДопустимыеДействия = Переменные.ДопустимыеДействияПеретаскивания.НеОбрабатывать;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураЭлементовПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаРодителя = СтруктураЭлементов.НайтиПоИдентификатору(Строка);
	СтрокаЭлемента = СтруктураЭлементов.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение[0]);
	
	Если Не вмс_КонструкторФорм.ПроверитьВозможностьПодчиненияЭлементов(Переменные.СведенияОТипахЭлементовФормы, СтрокаРодителя, СтрокаЭлемента) Тогда
		//нельзя вставить в этот элемент
		//тогда вставим перед ним
		СтрокаСоседа = СтрокаРодителя;
		СтрокаРодителя = СтрокаСоседа.ПолучитьРодителя();
	КонецЕсли;
	
	СтрокаЭлемента = СкопироватьПереместитьЭлементДерева(СтрокаЭлемента, СтрокаРодителя, СтруктураЭлементов, Истина);
	
	Если СтрокаСоседа<>Неопределено Тогда
		ИндексСоседа = СтрокаРодителя.ПолучитьЭлементы().Индекс(СтрокаСоседа);
		ИндексЭлемента = СтрокаРодителя.ПолучитьЭлементы().Индекс(СтрокаЭлемента);
		Сдвиг = ИндексСоседа - ИндексЭлемента;
		СтрокаРодителя.ПолучитьЭлементы().Сдвинуть(ИндексЭлемента, Сдвиг)
	КонецЕсли;
	
	Элементы.СтруктураЭлементов.ТекущаяСтрока = СтрокаЭлемента.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураЭлементовПередУдалением(Элемент, Отказ)
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	Отказ = Истина;

	МассивВыделенныхСтрокЭлементов = Новый Массив;
	Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.СтруктураЭлементов.ВыделенныеСтроки Цикл
		СтрокаЭлемента = СтруктураЭлементов.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		МассивВыделенныхСтрокЭлементов.Добавить(СтрокаЭлемента);
	КонецЦикла;
	
	МассивЭлементов = ПолучитьВсеЭлементыДерева(МассивВыделенныхСтрокЭлементов, Истина);
	НомерЭлемента = МассивЭлементов.Количество();
	Пока НомерЭлемента>0 Цикл
		НомерЭлемента = НомерЭлемента - 1;
		СтрокаЭлемента = МассивЭлементов[НомерЭлемента];
		Если Переменные.СтрокаФормы=СтрокаЭлемента Тогда
			//не удалять главный элемент
			Продолжить;
		КонецЕсли;

		НайденныеСвойстваЭлемента = РК.НайтиЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойствЭлементов, Новый Структура("ИмяЭлемента", СтрокаЭлемента.ИмяЭлемента));
		РК.УдалитьЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойствЭлементов, НайденныеСвойстваЭлемента);
		
		СтрокаРодителя = СтрокаЭлемента.ПолучитьРодителя();
		Если СтрокаРодителя=Неопределено Тогда
			СтрокаРодителя = СтруктураЭлементов;
		КонецЕсли;
		СтрокаРодителя.ПолучитьЭлементы().Удалить(СтрокаЭлемента);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураЭлементовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ОткрытьФормуСвойствЭлемента(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Функция НайтиЭлемент(ИмяЭлемента)
	
	ВсеЭлементы = ПолучитьВсеЭлементыДерева(СтруктураЭлементов);
	Для Каждого Элемент Из ВсеЭлементы Цикл
		Если Элемент.ИмяЭлемента=ИмяЭлемента Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяНовогоЭлемента(Префикс="ЭлементФормы")
	
	МассивИменЭлементов = ПолучитьМассивИменЭлементов();
	
	НомерЭлемента = 0;
	Пока Истина Цикл
		НомерЭлементаСтрокой = Формат(НомерЭлемента, "ЧГ=0");
		ИмяНовогоЭлемента = Префикс + НомерЭлементаСтрокой;
		Если МассивИменЭлементов.Найти(ИмяНовогоЭлемента) = Неопределено Тогда
			Возврат ИмяНовогоЭлемента;
		КонецЕсли;
		НомерЭлемента = НомерЭлемента + 1;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ПроверитьИмяЭлемента(ИмяЭлемента) Экспорт
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	Если Не РК.ПроверитьИмяПрограммнойПеременной(ИмяЭлемента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивИменЭлементов = ПолучитьМассивИменЭлементов();
	Если МассивИменЭлементов.Найти(ИмяЭлемента) <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПолучитьМассивИменЭлементов()

	Возврат Переменные.ОбщиеМодули.РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(ПолучитьВсеЭлементыДерева(СтруктураЭлементов), "ИмяЭлемента");
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяНовогоРеквизита(СтрокаНовогоРеквизита, Префикс="Реквизит")
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	СтрокаРодителя = СтрокаНовогоРеквизита.ПолучитьРодителя();
	Если СтрокаРодителя=Неопределено Тогда
		СтрокаРодителя = СтруктураРеквизитов;
	КонецЕсли;
	
	МассивИменСуществующихРеквизитов = Новый Массив;
	Для Каждого СтрокаСоседнегоРеквизита Из СтрокаРодителя.ПолучитьЭлементы() Цикл
		МассивИменСуществующихРеквизитов.Добавить(СтрокаСоседнегоРеквизита.ИмяРеквизита);
	КонецЦикла;
	
	НомерРеквизита = 0;
	Пока Истина Цикл
		НомерРеквизитаСтрокой = Формат(НомерРеквизита, "ЧГ=0");
		ИмяНовогоРеквизита = Префикс + НомерРеквизитаСтрокой;
		Если МассивИменСуществующихРеквизитов.Найти(ИмяНовогоРеквизита) = Неопределено Тогда
			Прервать;
		КонецЕсли;
		НомерРеквизита = НомерРеквизита + 1;
	КонецЦикла;
	
	СтрокаНовогоРеквизита.ИмяРеквизита = ИмяНовогоРеквизита;
	
	СтрокаЗначенийСвойствНовогоРеквизита = ПолучитьЗначенияСвойствРеквизита(СтрокаНовогоРеквизита);
	СтрокаЗначенийСвойствНовогоРеквизита.ИмяРеквизита = ИмяНовогоРеквизита;
	
КонецФункции

&НаКлиенте
Функция ПроверитьИмяРеквизита(СтрокаРеквизита)

	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	Если Не РК.ПроверитьИмяПрограммнойПеременной(СтрокаРеквизита.ИмяРеквизита) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаРодителя = СтрокаРеквизита.ПолучитьРодителя();
	Если СтрокаРодителя=Неопределено Тогда
		СтрокаРодителя = СтруктураРеквизитов;
	КонецЕсли;
	
	Для Каждого СтрокаСоседнегоРеквизита Из СтрокаРодителя.ПолучитьЭлементы() Цикл
		Если СтрокаСоседнегоРеквизита<>СтрокаРеквизита Тогда
			Если СтрокаСоседнегоРеквизита.ИмяРеквизита=СтрокаРеквизита.ИмяРеквизита Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьВсеЭлементыДерева(знач Дерево, ВключаяДерево=Ложь, ОбратитьПорядок=Ложь)
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	МассивЭлементов=Новый Массив;
	ОбходЭлементов = Новый Массив;
	Если ТипЗнч(Дерево)=Тип("Массив") Тогда
		//передан массив деревьев
		МассивДеревьев = Дерево;
		Для Каждого Дерево Из МассивДеревьев Цикл
			ОбходЭлементов.Добавить(Дерево);
			Если ВключаяДерево Тогда
				МассивЭлементов.Добавить(Дерево);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ОбходЭлементов.Добавить(Дерево);
		Если ВключаяДерево Тогда
			МассивЭлементов.Добавить(Дерево);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаЭлемента Из ОбходЭлементов Цикл
		Для Каждого ПодчиненныйЭлемент Из СтрокаЭлемента.ПолучитьЭлементы() Цикл
			ОбходЭлементов.Добавить(ПодчиненныйЭлемент);
			МассивЭлементов.Добавить(ПодчиненныйЭлемент);
		КонецЦикла;
	КонецЦикла;
	
	//удалить дубли вложенных элементов перед родительскими элементами
	ОтмеченныеЭлементы = Новый Соответствие;
	НомерЭлемента = МассивЭлементов.Количество();
	Пока НомерЭлемента>0 Цикл
		НомерЭлемента = НомерЭлемента - 1;
		Элемент = МассивЭлементов[НомерЭлемента];
		Если ОтмеченныеЭлементы[Элемент]=Истина Тогда
			//удаляем дубль
			МассивЭлементов.Удалить(НомерЭлемента);
		Иначе
			ОтмеченныеЭлементы[Элемент]=Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбратитьПорядок Тогда
		РК.РазвернутьЭлементыМассива(МассивЭлементов);
	КонецЕсли;
	
	Возврат МассивЭлементов;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УдалитьСтрокуДерева(Дерево, Строка)
	
	СтрокаРодителя = Строка.ПолучитьРодителя();
	Если СтрокаРодителя=Неопределено Тогда
		СтрокаРодителя = Дерево;
	КонецЕсли;
	
	СтрокаРодителя.ПолучитьЭлементы().Удалить(Строка);
	
КонецФункции

&НаКлиенте
Функция СкопироватьПереместитьЭлементДерева(знач Элемент, Родитель, Дерево, Переместить=Ложь)
	
	ВсеЭлементы = ПолучитьВсеЭлементыДерева(Элемент, Истина);
	
	РодительЭлемента = Элемент.ПолучитьРодителя();
	Если РодительЭлемента = Неопределено Тогда
		РодительЭлемента = Дерево;
	КонецЕсли;
	
	СкопированныеЭлементы = Новый Соответствие;
	СкопированныеЭлементы[РодительЭлемента] = Родитель;
	
	Для Каждого Элемент Из ВсеЭлементы Цикл
		РодительЭлемента = Элемент.ПолучитьРодителя();
		Если РодительЭлемента = Неопределено Тогда
			РодительЭлемента = Дерево;
		КонецЕсли;
		РодительКопииЭлемента = СкопированныеЭлементы[РодительЭлемента];
		КопияЭлемента = РодительКопииЭлемента.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(КопияЭлемента, Элемент);
		СкопированныеЭлементы[Элемент] = КопияЭлемента;
	КонецЦикла;
	
	Элемент = ВсеЭлементы[0];
	КопияЭлемента = СкопированныеЭлементы[Элемент];
	
	Если Переместить Тогда
		РодительЭлемента = Элемент.ПолучитьРодителя();
		Если РодительЭлемента = Неопределено Тогда
			РодительЭлемента = Дерево;
		КонецЕсли;
		РодительЭлемента.ПолучитьЭлементы().Удалить(Элемент);
	КонецЕсли;
	
	Возврат КопияЭлемента;
	
КонецФункции

&НаКлиенте
Функция ОткрытьФормуСвойствЭлемента(Элемент)
	
	Перем ОписаниеОповещенияОЗакрытии;
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбработкаРедактированияСвойствЭлемента", ЭтаФорма, ДополнительныеПараметры);
	
	ФормаРедактированияСвойствЭлемента = ПолучитьФорму(Переменные.ИмяОбработки + ".Форма.ФормаСвойстваЭлемента", , ЭтаФорма, Элемент.ИмяЭлемента);
	ФормаРедактированияСвойствЭлемента.Переменные.Элемент = Элемент;
	ФормаРедактированияСвойствЭлемента.ОписаниеОповещенияОЗакрытии = ОписаниеОповещенияОЗакрытии;
	ФормаРедактированияСвойствЭлемента.Открыть();
	
КонецФункции

&НаКлиенте
Процедура ОбработкаРедактированияСвойствЭлемента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	ТекущиеЗначенияСвойствЭлемента = РК.НайтиЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойствЭлементов, Новый Структура("ИмяЭлемента", Элемент.ИмяЭлемента));
	РК.УдалитьЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойствЭлементов, ТекущиеЗначенияСвойствЭлемента);
	РК.ДобавитьЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойствЭлементов, Результат.ТаблицаЗначенийСвойств);
	
	ТекущиеОбработчикиСобытийЭлемента = РК.НайтиЭлементыКоллекции(Переменные.ТаблицаОбработчиковСобытийЭлементов, Новый Структура("ИмяЭлемента", Элемент.ИмяЭлемента));
	РК.УдалитьЭлементыКоллекции(Переменные.ТаблицаОбработчиковСобытийЭлементов, ТекущиеОбработчикиСобытийЭлемента);
	РК.ДобавитьЭлементыКоллекции(Переменные.ТаблицаОбработчиковСобытийЭлементов, Результат.ТаблицаОбработчиковСобытий);

	Элемент.ИмяЭлемента = Результат.ИмяЭлемента;
	Элемент.ВидЭлемента = Результат.ВидЭлемента;
	ОбновитьСтрокуЭлементаНаФорме(Элемент);
	
КонецПроцедуры

&НаКлиенте
Функция ОбновитьСтрокуЭлементаНаФорме(СтрокаЭлемента)
	
	СтрокаТипаЭлемента = вмс_КонструкторФорм.ПолучитьСведенияОТипеЭлементаФормы(Переменные.СведенияОТипахЭлементовФормы, СтрокаЭлемента.ТипЭлемента, СтрокаЭлемента.ВидЭлемента);
	
	Если СтрокаТипаЭлемента<>Неопределено Тогда
		
		СтрокаЭлемента.ПредставлениеТипаЭлемента = СтрокаТипаЭлемента.Представление;
		СтрокаЭлемента.Картинка = СтрокаТипаЭлемента.Картинка;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекстОписанияФормы() Экспорт
	
	Перем РаботаСXML;
	
	РаботаСXML = Переменные.ОбщиеМодули.РаботаСXML;
	
	ОписаниеФормы = ПолучитьОписаниеФормы();
	
	ТекстОписанияФормы = РаботаСXML.XMLСтрокаИзЗначенияУлучшенная(ОписаниеФормы);
	
	Возврат ТекстОписанияФормы;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеФормы()
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	ОписаниеФормы = вмс_КонструкторФорм.НовоеОписаниеФормы();
	ОписаниеФормы.ТекстМодуля = РедакторМодуляФормы.ПолучитьТекст();
	
	//Реквизиты
	СоответствиеРеквизитов = Новый Соответствие;
	Для Каждого СтрокаРеквизита Из ПолучитьВсеЭлементыДерева(СтруктураРеквизитов) Цикл
		ОписаниеРеквизита = вмс_КонструкторФорм.НовоеОписаниеРеквизита();
		СтрокаЗначенийСвойствРеквизита = ПолучитьЗначенияСвойствРеквизита(СтрокаРеквизита);
		ЗаполнитьЗначенияСвойств(ОписаниеРеквизита, СтрокаЗначенийСвойствРеквизита, "ИмяРеквизита, ТипРеквизита, Заголовок, Статический");
		РодительСтрокиРеквизита = СтрокаРеквизита.ПолучитьРодителя();
		Если РодительСтрокиРеквизита=Неопределено Тогда
			ОписаниеРодителяРеквизита = ОписаниеФормы;
		Иначе
			ОписаниеРодителяРеквизита = СоответствиеРеквизитов[РодительСтрокиРеквизита];
		КонецЕсли;
		ОписаниеРодителяРеквизита.ПодчиненныеРеквизиты.Добавить(ОписаниеРеквизита);
		
		СоответствиеРеквизитов[СтрокаРеквизита] = ОписаниеРеквизита;
	КонецЦикла;
	
	//Команды
	Для Каждого СтрокаКоманды Из ТаблицаКоманд Цикл
		ОписаниеКоманды = вмс_КонструкторФорм.НовоеОписаниеКоманды();
		СтрокаЗначенийСвойствКоманды = ПолучитьЗначенияСвойствКоманды(СтрокаКоманды);
		ЗаполнитьЗначенияСвойств(ОписаниеКоманды, СтрокаЗначенийСвойствКоманды);
		ОписаниеФормы.Команды.Добавить(ОписаниеКоманды);
	КонецЦикла;
	
	//Элементы
	СоответствиеЭлементов = Новый Соответствие;
	СоответствиеЭлементов[Переменные.СтрокаФормы] = ОписаниеФормы;
	Для Каждого СтрокаЭлемента Из ПолучитьВсеЭлементыДерева(СтруктураЭлементов) Цикл
		ОписаниеЭлемента = СоответствиеЭлементов[СтрокаЭлемента];
		Если ОписаниеЭлемента = Неопределено Тогда
			ОписаниеЭлемента = вмс_КонструкторФорм.НовоеОписаниеЭлемента();
			СоответствиеЭлементов[СтрокаЭлемента] = ОписаниеЭлемента;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ОписаниеЭлемента, СтрокаЭлемента, "ИмяЭлемента, ТипЭлемента, ВидЭлемента");
		
		//
		СвойстваЭлемента = вмс_КонструкторФорм.ПолучитьСвойстваЭлементаФормы(Переменные.СведенияОТипахЭлементовФормы, СтрокаЭлемента.ТипЭлемента, СтрокаЭлемента.ВидЭлемента);
		Для Каждого СвойствоЭлемента Из СвойстваЭлемента Цикл
			ЗначенияСвойстваЭлемента = РК.НайтиЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойствЭлементов, Новый Структура("ИмяЭлемента, ИмяСвойства", СтрокаЭлемента.ИмяЭлемента, СвойствоЭлемента.ИмяСвойства));
			Если ЗначенияСвойстваЭлемента.Количество() > 0 Тогда
				ЗначениеСвойства = ЗначенияСвойстваЭлемента[0].ЗначениеСвойства;
			Иначе
				ЗначениеСвойства = СвойствоЭлемента.ЗначениеПоУмолчанию;
			КонецЕсли;
			ОписаниеЭлемента.Свойства.Вставить(СвойствоЭлемента.ИмяСвойства, ЗначениеСвойства);
		КонецЦикла;
		
		//
		СобытияЭлемента = вмс_КонструкторФорм.ПолучитьСобытияЭлементаФормы(Переменные.СведенияОТипахЭлементовФормы, СтрокаЭлемента.ТипЭлемента, СтрокаЭлемента.ВидЭлемента);
		Для Каждого СобытиеЭлемента Из СобытияЭлемента Цикл
			ИменаОбработчиковСобытияЭлемента = РК.НайтиЭлементыКоллекции(Переменные.ТаблицаОбработчиковСобытийЭлементов, Новый Структура("ИмяЭлемента, ИмяСобытия", СтрокаЭлемента.ИмяЭлемента, СобытиеЭлемента.ИмяСобытия));
			Если ИменаОбработчиковСобытияЭлемента.Количество() > 0 Тогда
				ИмяОбработчика = ИменаОбработчиковСобытияЭлемента[0].ИмяОбработчика;
			Иначе
				ИмяОбработчика = "";
			КонецЕсли;
			ОписаниеЭлемента.События.Вставить(СобытиеЭлемента.ИмяСобытия, ИмяОбработчика);
		КонецЦикла;
		
		РодительСтрокиЭлемента = СтрокаЭлемента.ПолучитьРодителя();
		Если РодительСтрокиЭлемента <> Неопределено Тогда
			ОписаниеРодителяЭлемента = СоответствиеЭлементов[РодительСтрокиЭлемента];
			ОписаниеРодителяЭлемента.ПодчиненныеЭлементы.Добавить(ОписаниеЭлемента);
		КонецЕсли;

	КонецЦикла;
	
	вмс_КонструкторФорм.ЗаполнитьДополнительныеСвойстваОписанияФормы(ОписаниеФормы);
	
	Возврат ОписаниеФормы;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяОбработки()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ИмяОбработки = ОбработкаОбъект.Метаданные().ПолноеИмя();
	Возврат ИмяОбработки;
	
КонецФункции

&НаКлиенте
Функция Инициализация()
	
	Перем РК, РаботаСФормамиКлиент, ОбщегоНазначенияКлиентСервер, РаботаСXML;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	РаботаСФормамиКлиент = глОбщийМодуль("РаботаСФормамиКлиент");
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	РаботаСXML = глОбщийМодуль("РаботаСXMLКлиентСервер");
	
	ОбщиеМодули = Новый Структура;
	ОбщиеМодули.Вставить("РаботаСКоллекциями", РК);
	ОбщиеМодули.Вставить("РаботаСФормамиКлиент", РаботаСФормамиКлиент);
	ОбщиеМодули.Вставить("ОбщегоНазначенияКлиентСервер", ОбщегоНазначенияКлиентСервер);
	ОбщиеМодули.Вставить("РаботаСXML", РаботаСXML);
	
	СведенияОТипахЭлементовФормы = вмс_КонструкторФорм.ПолучитьСведенияОТипахЭлементовФормы();
	
	ТаблицаЗначенийСвойствЭлементов = РК.НоваяКоллекцияЗначений("ИмяЭлемента, ИмяСвойства, ЗначениеСвойства");
	РК.ДобавитьИндексКоллекции(ТаблицаЗначенийСвойствЭлементов, "ИмяЭлемента, ИмяСвойства");
	
	ТаблицаОбработчиковСобытийЭлементов = РК.НоваяКоллекцияЗначений("ИмяЭлемента, ИмяСобытия, ИмяОбработчика");
	РК.ДобавитьИндексКоллекции(ТаблицаОбработчиковСобытийЭлементов, "ИмяЭлемента, ИмяСобытия");

	//здесь хранятся значения свойств реквизитов и команд, которые нельзя хранить в данных формы, ну и заодно храним все остальные значения
	ТаблицаЗначенийСвойствРеквизитов = РК.НоваяКоллекцияЗначений("СтрокаРеквизита, ИмяРеквизита, ТипРеквизита, Заголовок, Статический");
	РК.ДобавитьИндексКоллекции(ТаблицаЗначенийСвойствРеквизитов, "СтрокаРеквизита");

	ТаблицаЗначенийСвойствКоманд = РК.НоваяКоллекцияЗначений("СтрокаКоманды, Имя, Заголовок, Действие, Картинка, Отображение");
	РК.ДобавитьИндексКоллекции(ТаблицаЗначенийСвойствКоманд, "СтрокаКоманды");
	
	Переменные = Новый Структура;
	Переменные.Вставить("СведенияОТипахЭлементовФормы", СведенияОТипахЭлементовФормы);
	Переменные.Вставить("ТаблицаЗначенийСвойствЭлементов", ТаблицаЗначенийСвойствЭлементов);
	Переменные.Вставить("ТаблицаОбработчиковСобытийЭлементов", ТаблицаОбработчиковСобытийЭлементов);
	Переменные.Вставить("ТаблицаЗначенийСвойствРеквизитов", ТаблицаЗначенийСвойствРеквизитов);
	Переменные.Вставить("ТаблицаЗначенийСвойствКоманд", ТаблицаЗначенийСвойствКоманд);
	Переменные.Вставить("ОбщиеМодули", ОбщиеМодули);
	Переменные.Вставить("ИмяОбработки", ПолучитьИмяОбработки());
	Переменные.Вставить("ДействиеПеретаскивания", Вычислить("ДействиеПеретаскивания"));
	Переменные.Вставить("ДопустимыеДействияПеретаскивания", Вычислить("ДопустимыеДействияПеретаскивания"));
	Переменные.Вставить("ИмяМакета", "_Тест_");

	
	СтрокиЭлементов = СтруктураЭлементов.ПолучитьЭлементы();
	СтрокиЭлементов.Очистить();
	СтрокаФормы = СтрокиЭлементов.Добавить();
	СтрокаФормы.ИмяЭлемента = "Форма";
	СтрокаФормы.ТипЭлемента = "ФормаКлиентскогоПриложения";
	ОбновитьСтрокуЭлементаНаФорме(СтрокаФормы);
	Переменные.Вставить("СтрокаФормы", СтрокаФормы);
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗначенияСвойствРеквизита(СтрокаРеквизита)
	
	Перем РК, ОбщегоНазначенияКлиентСервер;
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	ОбщегоНазначенияКлиентСервер = Переменные.ОбщиеМодули.ОбщегоНазначенияКлиентСервер;
	
	КлючРеквизита = Новый Структура("СтрокаРеквизита", СтрокаРеквизита);
	СтрокаЗначенийСвойствРеквизита = РК.НайтиЭлементКоллекции(Переменные.ТаблицаЗначенийСвойствРеквизитов, КлючРеквизита);
	
	Если СтрокаЗначенийСвойствРеквизита=Неопределено Тогда
		СтрокаЗначенийСвойствРеквизита = РК.ДобавитьЭлементКоллекции(Переменные.ТаблицаЗначенийСвойствРеквизитов, КлючРеквизита);
		СтрокаЗначенийСвойствРеквизита.ИмяРеквизита = СтрокаРеквизита.ИмяРеквизита;
		СтрокаЗначенийСвойствРеквизита.ТипРеквизита = ОбщегоНазначенияКлиентСервер.НовоеКвазиОписаниеТипов("Строка");
		СтрокаЗначенийСвойствРеквизита.Заголовок = СтрокаРеквизита.Заголовок;
		СтрокаЗначенийСвойствРеквизита.Статический = СтрокаРеквизита.Статический;
	КонецЕсли;
	
	Возврат СтрокаЗначенийСвойствРеквизита;

КонецФункции

&НаКлиенте
Функция ОбновитьСтрокуРеквизитаНаФорме(СтрокаРеквизита)
	
	Перем ОбщегоНазначенияКлиентСервер;
	
	ОбщегоНазначенияКлиентСервер = Переменные.ОбщиеМодули.ОбщегоНазначенияКлиентСервер;
	
	СтрокаЗначенийСвойствРеквизита = ПолучитьЗначенияСвойствРеквизита(СтрокаРеквизита);
	
	СтрокаРеквизита.ИмяРеквизита = СтрокаЗначенийСвойствРеквизита.ИмяРеквизита;
	СтрокаРеквизита.ПредставлениеТипаРеквизита = ОбщегоНазначенияКлиентСервер.ПредставлениеОбъекта(СтрокаЗначенийСвойствРеквизита.ТипРеквизита);
	СтрокаРеквизита.Заголовок = СтрокаЗначенийСвойствРеквизита.Заголовок;
	СтрокаРеквизита.Статический = СтрокаЗначенийСвойствРеквизита.Статический;
	
	Если СтрокаРеквизита=Элементы.СтруктураРеквизитов.ТекущиеДанные Тогда
		ПриОбновленииТекущейСтрокиРеквизита();
	КонецЕсли;
	
КонецФункции

//////////////////////////////////////////////////////////////
//
//					Команды+
//

&НаКлиенте
Функция УстановитьЗначениеСвойстваКоманды(СтрокаКоманды, ИмяСвойства, ЗначениеСвойства)
	
	ПолучитьЗначенияСвойствКоманды(СтрокаКоманды)[ИмяСвойства] = ЗначениеСвойства;
	
	ОбновитьСтрокуКомандыНаФорме(СтрокаКоманды);
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяНовойКоманды()
	
	СуществующиеИмена = Новый Соответствие;
	
	Для Каждого СтрокаКоманды Из ТаблицаКоманд Цикл
		СуществующиеИмена[СтрокаКоманды.Имя] = Истина;
	КонецЦикла;
	
	Префикс = "Команда";
	НомерКоманды = 1;
	
	Пока Истина Цикл
		НомерКомандыСтрокой = Формат(НомерКоманды, "ЧГ=0");
		ИмяКоманды = Префикс + НомерКомандыСтрокой;
		Если СуществующиеИмена[ИмяКоманды]<>Истина Тогда
			Прервать;
		КонецЕсли;
		НомерКоманды = НомерКоманды + 1;
	КонецЦикла;
	
	Возврат ИмяКоманды;
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗначенияСвойствКоманды(СтрокаКоманды)
	
	Перем РК;
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	КлючКоманды = Новый Структура("СтрокаКоманды", СтрокаКоманды);
	СтрокаЗначенийСвойствКоманды = РК.НайтиЭлементКоллекции(Переменные.ТаблицаЗначенийСвойствКоманд, КлючКоманды);
	
	Если СтрокаЗначенийСвойствКоманды=Неопределено Тогда
		СтрокаЗначенийСвойствКоманды = РК.ДобавитьЭлементКоллекции(Переменные.ТаблицаЗначенийСвойствКоманд, КлючКоманды);
		СтрокаЗначенийСвойствКоманды.Картинка = Новый Картинка;
		СтрокаЗначенийСвойствКоманды.Отображение = ОтображениеКнопки.Авто;
	КонецЕсли;
	
	Возврат СтрокаЗначенийСвойствКоманды;

КонецФункции

&НаКлиенте
Функция ОбновитьСтрокуКомандыНаФорме(СтрокаКоманды)
	
	СтрокаЗначенийСвойствКоманды = ПолучитьЗначенияСвойствКоманды(СтрокаКоманды);
	
	ЗаполнитьЗначенияСвойств(СтрокаКоманды, СтрокаЗначенийСвойствКоманды, "Имя, Действие, Заголовок, Картинка");
	СтрокаКоманды.Отображение = Строка(СтрокаЗначенийСвойствКоманды.Отображение);
	
КонецФункции

&НаКлиенте
Процедура КомандыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	СтрокаНовойКоманды = ТаблицаКоманд.Добавить();
	
	Если Копирование Тогда
		СтрокаКоманды = Элементы.Команды.ТекущиеДанные;
		ЗначенияСвойствКоманды = ПолучитьЗначенияСвойствКоманды(СтрокаКоманды);
		ЗначенияСвойствНовойКоманды = ПолучитьЗначенияСвойствКоманды(СтрокаНовойКоманды);
		ЗаполнитьЗначенияСвойств(ЗначенияСвойствНовойКоманды, ЗначенияСвойствКоманды);
	КонецЕсли;

	ИмяНовойКоманды = ПолучитьИмяНовойКоманды();
	УстановитьЗначениеСвойстваКоманды(СтрокаНовойКоманды, "Имя", ИмяНовойКоманды);
	ОбновитьСтрокуКомандыНаФорме(СтрокаНовойКоманды);
	
	Элементы.Команды.ТекущаяСтрока = СтрокаНовойКоманды.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Перем РаботаСФормамиКлиент;
	
	РаботаСФормамиКлиент = глОбщийМодуль("РаботаСФормамиКлиент");
	
	СтрокаКоманды = Элементы.Команды.ТекущиеДанные;

	Если Элемент.ТекущийЭлемент.Имя = "КомандыКартинка" Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("СтрокаКоманды", СтрокаКоманды);
		ОО = Новый ОписаниеОповещения("ОбработчикВыбораКартинкиКоманды", ЭтаФорма, ДополнительныеПараметры);
		РаботаСФормамиКлиент.ОткрытьДиалогВыбораКартинки(ОО, ЭтаФорма, СтрокаКоманды.Картинка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораКартинкиКоманды(Картинка, ДополнительныеПараметры) Экспорт
	
	Если Картинка=Неопределено Тогда
		Возврат;
	КонецЕсли;

	УстановитьЗначениеСвойстваКоманды(ДополнительныеПараметры.СтрокаКоманды, "Картинка", Картинка);

КонецПроцедуры

&НаКлиенте
Процедура КомандыПолеПриИзменении(Элемент)
	
	СтрокаКоманды = Элементы.Команды.ТекущиеДанные;
	ИмяПоля = Прав(Элемент.Имя, СтрДлина(Элемент.Имя)-СтрДлина("Команды"));
	СтрокаЗначенийСвойствКоманды = ПолучитьЗначенияСвойствКоманды(СтрокаКоманды);
	СтрокаЗначенийСвойствКоманды[ИмяПоля] = СтрокаКоманды[ИмяПоля];
	
КонецПроцедуры

&НаКлиенте
Процедура КомандыКартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандыОтображениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаКоманды = Элементы.Команды.ТекущиеДанные;
	СтрокаЗначенийСвойствКоманды = ПолучитьЗначенияСвойствКоманды(СтрокаКоманды);
	
	СписокВыбора = ПолучитьСписокЗначенийПеречисления("ОтображениеКнопки");
	ТекущийЭлементЗначения = СписокВыбора.НайтиПоЗначению(СтрокаЗначенийСвойствКоманды.Отображение);
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтрокаКоманды", СтрокаКоманды);
	ОО = Новый ОписаниеОповещения("ОбработчикВыбораЗначениеОтображенияКоманды", ЭтаФорма, ДополнительныеПараметры);
	СписокВыбора.ПоказатьВыборЭлемента(ОО, "Отображение", ТекущийЭлементЗначения); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораЗначениеОтображенияКоманды(ЭлементЗначения, ДополнительныеПараметры) Экспорт
	
	Если ЭлементЗначения=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьЗначениеСвойстваКоманды(ДополнительныеПараметры.СтрокаКоманды, "Отображение", ЭлементЗначения.Значение);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокЗначенийПеречисления(ИмяТипаОбъекта)
	
	СписокЗначений = Новый СписокЗначений;
	
	Перечисление = Вычислить(ИмяТипаОбъекта);
	
	Для Каждого Значение Из Перечисление Цикл
		Представление = Строка(Значение);
		СписокЗначений.Добавить(Значение, Представление);
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции

//
//					Команды-
//
//////////////////////////////////////////////////////////////

&НаКлиенте
Процедура Проверить(Команда)
	
	Перем РаботаСФормамиКлиент;
	
	РаботаСФормамиКлиент = глОбщийМодуль("РаботаСФормамиКлиент");

	ИмяКласса = вмс_КонструкторФорм.ПолучитьИмяКлассаМодуляФормы(Переменные.ИмяМакета);
	
	ОписаниеФормы = ПолучитьОписаниеФормы();
	ТекстОписанияФормы = Переменные.ОбщиеМодули.РаботаСXML.XMLСтрокаИзЗначенияУлучшенная(ОписаниеФормы);
	ТекстМодуляКлассаФормы = вмс_КонструкторФорм.ПолучитьТекстМодуляКласса(ИмяКласса, ОписаниеФормы);
	МодульКлассаФормы = Новый Структура;
	МодульКлассаФормы.Вставить("Текст", ТекстМодуляКлассаФормы);
	МодульКлассаФормы.Вставить("Ссылка", ПредопределенноеЗначение("Справочник.вмс_ПрограммныеМодули.ПустаяСсылка"));
	
	Макет = Новый Структура;
	Макет.Вставить("Наименование", Переменные.ИмяМакета);
	Макет.Вставить("Данные", ТекстОписанияФормы);
	Макет.Вставить("МодульКлассаФормы", МодульКлассаФормы);
	Макет.Вставить("ИмяКлассаФормы", ИмяКласса);
	РаботаСФормамиКлиент.ОткрытьФормуИзМакета(Макет, , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьИзXML(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.ПолноеИмяФайла = ИмяФайлаXML;
	ДиалогВыбораФайла.Фильтр = "Файлы в формате XML|*.xml";
	
	ВыбранныеФайлы = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	Если ВыбранныеФайлы=Неопределено ИЛИ ВыбранныеФайлы.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ВыбранныеФайлы[0];
	ЗагрузитьИзФайлаXML(Новый ОписаниеОповещения("ЗагрузитьИзXMLЗавершение", ЭтаФорма, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)), ПолноеИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзXMLЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	
	
	Если Результат Тогда
		ИмяФайлаXML = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаXML(Знач Оповещение, ИмяФайлаXML)
	
	Перем ОбщегоНазначенияКлиентСервер;
	
	ОбщегоНазначенияКлиентСервер = Переменные.ОбщиеМодули.ОбщегоНазначенияКлиентСервер;

	ТекстXML = ОбщегоНазначенияКлиентСервер.ПолучитьТекстИзФайла(ИмяФайлаXML);
	
	ОписаниеФормы = вмс_КонструкторФорм.ЗагрузитьОписаниеИзНативногоТекстаXML(ТекстXML);
	
	ФайлРазметкиФормы = Новый Файл(ИмяФайлаXML);
	ИмяФайлаМодуляФормы = ФайлРазметкиФормы.Путь + ФайлРазметкиФормы.ИмяБезРасширения + "\Module.bsl";
	
	ФайлМодуляФормы = Новый Файл(ИмяФайлаМодуляФормы);
	ФайлМодуляФормы.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ЗагрузитьИзФайлаXMLЗавершение", ЭтаФорма, Новый Структура("ИмяФайлаМодуляФормы, ОписаниеФормы, Оповещение", ИмяФайлаМодуляФормы, ОписаниеФормы, Оповещение)));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаXMLЗавершение(Существует, ДополнительныеПараметры) Экспорт
	
	Перем ОбщегоНазначенияКлиентСервер;
	
	ОбщегоНазначенияКлиентСервер = Переменные.ОбщиеМодули.ОбщегоНазначенияКлиентСервер;

	ИмяФайлаМодуляФормы = ДополнительныеПараметры.ИмяФайлаМодуляФормы;
	ОписаниеФормы = ДополнительныеПараметры.ОписаниеФормы;
	Оповещение = ДополнительныеПараметры.Оповещение;
		
	Если Существует Тогда
		ТекстМодуляФормы = ОбщегоНазначенияКлиентСервер.ПолучитьТекстИзФайла(ИмяФайлаМодуляФормы);
		ОписаниеФормы.ТекстМодуля = ТекстМодуляФормы;
		РедакторМодуляФормы.УстановитьТекст(ТекстМодуляФормы);
	КонецЕсли;
	
	ЗагрузитьДанныеИзОписанияФормы(ОписаниеФормы);
	
	ВыполнитьОбработкуОповещения(Оповещение, Истина);

КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьДанныеИзТекстаОписанияФормы(ТекстОписанияФормы) Экспорт
	
	Перем РаботаСXML;
	
	Если Не ЗначениеЗаполнено(ТекстОписанияФормы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РаботаСXML = Переменные.ОбщиеМодули.РаботаСXML;
	
	ОписаниеФормы = РаботаСXML.ПрочитатьТекстXMLУлучшенная(ТекстОписанияФормы);
	
	Возврат ЗагрузитьДанныеИзОписанияФормы(ОписаниеФормы);
	
КонецФункции

&НаКлиенте
Функция ЗагрузитьДанныеИзОписанияФормы(ОписаниеФормы)
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;

	РедакторМодуляФормы.УстановитьТекст(ОписаниеФормы.ТекстМодуля);
	
	СтруктураЭлементов.ПолучитьЭлементы().Очистить();
	СоответствиеЭлементов = Новый Соответствие;
	ОбходЭлементов = Новый Массив;
	ОбходЭлементов.Добавить(ОписаниеФормы);
	РК.ДобавитьЭлементыКоллекции(ОбходЭлементов, ОписаниеФормы.Элементы);
	
	ТаблицаЗначенийСвойствЭлементов = Переменные.ТаблицаЗначенийСвойствЭлементов;
	РК.ОчиститьЭлементыКоллекции(ТаблицаЗначенийСвойствЭлементов);
	
	ТаблицаОбработчиковСобытийЭлементов = Переменные.ТаблицаОбработчиковСобытийЭлементов;
	РК.ОчиститьЭлементыКоллекции(ТаблицаОбработчиковСобытийЭлементов);
	
	Для Каждого ОписаниеЭлемента Из ОбходЭлементов Цикл
		
		Если ОписаниеЭлемента.Родитель = Неопределено Тогда
			СтрокаРодитель = СтруктураЭлементов;
		Иначе
			СтрокаРодитель = СоответствиеЭлементов[ОписаниеЭлемента.Родитель];
		КонецЕсли;
		
		СтрокаЭлемента = СтрокаРодитель.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЭлемента, ОписаниеЭлемента);
		
		Для Каждого СвойствоЭлемента Из ОписаниеЭлемента.Свойства Цикл
			СтрокаСвойстваЭлемента = РК.ДобавитьЭлементКоллекции(ТаблицаЗначенийСвойствЭлементов);
			СтрокаСвойстваЭлемента.ИмяЭлемента = ОписаниеЭлемента.ИмяЭлемента;
			СтрокаСвойстваЭлемента.ИмяСвойства = СвойствоЭлемента.Ключ;
			СтрокаСвойстваЭлемента.ЗначениеСвойства = СвойствоЭлемента.Значение;
		КонецЦикла;
		
		Для Каждого СобытиеЭлемента Из ОписаниеЭлемента.События Цикл
			СтрокаСобытияЭлемента = РК.ДобавитьЭлементКоллекции(ТаблицаОбработчиковСобытийЭлементов);
			СтрокаСобытияЭлемента.ИмяЭлемента = ОписаниеЭлемента.ИмяЭлемента;
			СтрокаСобытияЭлемента.ИмяСобытия = СобытиеЭлемента.Ключ;
			СтрокаСобытияЭлемента.ИмяОбработчика = СобытиеЭлемента.Значение;
		КонецЦикла;
		
		ОбновитьСтрокуЭлементаНаФорме(СтрокаЭлемента);
		
		СоответствиеЭлементов[ОписаниеЭлемента] = СтрокаЭлемента;
		
	КонецЦикла;
	РК.ИндексироватьКоллекцию(ТаблицаЗначенийСвойствЭлементов);
	РК.ИндексироватьКоллекцию(ТаблицаОбработчиковСобытийЭлементов);
	
	Переменные.СтрокаФормы = СтруктураЭлементов.ПолучитьЭлементы()[0];
	
	//реквизиты
	РК.ОчиститьЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойствРеквизитов);
	СтруктураРеквизитов.ПолучитьЭлементы().Очистить();
	СоответствиеРеквизитов = Новый Соответствие;
	СоответствиеРеквизитов[ОписаниеФормы] = СтруктураРеквизитов;
	Для Каждого ОписаниеРеквизита Из ОписаниеФормы.Реквизиты Цикл
		
		СтрокаРодитель = СоответствиеРеквизитов[ОписаниеРеквизита.Родитель];
		СтрокаРеквизита = СтрокаРодитель.ПолучитьЭлементы().Добавить();
		СтрокаЗначенийСвойствРеквизита = ПолучитьЗначенияСвойствРеквизита(СтрокаРеквизита);
		ЗаполнитьЗначенияСвойств(СтрокаЗначенийСвойствРеквизита, ОписаниеРеквизита);
		ОбновитьСтрокуРеквизитаНаФорме(СтрокаРеквизита);
		
		СоответствиеРеквизитов[ОписаниеРеквизита] = СтрокаРеквизита;
		
	КонецЦикла;
	
	//команды
	РК.ОчиститьЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойствКоманд);
	ТаблицаКоманд.Очистить();
	Для Каждого ОписаниеКоманды Из ОписаниеФормы.Команды Цикл
		
		СтрокаКоманды = ТаблицаКоманд.Добавить();
		СтрокаЗначенийСвойствКоманды = ПолучитьЗначенияСвойствКоманды(СтрокаКоманды);
		ЗаполнитьЗначенияСвойств(СтрокаЗначенийСвойствКоманды, ОписаниеКоманды);
		ОбновитьСтрокуКомандыНаФорме(СтрокаКоманды);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура СтруктураРеквизитовТипРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Перем РаботаСФормамиКлиент, ОписаниеОповещенияОЗакрытии;
	
	РаботаСФормамиКлиент = Переменные.ОбщиеМодули.РаботаСФормамиКлиент;
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаРеквизита = Элементы.СтруктураРеквизитов.ТекущиеДанные;
	СтрокаЗначенийСвойствРеквизита = ПолучитьЗначенияСвойствРеквизита(СтрокаРеквизита);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КвазиОписаниеТипов", СтрокаЗначенийСвойствРеквизита.ТипРеквизита);
	ДополнительныеПараметрыОповещения = Новый Структура;
	ДополнительныеПараметрыОповещения.Вставить("СтрокаЗначенийСвойствРеквизита", СтрокаЗначенийСвойствРеквизита);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбработкаРедактированияТипаРеквизита", ЭтаФорма, ДополнительныеПараметрыОповещения);
	РаботаСФормамиКлиент.ОткрытьФормуУлучшенная("ОбщаяФорма.ФормаРедактированияТипаДанных", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРедактированияТипаРеквизита(КвазиОписаниеТипов, ДополнительныеПараметры) Экспорт
	
	Если КвазиОписаниеТипов=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.СтрокаЗначенийСвойствРеквизита.ТипРеквизита = КвазиОписаниеТипов;
	
	ОбновитьСтрокуРеквизитаНаФорме(ДополнительныеПараметры.СтрокаЗначенийСвойствРеквизита.СтрокаРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураРеквизитовПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СтруктураРеквизитовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование, КолонкаРеквизита=Ложь)
	СтрокаРеквизита = Элемент.ТекущиеДанные;
	Если НоваяСтрока Тогда
		ПрефиксРеквизита = ?(КолонкаРеквизита, "Колонка", "Реквизит");
		ПолучитьИмяНовогоРеквизита(СтрокаРеквизита, ПрефиксРеквизита);
		ОбновитьСтрокуРеквизитаНаФорме(СтрокаРеквизита);
	КонецЕсли;
	
	Переменные.Вставить("ПредыдущееИмяРедактируемогоРеквизита", СтрокаРеквизита.ИмяРеквизита);
КонецПроцедуры

&НаКлиенте
Процедура СтруктураРеквизитовИмяРеквизитаПриИзменении(Элемент)
	СтрокаРеквизита = Элементы.СтруктураРеквизитов.ТекущиеДанные;
	Если ПроверитьИмяРеквизита(СтрокаРеквизита) Тогда
		Переменные.ПредыдущееИмяРедактируемогоРеквизита = СтрокаРеквизита.ИмяРеквизита;
		СтрокаЗначенийСвойствРеквизита = ПолучитьЗначенияСвойствРеквизита(СтрокаРеквизита);
		СтрокаЗначенийСвойствРеквизита.ИмяРеквизита = СтрокаРеквизита.ИмяРеквизита;
	Иначе
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("СтрокаРеквизита", СтрокаРеквизита);
		ОО = Новый ОписаниеОповещения("ОбработчикВводаНеверногоИмениРеквизита", ЭтаФорма, ДополнительныеПараметры);
		ПоказатьПредупреждение(ОО, "Неверное имя реквизита!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВводаНеверногоИмениРеквизита(ДополнительныеПараметры) Экспорт
	
	СтрокаРеквизита = ДополнительныеПараметры.СтрокаРеквизита;
	СтрокаЗначенийСвойствРеквизита = ПолучитьЗначенияСвойствРеквизита(СтрокаРеквизита);
	СтрокаЗначенийСвойствРеквизита.ИмяРеквизита = Переменные.ПредыдущееИмяРедактируемогоРеквизита;
	ОбновитьСтрокуРеквизитаНаФорме(СтрокаРеквизита);
	
КонецПроцедуры

&НаКлиенте
Функция ПриОбновленииТекущейСтрокиРеквизита()
	
	СтрокаРеквизита = Элементы.СтруктураРеквизитов.ТекущиеДанные;
	Если СтрокаРеквизита=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Элементы.СтруктураРеквизитовКнопкаДобавитьКолонкуРеквизита.Доступность = МожноДобавитьКолонкуРеквизита(СтрокаРеквизита);
	
КонецФункции

&НаКлиенте
Процедура СтруктураРеквизитовЗаголовокПриИзменении(Элемент)

	СтрокаРеквизита = Элементы.СтруктураРеквизитов.ТекущиеДанные;
	СтрокаЗначенийСвойствРеквизита = ПолучитьЗначенияСвойствРеквизита(СтрокаРеквизита);
	СтрокаЗначенийСвойствРеквизита.Заголовок = СтрокаРеквизита.Заголовок;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураРеквизитовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

КонецПроцедуры

&НаКлиенте
Процедура СтруктураРеквизитовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураРеквизитовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	СтрокаРеквизита = СтруктураРеквизитов.ПолучитьЭлементы().Добавить();
	Элементы.СтруктураРеквизитов.ТекущаяСтрока = СтрокаРеквизита.ПолучитьИдентификатор();
	СтруктураРеквизитовПриНачалеРедактирования(Элемент, Истина, Копирование);
	Элементы.СтруктураРеквизитов.ИзменитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКолонкуРеквизита(Команда)
	СтрокаРеквизита = Элементы.СтруктураРеквизитов.ТекущиеДанные;
	СтрокаРеквизитаКоллекции = ПолучитьСтрокуРеквизитаКоллекции(СтрокаРеквизита);
	Если СтрокаРеквизитаКоллекции<>Неопределено Тогда
		СтрокаКолонкиРеквизита = СтрокаРеквизитаКоллекции.ПолучитьЭлементы().Добавить();
		Элементы.СтруктураРеквизитов.ТекущаяСтрока = СтрокаКолонкиРеквизита.ПолучитьИдентификатор();
		СтруктураРеквизитовПриНачалеРедактирования(Элементы.СтруктураРеквизитов, Истина, Ложь, Истина);
		Элементы.СтруктураРеквизитов.ИзменитьСтроку();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтруктураРеквизитовПередУдалением(Элемент, Отказ)
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	Отказ = Истина;
	
	ВыделенныеСтроки = Новый Массив;
	Для Каждого ИдентификаторСтрокиРеквизита Из Элементы.СтруктураРеквизитов.ВыделенныеСтроки Цикл
		СтрокаРеквизита = СтруктураРеквизитов.НайтиПоИдентификатору(ИдентификаторСтрокиРеквизита);
		ВыделенныеСтроки.Добавить(СтрокаРеквизита);
	КонецЦикла;
	
	Для Каждого СтрокаРеквизита Из ПолучитьВсеЭлементыДерева(ВыделенныеСтроки, Истина, Истина) Цикл
		НайденныеСтрокиЗначенийСвойствРеквизита = РК.НайтиЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойствРеквизитов, Новый Структура("СтрокаРеквизита", СтрокаРеквизита));
		РК.УдалитьЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойствРеквизитов, НайденныеСтрокиЗначенийСвойствРеквизита);
		УдалитьСтрокуДерева(СтруктураРеквизитов, СтрокаРеквизита);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция МожноДобавитьКолонкуРеквизита(знач СтрокаРеквизита)
	
	СтрокаРеквизитаКоллекции = ПолучитьСтрокуРеквизитаКоллекции(СтрокаРеквизита);
	
	Возврат СтрокаРеквизитаКоллекции<>Неопределено;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуРеквизитаКоллекции(СтрокаРеквизита)

	СтрокаРеквизитаКоллекции = СтрокаРеквизита;
	
	Пока СтрокаРеквизитаКоллекции<>Неопределено Цикл
		
		СтрокаЗначенийСвойствРеквизита = ПолучитьЗначенияСвойствРеквизита(СтрокаРеквизитаКоллекции);
		
		МассивИменТипов = СтрокаЗначенийСвойствРеквизита.ТипРеквизита.МассивИменТипов;
		
		Если МассивИменТипов.Найти("ТаблицаЗначений")<>Неопределено ИЛИ МассивИменТипов.Найти("ДеревоЗначений")<>Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		СтрокаРеквизитаКоллекции = СтрокаРеквизитаКоллекции.ПолучитьРодителя();
		
	КонецЦикла;
	
	Возврат СтрокаРеквизитаКоллекции;
	
КонецФункции

&НаКлиенте
Процедура СтруктураРеквизитовПриАктивизацииСтроки(Элемент)
	
	ПриОбновленииТекущейСтрокиРеквизита();
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьЗначениеСвойстваЭлемента(ИмяЭлемента, ИмяСвойства, ЗначениеСвойства)
	
	ЗначенияСвойств = Новый Структура(ИмяСвойства, ЗначениеСвойства);
	
	УстановитьЗначенияСвойствЭлемента(ИмяЭлемента, ЗначенияСвойств)
	
КонецФункции

&НаКлиенте
Функция УстановитьЗначенияСвойствЭлемента(ИмяЭлемента, ЗначенияСвойств)
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	Для Каждого ЗначениеСвойства Из ЗначенияСвойств Цикл
		КлючСвойства = Новый Структура("ИмяЭлемента, ИмяСвойства", ИмяЭлемента, ЗначениеСвойства.Ключ);
		СтрокаЗначенияСвойстваЭлемента = РК.НайтиЭлементКоллекции(Переменные.ТаблицаЗначенийСвойствЭлементов, КлючСвойства);
		Если СтрокаЗначенияСвойстваЭлемента=Неопределено Тогда
			СтрокаЗначенияСвойстваЭлемента = РК.ДобавитьЭлементКоллекции(Переменные.ТаблицаЗначенийСвойствЭлементов, КлючСвойства);
		КонецЕсли;
		
		СтрокаЗначенияСвойстваЭлемента.ЗначениеСвойства = ЗначениеСвойства.Значение;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура Тест(Команда)
	
	ОписаниеФормы = ПолучитьОписаниеФормы();
	
	Для Каждого СвойствоОбъекта Из ОписаниеФормы.Свойства Цикл
		ОписаниеФормы.Свойства[СвойствоОбъекта.Ключ] = Строка(СвойствоОбъекта.Значение);
	КонецЦикла;
	
	Для Каждого ОписаниеЭлемента Из ОписаниеФормы.Элементы Цикл
		
		Для Каждого СвойствоОбъекта Из ОписаниеЭлемента.Свойства Цикл
			ОписаниеЭлемента.Свойства[СвойствоОбъекта.Ключ] = Строка(СвойствоОбъекта.Значение);
		КонецЦикла;
		
		ОписаниеЭлемента.Родитель = Неопределено;
		ОписаниеЭлемента.Элементы.Очистить();
		
	КонецЦикла;
	
	ОписаниеФормы.Элементы.Очистить();

	Для Каждого ОписаниеРеквизита Из ОписаниеФормы.Реквизиты Цикл
		
		ОписаниеРеквизита.Родитель = Неопределено;
		ОписаниеРеквизита.Реквизиты.Очистить();
		
	КонецЦикла;

	ТестНаСервере(ОписаниеФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТестНаСервере(Данные)
	
	ТочкаОстановы = 0;
	
КонецФункции

&НаКлиенте
Процедура Сохранить(Команда)
	
	Закрыть(ПолучитьТекстОписанияФормы());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Перем РаботаСФормамиКлиент;
	
	РаботаСФормамиКлиент = Переменные.ОбщиеМодули.РаботаСФормамиКлиент;
	
	ТекстОписанияФормы = РаботаСФормамиКлиент.ПолучитьПараметрФормыНаКлиенте(ЭтаФорма, "ТекстОписанияФормы");
	Макет = РаботаСФормамиКлиент.ПолучитьПараметрФормыНаКлиенте(ЭтаФорма, "Макет");
	Если Макет <> Неопределено Тогда
		ДанныеМакета = РаботаСФормамиКлиент.ПолучитьДанныеМакета(Макет);
		Переменные.ИмяМакета = ДанныеМакета.Наименование;
	КонецЕсли;
	
	ЗагрузитьДанныеИзТекстаОписанияФормы(ТекстОписанияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Оповестить("СохранитьМакет", ЭтаФорма);
КонецПроцедуры

#Если Клиент Тогда
Инициализация();
#КонецЕсли