#Область ПрограммныйИнтерфейс   

Функция СкладЯчейкиСоответствуетСкладуЗоны(Ячейка, ЗонаДоступа) Экспорт
	СкладЯчейки = ПолучитьСкладЯчейки(Ячейка);
	СкладЗоны  = ПолучитьСкладЗоны(ЗонаДоступа); 
	
	Если СкладЯчейки <> СкладЗоны Тогда
		Возврат Ложь;	
	КонецЕсли;       
	
	Возврат Истина;

КонецФункции

Функция ПомещениеЯчейкиСоответствуетПомещениюЗоны(Ячейка, ЗонаДоступа) Экспорт
	ПомещениеЯчейки = ПолучитьПомещениеЯчейки(Ячейка);	
	ПомещениеЗоны = ПолучитьПомещениеЗоны(ЗонаДоступа);  
	
	Если ПомещениеЯчейки <> ПомещениеЗоны Тогда
		Возврат Ложь;	
	КонецЕсли;       
	
	Возврат Истина;

КонецФункции   

#КонецОбласти       

#Область СлужебныйПрограммныйИнтерфейс 
Функция ПолучитьПомещениеЯчейки(Ячейка)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_МестаХранения.Помещение КАК Помещение
		|ИЗ
		|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
		|ГДЕ
		|	вмс_МестаХранения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ячейка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка= РезультатЗапроса.Выбрать();	
	Выборка.Следующий();     
	
	Возврат Выборка.Помещение;	
	
КонецФункции  

Функция ПолучитьПомещениеЗоны(ЗонаДоступа)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ГруппыЯчеек.Помещение КАК Помещение
		|ИЗ
		|	Справочник.вмс_ГруппыЯчеек КАК вмс_ГруппыЯчеек
		|ГДЕ
		|	вмс_ГруппыЯчеек.Ссылка = &ЗонаДоступа";
	
	Запрос.УстановитьПараметр("ЗонаДоступа", ЗонаДоступа);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();           
	
	Возврат Выборка.Помещение;
	
КонецФункции

Функция ПолучитьСкладЯчейки(Ячейка)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_МестаХранения.Владелец КАК Склад
		|ИЗ
		|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
		|ГДЕ
		|	вмс_МестаХранения.Ссылка = &Ссылка";  
	Запрос.УстановитьПараметр("Ссылка", Ячейка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Склад;
	
КонецФункции  

Функция ПолучитьСкладЗоны(ЗонаДоступа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ГруппыЯчеек.Склад КАК Склад
		|ИЗ
		|	Справочник.вмс_ГруппыЯчеек КАК вмс_ГруппыЯчеек
		|ГДЕ
		|	вмс_ГруппыЯчеек.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗонаДоступа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Склад;
	
КонецФункции


#КонецОбласти   

