
Процедура ПередЗаписью(Отказ, Замещение)      
	ТекущаяЯчейка = Отбор.Ячейка.Значение;
	ТекущаяЗонаДоступа = Отбор.ЗонаДоступа.Значение;  
	
	Если НЕ РегистрыСведений.вмс_ЯчейкиПоЗонамБыстрогоДоступа.СкладЯчейкиСоответствуетСкладуЗоны(ТекущаяЯчейка, ТекущаяЗонаДоступа) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Нельзя закрепить ячейку %1 за зоной доступа %2! Не соответствуют склады!", ТекущаяЯчейка, ТекущаяЗонаДоступа);
		Сообщение.Сообщить(); 
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	Если НЕ РегистрыСведений.вмс_ЯчейкиПоЗонамБыстрогоДоступа.ПомещениеЯчейкиСоответствуетПомещениюЗоны(ТекущаяЯчейка, ТекущаяЗонаДоступа) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Нельзя закрепить ячейку %1 за зоной доступа %2! Не соответствуют помещения!", ТекущаяЯчейка, ТекущаяЗонаДоступа);
		Сообщение.Сообщить(); 
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

