#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПолноеСопоставление = Ложь Тогда
		ПроверкаСопоставления = ПроверитьСопоставлениеСУчетнойСистемой();
		
		Если ПроверкаСопоставления Тогда
			ПолноеСопоставление = Истина;
			Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ПереданНаСборку;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.Отклонен Тогда
		НайденныйДок = вмс_ЛичныйКабинетПоклажедателяВызовСервер.НайтиДокументУчетнойСистемы(ЭтотОбъект.Ссылка);		
		Если НайденныйДок <> Неопределено Тогда
			НайденныйДок.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);	
		КонецЕсли;
		
		ЭтотОбъект.УстановитьПометкуУдаления(Истина);   
		
		вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПередатьСтатусДокумента(ЭтотОбъект.Ссылка, "ВыдачаСХранения");  
	ИначеЕсли Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ОтбылСоСклада Тогда	    
		вмс_ЛичныйКабинетПоклажедателяВызовСервер.ОтправитьДокВыдачаСХранения(ЭтотОбъект.Ссылка);	
	Иначе
		вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПередатьСтатусДокумента(ЭтотОбъект.Ссылка, "ВыдачаСХранения");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОтказРеквизит = Ложь;   
	
	Если Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.Новый Тогда
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записывать = Истина;   
		Движения.вмс_ОстаткиТоваровПоклажедателя.Очистить();
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записать();
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	вмс_ВыдачаСХраненияСписокНоменклатуры.НоменклатураПоклажедателя КАК НоменклатураПоклажедателя,
		|	СУММА(вмс_ВыдачаСХраненияСписокНоменклатуры.КоличествоФакт) КАК Количество,
		|	вмс_ВыдачаСХраненияСписокНоменклатуры.Ссылка.Контрагент КАК Контрагент,
		|	вмс_ВыдачаСХраненияСписокНоменклатуры.Ссылка.Склад КАК Склад
		|ПОМЕСТИТЬ ДокТЧ
		|ИЗ
		|	Документ.вмс_ВыдачаСХранения.Товары КАК вмс_ВыдачаСХраненияСписокНоменклатуры
		|ГДЕ
		|	вмс_ВыдачаСХраненияСписокНоменклатуры.Ссылка = &Ссылка  
		|	И вмс_ВыдачаСХраненияСписокНоменклатуры.Ссылка.Контрагент = &Контрагент
		|	И вмс_ВыдачаСХраненияСписокНоменклатуры.Ссылка.Склад = &Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	вмс_ВыдачаСХраненияСписокНоменклатуры.НоменклатураПоклажедателя,
		|	вмс_ВыдачаСХраненияСписокНоменклатуры.Ссылка.Контрагент,
		|	вмс_ВыдачаСХраненияСписокНоменклатуры.Ссылка.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.НоменклатураПоклажедателя КАК НоменклатураПоклажедателя,
		|	ДокТЧ.Количество КАК Количество,
		|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ДокТЧ.Контрагент КАК Контрагент,
		|	ДокТЧ.Склад КАК Склад
		|ИЗ
		|	ДокТЧ КАК ДокТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОстаткиТоваровПоклажедателя.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						ДокТЧ.НоменклатураПоклажедателя
		|					ИЗ
		|						ДокТЧ КАК ДокТЧ)) КАК Остатки
		|		ПО (ДокТЧ.НоменклатураПоклажедателя = Остатки.Номенклатура
		|				И ДокТЧ.Контрагент = Остатки.Контрагент И ДокТЧ.Склад = Остатки.Склад)"; 
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Склад", Склад);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не хватает товара """ + Выборка.НоменклатураПоклажедателя + """, из необходимых " + Выборка.Количество + " в наличии только " + Выборка.КоличествоОстаток; //ТУ_Чаликова 25.10.24 +-
				
				Сообщение.Сообщить();  
				
				ОтказРеквизит = Истина;
				Движения.вмс_ОстаткиТоваровПоклажедателя.Записывать = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если ОтказРеквизит Тогда   
			Если ЭтотОбъект.Проведен = Истина Тогда
				ЭтотОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли; 
			
			Возврат;
		Иначе
			Для Каждого ТекСтрокаСписокНоменклатуры Из Товары Цикл
				Движение = Движения.вмс_ОстаткиТоваровПоклажедателя.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Номенклатура = ТекСтрокаСписокНоменклатуры.НоменклатураПоклажедателя;
				Движение.Количество = ТекСтрокаСписокНоменклатуры.КоличествоФакт;
				Движение.Контрагент = Контрагент; 
				Движение.Склад = Склад;
			КонецЦикла;
			
			Движения.вмс_ОстаткиТоваровПоклажедателя.Записать();
		КонецЕсли;
	ИначеЕсли Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ОтбылСоСклада Тогда   
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записывать = Истина;   
		Движения.вмс_ОстаткиТоваровПоклажедателя.Очистить();    
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записать(); 
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записывать = Истина;
		
		Для Каждого ТекСтрокаСписокНоменклатуры Из Товары Цикл
			Движение = Движения.вмс_ОстаткиТоваровПоклажедателя.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаСписокНоменклатуры.НоменклатураПоклажедателя;
			Движение.Количество = ТекСтрокаСписокНоменклатуры.КоличествоФакт;       
			Движение.Контрагент = Контрагент;
			Движение.Склад = Склад;
		КонецЦикла; 
		
		Движения.вмс_ОстаткиТоваровПоклажедателя.Записать(); 
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСопоставлениеСУчетнойСистемой()
	
	Проверка = Истина;
	
	Для каждого СтрокаТЧ Из ЭтотОбъект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатураПоклажедателя.Номенклатура) Тогда
			Проверка = Ложь;
		Иначе
			СтрокаТЧ.Номенклатура = СтрокаТЧ.НоменклатураПоклажедателя.Номенклатура;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатураПоклажедателя.Упаковка) Тогда
			Проверка = Ложь;
		Иначе
			СтрокаТЧ.Упаковка = СтрокаТЧ.НоменклатураПоклажедателя.Упаковка;	
		КонецЕсли;
		
		Если вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПроверкаИспользованияХарактеристикПоКонтрагенту(Контрагент) Тогда
			Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.НоменклатураПоклажедателя, "БезХарактеристики") Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатураПоклажедателя.Характеристика) Тогда
					Проверка = Ложь;
				Иначе
					СтрокаТЧ.Характеристика = СтрокаТЧ.НоменклатураПоклажедателя.Характеристика;
				КонецЕсли;						
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Проверка;
	
КонецФункции

#Иначе
#КонецЕсли




