
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаКлиенте
Перем КэшТоваров;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Ссылка", Ссылка);
	Параметры.Свойство("ТипОперации", ТипОперации);
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана ссылка на операцию!'");
	КонецЕсли;
	
	ЗаполнитьКонтекстФормы();
	ЗаполнитьПараметрыПечатиЭтикетокПоШаблону();
	НастроитьКнопки();
	УстановитьУсловноеОформление();
	ЗаполнитьСпискиВыбора();
	НастроитьСписокКодыМаркировки();
	НастроитьСписокАгрегатыВПакете();
	
	ОбновитьПризнакОперацияОграниченаТарифом();
	НастроитьЭлементыФормы();
	НастроитьЭлементыФормыОФ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПодсказкуФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_ОбработаныКодыВРедакторе" Тогда
		
		ЗаполнитьКонтекстФормыИУстановитьВидимость();
		СохранитьОперацию();
		Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
		
		Если ТребуетсяЗакрытьОперациюПослеРедактированияКодов(Параметр) Тогда
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_Товар_Изменен" Тогда
		Если ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().УведомлениеОПриемке Тогда
			СведенияОТоварах_ДополнитьДаннымиТоваров();
		КонецЕсли
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_КодыВыгружены" Тогда
		Если Параметр = Ссылка Тогда
			УстановитьСтатусКодыВыгружены();
			НастроитьЭлементыФормы();
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_ШаблонЭтикетки_Изменен" Тогда
		Если Параметр = ШаблонТоварнойЭтикетки
			Или Параметр = ШаблонГрупповойЭтикетки
			Или Параметр = ШаблонТранспортнойЭтикетки
			Или Параметр = ШаблонЭтикеткиНабора Тогда
			ЗаполнитьПараметрыПечатиЭтикетокПоШаблону();
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_ИзмененРежимТехническогоСпециалиста" Тогда
		НастроитьЭлементыФормы_РежимТехническогоСпециалиста(Параметр);
	КонецЕсли;
	
	Если ИмяСобытия = "КонтурМаркировка_СменитьВладельца" И Источник = ВладелецФормы Тогда
		ВладелецФормы = Параметр;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

&НаСервере
Процедура НастроитьКнопки()
	
	СформироватьДополнительныеКнопки();
	ПоказатьКнопкиПоискаДля82();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстФормы(Знач ОписаниеОперации = Неопределено)
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	ДопСвойства = МодульОбъекта().Перечисление_ДопСвойства();
	
	Если ОписаниеОперации = Неопределено Тогда
		ОписаниеОперации = МодульОбъекта().Операция_ПрочитатьОперацию(Ссылка);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеОперации, , "Товары");
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеОперации.ДопРеквизиты);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, МодульОбъекта().Операция_СтатусыОперации(Ссылка));
	
	ЗаполнитьТовары(ОписаниеОперации);
	
	Если ТипОперации = ТипыОпераций.ВходящийУПД Тогда
		ЗаполнитьКодыВходящегоУПД(ОписаниеОперации);
	КонецЕсли;
	
	Если ТипОперации = ТипыОпераций.УведомлениеОПриемке Тогда
		ЗаполнитьСведенияОТоварах(ОписаниеОперации);
	КонецЕсли;
	
	Если ТипОперации = ТипыОпераций.ПодборКодовНаТСД
		Или ТипОперации = ТипыОпераций.ПодборТоваровИКодовНаТСД Тогда
		Элементы.СсылкаКонтрагентИННКПП.Заголовок = Заголовок_ИННКПП();
		Если ПодборСПомощьюМобильногоУстройства Тогда
			Элементы.СсылкаИнформацияОДоставке.Заголовок = Заголовок_ИнформацияОДоставке();
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючКода)
		И Не ЗначениеЗаполнено(КодМаркировки) Тогда
		КодМаркировки = МодульОбъекта().КодМаркировки_НайтиПоКлючу(КлючКода);
	КонецЕсли;
	
	ОписаниеОшибки = "";
	ОписаниеЗадачи = МодульОбъекта().Задача_Прочитать(Ссылка);
	Если ЗначениеЗаполнено(ОписаниеЗадачи) Тогда
		
		ОписаниеОшибки = ОписаниеЗадачи.ДопРеквизиты.КраткоеОписаниеОшибки;
		Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОписаниеОшибки = ОписаниеЗадачи.ОписаниеОшибки;
		КонецЕсли;
		
		ПодсказкаЧастичноПринятогоОтчетаОНанесении = ПодсказкаЧастичноПринятогоОтчетаОНанесении();
		Если ЗначениеЗаполнено(ПодсказкаЧастичноПринятогоОтчетаОНанесении) Тогда
			ОписаниеОшибки = ПодсказкаЧастичноПринятогоОтчетаОНанесении + Символы.ПС + Символы.ПС + ОписаниеОшибки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеЗадачи.ИдентификаторДокумента) Тогда
			ИдентификаторДокумента = ОписаниеЗадачи.ИдентификаторДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
	ПечатьИзСвободногоОстатка = МодульОбъекта().Операция_ЭтоПечатьИзСвободногоОстатка(ОписаниеОперации);
	ОбъектВПроцессеОбновления = Не МодульОбъекта().ПроверитьОбъектВПроцессеОбновления(Ссылка, Ложь);
	
	Если ЗначениеЗаполнено(СервисПровайдер) Тогда
		ЗаказКодовДляСервисПровайдера = 1;
	КонецЕсли;
	
	Подписант = МодульОбъекта().ДопСвойство_Прочитать(Ссылка, ДопСвойства.Подписант);
	Сертификат = МодульОбъекта().ДопСвойство_Прочитать(Ссылка, ДопСвойства.Сертификат);
	
	ПосчитатьКоличествоСтрокТаблицФормы();
	ЗаполнитьКоличествоКодовВТоварах();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстФормыИУстановитьВидимость()
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Функция ОписаниеОперацииПоКонтекстуФормы()
	
	Результат = МодульОбъекта().Новый_Операция();
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма, , "Товары");
	ЗаполнитьЗначенияСвойств(Результат.ДопРеквизиты, ЭтаФорма);
	ЗаполнитьЗначенияСвойств(Результат.Статусы, ЭтаФорма);
	
	Если ТипОперации = ТипыОпераций.ПечатьКодов Тогда
		
		Стр = Результат.Товары.Добавить();
		Стр.НомерСтроки = 1;
		Стр.Товар = Товар;
		Стр.КлючНоменклатуры1С = КлючНоменклатуры1С;
		Стр.КоличествоУпаковок = КоличествоКодовТребуется;
		
	ИначеЕсли МодульОбъекта().ЭтоОтчетОНанесении(ТипОперации) Или ЭтоКорректировкаВариативногоСрокаГодности() Тогда
		
		Для Каждого СтрТов Из Товары Цикл
			Стр = Результат.Товары.Добавить();
			Стр.НомерСтроки = Товары.Индекс(СтрТов) + 1;
			ЗаполнитьЗначенияСвойств(Стр, СтрТов);
			Стр.АльтернативныеСрокиГодности = АльтСрокиГодностиТовара(ЭтаФорма, СтрТов.КлючСтрокиОперации);
		КонецЦикла;
		
	Иначе
		
		Для Каждого СтрТов Из Товары Цикл
			Стр = Результат.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, СтрТов);
			Стр.НомерСтроки = Товары.Индекс(СтрТов) + 1;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтоКорректировкаВариативногоСрокаГодности()
	
	Результат = Ложь;
	
	Если ТипОперации = МодульОбъекта().Перечисление_ТипыОпераций().КорректировкаСведенийОКодах
		И ВидКорректируемыхСведений = МодульОбъекта().Перечисление_ВидыКорректируемыхСведений().ВариативныйСрокГодности Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТовары(ОписаниеОперации)
	
	Товары.Очистить();
	АльтернативныеСрокиГодности.Очистить();
	
	ТипыСрокаГодности = МодульОбъекта().Перечисление_ТипыСроковГодности();
	ВидыСведений = МодульОбъекта().Перечисление_ВидыКорректируемыхСведений();
	
	Если ТипОперации = МодульОбъекта().Перечисление_ТипыОпераций().ПечатьКодов Тогда
		Если ЗначениеЗаполнено(ОписаниеОперации.Товары) Тогда
			СтрТовара = ОписаниеОперации.Товары[0];
			Товар = СтрТовара.Товар;
			КлючНоменклатуры1С = СтрТовара.КлючНоменклатуры1С;
			КоличествоКодовТребуется = СтрТовара.КоличествоУпаковок;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Для каждого СтрТовара Из ОписаниеОперации.Товары Цикл
		
		Стр = Товары.Добавить();
		Стр.Товар = СтрТовара.Товар;
		Стр.КлючНоменклатуры1С = СтрТовара.КлючНоменклатуры1С;
		ЗаполнитьСтрокуТоваровДаннымиИБ(Стр);
		ЗаполнитьЗначенияСвойств(Стр, СтрТовара);
		ЗаполнитьПризнакПодлежитВетеринарномуКонтролю(Стр);
		
		УказатьСрокГодностиВариативно = (Стр.ДопустимоУказаниеСрокаГодности
		И ЗначениеЗаполнено(СтрТовара.АльтернативныеСрокиГодности)
		И (ТипСрокаГодности = ТипыСрокаГодности.СрокГодностиБольше72СУсловием
		Или ВидКорректируемыхСведений = ВидыСведений.ВариативныйСрокГодности));
		
		Если УказатьСрокГодностиВариативно Тогда
			
			Стр.АльтернативныйСрокГодности = НСтр("ru = 'Вариативно'");
			
			Для Каждого АльтСрок Из СтрТовара.АльтернативныеСрокиГодности Цикл
				НоваяСтрока = АльтернативныеСрокиГодности.Добавить();
				НоваяСтрока.Тип = АльтСрок.Ключ;
				НоваяСтрока.ДатаСрокаГодности = АльтСрок.Значение;
				НоваяСтрока.КлючСтрокиОперации = Стр.КлючСтрокиОперации;
			КонецЦикла;
			
			ОбновитьПризнакЗаполненияАльтернативныхСроковГодности(ЭтаФорма, Стр);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьПодчиненныеОперации();
	ЗаполнитьКоличествоЗаводскихСерийныхНомеров();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПризнакПодлежитВетеринарномуКонтролю(Стр)
	
	Стр.ПодлежитВетеринарномуКонтролю = Неопределено;
	
	Если ЗначениеЗаполнено(Стр.Товар) Тогда
		ОписаниеТовара = МодульОбъекта().Товар_Прочитать(Стр.Товар);
		Стр.ПодлежитВетеринарномуКонтролю = ОписаниеТовара.ПодлежитВетеринарномуКонтролю;
		Возврат;
	КонецЕсли;
	
	Если МодульОбъекта().Операция_ТоварыВАгрегатахТребуютВСД(Ссылка, Стр.КлючСтрокиОперации) Тогда
		Стр.ПодлежитВетеринарномуКонтролю = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодчиненныеОперации()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	ТипыСтатусов = МодульОбъекта().Перечисление_ТипыСтатусов();
	
	ПодходящиеОперации = Новый Массив;
	ПодходящиеОперации.Добавить(ТипыОпераций.ОтчетОНанесении);
	ПодходящиеОперации.Добавить(ТипыОпераций.ОтчетОНанесенииНаТСД);
	ПодходящиеОперации.Добавить(ТипыОпераций.ВводВОборот);
	ПодходящиеОперации.Добавить(ТипыОпераций.ЗаказКодов);
	ПодходящиеОперации.Добавить(ТипыОпераций.РегистрацияНаборов);
	ПодходящиеОперации.Добавить(ТипыОпераций.КорректировкаСведенийОКодах);
	ПодходящиеОперации.Добавить(ТипыОпераций.Перемаркировка);
	ПодходящиеОперации.Добавить(ТипыОпераций.РегистрацияКИГУ);
	ПодходящиеОперации.Добавить(ТипыОпераций.УведомлениеОСостоянииКодов);
	ПодходящиеОперации.Добавить(ТипыОпераций.РезервированиеПартий);
	
	Если Не МодульОбъекта().МассивСодержитЗначение(ПодходящиеОперации, ТипОперации) Тогда
		Возврат;
	КонецЕсли;
	
	КлючиСтрокОперации = Товары.Выгрузить(,"КлючСтрокиОперации").ВыгрузитьКолонку("КлючСтрокиОперации");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПодчиненныеОперации.Ссылка КАК Операция,
	|	ПодчиненныеОперации.КлючСтрокиОперацииОснования КАК КлючСтрокиОперации,
	|	СтатусыОпераций.Статус КАК Статус
	|ИЗ
	|	Справочник.КонтурМаркировка_Операции КАК ПодчиненныеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыОпераций КАК СтатусыОпераций
	|		ПО (ПодчиненныеОперации.Ссылка = СтатусыОпераций.Операция)
	|			И (СтатусыОпераций.ТипСтатуса = &ОсновнойСтатус)
	|ГДЕ
	|	ПодчиненныеОперации.ОперацияОснование = &Ссылка
	|	И ПодчиненныеОперации.КлючСтрокиОперацииОснования В(&КлючиСтрокОперации)");
	Запрос.УстановитьПараметр("КлючиСтрокОперации", КлючиСтрокОперации);
	Запрос.УстановитьПараметр("ОсновнойСтатус", ТипыСтатусов.ОсновнойСтатус);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	СтатусыПодчиненныхОпераций = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрТовара Из Товары Цикл
		СтрОперации = СтатусыПодчиненныхОпераций.Найти(СтрТовара.КлючСтрокиОперации, "КлючСтрокиОперации");
		Если СтрОперации <> Неопределено Тогда
			СтрТовара.Операция = СтрОперации.Операция;
			СтрТовара.ОперацияСтатус = СтрОперации.Статус;
			СтрТовара.ОперацияИндексКартинки = ИндексКартинкиСтатусаПодчиненнойОперации(СтрОперации.Статус);
		Иначе
			СтрТовара.ОперацияИндексКартинки = -1;
		КонецЕсли;
	КонецЦикла;
	
	ДобавитьЧужиеПодчиненныеОперацииДляИнформации();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЧужиеПодчиненныеОперацииДляИнформации()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	ТипыСтатусов = МодульОбъекта().Перечисление_ТипыСтатусов();
	ИменаДопРеквизитов = МодульОбъекта().Перечисление_ИменаДопРеквизитов();
	
	ПодходящиеОперации = Новый Массив;
	ПодходящиеОперации.Добавить(ТипыОпераций.РезервированиеПартий);
	
	Если Не МодульОбъекта().МассивСодержитЗначение(ПодходящиеОперации, ТипОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборОперация = Новый Структура("Операция", МодульОбъекта().ПустаяОперация());
	НомераПартий = МодульОбъекта().ТаблицаЗначений_ВыгрузитьКолонку(Товары.Выгрузить(ОтборОперация, "НомерПартии"), "НомерПартии", Истина);
	Если Не ЗначениеЗаполнено(НомераПартий) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДопРеквизиты.Объект КАК Операция,
	|	ДопРеквизиты.Значение КАК НомерПартии,
	|	СтатусыОпераций.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК ДопРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыОпераций КАК СтатусыОпераций
	|		ПО ДопРеквизиты.Объект = СтатусыОпераций.Операция
	|			И (СтатусыОпераций.ТипСтатуса = &ОсновнойСтатус)
	|ГДЕ
	|	ДопРеквизиты.Значение В(&НомераПартий)
	|	И ДопРеквизиты.ИмяРеквизита = &РеквизитНомерПартии
	|	И ДопРеквизиты.Объект ССЫЛКА Справочник.КонтурМаркировка_Операции
	|	И ДопРеквизиты.Объект.ТипОперации = &РезервированиеОднойПартии");
	Запрос.УстановитьПараметр("НомераПартий", НомераПартий);
	Запрос.УстановитьПараметр("ОсновнойСтатус", ТипыСтатусов.ОсновнойСтатус);
	Запрос.УстановитьПараметр("РеквизитНомерПартии", ИменаДопРеквизитов.НомерПартии);
	Запрос.УстановитьПараметр("РезервированиеОднойПартии", ТипыОпераций.РезервированиеОднойПартии);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОтборНомерПартии = Новый Структура("Операция, НомерПартии", МодульОбъекта().ПустаяОперация());
	
	Пока Выборка.Следующий() Цикл
		ОтборНомерПартии.НомерПартии = Выборка.НомерПартии;
		Для Каждого СтрТов Из Товары.НайтиСтроки(ОтборНомерПартии) Цикл
			СтрТов.Операция = Выборка.Операция;
			СтрТов.ОперацияСтатус = Выборка.Статус;
			СтрТов.ОперацияИндексКартинки = ИндексКартинкиСтатусаПодчиненнойОперации(Выборка.Статус);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоЗаводскихСерийныхНомеров()
	
	Если ТипОперации <> МодульОбъекта().Перечисление_ТипыОпераций().ОтчетОНанесении Тогда
		Возврат;
	КонецЕсли;
	Если Не Товары_ТребуютсяЗаводскиеСерийныеНомера() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрДок Из Товары Цикл
		СтрДок.КоличествоЗСН = 0;
	КонецЦикла;
	
	Отбор = Новый Структура("КлючСтрокиОперации");
	Для каждого СтрЗСН Из МодульОбъекта().КодыОпераций_КоличествоЗаводскихСерийныхНомеров(Ссылка) Цикл
		Отбор.КлючСтрокиОперации = СтрЗСН.КлючСтрокиОперации;
		Для каждого СтрТовара Из Товары.НайтиСтроки(Отбор) Цикл
			СтрТовара.КоличествоЗСН = СтрЗСН.КоличествоЗСН;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ИндексКартинкиСтатусаПодчиненнойОперации(Статус)
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		ИндексКартинки = -1;
	ИначеЕсли Статус = СтатусыОпераций.Новый Тогда
		ИндексКартинки = 0;
	ИначеЕсли Статус = СтатусыОпераций.ОперацияЗавершена
		Или Статус = СтатусыОпераций.ПринятЧастично Тогда
		ИндексКартинки = 4;
	ИначеЕсли Статус = СтатусыОпераций.ОшибкаОбработки Тогда
		ИндексКартинки = 2;
	ИначеЕсли Статус = СтатусыОпераций.НеУдалосьРаспознатьКоды Тогда
		ИндексКартинки = 3;
	Иначе
		ИндексКартинки = 3;
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКодыВходящегоУПД(Операция)
	
	РезультатСверки = МодульОбъекта().Операция_ВходящийУПД_РезультатСверки(Операция);
	КоллекцияСтрок = КодыВходящегоУПД.ПолучитьЭлементы();
	
	ТаблицаПартий = РеквизитФормыВЗначение("Партии");
	ТаблицаПартий.Очистить();
	
	Для каждого Стр Из РезультатСверки.КодыДокумента Цикл
		
		НоваяСтрока = КоллекцияСтрок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		
		СтрокиКодов = НоваяСтрока.ПолучитьЭлементы();
		
		Если ЗначениеЗаполнено(Стр.КодОСУ) Тогда
			СтрОСУ = СтрокиКодов.Добавить();
			СтрОСУ.КодМаркировки = Стр.КодОСУ;
			ЗаполнитьКодыВходящегоУПД_ЗаполнитьСтрокиКодов(СтрОСУ.ПолучитьЭлементы(), Стр.КодыМаркировкиПоОСУ);
			ЗаполнитьКодыВходящегоУПД_ЗаполнитьКартинки(СтрОСУ);
		КонецЕсли;
		
		ЗаполнитьКодыВходящегоУПД_ЗаполнитьСтрокиКодов(СтрокиКодов, Стр.КодыМаркировки);
		ЗаполнитьКодыВходящегоУПД_ЗаполнитьКартинки(НоваяСтрока);
		
		ЗаполнитьКодыВходящегоУПД_ЗаполнитьПартии(ТаблицаПартий, Стр);
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаПартий, "Партии");
	
	Для каждого ЛишнийКод Из РезультатСверки.ЛишниеКоды Цикл
		НоваяСтрока = ЛишниеКодыВходящегоУПД.Добавить();
		НоваяСтрока.КодМаркировки = ЛишнийКод;
	КонецЦикла;
	
	УстановитьВидимостьОбщихИтоговВходящегоУПД(РезультатСверки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодыВходящегоУПД_ЗаполнитьПартии(ТаблицаПартий, СтрокаКода)
	
	Для Каждого СтрПартии Из СтрокаКода.Партии Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаПартий.Добавить(), СтрПартии);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодыВходящегоУПД_ЗаполнитьСтрокиКодов(СтрокиКодов, КодыМаркировки)
	
	Для каждого Стр Из КодыМаркировки Цикл
		
		СтрКода = СтрокиКодов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрКода, Стр);
		ЗаполнитьКодыВходящегоУПД_ЗаполнитьКартинки(СтрКода);
		
		Если ЗначениеЗаполнено(Стр.ВложенныеКоды) Тогда
			ЗаполнитьКодыВходящегоУПД_ЗаполнитьСтрокиКодов(СтрКода.ПолучитьЭлементы(), Стр.ВложенныеКоды);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодыВходящегоУПД_ЗаполнитьКартинки(СтрокаУПД)
	
	ЭтоСтрокаТовара = Не ЗначениеЗаполнено(СтрокаУПД.КодМаркировки);
	
	СтрокаУПД.КартинкаПринадлежитОтправителю = ЗаполнитьКодыВходящегоУПД_КартинкаПроверки(СтрокаУПД.ПринадлежитОтправителю);
	СтрокаУПД.КартинкаВведенВОборот = ЗаполнитьКодыВходящегоУПД_КартинкаПроверки(СтрокаУПД.ВведенВОборот);
	СтрокаУПД.КартинкаОтсканирован = ЗаполнитьКодыВходящегоУПД_КартинкаПроверки(СтрокаУПД.Отсканирован);
	СтрокаУПД.КартинкаПройденаПроверкаРД = ЗаполнитьКодыВходящегоУПД_КартинкаПроверки(СтрокаУПД.ПройденаПроверкаРД);
	
	Если ЭтоСтрокаТовара Тогда
		СтрокаУПД.КартинкаЕстьОшибкиВСтроке = ЗаполнитьКодыВходящегоУПД_КартинкаИтогов(СтрокаУПД);
		СтрокаУПД.КартинкаКорректныйФорматКода = -1;
	Иначе
		СтрокаУПД.КартинкаКорректныйФорматКода = ЗаполнитьКодыВходящегоУПД_КартинкаОшибки(СтрокаУПД.КорректныйФорматКода);
		СтрокаУПД.КартинкаЕстьОшибкиВСтроке = -1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьКодыВходящегоУПД_КартинкаПроверки(Значение)
	
	Если Значение = Истина Тогда
		Результат = 4;
	ИначеЕсли Значение = Ложь Тогда
		Результат = 2;
	Иначе
		Результат = -1;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаполнитьКодыВходящегоУПД_КартинкаОшибки(Значение)
	
	Если Значение = Ложь Тогда
		Результат = 2;
	Иначе
		Результат = -1;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаполнитьКодыВходящегоУПД_КартинкаИтогов(СтрокаТоваров)
	
	Результат = -1;
	
	Если СтрокаТоваров.КодОСУВалидный = Ложь
		Или СтрокаТоваров.ЗарегистрированВГИСМТ = Ложь
		Или СтрокаТоваров.РазрешенаОтгрузкаПоОСУ = Ложь Тогда
		Результат = 2;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТоваров.КодовСОшибками) Тогда
		Результат = 2;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #Область УстановкаВидимости

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	СброситьВидимость();
	
	НастроитьЭлементыФормы_ЗаказКодов();
	УстановитьВидимостьПолей_ЗаказКодов();
	
	НастроитьЭлементыФормы_ВводВОборот();
	УстановитьВидимостьПолей_ВводВОборот();
	
	НастроитьЭлементыФормы_ВыводИзОборота();
	УстановитьВидимостьПолей_ВыводИзОборота();
	
	НастроитьЭлементыФормы_АгрегацияКодов();
	
	НастроитьЭлементыФормы_РегистрацияАгрегатов();
	
	НастроитьЭлементыФормы_ПечатьКодов();
	
	НастроитьЭлементыФормы_СообщениеОбОтгрузке();
	
	НастроитьЭлементыФормы_ПодборНаТСД();
	
	НастроитьЭлементыФормы_РасформированиеАгрегатов();
	
	НастроитьЭлементыФормы_НаполнениеАгрегатовНаТСД();
	УстановитьВидимостьПолей_НаполнениеАгрегатовНаТСД();
	
	НастроитьЭлементыФормы_ОтчетОНанесении();
	УстановитьВидимостьПолей_ОтчетОНанесении();
	
	НастроитьЭлементыФормы_ОперацииСтрокАгрегатов();
	
	НастроитьЭлементыФормы_ВходящийУПД();
	
	НастроитьЭлементыФормы_ОтчетОВыбытииНаТСД();
	
	НастроитьЭлементыФормы_ОтчетОВыбытии();
	
	НастроитьЭлементыФормы_Перемаркировка();
	
	НастроитьЭлементыФормы_НаполнениеНаборовНаТСД();
	
	НастроитьЭлементыФормы_ФормированиеКИГУ();
	
	НастроитьЭлементыФормы_НаполнениеКИГУНаТСД();
	
	НастроитьЭлементыФормы_РегистрацияКИГУ();
	
	НастроитьЭлементыФормы_УведомлениеОПриемке();
	
	НастроитьЭлементыФормы_ВозвратВОборот();
	УстановитьВидимостьПолей_ВозвратВОборот();
	
	НастроитьЭлементыФормы_ТрансформацияАгрегата();
	
	НастроитьЭлементыФормы_ФормированиеАТК();
	
	НастроитьЭлементыФормы_РасформированиеАТК();
	
	НастроитьЭлементыФормы_ТрансформацияАТК();
	
	НастроитьЭлементыФормы_РегистрацияНаборов();
	
	НастроитьЭлементыФормы_РасформированиеНаборов();
	
	НастроитьЭлементыФормы_КорректировкаСведенийОКодах();
	
	НастроитьЭлементыФормы_УведомлениеОСостоянииКодов();
	УстановитьВидимостьПолей_УведомлениеОСостоянииКодов();
	
	НастроитьЭлементыФормы_РезервированиеПартий();
	
	УстановитьВидимостьПоСтатусу();
	УстановитьВидимостьВыгрузкиКодов();
	
	Если ОбъектВПроцессеОбновления Тогда
		РежимТолькоПросмотр = Истина;
		ЭтаФормаУстановитьТолькоПросмотр();
	КонецЕсли;
	
	НастроитьЭлементыФормы_ДляВсехОпераций();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыОФ()
	
	Если Не МодульОбъекта().ЭтоОбычноеПриложение() Тогда
		Возврат;
	КонецЕсли;
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
		Элементы.СсылкаПодсказки.РастягиватьПоГоризонтали = Истина;
	Иначе
		Элементы.ТекстПодсказки.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
	Если Не МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
		
		ЭлементыРД = Новый Массив;
		ЭлементыРД.Добавить(Элементы.ТоварыРазрешительныйДокумент_ВводВОборот);
		ЭлементыРД.Добавить(Элементы.ТоварыРазрешительныйДокумент_ВозвратВОборот);
		ЭлементыРД.Добавить(Элементы.ТоварыРазрешительныйДокумент_Корректировка);
		ЭлементыРД.Добавить(Элементы.ТоварыРазрешительныйДокумент_Перемаркировка);
		
		Для каждого Элемент Из ЭлементыРД Цикл
			Элемент.КнопкаСпискаВыбора = Истина;
			Элемент.УстановитьДействие("НачалоВыбораИзСписка", "ТоварыРазрешительныйДокументНачалоВыбора");
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СброситьВидимость()
	
	Элементы.ЗакладкаКодыПакетаАгрегатов.Видимость = Ложь;
	Элементы.ЗакладкаКодыМаркировки.Видимость = Ложь;
	Элементы.ЗакладкаАгрегаты.Видимость = Ложь;
	Элементы.ЗакладкаТовары.Видимость = Ложь;
	Элементы.ЗакладкаКодыВходящегоУПД.Видимость = Ложь;
	Элементы.ЗакладкаЛишниеКодыВходящегоУПД.Видимость = Ложь;
	Элементы.ЗакладкаСведенияОТоварах.Видимость = Ложь;
	Элементы.ЗакладкаПечатьЭтикеток.Видимость = Ложь;
	
	Элементы.ТоварыПодчиненнаяОперация.Видимость = Ложь;
	Элементы.КодыМаркировкиГруппаПодчиненнаяОперация.Видимость = Ложь;
	
	Элементы.Кнопка_ДобавитьТовар.Видимость = Ложь;
	Элементы.Кнопка_ПодобратьКодыДляКИГУ.Видимость = Ложь;
	Элементы.Кнопка_ЗаполнитьТоварыПоКодуМаркировки.Видимость = Ложь;
	Элементы.Кнопка_ПодобратьКоды.Видимость = Ложь;
	Элементы.Кнопка_ДобавитьАгрегат.Видимость = Ложь;
	Элементы.Кнопка_СоздатьАгрегаты.Видимость = Ложь;
	Элементы.Кнопка_ПолучитьПовторноКодыИзТСД.Видимость = Ложь;
	Элементы.Кнопка_ВернутьНаТСД.Видимость = Ложь;
	Элементы.Кнопка_НазначитьДругойТСД.Видимость = Ложь;
	Элементы.Кнопка_НапечататьЭтикетки.Видимость = Ложь;
	Элементы.Кнопка_ЗаказКодовНапечататьЭтикетки.Видимость = Ложь;
	Элементы.Кнопка_Перемаркировать.Видимость = Ложь;
	Элементы.Кнопка_ОтчитатьсяОНанесении.Видимость = Ложь;
	Элементы.ПодменюВернутьНаУстройство.Видимость = Ложь;
	Элементы.Кнопка_ЗагрузитьКодыИзТабличногоДокумента.Видимость = Ложь;
	Элементы.Кнопка_ОбновитьСтатусыКодов.Видимость = Ложь;
	Элементы.Кнопка_ДобавитьКодАТК.Видимость = Ложь;
	
	Элементы.Агрегат.Видимость = Ложь;
	Элементы.МенюСохранитьКодыВФайл.Видимость = Ложь;
	Элементы.КомментарийВозвратаНаТСД.Видимость = Ложь;
	Элементы.ОбъемноСортовойУчет.Видимость = Ложь;
	Элементы.ГруппаДобавленияАгрегатов.Видимость = Ложь;
	Элементы.ГруппаПараметрыПечати.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоСтатусу()
	
	// BSLLS:CognitiveComplexity-off
	// BSLLS:CyclomaticComplexity-off
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	ВидыПродукции = МодульОбъекта().Перечисление_ВидыПродукции();
	СпособыВыпуска = МодульОбъекта().Перечисление_СпособыВыпускаТоваров();
	СостоянияКодов = МодульОбъекта().Перечисление_СостоянияКодов();
	
	РежимТолькоПросмотр = Ложь;
	Элементы.Кнопка_УдалитьОперацию.Видимость = Ложь;
	Элементы.Кнопка_ВыполнитьОперацию.Видимость = Ложь;
	
	Элементы.ОписаниеОшибки.Видимость = Ложь;
	Элементы.ДеталиОшибки.Видимость = Ложь;
	Элементы.Кнопка_ПовторитьОтправкуСначала.Видимость = Ложь;
	Элементы.Кнопка_ПовторитьОбменСМоментаОшибки.Видимость = Ложь;
	Элементы.Кнопка_НачатьРедактирование.Видимость = Ложь;
	Элементы.Кнопка_ЗавершитьРедактирование.Видимость = Ложь;
	Элементы.РедакторКодовГиперссылка.Видимость = Ложь;
	Элементы.Кнопка_ОтменитьВыводИзОборота.Видимость = Ложь;
	Элементы.Кнопки_УведомлениеОПриемке.Видимость = Ложь;
	Элементы.Кнопка_ВывестиИзОборота.Видимость = Ложь;
	
	Если МодульОбъекта().УдаляемыеСтатусыОпераций().Найти(ОсновнойСтатус) <> Неопределено Тогда
		Если ОсновнойСтатус = СтатусыОпераций.Новый Тогда
			Элементы.Кнопка_УдалитьОперацию.Видимость = МодульОбъекта().ЭтоИнтерактивнаяОперация(ТипОперации);
		Иначе
			Элементы.Кнопка_УдалитьОперацию.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ОсновнойСтатус = СтатусыОпераций.Новый
		Или ОсновнойСтатус = СтатусыОпераций.ОшибкаЗаполнения Тогда
		
		Если ТипОперации <> ТипыОпераций.ПечатьКодов
			И ТипОперации <> ТипыОпераций.ОтменаВыводаИзоборота Тогда
			Элементы.Кнопка_ВыполнитьОперацию.Видимость = Истина;
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.ДобавлениеВАгрегат
			Или ТипОперации = ТипыОпераций.ИзъятиеИзАгрегата
			Или ТипОперации = ТипыОпераций.ДобавлениеВАТК 
			Или ТипОперации = ТипыОпераций.ИзъятиеИзАТК Тогда
			Элементы.РедакторКодовГиперссылка.Видимость = Истина;
		КонецЕсли;
		
	Иначе
		
		Если ТипОперации = ТипыОпераций.ПечатьКодов Тогда
			Элементы.Кнопка_ВыполнитьОперацию.Видимость = Истина;
		КонецЕсли;
		
		Если (ТипОперации = ТипыОпераций.АгрегацияКодов
			Или ТипОперации = ТипыОпераций.НаполнениеАгрегатовНаТСД)
			И ОсновнойСтатус = СтатусыОпераций.СозданыАгрегаты Тогда
			Элементы.Кнопка_ВыполнитьОперацию.Видимость = Истина;
		КонецЕсли;
		
		Если ОсновнойСтатус <> СтатусыОпераций.ОшибкаОбработки
			И ОсновнойСтатус <> СтатусыОпераций.СозданыАгрегаты
			И ТипОперации <> ТипыОпераций.ПечатьКодов Тогда
			РежимТолькоПросмотр = Истина;
		КонецЕсли;
		
		Если ОсновнойСтатус = СтатусыОпераций.ОшибкаОбработки
			Или ОсновнойСтатус = СтатусыОпераций.ОшибкаОбменаССервисом Тогда
			Элементы.ОписаниеОшибки.Видимость = Истина;
			Элементы.ДеталиОшибки.Видимость = Истина;
			Элементы.Кнопка_ПовторитьОбменСМоментаОшибки.Видимость = Истина;
		КонецЕсли;
		
		Если ОсновнойСтатус = СтатусыОпераций.ПринятЧастично Тогда
			Элементы.ОписаниеОшибки.Видимость = Истина;
			Элементы.ДеталиОшибки.Видимость = Истина;
		КонецЕсли;
		
		Если Не ОперацияПопадаетНаТСД()
			И ОсновнойСтатус = СтатусыОпераций.ОшибкаОбработки
			И Не ТипОперации = ТипыОпераций.УведомлениеОПриемке Тогда
			Элементы.Кнопка_ПовторитьОтправкуСначала.Видимость = Истина;
			Элементы.Кнопка_ПовторитьОтправкуСначала.КнопкаПоУмолчанию = Истина;
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.ОтчетОНанесенииНаТСД Тогда
			
			Если ОсновнойСтатус = СтатусыОпераций.ОшибкаОбработки Тогда
				// На случай если не хватило денежных средств
				// и после пополнения счета нужно повторить отправку в ГИС МТ
				Элементы.Кнопка_ПовторитьОтправкуСначала.Видимость = Истина;
				Элементы.Кнопка_ПовторитьОтправкуСначала.КнопкаПоУмолчанию = Истина;
			КонецЕсли;
			
			Если ОсновнойСтатус = СтатусыОпераций.ОтправленНаТСД Тогда
				Элементы.Кнопка_НачатьРедактирование.Видимость = Истина;
			КонецЕсли;
			
			Если ОсновнойСтатус = СтатусыОпераций.ОжиданиеЗавершенияИзменений Тогда
				
				Элементы.Кнопка_ЗавершитьРедактирование.Видимость = Истина;
				
				РежимТолькоПросмотр = Ложь;
				
				Элементы.ГруппаВерхЛево.ТолькоПросмотр = Истина;
				Элементы.ЗакладкаОсновная.ТолькоПросмотр = Истина;
				Элементы.ВидПродукцииОтчетОНанесении.ТолькоПросмотр = Истина;
				Элементы.ТоварыТовар.ТолькоПросмотр = Истина;
				Элементы.ТоварыКлючНоменклатуры1С.ТолькоПросмотр = Истина;
				Элементы.ТоварыКоличествоУпаковок.ТолькоПросмотр = Истина;
				Элементы.ТоварыКоличествоКодов.ТолькоПросмотр = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если МодульОбъекта().ЭтоОтчетОНанесении(ТипОперации)
			И ОсновнойСтатус = СтатусыОпераций.ОперацияЗавершена Тогда
			Элементы.Кнопка_ВвестиВОборот.Видимость = Истина;
			Элементы.Кнопка_КорректироватьСведенияОКодах.Видимость = МодульОбъекта().ВидПродукцииДопускаетКорректировкуСведенийОКодах(ВидПродукции);
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.ВводВОборот Тогда
			Если ОсновнойСтатус = СтатусыОпераций.ОперацияЗавершена Тогда
				Элементы.Кнопка_КорректироватьСведенияОКодах.Видимость = МодульОбъекта().ВидПродукцииДопускаетКорректировкуСведенийОКодах(ВидПродукции);
			КонецЕсли;
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.НаполнениеНаборовНаТСД Тогда
			Если ОсновнойСтатус = СтатусыОпераций.ОшибкаОбработки Тогда
				РежимТолькоПросмотр = Истина;
				Элементы.Кнопка_ВернутьНаТСД.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.НаполнениеКИГУНаТСД Тогда
			Если ОсновнойСтатус = СтатусыОпераций.ОшибкаОбработки Тогда
				РежимТолькоПросмотр = Истина;
				Элементы.Кнопка_ВернутьНаТСД.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.ВыводИзОборота
			И ОсновнойСтатус = СтатусыОпераций.ОперацияЗавершена Тогда
			Если МодульОбъекта().ВидПродукцииДопускаетОтменуВыводаИзОборота(ВидПродукции, ОбъемноСортовойУчет) Тогда
				Элементы.Кнопка_ОтменитьВыводИзОборота.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.ЗаказКодов
			И ОсновнойСтатус = СтатусыОпераций.ОперацияЗавершена
			И Не ЗначениеЗаполнено(ДокументУчета) Тогда
			
			Если СпособВыпускаТоваров = СпособыВыпуска.Перемаркировка Тогда
				Элементы.Кнопка_Перемаркировать.Видимость = Истина;
				Элементы.Кнопка_ОбновитьСтатусыКодов.Видимость = Истина;
				Элементы.КодыМаркировки.ТолькоПросмотр = Истина;
			КонецЕсли;
			
			Если МодульОбъекта().ВидПродукцииПоддерживаетОтчетОНанесении(ВидПродукции) Тогда
				Если ЗначениеЗаполнено(ТипЗаказаКодов)
					Или СпособВыпускаТоваров = СпособыВыпуска.Перемаркировка Тогда
					Элементы.Кнопка_ОтчитатьсяОНанесении.Видимость = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОсновнойСтатус = СтатусыОпераций.НеУдалосьРаспознатьКоды
			Или ОсновнойСтатус = СтатусыОпераций.ОбнаруженоДублированиеВАгрегатах Тогда
			Элементы.РедакторКодовГиперссылка.Заголовок = НСтр("ru = 'Редактировать коды с ошибками'");
			Элементы.РедакторКодовГиперссылка.Видимость = Истина;
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.УведомлениеОПриемке Тогда
			РазрешеноИзменятьДокумент = СтатусУведомленияОПриемкеДопускаетИзменениеДокумента();
			Элементы.Кнопки_УведомлениеОПриемке.Видимость = РазрешеноИзменятьДокумент;
			Элементы.СведенияОТоварах.ТолькоПросмотр = Не РазрешеноИзменятьДокумент;
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.ПодборКодовНаТСД
			Или ТипОперации = ТипыОпераций.ПодборТоваровИКодовНаТСД Тогда
			РежимТолькоПросмотр = Истина;
			Элементы.ПодборСПомощьюМобильногоУстройства.ТолькоПросмотр = Истина;
			Элементы.МобильноеУстройство.ТолькоПросмотр = Истина;
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.УведомлениеОСостоянииКодов
			И ОсновнойСтатус = СтатусыОпераций.ОперацияЗавершена Тогда
			РежимТолькоПросмотр = Истина;
			Элементы.Кнопка_ИзменитьСостояниеКодов.Видимость = Истина;
			Если СостояниеКодов = СостоянияКодов.ОтгрузкаНаЭкспорт Тогда
				Элементы.Кнопка_ВывестиИзОборота.Видимость = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.ФормированиеКИГУ
			И ОсновнойСтатус = СтатусыОпераций.ОперацияЗавершена Тогда
			РежимТолькоПросмотр = Истина;
			Элементы.ТоварыКоличествоКодовВложенногоТовара.Видимость = Ложь;
			Элементы.Кнопка_ПодобратьКодыДляКИГУ.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтаФормаУстановитьТолькоПросмотр();
	
	// BSLLS:CyclomaticComplexity-on
	// BSLLS:CognitiveComplexity-on
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей_ВыводИзОборота()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ВыводИзОборота Тогда
		Возврат;
	КонецЕсли;

	Если МодульОбъекта().ВидПродукцииПоддерживаетВыводИзОборотаПоОСУ(ВидПродукции) Тогда
		Элементы.ОбъемноСортовойУчет.Видимость = Истина;
	Иначе
		Элементы.ОбъемноСортовойУчет.Видимость = Ложь;
	КонецЕсли;
	
	Если ОбъемноСортовойУчет Тогда
		Элементы.ТоварыЦена.Заголовок = "Общая стоимость с НДС, руб";
	Иначе
		Элементы.ТоварыЦена.Заголовок = "Цена, руб";
	КонецЕсли;
	Элементы.ТоварыВес.Видимость = ОбъемноСортовойУчет;
	Элементы.ТоварыВес.ОграничениеТипа = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(9, 3));
	
	ВидыДокументов = МодульОбъекта().Перечисление_ВидыПервичныхДокументов();
	ПричиныВывода = МодульОбъекта().Перечисление_ПричиныВыводаИзОборота();
	
	ЕстьИННПолучателя = ЗначениеЗаполнено(ИННПолучателя);
	ТребуетсяЦена = МодульОбъекта().ПричинаВыводаИзОборотаТребуетУказатьЦену(ПричинаВыводаИзОборота, ЕстьИННПолучателя);
	ДопускаетсяЦена = МодульОбъекта().ПричинаВыводаИзОборотаДопускаетУказаниеЦены(ПричинаВыводаИзОборота);
	
	ТребуетсяПервичныйДокумент = МодульОбъекта().ПричинаВыводаИзОборотаТребуетПервичныйДокумент(ПричинаВыводаИзОборота);
	ДопускаетсяПервичныйДокумент = МодульОбъекта().ПричинаВыводаИзОборотаДопускаетПервичныйДокумент(ПричинаВыводаИзОборота);
	
	ТребуетсяИННПолучателя = МодульОбъекта().ПричинаВыводаИзОборотаТребуетИННПолучателя(ПричинаВыводаИзОборота);
	ДопускаетсяИННПолучателя = МодульОбъекта().ПричинаВыводаИзОборотаДопускаетИННПолучателя(ПричинаВыводаИзОборота);
	
	ПоказатьЦену = (ТребуетсяЦена Или ДопускаетсяЦена);
	ПоказатьГосКонтракт = (ПричинаВыводаИзОборота = ПричиныВывода.ПродажаПоГосКонтракту
		Или ПричинаВыводаИзОборота = ПричиныВывода.ПродажаПоСделкеСГосударственнойТайной);
	ПоказатьНаименованиеПричины = (ПричинаВыводаИзОборота = ПричиныВывода.Прочее);
	ПоказатьПервичныйДокумент = (ТребуетсяПервичныйДокумент Или ДопускаетсяПервичныйДокумент);
	ПоказатьНаименованиеДокумента = (ПоказатьПервичныйДокумент И ВидПервичногоДокумента = ВидыДокументов.Прочее);
	ПоказатьКодСтраныПолучателя = (ПричинаВыводаИзОборота = ПричиныВывода.ЭкспортЕАЭС);
	ПоказатьИННПолучателя = (ТребуетсяИННПолучателя Или ДопускаетсяИННПолучателя);
	ПоказатьНомерПартии = ОбъемноСортовойУчет И МодульОбъекта().ВидПродукцииПоддерживаетПартионныйУчет(ВидПродукции);
	
	Элементы.ТоварыЦена.Видимость = ПоказатьЦену;
	Элементы.ВидПервичногоДокумента.Видимость = ПоказатьПервичныйДокумент;
	Элементы.НомерДокументаВыводаИзОборота.Видимость = ПоказатьПервичныйДокумент;
	Элементы.ДатаДокументаВыводаИзОборота.Видимость = ПоказатьПервичныйДокумент;
	Элементы.НаименованиеПервичногоДокумента.Видимость = ПоказатьНаименованиеДокумента;
	Элементы.НаименованиеПричиныВыводаИзОборота.Видимость = ПоказатьНаименованиеПричины;
	Элементы.ИдентификаторГосКонтрактаВыводИзОборота.Видимость = ПоказатьГосКонтракт;
	Элементы.КодСтраныПолучателяВыводИзОборота.Видимость = ПоказатьКодСтраныПолучателя;
	Элементы.ИННПолучателяВыводИзОборота.Видимость = ПоказатьИННПолучателя;
	
	Элементы.ПлощадкаВыводИзОборота.Видимость = ВидПродукцииДопускаетУказаниеПлощадкиПоТипуОперации();
	
	Элемент = Элементы.ВидПервичногоДокумента;
	Элемент.АвтоОтметкаНезаполненного = ТребуетсяПервичныйДокумент;
	Элемент.ОтметкаНезаполненного = Элемент.АвтоОтметкаНезаполненного И Не ЗначениеЗаполнено(ВидПервичногоДокумента);
	
	Элемент = Элементы.НомерДокументаВыводаИзОборота;
	Элемент.АвтоОтметкаНезаполненного = ЗначениеЗаполнено(ВидПервичногоДокумента);
	Элемент.ОтметкаНезаполненного = Элемент.АвтоОтметкаНезаполненного И Не ЗначениеЗаполнено(НомерДокумента);
	
	Элемент = Элементы.ДатаДокументаВыводаИзОборота;
	Элемент.АвтоОтметкаНезаполненного = ЗначениеЗаполнено(ВидПервичногоДокумента);
	Элемент.ОтметкаНезаполненного = Элемент.АвтоОтметкаНезаполненного И Не ЗначениеЗаполнено(ДатаДокумента);
	
	Элемент = Элементы.ИННПолучателяВыводИзОборота;
	Элемент.АвтоОтметкаНезаполненного = ТребуетсяИННПолучателя;
	Элемент.ОтметкаНезаполненного = Элемент.АвтоОтметкаНезаполненного И Не ЗначениеЗаполнено(ИННПолучателя);
	
	Элементы.ТоварыЦена.АвтоОтметкаНезаполненного = ТребуетсяЦена;
	
	Элементы.НомерПартииВыводИзОборота.Видимость = ПоказатьНомерПартии;
	Элементы.ТоварыНомерПартииВыводИзОборота.Видимость = ПоказатьНомерПартии;
	
	УстановитьПодсказкуНомераДекларации();
	УстановитьПодсказкуИдентификатораГосКонтракта();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей_ВводВОборот()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ВводВОборот Тогда
		Возврат;
	КонецЕсли;
	
	ТипыЗаказов = МодульОбъекта().Перечисление_ТипыПроизводственныхЗаказов();
	СпособыВвода = МодульОбъекта().Перечисление_СпособыВводаВОборот();
	ВидыПродукции = МодульОбъекта().Перечисление_ВидыПродукции();
	
	ЭтоИмпорт = (СпособВводаВОборот = СпособыВвода.Импорт);
	ЭтоОстатки = (СпособВводаВОборот = СпособыВвода.Остатки);
	ЭтоИмпортФТС = (СпособВводаВОборот = СпособыВвода.ИмпортФТС);
	ЭтоТрансгран = (СпособВводаВОборот = СпособыВвода.Трансгран);
	ЭтоПроизводствоРФ = (СпособВводаВОборот = СпособыВвода.ПроизводствоРФ);
	ЭтоПроизводствоЕАЭС = (СпособВводаВОборот = СпособыВвода.ПроизводствоЕАЭС);
	ЭтоВводВОборотСПричиной = (СпособВводаВОборот = СпособыВвода.СПричиной);
	
	ПоказатьРазрешение = Не ЭтоОстатки И Не ЭтоИмпортФТС;
	ПоказатьИННСобственника = ЭтоПроизводствоРФ И (ТипПроизводственногоЗаказа = ТипыЗаказов.КонтрактноеПроизводство);
	ПоказатьЛицензиюНаНедра = МодульОбъекта().ВидПродукцииТребуетЛицензиюНаНедра(ВидПродукции, СпособВводаВОборот);
	ПоказатьПлощадку = (ЭтоТрансгран Или ЭтоИмпортФТС) И ВидПродукцииДопускаетУказаниеПлощадкиПоТипуОперации();
	ПоказатьДатуПроизводства = ДопускаетсяУказаниеДатыПроизводстваВоВводеВОборот();
	ПоказатьНеОблагаетсяНДС = ЭтоТрансгран И МодульОбъекта().ВидПродукцииТребуетСуммуНДСПриВводеВОборот(ВидПродукции);
	ПоказатьКолонкиЗакрытогоСегмента = ЭтоИмпортФТС И ТоварыЗакрытогоСегмента;
	
	ДопустимВетКонтроль = Ложь;
	ВТоварахЕстьВетКонтроль = Ложь;
	Если МодульОбъекта().ВидПродукцииПоддерживаетВСД(ВидПродукции) Тогда
		ДопустимВетКонтроль = (ЭтоПроизводствоРФ Или ЭтоТрансгран Или ЭтоИмпорт Или ЭтоИмпортФТС);
		ВТоварахЕстьВетКонтроль = Товары_ЕстьВетеринарныйКонтроль();
	КонецЕсли;
	
	Элементы.СобственникТовараИННВводВОборот.Видимость = ПоказатьИННСобственника;
	Элементы.ПроизводительИНН.Видимость = ПоказатьИННСобственника;
	Элементы.ТипУчастникаВводящегоВОборот.Видимость = ПоказатьИННСобственника;
	Элементы.НеОблагаетсяНДС.Видимость = ПоказатьНеОблагаетсяНДС;
	
	Элементы.ВводВОборот_Импорт.Видимость = ЭтоИмпорт Или ЭтоИмпортФТС;
	Элементы.ВводВОборот_ПроизводствоРФ.Видимость = ЭтоПроизводствоРФ;
	Элементы.ВводВОборот_Трансгран.Видимость = ЭтоТрансгран Или ЭтоПроизводствоЕАЭС;
	Элементы.ВводВОборот_СПричиной.Видимость = ЭтоВводВОборотСПричиной;
	
	Элементы.КодТаможни.Видимость = ЭтоИмпорт;
	Элементы.ПринятоеРешение.Видимость = ЭтоИмпорт;
	
	Элементы.ТоварыЗакрытогоСегмента.Видимость = ЭтоИмпортФТС;
	
	Элементы.ТоварыКодТНВЭД.Видимость = ПоказатьРазрешение Или ПоказатьКолонкиЗакрытогоСегмента;
	Элементы.ТоварыКодСтраныПроизводителя.Видимость = ПоказатьКолонкиЗакрытогоСегмента;
	Элементы.ТоварыГруппаВводВОборотПоля.Видимость = ПоказатьРазрешение;
	Элементы.ТоварыГруппаЛицензияНаНедра.Видимость = ПоказатьЛицензиюНаНедра;
	
	Элементы.ТоварыЦенаТрансгран.Видимость = ЭтоТрансгран;
	Элементы.ТоварыСуммаНДС.Видимость = ЭтоТрансгран;
	
	Элементы.ТоварыДатаПроизводства.Видимость = ПоказатьДатуПроизводства;
	Элементы.ДатаПроизводства.Видимость = ПоказатьДатуПроизводства;
	
	Элементы.ИдентификаторВСД.Видимость = ДопустимВетКонтроль Или ЭтоПроизводствоЕАЭС;
	Элементы.ТоварыИдентификаторВСД.Видимость = ДопустимВетКонтроль Или ВТоварахЕстьВетКонтроль;
	
	Элементы.ПлощадкаВводВОборот.Видимость = ПоказатьПлощадку;
	
	Элементы.ТоварыСуммаАкциза.Видимость = ЭтоТрансгран И (ВидПродукции = ВидыПродукции.Пиво);
	
	Элементы.ТоварыРазрешительныйДокумент_ВводВОборот.Видимость =  ЭтоИмпортФТС Или ДопускаетсяУказаниеРазрешительнойДокументации();
	
	УстановитьПодсказкуМод();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей_ОтчетОНанесении()
	
	Если Не МодульОбъекта().ЭтоОтчетОНанесении(ТипОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	ТипыОтчетаОНанесении = МодульОбъекта().Перечисление_ТипыОтчетаОНанесении();
	
	ЭтоМаркировкаТоваровРасформированногоНабора = (ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РасформированиеНабора);
	ЭтоРазделениеТовара = (ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РазделениеТовара);
	
	ПоказатьПлощадку = ВидПродукцииДопускаетУказаниеПлощадкиПоТипуОперации();
	ПоказатьСрокГодности = ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесении();
	ПоказатьДатуПроизводства = МодульОбъекта().ВидПродукцииДопускаетДатуПроизводстваВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении);
	ПоказатьНомерПартии = МодульОбъекта().ВидПродукцииДопускаетНомерПартииВОтчетеОНанесении(ВидПродукции);
	ПоказатьНомерСерии = МодульОбъекта().ВидПродукцииДопускаетНомерСерииВОтчетеОНанесении(ВидПродукции);
	ПоказатьЗСН = Товары_ТребуютсяЗаводскиеСерийныеНомера();
	ПоказатьТипСрокаГодности = МодульОбъекта().ВидПродукцииТребуетУказатьТипСрокаГодности(ВидПродукции);
	ПоказатьСодержаниеСпирта = МодульОбъекта().ВидПродукцииДопускаетУказаниеФактическогоСодержанияСпирта(ВидПродукции, ТипОтчетаОНанесении);
	ПоказатьНомерИДатуПервичногоДокумента = МодульОбъекта().ВидПродукцииДопускаетУказаниеНомераИДатыДокументаВОтчетеОНанесении(ВидПродукции);
	ПоказатьКоличество = МодульОбъекта().ВидПродукцииПоддерживаетКоличествоВСтруктуреКодаОтчетаОНанесении(ВидПродукции, ТипОтчетаОНанесении);
	ПоказатьИспользоватьНоминальноеКоличество = ПоказатьКоличество И МодульОбъекта().ВидПродукцииПоддерживаетНоминальноеКоличество(ВидПродукции);
	ПоказатьРезервированиеПартий = МодульОбъекта().ВидПродукцииДопускаетРезервированиеПартийВОтчетеОНанесении(ВидПродукции);
	ПоказатьТипОтчета = МодульОбъекта().ВидПродукцииДопускаетУказаниеТипаОтчетаОНанесении(ВидПродукции);
	ПоказатьКодМаркировки = (ЭтоМаркировкаТоваровРасформированногоНабора Или ЭтоРазделениеТовара);
	
	Элементы.ТоварыДатаСрокаГодности.Видимость = ПоказатьСрокГодности;
	Элементы.ДатаПроизводстваОтчетОНанесении.Видимость = ПоказатьДатуПроизводства;
	Элементы.ТоварыДатаПроизводстваОтчетОНанесении.Видимость = ПоказатьДатуПроизводства;
	Элементы.ПлощадкаОтчетОНанесении.Видимость = ПоказатьПлощадку;
	Элементы.НомерПартииОтчетОНанесении.Видимость = ПоказатьНомерПартии;
	Элементы.НомерСерииОтчетОНанесении.Видимость = ПоказатьНомерСерии;
	Элементы.ТоварыНомерПартии.Видимость = ПоказатьНомерПартии;
	Элементы.ТоварыНомерСерии.Видимость = ПоказатьНомерСерии;
	Элементы.ТипСрокаГодности.Видимость = ПоказатьТипСрокаГодности;
	Элементы.ТоварыАльтернативныйСрокГодности.Видимость = Ложь;
	
	Элементы.ИспользоватьНоминальноеКоличество.Видимость = ПоказатьИспользоватьНоминальноеКоличество;
	Элементы.ТоварыКоличество.Видимость = ПоказатьКоличество;
	Элементы.ТоварыКоличество.ТолькоПросмотр = ПоказатьКоличество;
	
	Если ПоказатьКоличество Тогда
		Если ТипОперации = ТипыОпераций.ОтчетОНанесении Тогда
			Элементы.ТоварыКоличество.ГиперссылкаЯчейки = Истина;
			Элементы.ТоварыКоличество.ЦветТекста = МодульОбъекта().ЦветГиперСсылки();
		КонецЕсли;
	Иначе
		Элементы.ТоварыКоличество.ГиперссылкаЯчейки = Ложь;
		Элементы.ТоварыКоличество.ЦветТекста = Новый Цвет;
	КонецЕсли;
	
	Если ПоказатьТипСрокаГодности Тогда
		ТипыСрокаГодности = МодульОбъекта().Перечисление_ТипыСроковГодности();
		Если ТипСрокаГодности = ТипыСрокаГодности.СрокГодностиБольше72СУсловием Тогда
			Элементы.ТоварыАльтернативныйСрокГодности.Видимость = Истина;
			Элементы.ТоварыДатаСрокаГодности.Видимость = Ложь;
		Иначе
			Элементы.ТоварыДатаСрокаГодности.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоМаркировкаТоваровРасформированногоНабора Тогда
		Элементы.КодМаркировкиОтчетаОНанесении.Заголовок = НСтр("ru='Код набора'");
	Иначе
		Элементы.КодМаркировкиОтчетаОНанесении.Заголовок = НСтр("ru='Код маркировки'");
	КонецЕсли;
	
	Элементы.ТоварыКоличествоЗСН.Видимость = ПоказатьЗСН;
	Элементы.КодыМаркировкиЗаводскойСерийныйНомер.Видимость = ПоказатьЗСН;
	
	Элементы.ТоварыСодержаниеСпирта.Видимость = ПоказатьСодержаниеСпирта;
	Элементы.ТоварыНомерДокументаОтчетОНанесении.Видимость = ПоказатьНомерИДатуПервичногоДокумента;
	Элементы.ТоварыДатаДокументаОтчетОНанесении.Видимость = ПоказатьНомерИДатуПервичногоДокумента;
	Элементы.ГруппаОтчетОНанесенииНомерДата.Видимость = ПоказатьНомерИДатуПервичногоДокумента;
	Элементы.ГруппаТипОтчетаОНанесении.Видимость = ПоказатьТипОтчета;
	Элементы.ГруппаКодМаркировкиОтчетОНанесении.Видимость = ПоказатьКодМаркировки;
	Элементы.РезервироватьПартии.Видимость = ПоказатьРезервированиеПартий;
	
	Элементы.Товары.ТолькоПросмотр = ЭтоМаркировкаТоваровРасформированногоНабора;
	Элементы.КодыМаркировки.ТолькоПросмотр = ЭтоМаркировкаТоваровРасформированногоНабора;
	Элементы.Кнопка_ЗагрузитьКодыИзТабличногоДокумента.Доступность = Не ЭтоМаркировкаТоваровРасформированногоНабора;
	
	УстановитьПодсказкуМОД();
	УстановитьПодсказкуНомераСерии();
	УстановитьПодсказкуНомераПартии();
	УстановитьПодсказкуДатаПервичногоДокумента();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_РезервированиеПартий()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	Если ТипОперации <> ТипыОпераций.РезервированиеПартий
		И ТипОперации <> ТипыОпераций.РезервированиеОднойПартии Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипОперации = ТипыОпераций.РезервированиеПартий Тогда
		
		Элементы.ЗакладкаТовары.Видимость = Истина;
		Элементы.ТоварыПодчиненнаяОперация.Видимость = Истина;
		Элементы.ТоварыРезервированиеПартий.Видимость = Истина;
		Элементы.Товары.ТолькоПросмотр = Истина;
		
	Иначе
		
		Элементы.РезервированиеПартий.Видимость = Истина;
		Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.РезервированиеПартий;
		
	КонецЕсли;
	
	Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Отправить'");
	Элементы.Кнопка_ПовторитьОтправкуСначала.Заголовок = НСтр("ru = 'Повторно отправить'");
	
КонецПроцедуры

&НаСервере
Функция ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесении()
	
	Возврат МодульОбъекта().ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении);
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьВыгрузкиКодов()
	
	ПодходящиеОперации = МодульОбъекта().ТипыОперацийСВыгрузкойКодов();
	ПоказатьМенюВыгрузкиКодовВФайл = МодульОбъекта().МассивСодержитЗначение(ПодходящиеОперации, ТипОперации);
	
	Элементы.МенюСохранитьКодыВФайл.Видимость = ПоказатьМенюВыгрузкиКодовВФайл;
	Элементы.МенюСохранитьКодыВФайл1.Видимость = ПоказатьМенюВыгрузкиКодовВФайл;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОбщихИтоговВходящегоУПД(ДанныеВходящегоУПД)
	
	КоличествоКодовПоОСУСОшибками = ДанныеВходящегоУПД.ОбщиеИтоги.КоличествоКодовПоОСУСОшибками;
	КоличествоКодовСОшибками = ДанныеВходящегоУПД.ОбщиеИтоги.КоличествоКодовСОшибками;
	Отсканировано = ДанныеВходящегоУПД.ОбщиеИтоги.ПроцентОтсканированных;
	
	Если ЗначениеЗаполнено(КоличествоКодовПоОСУСОшибками) Тогда
		Элементы.КоличествоНедопустимыхКодовПоОСУ.Видимость = Истина;
		Элементы.КоличествоНедопустимыхКодовПоОСУ.Заголовок = "Недопустимых кодов по ОСУ: " + КоличествоКодовПоОСУСОшибками;
	Иначе
		Элементы.КоличествоНедопустимыхКодовПоОСУ.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоличествоКодовСОшибками) Тогда
		Элементы.КоличествоНедопустимыхКодов.Видимость = Истина;
		Элементы.КоличествоНедопустимыхКодов.Заголовок = "Недопустимых кодов маркировки: " + КоличествоКодовСОшибками;
	Иначе
		Элементы.КоличествоНедопустимыхКодов.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Отсканировано.Заголовок = "Отсканировано " + Отсканировано + "%"
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей_ВозвратВОборот()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ВозвратВОборот
		И ТипОперации <> ТипыОпераций.ВозвратВОборотНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПервичныйДокумент = МодульОбъекта().ПричинаВозвратаВОборотТребуетПервичныйДокумент(ПричинаВозвратаВОборот, ТоварОплачен);
	
	Элемент = Элементы.ВидПервичногоДокументаВозвратВОборот;
	Элемент.АвтоОтметкаНезаполненного = ТребуетсяПервичныйДокумент;
	Элемент.ОтметкаНезаполненного = Элемент.АвтоОтметкаНезаполненного И Не ЗначениеЗаполнено(ВидПервичногоДокумента);
	
	Элемент = Элементы.НомерДокументаВозвратВОборот;
	Элемент.АвтоОтметкаНезаполненного = ТребуетсяПервичныйДокумент;
	Элемент.ОтметкаНезаполненного = Элемент.АвтоОтметкаНезаполненного И Не ЗначениеЗаполнено(НомерДокумента);
	
	Элемент = Элементы.ДатаДокументаВозвратВОборот;
	Элемент.АвтоОтметкаНезаполненного = ТребуетсяПервичныйДокумент;
	Элемент.ОтметкаНезаполненного = Элемент.АвтоОтметкаНезаполненного И Не ЗначениеЗаполнено(ДатаДокумента);
	
	ВидыПервичныхДокументов = МодульОбъекта().Перечисление_ВидыПервичныхДокументов();
	ТребуетсяНаименованиеДокумента = (ВидПервичногоДокумента = ВидыПервичныхДокументов.Прочее);
	
	Элемент = Элементы.НаименованиеПервичногоДокументаВозвратВОборот;
	Элемент.Видимость = ТребуетсяНаименованиеДокумента;
	Элемент.АвтоОтметкаНезаполненного = ТребуетсяНаименованиеДокумента;
	Элемент.ОтметкаНезаполненного = Элемент.АвтоОтметкаНезаполненного И Не ЗначениеЗаполнено(НаименованиеПервичногоДокумента);
	
	ПричиныВозвратаВОборот = МодульОбъекта().Перечисление_ПричиныВозвратаВОборот();
	
	Элементы.ИдентификаторГосКонтрактаВозвратВОборот.Видимость =
		(ПричинаВозвратаВОборот = ПричиныВозвратаВОборот.Гостайна);
	
	Элементы.ТоварОплачен.Видимость = (ПричинаВозвратаВОборот = ПричиныВозвратаВОборот.ДистанционныйСпособПродажи);
	
	Элементы.ТоварыРазрешительныйДокумент_ВозвратВОборот.Видимость = ДопускаетсяУказаниеРазрешительнойДокументации();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей_ЗаказКодов()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ЗаказКодов Тогда
		Возврат;
	КонецЕсли;
	
	ВидыПродукции = МодульОбъекта().Перечисление_ВидыПродукции();
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	ТипыЗаказаКодов = МодульОбъекта().Перечисление_ТипыЗаказаКодов();
	ТипыКодовМаркировки = МодульОбъекта().Перечисление_ТипыКодовМаркировки();
	СпособыВыпускаТоваров = МодульОбъекта().Перечисление_СпособыВыпускаТоваров();
	
	Элементы.ГруппаОстаткиИмпорт.Видимость = Ложь;
	Элементы.СервисПровайдер.Видимость = ЗаказКодовДляСервисПровайдера;
	
	Если МодульОбъекта().ВидПродукцииТребуетТипОплатыКодов(ВидПродукции) Тогда
		Элементы.ТипОплатыКодов.Видимость = Истина;
		Элементы.ТипОплатыКодов.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.ТипОплатыКодов.Видимость = Ложь;
		Элементы.ТипОплатыКодов.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	ЭтоПеремаркировка = (СпособВыпускаТоваров = СпособыВыпускаТоваров.Перемаркировка);
	ЭтоМаркировкаОстатков = (СпособВыпускаТоваров = СпособыВыпускаТоваров.Остатки);
	ЭтоМаркировкаВнеПроизводстваИлиИмпорта = (СпособВыпускаТоваров = СпособыВыпускаТоваров.МаркировкаВнеПроизводстваИлиИмпорта);
	ЭтоКИГУ = (ТипКодаМаркировки = ТипыКодовМаркировки.ГрупповаяУпаковка);
	ЭтоМаркировкаТоваровРасформированногоНабора = (ТипЗаказаКодов = ТипыЗаказаКодов.РасформированиеНабора);
	ЭтоРазделениеТовара = (ТипЗаказаКодов = ТипыЗаказаКодов.РазделениеТовара);
	
	ПоказатьФорматКодов = МодульОбъекта().ВидПродукцииПоддерживаетУкороченныйФорматКодов(ВидПродукции);
	ПоказатьСобственника = (ЭтоМаркировкаОстатков Или ЭтоПеремаркировка Или ЭтоМаркировкаВнеПроизводстваИлиИмпорта);
	ПоказатьТипЗаказаКодов = МодульОбъекта().ВидПродукцииДопускаетУказаниеТипаЗаказаКодов(ВидПродукции, СпособВыпускаТоваров);
	
	Если ОсновнойСтатус <> СтатусыОпераций.Новый
		И ЭтоПеремаркировка
		И Не ЗначениеЗаполнено(ДокументУчета) Тогда
		Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
		Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Коды для перемаркировки'");
	КонецЕсли;
	
	Если ЭтоМаркировкаТоваровРасформированногоНабора Тогда
		Элементы.КодМаркировкиЗаказаКодов.Заголовок = НСтр("ru='Код набора'");
		Элементы.Кнопка_ЗаполнитьТоварыПоКодуМаркировки.Заголовок = НСтр("ru='Заполнить товары по коду набора'");
	Иначе
		Элементы.КодМаркировкиЗаказаКодов.Заголовок = НСтр("ru='Код маркировки'");
		Элементы.Кнопка_ЗаполнитьТоварыПоКодуМаркировки.Заголовок = НСтр("ru='Заполнить товары по коду маркировки'");
	КонецЕсли;
	
	Элементы.ТоварыКодТНВЭД.Видимость = ЭтоПеремаркировка;
	Элементы.ЗаказКодовДляСервисПровайдера.ТолькоПросмотр = ЭтоПеремаркировка;
	Элементы.ЗаказатьКодыДляВложенныхТоваров.Видимость = ЭтоКИГУ И Не ЭтоПеремаркировка;
	Элементы.ТоварыПодчиненнаяОперация.Видимость = ЗаказатьКодыДляВложенныхТоваров;
	Элементы.ТоварыЗаказИФормированиеКИГУ.Видимость = ЗаказатьКодыДляВложенныхТоваров;
	Элементы.ГруппаФорматКодов.Видимость = ПоказатьФорматКодов;
	Элементы.ГруппаСобственникТоваров.Видимость = ПоказатьСобственника;
	Элементы.СобственникТовараИННЗаказКодов.Видимость = КарточкиТоваровПринадлежатДругойОрганизации;
	Элементы.ГруппаТипЗаказа.Видимость = ПоказатьТипЗаказаКодов;
	Элементы.ГруппаКодМаркировкиЗаказаКодов.Видимость = (ЭтоМаркировкаТоваровРасформированногоНабора Или ЭтоРазделениеТовара);
	Элементы.Кнопка_ЗаполнитьТоварыПоКодуМаркировки.Видимость = (ЭтоМаркировкаТоваровРасформированногоНабора Или ЭтоРазделениеТовара);
	Элементы.Товары.ТолькоПросмотр = ЭтоМаркировкаТоваровРасформированногоНабора;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей_НаполнениеАгрегатовНаТСД()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.НаполнениеАгрегатовНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	Если МодульОбъекта().ВидПродукцииПоддерживаетОтчетОНанесении(ВидПродукции) Тогда
		Элементы.ПолучатьПолныеКодыПриНаполненииАгрегатаНаТСД.Видимость = Истина;
	Иначе
		Элементы.ПолучатьПолныеКодыПриНаполненииАгрегатаНаТСД.Видимость = Ложь;
	КонецЕсли;
	
	Если ОсновнойСтатус <> СтатусыОпераций.ОперацияЗавершена Тогда
		Элементы.Кнопка_НапечататьЭтикетки.Видимость = Истина;
	КонецЕсли;
	
	Если ОсновнойСтатус = СтатусыОпераций.Новый Тогда
		Элементы.ГруппаДобавленияАгрегатов.Видимость = Истина;
	КонецЕсли;
	
	Элементы.РегистрироватьАгрегатыПослеНаполнения.Видимость = Не НаполнитьАгрегатыВОдномЗадании;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей_УведомлениеОСостоянииКодов()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	СостоянияКодов = МодульОбъекта().Перечисление_СостоянияКодов();
	Если ТипОперации <> ТипыОпераций.УведомлениеОСостоянииКодов Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоОтменаОтгрузкиНаЭкспорт = (СостояниеКодов = СостоянияКодов.ОтменаОтгрузкиНаЭкспорт);
	
	Элементы.ПлощадкаУведомлениеОСостоянииКодов.Видимость = Не ЭтоОтменаОтгрузкиНаЭкспорт;
	Элементы.ДатаОтгрузкиУведомлениеОСостоянииКодов.Видимость = Не ЭтоОтменаОтгрузкиНаЭкспорт;
	Элементы.ГруппаПолучатель.Видимость = Не ЭтоОтменаОтгрузкиНаЭкспорт;
	Элементы.ГруппаТранспортныеРеквизиты.Видимость = Не ЭтоОтменаОтгрузкиНаЭкспорт;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ДляВсехОпераций()

	ЭтаФорма.Заголовок = Ссылка;
	
	Элементы.ГруппаОграничениеПоТарифу.Видимость = ОперацияОграниченаТарифом;
	
	Если ЗначениеЗаполнено(Подписант) Тогда
		Элементы.ГруппаДанныеОПодписании.Видимость = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
		Элементы.ДокументУчета.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторДокумента)
		И МодульОбъекта().ОперациюМожноОткрытьВСервисе(ТипОперации) Тогда
		Элементы.Кнопка_ОткрытьВСервисе.Видимость = Истина;
	Иначе
		Элементы.Кнопка_ОткрытьВСервисе.Видимость = Ложь;
	КонецЕсли;
	
	РежимТехническогоСпециалиста = МодульОбъекта().ВключенРежимТехническогоСпециалиста();
	НастроитьЭлементыФормы_РежимТехническогоСпециалиста(РежимТехническогоСпециалиста);
	
	Элементы.Кнопка_ЗаписатьОперацию.Видимость = Не ЭтаФорма.ТолькоПросмотр;
	Элементы.Кнопка_ЗагрузитьКодыИзТабличногоДокумента.Видимость = Не ЭтаФорма.ТолькоПросмотр;
	Элементы.КодыМаркировки.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
	Элементы.КодыМаркировкиАртикул.Видимость = МодульОбъекта().Интеграция_Номенклатура1С_ЕстьАртикул();
	
	Элементы.ТоварыНомерСтроки.Ширина = 2;
	
	УстановитьВидимостьКолонкиТоваров("Артикул");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКолонкиТоваров(ИмяКолонки)
	
	ЕстьЗначения = Ложь;
	
	Для Каждого Стр Из Товары Цикл
		Если ЗначениеЗаполнено(Стр[ИмяКолонки]) Тогда
			ЕстьЗначения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы["Товары" + ИмяКолонки].Видимость = ЕстьЗначения;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_РежимТехническогоСпециалиста(РежимТехническогоСпециалиста)
	
	Элементы.Группа_ФункцииТехническогоСпециалиста.Видимость = РежимТехническогоСпециалиста;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ПодборНаТСД()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ПодборКодовНаТСД
		И ТипОперации <> ТипыОпераций.ПодборТоваровИКодовНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	СтатусыДокументовУчета = МодульОбъекта().Перечисление_СтатусыДокументовУчета();
	
	ОсновнойСтатусДокументаУчета = "";
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		ОсновнойСтатусДокументаУчета = МодульОбъекта().ДокументУчета_ОсновнойСтатус(ДокументУчета);
	КонецЕсли;
	
	Элементы.ТоварыКоличествоУпаковок.Видимость = Истина;
	
	Если ТипОперации = ТипыОпераций.ПодборКодовНаТСД Тогда
		
		Если ОсновнойСтатус <> СтатусыОпераций.Новый Тогда
			Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
		КонецЕсли;
		
		Элементы.ОтражениеВЭДО.Видимость = МодульОбъекта().ДокументУчета_ЕстьРолиДляОтраженияВЭДО(ДокументУчета);
		
	КонецЕсли;
		
	Если ТипОперации = ТипыОпераций.ПодборТоваровИКодовНаТСД Тогда
		
		Элементы.ТоварыТовар.Видимость = Ложь;
		Элементы.ОтражениеВЭДО.Видимость = Ложь;
		
	КонецЕсли;
	
	Если ОсновнойСтатус = СтатусыОпераций.ОперацияЗавершена
		Или ОсновнойСтатус = СтатусыОпераций.НеУдалосьРаспознатьКоды Тогда
		
		Элементы.Кнопка_ПолучитьПовторноКодыИзТСД.Видимость = Истина;
		
		Если ОсновнойСтатусДокументаУчета = СтатусыДокументовУчета.ВРаботе Тогда
			Если ПодборСПомощьюМобильногоУстройства Тогда
				Элементы.ПодменюВернутьНаУстройство.Видимость = Истина;
			Иначе
				Элементы.Кнопка_ВернутьНаТСД.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОсновнойСтатус = СтатусыОпераций.ОтправленВСервис Тогда
		Элементы.Кнопка_НазначитьДругойТСД.Видимость = ПодборСПомощьюМобильногоУстройства;
	КонецЕсли;
	
	Элементы.ГруппаМобильноеУстройство.Видимость = ПодборСПомощьюМобильногоУстройства;
	
	Элементы.ПодборКодовНаТСД.Видимость = Истина;
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.ПодборКодовНаТСД;
	
	Элементы.КомментарийВозвратаНаТСД.Видимость = Истина;
	
	Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Отправить на ТСД'");
	
	Элементы.ЗакладкаТовары.Видимость = Истина;
	
	Элементы.ТоварыКлючНоменклатуры1С.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ЗаказКодов()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ЗаказКодов Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	ТипыКодовМаркировки = МодульОбъекта().Перечисление_ТипыКодовМаркировки();
	
	Элементы.ЗаказКодов.Видимость = Истина;
	
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.ЗаказКодов;
	Элементы.ЗакладкаТовары.Видимость = Истина;
	
	Если ОсновнойСтатус = СтатусыОпераций.Новый Тогда
		Элементы.Кнопка_ДобавитьТовар.Видимость = Истина;
		Элементы.Кнопка_ЗаполнитьТоварыПоКодуМаркировки.Видимость = Истина;
	КонецЕсли;
	
	Если ОсновнойСтатус = СтатусыОпераций.ОперацияЗавершена
		И Не ЗначениеЗаполнено(ДокументУчета) Тогда
		Элементы.Кнопка_ЗаказКодовНапечататьЭтикетки.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ТоварыКоличествоУпаковок.Видимость = Истина;
	Элементы.ТоварыКоличествоКодов.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ВводВОборот()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ВводВОборот Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ВводВОборот.Видимость = Истина;
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.ВводВОборот;
	
	Элементы.ЗакладкаТовары.Видимость = Истина;
	Элементы.ТоварыВводВОборот.Видимость = Истина;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	
	Элементы.ТоварыКоличествоУпаковок.Видимость = Ложь;
	Элементы.ТоварыКоличествоКодов.Видимость = Истина;
	
	Элементы.ТоварыПодчиненнаяОперация.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ВыводИзОборота()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ВыводИзОборота Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ВыводИзОборота.Видимость = Истина;
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.ВыводИзОборота;
	
	Элементы.ЗакладкаТовары.Видимость = Истина;
	Элементы.ТоварыВыводИзОборота.Видимость = Истина;
	Элементы.ТоварыКлючНоменклатуры1С.Видимость = Товары_ЕстьКлючиНоменклатуры1С(Товары);
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	
	Элементы.ТоварыКоличествоУпаковок.Видимость = ОбъемноСортовойУчет;
	Элементы.ТоварыКоличествоКодов.Видимость = Не ОбъемноСортовойУчет;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_АгрегацияКодов()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.АгрегацияКодов Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Завершить операцию'");
	
	Элементы.АгрегацияКодов.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.АгрегацияКодов;
	
	Если ОсновнойСтатус = СтатусыОпераций.Новый Тогда
		Элементы.ЗакладкаАгрегаты.Видимость = Истина;
		Элементы.Кнопка_ПодобратьКоды.Видимость = Истина;
		Элементы.Кнопка_ДобавитьАгрегат.Видимость = Истина;
		Элементы.Кнопка_СоздатьАгрегаты.Видимость = Истина;
	Иначе
		Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Готовые агрегаты'");
	КонецЕсли;
	
	Если ОсновнойСтатус <> СтатусыОпераций.ОперацияЗавершена Тогда
		Элементы.Кнопка_НапечататьЭтикетки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_РегистрацияАгрегатов()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.РегистрацияАгрегатов Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РегистрацияАгрегатов.Видимость = Истина;
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.РегистрацияАгрегатов;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Агрегаты для регистрации'");
	
	Элементы.КодыМаркировкиГруппаПодчиненнаяОперация.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_СообщениеОбОтгрузке()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.СообщениеОбОтгрузке Тогда
		Возврат;
	КонецЕсли;
	
	ТипыОтгрузок = МодульОбъекта().Перечисление_ТипыОтгрузок();
	ПричиныВыводаИзОборота = МодульОбъекта().Перечисление_ПричиныВыводаИзОборотаПриОтгрузке();
	
	Элементы.ЗакладкаТовары.Видимость = Истина;
	Элементы.СообщениеОбОтгрузке.Видимость = Истина;
	
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.СообщениеОбОтгрузке;
	Элементы.ТоварыКлючНоменклатуры1С.Видимость = Товары_ЕстьКлючиНоменклатуры1С(Товары);
	
	Элементы.ОбъемноСортовойУчет.Видимость = Истина;
	Элементы.ОбъемноСортовойУчет.Доступность = Ложь;
	
	Элементы.ТоварыКоличествоУпаковок.Видимость = ОбъемноСортовойУчет;
	Элементы.ТоварыКоличествоКодов.Видимость = Не ОбъемноСортовойУчет;
	
	Элементы.ПоляСообщенияСВыводомИзОборота.Видимость =
	(ТипОтгрузки = ТипыОтгрузок.ОтгрузкаСВыводомИзОборота);
	
	Элементы.КодСтраныПолучателя.Видимость =
	(ТипОтгрузки = ТипыОтгрузок.ТрансграничнаяТорговля);
	
	Элементы.GLNПолучателя.Видимость = 
	(ТипОтгрузки = ТипыОтгрузок.ТрансграничнаяТорговля);
	
	Элементы.ИдентификаторГосКонтракта.Видимость =
	(ПричинаВыводаИзОборота = ПричиныВыводаИзОборота.ПриобретениеГосПредприятием);
	
	Элементы.НаименованиеПолучателя.Видимость = ОбъемноСортовойУчет;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_РасформированиеАгрегатов()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.РасформированиеАгрегатов Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РегистрацияАгрегатов.Видимость = Истина;
	
	Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Расформировать агрегаты'");
	
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.РегистрацияАгрегатов;
	Элементы.ПоляТиповОпераций.Видимость = Ложь;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Агрегаты для расформирования'");
	Элементы.КодыМаркировкиГруппаПодчиненнаяОперация.Видимость = Истина;
	
	Элементы.КодыМаркировки.ТолькоПросмотр = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_НаполнениеАгрегатовНаТСД()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.НаполнениеАгрегатовНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Отправить на ТСД'");
	
	Элементы.НаполнениеАгрегатов.Видимость = Истина;
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.НаполнениеАгрегатов;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Агрегаты'");
	Элементы.КодыМаркировкиГруппаПодчиненнаяОперация.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ОтчетОНанесении()
	
	Если Не МодульОбъекта().ЭтоОтчетОНанесении(ТипОперации) Тогда
		Возврат;
	КонецЕсли;

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	ВидыПродукции = МодульОбъекта().Перечисление_ВидыПродукции();
	
	Элементы.ОтчетОНанесении.Видимость = Истина;
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.ОтчетОНанесении;
	
	Элементы.ЗакладкаТовары.Видимость = Истина;
	Элементы.ТоварыОтчетОНанесении.Видимость = Истина;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	
	Если ТипОперации = ТипыОпераций.ОтчетОНанесенииНаТСД Тогда
		Элементы.ИспользоватьНоминальноеКоличество.ТолькоПросмотр = Истина;
		Элементы.ТоварыКоличествоУпаковок.Видимость = Истина;
		Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Отправить на ТСД'");
	Иначе
		Элементы.ИспользоватьНоминальноеКоличество.ТолькоПросмотр = Ложь;
		Элементы.ТоварыКоличествоКодов.Видимость = Истина;
	КонецЕсли;
	
	Если ВидПродукции = ВидыПродукции.Электроника Тогда
		Элементы.ТоварыКоличество.Заголовок = НСтр("ru='Переменная характеристика'");
	Иначе
		Элементы.ТоварыКоличество.Заголовок = НСтр("ru='Вес / Объем'");
	КонецЕсли;
	
	Элементы.РезервироватьПартии.Заголовок = НСтр("ru='Зарезервировать партии перед подачей отчета'");
	
	Элементы.ТоварыПодчиненнаяОперация.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ОперацииСтрокАгрегатов()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(ТипыОпераций.РегистрацияПакетаАгрегатов);
	ПодходящиеТипы.Добавить(ТипыОпераций.РасформированиеАгрегатаВГИС);
	ПодходящиеТипы.Добавить(ТипыОпераций.НаполнениеОдногоАгрегатаНаТСД);
	ПодходящиеТипы.Добавить(ТипыОпераций.НаполнениеПакетаАгрегатовНаТСД);
	ПодходящиеТипы.Добавить(ТипыОпераций.РегистрацияОдногоАгрегатаВГИС);
	
	Если Не МодульОбъекта().МассивСодержитЗначение(ПодходящиеТипы, ТипОперации) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Агрегат.Видимость = (ТипОперации <> ТипыОпераций.РегистрацияПакетаАгрегатов);
	
	Если ТипОперации = ТипыОпераций.РегистрацияПакетаАгрегатов
		Или ТипОперации = ТипыОпераций.РегистрацияОдногоАгрегатаВГИС Тогда
		
		СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
		
		Элементы.КодыМаркировкиГруппаПодчиненнаяОперация.Видимость = Истина;
		
		Если ОсновнойСтатус <> СтатусыОпераций.Новый Тогда
			Элементы.ЗакладкаКодыМаркировки.Видимость = (КоличествоКодов > 0);
			Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Вложенные агрегаты'");
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.РегистрацияПакетаАгрегатов Тогда
			Элементы.ЗакладкаКодыПакетаАгрегатов.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ВходящийУПД()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ВходящийУПД Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ВходящийУПД.Видимость = Истина;
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.ВходящийУПД;
	
	Элементы.Склад.Видимость = Ложь;
	Элементы.ЗакладкаКодыВходящегоУПД.Видимость = Истина;
	Элементы.ЗакладкаЛишниеКодыВходящегоУПД.Видимость = Истина;
	
	Элементы.Партии.Видимость = ЗначениеЗаполнено(Партии);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ОтчетОВыбытииНаТСД()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ОтчетОВыбытииНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Отправить на ТСД'");
	
	Элементы.ОтчетОВыбытии.Видимость = Истина;
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.ОтчетОВыбытии;
	
	Элементы.ЗакладкаТовары.Видимость = Истина;
	Элементы.ТоварыКлючНоменклатуры1С.Видимость = Товары_ЕстьКлючиНоменклатуры1С(Товары);
	
	Элементы.ТоварыКоличествоУпаковок.Видимость = Истина;
	Элементы.ТоварыКоличествоКодов.Видимость = Ложь;
	
	Если ОсновнойСтатус <> СтатусыОпераций.Новый Тогда
		Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ОтчетОВыбытии()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ОтчетОВыбытии Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОтчетОВыбытии.Видимость = Истина;
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.ОтчетОВыбытии;
	
	Элементы.ЗакладкаТовары.Видимость = Истина;
	Элементы.ТоварыКлючНоменклатуры1С.Видимость = Товары_ЕстьКлючиНоменклатуры1С(Товары);
	
	Элементы.ТоварыКоличествоУпаковок.Видимость = Ложь;
	Элементы.ТоварыКоличествоКодов.Видимость = Истина;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_Перемаркировка()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.Перемаркировка Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Перемаркировка.Видимость = Истина;
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.Перемаркировка;
	
	Элементы.ЗакладкаТовары.Видимость = Истина;
	
	Элементы.ТоварыРазрешительныйДокумент_Перемаркировка.Видимость = ДопускаетсяУказаниеРазрешительнойДокументации();
	Элементы.ТоварыКодТНВЭД.Видимость = Истина;
	Элементы.ТоварыКоличествоКодов.Видимость = Истина;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Коды перемаркировки'");
	
	Элементы.ТоварыПодчиненнаяОперация.Видимость = Истина;

КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_НаполнениеНаборовНаТСД()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.НаполнениеНаборовНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьНомерПартии = МодульОбъекта().ВидПродукцииПоддерживаетПартионныйУчет(ВидПродукции);
	
	Элементы.НаполнениеНаборовНаТСД.Видимость = Истина;
	
	Элементы.РезервироватьПартии.Видимость = ПоказатьНомерПартии;
	Элементы.НомерПартииНаполнениеНаборовНаТСД.Видимость = ПоказатьНомерПартии;
	Элементы.ТоварыРегистрацияНаборов.Видимость = ПоказатьНомерПартии;
	
	Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Отправить на ТСД'");
	Элементы.ЗакладкаТовары.Видимость = Истина;
	
	Элементы.ТоварыКоличествоКодов.Видимость = Ложь;
	Элементы.ТоварыКоличествоУпаковок.Видимость = Истина;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Наборы'");
	
	УстановитьПодсказкуНомераПартии();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ФормированиеКИГУ()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ФормированиеКИГУ Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Сформировать КИГУ'");
	
	Элементы.Кнопка_ПодобратьКодыДляКИГУ.Видимость = Истина;
	
	Элементы.ЗакладкаТовары.Видимость = Истина;
	Элементы.ТоварыЗаказИФормированиеКИГУ.Видимость = Истина;
	Элементы.ТоварыКоличествоКодовВложенногоТовара.Видимость = Истина;
	Элементы.ТоварыКоличествоУпаковок.Видимость = Истина;
	Элементы.ТоварыКоличествоКодов.Видимость = Ложь;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.КодыМаркировкиНомерПартии.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_НаполнениеКИГУНаТСД()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.НаполнениеКИГУНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РегистрацияКИГУ.Видимость = Истина;
	
	Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Отправить на ТСД'");
	Элементы.ЗакладкаТовары.Видимость = Истина;
	
	Элементы.ТоварыКоличествоУпаковок.Видимость = Истина;
	Элементы.ТоварыКоличествоКодов.Видимость = Ложь;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Групповые упаковки'");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_РегистрацияКИГУ()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.РегистрацияКИГУ Тогда
		Возврат;
	КонецЕсли;
	
	ДоступенПартионныйУчет = МодульОбъекта().ВидПродукцииПоддерживаетПартионныйУчет(ВидПродукции);
	
	Элементы.РегистрацияКИГУ.Видимость = Истина;
	Элементы.ЗакладкаТовары.Видимость = Истина;
	
	Элементы.ТоварыРегистрацияКИГУ.Видимость = Истина;
	Элементы.ТоварыНомерПартииВложенныхКодовРегистрацияКИГУ.Видимость = ДоступенПартионныйУчет;
	Элементы.ТоварыКоличествоУпаковок.Видимость = Ложь;
	Элементы.ТоварыКоличествоКодов.Видимость = Истина;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Групповые упаковки'");
	
	Элементы.ТоварыПодчиненнаяОперация.Видимость = Истина;

КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_УведомлениеОПриемке()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.УведомлениеОПриемке Тогда
		Возврат;
	КонецЕсли;
	
	ТипыИсходныхОтгрузок = МодульОбъекта().Перечисление_ТипыИсходныхОтгрузок();
	СтатусыСверкиНаТСД = МодульОбъекта().Перечисление_СтатусыСверкиНаТСД();
	
	Элементы.Склад.Видимость = Ложь;
	Элементы.УведомлениеОПриемке.Видимость = Истина;
	Элементы.ГруппаСтатусыПриемкиЕАЭС.Видимость = Истина;
	Элементы.КонтрагентНаименованиеУведомлениеОПриемке.Видимость = ЗначениеЗаполнено(КонтрагентНаименование);
	Элементы.ЗакладкаСведенияОТоварах.Видимость = Истина;
	
	Если СтатусСверкиНаТСД = СтатусыСверкиНаТСД.СверкаНеПроизведена
		Или ТипИсходнойОтгрузки = ТипыИсходныхОтгрузок.ТрансграничнаяОтгрузкаОСУ Тогда
		Элементы.Кнопка_ПринятьЧастично.Доступность = Ложь;
	Иначе
		Элементы.Кнопка_ПринятьЧастично.Доступность = Истина;
	КонецЕсли;
	
	Если ТипИсходнойОтгрузки = ТипыИсходныхОтгрузок.ТрансграничнаяОтгрузкаОСУ Тогда
		Элементы.СведенияОТоварахКоличество.Видимость = Истина;
		Элементы.СведенияОТоварахКоличествоКИ.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ВозвратВОборот()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ВозвратВОборот
		И ТипОперации <> ТипыОпераций.ВозвратВОборотНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	Элементы.ВозвратВОборот.Видимость = Истина;
	Элементы.ЗакладкаТовары.Видимость = Истина;
	
	Если ТипОперации = ТипыОпераций.ВозвратВОборотНаТСД
		И Не ЗначениеЗаполнено(ДокументУчета)
		И ОсновнойСтатус = СтатусыОпераций.Новый Тогда
		Элементы.Кнопка_ДобавитьТовар.Видимость = Истина;
	КонецЕсли;
	
	Если ТипОперации = ТипыОпераций.ВозвратВОборотНаТСД Тогда
		Элементы.ТоварыКоличествоУпаковок.Видимость = Истина;
	Иначе
		Элементы.ТоварыКоличествоКодов.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ТрансформацияАгрегата()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ДобавлениеВАгрегат
		И ТипОперации <> ТипыОпераций.ИзъятиеИзАгрегата Тогда
		Возврат;
	КонецЕсли;

	Элементы.ТрансформацияАгрегата.Видимость = Истина;
	
	Если ТипОперации = ТипыОпераций.ДобавлениеВАгрегат Тогда
		Элементы.РедакторКодовГиперссылка.Заголовок = НСтр("ru = 'Заполнить коды для добавления'");
	Иначе
		Элементы.РедакторКодовГиперссылка.Заголовок = НСтр("ru = 'Заполнить коды для изъятия'");
	КонецЕсли;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;

КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ФормированиеАТК()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ФормированиеАТК Тогда
		Возврат;
	КонецЕсли;

	Элементы.ТаможенныеКоды.Видимость = Истина;
	Элементы.ЗакладкаТовары.Видимость = Истина;
	Элементы.ТоварыКодТНВЭД.Видимость = Истина;
	
	Если ТипОперации = ТипыОпераций.ВозвратВОборотНаТСД Тогда
		Элементы.ТоварыКоличествоУпаковок.Видимость = Истина;
	Иначе
		Элементы.ТоварыКоличествоКодов.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Состав АТК'");
	
	Элементы.КодАТК.АвтоМаксимальнаяШирина = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_РасформированиеАТК()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.РасформированиеАТК Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТаможенныеКоды.Видимость = Истина;
	Элементы.ГруппаТНВЭД.Видимость = Истина;
	
	Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Расформировать АТК'");
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'АТК'");
	
	Элементы.КодАТК.АвтоМаксимальнаяШирина = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ТрансформацияАТК()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если Не МодульОбъекта().ЭтоТрансформацияАТК(ТипОперации) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипОперации = ТипыОпераций.ДобавлениеВАТК Тогда
		Элементы.РедакторКодовГиперссылка.Заголовок = НСтр("ru = 'Заполнить коды для добавления'");
		Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Коды для добавления'");
	Иначе
		Элементы.РедакторКодовГиперссылка.Заголовок = НСтр("ru = 'Заполнить коды для изъятия'");
		Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Коды для изъятия'");
	КонецЕсли;
	
	Элементы.Кнопка_ДобавитьКодАТК.Доступность = ЗначениеЗаполнено(ВидПродукции);
	
	Элементы.Кнопка_ДобавитьКодАТК.Видимость = Истина;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	
	Элементы.ТаможенныеКоды.Видимость = Истина;
	Элементы.ГруппаТНВЭД.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_РегистрацияНаборов()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.РегистрацияНаборов Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьНомерПартии = МодульОбъекта().ВидПродукцииПоддерживаетПартионныйУчет(ВидПродукции);
	
	Элементы.РегистрацияНаборов.Видимость = Истина;
	
	Элементы.РезервироватьПартии.Видимость = ПоказатьНомерПартии;
	Элементы.НомерПартииРегистрацияНаборов.Видимость = ПоказатьНомерПартии;
	Элементы.ТоварыРегистрацияНаборов.Видимость = ПоказатьНомерПартии;
	
	Элементы.ЗакладкаТовары.Видимость = Истина;
	Элементы.ТоварыКоличествоКодов.Видимость = Истина;
	Элементы.ТоварыПодчиненнаяОперация.Видимость = Истина;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Наборы'");
	
	УстановитьПодсказкуНомераПартии();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_РасформированиеНаборов()

	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.РасформированиеНаборов Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РасформированиеНаборов.Видимость = Истина;
	
	Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Расформировать наборы'");
	
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.РасформированиеНаборов;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Наборы для расформирования'");
	Элементы.КодыМаркировкиГруппаПодчиненнаяОперация.Видимость = Истина;
	
	Элементы.КодыМаркировки.ТолькоПросмотр = Ложь;

КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_КорректировкаСведенийОКодах()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.КорректировкаСведенийОКодах Тогда
		Возврат;
	КонецЕсли;
	
	ВидыСведений = МодульОбъекта().Перечисление_ВидыКорректируемыхСведений();
	
	Элементы.КорректировкаСведенийОКодах.Видимость = Истина;
	
	Элементы.ЗакладкаТовары.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ТоварыКоличествоКодов.Видимость = Истина;
	Элементы.ТоварыПодчиненнаяОперация.Видимость = Истина;
	Элементы.ТоварыКорректировкаСведенийОКодах.Видимость = Истина;
	Элементы.КодыМаркировкиОбщийТипУпаковки.Видимость = Истина;
	Элементы.ТоварыТовар.ТолькоПросмотр = Истина;
	
	КорректировкаДатыПроизводства = (ВидКорректируемыхСведений = ВидыСведений.ДатаПроизводства);
	Элементы.ТоварыКорректировкаДатаПроизводства.Видимость = КорректировкаДатыПроизводства;
	Элементы.КодыМаркировкиДатаПроизводства.Видимость = КорректировкаДатыПроизводства;
	
	КорректировкаСрокаГодности = (ВидКорректируемыхСведений = ВидыСведений.СрокГодности);
	Элементы.ТоварыКорректировкаДатаСрокаГодности.Видимость = КорректировкаСрокаГодности;
	Элементы.КодыМаркировкиДатаСрокаГодности.Видимость = КорректировкаСрокаГодности;
	
	КорректировкаИдентификатораВСД = (ВидКорректируемыхСведений = ВидыСведений.ИдентификаторВСД);
	Элементы.ТоварыКорректировкаИдентификаторВСД.Видимость = КорректировкаИдентификатораВСД;
	Элементы.КодыМаркировкиИдентификаторВСД.Видимость = КорректировкаИдентификатораВСД;
	
	КорректировкаКодаТНВЭД = (ВидКорректируемыхСведений = ВидыСведений.КодТНВЭД);
	Элементы.ТоварыКорректировкаКодТНВЭД.Видимость = КорректировкаКодаТНВЭД;
	Элементы.КодыМаркировкиТоварКодТНВЭД.Видимость = Ложь; // т.к. информация из товара может быть не актуальна
	
	КорректировкаФактическогоВеса = (ВидКорректируемыхСведений = ВидыСведений.ФактическийВес);
	Элементы.ТоварыКорректировкаФактическийВес.Видимость = КорректировкаФактическогоВеса;
	Элементы.КодыМаркировкиФактическийВес.Видимость = КорректировкаФактическогоВеса;
	
	КорректировкаСпособаВыпускаТоваров = (ВидКорректируемыхСведений = ВидыСведений.СпособВыпускаТоваров);
	Элементы.ТоварыКорректировкаСпособВыпускаТоваров.Видимость = КорректировкаСпособаВыпускаТоваров;
	
	КорректировкаВариативногоСрокаГодности = (ВидКорректируемыхСведений = ВидыСведений.ВариативныйСрокГодности);
	Элементы.ТоварыКорректировкаВариативныйСрокГодности.Видимость = КорректировкаВариативногоСрокаГодности;
	
	Элементы.ТоварыКорректировкаРазрешительныйДокумент.Видимость = ДопускаетсяУказаниеРазрешительнойДокументации();
	
	КорректировкаЛицензииНаНедра = (ВидКорректируемыхСведений = ВидыСведений.ЛицензияНаНедра);
	Элементы.ТоварыКорректировкаЛицензияНаНедра.Видимость = КорректировкаЛицензииНаНедра;
	
	КорректировкаНомераПартии = (ВидКорректируемыхСведений = ВидыСведений.НомерПартии);
	Элементы.ТоварыКорректировкаНомерПартии.Видимость = КорректировкаНомераПартии;
	
	ПоказатьКнопкуЗагрузкиКодов = (Не ЗначениеЗаполнено(ДокументУчета) И Не ЗначениеЗаполнено(ОперацияОснование));
	Элементы.Кнопка_ЗагрузитьКодыИзТабличногоДокумента.Видимость = ПоказатьКнопкуЗагрузкиКодов;
	
	Если ПоказатьКнопкуЗагрузкиКодов И Не ЗначениеЗаполнено(Товары) Тогда
		Элементы.ПанельЗакладок.ТекущаяСтраница = Элементы.ЗакладкаКодыМаркировки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_УведомлениеОСостоянииКодов()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.УведомлениеОСостоянииКодов Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.УведомлениеОСостоянииКодов.Видимость = Истина;
	Элементы.ЗакладкаТовары.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ТоварыКоличествоКодов.Видимость = Истина;
	Элементы.ТоварыПодчиненнаяОперация.Видимость = Истина;
	Элементы.ТоварыТовар.Видимость = Истина;
	Элементы.ТоварыТовар.ТолькоПросмотр = Истина;
	Элементы.ТоварыКлючНоменклатуры1С.Видимость = Истина;
	Элементы.ТоварыКлючНоменклатуры1С.ТолькоПросмотр = Истина;
	
	ВидыТранспортныхДокументов = МодульОбъекта().Перечисление_ВидыТранспортныхДокументов();
	Элементы.ГруппаТТН.Видимость = (ВидТранспортногоДокумента = ВидыТранспортныхДокументов.ТТН);
	Элементы.ИдентификаторЭПД.Видимость = (ВидТранспортногоДокумента = ВидыТранспортныхДокументов.ЭПД);
	
	ПоказатьКнопкуЗагрузкиКодов = (Не ЗначениеЗаполнено(ДокументУчета) И Не ЗначениеЗаполнено(ОперацияОснование));
	Элементы.Кнопка_ЗагрузитьКодыИзТабличногоДокумента.Видимость = ПоказатьКнопкуЗагрузкиКодов;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы_ПечатьКодов()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ПечатьКодов Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	Элементы.Кнопка_ВыполнитьОперацию.Заголовок = НСтр("ru = 'Завершить операцию'");
	
	Элементы.ЗакладкаПечатьЭтикеток.Видимость = Истина;
	Элементы.ПечатьКодов.Видимость = Истина;
	Элементы.ПоляТиповОпераций.ТекущаяСтраница = Элементы.ПечатьКодов;
	Элементы.КодыМаркировкиНапечатан.Видимость = Истина;
	
	Элементы.ЗакладкаКодыМаркировки.Видимость = Истина;
	Элементы.ЗакладкаКодыМаркировки.Заголовок = НСтр("ru = 'Коды для печати'");
	
	Элементы.ТоварыПредставлениеСтрокиДокумента.Видимость = Истина;
	Элементы.ТоварыТовар.ТолькоПросмотр = Истина;
	
	Элементы.ГруппаПараметрыПечати.Видимость = Истина;
	
	Элементы.ГруппаШаблонТоварнойЭтикетки.Видимость = ЕстьТоварныеЭтикетки;
	Элементы.ГруппаШаблонГрупповойЭтикетки.Видимость = ЕстьГрупповыеЭтикетки;
	Элементы.ГруппаШаблонТранспортнойЭтикетки.Видимость = ЕстьТранспортныеЭтикетки;
	Элементы.ГруппаШаблонЭтикеткиНабора.Видимость = ЕстьЭтикеткиНаборов;
	Элементы.ГруппаРазмерЭтикетки.Видимость = ЗначениеЗаполнено(РазмерЭтикетки);
	
	Элементы.ДекорацияРазмерЭтикеткиНеПоШаблону.Видимость =
	(ЗначениеЗаполнено(ШиринаЭтикеткиПоШаблону) И ШиринаЭтикетки <> ШиринаЭтикеткиПоШаблону)
	Или (ЗначениеЗаполнено(ВысотаЭтикеткиПоШаблону) И ВысотаЭтикетки <> ВысотаЭтикеткиПоШаблону);
	
	Элементы.ШаблонТоварнойЭтикетки.ОтметкаНезаполненного = ПечататьТоварныеЭтикетки И Не ЗначениеЗаполнено(ШаблонТоварнойЭтикетки);
	Элементы.ШаблонГрупповойЭтикетки.ОтметкаНезаполненного = ПечататьГрупповыеЭтикетки И Не ЗначениеЗаполнено(ШаблонГрупповойЭтикетки);
	Элементы.ШаблонТранспортнойЭтикетки.ОтметкаНезаполненного = ПечататьТранспортныеЭтикетки И Не ЗначениеЗаполнено(ШаблонТранспортнойЭтикетки);
	Элементы.ШаблонЭтикеткиНабора.ОтметкаНезаполненного = ПечататьЭтикеткиНаборов И Не ЗначениеЗаполнено(ШаблонЭтикеткиНабора);
	
	Элементы.ШаблонТоварнойЭтикетки.Доступность = ПечататьТоварныеЭтикетки;
	Элементы.ШаблонГрупповойЭтикетки.Доступность = ПечататьГрупповыеЭтикетки;
	Элементы.ШаблонТранспортнойЭтикетки.Доступность = ПечататьТранспортныеЭтикетки;
	Элементы.ШаблонЭтикеткиНабора.Доступность = ПечататьЭтикеткиНаборов;
	
	РазмерПорции = МодульОбъекта().НастройкиМодуля().КоличествоЭтикетокВОднойПорцииПоУмолчанию;
	ТекстЗаголовка = НСтр("ru = 'Показать первые %1 шт'");
	ТекстЗаголовка = МодульОбъекта().ПараметрыВСтроку(ТекстЗаголовка, Формат(РазмерПорции, "ЧГ=0"));
	Элементы.Кнопка_ПоказатьПервуюПорциюЭтикеток.Заголовок = ТекстЗаголовка;
	
	Если ОсновнойСтатус = СтатусыОпераций.Новый Тогда
		Элементы.Кнопка_СформироватьЭтикетки.КнопкаПоУмолчанию = Истина;
	Иначе
		
		Элементы.Кнопка_ВыполнитьОперацию.КнопкаПоУмолчанию = Истина;
		Элементы.ПараметрыПечати_Лево.Доступность = Ложь;
		Элементы.ПараметрыПечати_Право.Доступность = Ложь;
		
		Если Не МодульОбъекта().ВерсияПлатформыНиже("8.3.12") Тогда
			Элементы.ГруппаПараметрыПечати.Скрыть();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОперацияОснование) Тогда
		
		ТипОперацииОснования = МодульОбъекта().ЗначениеРеквизитаОбъектаЛок(ОперацияОснование, "ТипОперации");
		
		Если ТипОперацииОснования = ТипыОпераций.НаполнениеАгрегатовНаТСД Тогда
			Элементы.ПараметрыПечати_Лево.Видимость = Ложь;
		КонецЕсли;
		Если ТипОперацииОснования = ТипыОпераций.АгрегацияКодов Тогда
			Элементы.ГруппаПараметрыПечати.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		Если ПечатьИзСвободногоОстатка Тогда
			Элементы.КоличествоКодовТребуется.ФорматРедактирования = "";
		КонецЕсли;
	КонецЕсли;
	
	Если КоличествоКодовТребуется = 0 Тогда
		Элементы.КоличествоКодовТребуется.ЦветТекста = WebЦвета.ТемноСерый;
	Иначе
		Элементы.КоличествоКодовТребуется.ЦветТекста = Новый Цвет();
	КонецЕсли;
	
	НастройкиМодуля = МодульОбъекта().НастройкиМодуля();
	Для Сч = 1 По МодульОбъекта().КоличествоПараметровСортировкиЭтикеток() Цикл
		ИмяПараметра = НастройкиМодуля["ДопПараметрПечатиИмя" + Сч];
		Элемент = Элементы["ДопПараметрПечати" + Сч];
		Элемент.Заголовок = ИмяПараметра;
		Элемент.Видимость = ЗначениеЗаполнено(ИмяПараметра);
	КонецЦикла;
	
	ОбновитьНадписьНастройкиСортировкиЭтикеток();
	
КонецПроцедуры

// #КонецОбласти //УстановкаВидимости

&НаСервере
Процедура УстановитьПодсказкуДатаПервичногоДокумента()
	
	Если Не Элементы.ГруппаОтчетОНанесенииНомерДата.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПодсказки = НСтр(
	"ru = 'Указывается номер и дата первичного учетного документа,
	|подтверждающего факт производства продукции (для произведенной в РФ продукции)'");
	
	Отображение = МодульОбъекта().Перечисление_ВариантыОтображенияПодсказки().Кнопка;
	МодульОбъекта().УстановитьПодсказку(Элементы.ДатаДокументаОтчетОНанесении, ТекстПодсказки, Отображение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуМод()
	
	ВидыПродукции = МодульОбъекта().Перечисление_ВидыПродукции();
	
	Если ВидПродукции = ВидыПродукции.Бады Тогда
		ТекстПодсказки = НСтр("ru = 'Производственная площадка из ФГИС ""ВетИС"", если товары подлежат ветеринарному контролю'");
	ИначеЕсли ВидПродукции = ВидыПродукции.Пиво Или ВидПродукции = ВидыПродукции.БезалкогольноеПиво Тогда
		ТекстПодсказки = НСтр("ru = 'Место осуществления деятельности из ЕГАИС'");
	Иначе
		ТекстПодсказки = "";
	КонецЕсли;
	
	Отображение = МодульОбъекта().Перечисление_ВариантыОтображенияПодсказки().Кнопка;
	МодульОбъекта().УстановитьПодсказку(Элементы.ПлощадкаВводВОборот, ТекстПодсказки, Отображение);
	МодульОбъекта().УстановитьПодсказку(Элементы.ПлощадкаОтчетОНанесении, ТекстПодсказки, Отображение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуНомераСерии()
	
	ТекстПодсказки = НСтр(
	"ru = 'Допустимые символы:
	|• Буквы
	|• Цифры
	|• Пробел
	|• Символы / . , -'");
	
	Отображение = МодульОбъекта().Перечисление_ВариантыОтображенияПодсказки().Всплывающая;
	МодульОбъекта().УстановитьПодсказку(Элементы.НомерСерииОтчетОНанесении, ТекстПодсказки, Отображение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуНомераПартии()
	
	ВидыПродукции = МодульОбъекта().Перечисление_ВидыПродукции();
	
	Если ВидПродукции = ВидыПродукции.Молоко Тогда
		ТекстПодсказки = НСтр(
		"ru = 'Номер партии должен иметь следующий формат:
		|04600000000000260731/S-18, где:
		|• 04600000000000 - GTIN товара (14 цифр)
		|• 260731 - дата производства в формате ГГММДД (6 цифр)
		|• /S-18 - серийный номер (1-12 латинских букв, цифр или знаков / . , -)'");
	Иначе
		ТекстПодсказки = НСтр("ru = 'Допустимые символы:
		|• Цифры
		|• Символы / . , -
		|• Латинские буквы'");
	КонецЕсли;
	
	Отображение = МодульОбъекта().Перечисление_ВариантыОтображенияПодсказки().Кнопка;
	МодульОбъекта().УстановитьПодсказку(Элементы.НомерПартииОтчетОНанесении, ТекстПодсказки, Отображение);
	МодульОбъекта().УстановитьПодсказку(Элементы.НомерПартииРегистрацияНаборов, ТекстПодсказки, Отображение);
	МодульОбъекта().УстановитьПодсказку(Элементы.НомерПартииНаполнениеНаборовНаТСД, ТекстПодсказки, Отображение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуНомераДекларации()
	
	ТекстПодсказки = НСтр(
	"ru = 'Номер декларации должен иметь следующий формат:
	|00112233/310726/0016937, где:
	|• 00112233 - код таможни (8 цифр)
	|• 310726 - дата декларации в формате ДДММГГ (6 цифр)
	|• 0016937 - номер декларации (7 цифр)'");
	
	Отображение = МодульОбъекта().Перечисление_ВариантыОтображенияПодсказки().Кнопка;
	МодульОбъекта().УстановитьПодсказку(Элементы.НомерДекларации, ТекстПодсказки, Отображение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуИдентификатораГосКонтракта()
	
	ТекстПодсказки = НСтр(
	"ru = 'Допустимые символы:
	|• Буквы
	|• Цифры
	|• Символы % & '' "" ( ) * + , - _ ./ : ; < = > ? !'");
	
	Отображение = МодульОбъекта().Перечисление_ВариантыОтображенияПодсказки().Всплывающая;
	МодульОбъекта().УстановитьПодсказку(Элементы.ИдентификаторГосКонтрактаВыводИзОборота, ТекстПодсказки, Отображение);
	
КонецПроцедуры

&НаСервере
Процедура ЭтаФормаУстановитьТолькоПросмотр()
	
	ЭтаФорма.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ЗакладкаОсновная.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ЗаказКодовДляСервисПровайдера.ТолькоПросмотр = РежимТолькоПросмотр;
	
	Элементы.Кнопка_ДобавитьКодАТК.Доступность = Не РежимТолькоПросмотр;
	Элементы.Кнопка_ДобавитьКодАгрегата.Доступность = Не РежимТолькоПросмотр;
	Элементы.ДобавитьКодМаркировкиЗаказаКодов.Доступность = Не РежимТолькоПросмотр;
	Элементы.ДобавитьКодМаркировкиОтчетаОНанесении.Доступность = Не РежимТолькоПросмотр;
	
	ЭтаФормаУстановитьТолькоПросмотрОФ();
	
КонецПроцедуры

&НаСервере
Процедура ЭтаФормаУстановитьТолькоПросмотрОФ()
	
	Если Не ЭтаФорма.ТолькоПросмотр
		Или МодульОбъекта().ВерсияПлатформыНиже("8.5")
		Или Не МодульОбъекта().ЭтоОбычноеПриложение() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = Ложь;
	
	МодульОбъекта = МодульОбъекта();
	МодульОбщегоНазначения = МодульОбъекта.МодульОбщегоНазначения();
	РеквизитыФормы = ПолучитьРеквизиты();
	
	Для Каждого Элемент Из Элементы Цикл
		
		Видимость = МодульОбщегоНазначения.СвойствоОбъекта(Элемент, "Видимость", Истина);
		Если Не Видимость Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКоманды = МодульОбщегоНазначения.СвойствоОбъекта(Элемент, "ИмяКоманды");
		ПутьКДанным = МодульОбщегоНазначения.СвойствоОбъекта(Элемент, "ПутьКДанным");
		
		Если ЗначениеЗаполнено(ИмяКоманды) Тогда
			Команда = Команды.Найти(ИмяКоманды);
			ИзменяетСохраняемыеДанные = МодульОбщегоНазначения.СвойствоОбъекта(Команда, "ИзменяетСохраняемыеДанные", Ложь);
			Если ИзменяетСохраняемыеДанные Тогда
				Элемент.Доступность = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПутьКДанным) Тогда
			ИмяРеквизита = МодульОбщегоНазначения.РазделитьСтроку(ПутьКДанным, ".")[0];
			РеквизитФормы = МодульОбъекта.МассивСтруктур_Найти(РеквизитыФормы, ИмяРеквизита, "Имя");
			СохраняемыеДанные = МодульОбщегоНазначения.СвойствоОбъекта(РеквизитФормы, "СохраняемыеДанные", Ложь);
			Если СохраняемыеДанные Тогда
				Элемент.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокКодыМаркировки()
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	ТипыСтатусов = МодульОбъекта().Перечисление_ТипыСтатусов();
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	ПустаяОперация = Справочники.КонтурМаркировка_Операции.ПустаяСсылка();
	ПустойИдентификатор = МодульОбъекта().ПустойУникальныйИдентификатор();
	
	КодыМаркировки.ТекстЗапроса = ТекстЗапросаКодыМаркировки();
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ПустойИдентификатор", ПустойИдентификатор);
	
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("Операция", Ссылка);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ПустаяДата", '00010101');
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ПустаяОперация", ПустаяОперация);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ТипСтатуса_ОсновнойСтатус", ТипыСтатусов.ОсновнойСтатус);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("СтатусОперации_Новый", СтатусыОпераций.Новый);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("СтатусОперации_ОперацияЗавершена", СтатусыОпераций.ОперацияЗавершена);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("СтатусОперации_ПринятЧастично", СтатусыОпераций.ПринятЧастично);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("СтатусОперации_ОшибкаОбработки", СтатусыОпераций.ОшибкаОбработки);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("СтатусОперации_НеУдалосьРаспознатьКоды", СтатусыОпераций.НеУдалосьРаспознатьКоды);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("ИмяДопРеквизитаАртикул", МодульОбъекта().Перечисление_ИменаДопРеквизитов().Артикул);
	КодыМаркировки.Параметры.УстановитьЗначениеПараметра("СтатусОперации_ОбнаруженоДублированиеВАгрегатах", СтатусыОпераций.ОбнаруженоДублированиеВАгрегатах);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокАгрегатыВПакете()
	
	Если ТипОперации <> МодульОбъекта().Перечисление_ТипыОпераций().РегистрацияПакетаАгрегатов Тогда
		Возврат;
	КонецЕсли;
	
	АгрегатыВПакете.ТекстЗапроса = ТекстЗапросаКодыПакетаАгрегатов();
	АгрегатыВПакете.Параметры.УстановитьЗначениеПараметра("ОперацияОснование", ОперацияОснование);
	АгрегатыВПакете.Параметры.УстановитьЗначениеПараметра("КлючСтрокиОперацииОснования", КлючСтрокиОперацииОснования);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	ЗаполнитьСпискиВыбораЗаказаКодов();
	ЗаполнитьСпискиВыбораОтчетаОНанесении();
	ЗаполнитьСпискиВыбораВводаВОборот();
	ЗаполнитьСпискиВыбораВыводаИзОборота();
	ЗаполнитьСпискиВыбораСообщенияОбОтгрузке();
	ЗаполнитьСпискиВыбораПараметрыПечати();
	ЗаполнитьСпискиВыбораФорматКодов();
	ЗаполнитьСпискиВыбораФормированияАТК();
	ЗаполнитьСпискиВыбораКорректировкиСведенийОКодах();
	ЗаполнитьСпискиВыбораУведомлениеОСостоянииКодов();
	ЗаполнитьСпискиВыбораПодборКодовНаТСД();
	ЗаполнитьСписокВыбораРазрешительногоДокументаВсемиРД(ЭтаФорма, МодульОбъекта());
	
	ЗаполнитьПустыеСпискиВыбораТекущимиЗначениями();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеСпискиВыбораТекущимиЗначениями()
	
	СвойствоРежимВыбораИзСписка = Новый Структура("РежимВыбораИзСписка");
	
	Для Каждого Элемент Из Элементы Цикл
		
		СвойствоРежимВыбораИзСписка.РежимВыбораИзСписка = Неопределено;
		ЗаполнитьЗначенияСвойств(СвойствоРежимВыбораИзСписка, Элемент);
		
		Если СвойствоРежимВыбораИзСписка.РежимВыбораИзСписка <> Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.СписокВыбора) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Найти(Элемент.ПутьКДанным, ".") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = ЭтаФорма[Элемент.ПутьКДанным];
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		МодульОбъекта().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораПараметрыПечати()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ПечатьКодов Тогда
		Возврат;
	КонецЕсли;
	
	МассивТоваров = Новый Массив;
	МассивНоменклатуры = Новый Массив;
	
	Если ЗначениеЗаполнено(ОперацияОснование) Тогда
		
		Для Каждого СтрокаТовары Из ОперацияОснование.Товары Цикл
			МассивТоваров.Добавить(СтрокаТовары.Товар);
			МассивНоменклатуры.Добавить(СтрокаТовары.КлючНоменклатуры1С);
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(ДокументУчета) Тогда
		
		Для Каждого СтрокаТовары Из ДокументУчета.ТоварыМаркировки Цикл
			МассивТоваров.Добавить(СтрокаТовары.Товар);
		КонецЦикла;
		
		Для Каждого СтрокаТоварыДокумента Из ДокументУчета.ТоварыДокумента Цикл
			МассивНоменклатуры.Добавить(СтрокаТоварыДокумента.КлючНоменклатуры1С);
		КонецЦикла;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	СписокВыбораТовар = Элементы.Товар.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбораТовар, МассивТоваров);
	
	СписокВыбораНоменклатура = Элементы.КлючНоменклатуры1С.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбораНоменклатура, МассивНоменклатуры);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораЗаказаКодов()
	
	Если ТипОперации <> МодульОбъекта().Перечисление_ТипыОпераций().ЗаказКодов Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Элементы.ТипОплатыКодов.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ТипыОплатыКодов();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораОтчетаОНанесении()
	
	Если Не МодульОбъекта().ЭтоОтчетОНанесении(ТипОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокВыбораТиповИспользованияКодов();
	ЗаполнитьСписокВыбораТиповСрокаГодности();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТиповИспользованияКодов()
	
	СписокВыбора = Элементы.ТипИспользования.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ТипыИспользованияКодов();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТиповСрокаГодности()
	
	Если Не МодульОбъекта().ЭтоОтчетОНанесении(ТипОперации) Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Элементы.ТипСрокаГодности.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ДопустимыеТипыСроковГодности(ВидПродукции);
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораВводаВОборот()
	
	Если ТипОперации <> МодульОбъекта().Перечисление_ТипыОпераций().ВводВОборот Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Элементы.ТипУчастникаВводящегоВОборот.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ТипыУчастниковВводящихВОборот();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
	СписокВыбора = Элементы.ПринятоеРешение.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ПринятыеРешения();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
	СписокВыбора = Элементы.КодСтраныЭкспортера.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().СписокСтранЕАЭС();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораВыводаИзОборота()
	
	Если ТипОперации <> МодульОбъекта().Перечисление_ТипыОпераций().ВыводИзОборота Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Элементы.КодСтраныПолучателяВыводИзОборота.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, МодульОбъекта().СписокСтранМира());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораСообщенияОбОтгрузке()
	
	Если ТипОперации <> МодульОбъекта().Перечисление_ТипыОпераций().СообщениеОбОтгрузке Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Элементы.ТипОтгрузки.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, МодульОбъекта().Перечисление_ТипыОтгрузок().ТрансграничнаяТорговля);
	
	СписокВыбора = Элементы.ПричинаВыводаИзОборотаПриОтгрузке.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ПричиныВыводаИзОборотаПриОтгрузке();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
	СписокВыбора = Элементы.КодСтраныПолучателя.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, МодульОбъекта().СписокСтранМира());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораФорматКодов()
	
	СписокВыбора = Элементы.ФорматКодов.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ФорматыКодов();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораФормированияАТК()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если ТипОперации <> ТипыОпераций.ФормированиеАТК Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Элементы.ГруппаТНВЭД.СписокВыбора;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыТНВЭД.Значение КАК ГруппаТНВЭД
	|ИЗ
	|	Справочник.КонтурМаркировка_ДокументыУчета.ТоварыМаркировки КАК ТоварыМаркировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК ГруппыТНВЭД
	|		ПО ТоварыМаркировки.Товар = ГруппыТНВЭД.Объект
	|			И (ГруппыТНВЭД.ИмяРеквизита = ""ГруппаТНВЭД"")
	|ГДЕ
	|	ТоварыМаркировки.Ссылка = &ДокументУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГруппаТНВЭД УБЫВ");
	Запрос.УстановитьПараметр("ДокументУчета", ДокументУчета);
	
	ЗначенияСписка = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГруппаТНВЭД");
	
	// На случай если ГруппаТНВЭД заполнена в операции, а в товаре её изменили,
	// добавим текущее значение в список, чтобы корректно отобразить в операции
	Если ЗначениеЗаполнено(ГруппаТНВЭД) И ЗначенияСписка.Найти(ГруппаТНВЭД) = Неопределено Тогда
		ЗначенияСписка.Добавить(ГруппаТНВЭД);
	КонецЕсли;
	
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораКорректировкиСведенийОКодах()
	
	Если ТипОперации <> МодульОбъекта().Перечисление_ТипыОпераций().КорректировкаСведенийОКодах Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Элементы.ТоварыКорректировкаСпособВыпускаТоваров.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ДопустимыеСпособыВыпускаТоваровДляКорректировки();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
	ЗначенияСписка = МодульОбъекта().Перечисление_ТипыКорректировокСведенийОКодах();
	СписокВыбора = Элементы.ТоварыТипКорректировкиРазрешительногоДокумента.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	СписокВыбора = Элементы.ТоварыТипКорректировкиЛицензииНаНедра.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораУведомлениеОСостоянииКодов()
	
	Если ТипОперации <> МодульОбъекта().Перечисление_ТипыОпераций().УведомлениеОСостоянииКодов Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Элементы.ВидТранспортногоДокумента.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, МодульОбъекта().Перечисление_ВидыТранспортныхДокументов());
	
	СписокВыбора = Элементы.СостояниеКодов.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, МодульОбъекта().Перечисление_СостоянияКодов());
	
	СписокВыбора = Элементы.КодСтраныПолучателяУведомлениеОСостоянииКодов.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, МодульОбъекта().СписокСтранМира());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораПодборКодовНаТСД()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	Если ТипОперации <> ТипыОпераций.ПодборКодовНаТСД
		И ТипОперации <> ТипыОпераций.ПодборТоваровИКодовНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Элементы.ВидПродукцииПодборКодовНаТСД.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, МодульОбъекта().ВсеВидыПродукции());
	
	СписокВыбора = Элементы.ОтражениеВЭДО.СписокВыбора;
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, МодульОбъекта().ДопустимыеОтраженияВЭДОДляПодбораКодовНаТСД());
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораРазрешительногоДокументаВсемиРД(Форма, Модуль)
	
	ЗначенияСписка = Новый Соответствие;
	Для каждого Стр Из Форма.Товары Цикл
		Если ЗначениеЗаполнено(Стр.РазрешительныйДокумент) Тогда
			ЗначенияСписка.Вставить(Стр.РазрешительныйДокумент, Стр.РазрешительныйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	Модуль.ЗаполнитьСписокВыбора(Форма.Элементы.ТоварыРазрешительныйДокумент_ВводВОборот.СписокВыбора, ЗначенияСписка);
	Модуль.ЗаполнитьСписокВыбора(Форма.Элементы.ТоварыРазрешительныйДокумент_ВозвратВОборот.СписокВыбора, ЗначенияСписка);
	Модуль.ЗаполнитьСписокВыбора(Форма.Элементы.ТоварыРазрешительныйДокумент_Перемаркировка.СписокВыбора, ЗначенияСписка);
	Модуль.ЗаполнитьСписокВыбора(Форма.Элементы.ТоварыРазрешительныйДокумент_Корректировка.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Функция Заголовок_ИННКПП()
	
	Если МодульОбъекта().ЭтоИП(КонтрагентИНН) Тогда
		Возврат КонтрагентИНН;
	КонецЕсли;
	
	ТекстИНН = "<ИНН>";
	Если ЗначениеЗаполнено(КонтрагентИНН) Тогда
		ТекстИНН = КонтрагентИНН;
	КонецЕсли;
	
	ТекстКПП = "<КПП>";
	Если ЗначениеЗаполнено(КонтрагентКПП) Тогда
		ТекстКПП = КонтрагентКПП;
	КонецЕсли;
	
	Результат = МодульОбъекта().ПараметрыВСтроку("%1/%2", ТекстИНН, ТекстКПП);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Заголовок_ИнформацияОДоставке()
	
	Если Не ЗначениеЗаполнено(АдресДоставки)
		И Не ЗначениеЗаполнено(КонтактныйТелефон) Тогда
		Возврат НСтр("ru = '<Информация о доставке>'");
	КонецЕсли;
	
	Результат = "";
	
	ШаблонЗаголовка = НСтр("ru = 'Адрес: %1, телефон: %2'");
	ТекстАдресДоставки = "";
	
	Если ЗначениеЗаполнено(АдресДоставки) Тогда
		ТекстАдресДоставки = АдресДоставки;
		Если СтрДлина(ТекстАдресДоставки) > 52 Тогда
			ТекстАдресДоставки = Лев(ТекстАдресДоставки, 49) + "...";
		КонецЕсли;
	КонецЕсли;
	
	Результат = МодульОбъекта().ПараметрыВСтроку(ШаблонЗаголовка, ТекстАдресДоставки, КонтактныйТелефон);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СохранитьИСоздатьЗадачу(Повторно = Ложь)
	
	СохранитьОперацию();
	
	МодульОбъекта().Задача_Создать(Ссылка);
	
	Если Повторно И ЗначениеЗаполнено(ОперацияОснование) Тогда
		ВосстановитьПодчиненные = Ложь;
		МодульОбъекта().Операция_ВосстановитьОбменСМоментаОшибки(ОперацияОснование, ВосстановитьПодчиненные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьОперацию()
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	Если ОсновнойСтатус <> СтатусыОпераций.ОперацияЗавершена Тогда
		ОсновнойСтатус = СтатусыОпераций.ОперацияЗавершена;
		МодульОбъекта().СтатусыОперации_ЗаписатьОсновнойСтатус(Ссылка, ОсновнойСтатус);
	КонецЕсли;
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодчиненнойОперацииНаУровнеСтроки(ТаблицаФормы, ВыбраннаяСтрока)
	
	ДанныеСтроки = ТаблицаФормы.ДанныеСтроки(ВыбраннаяСтрока);
	
	Если Не ЗначениеЗаполнено(ДанныеСтроки.Операция) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОперации(ДанныеСтроки.Операция, ЭтаФорма);
	
	МодульКлиента().Метрика_Функциональность_ОткрытиеПодчиненнойОперацииСтроки(Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторПеременныхХарактеристик(СтрокаТовара)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ТоварыОбновитьКоличествоПослеРедактирования", ЭтаФорма, СтрокаТовара);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Операция", Ссылка);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("КлючСтрокиОперации", СтрокаТовара.КлючСтрокиОперации);
	ПараметрыФормы.Вставить("Товар", СтрокаТовара.Товар);
	ПараметрыФормы.Вставить("НоминальноеКоличество", СтрокаТовара.НоминальноеКоличество);
	ПараметрыФормы.Вставить("ИспользоватьНоминальноеКоличество", ИспользоватьНоминальноеКоличество);
	
	МодульКлиента().ОткрытьФормуОбработкиМодально("Форма_РедакторПеременныхХарактеристик", ЭтаФорма, ПараметрыФормы, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбновитьКоличествоПослеРедактирования(НовыйОбъем, СтрокаТоваров) Экспорт
	
	Если НовыйОбъем = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТоваров.Количество = НовыйОбъем;
	СохранитьОперацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторЗаводскихСерийныхНомеров(СтрокаТоваров)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ТоварыОбновитьДанныеЗСНПослеРедактирования", ЭтаФорма, СтрокаТоваров);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Операция", Ссылка);
	ПараметрыФормы.Вставить("Товар", СтрокаТоваров.Товар);
	ПараметрыФормы.Вставить("КлючНоменклатуры1С", СтрокаТоваров.КлючНоменклатуры1С);
	ПараметрыФормы.Вставить("КлючСтрокиОперации", СтрокаТоваров.КлючСтрокиОперации);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	МодульКлиента().ОткрытьРедакторЗаводскихСерийныхНомеров(ЭтаФорма, ПараметрыФормы, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбновитьДанныеЗСНПослеРедактирования(Успешно, СтрокаТоваров) Экспорт
	
	Если Успешно <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКоличествоЗаводскихСерийныхНомеров();
	
	Оповестить("КонтурМаркировка_Операция_КоличествоЗСНИзменено", ДокументУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторАльтСроковГодности(СтрТовара)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения(
	"АльтСрокиГодностиПослеРедактирования", ЭтаФорма, СтрТовара);
	
	ДатаПроизводстваТовара = ДатаПроизводства;
	Если ЗначениеЗаполнено(СтрТовара.ДатаПроизводства) Тогда
		ДатаПроизводстваТовара = СтрТовара.ДатаПроизводства;
	КонецЕсли;
	
	АльтСрокиГодности = АльтСрокиГодностиТовара(ЭтаФорма, СтрТовара.КлючСтрокиОперации);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Товар", СтрТовара.Товар);
	ПараметрыФормы.Вставить("ДатаПроизводства", ДатаПроизводстваТовара);
	ПараметрыФормы.Вставить("АльтернативныеСрокиГодности", АльтСрокиГодности);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	МодульКлиента().ОткрытьАльтернативныеСрокиГодности(ЭтаФорма, ПараметрыФормы, Обработчик);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция АльтСрокиГодностиТовара(Форма, КлючСтрокиОперации)
	
	Результат = Новый Соответствие;
	
	Отбор = Новый Структура("КлючСтрокиОперации", КлючСтрокиОперации);
	Для каждого Стр Из Форма.АльтернативныеСрокиГодности.НайтиСтроки(Отбор) Цикл
		Результат.Вставить(Стр.Тип, Стр.ДатаСрокаГодности);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура АльтСрокиГодностиПослеРедактирования(Результат, СтрТовара) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючСтрокиОперации = СтрТовара.КлючСтрокиОперации;
	
	Отбор = Новый Структура("КлючСтрокиОперации", КлючСтрокиОперации);
	Для Каждого Стр Из АльтернативныеСрокиГодности.НайтиСтроки(Отбор) Цикл
		АльтернативныеСрокиГодности.Удалить(Стр);
	КонецЦикла;
	
	Для Каждого Элемент Из Результат Цикл
		НоваяСтрока = АльтернативныеСрокиГодности.Добавить();
		НоваяСтрока.Тип = Элемент.Ключ;
		НоваяСтрока.ДатаСрокаГодности = Элемент.Значение;
		НоваяСтрока.КлючСтрокиОперации = КлючСтрокиОперации;
	КонецЦикла;
	
	ОбновитьПризнакЗаполненияАльтернативныхСроковГодности(ЭтаФорма, СтрТовара);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьОперацию(Знач ОписаниеОперации = Неопределено, Знач ТаблицаКодов = Неопределено)
	
	Если ОписаниеОперации = Неопределено Тогда
		ОписаниеОперации = ОписаниеОперацииПоКонтекстуФормы();
	КонецЕсли;
	
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	Попытка
		
		МодульОбъекта().Операция_Записать(ОписаниеОперации);
		ВерсияДанных = ОписаниеОперации.ВерсияДанных;
		Ссылка = ОписаниеОперации.Ссылка;
		
		Если ТаблицаКодов = Неопределено Тогда
			
			Если ИзмененСоставТоваров Тогда
				
				КлючиСтрокОперации = Товары.Выгрузить(, "КлючСтрокиОперации").ВыгрузитьКолонку("КлючСтрокиОперации");
				
				ТаблицаКодов = МодульОбъекта().КодыОпераций_Прочитать(Ссылка);
				КоличествоДо = ТаблицаКодов.Количество();
				МодульОбъекта().ТаблицаЗначений_УдалитьДругиеЗначения(ТаблицаКодов, "КлючСтрокиОперации", КлючиСтрокОперации);
				
				Если КоличествоДо > ТаблицаКодов.Количество() Тогда
					МодульОбъекта().КодыОпераций_Записать(ТаблицаКодов, Ссылка);
					ОбновитьСписокКодовМаркировки();
				КонецЕсли;
				
				ПосчитатьКоличествоСтрокТаблицФормы();
				
				ИзмененСоставТоваров = Ложь;
				
			КонецЕсли;
			
		Иначе
			МодульОбъекта().КодыОпераций_Записать(ТаблицаКодов, Ссылка);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение;
	КонецПопытки;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяЗакрытьОперациюПослеРедактированияКодов(ОперацияРедактораКодов)
	
	Результат = Ложь;
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	Если (Ссылка = ОперацияРедактораКодов
		ИЛИ Ссылка = ОперацияРедактораКодов.ОперацияОснование)
		И ТипОперации <> ТипыОпераций.ДобавлениеВАгрегат
		И ТипОперации <> ТипыОпераций.ИзъятиеИзАгрегата
		И ТипОперации <> ТипыОпераций.ДобавлениеВАТК
		И ТипОперации <> ТипыОпераций.ИзъятиеИзАТК
		И ТипОперации <> ТипыОпераций.КорректировкаСведенийОКодах Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	СохранитьОперацию();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().КорректировкаСведенийОКодах Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	ИзмененСоставТоваров = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока Тогда
		ИзмененСоставТоваров = Истина;
	КонецЕсли;
	
	Если Найти(Элемент.ТекущийЭлемент.Имя, "ТоварыРазрешительныйДокумент") = 1 Тогда
		ЗаполнитьСписокВыбораРазрешительногоДокументаВсемиРД(ЭтаФорма, МодульКлиента());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	
	Если Поле = Элементы.ТоварыОперация Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуПодчиненнойОперацииНаУровнеСтроки(Элемент, ВыбраннаяСтрока);
	КонецЕсли;
	
	Если ТолькоПросмотр Или Поле.ТолькоПросмотр Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ЭтоТовар = (Поле = Элементы.ТоварыТовар И ЗначениеЗаполнено(ДанныеСтроки.Товар));
		Если ЭтоТовар Тогда
			МодульКлиента().ОткрытьФормуТовара(ДанныеСтроки.Товар, ЭтаФорма);
			Возврат;
		КонецЕсли;
		
		ЭтоКлючНоменклатуры1С = (Поле = Элементы.ТоварыКлючНоменклатуры1С И ЗначениеЗаполнено(ДанныеСтроки.КлючНоменклатуры1С));
		Если ЭтоКлючНоменклатуры1С Тогда
			МодульКлиента().ОткрытьФормуКлючаНоменклатуры1С(ДанныеСтроки.КлючНоменклатуры1С, ЭтаФорма);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ТолькоПросмотр Тогда
		ТоварыРедактироватьЗначение(Поле, ДанныеСтроки, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРедактироватьЗначение(Поле, ДанныеСтроки, СтандартнаяОбработка)
	
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	
	Если Поле = Элементы.ТоварыКоличество И ДанныеСтроки.ТребуетсяУказатьКоличество Тогда
		СтандартнаяОбработка = Ложь;
		Если ТипОперации = ТипыОпераций.ОтчетОНанесении Тогда
			ОткрытьРедакторПеременныхХарактеристик(ДанныеСтроки);
		КонецЕсли;
	КонецЕсли;
	
	Если Поле = Элементы.ТоварыКоличествоЗСН Тогда
		СтандартнаяОбработка = Ложь;
		Если ДанныеСтроки.ТребуетсяЗСН Тогда
			ОткрытьРедакторЗаводскихСерийныхНомеров(ДанныеСтроки);
		КонецЕсли;
	КонецЕсли;
	
	Если Поле = Элементы.ТоварыКодСтраныПроизводителя Тогда
		СтандартнаяОбработка = Ложь;
		ЗначенияСписка = МодульКлиента().СписокСтранМира();
		ЗначенияСписка.Вставить(0, "00", "НЕИЗВЕСТНО");
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Товары_ПослеВыбораКодСтраныПроизводителя", ЭтаФорма);
		МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
			, ЗначенияСписка
			, Элементы.ТоварыКодСтраныПроизводителя
			, ЭтаФорма
			, ДанныеСтроки.КодСтраныПроизводителя);
	КонецЕсли;
	
	ЭтоАльтСрок = (Поле = Элементы.ТоварыАльтернативныйСрокГодности Или Поле = Элементы.ТоварыКорректировкаВариативныйСрокГодности);
	Если ЭтоАльтСрок И ДанныеСтроки.ДопустимоУказаниеСрокаГодности Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьРедакторАльтСроковГодности(ДанныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Товары_ПослеВыбораКодСтраныПроизводителя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Товары_КодСтраныПроизводителяНаСервере(РезультатВыбора.Значение);
	
КонецПроцедуры

&НаСервере
Процедура Товары_КодСтраныПроизводителяНаСервере(НовыйКодСтраныПроизводителя)
	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Если Не ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		ВыделенныеСтроки.Добавить(Элементы.Товары.ТекущаяСтрока);
	КонецЕсли;
	
	Для каждого Идентификатор Из ВыделенныеСтроки Цикл
		Стр = Товары.НайтиПоИдентификатору(Идентификатор);
		Стр.КодСтраныПроизводителя = НовыйКодСтраныПроизводителя;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	МодульКлиента().ОткрытьФормуОбработкиЛок("Форма_Товары_Список", Элемент, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	
	ТоварыТоварПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТоварыТоварПриИзмененииНаСервере()
	
	Стр = Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	ЗаполнитьСтрокуТоваровДаннымиИБ(Стр);
	
	ЗаполнитьСписокВыбораРазрешительногоДокументаВсемиРД(ЭтаФорма, МодульОбъекта());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТоварСсылка = Элементы.Товары.ТекущиеДанные.Товар;
	
	Если ЗначениеЗаполнено(ТоварСсылка) Тогда
		МодульКлиента().ОткрытьФормуТовара(ТоварСсылка, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКлючНоменклатуры1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ТоварыКлючНоменклатуры1СПослеВыбора", ЭтаФорма, Элементы.Товары.ТекущаяСтрока);
	
	МодульКлиента().ОткрытьФормуВыбораКлючаНоменклатуры1С(ОписаниеОбработчика, ТекДанные.КлючНоменклатуры1С, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКлючНоменклатуры1СПослеВыбора(РезультатВыбора, ИдентификаторСтроки) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Стр = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	Стр.КлючНоменклатуры1С = РезультатВыбора;
	
	ЗаполнитьТоварПоКлючуНоменклатуры1С(ИдентификаторСтроки);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	
	Если ТипОперации <> ТипыОпераций.ФормированиеКИГУ Тогда
		Возврат;
	КонецЕсли;
	
	Стр = Элементы.Товары.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(Стр.Товар) Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоВложений = МодульКлиента().ЗначениеРеквизитаОбъектаЛок(Стр.Товар, "КоличествоВложений");
	Стр.КоличествоУпаковокВложенногоТовара = Стр.КоличествоУпаковок * КоличествоВложений;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДатаСрокаГодностиПриИзменении(Элемент)
	
	УдалитьВремяСрокаГодностиВСтрокеТовара(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКорректировкаДатаСрокаГодностиПриИзменении(Элемент)
	
	УдалитьВремяСрокаГодностиВСтрокеТовара(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВремяСрокаГодностиВСтрокеТовара(СтрокаТовара)
	
	Если Не СтрокаТовара.СрокГодностиМеньше72Часов Тогда
		СтрокаТовара.ДатаСрокаГодности = НачалоДня(СтрокаТовара.ДатаСрокаГодности);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоВложеннымТоварам(Стр)
	
	ВложеныйТовар = МодульКлиента().ЗначениеРеквизитаОбъектаЛок(Стр.Товар, "ВложенныйТовар");
	КоличествоВложений = МодульКлиента().ЗначениеРеквизитаОбъектаЛок(Стр.Товар, "КоличествоВложений");
	
	Если Не ЗначениеЗаполнено(ВложеныйТовар) Тогда
		Возврат;
	КонецЕсли;
	
	Стр.ВложенныйТовар = ВложеныйТовар;
	Стр.КоличествоУпаковокВложенногоТовара = Стр.КоличествоУпаковок * КоличествоВложений;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКлючНоменклатуры1СОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	МодульКлиента().ОткрытьФормуКлючаНоменклатуры1С(ТекущиеДанные.КлючНоменклатуры1С, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКлючНоменклатуры1СПриИзменении(Элемент)
	
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(Стр.КлючНоменклатуры1С) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТоварПоКлючуНоменклатуры1С(Элементы.Товары.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОграниченияПоТарифуНажатие(Элемент)
	
	МодульКлиента().ОткрытьИнформациюОТарифах();
	
КонецПроцедуры

&НаКлиенте
Процедура НеОблагаетсяНДСПриИзменении(Элемент)
	
	Для каждого Стр Из Товары Цикл
		Стр.СуммаНДС = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	МодульКлиента().ОткрытьФормуОбработкиЛок("Форма_Организации_Список", Элемент, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьВидАгрегата();
	ОбновитьПризнакОперацияОграниченаТарифом();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОткрытие(Элемент, СтандартнаяОбработка)
	
	МодульКлиента().ОткрытьФормуОрганизации(Организация, ЭтаФорма);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("Организация", Организация);
	
	МодульКлиента().ОткрытьФормуОбработкиЛок("Форма_Склады_Список", Элемент, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииАгрегацияКодовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляОперацийАгрегации();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииНаполнениеАгрегатовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляОперацийАгрегации();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииНаполнениеАгрегатовПриИзменении(Элемент)
	
	ВидПродукцииНаполнениеАгрегатовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииНаполнениеАгрегатовПриИзмененииНаСервере()
	
	ПерезаполнитьТаблицыОперации();
	ПерезаполнитьЗначенияПоУмолчаниюОперации();
	УстановитьВидимостьПолей_НаполнениеАгрегатовНаТСД();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииОтчетОВыбытииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляВыбытияКодов();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииРегистрацияАгрегатовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляОперацийАгрегации();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииРегистрацияНаборовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТипыНаборов = МодульКлиента().Перечисление_ТипыНаборов();
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляРегистрацииНаборов(ТипНабора);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииУведомлениеОСостоянииКодовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляУведомленияОСостоянииКодов();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииОтчетОНанесенииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляОтчетаОНанесении();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииОтчетОНанесенииПриИзменении(Элемент)
	
	ВидПродукцииОтчетОНанесенииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииОтчетОНанесенииПриИзмененииНаСервере()
	
	Если Не МодульОбъекта().ВидПродукцииДопускаетУказаниеТипаОтчетаОНанесении(ВидПродукции) Тогда
		ТипОтчетаОНанесении = МодульОбъекта().Перечисление_ТипыОтчетаОНанесении().ОтчетОНанесении;
		ОчиститьКодМаркировки();
	КонецЕсли;
	
	Если Не МодульОбъекта().ВидПродукцииТребуетУказатьТипСрокаГодности(ВидПродукции) Тогда
		ТипСрокаГодности = "";
	КонецЕсли;
	
	ПерезаполнитьТаблицыОперации();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииСообщениеОбОтгрузкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляСообщенияОбОтгрузке(ТипОтгрузки, ОбъемноСортовойУчет);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииСообщениеОбОтгрузкеПриИзменении(Элемент)
	
	ВидПродукцииСообщениеОбОтгрузкеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииСообщениеОбОтгрузкеПриИзмененииНаСервере()
	
	ЗаполнитьКодСтраныПолучателя();
	
	ПерезаполнитьТаблицыОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииПеремаркировкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляПеремаркировки();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииРасформированиеНаборовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляЗаказаНаборов();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииНаполнениеНаборовНаТСДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТипыНаборов = МодульКлиента().Перечисление_ТипыНаборов();
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляРегистрацииНаборов(ТипНабора);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииРегистрацияКИГУНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляРегистрацииКИГУ();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииАТКПриИзменении(Элемент)
	
	ВидПродукцииАТКПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииАТКПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(ДокументУчета) Или ЗначениеЗаполнено(ОперацияОснование) Тогда
		ПерезаполнитьТаблицыОперации();
	КонецЕсли;
	
	НастроитьЭлементыФормы_ТрансформацияАТК();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииРегистрацияНаборовПриИзменении(Элемент)
	
	ВидПродукцииРегистрацияНаборовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииРегистрацияНаборовПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(ДокументУчета) Или ЗначениеЗаполнено(ОперацияОснование) Тогда
		ПерезаполнитьТаблицыОперации();
	КонецЕсли;
	
	НастроитьЭлементыФормы_РегистрацияНаборов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииНаполнениеНаборовНаТСДПриИзменении(Элемент)
	
	ВидПродукцииНаполнениеНаборовНаТСДПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииНаполнениеНаборовНаТСДПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(ДокументУчета) Или ЗначениеЗаполнено(ОперацияОснование) Тогда
		ПерезаполнитьТаблицыОперации();
	КонецЕсли;
	
	НастроитьЭлементыФормы_НаполнениеНаборовНаТСД();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ДокументУчета) Или ЗначениеЗаполнено(ОперацияОснование) Тогда
		ПерезаполнитьТаблицыОперации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПервичногоДокумента(ПричинаВыводаИзОборота);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаПриИзменении(Элемент)
	
	ДатаДокумента = Неопределено;
	НомерДокумента = Неопределено;
	
	УстановитьВидимостьПолей_ВыводИзОборота();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСрокаГодностиПриИзменении(Элемент)
	
	ТипСрокаГодностиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТипСрокаГодностиПриИзмененииНаСервере()
	
	ПерезаполнитьТаблицыОперации();
	УстановитьВидимостьПолей_ОтчетОНанесении();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОтгрузкиПриИзменении(Элемент)
	
	ТипОтгрузкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТипОтгрузкиПриИзмененииНаСервере()
	
	ЗаполнитьКодСтраныПолучателя();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	МодульКлиента().ОткрытьФормуОбработкиЛок("Форма_Товары_Список", Элемент, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаПеремаркировкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеПричиныПеремаркировки(ВидПродукции);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаПеремаркировкиПриИзменении(Элемент)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодСтраныПолучателя()
	
	Если ТипОтгрузки = МодульОбъекта().Перечисление_ТипыОтгрузок().ТрансграничнаяТорговля Тогда
		ДопустимыеСтраны = МодульОбъекта().ДопустимыеСтраныДляСообщенияОбОтгрузке(ВидПродукции);
		Если ДопустимыеСтраны.Количество() = 1 Тогда
			КодСтраныПолучателя = ДопустимыеСтраны[0].Значение;
			Модифицированность = Истина;
		КонецЕсли;
	Иначе
		КодСтраныПолучателя = "";
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодСтраныПолучателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеСтраныДляСообщенияОбОтгрузке(ВидПродукции);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура КодСтраныПолучателяВыводИзОборотаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеСтраныДляВыводаИзОборота(ВидПродукции, ПричинаВыводаИзОборота);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПроизводственногоЗаказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеТипыПроизводственныхЗаказов(ВидПродукции);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПроизводственногоЗаказаПриИзменении(Элемент)
	
	УстановитьВидимостьПолей_ВводВОборот();
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаВозвратаВОборотНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеПричиныВозвратаВОборот(ВидПродукции);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаВозвратаВОборотПриИзменении(Элемент)
	
	ПричинаВозвратаВОборотПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПричинаВозвратаВОборотПриИзмененииНаСервере()
	
	ЗаполнитьВидПервичногоДокумента();
	УстановитьВидимостьПолей_ВозвратВОборот();
	ПерезаполнитьТаблицыОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировкиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Не ЗначениеЗаполнено(Элементы.КодыМаркировки.ВыделенныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Выбранные коды будут удалены из операции, продолжить?'");
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("УдалитьКодыИзОперацииПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКодов_ВыполнитьЗаказ(Команда)
	
	Если Модифицированность Тогда
		СохранитьОперацию();
	КонецЕсли;
	
	МодульКлиента().ЗаказКодов_Отправить(Ссылка);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроизводстваОтчетОНанесенииПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ДатаПроизводства)
		Или Не ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесении() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Пересчитать сроки годности товаров?'");
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПересчитатьСрокиГодностиПоДатеПроизводстваВШапкеПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСрокиГодностиПоДатеПроизводстваВШапкеПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьСрокиГодностиПоДатеПроизводстваВШапкеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДатаПроизводстваОтчетОНанесенииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		Или Не ЗначениеЗаполнено(ТекущиеДанные.ДатаПроизводства)
		Или Не ТекущиеДанные.ДопустимоУказаниеСрокаГодности Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Пересчитать сроки годности товаров?'");
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ПересчитатьСрокиГодностиТовараПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНомерДокументаСертификацииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанные.НомерДокументаСертификации = СокрЛП(ТекущиеДанные.НомерДокументаСертификации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСрокиГодностиТовараПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока;
	
	ТипыСрокаГодности = МодульКлиента().Перечисление_ТипыСроковГодности();
	ПересчитатьАльтСроки = ТипСрокаГодности = ТипыСрокаГодности.СрокГодностиБольше72СУсловием;
	
	ПересчитатьСрокиГодностиТовара(ТекущаяСтрока, ТекущиеДанные.ДатаПроизводства, ПересчитатьАльтСроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплаченоПриИзменении(Элемент)
	
	УстановитьВидимостьПолей_ВозвратВОборот();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаПодсказкиНажатие(Элемент)
	
	МодульКлиента().ОткрытьСправкуАвтоподбораПозицииНаТСД();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	
	ОчиститьСообщения();
	
	Возврат ПроверитьЗаполнениеРеквизитовНаСервере();
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеРеквизитовНаСервере()
	
	ОписаниеОперации = ОписаниеОперацииПоКонтекстуФормы();
	
	ОшибкиЗаполнения = МодульОбъекта().ПроверитьЗаполнениеОперации(ОписаниеОперации);
	
	МодульОбъекта().СообщитьОбОшибкахЗаполнения(ЭтаФорма, ОшибкиЗаполнения);
	
	Возврат Не ЗначениеЗаполнено(ОшибкиЗаполнения);
	
КонецФункции

&НаКлиенте
Функция ПроверитьКоличествоКодов()
	
	ЕстьОшибки = Ложь;
	
	Если КоличествоКодов = 0 Тогда
		МодульКлиента().СообщитьПользователюЛок(НСтр("ru = 'Необходимо заполнить операцию кодами.'"), УникальныйИдентификатор);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Функция ПроверитьОбязательныеРеквизитыУведомленияОПриемке(ЭтоЧастичнаяПриемка = Ложь)
	
	ТипыИсходныхОтгрузок = МодульКлиента().Перечисление_ТипыИсходныхОтгрузок();
	
	Если ТипИсходнойОтгрузки = ТипыИсходныхОтгрузок.ТрансграничнаяОтгрузкаОСУ Тогда
		Результат = ПроверитьОбязательныеРеквизитыУведомленияОПриемкеОСУ(ЭтоЧастичнаяПриемка);
	Иначе
		Результат = ПроверитьОбязательныеРеквизитыУведомленияОПриемкеПУ(ЭтоЧастичнаяПриемка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПроверитьОбязательныеРеквизитыУведомленияОПриемкеПУ(ЭтоЧастичнаяПриемка = Ложь, СтрокиДерева = Неопределено)
	
	Если СтрокиДерева = Неопределено Тогда
		СтрокиДерева = СведенияОТоварах.ПолучитьЭлементы();
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	Для Каждого Стр Из СтрокиДерева Цикл
		
		Если Не ЗначениеЗаполнено(Стр.Товар) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтатусТовараНаСверкеТребуетУказатьЦенуКодТНВЭД(Стр, ЭтоЧастичнаяПриемка) Тогда
			Если Не ЗначениеЗаполнено(Стр.КодТНВЭД) Тогда
				ШаблонОшибки = НСтр("ru = 'Необходимо указать код ТНВЭД для товара: %1'");
				ТекстОшибки = МодульКлиента().ПараметрыВСтроку(ШаблонОшибки, Стр.Товар);
				МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "СведенияОТоварах");
				ЕстьОшибки = Истина;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Стр.Цена) Тогда
				ШаблонОшибки = НСтр("ru = 'Необходимо указать цену для товара: %1'");
				ТекстОшибки = МодульКлиента().ПараметрыВСтроку(ШаблонОшибки, Стр.Товар);
				МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "СведенияОТоварах");
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ПроверитьОбязательныеРеквизитыУведомленияОПриемкеПУ(ЭтоЧастичнаяПриемка, Стр.ПолучитьЭлементы()) Тогда
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Функция ПроверитьОбязательныеРеквизитыУведомленияОПриемкеОСУ(ЭтоЧастичнаяПриемка = Ложь)
	
	СтатусыТовараНаСверке = МодульКлиента().Перечисление_СтатусыТовараНаСверке();
	
	ЕстьОшибки = Ложь;
	
	Для Каждого Стр Из СведенияОТоварах.ПолучитьЭлементы() Цикл
		
		Если Не ЗначениеЗаполнено(Стр.КодТНВЭД) Тогда
			ШаблонОшибки = НСтр("ru = 'Необходимо указать код ТНВЭД для товара: %1'");
			ТекстОшибки = МодульКлиента().ПараметрыВСтроку(ШаблонОшибки, Стр.Товар);
			МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор);
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.Цена) Тогда
			ШаблонОшибки = НСтр("ru = 'Необходимо указать цену для товара: %1'");
			ТекстОшибки = МодульКлиента().ПараметрыВСтроку(ШаблонОшибки, Стр.Товар);
			МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор);
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если Стр.ПеременныйВес И Не ЗначениеЗаполнено(Стр.Количество) Тогда
			ШаблонОшибки = НСтр("ru = 'Необходимо указать вес для товара: %1'");
			ТекстОшибки = МодульКлиента().ПараметрыВСтроку(ШаблонОшибки, Стр.Товар);
			МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор);
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Функция ПроверитьКоличествоКодовВиртуальныхАгрегатов(СтрокиАгрегатов)
	
	ДопустимоеКоличествоКодов = МодульОбъекта().ДопустимоеКоличествоКодовВКИТУ();
	
	Для Каждого Стр Из СтрокиАгрегатов Цикл
		
		ВложенныеСтроки = Стр.ПолучитьЭлементы();
		Если Не ЗначениеЗаполнено(ВложенныеСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоКодовВАгрегате = 0;
		Для каждого СтрВлож Из ВложенныеСтроки Цикл
			КоличествоКодовВАгрегате = КоличествоКодовВАгрегате + СтрВлож.КоличествоКодов;
		КонецЦикла;
		
		Если КоличествоКодовВАгрегате > ДопустимоеКоличествоКодов Тогда
			ТекстСообщения = НСтр("ru = 'В одном агрегате не может быть больше %1 кодов'");
			ТекстСообщения = МодульОбъекта().ПараметрыВСтроку(ТекстСообщения, ДопустимоеКоличествоКодов);
			МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
			Возврат Ложь;
		КонецЕсли;
		
		Если Не ПроверитьКоличествоКодовВиртуальныхАгрегатов(ВложенныеСтроки) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьДоступностьОперацииПоТарифу()
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОписаниеТарифа = МодульОбъекта().Тариф(Организация);
	
	Если ТипОперации = МодульОбъекта().Перечисление_ТипыОпераций().ЗаказКодов Тогда
		Результат = Не ЕстьОграничениеЗаказаКодов(ОписаниеТарифа);
	ИначеЕсли ТипОперации = МодульОбъекта().Перечисление_ТипыОпераций().ОтчетОНанесении Тогда
		Результат = Не ЕстьОграничениеОтчетаОНанесении(ОписаниеТарифа);
	Иначе
		Результат = МодульОбъекта().ОперацияДоступнаПоТарифу(ТипОперации, ОписаниеТарифа);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СпособВводаВОборотНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеСпособыВводаВОборот(ВидПродукции);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособВводаВОборотПриИзменении(Элемент)
	
	СпособВводаВОборотПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СпособВводаВОборотПриИзмененииНаСервере()
	
	ПерезаполнитьТаблицыОперации();
	УстановитьВидимостьПолей_ВводВОборот();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗакрытогоСегментаПриИзменении(Элемент)
	
	УстановитьВидимостьПолей_ВводВОборот();
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаВводаВОборотНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().Перечисление_ПричиныВводаВОборот();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ПричинаВводаВОборотПриИзмененииНаСервере()
	
	ПерезаполнитьТаблицыОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаВводаВОборотПриИзменении(Элемент)
	
	ПричинаВводаВОборотПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Операция_Выполнить(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьДоступностьОперацииПоТарифу() Тогда
		МодульКлиента().ОткрытьФормуОграниченияПоТарифу(ЭтаФорма, Организация, ТипОперации);
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	СтатусыОпераций = МодульКлиента().Перечисление_СтатусыОпераций();
	
	Если ТипОперации = ТипыОпераций.АгрегацияКодов Тогда
		
		Если ОсновнойСтатус <> СтатусыОпераций.СозданыАгрегаты Тогда
			Если Не СоздатьАгрегаты() Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ЗавершитьОперацию();
		
	ИначеЕсли ТипОперации = ТипыОпераций.ПечатьКодов Тогда
		
		ТекстВопроса = НСтр("ru = 'Операция печати будет удалена, напечатать этикетки повторно будет невозможно, продолжить?'");
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("УдалитьОперациюПечати_ПослеСогласия", ЭтаФорма);
		МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	ИначеЕсли ТипОперации = ТипыОпераций.ФормированиеКИГУ Тогда
		
		Если ОсновнойСтатус <> СтатусыОпераций.КИГУНаполнены Тогда
			СформироватьКИГУ();
		КонецЕсли;
		
		ЗавершитьОперацию();
		
	Иначе
		
		СохранитьИСоздатьЗадачу();
		
		МодульКлиента().ВыполнитьОбменПоОрганизации(ЭтаФорма, Организация, ДокументУчета);
		
		ЗаполнитьКонтекстФормыИУстановитьВидимость();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		Оповестить("КонтурМаркировка_КодыВДокументах_Изменен", ДокументУчета);
	КонецЕсли;
	
	Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
	
	Если ОсновнойСтатус <> СтатусыОпераций.Новый
		И ОсновнойСтатус <> СтатусыОпераций.ОшибкаОбработки Тогда
		ПровестиОпросПользователяИЗакрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОперациюПечати_ПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	УдалитьОперациюНаСервере();
	
	Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		Оповестить("КонтурМаркировка_КодыВДокументах_Изменен", ДокументУчета);
	КонецЕсли;
	
	ПровестиОпросПользователяИЗакрыть();
	
КонецПроцедуры

&НаСервере
Функция СформироватьВсеЭтикетки(ДоступнаПечатьШтрихкодовНаКлиенте)
	
	Этикетки.Очистить();
	
	Если Модифицированность Тогда
		СохранитьОперацию();
	КонецЕсли;
	
	ПараметрыПечати = МодульОбъекта().Этикетки_ПараметрыПечатиЭтикетокПоОперации(Ссылка);
	ПараметрыПечати.ЗаполнитьКартинкиШтрихкодовНаСервере = Не ДоступнаПечатьШтрихкодовНаКлиенте;
	ПараметрыПечати.ИспользоватьКодыОперации = Истина;
	ПараметрыПечати.ПечататьВложенныеКоды = Истина;
	ПараметрыПечати.ТабличныйДокумент = Этикетки;
	
	МодульОбъекта().Этикетки_СформироватьТаблицуЭтикеток(ПараметрыПечати);
	МодульОбъекта().Операция_ПечатьКодов_СформироватьЭтикетки(Ссылка, ПараметрыПечати);
	
	ЗаполнитьРазмерЭтикетки(); // Если шаблоны этикеток заполнили в ПМ
	
	ПараметрыКартинок = Неопределено;
	Если Не ПараметрыПечати.ЗаполнитьКартинкиШтрихкодовНаСервере Тогда
		ПараметрыКартинок = МодульОбъекта().Этикетки_ПараметрыЗаполненияКартинокШтрихкодовНаКлиенте(ПараметрыПечати);
	КонецЕсли;
	
	Возврат ПараметрыКартинок;
	
КонецФункции

&НаСервере
Функция СформироватьПорциюЭтикеток(АдресПараметровПечати, НомерПорции)
	
	Этикетки.Очистить();
	
	ПараметрыПечати = ПолучитьИзВременногоХранилища(АдресПараметровПечати);
	ТаблицаЭтикеток = ПолучитьИзВременногоХранилища(ПараметрыПечати.ТаблицаЭтикеток);
	
	ПараметрыПечатиПорции = МодульОбъекта().Новый_ПараметрыПечатиЭтикеток();
	ПараметрыПечатиПорции.ТабличныйДокумент = Этикетки;
	ЗаполнитьЗначенияСвойств(ПараметрыПечатиПорции, ПараметрыПечати, , "ТаблицаЭтикеток, ТабличныйДокумент");
	ЗаполнитьВПорцииТаблицуЭтикеток(ПараметрыПечатиПорции, НомерПорции, ТаблицаЭтикеток);
	
	Если Не ЗначениеЗаполнено(ПараметрыПечатиПорции.ТаблицаЭтикеток) Тогда
		УдалитьИзВременногоХранилища(АдресПараметровПечати);
		УдалитьИзВременногоХранилища(ПараметрыПечати.ТаблицаЭтикеток);
		Возврат Неопределено;
	КонецЕсли;
	
	МодульОбъекта().Операция_ПечатьКодов_СформироватьЭтикетки(Ссылка, ПараметрыПечатиПорции);
	
	ЗаполнитьЗначенияСвойств(ПараметрыПечати, ПараметрыПечатиПорции, , "ТаблицаЭтикеток, ТабличныйДокумент");
	ПоместитьВоВременноеХранилище(ПараметрыПечати, АдресПараметровПечати);
	
	ЗаполнитьРазмерЭтикетки(); // Если шаблоны этикеток заполнили в ПМ
	
	ПараметрыКартинок = Неопределено;
	Если Не ПараметрыПечати.ЗаполнитьКартинкиШтрихкодовНаСервере Тогда
		ПараметрыКартинок = МодульОбъекта().Этикетки_ПараметрыЗаполненияКартинокШтрихкодовНаКлиенте(ПараметрыПечатиПорции);
	КонецЕсли;
	
	Возврат ПараметрыКартинок;
	
КонецФункции

&НаСервере
Функция СформироватьПервуюПорциюЭтикеток(АдресПараметровПечати)
	
	НомерПорции = 1;
	
	Этикетки.Очистить();
	
	ПараметрыПечати = ПолучитьИзВременногоХранилища(АдресПараметровПечати);
	ТаблицаЭтикеток = ПолучитьИзВременногоХранилища(ПараметрыПечати.ТаблицаЭтикеток);
	
	УдалитьИзВременногоХранилища(АдресПараметровПечати);
	УдалитьИзВременногоХранилища(ПараметрыПечати.ТаблицаЭтикеток);
	
	ПараметрыПечати.ТабличныйДокумент = Этикетки;
	ПараметрыПечати.ТаблицаЭтикеток = ТаблицаЭтикеток;
	
	МодульОбъекта().Операция_ПечатьКодов_СформироватьЭтикетки(Ссылка, ПараметрыПечати);
	
	ЗаполнитьРазмерЭтикетки(); // Если шаблоны этикеток заполнили в ПМ
	
	ПараметрыКартинок = Неопределено;
	Если Не ПараметрыПечати.ЗаполнитьКартинкиШтрихкодовНаСервере Тогда
		ПараметрыКартинок = МодульОбъекта().Этикетки_ПараметрыЗаполненияКартинокШтрихкодовНаКлиенте(ПараметрыПечати);
	КонецЕсли;
	
	Возврат ПараметрыКартинок;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВПорцииТаблицуЭтикеток(ПараметрыПечатиПорции, НомерПорции, ОбщаяТаблицаЭтикеток)
	
	РазмерПорции = ПараметрыПечатиПорции.РазмерПорции;
	НомерПоследЭтикетки = ПараметрыПечатиПорции.НомерПоследнейНапечатаннойЭтикетки;
	ВсегоЭтикеток = ОбщаяТаблицаЭтикеток.Количество();
	
	ИндексПоследЭтикетки = -1;
	Если ЗначениеЗаполнено(НомерПоследЭтикетки) Тогда
		ИндексПоследЭтикетки = ОбщаяТаблицаЭтикеток.Индекс(ОбщаяТаблицаЭтикеток.Найти(НомерПоследЭтикетки, "НомерЭтикеткиПоПорядку"));
	КонецЕсли;
	
	ВыбраноЭтикеток = 0;
	Для Сч = ИндексПоследЭтикетки + 1 По ВсегоЭтикеток - 1 Цикл
		
		Стр = ОбщаяТаблицаЭтикеток[Сч];
		
		ЗаполнитьЗначенияСвойств(ПараметрыПечатиПорции.ТаблицаЭтикеток.Добавить(), Стр);
		
		ПараметрыПечатиПорции.НомерПоследнейНапечатаннойЭтикетки = Стр.НомерЭтикеткиПоПорядку;
		
		ВыбраноЭтикеток = ВыбраноЭтикеток + 1;
		Если ВыбраноЭтикеток = РазмерПорции Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПечатиЭтикетокПорциями(ДоступнаПечатьШтрихкодовНаКлиенте, ТолькоПервуюПорцию = Ложь)
	
	Если Модифицированность Тогда
		СохранитьОперацию();
	КонецЕсли;
	
	РазмерПорции = МодульОбъекта().НастройкиМодуля().КоличествоЭтикетокВОднойПорцииПоУмолчанию;
	
	ПараметрыПечати = МодульОбъекта().Этикетки_ПараметрыПечатиЭтикетокПоОперации(Ссылка);
	ПараметрыПечати.ЗаполнитьКартинкиШтрихкодовНаСервере = Не ДоступнаПечатьШтрихкодовНаКлиенте;
	ПараметрыПечати.РазмерПорции = РазмерПорции;
	ПараметрыПечати.ПечататьВложенныеКоды = Истина;
	ПараметрыПечати.ИспользоватьКодыОперации = Истина;
	
	Если ТолькоПервуюПорцию Тогда
		ПараметрыПечати.КоличествоЭтикеток = РазмерПорции;
	КонецЕсли;
	
	МодульОбъекта().Этикетки_СформироватьТаблицуЭтикеток(ПараметрыПечати);
	КоличествоЭтикеток = ПараметрыПечати.ТаблицаЭтикеток.Количество();
	
	ПараметрыПечати.ТаблицаЭтикеток = ПоместитьВоВременноеХранилище(ПараметрыПечати.ТаблицаЭтикеток, УникальныйИдентификатор);
	
	Результат = Новый Структура;
	Результат.Вставить("РазмерПорции", РазмерПорции);
	Результат.Вставить("КоличествоЭтикеток", КоличествоЭтикеток);
	Результат.Вставить("АдресПараметровПечати", ПоместитьВоВременноеХранилище(ПараметрыПечати, УникальныйИдентификатор));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Обмен_ПовторитьСМоментаОшибки(Команда)
	
	МодульКлиента().Операция_ВосстановитьОбменСМоментаОшибки(Ссылка);
	
	МодульКлиента().ВыполнитьОбменПоОрганизации(ЭтаФорма, Организация, ДокументУчета);
	
	ЗаполнитьКонтекстФормыИУстановитьВидимость();
	
	Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура Обмен_ПовторитьОтправкуСначала(Команда)
	
	Если Не ПроверитьЗаполнениеРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'При повторной отправке в случае необходимости в сервисе будет создана новая операция. Продолжить?'");
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Обмен_ПовторитьОтправкуСначалаПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура Обмен_ПовторитьОтправкуСначалаПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Повторно = Истина;
	СохранитьИСоздатьЗадачу(Повторно);
	
	МодульКлиента().ВыполнитьОбменПоОрганизации(ЭтаФорма, Организация, ДокументУчета);
	ЗаполнитьКонтекстФормыИУстановитьВидимость();
	
	Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура Товар_ПодобратьКоды(Команда)
	
	ПодобратьКодыДляАгрегации();
	
КонецПроцедуры

&НаСервере
Функция Товары_ЕстьВетеринарныйКонтроль()
	
	Отбор = Новый Структура("ПодлежитВетеринарномуКонтролю", Истина);
	Возврат ЗначениеЗаполнено(Товары.НайтиСтроки(Отбор));
	
КонецФункции

&НаСервере
Функция Товары_ТребуютсяЗаводскиеСерийныеНомера()
	
	Отбор = Новый Структура("ТребуетсяЗСН", Истина);
	Возврат ЗначениеЗаполнено(Товары.НайтиСтроки(Отбор));
	
КонецФункции

&НаСервере
Функция Товары_ЕстьКлючиНоменклатуры1С(Товары) Экспорт
	
	Отбор = Новый Структура("КлючНоменклатуры1С", МодульОбъекта().ПустойКлючНоменклатуры1С());
	Возврат Товары.Количество() > Товары.НайтиСтроки(Отбор).Количество();
	
КонецФункции

&НаКлиенте
Функция Товары_ЕстьПеременныйВес()
	
	Отбор = Новый Структура("ПеременныйВес", Истина);
	Возврат ЗначениеЗаполнено(Товары.НайтиСтроки(Отбор));
	
КонецФункции

&НаКлиенте
Процедура ПодобратьКодыДляКИГУ(Команда)
	
	ПодобратьКодыДляАгрегации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьДоступныеКоды(Команда)
	
	ПодобратьКодыДляАгрегации();
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьКодыДляАгрегации()
	
	ОписаниеОперации = ОписаниеОперацииПоКонтекстуФормы();
	
	Если Модифицированность Тогда
		СохранитьОперацию(ОписаниеОперации);
	КонецЕсли;
	
	МодульОбъекта().Операция_ЗаполнитьКодами(ОписаниеОперации);
	
	ПосчитатьКоличествоСтрокТаблицФормы();
	ЗаполнитьКоличествоКодовВТоварах();
	
	ОбновитьРаспределенноеКоличествоУпаковок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоКодовВТоварах()
	
	ТаблицаКоличества = МодульОбъекта().КодыОпераций_КоличествоКодов(Ссылка);
	
	Отбор = Новый Структура("КлючСтрокиОперации");
	
	Для каждого СтрКоличества Из ТаблицаКоличества Цикл
		
		Отбор.КлючСтрокиОперации = СтрКоличества.КлючСтрокиОперации;
		
		СтрокиТоваров = Товары.НайтиСтроки(Отбор);
		Если Не ЗначениеЗаполнено(СтрокиТоваров) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрТовара = СтрокиТоваров[0];
		
		Если ЗначениеЗаполнено(СтрТовара.ВложенныйТовар)
			И СтрТовара.ВложенныйТовар = СтрКоличества.Товар Тогда
			СтрТовара.КоличествоКодовВложенногоТовара = СтрКоличества.КоличествоКодов;
		Иначе
			СтрТовара.КоличествоКодов = СтрКоличества.КоличествоКодов;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.КодыМаркировкиОперация Тогда
		ОткрытьФормуПодчиненнойОперацииНаУровнеСтроки(Элемент, ВыбраннаяСтрока);
	КонецЕсли;
	
	Если Поле = Элементы.КодыМаркировкиКодМаркировки Тогда
		ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
		Если ЗначениеЗаполнено(ДанныеСтроки.КлючКода) Тогда
			МодульКлиента().ОткрытьФормуКодаМаркировки(ДанныеСтроки.КлючКода, Организация, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыПакетаАгрегатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.АгрегатыВПакетеКодМаркировки Тогда
		ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
		Если ЗначениеЗаполнено(ДанныеСтроки.КлючКода) Тогда
			МодульКлиента().ОткрытьФормуКодаМаркировки(ДанныеСтроки.КлючКода, Организация, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	ТекЭлемент = Элемент.ТекущийЭлемент;
	ЭтоАгрегат = ЗначениеЗаполнено(ТекДанные.ВидАгрегата);
	
	Если ЭтоАгрегат Тогда
		Если ТекЭлемент = Элементы.АгрегатыКоличествоКодов Тогда
			Отказ = Истина; // Нельзя изменять количество упаковок на уровне агрегатов
		КонецЕсли;
	Иначе
		Если ТекЭлемент = Элементы.АгрегатыКоличествоАгрегатов Тогда
			Отказ = Истина; // Нельзя изменять количество агрегатов на уровне товаров
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыПослеУдаления(Элемент)
	
	ОбновитьРаспределенноеКоличествоУпаковок();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварВАгрегат(Команда)
	
	Поле = ЭтаФорма.Элементы.Агрегаты.ТекущийЭлемент;
	СтрокаПриемник = ЭтаФорма.Элементы.Агрегаты.ТекущаяСтрока;
	СтрокаИсточник = ЭтаФорма.Элементы.ТоварыАгрегатов.ТекущиеДанные;
	
	Если СтрокаПриемник = Неопределено
		Или СтрокаИсточник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Истина;
	Элемент = ЭтаФорма.Элементы.Агрегаты;
	
	ПараметрыПеретаскивания = Новый Структура;
	ПараметрыПеретаскивания.Вставить("Действие");
	ПараметрыПеретаскивания.Вставить("Значение", Новый Массив);
	ПараметрыПеретаскивания.Значение.Добавить(СтрокаИсточник);
	
	АгрегатыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, СтрокаПриемник, Поле);
	
	Если ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	АгрегатыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, СтрокаПриемник, Поле)
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПеремещения = ПараметрыПеретаскиванияВУпаковку(ПараметрыПеретаскивания, Строка, Поле);
	
	Если Не ПараметрыПеремещения.ИсточникИзТоваров
		И Не ПараметрыПеремещения.ИсточникИзУпаковок Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		// Источник должен быть из товаров или упаковок
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПеремещения.ПриемникЭтоТовар Тогда
		// Нельзя перетаскивать строки в товар
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПеремещения.ИсточникЭтоТовар
		И Не ПараметрыПеремещения.ЕстьПриемник Тогда
		// Товар можно перетаскивать только в агрегат
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПеремещения.ИсточникЭтоАгрегат
		И ПараметрыПеремещения.ИсточникЭтоТоварАгрегата Тогда
		// Перемещать одновременно агрегат и товар нельзя
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПеремещения.ПриемникСодержитИсточник Тогда
		// Агрегат не может быть перенесен сам в себя
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПеремещения.ИсточникЭтоТовар
		И ПараметрыПеремещения.ПриемникСодержитАгрегаты Тогда
		// Товар можно перетаскивать только в агрегат самого нижнего уровня
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПеремещения.ПриемникЭтоРодительИсточника Тогда
		// Нет смысла перетаскивать строку в тот же агрегат
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПеремещения.ИсточникЭтоАгрегат
		И ПараметрыПеремещения.ПриемникСодержитТовары Тогда
		// Нельзя добавлять агрегат в коробку с товарами
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПеремещения = ПараметрыПеретаскиванияВУпаковку(ПараметрыПеретаскивания, Строка, Поле);
	Приемник = ПараметрыПеремещения.Приемник;
	
	Если ПараметрыПеремещения.ИсточникИзТоваров Тогда
		Для Каждого Источник Из ПараметрыПеремещения.Источники Цикл
			ДобавитьСтрокуТовараВАгрегат(Источник, Приемник);
		КонецЦикла;
	КонецЕсли;
	
	Если ПараметрыПеремещения.ИсточникИзУпаковок Тогда
		Для Каждого Стр Из ПараметрыПеремещения.Источники Цикл
			Источник = Агрегаты.НайтиПоИдентификатору(Стр);
			НоваяСтрока = ПереместитьСтрокуДерева(Агрегаты, Источник, Приемник);
			Элементы.Агрегаты.Развернуть(НоваяСтрока.ПолучитьИдентификатор(), Истина);
		КонецЦикла;
	КонецЕсли;
	
	Если Строка <> Неопределено Тогда
		Элементы.Агрегаты.Развернуть(Строка, Истина);
	КонецЕсли;
	
	ОбновитьРаспределенноеКоличествоУпаковок();
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыПеретаскиванияВУпаковку(ПараметрыПеретаскивания, СтрокаПриемник, Поле)
	
	ИсточникЭтоТовар = Ложь;
	ИсточникИзТоваров = Ложь;
	ИсточникИзУпаковок = Ложь;
	ИсточникЭтоАгрегат = Ложь;
	ИсточникЭтоТоварАгрегата = Ложь;
	ПриемникЭтоТовар = Ложь;
	ПриемникЭтоРодительИсточника = Ложь;
	ПриемникСодержитТовары = Ложь;
	ПриемникСодержитАгрегаты = Ложь;
	ПриемникСодержитИсточник = Ложь;
	ЕстьПриемник = Ложь;
	Приемник = Неопределено;
	
	Источники = МодульКлиента().ЗначениеВМассиве(ПараметрыПеретаскивания.Значение);
	ПерваяСтрока = Источники[0];
	ТипИсточника = ТипЗнч(ПерваяСтрока);
	
	Если ТипИсточника = Тип("ДанныеФормыЭлементКоллекции") Тогда
		ИсточникИзТоваров = Товары.Индекс(ПерваяСтрока) > -1;
	КонецЕсли;
	Если ТипИсточника = Тип("Число") Тогда
		ИсточникИзУпаковок = Агрегаты.НайтиПоИдентификатору(ПерваяСтрока) <> Неопределено;
	КонецЕсли;
	
	Если ИсточникИзУпаковок Тогда
		Для Каждого Стр Из Источники Цикл
			Источник = Агрегаты.НайтиПоИдентификатору(Стр);
			Если ЗначениеЗаполнено(Источник.ВидАгрегата) Тогда
				ИсточникЭтоАгрегат = Истина;
			Иначе
				ИсточникЭтоТоварАгрегата = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СтрокаПриемник <> Неопределено Тогда
		
		ЕстьПриемник = Истина;
		Приемник = Агрегаты.НайтиПоИдентификатору(СтрокаПриемник);
		ПриемникЭтоТовар = Не ЗначениеЗаполнено(Приемник.ВидАгрегата);
		
		ВложенныеСтроки = Приемник.ПолучитьЭлементы();
		Если ЗначениеЗаполнено(ВложенныеСтроки) Тогда
			Для каждого Стр Из ВложенныеСтроки Цикл
				Если ЗначениеЗаполнено(Стр.ВидАгрегата) Тогда
					ПриемникСодержитАгрегаты = Истина;
				Иначе
					ПриемникСодержитТовары = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ИсточникИзУпаковок Тогда
			
			Для каждого Стр Из Источники Цикл
				Источник = Агрегаты.НайтиПоИдентификатору(Стр);
				РодительИсточника = Источник.ПолучитьРодителя();
				Если Приемник = РодительИсточника Тогда
					ПриемникЭтоРодительИсточника = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Для каждого Стр Из Источники Цикл
				Источник = Агрегаты.НайтиПоИдентификатору(Стр);
				Если СтрокаДереваСодержитСтроку(Источник, Приемник) Тогда
					ПриемникСодержитИсточник = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИсточникЭтоТовар = ИсточникИзТоваров Или (ИсточникИзУпаковок И ИсточникЭтоТоварАгрегата);
	
	Результат = Новый Структура;
	Результат.Вставить("Источники", Источники);
	Результат.Вставить("ИсточникЭтоТовар", ИсточникЭтоТовар);
	Результат.Вставить("ИсточникИзТоваров", ИсточникИзТоваров);
	Результат.Вставить("ИсточникИзУпаковок", ИсточникИзУпаковок);
	Результат.Вставить("ИсточникЭтоАгрегат", ИсточникЭтоАгрегат);
	Результат.Вставить("ИсточникЭтоТоварАгрегата", ИсточникЭтоТоварАгрегата);
	Результат.Вставить("ЕстьПриемник", ЕстьПриемник);
	Результат.Вставить("Приемник", Приемник);
	Результат.Вставить("ПриемникЭтоТовар", ПриемникЭтоТовар);
	Результат.Вставить("ПриемникСодержитТовары", ПриемникСодержитТовары);
	Результат.Вставить("ПриемникСодержитАгрегаты", ПриемникСодержитАгрегаты);
	Результат.Вставить("ПриемникСодержитИсточник", ПриемникСодержитИсточник);
	Результат.Вставить("ПриемникЭтоРодительИсточника", ПриемникЭтоРодительИсточника);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьСтрокуТовараВАгрегат(СтрокаТовара, СтрокаАгрегата)
	
	Если ЗначениеЗаполнено(СтрокаТовара.КоличествоКодов) Тогда
		ДоступноеКоличествоКодов = (СтрокаТовара.КоличествоКодов - СтрокаТовара.КоличествоКодовРаспределено);
	Иначе
		ДоступноеКоличествоКодов = (СтрокаТовара.КоличествоУпаковок - СтрокаТовара.КоличествоКодовРаспределено);
	КонецЕсли;
	
	ОбщееКоличествоАгрегатов = ОбщееКоличествоАгрегатовПоСтрокеАгрегата(СтрокаАгрегата);
	
	Стр = СтрокаАгрегата.ПолучитьЭлементы().Добавить();
	Стр.Товар = СтрокаТовара.Товар;
	Стр.КлючНоменклатуры1С = СтрокаТовара.КлючНоменклатуры1С;
	Стр.КлючСтрокиДокумента = СтрокаТовара.КлючСтрокиДокумента;
	
	Если ДоступноеКоличествоКодов > 0 И ОбщееКоличествоАгрегатов > 0 Тогда
		Стр.КоличествоКодов = Цел(ДоступноеКоличествоКодов / ОбщееКоличествоАгрегатов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПереместитьСтрокуДерева(Дерево, СтрокаИсточник, СтрокаПриемник)
	
	Если СтрокаПриемник = Неопределено Тогда
		НоваяСтрока = Дерево.ПолучитьЭлементы().Добавить();
	Иначе
		НоваяСтрока = СтрокаПриемник.ПолучитьЭлементы().Добавить();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);
	
	ПодчиненныеСтроки = СтрокаИсточник.ПолучитьЭлементы();
	Для Сч = -(ПодчиненныеСтроки.Количество()-1) По 0 Цикл
		ПереместитьСтрокуДерева(Дерево, ПодчиненныеСтроки[-Сч], НоваяСтрока);
	КонецЦикла;
	
	Родитель = СтрокаИсточник.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		Дерево.ПолучитьЭлементы().Удалить(СтрокаИсточник);
	Иначе
		Родитель.ПолучитьЭлементы().Удалить(СтрокаИсточник);
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Функция ОбщееКоличествоАгрегатовПоСтрокеАгрегата(СтрокаАгрегата)
	
	Результат = СтрокаАгрегата.КоличествоАгрегатов;
	Родитель = СтрокаАгрегата.ПолучитьРодителя();
	
	Пока Родитель <> Неопределено Цикл
		Результат = Результат * Родитель.КоличествоАгрегатов;
		Родитель = Родитель.ПолучитьРодителя();
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтрокаДереваСодержитСтроку(СтрокаДерева1, Знач СтрокаДерева2)
	
	Пока СтрокаДерева2 <> Неопределено Цикл
		Если СтрокаДерева1 = СтрокаДерева2 Тогда
			Возврат Истина;
		КонецЕсли;
		СтрокаДерева2 = СтрокаДерева2.ПолучитьРодителя();
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОбновитьРаспределенноеКоличествоУпаковок()
	
	РаспределеноКодов = КоличествоКодовВАгрегатах();
	
	Для Каждого Стр Из Товары Цикл
		Стр.КоличествоКодовРаспределено = МодульОбъекта().ЗначениеСоответствия(РаспределеноКодов, КлючТовара(Стр), 0);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция КоличествоКодовВАгрегатах(Мультипликатор = 1, СтрокиДерева = Неопределено, Результат = Неопределено)
	
	Если СтрокиДерева = Неопределено Тогда
		СтрокиДерева = Агрегаты.ПолучитьЭлементы();
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Результат = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого Стр Из СтрокиДерева Цикл
		ВложенныеСтроки = Стр.ПолучитьЭлементы();
		Если ЗначениеЗаполнено(ВложенныеСтроки) Тогда
			КоличествоКодовВАгрегатах(Мультипликатор * Стр.КоличествоАгрегатов, ВложенныеСтроки, Результат);
		Иначе
			КлючТоваров = КлючТовара(Стр);
			Результат[КлючТоваров] = Стр.КоличествоКодов * Мультипликатор
			+ МодульОбъекта().ЗначениеСоответствия(Результат, КлючТоваров, 0);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТребуетсяКодовДляНовыхТранспортныхУпаковок(Результат = Неопределено, СтрокиДерева = Неопределено)
	
	Если СтрокиДерева = Неопределено Тогда
		СтрокиДерева = Агрегаты.ПолучитьЭлементы();
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Результат = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого Стр Из СтрокиДерева Цикл
		Если ЗначениеЗаполнено(Стр.ВидАгрегата) Тогда
			ТребуетсяКодов = МодульОбъекта().ЗначениеСоответствия(Результат, Стр.ВидАгрегата, 0) + Стр.КоличествоАгрегатов;
			Результат.Вставить(Стр.ВидАгрегата, ТребуетсяКодов);
		КонецЕсли;
		ТребуетсяКодовДляНовыхТранспортныхУпаковок(Результат, Стр.ПолучитьЭлементы());
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция КлючТовара(Стр)
	
	Возврат Строка(Стр.КлючСтрокиДокумента) + Строка(Стр.КлючНоменклатуры1С.УникальныйИдентификатор()) + ", " + Строка(Стр.Товар.УникальныйИдентификатор());
	
КонецФункции

&НаКлиенте
Процедура АгрегатыКоличествоКодовПриИзменении(Элемент)
	
	ОбновитьРаспределенноеКоличествоУпаковок();
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыКоличествоАгрегатовПриИзменении(Элемент)
	
	ОбновитьРаспределенноеКоличествоУпаковок();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеСерийныхНомеровДляНовыхАгрегатов()
	
	ШаблонОшибки = НСтр("ru = 'Для агрегата ""%1"" недостаточно новых серийных номеров, требуется %2, доступно %3'");
	
	Результат = Истина;
	
	Для каждого Эл Из ТребуетсяКодовДляНовыхТранспортныхУпаковок() Цикл
		
		ТекВидАгрегата = Эл.Ключ;
		ТекКоличествоКодовТребуется = Эл.Значение;
		ТекКоличествоКодовДоступно = МодульОбъекта().КоличествоДоступныхСерийныхНомеров(ТекВидАгрегата);
		
		Если ТекКоличествоКодовТребуется > ТекКоличествоКодовДоступно Тогда
			
			ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки
			, ТекВидАгрегата
			, ТекКоличествоКодовТребуется
			, ТекКоличествоКодовДоступно);
			
			МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор);
			
			Результат = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СозданиеАгрегатов_ЕстьОшибки()
	
	ЕстьОшибки = Ложь;
	
	Для каждого Стр Из Товары Цикл
		
		Если ЗначениеЗаполнено(Стр.КоличествоКодовРаспределено) Тогда
			Если Не ЗначениеЗаполнено(Стр.КоличествоКодов) Тогда
				МодульОбъекта().СообщитьОбОшибкеВСтрокеТабЧасти(
				НСтр("ru = 'Нет доступных кодов для распределения'")
				, УникальныйИдентификатор, Элементы.Товары
				, "КоличествоКодов", Товары.Индекс(Стр));
				ЕстьОшибки = Истина;
			ИначеЕсли Стр.КоличествоКодов < Стр.КоличествоКодовРаспределено Тогда
				МодульОбъекта().СообщитьОбОшибкеВСтрокеТабЧасти(
				НСтр("ru = 'Распределено кодов больше чем доступно'")
				, УникальныйИдентификатор, Элементы.Товары
				, "КоличествоКодовРаспределено", Товары.Индекс(Стр));
				ЕстьОшибки = Истина;
			Иначе
				// Распределено достаточное количество кодов
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.КоличествоКодов)
			И Не ЗначениеЗаполнено(Стр.КоличествоКодовРаспределено) Тогда
			МодульОбъекта().СообщитьОбОшибкеВСтрокеТабЧасти(
			НСтр("ru = 'Не распределено ни одного кода'")
			, УникальныйИдентификатор, Элементы.Товары
			, "КоличествоКодовРаспределено", Товары.Индекс(Стр));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПроверитьКоличествоКодовВиртуальныхАгрегатов(Агрегаты.ПолучитьЭлементы()) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура Операция_Удалить(Команда)
	
	УдалитьОперациюНаСервере();
	
	Модифицированность = Ложь;
	
	Закрыть();
	
	Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура Операция_ОткрытьВСервисе(Команда)
	
	МодульКлиента().ОткрытьОперациюВСервисе(ТипОперации, ИдентификаторДокумента);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОперациюНаСервере()
	
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	
	Попытка
		
		ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
		ТребуемыеДействия = МодульОбъекта().Перечисление_ТребуемыеДействияДокументовУчета();
		СтатусыДокументовУчета = МодульОбъекта().Перечисление_СтатусыДокументовУчета();
		
		МодульОбъекта().Операции_Удалить(Ссылка);
		
		Если ТипОперации = ТипыОпераций.ПодборТоваровИКодовНаТСД Тогда
			СтатусыДокумента = МодульОбъекта().ДокументУчета_Статусы(ДокументУчета);
			СтатусыДокумента.ОсновнойСтатус = СтатусыДокументовУчета.Новый;
			СтатусыДокумента.ТребуемоеДействие = ТребуемыеДействия.НачатьРаботу;
			МодульОбъекта().СтатусыДокументаУчета_Записать(ДокументУчета, СтатусыДокумента);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Напечатать(Команда)
	
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	СтатусыОпераций = МодульКлиента().Перечисление_СтатусыОпераций();
	
	Если ТипОперации = ТипыОпераций.АгрегацияКодов
		И ОсновнойСтатус = СтатусыОпераций.Новый Тогда
		Если Не СоздатьАгрегаты() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипОперации = ТипыОпераций.АгрегацияКодов Тогда
		ОперацияПечати = МодульКлиента().Операция_СоздатьИЗаполнитьОперациюПечати(ДокументУчета, Ссылка);
	Иначе
		ОперацияПечати = МодульКлиента().Операция_Создать(ТипыОпераций.ПечатьКодов, ДокументУчета, Ссылка);
	КонецЕсли;
	
	Если ТипОперации = ТипыОпераций.АгрегацияКодов Тогда
		ЗавершитьОперацию();
		Если ЗначениеЗаполнено(ДокументУчета) Тогда
			Оповестить("КонтурМаркировка_КодыВДокументах_Изменен", ДокументУчета);
		КонецЕсли;
		Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОперации(ОперацияПечати, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЭтикетки(Команда)
	
	Если Не ПроверитьЗаполнениеРеквизитов()
		Или Не ПроверитьКоличествоКодов() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКартинок = СформироватьВсеЭтикетки(МодульКлиента().ДоступнаПечатьШтрихкодовНаКлиенте());
	МодульКлиента().Этикетки_ЗаполнитьКартинкиШтрихкодов(Этикетки, ПараметрыКартинок);
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Этикетки;
	
	Если ОсновнойСтатус = МодульКлиента().Перечисление_СтатусыОпераций().Новый Тогда
		
		ПараметрыПечатиДляМетрики = ОписаниеПараметровПечатиДляМетрики();
		МодульКлиента().Метрики_ПечатьЭтикетокСЗаполненнымиПараметрами(ПараметрыПечатиДляМетрики, Организация);
		Если ПечатьИзСвободногоОстатка Тогда
			МодульКлиента().Метрика_Функциональность_ПечатьКодовИзСвободногоОстатка(Организация);
		КонецЕсли;
		
		УстановитьСтатусКодыНапечатаны();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПервуюПорциюЭтикеток(Команда)
	
	Если Не ПроверитьЗаполнениеРеквизитов()
		Или Не ПроверитьКоличествоКодов() Тогда
		Возврат;
	КонецЕсли;
	
	ТолькоПервуюПорцию = Истина;
	ПараметрыПечати = ПараметрыПечатиЭтикетокПорциями(МодульКлиента().ДоступнаПечатьШтрихкодовНаКлиенте(), ТолькоПервуюПорцию);
	ПараметрыКартинок = СформироватьПервуюПорциюЭтикеток(ПараметрыПечати.АдресПараметровПечати);
	МодульКлиента().Этикетки_ЗаполнитьКартинкиШтрихкодов(Этикетки, ПараметрыКартинок);
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Этикетки;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЭтикеткиПорциями(Команда)
	
	Если Не ПроверитьЗаполнениеРеквизитов()
		Или Не ПроверитьКоличествоКодов() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПечати = ПараметрыПечатиЭтикетокПорциями(МодульКлиента().ДоступнаПечатьШтрихкодовНаКлиенте());
	
	НомерПорции = 0;
	ЕстьЭтикетки = Истина;
	
	Пока ЕстьЭтикетки Цикл
		
		НомерПорции = НомерПорции + 1;
		ПараметрыЗаполненияКартинок = СформироватьПорциюЭтикеток(ПараметрыПечати.АдресПараметровПечати, НомерПорции);
		МодульКлиента().Этикетки_ЗаполнитьКартинкиШтрихкодов(Этикетки, ПараметрыЗаполненияКартинок);
		
		ЕстьЭтикетки = (Этикетки.ВысотаТаблицы > 0);
		
		Если ЕстьЭтикетки Тогда
			Этикетки.Напечатать();
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Этикетки;
	
	Если ОсновнойСтатус = МодульКлиента().Перечисление_СтатусыОпераций().Новый Тогда
		
		ПараметрыПечатиДляМетрики = ОписаниеПараметровПечатиДляМетрики();
		МодульКлиента().Метрики_ПечатьЭтикетокСЗаполненнымиПараметрами(ПараметрыПечатиДляМетрики, Организация);
		Если ПечатьИзСвободногоОстатка Тогда
			МодульКлиента().Метрика_Функциональность_ПечатьКодовИзСвободногоОстатка(Организация);
		КонецЕсли;
		
		УстановитьСтатусКодыНапечатаны();
		
	КонецЕсли;
	
	МодульКлиента().СообщитьПользователюЛок(НСтр("ru = 'Этикетки успешно напечатаны'"), УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЭтикеткиПорциямиPDF(Команда)
	
	Если Не ПроверитьЗаполнениеРеквизитов()
		Или Не ПроверитьКоличествоКодов() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаголовокДиалога = НСтр("ru = 'Выберите каталог для сохранения файлов PDF'");
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("СохранитьЭтикеткиPDFПослеВыбораКаталога", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВыбораКаталога(ОписаниеОбработчика, ЗаголовокДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЭтикеткиPDFПослеВыбораКаталога(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	Действие = МодульКлиента().Перечисление_ДействияМетрики().Замер_СохранениеЭтикетокПорциямиВPDF;
	МодульКлиента().НачатьЗамерПроизводительности(Действие);
	
	КаталогДляСохранения = РезультатВыбора[0];
	ИмяФайлаДляСохранения = ИмяФайлаДляСохраненияЭтикеток();
	
	ПараметрыПечати = ПараметрыПечатиЭтикетокПорциями(МодульКлиента().ДоступнаПечатьШтрихкодовНаКлиенте());
	
	НомерПорции = 0;
	ЕстьЭтикетки = Истина;
	
	Пока ЕстьЭтикетки Цикл
		
		НомерПорции = НомерПорции + 1;
		ПараметрыКартинок = СформироватьПорциюЭтикеток(ПараметрыПечати.АдресПараметровПечати, НомерПорции);
		МодульКлиента().Этикетки_ЗаполнитьКартинкиШтрихкодов(Этикетки, ПараметрыКартинок);
		
		ЕстьЭтикетки = (Этикетки.ВысотаТаблицы > 0);
		
		Если ЕстьЭтикетки Тогда
			ИмяФайла = ИмяФайлаДляСохранения + "_" + Формат(НомерПорции, "ЧГ=" ) + ".pdf";
			ПутьКФайлу = МодульКлиента().ОбъединитьПути(КаталогДляСохранения, ИмяФайла);
			Этикетки.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.PDF);
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Этикетки;
	
	Если ОсновнойСтатус = МодульКлиента().Перечисление_СтатусыОпераций().Новый Тогда
		
		ПараметрыПечатиДляМетрики = ОписаниеПараметровПечатиДляМетрики();
		МодульКлиента().Метрики_ПечатьЭтикетокСЗаполненнымиПараметрами(ПараметрыПечатиДляМетрики, Организация);
		Если ПечатьИзСвободногоОстатка Тогда
			МодульКлиента().Метрика_Функциональность_ПечатьКодовИзСвободногоОстатка(Организация);
		КонецЕсли;
		
		УстановитьСтатусКодыНапечатаны();
		
	КонецЕсли;
	
	ТекстСообщения = МодульКлиента().ПараметрыВСтроку(
	НСтр("ru = 'Этикетки успешно выгружены в каталог %1'"), КаталогДляСохранения);
	МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РазмерПорции", ПараметрыПечати.РазмерПорции);
	ДопПараметры.Вставить("КоличествоЭтикеток", ПараметрыПечати.КоличествоЭтикеток);
	МодульКлиента().ЗавершитьЗамерПроизводительности(Действие, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиСортировкиЭтикеток(Команда)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения(
	"НастройкиСортировкиЭтикетокПослеРедактирования", ЭтаФорма);
	
	НастройкиСортировкиЭтикеток = МодульКлиента().Новый_ПараметрыСортировкиЭтикеток();
	ЗаполнитьЗначенияСвойств(НастройкиСортировкиЭтикеток, ЭтаФорма);
	
	МодульКлиента().ОткрытьНастройкиСортировкиЭтикеток(ЭтаФорма, НастройкиСортировкиЭтикеток, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСортировкиЭтикетокПослеРедактирования(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Результат);
	ОбновитьНадписьНастройкиСортировкиЭтикеток(Результат);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПосчитатьКоличествоСтрокТаблицФормы()
	
	КоличествоСтрокТовары = Товары.Количество();
	КоличествоСтрокКодыВходящегоУПД = КодыВходящегоУПД.ПолучитьЭлементы().Количество();
	КоличествоСтрокЛишниеКодыВходящегоУПД = ЛишниеКодыВходящегоУПД.Количество();
	КоличествоКодов = МодульОбъекта().КодыОпераций_ОбщееКоличествоКодов(Ссылка);
	КоличествоАгрегатовВПакете = МодульОбъекта().КодыОпераций_ОбщееКоличествоКодов(ОперацияОснование, КлючСтрокиОперацииОснования);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидАгрегатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ВидАгрегатаПослеВыбора", ЭтаФорма);
	МодульКлиента().ОткрытьФормуВыбораВидаАгрегата(ОписаниеОбработчика, ВидАгрегата, Организация, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидАгрегатаПослеВыбора(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидАгрегата = РезультатВыбора;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидАгрегатаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВидАгрегата) Тогда
		МодульКлиента().ОткрытьФормуВидаАгрегата(ВидАгрегата, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьАгрегаты(Команда)
	
	Если Модифицированность Тогда
		СохранитьОперацию();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		ТекстОшибки = НСтр("ru = 'Необходимо выбрать вид продукции'");
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ВидПродукции");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидАгрегата) Тогда
		ТекстОшибки = НСтр("ru = 'Необходимо выбрать вид агрегата'");
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ВидАгрегата");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КоличествоАгрегатов) Тогда
		ТекстОшибки = НСтр("ru = 'Необходимо указать количество агрегатов'");
		МодульКлиента().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "КоличествоАгрегатов");
		Возврат;
	КонецЕсли;
	
	СтрокиДерева = Агрегаты.ПолучитьЭлементы();
	СтрокиДерева.Очистить();
	Стр = СтрокиДерева.Добавить();
	Стр.КоличествоАгрегатов = КоличествоАгрегатов;
	Стр.ВидАгрегата = ВидАгрегата;
	
	СоздатьТранспортныеУпаковки();
	
КонецПроцедуры

&НаКлиенте
Процедура Агрегаты_Создать(Команда)
	
	СоздатьАгрегаты();
	
КонецПроцедуры

&НаКлиенте
Функция СоздатьАгрегаты()
	
	Если Не АгрегатыСозданы() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		Оповестить("КонтурМаркировка_КодыВДокументах_Изменен", ДокументУчета);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция АгрегатыСозданы()
	
	Если Товары.Итог("КоличествоКодов") = 0 Тогда
		ПодобратьКодыДляАгрегации();
	КонецЕсли;
	
	Результат = Ложь;
	
	Если Не СозданиеАгрегатов_ЕстьОшибки() Тогда
		СоздатьТранспортныеУпаковки();
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СоздатьТранспортныеУпаковки()
	
	Если Не ПроверитьНаличиеСерийныхНомеровДляНовыхАгрегатов() Тогда
		Возврат;
	КонецЕсли;
	
	ДеревоУпаковок = РеквизитФормыВЗначение("Агрегаты");
	
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	Попытка
		МодульОбъекта().Операция_СоздатьИЗаполнитьТранспортныеУпаковки(ДеревоУпаковок, Ссылка);
		ОсновнойСтатус = МодульОбъекта().Перечисление_СтатусыОпераций().СозданыАгрегаты;
		МодульОбъекта().СтатусыОперации_ЗаписатьОсновнойСтатус(Ссылка, ОсновнойСтатус);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение;
	КонецПопытки;
	
	ПосчитатьКоличествоСтрокТаблицФормы();
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКИГУ()
	
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	Попытка
		МодульОбъекта().Операция_ЗаполнитьГрупповыеУпаковки(Ссылка, ДокументУчета);
		ОсновнойСтатус = МодульОбъекта().Перечисление_СтатусыОпераций().КИГУНаполнены;
		МодульОбъекта().СтатусыОперации_ЗаписатьОсновнойСтатус(Ссылка, ОсновнойСтатус);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение;
	КонецПопытки;
	
	МодульОбъекта().Метрика_Функциональность_ФормированиеКИГУ(Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипУчастникаВводящегоВОборотПриИзменении(Элемент)
	
	ПроизводительИНН = "";
	СобственникТовараИНН = "";
	
	ЗаполнитьИННПроизводителяИСобственникаТовара();
	
КонецПроцедуры

&НаСервере
Функция Упаковки_ПолучитьСписокВидовАгрегатов()
	
	ВсеВидыАгрегатов = МодульОбъекта().ВидыАгрегатов_ВсеСсылки(Организация);
	
	Результат = Новый СписокЗначений;
	Результат.ЗагрузитьЗначения(ВсеВидыАгрегатов);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьАгрегат(Команда)
	
	СписокВидовАгрегатов = Упаковки_ПолучитьСписокВидовАгрегатов();
	Если Не ЗначениеЗаполнено(СписокВидовАгрегатов) Тогда
		ТекстПредупреждения = НСтр("ru = 'Необходимо заполнить справочник ""Виды агрегатов""'");
		МодульКлиента().ПоказатьДиалогПредупреждения(ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения(
	"ДобавитьАгрегатПослеВыбораВидаАгрегата", ЭтаФорма);
	
	МодульКлиента().ПоказатьДиалогВыбораИзСписка(ОписаниеОбработчика
	, СписокВидовАгрегатов
	, Элементы.Кнопка_ДобавитьАгрегат
	, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте 
Процедура ДобавитьАгрегатПослеВыбораВидаАгрегата(РезультатВыбора, ДопПараметр = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Агрегаты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Стр = Агрегаты.ПолучитьЭлементы().Добавить();
	Иначе
		Стр = ТекущиеДанные.ПолучитьЭлементы().Добавить();
		Элементы.Агрегаты.Развернуть(ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
	
	Стр.НомерКартинки = 1;
	Стр.КоличествоАгрегатов = 1;
	Стр.ВидАгрегата = РезультатВыбора.Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииВводВОборотНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляВводаВОборот();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииВводВОборотПриИзменении(Элемент)
	
	ВидПродукцииВводВОборотПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииВводВОборотПриИзмененииНаСервере()
	
	ПерезаполнитьТаблицыОперации();
	УстановитьВидимостьПолей_ВводВОборот();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииВыводИзОборотаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляВыводаИзОборота(ОбъемноСортовойУчет);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииВыводИзОборотаПриИзменении(Элемент)
	
	ВидПродукцииВыводИзОборотаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииВыводИзОборотаПриИзмененииНаСервере()
	
	Если Не МодульОбъекта().ВидПродукцииПоддерживаетВыводИзОборотаПоОСУ(ВидПродукции) Тогда
		ОбъемноСортовойУчет = Ложь;
	КонецЕсли;
	
	ОчиститьПлощадкуДляНеподходящихПричинВыводаИзОборота();
	ПерезаполнитьТаблицыОперации();
	УстановитьВидимостьПолей_ВыводИзОборота();
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаВыводаИзОборотаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеПричиныВыводаИзОборота(ВидПродукции, ОбъемноСортовойУчет);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаВыводаИзОборотаПриИзменении(Элемент)
	
	ДопустимыеВиды = МодульКлиента().ДопустимыеВидыПервичногоДокумента(ПричинаВыводаИзОборота);
	Если Не МодульКлиента().МассивСодержитЗначение(ДопустимыеВиды, ВидПервичногоДокумента) Тогда
		ВидПервичногоДокумента = "";
	КонецЕсли;
	
	Если ДопустимыеВиды.Количество() = 1 Тогда
		ВидПервичногоДокумента = ДопустимыеВиды[0];
	КонецЕсли;
	
	ПричинаВыводаИзОборотаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПричинаВыводаИзОборотаПриИзмененииНаСервере()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	ТипОснования = МодульОбъекта().ЗначениеРеквизитаОбъектаЛок(ОперацияОснование, "ТипОперации");
	
	Если ТипОснования = ТипыОпераций.УведомлениеОСостоянииКодов Тогда
		ОписаниеОперации = ОписаниеОперацииПоКонтекстуФормы();
		МодульОбъекта().Операция_ВыводИзОборота_ЗаполнитьШапку_ПоУведомлениюОбЭкспорте(ОписаниеОперации);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеОперации.ДопРеквизиты, "Площадка, ИННПолучателя, КодСтраныПолучателя");
	КонецЕсли;
	
	ЗаполнитьВидПервичногоДокумента();
	ОчиститьПлощадкуДляНеподходящихПричинВыводаИзОборота();
	ПерезаполнитьТаблицыОперации();
	УстановитьВидимостьПолей_ВыводИзОборота();
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПолучателяВыводИзОборотаПриИзменении(Элемент)
	
	ПерезаполнитьТаблицыОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияОснованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ОперацияОснование) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОперации(ОперацияОснование, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаВыбытияКодовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеПричиныВыбытияКодов(ВидПродукции);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРазрешительныйДокументОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.РазрешительныйДокумент) Тогда
		МодульКлиента().ОткрытьФормуРазрешительногоДокумента(ТекущиеДанные.РазрешительныйДокумент, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРазрешительныйДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.РазрешительнаяДокументация) Тогда
		МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ТекущиеДанные.РазрешительнаяДокументация);
	Иначе
		СтандартнаяОбработка = Ложь;
		ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("ТоварыРазрешительныйДокументПослеВыбора", ЭтаФорма, ТекущиеДанные);
		МодульКлиента().ОткрытьФормуВыбораРазрешительногоДокумента(ТекущиеДанные.РазрешительныйДокумент, ЭтаФорма, ПослеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРазрешительныйДокументПослеВыбора(РазрешительныйДокумент, ТекущиеДанные) Экспорт
	
	Если РазрешительныйДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.РазрешительныйДокумент = РазрешительныйДокумент;
	
	Элементы.Товары.ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаВыводаИзОборотаПриОтгрузкеПриИзменении(Элемент)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемноСортовойУчетПриИзменении(Элемент)
	
	ДопустимыеПричины = МодульКлиента().ДопустимыеПричиныВыводаИзОборота(ВидПродукции, ОбъемноСортовойУчет);
	Если ДопустимыеПричины.Найти(ПричинаВыводаИзОборота) = Неопределено Тогда
		ПричинаВыводаИзОборота = Неопределено;
		ПричинаВыводаИзОборота = "";
	КонецЕсли;
	
	ДопустимыеВидыПродукции = МодульКлиента().ДопустимыеВидыПродукцииДляВыводаИзОборота(ОбъемноСортовойУчет);
	Если ДопустимыеВидыПродукции.Найти(ВидПродукции) = Неопределено Тогда
		ВидПродукции = Неопределено;
	КонецЕсли;
	
	ОбъемноСортовойУчетПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбъемноСортовойУчетПриИзмененииНаСервере()
	
	ПерезаполнитьТаблицыОперации();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НоминальныйОбъемВКегахПриИзменении(Элемент)
	
	ПерезаполнитьТаблицыОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтражениеВЭДОПриИзменении(Элемент)
	
	ПерезаполнитьТаблицыОперации();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЗначенияПоУмолчаниюОперации()
	
	ОписаниеОперации = ОписаниеОперацииПоКонтекстуФормы();
	МодульОбъекта().Операция_ЗаполнитьЗначенияПоУмолчанию(ОписаниеОперации);
	СохранитьОперацию(ОписаниеОперации);
	
	ЗаполнитьКонтекстФормы();
	НастроитьКнопки();
	УстановитьУсловноеОформление();
	ЗаполнитьСпискиВыбора();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТаблицыОперации()
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	ОписаниеОперации = ОписаниеОперацииПоКонтекстуФормы();
	
	МодульОбъекта().Операция_ПерезаполнитьТаблицыОперации(ОписаниеОперации, ТаблицаКодов);
	
	СохранитьОперацию(ОписаниеОперации, ТаблицаКодов);
	
	ЗаполнитьКонтекстФормы();
	НастроитьКнопки();
	УстановитьУсловноеОформление();
	ЗаполнитьСпискиВыбора();
	
	ОбновитьСписокКодовМаркировки();
	
КонецПроцедуры

&НаКлиенте
Процедура Товары_ДобавитьИзВходящегоУПД(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	СозданоТоваров = Товары_ДобавитьИзВходящегоУПДНаСервере();
	
	Если ЗначениеЗаполнено(СозданоТоваров) Тогда
		КодыВходящегоУПДПриАктивизацииСтроки(Элементы.КодыВходящегоУПД);
	КонецЕсли;
	
	ТекстСообщения = МодульКлиента().ПараметрыВСтроку(НСтр(
	"ru = 'Добавлено %1 новых товаров'"), СозданоТоваров);
	
	Сообщить(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Функция Товары_ДобавитьИзВходящегоУПДНаСервере()
	
	Возврат МодульОбъекта().Товары_ДобавитьИзВходящегоУПД(Ссылка);
	
КонецФункции

&НаКлиенте
Процедура СохранитьКодыВФайлCSV(Команда)
	
	ФорматыФайловСКодами = МодульКлиента().Перечисление_ФорматыФайловСКодами();
	СохранитьКодыВФайл(ФорматыФайловСКодами.csv);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайлXLS(Команда)
	
	ФорматыФайловСКодами = МодульКлиента().Перечисление_ФорматыФайловСКодами();
	СохранитьКодыВФайл(ФорматыФайловСКодами.xlsx);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодыВФайл(ФорматФайла)
	
	ТипыФайловСКодами = МодульКлиента().Перечисление_ТипыФайловСКодами();
	
	ПараметрыСохранения = МодульКлиента().Новый_ПараметрыСохраненияФайлаСКодами();
	
	ПараметрыСохранения.Ссылка = Ссылка;
	ПараметрыСохранения.ФорматФайла = ФорматФайла;
	ПараметрыСохранения.ТипФайлаСКодами = ТипыФайловСКодами.ФайлКодовОперации;
	
	МодульКлиента().СохранитьКодыВФайл(ПараметрыСохранения);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусКодыВыгружены()
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	Если ОсновнойСтатус <> СтатусыОпераций.КодыВыгружены Тогда
		ОсновнойСтатус = СтатусыОпераций.КодыВыгружены;
		МодульОбъекта().СтатусыОперации_ЗаписатьОсновнойСтатус(Ссылка, ОсновнойСтатус);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусКодыНапечатаны()
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	Если ОсновнойСтатус <> СтатусыОпераций.КодыНапечатаны Тогда
		ОсновнойСтатус = СтатусыОпераций.КодыНапечатаны;
		МодульОбъекта().СтатусыОперации_ЗаписатьОсновнойСтатус(Ссылка, ОсновнойСтатус);
		НастроитьЭлементыФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ПолучитьПовторноИзТСД(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Коды_ПолучитьПовторноИзТСДНаСервере();
	
	Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
	Оповестить("КонтурМаркировка_КодыВДокументах_Изменен", ДокументУчета);
	
	Если ОсновнойСтатус <> МодульКлиента().Перечисление_СтатусыОпераций().ОшибкаОбработки Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Коды_ПолучитьПовторноИзТСДНаСервере()
	
	МодульОбъекта().Операция_ПолучитьПовторноКодыИзТСД(Ссылка);
	ЗаполнитьКонтекстФормыИУстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура Коды_ВозвратНаТСДНаСервере(Комментарий)
	
	СохранитьОперацию();
	
	МодульОбъекта().Операция_ВернутьКодыНаТСД(Ссылка, Комментарий);
	
	ЗаполнитьКонтекстФормыИУстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ВернутьНаТСД(Команда)
	
	Действие = НСтр("ru = 'Вернуть наполнение на ТСД'");
	Если Не МодульКлиента().ДоступенPATCHЗапрос(Действие) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Подсказка = НСтр("ru = 'Комментарий для сотрудника'");
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Коды_ВозвратНаТСДПослеВводаКомментария", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВводаСтроки(ОписаниеОбработчика, , Подсказка, , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_Перемаркировать(Команда)
	
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	
	ОперацияПеремаркировки = МодульКлиента().Операция_Создать(ТипыОпераций.Перемаркировка, ДокументУчета, Ссылка);
	
	МодульКлиента().ОткрытьФормуОперации(ОперацияПеремаркировки, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ОтчитатьсяОНанесении(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ОтчетОНанесении;
	Операция = МодульКлиента().Операция_Создать(ТипОперации, ДокументУчета, Ссылка);
	МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ВозвратНаТСДПослеВводаКомментария(Значение, Параметры) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КомментарийВозвратаНаТСД = Значение;
	
	Коды_ВозвратНаТСДНаСервере(Значение);
	
	Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
	
	Если ОсновнойСтатус <> МодульКлиента().Перечисление_СтатусыОпераций().ОшибкаОбработки Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_КорректироватьСведения(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().КорректировкаСведенийОКодах;
	Операция = МодульКлиента().Операция_Создать(ТипОперации, ДокументУчета, Ссылка);
	МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ВыполнитьВводВОборот(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ВводВОборот;
	Операция = МодульКлиента().Операция_Создать(ТипОперации, ДокументУчета, Ссылка);
	МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Коды_ВывестиИзОборота(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ВыводИзОборота;
	Операция = МодульКлиента().Операция_Создать(ТипОперации, ДокументУчета, Ссылка);
	МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзТабличногоДокумента(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ЗагрузитьКодыИзТабличногоДокумента_ПослеУказанияКодов", ЭтаФорма);
	
	МодульКлиента().ОткрытьФормуЗагрузкиКодов(ЭтаФорма, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКодыИзТабличногоДокумента_ПослеУказанияКодов(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДобавитьИзТабличногоДокумента(Результат) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Операция", Ссылка);
		ПараметрыФормы.Вставить("ТипОперации", ТипОперации);
		
		МодульКлиента().ОткрытьФормуОбработкиМодально("Форма_РедакторКодов", ЭтаФорма, ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьИзТабличногоДокумента(Результат)
	
	Если Модифицированность Тогда
		СохранитьОперацию();
	КонецЕсли;
	
	КодыДобавлены = МодульОбъекта().КодыОпераций_ДобавитьИзТабличногоДокумента(Ссылка, Результат);
	
	Если КодыДобавлены Тогда
		ЗаполнитьКонтекстФормы();
		ОбновитьСписокКодовМаркировки();
	КонецЕсли;
	
	Возврат КодыДобавлены;
	
КонецФункции

&НаКлиенте
Процедура Коды_ОбновитьСтатусы(Команда)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьОбновлениеСтатусовКодов();
	ОбновитьСписокКодовМаркировки();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОбновлениеСтатусовКодов()
	
	МодульОбъекта().ЗапуститьОбновлениеСтатусовКодовОперации(Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокКодовМаркировки()
	
	Элементы.КодыМаркировки.Обновить();
	Элементы.АгрегатыВПакете.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчетаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МодульКлиента().ОткрытьФормуДокументаУчета(ДокументУчета, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеталиОшибкиНажатие(Элемент)
	
	Элементы.ПанельЗакладок.ТекущаяСтраница = Элементы.ЗакладкаОсновная;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПодсказкуФормы()
	
	Подсказки = Новый Массив;
	Подсказки.Добавить(ПодсказкаПередачиКодовСервисПровайдеру());
	Подсказки.Добавить(ПодсказкаРегистрацииОтчетаОНанесенииВГИС());
	Подсказки.Добавить(ПодсказкаРегистрацииОтчетаОВыбытииВГИС());
	Подсказки.Добавить(ПодсказкаАвтоматическойРегистрацииВГИС());
	Подсказки.Добавить(ПодсказкаПечати());
	Подсказки.Добавить(ПодсказкаВыполняетсяОбновлениеДанных());
	Подсказки.Добавить(ПодсказкаЗаказКодовНаборовНаОстатки());
	Подсказки.Добавить(ПодсказкаВыводИЗОборотаОСУВес());
	Подсказки.Добавить(ПодсказкаКорректировкаСведенийОКодах());
	Подсказки.Добавить(ПодсказкаАвтоподборПозицииНаТСД());
	Подсказки.Добавить(ПодсказкаУведомлениеОСостоянииКодов());
	Подсказки.Добавить(ПодсказкаОтчетОНанесенииНаТСДРЭП());
	Подсказки.Добавить(ПодсказкаЗаказКодовМаркировкаТоваровРасформированногоНабора());
	
	Разделитель = "";
	ОбщийТекстПодсказки = "";
	Для Каждого ТекстПодсказки Из Подсказки Цикл
		Если ЗначениеЗаполнено(ТекстПодсказки) Тогда
			ОбщийТекстПодсказки = ОбщийТекстПодсказки + Разделитель + ТекстПодсказки;
			Разделитель = Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ТекстПодсказки.Заголовок = ОбщийТекстПодсказки;
	Элементы.ГруппаПодсказки.Видимость = ЗначениеЗаполнено(ОбщийТекстПодсказки);
	Элементы.СсылкаПодсказки.Видимость = ЗначениеЗаполнено(ПодсказкаАвтоподборПозицииНаТСД());
	
КонецПроцедуры

&НаКлиенте
Функция ПодсказкаПечати()
	
	Результат = "";
	
	Если ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().ПечатьКодов Тогда
		Результат = НСтр("ru = 'Напечатанные коды нельзя подобрать в документ учета со свободного остатка.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодсказкаПередачиКодовСервисПровайдеру()
	
	Результат = "";
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	
	Если ТипОперации = ТипыОпераций.ЗаказКодов И ЗаказКодовДляСервисПровайдера Тогда
		
		Результат = НСтр("ru = 'Коды маркировки будут переданы сервис-провайдеру.'");
		
		Если ЗначениеЗаполнено(ДокументУчета) Тогда
			Результат = Результат + Символы.ПС + НСтр(
			"ru = 'Чтобы добавить коды в документ, необходимо сканировать их с этикеток в «Отчет о нанесении».'");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодсказкаРегистрацииОтчетаОНанесенииВГИС()
	
	Результат = "";
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	СтатусыОпераций = МодульКлиента().Перечисление_СтатусыОпераций();
	
	Если ТипОперации = ТипыОпераций.ОтчетОНанесенииНаТСД Тогда
		Результат = НСтр("ru = 'После наполнения на ТСД, отчет автоматически отправляется на регистрацию в ГИС МТ.'");
		Если ОсновнойСтатус = СтатусыОпераций.ОжиданиеЗавершенияИзменений Тогда
			Результат = НСтр("ru = 'Задание на ТСД можно продолжить наполнять,"
			+ " но для отправки отчета в ГИС МТ необходимо завершить редактирование.'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПодсказкаЧастичноПринятогоОтчетаОНанесении()
	
	Результат = "";
	ТипыОпераций    = МодульОбъекта().Перечисление_ТипыОпераций();
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	Если ОсновнойСтатус = СтатусыОпераций.ПринятЧастично Тогда
		
		Если ТипОперации = ТипыОпераций.ОтчетОНанесении Тогда
			Результат = НСтр("ru = 'Для регистрации непринятых кодов создайте новый отчет о нанесении.'");
		КонецЕсли;
		
		Если ТипОперации = ТипыОпераций.ОтчетОНанесенииНаТСД Тогда
			Результат = НСтр("ru = 'Для регистрации непринятых кодов создайте новый отчет о нанесении без отправки на ТСД.'");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодсказкаАвтоматическойРегистрацииВГИС()
	
	Результат = "";
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	
	Если ТипОперации = ТипыОпераций.НаполнениеНаборовНаТСД
		Или ТипОперации = ТипыОпераций.НаполнениеКИГУНаТСД Тогда
		Результат = НСтр("ru = 'После наполнения на ТСД, документ автоматически отправляется на регистрацию в ГИС МТ.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодсказкаРегистрацииОтчетаОВыбытииВГИС()
	
	Результат = "";
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	
	Если ТипОперации = ТипыОпераций.ОтчетОВыбытииНаТСД Тогда
		Результат = НСтр("ru = 'После наполнения на ТСД, отчет автоматически отправляется на регистрацию в ГИС МТ.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодсказкаВыполняетсяОбновлениеДанных()
	
	Результат = "";
	
	Если ОбъектВПроцессеОбновления Тогда
		Результат = НСтр("ru = 'Работа с объектом заблокирована. Выполняется обновление данных.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодсказкаЗаказКодовНаборовНаОстатки()
	
	Результат = "";
	ВидыПродукции = МодульКлиента().Перечисление_ВидыПродукции();
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	СпособыВыпуска = МодульКлиента().Перечисление_СпособыВыпускаТоваров();
	ТипыКодовМаркировки = МодульКлиента().Перечисление_ТипыКодовМаркировки();
	
	Если ТипОперации = ТипыОпераций.ЗаказКодов
		И ВидПродукции = ВидыПродукции.Легпром
		И СпособВыпускаТоваров = СпособыВыпуска.Остатки
		И ТипКодаМаркировки = ТипыКодовМаркировки.Набор Тогда
		Результат = НСтр("ru = 'Для кодов маркировки со способом выпуска «Маркировка остатков» будет доступен ввод в оборот только по товарам из списка расширения.
		|Возврат денежных средств по заказанным КМ на товары, которые подлежат маркировке с 01.01.2021 года, со способом выпуска «Маркировка остатков» произведены не будут.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодсказкаВыводИзОборотаОСУВес()
	
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	ВидыПродукции = МодульКлиента().Перечисление_ВидыПродукции();
	ФичаФлаги = МодульКлиента().Перечисление_ФичаФлаги();
	
	Если ТипОперации <> ТипыОпераций.ВыводИзОборота Тогда
		Возврат "";
	КонецЕсли;

	Если Не ОбъемноСортовойУчет
		Или ВидПродукции <> ВидыПродукции.Молоко
		Или Не Товары_ЕстьПеременныйВес() Тогда
		Возврат "";
	КонецЕсли;
	
	Если МодульКлиента().ФичаФлагВключен(ФичаФлаги.КонтрольВесВыводИзОборотаМолокоОСУ) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат НСтр(
	"ru = 'Если в строке товара с переменным весом не указано значение веса, то на склад ГИС МТ
	|будет передано среднее арифметическое значений атрибутов «Диапазон веса, от» и «Диапазон веса, до»,
	|указанных в карточке товара в НКМТ.'");
	
КонецФункции

&НаКлиенте
Функция ПодсказкаКорректировкаСведенийОКодах()
	
	Результат = "";
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	
	Если ТипОперации <> ТипыОпераций.КорректировкаСведенийоКодах
		Или Не ЗначениеЗаполнено(ВидКорректируемыхСведений) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВидыСведений = МодульКлиента().Перечисление_ВидыКорректируемыхСведений();
	Если ВидКорректируемыхСведений = ВидыСведений.ИдентификаторВСД Тогда
		Результат = НСтр("ru = 'Изменение ВСД доступно только для единиц товара в статусах"
		+ " «В обороте», «Выведен из оборота», «Списан». Коды не должны входить в состав групповой упаковки.'");
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.ДатаПроизводства Тогда
		Результат = НСтр("ru = 'Изменение даты производства доступно для единиц товара и комплектов в статусах"
		+ " «Нанесен» и «В обороте».'");
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.СрокГодности Тогда
		Результат = НСтр("ru = 'Изменение срока годности доступно только для единиц товара в статусах"
		+ " «Нанесен» и «В обороте».'");
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.ВариативныйСрокГодности Тогда
		Результат = НСтр("ru = 'Изменение вариативного срока годности доступно только для единиц товара в статусах"
		+ " «Нанесен» и «В обороте».'");
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.КодТНВЭД Тогда
		Результат = НСтр("ru = 'Изменение кода ТН ВЭД доступно только для единиц товара в статусе «В обороте»"
		+ " с любым способом выпуска товаров, кроме «Импорт в РФ». Коды не должны входить в состав групповой упаковки.'");
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.ФактическийВес Тогда
		Результат = НСтр("ru = 'Изменение фактического веса доступно только для единиц товара в статусах"
		+ " «Нанесен» и «В обороте».'");
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.РазрешительныйДокумент Тогда
		Результат = НСтр("ru = 'Изменение данных о разрешительных документах доступно"
		+ " для единиц товара и комплектов в статусах «Нанесен» и «В обороте».'");
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.ЛицензияНаНедра Тогда
		Результат = НСтр("ru = 'Изменение данных о лицензии на пользование недрами доступно только"
		+ " для единиц товара в статусах «Нанесен» и «В обороте».'");
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.СпособВыпускаТоваров Тогда
		Результат = НСтр("ru = 'Изменение способа выпуска товаров доступно только для единиц товара в статусах"
		+ " «Эмитирован» или «Нанесен» с ранее указанным способом выпуска «Импорт в РФ» или «Производство в РФ»."
		+ " Коды не должны входить в состав комплектов, наборов, групповых и транспортных упаковок.'");
	КонецЕсли;
	
	Если ВидКорректируемыхСведений = ВидыСведений.НомерПартии Тогда
		Результат = НСтр("ru = 'Изменение номера партии доступно только для единиц товара.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодсказкаАвтоподборПозицииНаТСД()
	
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	ФичаФлаги = МодульКлиента().Перечисление_ФичаФлаги();
	
	Если ТипОперации <> ТипыОпераций.ПодборКодовНаТСД
		И ТипОперации <> ТипыОпераций.ОтчетОНанесенииНаТСД Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не МодульКлиента().ФичаФлагВключен(ФичаФлаги.АвтоподборПозицииНаТСД) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат НСтр("ru = 'При сканировании на ТСД возможно наполнение документа с автоподбором позиции по GTIN.'");
	
КонецФункции

&НаКлиенте
Функция ПодсказкаУведомлениеОСостоянииКодов()
	
	Результат = "";
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	СостоянияКодов = МодульКлиента().Перечисление_СостоянияКодов();
	СтатусыОпераций = МодульКлиента().Перечисление_СтатусыОпераций();
	
	Если ТипОперации = ТипыОпераций.УведомлениеОСостоянииКодов
		И ОсновнойСтатус = СтатусыОпераций.ОперацияЗавершена
		И СостояниеКодов = СостоянияКодов.ОтгрузкаНаЭкспорт Тогда
		Результат = НСтр("ru = 'Подача сведений о выводе из оборота осуществляется в течение одного рабочего дня"
		+ " со дня помещения товара под таможенную процедуру.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодсказкаОтчетОНанесенииНаТСДРЭП()
	
	Результат = "";
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	ВидыПродукции = МодульКлиента().Перечисление_ВидыПродукции();
	
	Если ТипОперации = ТипыОпераций.ОтчетОНанесенииНаТСД И ВидПродукции = ВидыПродукции.Электроника Тогда
		Результат = НСтр("ru = 'Указание значений переменных характеристик для кодов товаров ТГ Радиоэлектронная продукция"
		+ " доступно только в отчете о нанесении.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодсказкаЗаказКодовМаркировкаТоваровРасформированногоНабора()
	
	Результат = "";
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	ТипыЗаказаКодов = МодульКлиента().Перечисление_ТипыЗаказаКодов();
	
	Если ТипОперации = ТипыОпераций.ЗаказКодов И ТипЗаказаКодов = ТипыЗаказаКодов.РасформированиеНабора Тогда
		Результат = НСтр("ru = 'Чтобы заполнить заказ товарами, добавьте код набора"
		+ " и нажмите кнопку «Заполнить товары по коду набора».'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОперацияПопадаетНаТСД()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	ПодходящиеОперации = Новый Массив;
	ПодходящиеОперации.Добавить(ТипыОпераций.ПодборКодовНаТСД);
	ПодходящиеОперации.Добавить(ТипыОпераций.ПодборТоваровИКодовНаТСД);
	ПодходящиеОперации.Добавить(ТипыОпераций.ОтчетОНанесенииНаТСД);
	ПодходящиеОперации.Добавить(ТипыОпераций.НаполнениеАгрегатовНаТСД);
	ПодходящиеОперации.Добавить(ТипыОпераций.НаполнениеНаборовНаТСД);
	
	Результат = (ПодходящиеОперации.Найти(ТипОперации) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УстановитьОформлениеТоварыКоличествоКодовВводВОборот();
	УстановитьОформлениеТоварыИдентификаторВСД();
	УстановитьОформлениеТоварыКоличество();
	УстановитьОформлениеТоварыВес();
	УстановитьОформлениеТоварыСуммаНДС();
	УстановитьОформлениеТоварыДатаСрокаГодности();
	УстановитьОформлениеТоварыАльтернативныйСрокГодности();
	УстановитьОформлениеТоварыСрокГодности();
	УстановитьОформлениеТоварыДатаПроизводстваКИНКИГУ();
	УстановитьОформлениеТоварыНомерПартии();
	УстановитьОформлениеТоварыЗСН();
	УстановитьОформлениеТоварыКодСтраныПроизводителя();
	
	УстановитьОформлениеСведенияОТоварахКоличество();
	
	УстановитьОформлениеУпаковкиКоличество();
	УстановитьОформлениеУпаковкиКоличествоАгрегатов();
	
	УстановитьОформлениеКодыВходящегоУПД();
	
	УстановитьОформлениеРедакторКодовГиперссылка();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыКоличествоКодовВводВОборот()
	
	ТаблицаФормы = Элементы.Товары;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "КоличествоКодовВводВОборот");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".КоличествоУпаковок");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".КоличествоКодов");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 214, 214));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(206, 0, 20));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыИдентификаторВСД()
	
	ТаблицаФормы = Элементы.Товары;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "ИдентификаторВСД");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ПодлежитВетеринарномуКонтролю");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ИдентификаторВСД");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	МодульОбъекта().УсловноеОформление_УстановитьТекстНеТребуется(ЭлементУО);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыКодСтраныПроизводителя()
	
	ТаблицаФормы = Элементы.Товары;
	СписокСтран = МодульОбъекта().СписокСтранМира();
	СписокСтран.Вставить(0, "00", "НЕИЗВЕСТНО");
	
	Для Каждого ЭлементСписка Из СписокСтран Цикл
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "КодСтраныПроизводителя");
		
		ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".КодСтраныПроизводителя");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ЭлементСписка.Значение;
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", ЭлементСписка.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыКоличество()
	
	УстановитьОформлениеТоварыКоличество_НеТребуется();
	УстановитьОформлениеТоварыКоличество_НеЗаполнено();
	УстановитьОформлениеТоварыКоличество_Формат();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыКоличество_НеТребуется()
	
	ТаблицаФормы = Элементы.Товары;
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "Количество");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ТребуетсяУказатьКоличество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыКоличество_НеЗаполнено()
	
	ТаблицаФормы = Элементы.Товары;
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "Количество");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".Количество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ТребуетсяУказатьКоличество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипОперации");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = МодульОбъекта().Перечисление_ТипыОпераций().ОтчетОНанесении;
	
	ГруппаИЛИ = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
	
	ЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользоватьНоминальноеКоличество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".НоминальноеКоличество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Укажите значение'"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыКоличество_Формат()
	
	ТаблицаФормы = Элементы.Товары;
	ЕдиницыИзмерения = МодульОбъекта().Перечисление_ЕдиницыИзмеренияМаркировки();
	
	Для Каждого КлючЗначение Из ЕдиницыИзмерения Цикл
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "Количество");
		
		ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".Количество");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		
		ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ЕдиницаМаркировки");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = КлючЗначение.Значение;
		
		ФорматЧисла = МодульОбъекта().ПараметрыВСтроку("ЧФ='Ч %1'", КлючЗначение.Значение);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", ФорматЧисла);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыВес()
	
	ТаблицаФормы = Элементы.Товары;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "Вес");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".Количество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ПеременныйВес");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	МодульОбъекта().УсловноеОформление_УстановитьТекстНеТребуется(ЭлементУО);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеСведенияОТоварахКоличество()
	
	ТаблицаФормы = Элементы.СведенияОТоварах;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "Количество");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ПеременныйВес");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".Количество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	МодульОбъекта().УсловноеОформление_УстановитьТекстНеТребуется(ЭлементУО);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыДатаСрокаГодности()
	
	ТаблицаФормы = Элементы.Товары;
	
	// Отображение времени в сроке годности только для скоропорта
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "ДатаСрокаГодности");
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "КорректировкаДатаСрокаГодности");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".СрокГодностиМеньше72Часов");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ=dd.MM.yyyy");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыАльтернативныйСрокГодности()
	
	ТаблицаФормы = Элементы.Товары;
	
	// Отображение времени в сроке годности только для скоропорта
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "АльтернативныйСрокГодности");
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "КорректировкаВариативныйСрокГодности");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".АльтернативныйСрокГодностиЗаполнен");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыСрокГодности()
	
	ТаблицаФормы = Элементы.Товары;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "ДатаСрокаГодности");
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "АльтернативныйСрокГодности");
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "КорректировкаВариативныйСрокГодности");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ДопустимоУказаниеСрокаГодности");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ДатаСрокаГодности");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	МодульОбъекта().УсловноеОформление_УстановитьТекстНеТребуется(ЭлементУО);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыДатаПроизводстваКИНКИГУ()
	
	ПодходящиеВидыПродукции = Новый СписокЗначений;
	ПодходящиеВидыПродукции.ЗагрузитьЗначения(МодульОбъекта().ДопустимыеВидыПродукцииДляДатыПроизводстваВОтчетеОНанесенииКИНКИГУ(ТипОтчетаОНанесении));
	
	ТаблицаФормы = Элементы.Товары;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "ДатаПроизводстваОтчетОНанесении");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидПродукции");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ПравоеЗначение = ПодходящиеВидыПродукции;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ТипКодаМаркировки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СписокТиповКодовМаркировкиКИНКИГУ();
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ДатаПроизводства");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	МодульОбъекта().УсловноеОформление_УстановитьТекстНеТребуется(ЭлементУО);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыНомерПартии()
	
	УстановитьОформлениеТоварыНомерПартииОтчетОНанесении();
	УстановитьОформлениеТоварыНомерПартииВыводИзОборота();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыНомерПартииОтчетОНанесении()
	
	ТипыКодов = МодульОбъекта().Перечисление_ТипыКодовМаркировки();
	ТаблицаФормы = Элементы.Товары;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "НомерПартии");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ТипКодаМаркировки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = ТипыКодов.ЕдиницаТовара;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".НомерПартии");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	МодульОбъекта().УсловноеОформление_УстановитьТекстНеТребуется(ЭлементУО);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыНомерПартииВыводИзОборота()
	
	ТаблицаФормы = Элементы.Товары;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "НомерПартииВыводИзОборота");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ТипКодаМаркировки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СписокТиповКодовМаркировкиКИНКИГУ();
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".НомерПартии");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	МодульОбъекта().УсловноеОформление_УстановитьТекстНеТребуется(ЭлементУО);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыЗСН()
	
	ТаблицаФормы = Элементы.Товары;
	
	МодульОбъекта().УсловноеОформление_Товары_ТребуетсяЗСН(УсловноеОформление, ТаблицаФормы);
	МодульОбъекта().УсловноеОформление_Товары_НеТребуетсяЗСН(УсловноеОформление, ТаблицаФормы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеТоварыСуммаНДС()
	
	ТаблицаФормы = Элементы.Товары;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "СуммаНДС");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НеОблагаетсяНДС");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	МодульОбъекта().УсловноеОформление_УстановитьТекстНеТребуется(ЭлементУО);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеКодыВходящегоУПД()
	
	ТаблицаФормы = Элементы.КодыВходящегоУПД;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным);
	
	ГруппаОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".КоличествоКодов");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".КодМаркировки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеУпаковкиКоличество()
	
	ТаблицаФормы = Элементы.Агрегаты;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "УпаковкиКоличество");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".Товар");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеУпаковкиКоличествоАгрегатов()
	
	ТаблицаФормы = Элементы.Агрегаты;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "УпаковкиКоличествоАгрегатов");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ВидАгрегата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеРедакторКодовГиперссылка()
	
	УстановитьОформлениеРедакторКодовГиперссылкаНеУдалосьРаспознатьКоды();
	УстановитьОформлениеРедакторКодовГиперссылкаТрансформацияАгрегатов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеРедакторКодовГиперссылкаНеУдалосьРаспознатьКоды()
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	СтатусыИсправленияОшибок = Новый СписокЗначений;
	СтатусыИсправленияОшибок.Добавить(СтатусыОпераций.НеУдалосьРаспознатьКоды);
	СтатусыИсправленияОшибок.Добавить(СтатусыОпераций.ОбнаруженоДублированиеВАгрегатах);
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.РедакторКодовГиперссылка.Имя);
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ОсновнойСтатус.Имя);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СтатусыИсправленияОшибок;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеРедакторКодовГиперссылкаТрансформацияАгрегатов()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	ТипыОперацийТрансформации = Новый СписокЗначений;
	ТипыОперацийТрансформации.Добавить(ТипыОпераций.ДобавлениеВАгрегат);
	ТипыОперацийТрансформации.Добавить(ТипыОпераций.ИзъятиеИзАгрегата);
	ТипыОперацийТрансформации.Добавить(ТипыОпераций.ДобавлениеВАТК);
	ТипыОперацийТрансформации.Добавить(ТипыОпераций.ИзъятиеИзАТК);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.РедакторКодовГиперссылка.Имя);
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипОперации");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = ТипыОперацийТрансформации;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(28, 85, 174));
	
КонецПроцедуры

&НаСервере
Функция ПричинаВыводаИзОборотаДопускаетУказаниеИННПолучателя()
	
	ПричиныВывода = МодульОбъекта().Перечисление_ПричиныВыводаИзОборота();
	
	Если ПричинаВыводаИзОборота = ПричиныВывода.ДляСобственныхНужд
		Или ПричинаВыводаИзОборота = ПричиныВывода.ДляПроизводственныхЦелей Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СтатусУведомленияОПриемкеДопускаетИзменениеДокумента()
	
	СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
	
	Если ОсновнойСтатус = СтатусыОпераций.ОшибкаОбработки
		Или ОсновнойСтатус = СтатусыОпераций.ДокументОПриемкеОжидаетПодтверждения Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтатусТовараНаСверкеТребуетУказатьЦенуКодТНВЭД(СтрокаДЗ, ЭтоЧастичнаяПриемка)
	
	Результат = Ложь;
	
	СтатусыТовараНаСверке = МодульКлиента().Перечисление_СтатусыТовараНаСверке();
	
	Для Каждого Стр Из СтрокаДЗ.ПолучитьЭлементы() Цикл
		
		Если ЭтоЧастичнаяПриемка Тогда
			Если Стр.СтатусТовараНаСверке = СтатусыТовараНаСверке.НайденВДокументе Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		Иначе
			Если Стр.СтатусТовараНаСверке = СтатусыТовараНаСверке.НайденВДокументе
				Или Стр.СтатусТовараНаСверке = СтатусыТовараНаСверке.НеОтсканированНаСкладе Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		Если СтатусТовараНаСверкеТребуетУказатьЦенуКодТНВЭД(Стр, ЭтоЧастичнаяПриемка) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РедакторКодовГиперссылкаНажатие(Элемент)
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьОперацию();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Операция", Ссылка);
	ПараметрыФормы.Вставить("ТипОперации", ТипОперации);
	
	МодульКлиента().ОткрытьФормуОбработкиМодально("Форма_РедакторКодов", ЭтаФорма, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументы_Открыть(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументУчета", ДокументУчета);
	ПараметрыФормы.Вставить("Операция", Ссылка);
	
	МодульКлиента().ОткрытьФормуОбработкиЛок("Форма_СвязанныеДокументы", ЭтаФорма, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДекларацииПриИзменении(Элемент)
	
	НомерДекларации = СокрЛП(НомерДекларации);
	
	СтруктураДекларации = МодульКлиента().СтруктураТаможеннойДекларации(НомерДекларации);
	
	Если ЗначениеЗаполнено(СтруктураДекларации.ДатаДекларации) Тогда
		ДатаДекларации = СтруктураДекларации.ДатаДекларации;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДекларации.КодТаможни) Тогда
		КодТаможни = СтруктураДекларации.КодТаможни;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МодульКлиента().ОткрытьФормуСертификата(Сертификат, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаКодыМаркировки()
	
	Возврат
	
	"ВЫБРАТЬ
	|	КодыОпераций.КлючКода КАК КлючКода,
	|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	ИнформацияОКодах.КлючНоменклатуры1С КАК КлючНоменклатуры1С,
	|	ИнформацияОКодах.Товар КАК Товар,
	|	ЕСТЬNULL(СтатусыКодов.Статус, """") КАК СтатусКода,
	|	ЕСТЬNULL(СтатусыКодов.ОсобоеСостояниеКода, """") КАК ОсобоеСостояниеКода,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнформацияОКодах.ДатаПечати, &ПустаяДата) > &ПустаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Напечатан,
	|	КодыМаркировки.ЗаводскойСерийныйНомер КАК ЗаводскойСерийныйНомер,
	|	ИнформацияОКодах.НомерПартии КАК НомерПартии,
	|	ИнформацияОКодах.ДатаПроизводства КАК ДатаПроизводства,
	|	ИнформацияОКодах.ДатаСрокаГодности КАК ДатаСрокаГодности,
	|	ИнформацияОКодах.ИдентификаторВСД КАК ИдентификаторВСД,
	|	ИнформацияОКодах.ОбщийТипУпаковки КАК ОбщийТипУпаковки,
	|	КодыМаркировки.Количество КАК Количество,
	|	ЕСТЬNULL(ПодчиненныеОперации.Ссылка, &ПустаяОперация) КАК Операция,
	|	ЕСТЬNULL(СтатусыОпераций.Статус, """") КАК СтатусОперации,
	|	ВЫБОР
	|		КОГДА СтатусыОпераций.Статус ЕСТЬ NULL
	|			ТОГДА -1
	|		КОГДА СтатусыОпераций.Статус = &СтатусОперации_Новый
	|			ТОГДА 0
	|		КОГДА СтатусыОпераций.Статус = &СтатусОперации_ОперацияЗавершена
	|				ИЛИ СтатусыОпераций.Статус = &СтатусОперации_ПринятЧастично
	|			ТОГДА 4
	|		КОГДА СтатусыОпераций.Статус = &СтатусОперации_ОшибкаОбработки
	|				ИЛИ СтатусыОпераций.Статус = &СтатусОперации_НеУдалосьРаспознатьКоды
	|				ИЛИ СтатусыОпераций.Статус = &СтатусОперации_ОбнаруженоДублированиеВАгрегатах
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ОперацияИндексКартинки,
	|	АртикулыНоменклатуры.Значение КАК Артикул
	|ИЗ
	|	РегистрСведений.КонтурМаркировка_КодыОпераций КАК КодыОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_КодыМаркировки КАК КодыМаркировки
	|		ПО КодыОпераций.КлючКода = КодыМаркировки.КлючКода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ИнформацияОКодах КАК ИнформацияОКодах
	|		ПО (КодыМаркировки.КлючИнформацииОКоде = ИнформацияОКодах.КлючИнформацииОКоде)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ДопРеквизиты КАК АртикулыНоменклатуры
	|		ПО (ИнформацияОКодах.КлючНоменклатуры1С = АртикулыНоменклатуры.Объект)
	|			И (АртикулыНоменклатуры.ИмяРеквизита = &ИмяДопРеквизитаАртикул)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыКодовГИСМТ КАК СтатусыКодов
	|		ПО (КодыМаркировки.КлючСтатусаКода = СтатусыКодов.КлючСтатусаКода)
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурМаркировка_Операции КАК ПодчиненныеОперации
	|		ПО КодыОпераций.Операция = ПодчиненныеОперации.ОперацияОснование
	|			И КодыОпераций.КлючСтрокиОперации = ПодчиненныеОперации.КлючСтрокиОперацииОснования
	|			И (КодыОпераций.КлючСтрокиОперации <> &ПустойИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыОпераций КАК СтатусыОпераций
	|		ПО (ПодчиненныеОперации.Ссылка = СтатусыОпераций.Операция)
	|			И (СтатусыОпераций.ТипСтатуса = &ТипСтатуса_ОсновнойСтатус)}
	|ГДЕ
	|	КодыОпераций.Операция = &Операция";
	
КонецФункции

&НаСервере
Функция ТекстЗапросаКодыПакетаАгрегатов()
	
	Возврат
	
	"ВЫБРАТЬ
	|	КодыОпераций.КлючКода КАК КлючКода,
	|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	ИнформацияОКодах.КлючНоменклатуры1С КАК КлючНоменклатуры1С,
	|	ИнформацияОКодах.Товар КАК Товар,
	|	ЕСТЬNULL(СтатусыКодов.Статус, """") КАК СтатусКода,
	|	ЕСТЬNULL(СтатусыКодов.ОсобоеСостояниеКода, """") КАК ОсобоеСостояниеКода
	|ИЗ
	|	РегистрСведений.КонтурМаркировка_КодыОпераций КАК КодыОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_КодыМаркировки КАК КодыМаркировки
	|		ПО КодыОпераций.КлючКода = КодыМаркировки.КлючКода
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_ИнформацияОКодах КАК ИнформацияОКодах
	|		ПО (КодыМаркировки.КлючИнформацииОКоде = ИнформацияОКодах.КлючИнформацииОКоде)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурМаркировка_СтатусыКодовГИСМТ КАК СтатусыКодов
	|		ПО (КодыМаркировки.КлючСтатусаКода = СтатусыКодов.КлючСтатусаКода)}
	|ГДЕ
	|	КодыОпераций.Операция = &ОперацияОснование
	|	И КодыОпераций.КлючСтрокиОперации = &КлючСтрокиОперацииОснования";
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуАдминистратора(Команда)
	
	МодульКлиента().ОткрытьФормуАдминистратораМаркировки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактораДокументаУчета(Команда)
	
	МодульКлиента().ОткрытьФормуРедактораДокументаУчета(ДокументУчета, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактораОперации(Команда)
	
	МодульКлиента().ОткрытьФормуРедактораОперации(Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедакторКода(Команда)
	
	ТекущийКлючКода = Неопределено;
	
	Если Элементы.ПанельЗакладок.ТекущаяСтраница = Элементы.ЗакладкаКодыМаркировки Тогда
		ТекущиеДанные = Элементы.КодыМаркировки.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущийКлючКода = ТекущиеДанные.КлючКода;
		КонецЕсли;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуРедактораКодаМаркировки(ТекущийКлючКода, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюЗапросовВСервис(Команда)
	
	МодульКлиента().ОткрытьФормуИсторииЗапросовВСервис(ЭтаФорма, Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура НаполнитьАгрегатыВОдномЗаданииПриИзменении(Элемент)
	
	РегистрироватьАгрегатыПослеНаполнения = Ложь;
	УстановитьВидимостьПолей_НаполнениеАгрегатовНаТСД();
	
КонецПроцедуры

// Дополнительные кнопки

&НаСервере
Процедура СформироватьДополнительныеКнопки()
	
	РазмещенияКнопок = МодульОбъекта().Перечисление_РазмещениеДополнительныхКнопок();
	
	// Шапка
	Действие = "Шапка_ДополнительнаяКнопкаНажатие";
	ГруппаКнопок = Элементы.ШапкаДопКнопки;
	НастройкиКнопок = МодульОбъекта().НастройкиДополнительныхКнопок(РазмещенияКнопок.ОперацияШапка, , ТипОперации);
	МодульОбъекта().ДобавитьНаФормуДополнительныеКнопки(ЭтаФорма, НастройкиКнопок, ГруппаКнопок, Действие);
	
	// Этикетки
	Действие = "Этикетки_ДополнительнаяКнопкаНажатие";
	ГруппаКнопок = Элементы.ЭтикеткиДопКнопки;
	НастройкиКнопок = МодульОбъекта().НастройкиДополнительныхКнопок(РазмещенияКнопок.ОперацияЭтикетки, , ТипОперации);
	МодульОбъекта().ДобавитьНаФормуДополнительныеКнопки(ЭтаФорма, НастройкиКнопок, ГруппаКнопок, Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура Шапка_ДополнительнаяКнопкаНажатие(Команда)
	
	РазмещенияКнопок = МодульКлиента().Перечисление_РазмещениеДополнительныхКнопок();
	
	ПараметрыНажатия = МодульКлиента().Новый_ПараметрыНажатияДопКнопки();
	ПараметрыНажатия.Размещение = РазмещенияКнопок.ОперацияШапка;
	ПараметрыНажатия.ВызывающаяФорма = ЭтаФорма;
	ПараметрыНажатия.ДопСведения.Операция = Ссылка;
	ПараметрыНажатия.ДопСведения.ДокументУчета = ДокументУчета;
	
	МодульКлиента().ПриНажатииДополнительнойКнопки(ПараметрыНажатия, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Этикетки_ДополнительнаяКнопкаНажатие(Команда)
	
	РазмещенияКнопок = МодульКлиента().Перечисление_РазмещениеДополнительныхКнопок();
	
	ПараметрыНажатия = МодульКлиента().Новый_ПараметрыНажатияДопКнопки();
	ПараметрыНажатия.Размещение = РазмещенияКнопок.ОперацияЭтикетки;
	ПараметрыНажатия.ВызывающаяФорма = ЭтаФорма;
	ПараметрыНажатия.ДопСведения.Операция = Ссылка;
	ПараметрыНажатия.ДопСведения.ДокументУчета = ДокументУчета;
	
	МодульКлиента().ПриНажатииДополнительнойКнопки(ПараметрыНажатия, Команда);
	
КонецПроцедуры


// #Область ИнформацияПоТовару

&НаКлиенте
Процедура КодыВходящегоУПДПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.КодыВходящегоУПД.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Стр = КорневаяСтрокаДерева(ТекущиеДанные);
	
	// Реквизиты формы
	Если ЗначениеЗаполнено(ТекущиеДанные.GTIN) Тогда
		GTIN = ТекущиеДанные.GTIN;
	Иначе
		GTIN = Стр.GTIN;
	КонецЕсли;
	КодОСУ = Стр.КодОСУ;
	ТоварВходящегоУПД = НайтиТоварПоGTIN(GTIN);
	КоличествоПоТовару = Стр.КоличествоКодов;
	НаименованиеТовараВходящегоУПД = Стр.НаименованиеТовара;
	
	КодОСУВалидный = Стр.КодОСУВалидный;
	РазрешенаОтгрузкаПоОСУ = Стр.РазрешенаОтгрузкаПоОСУ;
	ЗарегистрированВГИСМТ = Стр.ЗарегистрированВГИСМТ;
	ВсегоКодов = Стр.КоличествоКодов;
	КодовСОшибками = Стр.КодовСОшибками;
	Отсканировано = Стр.Отсканировано;
	КорректныйФорматКода = ТекущиеДанные.КорректныйФорматКода <> Ложь;
	
	ЕстьGTIN = ЗначениеЗаполнено(GTIN);
	ЕстьОСУ = ЗначениеЗаполнено(КодОСУ);
	ЕстьКоды = ЗначениеЗаполнено(ВсегоКодов);
	ЕстьТовар = ЗначениеЗаполнено(ТоварВходящегоУПД);
	ЕстьКодыСОшибками = ЗначениеЗаполнено(КодовСОшибками);
	
	Если ЕстьКоды Тогда
		ПроцентОтсканировано = Цел(Отсканировано * 100 / ВсегоКодов);
		ОтсканированоПоТовару = МодульКлиента().ПараметрыВСтроку("%1/%2 (%3%)"
		, Отсканировано, ВсегоКодов, ПроцентОтсканировано);
	КонецЕсли;
	
	Если ЕстьТовар Тогда
		СтрокаЗаголовка = НСтр("ru = 'Товар в системе %1'");
		СтрокаЗаголовка = МодульКлиента().ПараметрыВСтроку(СтрокаЗаголовка, GTIN);
		Элементы.СсылкаНаТоварПоGTIN.Заголовок = СтрокаЗаголовка;
	КонецЕсли;
	
	Если ЕстьКодыСОшибками Тогда
		СтрокаЗаголовка = НСтр("ru = 'Недопустимых кодов маркировки: %1'");
		СтрокаЗаголовка = МодульКлиента().ПараметрыВСтроку(СтрокаЗаголовка, КодовСОшибками);
		Элементы.ДекорацияНедопустимыхКодовПоТовару.Заголовок = СтрокаЗаголовка;
	КонецЕсли;
	
	Элементы.ГруппаGTIN.Видимость = ЕстьGTIN;
	Элементы.ГруппаКодОСУ.Видимость = ЕстьОСУ;
	Элементы.ГруппаКоличество.Видимость = ЕстьКоды;
	Элементы.ГруппаОтсканировано.Видимость = ЕстьКоды;
	Элементы.СсылкаНаТоварПоGTIN.Видимость = ЕстьТовар;
	Элементы.ГруппаВидПродукции.Видимость = ЕстьТовар;
	Элементы.ДекорацияНедопустимыхКодовПоТовару.Видимость = ЕстьКодыСОшибками;
	Элементы.ДекорацияКодПоОСУНеверный.Видимость = ЕстьОСУ И Не КодОСУВалидный;
	Элементы.ДекорацияЗапрещенаПередачаПоОСУ.Видимость = ЕстьОСУ И Не РазрешенаОтгрузкаПоОСУ;
	Элементы.ДекорацияGTINНеЗарегистрирован.Видимость = ЕстьОСУ И Не ЗарегистрированВГИСМТ;
	Элементы.ДекорацияНеКорректныйФорматКода.Видимость = Не КорректныйФорматКода;
	
	ЭтаФорма.ТекущийЭлемент = Элементы.КодыВходящегоУПД;
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерСтроки", Стр.НомерСтроки);
	Элементы.Партии.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
КонецПроцедуры

&НаКлиенте
Функция КорневаяСтрокаДерева(СтрокаДерева)
	
	Родитель = СтрокаДерева.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		Возврат СтрокаДерева;
	Иначе
		Возврат КорневаяСтрокаДерева(Родитель);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция НайтиТоварПоGTIN(GTIN)
	
	Если Не ЗначениеЗаполнено(GTIN) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если КэшТоваров = Неопределено Тогда
		КэшТоваров = Новый Соответствие;
	КонецЕсли;
	
	Результат = Неопределено;
	
	Если Не КэшТоваров[GTIN] = Неопределено Тогда
		Результат = КэшТоваров[GTIN];
	Иначе
		
		Товар = НайтиТоварПоGTINНаСервере(GTIN);
		Если ЗначениеЗаполнено(Товар) Тогда
			Результат = Товар;
			КэшТоваров.Вставить(GTIN, Товар);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НайтиТоварПоGTINНаСервере(GTIN)
	
	Возврат МодульОбъекта().НайтиТоварПоGTIN(GTIN);
	
КонецФункции

&НаКлиенте
Процедура СсылкаНаТоварПоGTINНажатие(Элемент)
	
	МодульКлиента().ОткрытьФормуТовара(ТоварВходящегоУПД, ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти

// #Область ЗаказКодов

&НаКлиенте
Процедура ЗаполнитьТоварыПоКодуМаркировки(Команда)
	
	ЗаполнитьТоварыПоКодуМаркировкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоКодуМаркировкиНаСервере()
	
	ТипыЗаказаКодов = МодульОбъекта().Перечисление_ТипыЗаказаКодов();
		
	Если Не ЗначениеЗаполнено(КлючКода) Тогда
		ТекстОшибки = НСтр("ru='Не указан код маркировки для заполнения товаров заказа'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "КодМаркировки");
		Возврат;
	КонецЕсли;
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	ТаблицаКодов.Добавить().КлючКода = КлючКода;
	
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	Если ТипЗаказаКодов = ТипыЗаказаКодов.РазделениеТовара Тогда
		
		Если ТаблицаКодов[0].ОбщийТипУпаковки <> Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ЕдиницаТовара Тогда
			ТекстОшибки = НСтр("ru='Разделение товара доступно только для кодов единиц товара'");
			МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "КодМаркировки");
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипЗаказаКодов = ТипыЗаказаКодов.РасформированиеНабора Тогда
			
		Если ТаблицаКодов[0].ОбщийТипУпаковки <> Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.Набор Тогда
			ТекстОшибки = НСтр("ru='Маркировка товаров расформированного набора доступна только для кодов набора'");
			МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "КодМаркировки");
			Возврат;
		КонецЕсли;
		
		МодульОбъекта().ТаблицаКодов_ДобавитьКлючиВложенныхКодов(ТаблицаКодов);
		Если ТаблицаКодов.Количество() = 1 Тогда
			ТекстОшибки = НСтр("ru='Не удалось заполнить товары заказа, не найдены вложенные коды набора'");
			МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "КодМаркировки");
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	ПерезаполнитьТаблицыОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииЗаказКодовПриИзменении(Элемент)
	
	ВидПродукцииЗаказКодовПриИзмененииНаСервере();
	
	УстановитьПодсказкуФормы();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииЗаказКодовПриИзмененииНаСервере()
	
	Если Не МодульОбъекта().ВидПродукцииДопускаетУказаниеТипаЗаказаКодов(ВидПродукции, СпособВыпускаТоваров) Тогда
		ТипЗаказаКодов = Неопределено;
		ОчиститьКодМаркировки();
	КонецЕсли;
	
	ПерезаполнитьТаблицыОперации();
	ЗаполнитьТоварыВложеннымиТоварами();
	УстановитьВидимостьПолей_ЗаказКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииЗаказКодовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляЗаказаКодов(СпособВыпускаТоваров, ТипКодаМаркировки);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособВыпускаТоваровПриИзменении(Элемент)
	
	СпособВыпускаТоваровПриИзмененииНаСервере();
	
	УстановитьПодсказкуФормы();
	
КонецПроцедуры

&НаСервере
Процедура СпособВыпускаТоваровПриИзмененииНаСервере()
	
	СпособыВыпуска = МодульОбъекта().Перечисление_СпособыВыпускаТоваров();
	
	Если СпособВыпускаТоваров <> СпособыВыпуска.Остатки
		И СпособВыпускаТоваров <> СпособыВыпуска.Перемаркировка Тогда
		КарточкиТоваровПринадлежатДругойОрганизации = Ложь;
		ОчиститьСобственникТовараИНН();
	КонецЕсли;
	
	Если Не МодульОбъекта().ВидПродукцииДопускаетУказаниеТипаЗаказаКодов(ВидПродукции, СпособВыпускаТоваров) Тогда
		ТипЗаказаКодов = Неопределено;
		ОчиститьКодМаркировки();
	КонецЕсли;
	
	ПерезаполнитьТаблицыОперации();
	ЗаполнитьТоварыВложеннымиТоварами();
	ОбновитьПризнакОперацияОграниченаТарифом();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособВыпускаТоваровНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеСпособыВыпускаТоваров(ВидПродукции, ТипКодаМаркировки);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказатьКодыДляВложенныхТоваровПриИзменении(Элемент)
	
	ЗаказатьКодыДляВложенныхТоваровПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаказатьКодыДляВложенныхТоваровПриИзмененииНаСервере()
	
	ЗаполнитьТоварыВложеннымиТоварами();
	УстановитьВидимостьПолей_ЗаказКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКодаМаркировкиПриИзменении(Элемент)
	
	ЗаказатьКодыДляВложенныхТоваров = Ложь;
	
	ТипКодаМаркировкиПриИзмененииНаСервере();
	
	УстановитьПодсказкуФормы();
	
КонецПроцедуры

&НаСервере
Процедура ТипКодаМаркировкиПриИзмененииНаСервере()
	
	ПерезаполнитьТаблицыОперации();
	УстановитьВидимостьПолей_ЗаказКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКодаМаркировкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеТипыКодовМаркировки(СпособВыпускаТоваров, ВидПродукции);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКодовДляСервисПровайдераПриИзменении(Элемент)
	
	Если Не ЗаказКодовДляСервисПровайдера Тогда
		СервисПровайдер = Неопределено
	КонецЕсли;
	
	УстановитьВидимостьПолей_ЗаказКодов();
	УстановитьПодсказкуФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СервисПровайдерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("СервисПровайдерПослеВыбора", ЭтаФорма);
	МодульКлиента().ОткрытьФормуВыбораСервисПровайдера(ОписаниеОбработчика, СервисПровайдер, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СервисПровайдерПослеВыбора(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СервисПровайдер = РезультатВыбора;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СервисПровайдерОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(СервисПровайдер) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуСервисПровайдера(СервисПровайдер, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗаказаКодовПриИзменении(Элемент)
	
	ТипЗаказаКодовПриИзмененииНаСервере();
	УстановитьПодсказкуФормы();
	
КонецПроцедуры

&НаСервере
Процедура ТипЗаказаКодовПриИзмененииНаСервере()
	
	УстановитьВидимостьПолей_ЗаказКодов();
	ПерезаполнитьТаблицыОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗаказаКодовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеТипыЗаказаКодов(ВидПродукции);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура КарточкиТоваровПринадлежатДругойОрганизацииПриИзменении(Элемент)
	
	КарточкиТоваровПринадлежатДругойОрганизацииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КарточкиТоваровПринадлежатДругойОрганизацииПриИзмененииНаСервере()
	
	ОчиститьСобственникТовараИНН();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСобственникТовараИНН()
	
	Если Не КарточкиТоваровПринадлежатДругойОрганизации Тогда
		СобственникТовараИНН_Последний = СобственникТовараИНН;
		СобственникТовараИНН = "";
	Иначе
		СобственникТовараИНН = СобственникТовараИНН_Последний;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьКодМаркировки()
	
	КодМаркировки = Неопределено;
	КлючКода = Неопределено;
	
КонецПроцедуры

// #КонецОбласти ЗаказКодов

// #Область УведомлениеОПриемке

&НаСервере
Процедура УведомлениеОПриемке_ОтклонитьВсеНаСервере()
	
	ДатаПриемки = ТекущаяДатаСеанса();
	СтатусПриемки = МодульОбъекта().Перечисление_СтатусыПриемки().Отклонено;
	
	СохранитьИСоздатьЗадачу();
	
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеОПриемке_ОтклонитьВсе(Команда)
	
	Если ОперацияОграниченаТарифом Тогда
		МодульКлиента().ОткрытьФормуОграниченияПоТарифу(ЭтаФорма, Организация, ТипОперации);
		Возврат;
	КонецЕсли;
	
	Действие = НСтр("ru = 'Отклонить все'");
	Если Не МодульКлиента().ДоступенPATCHЗапрос(Действие) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаголовокВопроса = НСтр("ru = 'Отправить отказ в приемке входящего документа?'");
	ТекстВопроса = НСтр("ru = 'Уведомление об отказе будет отправлено в ГИС МТ ""Чесный Знак""'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да,  "Продолжить");
	Кнопки.Добавить(КодВозвратаДиалога.Нет, "Отмена");
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("УведомлениеОПриемке_ОтклонитьВсе_ПослеСогласия", ЭтаФорма);
	
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеОПриемке_ОтклонитьВсе_ПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УведомлениеОПриемке_ОтклонитьВсеНаСервере();
	
	МодульКлиента().ВыполнитьОбменПоОрганизации(ЭтаФорма, Организация);
	
	ЗаполнитьКонтекстФормыИУстановитьВидимость();
	
	Оповестить("КонтурМаркировка_Операция_Изменен");
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура УведомлениеОПриемке_ПринятьВсеНаСервере()
	
	ДатаПриемки = ТекущаяДатаСеанса();
	СтатусПриемки = МодульОбъекта().Перечисление_СтатусыПриемки().Принято;
	
	ДеревоСведенийОТоварах = РеквизитФормыВЗначение("СведенияОТоварах");
	СведенияОТоварах_ЗаполнитьСтатусПриемки(ДеревоСведенийОТоварах.Строки);
	МодульОбъекта().Операция_УведомлениеОПриемке_СведенияОТоварах_СохранитьВФайл(Ссылка, ДеревоСведенийОТоварах);
	
	СохранитьИСоздатьЗадачу();
	
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеОПриемке_ПринятьВсе(Команда)
	
	Если ОперацияОграниченаТарифом Тогда
		МодульКлиента().ОткрытьФормуОграниченияПоТарифу(ЭтаФорма, Организация, ТипОперации);
		Возврат;
	КонецЕсли;
	
	СтатусыОпераций = МодульКлиента().Перечисление_СтатусыОпераций();
	
	Если Не ПроверитьОбязательныеРеквизитыУведомленияОПриемке() Тогда
		Возврат;
	КонецЕсли;
	
	Действие = НСтр("ru = 'Принять все'");
	Если Не МодульКлиента().ДоступенPATCHЗапрос(Действие) Тогда
		Возврат;
	КонецЕсли;
	
	УведомлениеОПриемке_ПринятьВсеНаСервере();
	
	МодульКлиента().ВыполнитьОбменПоОрганизации(ЭтаФорма, Организация);
	
	ЗаполнитьКонтекстФормыИУстановитьВидимость();
	
	Оповестить("КонтурМаркировка_Операция_Изменен");
	
	Если ОсновнойСтатус <> СтатусыОпераций.ОшибкаОбработки Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УведомлениеОПриемке_ПринятьЧастичноНаСервере()
	
	ДатаПриемки = ТекущаяДатаСеанса();
	СтатусПриемки = МодульОбъекта().Перечисление_СтатусыПриемки().ПринятоЧастично;
	
	ДеревоСведенийОТоварах = РеквизитФормыВЗначение("СведенияОТоварах");
	СведенияОТоварах_ЗаполнитьСтатусПриемки(ДеревоСведенийОТоварах.Строки);
	МодульОбъекта().Операция_УведомлениеОПриемке_СведенияОТоварах_СохранитьВФайл(Ссылка, ДеревоСведенийОТоварах);
	
	СохранитьИСоздатьЗадачу();
	
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеОПриемке_ПринятьЧастично_ПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	УведомлениеОПриемке_ПринятьЧастичноНаСервере();
	
	МодульКлиента().ВыполнитьОбменПоОрганизации(ЭтаФорма, Организация);
	
	ЗаполнитьКонтекстФормыИУстановитьВидимость();
	
	Оповестить("КонтурМаркировка_Операция_Изменен");
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеОПриемке_ПринятьЧастично(Команда)
	
	Если ОперацияОграниченаТарифом Тогда
		МодульКлиента().ОткрытьФормуОграниченияПоТарифу(ЭтаФорма, Организация, ТипОперации);
		Возврат;
	КонецЕсли;
	
	ЭтоЧастичнаяПриемка = Истина;
	Если Не ПроверитьОбязательныеРеквизитыУведомленияОПриемке(ЭтоЧастичнаяПриемка) Тогда
		Возврат;
	КонецЕсли;
	
	Действие = НСтр("ru = 'Принять частично'");
	Если Не МодульКлиента().ДоступенPATCHЗапрос(Действие) Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыСверкиНаТСД = МодульКлиента().Перечисление_СтатусыСверкиНаТСД();
	
	Если СтатусСверкиНаТСД = СтатусыСверкиНаТСД.СверкаПроизведенаНетКодов
		Или СтатусСверкиНаТСД = СтатусыСверкиНаТСД.СверкаПроизведенаЧастично Тогда
		
		ЗаголовокВопроса = НСтр("ru = 'Подписание и отправка в ГИС МТ'");
		ТекстВопроса = НСтр("ru = 'Сверка кодов на ТСД произведена не полностью. Приняты
		|будут коды отсканированные и найденные в документе. Продолжить?'");
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, "Подписать и отправить");
		Кнопки.Добавить(КодВозвратаДиалога.Нет, "Отмена");
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("УведомлениеОПриемке_ПринятьЧастично_ПослеСогласия", ЭтаФорма);
		
		МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки, ЗаголовокВопроса);
		
	Иначе
		
		УведомлениеОПриемке_ПринятьЧастично_ПослеСогласия(КодВозвратаДиалога.Да);
		
	КонецЕсли;
		
		
КонецПроцедуры

&НаСервере
Процедура СведенияОТоварах_ЗаполнитьСтатусПриемки(СтрокиДерева)
	
	СтатусыПриемки = МодульОбъекта().Перечисление_СтатусыПриемки();
	СтатусыТовараНаСверке = МодульОбъекта().Перечисление_СтатусыТовараНаСверке();
	
	Для каждого СтрокаДЗ Из СтрокиДерева Цикл
		
		СведенияОТоварах_ЗаполнитьСтатусПриемки(СтрокаДЗ.Строки);
		
		Если Не ЗначениеЗаполнено(СтрокаДЗ.СтатусТовараНаСверке) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтатусПриемки = СтатусыПриемки.ПринятоЧастично Тогда
			СтрокаДЗ.Принято = (СтрокаДЗ.СтатусТовараНаСверке = СтатусыТовараНаСверке.НайденВДокументе);
		Иначе
			СтрокаДЗ.Принято = (СтрокаДЗ.СтатусТовараНаСверке = СтатусыТовараНаСверке.НайденВДокументе
			ИЛИ СтрокаДЗ.СтатусТовараНаСверке = СтатусыТовараНаСверке.НеОтсканированНаСкладе);
		КонецЕсли;
		
		Если СтрокаДЗ.Принято = Истина Тогда
			СтрокаДЗ.КартинкаПринято = 5;
		ИначеЕсли СтрокаДЗ.Принято = Ложь Тогда
			СтрокаДЗ.КартинкаПринято = 3;
		Иначе
			СтрокаДЗ.КартинкаПринято = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СведенияОТоварах_ДополнитьДаннымиТоваров(Знач СтрокиДерева = Неопределено)
	
	Если СтрокиДерева = Неопределено Тогда
		СтрокиДерева = СведенияОТоварах.ПолучитьЭлементы();
	КонецЕсли;
	
	Для каждого СтрокаДЗ Из СтрокиДерева Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДЗ.Товар) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаДЗ.КодТНВЭД) Тогда
			СтрокаДЗ.КодТНВЭД = СтрокаДЗ.Товар.КодТНВЭД;
		КонецЕсли;
		
		СтрокаДЗ.ПеременныйВес = СтрокаДЗ.Товар.ПеременныйВес;
		СтрокаДЗ.РазрешительнаяДокументация.ЗагрузитьЗначения(РазрешительнаяДокументацияПоТовару(СтрокаДЗ.Товар));
		
		СведенияОТоварах_ДополнитьДаннымиТоваров(СтрокаДЗ.ПолучитьЭлементы());
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОТоварах(ОписаниеОперации)
	
	ДеревоСведенийОТоварах = МодульОбъекта().Операция_УведомлениеОПриемке_СведенияОТоварах(ОписаниеОперации);
	
	СведенияОТоварах.ПолучитьЭлементы().Очистить();
	МодульОбъекта().ЗаполнитьДеревоФормыИзДереваЗначений(СведенияОТоварах, ДеревоСведенийОТоварах);
	
	СведенияОТоварах_ДополнитьДаннымиТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОТоварахВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТоварСсылка = Элемент.ТекущиеДанные.Товар;
	
	Если Поле.Имя = "СведенияОТоварахТовар" И ЗначениеЗаполнено(ТоварСсылка) Тогда
		МодульКлиента().ОткрытьФормуТовара(ТоварСсылка, ЭтаФорма);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОТоварахПередНачаломИзменения(Элемент, Отказ)
	
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	РодительСтроки = Элемент.ТекущиеДанные.ПолучитьРодителя();
	ЭтоКосметика = (ВидПродукции = МодульКлиента().Перечисление_ВидыПродукции().Косметика);
	ЭтоСтрокаТовара = ЗначениеЗаполнено(Элемент.ТекущиеДанные.Товар);
	ЭтоСтрокаКода = ЗначениеЗаполнено(Элемент.ТекущиеДанные.КодМаркировки);
	ЭтоСтрокаАгрегата = ЗначениеЗаполнено(Элемент.ТекущиеДанные.КодАгрегата);
	
	РедактированиеРазрешено = ЗначениеЗаполнено(Элемент.ТекущиеДанные.Товар)
	ИЛИ (РодительСтроки = Неопределено И ИмяЭлемента = "СведенияОТоварахКодТНВЭД")
	ИЛИ (ЭтоСтрокаКода И ИмяЭлемента = "СведенияОТоварахЦена")
	ИЛИ (ЭтоСтрокаКода И ИмяЭлемента = "СведенияОТоварахСуммаНДС")
	ИЛИ (ЭтоСтрокаТовара И ИмяЭлемента = "СведенияОТоварахРазрешительныеДокументы")
	ИЛИ (ЭтоСтрокаАгрегата И ИмяЭлемента = "СведенияОТоварахРазрешительныеДокументы" И Не ЭтоКосметика);
	
	Если Не РедактированиеРазрешено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОТоварахРазрешительныеДокументыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СведенияОТоварах.ТекущиеДанные;
	
	КонтекстФормы = МодульКлиента().Новый_ПараметрыФормыРедактированияСписка();
	КонтекстФормы.РазрешитьРедактирование = Истина;
	КонтекстФормы.Заголовок               = НСтр("ru = 'Разрешительные документы'");
	КонтекстФормы.ТипЗначений             = Тип("СправочникСсылка.КонтурМаркировка_РазрешительныеДокументы");
	КонтекстФормы.Список                  = ТекущиеДанные.РазрешительныеДокументы.ВыгрузитьЗначения();
	КонтекстФормы.ДоступныеЗначения       = ТекущиеДанные.РазрешительнаяДокументация.ВыгрузитьЗначения();
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения(
	"СведенияОТоварахРазрешительныеДокументыПослеВыбора", ЭтаФорма, ТекущиеДанные);
	
	МодульКлиента().ОткрытьФормуПросмотраСписка(ЭтаФорма, КонтекстФормы, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОТоварахРазрешительныеДокументыПослеВыбора(Результат, ТекущиеДанные) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().СвернутьМассивЛок(Результат, Истина);
	
	Если Не МодульКлиента().ЗначенияМассивовРавны(Результат, ТекущиеДанные.РазрешительныеДокументы.ВыгрузитьЗначения()) Тогда
		ТекущиеДанные.РазрешительныеДокументы.ЗагрузитьЗначения(Результат);
		ТекущиеДанные.РазрешительныеДокументыИзменены = Истина;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ВозвратВОборот

&НаКлиенте
Процедура ВидПродукцииВозвратВОборотНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляВозвратаВОборот();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииВозвратВОборотПриИзменении(Элемент)
	
	ПричинаВыводаИзОборота = "";
	ДопустимыеПричины = МодульКлиента().ДопустимыеПричиныВозвратаВОборот(ВидПродукции);
	Если ДопустимыеПричины.Количество() = 1 Тогда
		ПричинаВыводаИзОборота = ДопустимыеПричины[0];
	КонецЕсли;
	
	ВидПродукцииВозвратВОборотПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииВозвратВОборотПриИзмененииНаСервере()
	
	ПерезаполнитьТаблицыОперации();
	УстановитьВидимостьПолей_ВозвратВОборот();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаВозвратВОборотНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПервичныхДокументовДляВозвратаВОборот(ПричинаВозвратаВОборот);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаВозвратВОборотПриИзменении(Элемент)
	
	УстановитьВидимостьПолей_ВозвратВОборот();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидТранспортногоДокументаПриИзменении(Элемент)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти ВозвратВОборот

// #Область ОтчетОНанесении

&НаКлиенте
Процедура ТипОтчетаОНанесенииПриИзменении(Элемент)
	
	ТипОтчетаОНанесенииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТипОтчетаОНанесенииПриИзмененииНаСервере()
	
	ПерезаполнитьТаблицыОперации();
	УстановитьВидимостьПолей_ОтчетОНанесении();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОтчетаОНанесенииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеТипыОтчетаОНанесении(ВидПродукции, ТипОперации);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

// #КонецОбласти ОтчетОНанесении

// #Область ВводВОборот

&НаСервере
Функция ДопускаетсяУказаниеДатыПроизводстваВоВводеВОборот()
	
	Если Не МодульОбъекта().ВидПродукцииДопускаетДатуПроизводстваПриВводеВОборот(ВидПродукции) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВидыПродукции = МодульОбъекта().Перечисление_ВидыПродукции();
	СпособыВвода = МодульОбъекта().Перечисление_СпособыВводаВОборот();
	
	Если СпособВводаВОборот = СпособыВвода.ПроизводствоРФ Тогда
		Результат = Истина;
	ИначеЕсли СпособВводаВОборот = СпособыВвода.ИмпортФТС Тогда
		Результат = (ВидПродукции = ВидыПродукции.Молоко);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВидПродукцииДопускаетУказаниеПлощадкиПоТипуОперации()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	ВидыПродукции = МодульОбъекта().Перечисление_ВидыПродукции();
	
	Если ТипОперации = ТипыОпераций.ВводВОборот Тогда
		
		Результат = (ВидПродукции = ВидыПродукции.Пиво);
		
	ИначеЕсли МодульОбъекта().ЭтоОтчетОНанесении(ТипОперации) Тогда
		
		Результат = МодульОбъекта().ВидПродукцииДопускаетПлощадкуВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении);
		
	ИначеЕсли ТипОперации = ТипыОпераций.ВыводИзОборота Тогда
		
		Результат = МодульОбъекта().ВидПродукцииДопускаетПлощадкуВВыводеИзОборота(ВидПродукции, ПричинаВыводаИзОборота);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти ВводВОборот

// #Область УведомлениеОСостоянииКодов

&НаКлиенте
Процедура Коды_ИзменитьСостояние(Команда)
	
	ТипОперации = МодульКлиента().Перечисление_ТипыОпераций().УведомлениеОСостоянииКодов;
	Операция = МодульКлиента().Операция_Создать(ТипОперации, ДокументУчета, Ссылка);
	МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеКодовПриИзменении(Элемент)
	
	УстановитьВидимостьПолей_УведомлениеОСостоянииКодов();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОтменаВыводаИзОборота

&НаКлиенте
Процедура ОтменитьВыводИзОборота(Команда)
	
	Если ОперацияОграниченаТарифом Тогда
		МодульКлиента().ОткрытьФормуОграниченияПоТарифу(ЭтаФорма, Организация, ТипОперации);
		Возврат;
	КонецЕсли;
	
	ЗаголовокВопроса = НСтр("ru = 'Подписание и отправка в ГИС МТ'");
	ТекстВопроса = НСтр("ru = 'Документ на отмену вывода из оборота будет отправлен в ГИС МТ, продолжить?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, "Подписать и отправить");
	Кнопки.Добавить(КодВозвратаДиалога.Нет, "Отмена");
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ОтменитьВыводИзОборота_ПослеСогласия", ЭтаФорма);
	
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыводИзОборота_ПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьОперациюОтменыВыводаИзОборота();
	
	МодульКлиента().ВыполнитьОбменПоОрганизации(ЭтаФорма, Организация, ДокументУчета);
	
	ОтменитьВыводИзОборота_ПослеСогласияНаСервере();
	
	Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьВыводИзОборота_ПослеСогласияНаСервере()
	
	ЗаполнитьКонтекстФормы();
	УстановитьВидимостьПоСтатусу();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОперациюОтменыВыводаИзОборота()
	
	ТипОперации = МодульОбъекта().Перечисление_ТипыОпераций().ОтменаВыводаИзОборота;
	ОперацияОтмены = МодульОбъекта().Операция_Создать(ТипОперации, ДокументУчета,Ссылка);
	
	МодульОбъекта().Задача_Создать(ОперацияОтмены);
	
КонецПроцедуры

// #КонецОбласти

// #Область РегистрацияНаборов

&НаКлиенте
Процедура ТипНабораНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().Перечисление_ТипыНаборов();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипНабораПриИзменении(Элемент)
	
	ПерезаполнитьТаблицыОперации();
	
КонецПроцедуры

// #КонецОбласти

// #Область ПараметрыОперацииПечати

&НаКлиенте
Процедура Коды_ЗаполнитьОперациюПечати(Команда)
	
	Если Не ПроверитьВозможностьПечати() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОперациюПечати();
	
	Если КоличествоКодов = 0 Тогда
		МодульКлиента().СообщитьПользователюЛок(НСтр("ru = 'Не удалось подобрать коды для печати'"), УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьПечати()
	
	Если Не ПечатьИзСвободногоОстатка
		Или ЗначениеЗаполнено(ОперацияОснование) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Укажите параметры заполнения печати кодами'");
	
	ЕстьОтборПоТовару = (ЗначениеЗаполнено(Товар) И ЗначениеЗаполнено(КоличествоКодовТребуется));
	ЕстьОтборПоНоменклатуре1С = (ЗначениеЗаполнено(КлючНоменклатуры1С) И ЗначениеЗаполнено(КоличествоКодовТребуется));
	
	Если Не ЗначениеЗаполнено(Товар)
		И Не ЗначениеЗаполнено(КлючНоменклатуры1С)
		И Не ЗначениеЗаполнено(КоличествоКодовТребуется) Тогда
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, "Товар");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоличествоКодовТребуется) Тогда
		МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, "КоличествоКодовТребуется");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОперациюПечати()
	
	ОписаниеОперации = ОписаниеОперацииПоКонтекстуФормы();
	
	Если Модифицированность Тогда
		СохранитьОперацию(ОписаниеОперации);
	КонецЕсли;
	
	МодульОбъекта().Операция_ЗаполнитьКодами(ОписаниеОперации);
	
	ЗаполнитьШаблоныЭтикеток();
	ПосчитатьКоличествоСтрокТаблицФормы();
	ЗаполнитьПараметрыПечатиЭтикетокПоШаблону();
	НастроитьЭлементыФормы_ПечатьКодов();
	ОбновитьСписокКодовМаркировки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблоныЭтикеток()
	
	ОписаниеОперации = ОписаниеОперацииПоКонтекстуФормы();
	МодульОбъекта().Операция_ПечатьКодов_ЗаполнитьШаблоныЭтикеток(ОписаниеОперации);
	ЗаполнитьКонтекстФормы(ОписаниеОперации);
	СохранитьОперацию(ОписаниеОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоКодовТребуетсяПриИзменении(Элемент)
	
	НастроитьЭлементыФормы_ПечатьКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоКодовТребуетсяИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.КоличествоКодовТребуется.ЦветТекста = Новый Цвет();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписьНастройкиСортировкиЭтикеток(ПараметрыСортировки = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ПараметрыСортировки) Тогда
		ПараметрыСортировки = Новый_ПараметрыСортировкиЭтикеток();
		ЗаполнитьЗначенияСвойств(ПараметрыСортировки, ЭтаФорма);
	КонецЕсли;
	
	ЕстьНастройкиСортировки = ЗначениеЗаполнено(ПараметрыСортировки.ПолеСортировкиЭтикеток1);
	
	Элементы.НастройкиСортировкиЭтикеток.Видимость = ЕстьНастройкиСортировки;
	Если НЕ ЕстьНастройкиСортировки Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонОписанияСортировки = НСтр("ru='Сортировка: %1'");
	ПредставлениеНастроек = МодульОбъекта().ПредставлениеСортировкиЭтикеток(ПараметрыСортировки);
	
	Элементы.НастройкиСортировкиЭтикеток.Заголовок = МодульОбъекта().ПараметрыВСтроку(ШаблонОписанияСортировки, ПредставлениеНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииТрансофрмацияАгрегатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляТрансформацииАгрегата();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииАТКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляФормированияАТК();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаТНВЭДПриИзменении(Элемент)
	
	ПерезаполнитьТаблицыОперации();
	
КонецПроцедуры

// #КонецОбласти

// #Область КорректировкаСведенийОКодах

&НаКлиенте
Процедура ВидПродукцииКорректировкаСведенийОКодахНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыПродукцииДляКорректировкиСведенийОКодах();
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииКорректировкаСведенийПриИзменении(Элемент)
	
	ДопустимыеВидыСведений = МодульКлиента().ДопустимыеВидыКорректируемыхСведенийОКодах(ВидПродукции);
	Если ДопустимыеВидыСведений.Найти(ВидКорректируемыхСведений) = Неопределено Тогда
		ВидКорректируемыхСведений = Неопределено;
	КонецЕсли;
	
	ВидПродукцииКорректировкаСведенийПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииКорректировкаСведенийПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(ДокументУчета) Или ЗначениеЗаполнено(ОперацияОснование) Тогда
		ПерезаполнитьТаблицыОперации();
	КонецЕсли;
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииКорректировкаСведенийОКодахПослеВыбора(ВыбранноеЗначение, ДопРеквизит = Неопределено) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидПродукции = ВыбранноеЗначение.Значение;
	
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКорректируемыхСведенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначенияСписка = МодульКлиента().ДопустимыеВидыКорректируемыхСведенийОКодах(ВидПродукции);
	МодульКлиента().ЗаполнитьСписокВыбора(Элемент.СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКорректируемыхСведенийПриИзменении(Элемент)
	
	ВидКорректируемыхСведенийПриИзмененииНаСервере();
	
	УстановитьПодсказкуФормы();
	
КонецПроцедуры

&НаСервере
Процедура ВидКорректируемыхСведенийПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(ДокументУчета)
		Или ЗначениеЗаполнено(ОперацияОснование) Тогда
		ПерезаполнитьТаблицыОперации();
	КонецЕсли;
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКодыИзОперации(Команда)
	
	Если Не ЗначениеЗаполнено(Элементы.КодыМаркировки.ВыделенныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Выбранные коды будут удалены из операции, продолжить?'");
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("УдалитьКодыИзОперацииПослеСогласия", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКодыИзОперацииПослеСогласия(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьКодыИзОперацииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКодыИзОперацииНаСервере()
	
	КлючиКодов = Новый Массив;
	Для каждого Стр Из Элементы.КодыМаркировки.ВыделенныеСтроки Цикл
		КлючиКодов.Добавить(Стр.КлючКода);
	КонецЦикла;
	
	МодульОбъекта().КодыОпераций_УдалитьКоды(Ссылка, КлючиКодов);
	
	ОбновитьСписокКодовМаркировки();
	ЗаполнитьКонтекстФормы();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОпросыПользователей

&НаКлиенте
Процедура ПровестиОпросПользователяИЗакрыть()
	
	КлючСценария = КлючСценарияПоТипуОперации(ТипОперации);
	ОписаниеОпроса = ОпросПользователяПоСценарию(КлючСценария);
	
	Если ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеОпросаПользователя", ЭтаФорма);
		МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма, ОписаниеОбработчика);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОпросаПользователя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Функция КлючСценарияПоТипуОперации(ТипОперации)
	
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	
	СценарийПоТипуОперации = Новый Соответствие;
	СценарийПоТипуОперации.Вставить(ТипыОпераций.ЗаказКодов,               КлючиСценариев.ЗаказКодов);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.ОтчетОНанесении,          КлючиСценариев.ОтчетОНанесении);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.ВводВОборот,              КлючиСценариев.ВводВОборот);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.АгрегацияКодов,           КлючиСценариев.ДобавлениеКИТУ);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.РегистрацияАгрегатов,     КлючиСценариев.ДобавлениеКИТУ);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.РасформированиеАгрегатов, КлючиСценариев.РасформированиеКИТУ);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.ДобавлениеВАгрегат,       КлючиСценариев.ТрансформацияКИТУ);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.ИзъятиеИзАгрегата,        КлючиСценариев.ТрансформацияКИТУ);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.РегистрацияКИГУ,          КлючиСценариев.РегистрацияКИГУ);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.ОтчетОВыбытии,            КлючиСценариев.ОтчетОВыбытии);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.ВыводИзОборота,           КлючиСценариев.ВыводИзОборота);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.ВозвратВОборот,           КлючиСценариев.ВозвратВОборот);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.Перемаркировка,           КлючиСценариев.Перемаркировка);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.ПечатьКодов,              КлючиСценариев.Печать);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.ФормированиеАТК,          КлючиСценариев.ФормированиеАТК);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.РасформированиеАТК,       КлючиСценариев.РасформированиеАТК);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.ДобавлениеВАТК,           КлючиСценариев.ТрансформацияАТК);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.ИзъятиеИзАТК,             КлючиСценариев.ТрансформацияАТК);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.СообщениеОбОтгрузке,      КлючиСценариев.СообщениеОбОтгрузке);
	СценарийПоТипуОперации.Вставить(ТипыОпераций.РегистрацияНаборов,       КлючиСценариев.РегистрацияНаборов);
	
	Результат = СценарийПоТипуОперации.Получить(ТипОперации);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОпросПользователяПоСценарию(КлючСценария)
	
	Результат = МодульКлиента().ОпросПользователяПоСценарию(КлючСценария);
	
	Если Не ЗначениеЗаполнено(Результат)
		Или Не МодульКлиента().ОпросПодходитПоВидуПродукции(Результат, ВидПродукции) Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти

// #Область МобильныеУстройства

&НаКлиенте
Процедура ПодборСПомощьюМобильногоУстройстваПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(МобильноеУстройство)
		И Не ПодборСПомощьюМобильногоУстройства Тогда
		СтароеМобильноеУстройство = МобильноеУстройство;
		МобильноеУстройство = Неопределено;
	КонецЕсли;
	
	Если ПодборСПомощьюМобильногоУстройства Тогда
		МобильноеУстройство = СтароеМобильноеУстройство;
	КонецЕсли;
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаТекущееУстройство(Команда)
	
	Действие = НСтр("ru = 'Вернуть на текущее устройство'");
	Если Не МодульКлиента().ДоступенPATCHЗапрос(Действие) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Подсказка = НСтр("ru = 'Комментарий для сотрудника'");
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("Коды_ВозвратНаТСДПослеВводаКомментария", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВводаСтроки(ОписаниеОбработчика, , Подсказка, , Истина);
	
КонецПроцедуры

&НаСервере
Процедура ВернутьНаДругоеУстройствоНаСервере()
	
	СохранитьОперацию();
	
	МодульОбъекта().Операция_ВернутьКодыНаТСД(Ссылка, КомментарийВозвратаНаТСД);
	
	ЗаполнитьКонтекстФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДругоеУстройство(Команда)
	
	Действие = НСтр("ru = 'Вернуть на другое устройство'");
	Если Не МодульКлиента().ДоступенPATCHЗапрос(Действие) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ВернутьНаДругоеУстройство_РедактироватьДанныеПередОтправкой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДругоеУстройство_РедактироватьДанныеПередОтправкой()
	
	КонтекстФормы = Новый Структура;
	КонтекстФормы.Вставить("КомментарийВозвратаНаТСД", КомментарийВозвратаНаТСД);
	КонтекстФормы.Вставить("МобильноеУстройство", МобильноеУстройство);
	КонтекстФормы.Вставить("ВернутьНаДругоеУстройство", Ложь);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ОбработатьВозвратНаДругоеУстройство", ЭтаФорма);
	МодульКлиента().ОткрытьФормуРеквизитовДоставки(ЭтаФорма, КонтекстФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВозвратНаДругоеУстройство(НовыеЗначения, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(НовыеЗначения) Тогда
		Возврат;
	КонецЕсли;
	
	Если НовыеЗначения.МобильноеУстройство = МобильноеУстройство Тогда
		Возврат;
	КонецЕсли;
	
	Если Не НовыеЗначения.ВернутьНаДругоеУстройство Тогда
		Возврат;
	КонецЕсли;
	
	СтароеМобильноеУстройство = МобильноеУстройство;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, НовыеЗначения);
	
	Коды_ВозвратНаТСДНаСервере(КомментарийВозвратаНаТСД);
	
	Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
	
	Если ОсновнойСтатус <> МодульКлиента().Перечисление_СтатусыОпераций().ОшибкаОбработки Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НазначитьДругойТСДНаСервере()
	
	СохранитьОперацию();
	МодульОбъекта().Операция_НазначитьНаДругоеУстройство(Ссылка);
	ЗаполнитьКонтекстФормыИУстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьДругойТСД(Команда)
	
	Действие = НСтр("ru = 'Назначить на другое устройство'");
	Если Не МодульКлиента().ДоступенPATCHЗапрос(Действие) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МодульКлиента().ВыполнитьАвторизацию(Организация, ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	НазначитьДругойТСД_РедактироватьДанныеПередОтправкой();
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьДругойТСД_РедактироватьДанныеПередОтправкой()
	
	КонтекстФормы = Новый Структура;
	КонтекстФормы.Вставить("АдресДоставки", АдресДоставки);
	КонтекстФормы.Вставить("КонтрагентНаименование", КонтрагентНаименование);
	КонтекстФормы.Вставить("КонтактныйТелефон", КонтактныйТелефон);
	КонтекстФормы.Вставить("МобильноеУстройство", МобильноеУстройство);
	КонтекстФормы.Вставить("НазначитьНаДругоеУстройство", Ложь);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ОбработатьНазначениеНаДругойТСД", ЭтаФорма);
	МодульКлиента().ОткрытьФормуРеквизитовДоставки(ЭтаФорма, КонтекстФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНазначениеНаДругойТСД(НовыеЗначения, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(НовыеЗначения) Тогда
		Возврат;
	КонецЕсли;
	
	Если НовыеЗначения.МобильноеУстройство = МобильноеУстройство Тогда
		Возврат;
	КонецЕсли;
	
	Если Не НовыеЗначения.НазначитьНаДругоеУстройство Тогда
		Возврат;
	КонецЕсли;
	
	СтароеМобильноеУстройство = МобильноеУстройство;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, НовыеЗначения);
	
	Элементы.СсылкаИнформацияОДоставке.Заголовок = Заголовок_ИнформацияОДоставке();
	
	НазначитьДругойТСДНаСервере();
	
	Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
	
	Если ОсновнойСтатус <> МодульКлиента().Перечисление_СтатусыОпераций().ОшибкаОбработки Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьКодМаркировки(Команда)
	
	ПараметрыПроверкиКода = ПараметрыПроверкиКодаПоТипуОперации();
	Если ПараметрыПроверкиКода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВводаКодаМаркировки", ЭтаФорма);
	МодульКлиента().ОткрытьФормуДобавленияКодаМаркировки(ЭтаФорма, ОписаниеОбработчика, ПараметрыПроверкиКода, Организация, КлючКода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКодаМаркировки(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючКода = Результат.КлючКода;
	КодМаркировки = Результат.КодМаркировки;
	
	Если ЗначениеЗаполнено(КлючКода) И МодульКлиента().ЭтоТрансформацияАгрегата(ТипОперации) Тогда
		ВидПродукции = МодульКлиента().КодМаркировки_ВидПродукции(КлючКода);
	КонецЕсли;
	
	Если МодульКлиента().ЭтоОтчетОНанесении(ТипОперации) Тогда
		ПерезаполнитьТаблицыОперации();
	Иначе
		СохранитьОперацию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыПроверкиКодаПоТипуОперации()
	
	Результат = Новый Структура;
	Результат.Вставить("ПроверятьПолныйКод", Ложь);
	Результат.Вставить("ПроверятьСоставКода", Ложь);
	Результат.Вставить("ПеременноеКоличествоТовара");
	Результат.Вставить("ОбщийТипУпаковки");
	Результат.Вставить("ВидПродукции");
	Результат.Вставить("СтатусКода");
	
	СтатусыКодов = МодульКлиента().Перечисление_СтатусыКодов();
	ТипыОпераций = МодульКлиента().Перечисление_ТипыОпераций();
	ТипыЗаказаКодов = МодульКлиента().Перечисление_ТипыЗаказаКодов();
	ТипыОтчетаОНанесении = МодульКлиента().Перечисление_ТипыОтчетаОНанесении();
	
	ЭтоМаркировкаТоваровРасформированногоНабора = (ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РасформированиеНабора
		Или ТипЗаказаКодов = ТипыЗаказаКодов.РасформированиеНабора);
	ЭтоРазделениеТовара = (ТипОтчетаОНанесении = ТипыОтчетаОНанесении.РазделениеТовара
		Или ТипЗаказаКодов = ТипыЗаказаКодов.РазделениеТовара);
	
	Если МодульКлиента().ЭтоОтчетОНанесении(ТипОперации) Или ТипОперации = ТипыОпераций.ЗаказКодов Тогда
		Если ЭтоМаркировкаТоваровРасформированногоНабора Тогда
			ОбщийТипУпаковки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ОбщиеТипыУпаковок.Набор");
			Результат.ПроверятьСоставКода = Истина;
		КонецЕсли;
		Если ЭтоРазделениеТовара Тогда
			ОбщийТипУпаковки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ОбщиеТипыУпаковок.ЕдиницаТовара");
			Результат.ПеременноеКоличествоТовара = Истина;
			Результат.ПроверятьПолныйКод = Истина;
		КонецЕсли;
		СтатусКода = СтатусыКодов.ВведенВОборот;
	КонецЕсли;
	
	Если МодульКлиента().ЭтоТрансформацияАТК(ТипОперации) Тогда
		ОбщийТипУпаковки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ОбщиеТипыУпаковок.АТК");
		СтатусКода = СтатусыКодов.Нанесен;
	КонецЕсли;
	
	Если МодульКлиента().ЭтоТрансформацияАгрегата(ТипОперации) Тогда
		ОбщийТипУпаковки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ОбщиеТипыУпаковок.ТранспортнаяУпаковка");
		СтатусКода = СтатусыКодов.ВведенВОборот;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидПродукции) Тогда
		Результат.ВидПродукции = ВидПродукции;
	КонецЕсли;
	
	Результат.СтатусКода = СтатусКода;
	Результат.ОбщийТипУпаковки = ОбщийТипУпаковки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КодМаркировкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МодульКлиента().ОткрытьФормуКодаМаркировки(КлючКода, Организация, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидПервичногоДокумента()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	Если МодульОбъекта().ЭтоВозвратВОборот(ТипОперации) Тогда
		ДопустимыеВиды = МодульОбъекта().ДопустимыеВидыПервичныхДокументовДляВозвратаВОборот(ПричинаВозвратаВОборот);
	ИначеЕсли ТипОперации = ТипыОпераций.ВыводИзОборота Тогда
		ДопустимыеВиды = МодульОбъекта().ДопустимыеВидыПервичногоДокумента(ПричинаВыводаИзОборота);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ДопустимыеВиды.Найти(ВидПервичногоДокумента) = Неопределено Тогда
		ВидПервичногоДокумента = "";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидПервичногоДокумента) И ДопустимыеВиды.Количество() = 1 Тогда
		ВидПервичногоДокумента = ДопустимыеВиды[0];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПечатиЭтикетокПоШаблону()
	
	Если ТипОперации <> МодульОбъекта().Перечисление_ТипыОпераций().ПечатьКодов Тогда
		Возврат;
	КонецЕсли;
	
	Этикетки.Очистить();
	Этикетки.ОбластьПечати = Неопределено;
	Этикетки.КлючПараметровПечати = Неопределено;
	Этикетки.ОтображатьЗаголовки = Ложь;
	Этикетки.ОтображатьСетку = Ложь;
	Этикетки.ТолькоПросмотр = Истина;
	
	ПараметрыПечати = МодульОбъекта().Новый_ПараметрыПечатиЭтикеток();
	ПараметрыПечати.ТабличныйДокумент = Этикетки;
	
	Если ПечататьТоварныеЭтикетки Тогда
		ПараметрыПечати.ШаблоныЭтикеток.ШаблонТоварнойЭтикетки = ШаблонТоварнойЭтикетки;
	КонецЕсли;
	Если ПечататьГрупповыеЭтикетки Тогда
		ПараметрыПечати.ШаблоныЭтикеток.ШаблонГрупповойЭтикетки = ШаблонГрупповойЭтикетки;
	КонецЕсли;
	Если ПечататьЭтикеткиНаборов Тогда
		ПараметрыПечати.ШаблоныЭтикеток.ШаблонЭтикеткиНабора = ШаблонЭтикеткиНабора;
	КонецЕсли;
	Если ПечататьТранспортныеЭтикетки Тогда
		ПараметрыПечати.ШаблоныЭтикеток.ШаблонТранспортнойЭтикетки = ШаблонТранспортнойЭтикетки;
	КонецЕсли;
	
	МодульОбъекта().Этикетки_ЗаполнитьРазмерыСтраницы(ПараметрыПечати);
	
	ШиринаЭтикеткиПоШаблону = 0;
	ВысотаЭтикеткиПоШаблону = 0;
	
	ЗаполнитьРазмерЭтикетки();
	
	ШиринаЭтикеткиПоШаблону = ШиринаЭтикетки;
	ВысотаЭтикеткиПоШаблону = ВысотаЭтикетки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазмерЭтикетки()
	
	ШиринаЭтикетки = Этикетки.ШиринаСтраницы;
	ВысотаЭтикетки = Этикетки.ВысотаСтраницы;
	
	РазмерЭтикетки = "";
	Если ЗначениеЗаполнено(ШиринаЭтикетки) Тогда
		РазмерЭтикетки = Формат(ШиринаЭтикетки, "ЧФ='Ч мм'") + " x " + Формат(ВысотаЭтикетки, "ЧФ='Ч мм'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяФайлаДляСохраненияЭтикеток()
	
	Состав = "";
	Если ПечататьТоварныеЭтикетки Тогда
		Состав = Состав + "_unit";
	КонецЕсли;
	Если ПечататьГрупповыеЭтикетки Тогда
		Состав = Состав + "_group";
	КонецЕсли;
	Если ПечататьТранспортныеЭтикетки Тогда
		Состав = Состав + "_transport";
	КонецЕсли;
	
	Результат = "codes_" + Номер + "_" + Формат(Дата, "ДФ=dd-MM-yyyy") + Состав;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ШаблонЭтикеткиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ШаблонЭтикетки = ЭтаФорма[Элемент.Имя];
	
	Если ЗначениеЗаполнено(ШаблонЭтикетки) Тогда
		МодульКлиента().ОткрытьФормуШаблонаЭтикетки(ШаблонЭтикетки, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонТоварнойЭтикеткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("ШаблонЭтикеткиПослеВыбора", ЭтаФорма, Элемент);
	ТипЭтикетки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыЭтикеток.Товарная");
	МодульКлиента().ОткрытьФормуВыбораШаблонаЭтикетки(ПослеВыбора, ШаблонТоварнойЭтикетки, ТипЭтикетки, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонГрупповойЭтикеткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("ШаблонЭтикеткиПослеВыбора", ЭтаФорма, Элемент);
	ТипЭтикетки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыЭтикеток.Групповая");
	МодульКлиента().ОткрытьФормуВыбораШаблонаЭтикетки(ПослеВыбора, ШаблонГрупповойЭтикетки, ТипЭтикетки, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЭтикеткиНабораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("ШаблонЭтикеткиПослеВыбора", ЭтаФорма, Элемент);
	ТипЭтикетки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыЭтикеток.Набор");
	МодульКлиента().ОткрытьФормуВыбораШаблонаЭтикетки(ПослеВыбора, ШаблонЭтикеткиНабора, ТипЭтикетки, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонТранспортнойЭтикеткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("ШаблонЭтикеткиПослеВыбора", ЭтаФорма, Элемент);
	ТипЭтикетки = ПредопределенноеЗначение("Перечисление.КонтурМаркировка_ТипыЭтикеток.Транспортная");
	МодульКлиента().ОткрытьФормуВыбораШаблонаЭтикетки(ПослеВыбора, ШаблонТранспортнойЭтикетки, ТипЭтикетки, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЭтикеткиПослеВыбора(РезультатВыбора, Элемент) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма[Элемент.Имя] = РезультатВыбора;
	
	ШаблонЭтикеткиПриИзменении(Элемент);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЭтикеткиПриИзменении(Элемент)
	
	ШаблонЭтикеткиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ШаблонЭтикеткиПриИзмененииНаСервере()
	
	ЗаполнитьПараметрыПечатиЭтикетокПоШаблону();
	НастроитьЭлементыФормы_ПечатьКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьШаблоныПриИзменении(Элемент)
	
	ПечататьШаблоныПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПечататьШаблоныПриИзмененииНаСервере()
	
	ЗаполнитьПараметрыПечатиЭтикетокПоШаблону();
	НастроитьЭлементыФормы_ПечатьКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтикеткиПриИзменении(Элемент)
	
	ЭтикеткиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЭтикеткиПриИзмененииНаСервере()
	
	Если НРег(Этикетки.РазмерСтраницы) = "letter" Тогда
		Этикетки.РазмерСтраницы = "Custom";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШиринаЭтикеткиПоШаблону) Тогда
		Этикетки.ШиринаСтраницы = ШиринаЭтикеткиПоШаблону;
		Этикетки.ВысотаСтраницы = ВысотаЭтикеткиПоШаблону;
	Иначе
		Этикетки.ШиринаСтраницы = ШиринаЭтикетки;
		Этикетки.ВысотаСтраницы = ВысотаЭтикетки;
	КонецЕсли;
	
	ЗаполнитьРазмерЭтикетки();
	НастроитьЭлементыФормы_ПечатьКодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНомераСкважинНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ТоварыНомераСкважинПослеВыбора", ЭтаФорма, Элемент);
	
	КонтекстФормы = МодульКлиента().Новый_ПараметрыФормыРедактированияСписка();
	
	КонтекстФормы.РазрешитьРедактирование = Истина;
	КонтекстФормы.Заголовок               = НСтр("ru = 'Номера скважин'");
	КонтекстФормы.ТипЗначений             = Тип("Строка");
	КонтекстФормы.Список                  = МодульКлиента().РазделитьСтроку(Элемент.ТекстРедактирования, ",");
	
	МодульКлиента().ОткрытьФормуПросмотраСписка(ЭтаФорма, КонтекстФормы, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНомераСкважинПослеВыбора(Результат, Элемент) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомераСкважинСтрокой = МодульКлиента().СоединитьСтроку(Результат, ", ");
	
	Элементы.Товары.ТекущиеДанные.НомераСкважин = НомераСкважинСтрокой;
	
	ТоварыНомераСкважинПриИзменении(Элемент);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНомераСкважинПриИзменении(Элемент)
	
	МодульКлиента().НормализоватьНомераСкважин(Элементы.Товары.ТекущиеДанные.НомераСкважин);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФормуПослеРедактированияРеквизитов(НовыеЗначения, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(НовыеЗначения) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, НовыеЗначения);
	
	Элементы.СсылкаКонтрагентИННКПП.Заголовок = Заголовок_ИННКПП();
	Элементы.СсылкаИнформацияОДоставке.Заголовок = Заголовок_ИнформацияОДоставке();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаКонтрагентИННКППНажатие(Элемент)
	
	КонтекстФормы = Новый Структура;
	КонтекстФормы.Вставить("ТолькоПросмотр", РежимТолькоПросмотр);
	КонтекстФормы.Вставить("ЗаголовокРедактирования", "ИНН/КПП");
	КонтекстФормы.Вставить("КонтрагентНаименование", КонтрагентНаименование);
	КонтекстФормы.Вставить("КонтрагентИНН", КонтрагентИНН);
	КонтекстФормы.Вставить("КонтрагентКПП", КонтрагентКПП);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ОбновитьФормуПослеРедактированияРеквизитов", ЭтаФорма);
	МодульКлиента().ОткрытьФормуРеквизитовДоставки(ЭтаФорма, КонтекстФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаИнформацияОДоставкеНажатие(Элемент)
	
	КонтекстФормы = Новый Структура;
	КонтекстФормы.Вставить("ТолькоПросмотр", РежимТолькоПросмотр);
	КонтекстФормы.Вставить("ЗаголовокРедактирования", "Информация о доставке");
	КонтекстФормы.Вставить("АдресДоставки", АдресДоставки);
	КонтекстФормы.Вставить("КонтрагентНаименование", КонтрагентНаименование);
	КонтекстФормы.Вставить("КонтактныйТелефон", КонтактныйТелефон);
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ОбновитьФормуПослеРедактированияРеквизитов", ЭтаФорма);
	МодульКлиента().ОткрытьФормуРеквизитовДоставки(ЭтаФорма, КонтекстФормы, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаПодробнееОМобильныхУстройствахНажатие(Элемент)
	МодульКлиента().ОткрытьИнформациюОМобильныхУстройствах();
КонецПроцедуры

&НаКлиенте
Процедура МобильноеУстройствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТолькоНазначенныеЗадания", Истина);
	ПараметрыФормы.Вставить("ТекущееУстройство", МобильноеУстройство);
	
	МодульКлиента().ОткрытьФормуОбработкиЛок("Форма_МобильныеУстройства_Список", Элемент, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура МобильноеУстройствоОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(МобильноеУстройство) Тогда
		МодульКлиента().ОткрытьФормуМобильноеУстройство(МобильноеУстройство, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Площадка) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуПлощадки(Площадка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("ПлощадкаПослеВыбора", ЭтаФорма);
	МодульКлиента().ОткрытьФормуВыбораПлощадки(Обработчик, Площадка, Организация, ВидПродукции, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкаПослеВыбора(РезультатВыбора, ДопПараметр = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Площадка = РезультатВыбора;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматКодовПодсказкаНажатие(Элемент)
	
	МодульКлиента().ОткрытьСправкуФорматыКодов();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьКнопкиПоискаДля82()
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
		Элементы.КодыМаркировкиКнопкиПоискаДля82.Видимость = Истина;
		Элементы.АгрегатыВПакетеКнопкиПоискаДля82.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварПоКлючуНоменклатуры1С(ИдентификаторСтроки)
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	Стр = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если Не ЗначениеЗаполнено(Стр.КлючНоменклатуры1С)
		И (ТипОперации = ТипыОпераций.ОтчетОНанесении
		Или ТипОперации = ТипыОпераций.ВводВОборот) Тогда
		Возврат;
	КонецЕсли;
	
	МассивТоваров = МодульОбъекта().ПодходящиеТоварыМаркировки(Стр.КлючНоменклатуры1С, Организация);
	
	Стр.Товар = Неопределено;
	Если МассивТоваров.Количество() = 1 Тогда
		Стр.Товар = МассивТоваров[0];
	КонецЕсли;
	
	ЗаполнитьСтрокуТоваровДаннымиИБ(Стр);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуТоваровДаннымиИБ(Стр)
	
	ЗаполнитьВСтрокеТоваровКодТНВЭД(Стр);
	ЗаполнитьВСтрокеТоваровВложенныйТовар(Стр);
	ЗаполнитьВСтрокеТоваровРазрешительнуюДокументацию(Стр);
	
	Стр.ЭтоКег = Неопределено;
	Стр.ТребуетсяЗСН = Неопределено;
	Стр.ПеременныйВес = Неопределено;
	Стр.ТипКодаМаркировки = Неопределено;
	Стр.ЕдиницаМаркировки = Неопределено;
	Стр.НоминальноеКоличество = Неопределено;
	Стр.СрокГодностиМеньше72Часов = Неопределено;
	Стр.ПодлежитВетеринарномуКонтролю = Неопределено;
	
	Если МодульОбъекта().Интеграция_Номенклатура1С_ЕстьАртикул() Тогда
		Стр.Артикул = МодульОбъекта().КлючНоменклатуры1С_Артикул(Стр.КлючНоменклатуры1С);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Стр.Товар) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеТовара = МодульОбъекта().Товар_Прочитать(Стр.Товар);
	
	ВидыПродукции = МодульОбъекта().Перечисление_ВидыПродукции();
	ТипыСроковГодности = МодульОбъекта().Перечисление_ТипыСроковГодности();
	ТипыКодовМаркировки = МодульОбъекта().Перечисление_ТипыКодовМаркировки();
	
	ТоварСоСрокомГодностиМеньше72 = (ОписаниеТовара.ТипСрокаГодности = ТипыСроковГодности.СрокГодностиМеньше72);
	
	Если ОписаниеТовара.ТипКодаМаркировки = ТипыКодовМаркировки.ГрупповаяУпаковка Тогда
		ДопустимоУказаниеСрокаГодности = 
		МодульОбъекта().ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесенииДляКИГУ(ОписаниеТовара.ВидПродукции, ТипОтчетаОНанесении);
	ИначеЕсли ОписаниеТовара.ТипКодаМаркировки = ТипыКодовМаркировки.Набор Тогда
		ДопустимоУказаниеСрокаГодности = 
		МодульОбъекта().ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесенииДляКИН(ОписаниеТовара.ВидПродукции, ТипОтчетаОНанесении);
	Иначе
		ДопустимоУказаниеСрокаГодности = 
		МодульОбъекта().ВидПродукцииДопускаетСрокГодностиВОтчетеОНанесении(ОписаниеТовара.ВидПродукции, ТипОтчетаОНанесении);
	КонецЕсли;
	
	ПеременноеКоличество = ОписаниеТовара.ПеременныйВес;
	ВидПродукцииТребуетУказатьКоличество = МодульОбъекта().ВидПродукцииТребуетУказанияКоличестваВОтчетеОНанесении(ВидПродукции, ТипОтчетаОНанесении);
	
	Стр.ЕдиницаМаркировки = ОписаниеТовара.ЕдиницаМаркировки;
	Стр.ЭтоКег = ОписаниеТовара.ДопРеквизиты.ЭтоКег;
	Стр.ТребуетсяЗСН = ОписаниеТовара.ДопРеквизиты.ИспользоватьЗаводскойСН;
	Стр.ПеременныйВес = ПеременноеКоличество;
	Стр.НоминальноеКоличество = ОписаниеТовара.ДопРеквизиты.НоминальноеКоличество;
	Стр.СрокГодностиМеньше72Часов = ТоварСоСрокомГодностиМеньше72;
	Стр.ТипКодаМаркировки = ОписаниеТовара.ТипКодаМаркировки;
	Стр.ТребуетсяУказатьКоличество = (ПеременноеКоличество И ВидПродукцииТребуетУказатьКоличество);
	Стр.ДопустимоУказаниеСрокаГодности = ДопустимоУказаниеСрокаГодности;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВСтрокеТоваровКодТНВЭД(Стр)
	
	Стр.КодТНВЭД = Неопределено;
	
	Если Не ЗначениеЗаполнено(Стр.Товар) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	СпособыВыпуска = МодульОбъекта().Перечисление_СпособыВыпускаТоваров();
	
	Если ТипОперации = ТипыОпераций.ФормированиеАТК Тогда
		Стр.КодТНВЭД = Стр.Товар.КодТНВЭД;
	КонецЕсли;
	
	Если ТипОперации = ТипыОпераций.ВводВОборот
		И МодульОбъекта().СпособВводаВОборотТребуетТНВЭД(СпособВводаВОборот) Тогда
		Стр.КодТНВЭД = Стр.Товар.КодТНВЭД;
	КонецЕсли;
	
	Если ТипОперации = ТипыОпераций.ЗаказКодов
		И СпособВыпускаТоваров = СпособыВыпуска.Перемаркировка Тогда
		Стр.КодТНВЭД = Стр.Товар.КодТНВЭД;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыВложеннымиТоварами()
	
	Для Каждого Стр Из Товары Цикл
		ЗаполнитьВСтрокеТоваровВложенныйТовар(Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВСтрокеТоваровВложенныйТовар(Стр)
	
	Стр.ВложенныйТовар = Неопределено;
	Стр.КоличествоКодовВложенногоТовара = Неопределено;
	
	Если Не ЗаказатьКодыДляВложенныхТоваров
		Или Не ЗначениеЗаполнено(Стр.Товар) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Стр.Товар.ВложенныйТовар) Тогда
		Возврат;
	КонецЕсли;
	
	Стр.ВложенныйТовар = Стр.Товар.ВложенныйТовар;
	Стр.КоличествоУпаковокВложенногоТовара = Стр.КоличествоУпаковок * Стр.Товар.КоличествоВложений;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВСтрокеТоваровРазрешительнуюДокументацию(Стр)
	
	Если Не ДопускаетсяУказаниеРазрешительнойДокументации() Тогда
		Возврат;
	КонецЕсли;
	
	РазрешительнаяДокументация = РазрешительнаяДокументацияПоТовару(Стр.Товар);
	
	Стр.РазрешительнаяДокументация.ЗагрузитьЗначения(РазрешительнаяДокументация);
	
	Если Не МодульОбъекта().МассивСодержитЗначение(РазрешительнаяДокументация, Стр.РазрешительныйДокумент) Тогда
		Стр.РазрешительныйДокумент = МодульОбъекта().Товар_ОсновнойРазрешительныйДокумент(Стр.Товар);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИННПроизводителяИСобственникаТовара()
	
	ОписаниеОперации = ОписаниеОперацииПоКонтекстуФормы();
	
	МодульОбъекта().Операция_ЗаполнитьПроизводительИСобственникТовараИНН(ОписаниеОперации);
	
	ПроизводительИНН = ОписаниеОперации.ДопРеквизиты.ПроизводительИНН;
	СобственникТовараИНН = ОписаниеОперации.ДопРеквизиты.СобственникТовараИНН;
	
КонецПроцедуры

&НаКлиенте
Процедура Операция_Записать(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьОперацию();
	
	ОповеститьОбИзменении(Ссылка);
	Оповестить("КонтурМаркировка_Операция_Изменен", ДокументУчета);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСрокиГодностиПоДатеПроизводстваВШапкеНаСервере()
	
	ТипыСроковГодности = МодульОбъекта().Перечисление_ТипыСроковГодности();
	ПересчитатьАльтСроки = (ТипСрокаГодности = ТипыСроковГодности.СрокГодностиБольше72СУсловием);
	
	Для Каждого Стр Из Товары Цикл
		Если Не ЗначениеЗаполнено(Стр.ДатаПроизводства) Тогда
			ПересчитатьСрокиГодностиТовара(Стр, ДатаПроизводства, ПересчитатьАльтСроки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСрокиГодностиТовара(СтрокаТовара, ПарамДатаПроизводства, ПересчитатьАльтСроки)
	
	Если ТипЗнч(СтрокаТовара) = Тип("Число") Тогда
		Стр = Товары.НайтиПоИдентификатору(СтрокаТовара);
	Иначе
		Стр = СтрокаТовара;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Стр.Товар)
		Или Не ЗначениеЗаполнено(ПарамДатаПроизводства)
		Или Не Стр.ДопустимоУказаниеСрокаГодности Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСрокаГодности = МодульОбъекта().Товар_ДатаСрокаГодности(Стр.Товар, ПарамДатаПроизводства);
	Если ЗначениеЗаполнено(ДатаСрокаГодности) Тогда
		Стр.ДатаСрокаГодности = ДатаСрокаГодности;
	КонецЕсли;
	
	Если ПересчитатьАльтСроки Тогда
		
		УсловияХранения = Стр.Товар.УсловияХранения;
		Отбор = Новый Структура("КлючСтрокиОперации", Стр.КлючСтрокиОперации);
		Для Каждого АльтСрок Из АльтернативныеСрокиГодности.НайтиСтроки(Отбор) Цикл
			Условие = УсловияХранения.Найти(АльтСрок.Тип, "Тип");
			Если Условие <> Неопределено И ЗначениеЗаполнено(Условие.СрокХранения) Тогда
				АльтСрок.ДатаСрокаГодности = ПарамДатаПроизводства + Условие.СрокХранения * МодульОбъекта().СекундВСутках();
			КонецЕсли;
		КонецЦикла;
		
		ОбновитьПризнакЗаполненияАльтернативныхСроковГодности(ЭтаФорма, Стр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПризнакЗаполненияАльтернативныхСроковГодности(Форма, СтрТовара)
	
	АльтСроки = АльтСрокиГодностиТовара(Форма, СтрТовара.КлючСтрокиОперации);
	
	Если Не ЗначениеЗаполнено(АльтСроки) Тогда
		СтрТовара.АльтернативныйСрокГодностиЗаполнен = Ложь;
		Возврат;
	КонецЕсли;
	
	СтрТовара.АльтернативныйСрокГодностиЗаполнен = Истина;
	Для каждого Элемент Из АльтСроки Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			СтрТовара.АльтернативныйСрокГодностиЗаполнен = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СписокТиповКодовМаркировкиКИНКИГУ()
	
	Результат = Новый СписокЗначений;
	Результат.Добавить(Перечисления.КонтурМаркировка_ТипыКодовМаркировки.ГрупповаяУпаковка);
	Результат.Добавить(Перечисления.КонтурМаркировка_ТипыКодовМаркировки.Набор);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЕстьОграничениеЗаказаКодов(ОписаниеТарифа)
	
	Результат = Ложь;
	
	Если ТипОперации <> МодульОбъекта().Перечисление_ТипыОпераций().ЗаказКодов Тогда
		Возврат Результат;
	КонецЕсли;
	
	СпособыВыпуска = МодульОбъекта().Перечисление_СпособыВыпускаТоваров();
	
	Если СпособВыпускаТоваров = СпособыВыпуска.Перемаркировка
		Или СпособВыпускаТоваров = СпособыВыпуска.МаркировкаВнеПроизводстваИлиИмпорта Тогда
		Сервис = МодульОбъекта().Перечисление_СервисыПодписок().ЗаказКодовПеремаркировка;
		Результат = Не МодульОбъекта().СервисДоступенПоТарифу(Сервис, ОписаниеТарифа);
	Иначе
		Результат = Не МодульОбъекта().ОперацияДоступнаПоТарифу(ТипОперации, ОписаниеТарифа);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЕстьОграничениеОтчетаОНанесении(ОписаниеТарифа)
	
	Результат = Ложь;
	
	Если ТипОперации <> МодульОбъекта().Перечисление_ТипыОпераций().ОтчетОнанесении Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЕстьКодыСоСпособомВыпускаПеремаркировка() Тогда
		Сервис = МодульОбъекта().Перечисление_СервисыПодписок().Перемаркировка;
		Если Не МодульОбъекта().СервисДоступенПоТарифу(Сервис, ОписаниеТарифа) Тогда
			Результат = Истина;
		КонецЕсли;
	Иначе
		Если Не МодульОбъекта().ОперацияДоступнаПоТарифу(ТипОперации, ОписаниеТарифа) Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОписаниеПараметровПечатиДляМетрики()
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаполненТовар", ЗначениеЗаполнено(Товар));
	Результат.Вставить("ЗаполненаНоменклатура1С", ЗначениеЗаполнено(КлючНоменклатуры1С));
	Результат.Вставить("КоличествоКодовТребуется", КоличествоКодовТребуется);
	Результат.Вставить("КоличествоКодовПодобрано", КоличествоКодов);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОчиститьПлощадкуДляНеподходящихПричинВыводаИзОборота()
	
	Если Не МодульОбъекта().ВидПродукцииДопускаетПлощадкуВВыводеИзОборота(ВидПродукции, ПричинаВыводаИзОборота) Тогда
		Площадка = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьКодыСоСтатусомВыпущен()
	
	СтатусВыпущен = МодульОбъекта().Перечисление_СтатусыКодов().Выпущен;
	
	Возврат МодульОбъекта().КодыОпераций_ЕстьКодыВСтатусе(Ссылка, СтатусВыпущен);
	
КонецФункции

&НаСервере
Функция ЕстьКодыСоСпособомВыпускаПеремаркировка()
	
	СпособВыпускаПеремаркировка = МодульОбъекта().Перечисление_СпособыВыпускаТоваров().Перемаркировка;
	
	Возврат МодульОбъекта().КодыОпераций_ЕстьКодыСоСпособамиВыпуска(Ссылка, СпособВыпускаПеремаркировка);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВидАгрегата()
	
	Если ТипОперации <> МодульОбъекта().Перечисление_ТипыОпераций().НаполнениеАгрегатовНаТСД Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидАгрегата.Организация <> Организация Тогда
		ВидАгрегата = МодульОбъекта().Организация_ОсновнойВидАгрегата(Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция Новый_ПараметрыСортировкиЭтикеток()
	
	Возврат МодульОбъекта().Новый_ПараметрыСортировкиЭтикеток();
	
КонецФункции

&НаСервере
Функция РазрешительнаяДокументацияПоТовару(Товар)
	
	Результат = Новый Массив;
	
	Для Каждого Стр Из Товар.РазрешительнаяДокументация Цикл
		Если Стр.РазрешительныйДокумент.Активен Тогда
			Результат.Добавить(Стр.РазрешительныйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДопускаетсяУказаниеРазрешительнойДокументации()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	ВидыСведений = МодульОбъекта().Перечисление_ВидыКорректируемыхСведений();
	
	Если ТипОперации = ТипыОпераций.ВводВОборот
		Или ТипОперации = ТипыОпераций.Перемаркировка Тогда
		Результат = МодульОбъекта().ВидПродукцииДопускаетУказаниеРазрешительнойДокументации(ВидПродукции);
	ИначеЕсли ТипОперации = ТипыОпераций.ВозвратВОборот Тогда
		Результат = МодульОбъекта().ВидПродукцииДопускаетУказаниеРазрешительнойДокументации(ВидПродукции)
					И МодульОбъекта().ПричинаВозвратаВОборотДопускаетУказаниеРазрешительнойДокументации(ПричинаВозвратаВОборот);
	ИначеЕсли ТипОперации = ТипыОпераций.КорректировкаСведенийОКодах Тогда
		Результат = (ВидКорректируемыхСведений = ВидыСведений.РазрешительныйДокумент);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #Область РедактированиеОперации

&НаКлиенте
Процедура НачатьРедактированиеОперации(Команда)
	
	НачатьРедактированиеОперацииНаСервере();
	УстановитьПодсказкуФормы();
	
КонецПроцедуры

&НаСервере
Процедура НачатьРедактированиеОперацииНаСервере()
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	Если ТипОперации = ТипыОпераций.ОтчетОНанесенииНаТСД Тогда
		МодульОбъекта().ОчередьОбмена_ОтчетОНанесенииНаТСД_НачатьРедактирование(Ссылка);
	КонецЕсли;
	
	ЗаполнитьКонтекстФормы();
	УстановитьВидимостьПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеОперации(Команда)
	
	ЗавершитьРедактированиеОперацииНаСервере();
	УстановитьПодсказкуФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьРедактированиеОперацииНаСервере()
	
	СохранитьОперацию();
	
	ТипыОпераций = МодульОбъекта().Перечисление_ТипыОпераций();
	
	Если ТипОперации = ТипыОпераций.ОтчетОНанесенииНаТСД Тогда
		МодульОбъекта().ОчередьОбмена_ОтчетОНанесенииНаТСД_ЗавершитьРедактирование(Ссылка);
	КонецЕсли;
	
	ЗаполнитьКонтекстФормы();
	УстановитьВидимостьПоСтатусу();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПризнакОперацияОграниченаТарифом()
	
	ОперацияОграниченаТарифом = Ложь;
	
	Если Не ПроверитьДоступностьОперацииПоТарифу() Тогда
		ОперацияОграниченаТарифом = Истина;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти // РедактированиеОперации

// #КонецОбласти // СлужебныеПроцедурыИФункции
