#Область API

// Функция - Использование учета серий по товарам
// Определяет использование серий для переданных товаров.
// Используется регистр сведений "вмс_СоединениеОбъектов" с отбором по схеме "Использование учета серий по товарам"
//
// Параметры:
//  Товары	 -Массив, СправочникСсылка.Номенклатура -товар или Массив товаров, для которых требуется определить ведется ли учет по сериям
//  Возвращает тип "ТаблицаЗначений" с колонками Товар|Используется, где "Используется (Истина или Ложь)" - признак
//  ведения учета по сериям
// 
// Возвращаемое значение:
//   -ТаблицаЗначений - таблица с колонками Товар|Используется, где "Используется (Истина или Ложь)" - признак ведения
//                                                                                                     учета по сериям
//
Функция ИспользованиеУчетаСерийПоТоварам(Товары) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СхемыСоединенияОбъектов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СхемыСоединения
	|ИЗ
	|	Справочник.вмс_СхемыСоединенияОбъектов КАК СхемыСоединенияОбъектов
	|ГДЕ
	|	СхемыСоединенияОбъектов.Наименование = &ИмяСхемыСоединения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	спрТовары.Ссылка КАК Товар,
	|	СоединениеОбъектов.ОбъектПриемник КАК Используется,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ1
	|ИЗ
	|	Справочник.Номенклатура КАК спрТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СоединениеОбъектов КАК СоединениеОбъектов
	|		ПО спрТовары.Ссылка = СоединениеОбъектов.ОбъектИсточник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СхемыСоединения КАК СхемыСоединения
	|		ПО (СоединениеОбъектов.Схема = СхемыСоединения.Ссылка)
	|ГДЕ
	|	спрТовары.Ссылка В(&Товары)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ1.Товар КАК Товар,
	|	МИНИМУМ(ВТ1.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_СамыйПриоритетный
	|ИЗ
	|	ВТ1 КАК ВТ1
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ1.Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ1.Товар КАК Товар,
	|	ВТ1.Используется КАК Используется
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ1 КАК ВТ1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СамыйПриоритетный КАК ВТ_СамыйПриоритетный
	|		ПО ВТ1.Товар = ВТ_СамыйПриоритетный.Товар
	|			И ВТ1.Приоритет = ВТ_СамыйПриоритетный.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спрТовары.Ссылка КАК Товар,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ.Используется, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Используется
	|ИЗ
	|	Справочник.Номенклатура КАК спрТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО спрТовары.Ссылка = ВТ.Товар
	|ГДЕ
	|	спрТовары.Ссылка В(&Товары)";
	
	ТекстШаблонаЗапросаПоРеквизиту = РК.ВычленитьСтроку(ТекстЗапроса, "ПОМЕСТИТЬ ВТ1", "////////////////////////////////////////////////////////////////////////////////", ";");
	ТекстШаблонаЗапросаПоРеквизиту = СокрЛП(ТекстШаблонаЗапросаПоРеквизиту);
	ТекстыЗапросовПоРеквизитам = Новый Массив;
	ТекстыЗапросовПоРеквизитам.Добавить(ТекстШаблонаЗапросаПоРеквизиту);
	
	ТекстШаблонаЗапросаПоРеквизиту = СтрЗаменить(ТекстШаблонаЗапросаПоРеквизиту, "ПОМЕСТИТЬ ВТ1" + Символы.ПС, "");
	
	МетаданныеТовара = Метаданные.Справочники.Номенклатура;
	МетаданныеСоединений = Метаданные.РегистрыСведений.вмс_СоединениеОбъектов;
	ДопустимыеТипыРеквизита = МетаданныеСоединений.Измерения.Найти("ОбъектИсточник").Тип.Типы();
	РеквизитыСвязи = Новый Массив;
	РеквизитыСвязи.Добавить("ВидНоменклатуры");
	РеквизитыСвязи.Добавить("КатегорияНоменклатуры");
	Приоритет = 2;
	Для Каждого РеквизитСвязи Из РеквизитыСвязи Цикл
		МетаданныеРеквизита = МетаданныеТовара.Реквизиты.Найти(РеквизитСвязи);
		Если МетаданныеРеквизита = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТипыРеквизита = МетаданныеРеквизита.Тип.Типы();
		ДоступныеТипыРеквизита = РК.ПересечениеМассивов(ТипыРеквизита, ДопустимыеТипыРеквизита);
		Если ДоступныеТипыРеквизита.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПриоритетСтрока = Формат(Приоритет, "ЧГ=0");
		ТекстЗапросаПоРеквизиту = ТекстШаблонаЗапросаПоРеквизиту;
		ТекстЗапросаПоРеквизиту = СтрЗаменить(ТекстЗапросаПоРеквизиту, "1 КАК Приоритет", ПриоритетСтрока + " КАК Приоритет");
		ТекстЗапросаПоРеквизиту = СтрЗаменить(ТекстЗапросаПоРеквизиту, "спрТовары.Ссылка = СоединениеОбъектов.ОбъектИсточник", "спрТовары." + РеквизитСвязи + " = СоединениеОбъектов.ОбъектИсточник");
		ТекстыЗапросовПоРеквизитам.Добавить(ТекстЗапросаПоРеквизиту);
		Приоритет = Приоритет + 1;
	КонецЦикла;
	
	ТекстЗапросовПоРеквизитам = РК.МассивВСтроку(ТекстыЗапросовПоРеквизитам, Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС);
	ТекстЗапросовПоРеквизитам = Символы.ПС + ТекстЗапросовПоРеквизитам + Символы.ПС;

	ТекстЗапроса = РК.ВрезатьСтроку(ТекстЗапроса, ТекстЗапросовПоРеквизитам, "ПОМЕСТИТЬ ВТ1", "////////////////////////////////////////////////////////////////////////////////", ";");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.УстановитьПараметр("ИмяСхемыСоединения", "Использование учета серий по товарам");
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаЗапроса;
	
КонецФункции    

// Функция - Получить серию. Гарантированно возвращает элемент справочника СерииНоменклатуры по переданным реквизитам.
//           Осуществляется поиск серии, если найти не удалось - создается новый экземпляр
//
// Параметры:
//  РеквизитыСерии -Структура -данные для поиска серии. (УТ11 - Номер, ГоденДо, ДатаПроизводства)
// 
// Возвращаемое значение:
//   -СправочникСсылка.СерииНоменклатуры - экземпляр справочника серии 
//
Функция ПолучитьСерию(знач РеквизитыСерии, АдаптироватьРеквизитыСерии=Истина) Экспорт

	//Если АдаптироватьРеквизитыСерии Тогда
	//	РеквизитыСерии = АдаптироватьРеквизитыСерии(РеквизитыСерии);
	//КонецЕсли;
	
	СсылкаНаСерию = НайтиСерию(РеквизитыСерии);
	
	Если СсылкаНаСерию = Неопределено Тогда
		НоваяСерия = Справочники.вмс_СерииНоменклатуры.СоздатьЭлемент();
		НоваяСерия.Заполнить(Неопределено);
		ЗаполнитьЗначенияСвойств(НоваяСерия, РеквизитыСерии);
		НоваяСерия.Наименование = ПолучитьПредставлениеСерии(РеквизитыСерии);
		НоваяСерия.Записать();
		СсылкаНаСерию = НоваяСерия.Ссылка;
	КонецЕсли;
	
	Возврат СсылкаНаСерию;
	
КонецФункции

// Функция - Найти серию. Ищет серию в справочнике "Серии номенклатуры" по переданным реквизитам.
//
// Параметры:
//  РеквизитыСерии	 -Структура  -данные для поиска серии. (УТ11 - Номер, ГоденДо, ДатаПроизводства)  
//  Возвращает "Неопределено", если серия не найдена, или "СправочникСсылка.СерияНоменклатуры" - найденный экземпляр серии.
// 
// Возвращаемое значение:
//   -Неопределено, СправочникСсылка.СерияНоменклатуры. 
//
Функция НайтиСерию(знач РеквизитыСерии, АдаптироватьРеквизитыСерии=Истина) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	//Если АдаптироватьРеквизитыСерии Тогда
	//	РеквизитыСерии = АдаптироватьРеквизитыСерии(РеквизитыСерии);
	//КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	НЕ СерииНоменклатуры.ПометкаУдаления
	|	И &Отборы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	МассивОтборов = Новый Массив;
	НомерПараметра = 0;
	Для Каждого Реквизит Из РеквизитыСерии Цикл
		НомерПараметра = НомерПараметра + 1;
		ИмяПараметра = "Параметр" + Формат(НомерПараметра, "ЧГ=0");
		МассивОтборов.Добавить("СерииНоменклатуры." + Реквизит.Ключ + " = &" + ИмяПараметра);
		Запрос.УстановитьПараметр(ИмяПараметра, Реквизит.Значение);
	КонецЦикла;
	
	ТекстОтборов = РК.МассивВСтроку(МассивОтборов, Символы.ПС + Символы.Таб + "И ");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отборы", ТекстОтборов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

// Ищет штрихкод с серией в справочнике ШК расширения
//
// Параметры:
//  ДанныеСерии - Структура - должны совпадать с реквизитами регистра ШК расширения  
//  Возвращает "Неопределено", если ШК не найден, или штрихкод - Строка
// 
// Возвращаемое значение:
//   -Неопределено, Строка. 
//
Функция НайтиСерийныйШК(ДанныеСерии) Экспорт
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	вмс_ШтрихкодыРасширенный.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК вмс_ШтрихкодыРасширенный
	|ГДЕ";
	
	ПервыйЭлемент = Истина;
	Для Каждого Элемент Из ДанныеСерии Цикл
		КлючТекст = Строка(Элемент.Ключ);
		Если КлючТекст = "Товар" Тогда
			КлючТекст = "Номенклатура";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + Символы.Таб + ?(ПервыйЭлемент, "вмс_ШтрихкодыРасширенный.", "И вмс_ШтрихкодыРасширенный.") + КлючТекст + " = &" + КлючТекст;
		Запрос.УстановитьПараметр(КлючТекст, Элемент.Значение);
		
		ПервыйЭлемент = Ложь;
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Штрихкод;	
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

// Функция - НайтиСериюПоШтрихкоду. Ищет серию в расширенном регистре штрихкодов по штрихкоду
//
// Параметры:
//  Штрихкод	 -Строка  - штрихкод серии
//  Возвращает "Неопределено", если серия не найдена, или "СправочникСсылка.СерияНоменклатуры" - найденный экземпляр серии.
// 
// Возвращаемое значение:
//   -Неопределено, СправочникСсылка.СерияНоменклатуры. 
//
Функция НайтиСериюПоШтрихкоду(Штрихкод) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ШтрихкодыРасширенный.Серия КАК Серия
		|ИЗ
		|	РегистрСведений.вмс_ШтрихкодыРасширенный КАК вмс_ШтрихкодыРасширенный
		|ГДЕ
		|	вмс_ШтрихкодыРасширенный.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой()  Тогда		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Серия;		
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьШтрихкодСерии(ДанныеСерии, РеквизитыСерии) Экспорт 
	
	Штрихкод = НайтиСерийныйШК(ДанныеСерии);
	
	Если Штрихкод = Неопределено Тогда
		Штрихкод = СформироватьШтрикходСерии(РеквизитыСерии);
		
		МенеджерЗаписи = РегистрыСведений.вмс_ШтрихкодыРасширенный.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Заполнить(Неопределено);
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеСерии);  
		МенеджерЗаписи.Штрихкод = Штрихкод;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - СформироватьШтрихкодСерии. Формирует штрихкод серии по основным используемым в учете реквизитам серии
//           (УТ11 - Номер, ГоденДо, ДатаПроизводства)
//
// Параметры:
//  РеквизитыСерии -Структура -данные для поиска серии. (УТ11 - Номер, ГоденДо, ДатаПроизводства)  
// 
// Возвращаемое значение:
//   -Строка - штрихкод серии по её реквизитам. 
//
Функция СформироватьШтрикходСерии(РеквизитыСерии) Экспорт
	
	Штрихкод = "";  
	
	Если РеквизитыСерии.Свойство("Номер") И РеквизитыСерии.Свойство("ГоденДо") Тогда
		Штрихкод = СокрЛП(РеквизитыСерии.Номер) + Формат(РеквизитыСерии.ГоденДо, "ДФ=""ддММггЧЧ""");  
	ИначеЕсли РеквизитыСерии.Свойство("Номер") Тогда  
		Штрихкод = СокрЛП(РеквизитыСерии.Номер);
	ИначеЕсли РеквизитыСерии.Свойство("ГоденДо") Тогда  	
		Штрихкод = Формат(РеквизитыСерии.ГоденДо, "ДФ=""ддММггЧЧ""") 
	Иначе
		Штрихкод = Формат(РеквизитыСерии.ДатаПроизводства, "ДФ=""ддММггЧЧ""")	
	КонецЕсли;  
	
	Возврат Штрихкод;
		
КонецФункции

//3.2.5 ZAD-48:
Функция СгенерироватьСлучайныйНомерСерии() Экспорт
	
	СИС = Новый СистемнаяИнформация;
	Идентификатор = лев(Формат(вмс_ОбщегоНазначенияСервер.ПреобразоватьИзЛюбойВ10(СИС.ИдентификаторКлиента, 16) , "ЧГ="), 4); 
	
	Уникум = Число(Идентификатор + формат(Число(ТекущаяУниверсальнаяДатаВМиллисекундах()) / 100, "ЧГ="));	
	Результат = вмс_ОбщегоНазначенияСервер.DecToAny(Уникум, 32);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Получить представление серии. Формирует представление серии по основным используемым в учете реквизитам
//           серии (УТ11 - Номер, ГоденДо, ДатаПроизводства)
//
// Параметры:
//  РеквизитыСерии -Структура -данные для поиска серии. (УТ11 - Номер, ГоденДо, ДатаПроизводства)  
// 
// Возвращаемое значение:
//   -Строка -представление серии по её реквизитам. 
//
Функция ПолучитьПредставлениеСерии(РеквизитыСерии) Экспорт
	
	ПредставлениеСерии = "";
	Связка = " ";
	
	// ТУ_Кошелев 28.03.25 - серии без номера называются "Серия От... До...", ранее отображались как "От... До... От... До..." 
	Если РеквизитыСерии.Свойство("Номер") Тогда
		ПредставлениеСерии = ПредставлениеСерии + Связка + РеквизитыСерии.Номер;
		
		Если РеквизитыСерии.Свойство("ДатаПроизводства") Тогда
			ПредставлениеСерии = ПредставлениеСерии + Связка + "от " + Формат(РеквизитыСерии.ДатаПроизводства, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Если РеквизитыСерии.Свойство("ГоденДо") Тогда
			ПредставлениеСерии = ПредставлениеСерии + Связка + "до " + Формат(РеквизитыСерии.ГоденДо, "ДФ=dd.MM.yyyy");
		КонецЕсли;
	Иначе
		ПредставлениеСерии = "Серия";
	КонецЕсли;
	
	ПредставлениеСерии = СокрЛ(ПредставлениеСерии);
	
	Возврат ПредставлениеСерии;
	
КонецФункции

Функция АдаптироватьРеквизитыСерии(РеквизитыСерии)

	АдаптированныеРеквизитыСерии = Новый Структура;
	
	Для Каждого РеквизитСерии Из РеквизитыСерии Цикл
		
		Если РеквизитСерии.Ключ="Номер" Тогда
			ИмяРеквизита = вмс_АдаптацияКонфигураций.ИмяРеквизитаНомерСерии();
		ИначеЕсли РеквизитСерии.Ключ="ВидНоменклатуры" Тогда
			ИмяРеквизита = вмс_АдаптацияКонфигураций.ИмяРеквизитаВладелецСерии();
		Иначе
			ИмяРеквизита = РеквизитСерии.Ключ;
		КонецЕсли;
		
		АдаптированныеРеквизитыСерии.Вставить(ИмяРеквизита, РеквизитСерии.Значение);
		
	КонецЦикла;
	
	Возврат АдаптированныеРеквизитыСерии;

КонецФункции

#КонецОбласти



