
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийЭлементовСпискаФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	КлючНоменклатуры1С = Неопределено;
	Если Копирование Тогда
		КлючНоменклатуры1С = Элемент.ТекущиеДанные.КлючНоменклатуры1С;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуКоэффициентаПересчета(КлючНоменклатуры1С, ЭтаФорма, Копирование);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	КлючНоменклатуры1С = Элемент.ТекущиеДанные.КлючНоменклатуры1С;
	
	МодульКлиента().ОткрытьФормуКоэффициентаПересчета(КлючНоменклатуры1С, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОписаниеКлюча = Новый Структура;
	ОписаниеКлюча.Вставить("КлючНоменклатуры1С", ВыбранноеЗначение);
	ПараметрыКонструктра = Новый Массив;
	ПараметрыКонструктра.Добавить(ОписаниеКлюча);
	ТипКлюча = "РегистрСведенийКлючЗаписи.КонтурМаркировка_КоэффициентыПересчета";
	
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = Новый(ТипКлюча, ПараметрыКонструктра);
	
КонецПроцедуры

// #КонецОбласти