///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Возвращает признак работы в режиме разделения данных по областям
// (технически это признак условного разделения).
// 
// Возвращает Ложь, если конфигурация не может работать в режиме разделения данных
// (не содержит общих реквизитов, предназначенных для разделения данных).
//
// Возвращаемое значение:
//  Булево - Истина, если разделение включено.
//         - Ложь,   если разделение выключено или не поддерживается.
//
&НаКлиенте
Функция РазделениеВключено() Экспорт

	//Если ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
	//	МодульРаботаВМоделиСервиса = ОбщийМодуль("РаботаВМоделиСервиса");
	//	Возврат МодульРаботаВМоделиСервиса.РазделениеВключено();
	//Иначе
		Возврат УИ_ГЕНЕРАЦИЯ_РазделениеВключено();
	//КонецЕсли;

КонецФункции

// Возвращает Истина, если "функциональная" подсистема существует в конфигурации.
// Предназначена для реализации вызова необязательной подсистемы (условного вызова).
//
// У "функциональной" подсистемы снят флажок "Включать в командный интерфейс".
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка - полное имя объекта метаданных подсистема
//                        без слов "Подсистема." и с учетом регистра символов.
//                        Например: "СтандартныеПодсистемы.ВариантыОтчетов".
//
// Пример:
//  Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
//  	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
//  	МодульВариантыОтчетов.<Имя метода>();
//  КонецЕсли;
//
// Возвращаемое значение:
//  Булево - Истина, если существует.
//
&НаКлиенте
Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ПодсистемаСуществует(ПолноеИмяПодсистемы);

КонецФункции

// Возвращает ссылку на общий модуль по имени.
//
// Параметры:
//  Имя          - Строка - имя общего модуля, например:
//                 "ОбщегоНазначения",
//                 "ОбщегоНазначенияКлиент".
//
// Возвращаемое значение:
//  ОбщийМодуль - общий модуль.
//
&НаКлиенте
Функция ОбщийМодуль(Имя) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ОбщийМодуль(Имя);

КонецФункции

// Возвращает серверный модуль менеджера по имени объекта.
&НаКлиенте
Функция СерверныйМодульМенеджера(Имя)
	Возврат УИ_ГЕНЕРАЦИЯ_СерверныйМодульМенеджера(Имя);
КонецФункции

// Возвращает признак возможности обращения к разделенным данным (которые входят в состав разделителей).
// Признак относится к сеансу, но может меняться во время работы сеанса, если разделение было включено
// в самом сеансе, поэтому проверку следует делать непосредственно перед обращением к разделенным данным.
// 
// Возвращает Истина, если конфигурация не может работать в режиме разделения данных
// (не содержит общих реквизитов, предназначенных для разделения данных).
//
// Возвращаемое значение:
//   Булево - Истина, если разделение не поддерживается, либо разделение выключено,
//                    либо разделение включено и разделители    установлены.
//          - Ложь,   если разделение включено и разделители не установлены.
//
&НаКлиенте
Функция ДоступноИспользованиеРазделенныхДанных() Экспорт

	//Если ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
	//	МодульРаботаВМоделиСервиса = ОбщийМодуль("РаботаВМоделиСервиса");
	//	Возврат МодульРаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных();
	//Иначе
		Возврат УИ_ГЕНЕРАЦИЯ_ДоступноИспользованиеРазделенныхДанных();
	//КонецЕсли;

КонецФункции

// Определяет, что эта информационная база является подчиненным узлом
// распределенной информационной базы (РИБ).
//
// Возвращаемое значение: 
//  Булево - Истина, если эта информационная база является подчиненным узлом РИБ.
//
&НаКлиенте
Функция ЭтоПодчиненныйУзелРИБ() Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоПодчиненныйУзелРИБ();

КонецФункции

// Преобразует (сериализует) любое значение в XML-строку.
// Преобразованы в могут быть только те объекты, для которых в синтакс-помощнике указано, что они сериализуются.
// См. также ЗначениеИзСтрокиXML.
//
// Параметры:
//  Значение - Произвольный - значение, которое необходимо сериализовать в XML-строку.
//
// Возвращаемое значение:
//  Строка - XML-строка.
//
&НаКлиенте
Функция ЗначениеВСтрокуXML(Значение) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЗначениеВСтрокуXML(Значение);
КонецФункции

// Выполняет преобразование (десериализацию) XML-строки в значение.
// См. также ЗначениеВСтрокуXML.
//
// Параметры:
//  СтрокаXML - Строка - XML-строка, с сериализованным объектом.
//  Тип - ТипXDTO - тип значения, в который необходимо десериализовать XML-строку.
//                  Если параметр не указан, выполняется автоматическое определение типа.
//
// Возвращаемое значение:
//  Произвольный - значение, полученное из переданной XML-строки.
//
&НаКлиенте
Функция ЗначениеИзСтрокиXML(СтрокаXML, Тип = Неопределено) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЗначениеИзСтрокиXML(СтрокаXML,Тип);
КонецФункции


// Определяет режим эксплуатации информационной базы файловый (Истина) или серверный (Ложь).
// При проверке используется СтрокаСоединенияИнформационнойБазы, которую можно указать явно.
//
// Параметры:
//  СтрокаСоединенияИнформационнойБазы - Строка - параметр используется, если
//                 нужно проверить строку соединения не текущей информационной базы.
//
// Возвращаемое значение:
//  Булево - Истина, если файловая.
//
&НаКлиенте
Функция ИнформационнаяБазаФайловая(Знач СтрокаСоединенияИнформационнойБазы = "") Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ИнформационнаяБазаФайловая(СтрокаСоединенияИнформационнойБазы);

КонецФункции 

&НаКлиенте
Процедура УстановитьБезопасныйРежимБСП()
//	Если ПодсистемаСуществует("СтандартныеПодсистемы.ПрофилиБезопасности") Тогда
//		МодульРаботаВБезопасномРежиме = ОбщийМодуль("РаботаВБезопасномРежиме");
//		Если МодульРаботаВБезопасномРежиме.ИспользуютсяПрофилиБезопасности()
//			И Не МодульРаботаВБезопасномРежиме.УстановленБезопасныйРежим() Тогда
//
//			МодульРаботаВБезопасномРежиме = ОбщийМодуль("РаботаВБезопасномРежиме");
//			ПрофильИнформационнойБазы = МодульРаботаВБезопасномРежиме.ПрофильБезопасностиИнформационнойБазы();
//
//			Если ЗначениеЗаполнено(ПрофильИнформационнойБазы) Тогда
//
//				УстановитьБезопасныйРежим(ПрофильИнформационнойБазы);
//				Если БезопасныйРежим() = Истина Тогда
//					УстановитьБезопасныйРежим(Ложь);
//				КонецЕсли;
//
//			КонецЕсли;
//
//		КонецЕсли;
//	КонецЕсли;
КонецПроцедуры

// Выполнить экспортную процедуру объекта встроенного языка по имени.
// При включении профилей безопасности для вызова оператора Выполнить() используется
// переход в безопасный режим с профилем безопасности, используемом для информационной базы
// (если выше по стеку не был установлен другой безопасный режим).
//
// Параметры:
//  Объект    - Произвольный - объект встроенного языка 1С:Предприятия, содержащий методы (например, ОбработкаОбъект).
//  ИмяМетода - Строка       - имя экспортной процедуры модуля объекта обработки.
//  Параметры - Массив       - параметры передаются в процедуру <ИмяПроцедуры>
//                             в порядке расположения элементов массива.
//
&НаКлиенте
Процедура ВыполнитьМетодОбъекта(Знач Объект, Знач ИмяМетода, Знач Параметры = Неопределено) Экспорт
	
	// Проверка имени метода на корректность.
	УИ_ГЕНЕРАЦИЯ_ВыполнитьМетодОбъекта(Объект,ИмяМетода,Параметры);

КонецПроцедуры


// Выполнить экспортную процедуру по имени с уровнем привилегий конфигурации.
// При включении профилей безопасности для вызова оператора Выполнить() используется
// переход в безопасный режим с профилем безопасности, используемом для информационной базы
// (если выше по стеку не был установлен другой безопасный режим).
//
// Параметры:
//  ИмяМетода  - Строка - имя экспортной процедуры в формате
//                       <имя объекта>.<имя процедуры>, где <имя объекта> - это
//                       общий модуль или модуль менеджера объекта.
//  Параметры  - Массив - параметры передаются в процедуру <ИмяЭкспортнойПроцедуры>
//                        в порядке расположения элементов массива.
// 
// Пример:
//  Параметры = Новый Массив();
//  Параметры.Добавить("1");
//  ОбщегоНазначения.ВыполнитьМетодКонфигурации("МойОбщийМодуль.МояПроцедура", Параметры);
//
&НаКлиенте
Процедура ВыполнитьМетодКонфигурации(Знач ИмяМетода, Знач Параметры = Неопределено) Экспорт

	УИ_ГЕНЕРАЦИЯ_ВыполнитьМетодКонфигурации(ИмяМетода,Параметры);

КонецПроцедуры


// Проверяет, что переданное имя ИмяПроцедуры является именем экспортной процедуры конфигурации.
// Может использоваться для проверки, что переданная строка не содержит произвольного алгоритма
// на встроенном языке 1С:Предприятия перед использованием его в операторах Выполнить и Вычислить
// при их использовании для динамического вызова методов код конфигурации.
//
// В случае если переданная строка не является именем процедуры конфигурации, генерируется исключение.
//
// Предназначена для вызова из см. процедуру ВыполнитьМетодКонфигурации.
//
// Параметры:
//   ИмяПроцедуры - Строка - проверяемое имя экспортной процедуры.
//
&НаКлиенте
Процедура ПроверитьИмяПроцедурыКонфигурации(Знач ИмяПроцедуры)

	УИ_ГЕНЕРАЦИЯ_ПроверитьИмяПроцедурыКонфигурации(ИмяПроцедуры);

КонецПроцедуры

// Возвращает менеджер объекта по имени.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  Имя - Строка - имя например, "Справочник", "Справочники", "Справочник.Организации".
//
// Возвращаемое значение:
//  СправочникиМенеджер, СправочникМенеджер, ДокументыМенеджер, ДокументМенеджер, ...
// 
&НаКлиенте
Функция МенеджерОбъектаПоИмени(Имя)
	Перем КлассОМ, ИмяОМ, Менеджер;

	Возврат УИ_ГЕНЕРАЦИЯ_МенеджерОбъектаПоИмени(Имя);

КонецФункции

&НаКлиенте
Процедура ХранилищеСохранить(МенеджерХранилища, КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек,
	ИмяПользователя, ОбновитьПовторноИспользуемыеЗначения)

	УИ_ГЕНЕРАЦИЯ_ХранилищеСохранить(МенеджерХранилища,КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);

КонецПроцедуры

&НаКлиенте
Функция ХранилищеЗагрузить(МенеджерХранилища, КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию, ОписаниеНастроек,
	ИмяПользователя)

	Возврат УИ_ГЕНЕРАЦИЯ_ХранилищеЗагрузить(МенеджерХранилища,КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);

КонецФункции

&НаКлиенте
Процедура ХранилищеУдалить(МенеджерХранилища, КлючОбъекта, КлючНастроек, ИмяПользователя)

	УИ_ГЕНЕРАЦИЯ_ХранилищеУдалить(МенеджерХранилища,КлючОбъекта,КлючНастроек,ИмяПользователя);

КонецПроцедуры


// Возвращает строку ключа настроек, не превышающую допустимую длину 128 символов.
// Если указанная строка превышает 128, тогда вместо символов сверх 96 символов
// добавляется их хеш-сумма по алгоритму MD5 размером 32 символа.
//
// Параметры:
//  Строка - Строка - строка произвольной длины.
//
// Возвращаемое значение:
//  Строка - не более 128 символов.
//
&НаКлиенте
Функция КлючНастроек(Знач Строка)
	Возврат УИ_ГЕНЕРАЦИЯ_КлючНастроек(Строка);
КонецФункции

// Сокращает строку до нужной длины, при этом обрезанная часть хешируется,
// обеспечивая уникальность строки. Проверяет длину строки на входе и, в случае
// превышения максимальной длины, преобразует ее конец по алгоритму MD5 в
// уникальную строку из 32 символов.
//
// Параметры:
//  Строка            - Строка - исходная строка произвольной длины.
//  МаксимальнаяДлина - Число  - требуемое максимальное количество символов в строке,
//                               минимальное значение: 32.
// 
// Возвращаемое значение:
//   Строка - строка, не превышающая максимальную длину.
//
&НаКлиенте
Функция СократитьСтрокуКонтрольнойСуммой(Строка, МаксимальнаяДлина) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_СократитьСтрокуКонтрольнойСуммой(Строка,МаксимальнаяДлина);
КонецФункции

// Удаляет битые ссылки из переменной.
//
// Параметры:
//   СсылкаИлиКоллекция - ЛюбаяСсылка, Произвольный - Проверяемый объект или очищаемая коллекция.
//
// Возвращаемое значение: 
//   Булево - 
//       * Истина - СсылкаИлиКоллекция ссылочного типа и объект не найден в базе данных.
//       * Ложь - Когда СсылкаИлиКоллекция не ссылочного типа или объект найден в базе данных.
//
&НаКлиенте
Функция УдалитьБитыеСсылки(СсылкаИлиКоллекция)

	Возврат УИ_ГЕНЕРАЦИЯ_УдалитьБитыеСсылки(СсылкаИлиКоллекция);

КонецФункции

// Структура, содержащая значения реквизитов, прочитанные из информационной базы по ссылке на объект.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//                       требований к свойствам структуры.
//                       Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//                       псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                       значения (опционально) фактическое имя поля в таблице.
//                       Если ключ задан, а значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//                       к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя, и в случае,
//                                    - если есть ограничение на уровне записей, то все реквизиты вернутся 
//                                      со значением Неопределено;
//                                    - если нет прав для работы с таблицей, то возникнет исключение.
//                              - если Ложь, то возникнет исключение при отсутствии прав на таблицу 
//                                или любой из реквизитов.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//            - если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//            - если в параметр Ссылка передана пустая ссылка, то возвращается структура, 
//              соответствующая именам реквизитов со значениями Неопределено.
//            - если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//              то все реквизиты вернутся со значением Неопределено.
//
&НаКлиенте
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт
	
	// Если передано имя предопределенного. 
	Возврат УИ_ГЕНЕРАЦИЯ_ЗначенияРеквизитовОбъекта(Ссылка,Реквизиты,ВыбратьРазрешенные);

КонецФункции

// Значение реквизита, прочитанного из информационной базы по ссылке на объект.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  ИмяРеквизита       - Строка - имя получаемого реквизита.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя, и в случае,
//                                    - если есть ограничение на уровне записей, то возвращается Неопределено;
//                                    - если нет прав для работы с таблицей, то возникнет исключение.
//                              - если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//
// Возвращаемое значение:
//  Произвольный - зависит от типа значения прочитанного реквизита.
//               - если в параметр Ссылка передана пустая ссылка, то возвращается Неопределено.
//               - если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//                 то возвращается Неопределено.
//
&НаКлиенте
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита,ВыбратьРазрешенные);

КонецФункции 

// Выполняет поиск проверяемых выражений среди реквизитов объекта метаданных.
// 
// Параметры:
//  ПолноеИмяОбъектаМетаданных - Строка - полное имя проверяемого объекта.
//  ПроверяемыеВыражения       - Массив - имена полей или проверяемые выражения объекта метаданных.
// 
// Возвращаемое значение:
//  Структура - Результат проверки.
//  * Ошибка         - Булево - Найдена ошибка.
//  * ОписаниеОшибки - Строка - Описание найденных ошибок.
//
// Пример:
//  
// Реквизиты = Новый Массив;
// Реквизиты.Добавить("Номер");
// Реквизиты.Добавить("Валюта.НаименованиеПолное");
//
// Результат = ОбщегоНазначения.НайтиОшибкуДоступностиРеквизитовОбъекта("Документ._ДемоЗаказПокупателя", Реквизиты);
//
// Если Результат.Ошибка Тогда
//     ВызватьИсключение Результат.ОписаниеОшибки;
// КонецЕсли;
//
&НаКлиенте
Функция НайтиОшибкуДоступностиРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных, ПроверяемыеВыражения)

	Возврат УИ_ГЕНЕРАЦИЯ_НайтиОшибкуДоступностиРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных,ПроверяемыеВыражения);

КонецФункции

// Используется в НайтиОшибкуДоступностиРеквизитовОбъекта.
// Выполняет проверку доступности поля проверяемого выражения в источнике оператора схемы запроса.
//
&НаКлиенте
Функция ПолеИсточникаСхемыЗапросаДоступно(ИсточникОператора, ПроверяемоеВыражение)

	Возврат УИ_ГЕНЕРАЦИЯ_ПолеИсточникаСхемыЗапросаДоступно(ИсточникОператора,ПроверяемоеВыражение);

КонецФункции

// Возвращает Истина, если эта информационная база подключена к 1С:Fresh.
//
// Возвращаемое значение:
//  Булево - признак автономного рабочего места.
//
&НаКлиенте
Функция ЭтоАвтономноеРабочееМесто() Экспорт

//	Если ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
//		МодульОбменДаннымиСервер = ОбщийМодуль("ОбменДаннымиСервер");
//		Возврат МодульОбменДаннымиСервер.ЭтоАвтономноеРабочееМесто();
//	КонецЕсли;

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоАвтономноеРабочееМесто();

КонецФункции

&НаКлиенте
Функция ЕстьПравоНаИспользованиеИнструментов() Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ЕстьПравоНаИспользованиеИнструментов();
КонецФункции


#Область РаботаСФормамиИнструментов

&НаКлиенте
Процедура ДобавитьВКоманднуюПанельОбщиеКоманды(Форма, ОсновнаяКоманднаяПанельФормы)
	УИ_ГЕНЕРАЦИЯ_ДобавитьВКоманднуюПанельОбщиеКоманды(Форма,ОсновнаяКоманднаяПанельФормы);
КонецПроцедуры

&НаКлиенте
Процедура ФормаИнструментаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ОсновнаяКоманднаяПанельФормы = Неопределено) Экспорт
	УИ_ГЕНЕРАЦИЯ_ФормаИнструментаПриСозданииНаСервере(Форма,Отказ,СтандартнаяОбработка,ОсновнаяКоманднаяПанельФормы);
КонецПроцедуры

#КонецОбласти

#Область НастройкиИнструментов

&НаКлиенте
Функция ВариантРедактораКода1С() Экспорт
	
КонецФункции

&НаКлиенте
Процедура УстановитьВариантРедактораКода1С(НовыйВариант) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Возвращает исключения при поиске мест использования объектов.
//
// Возвращаемое значение:
//   Соответствие - Исключения поиска ссылок в разрезе объектов метаданных:
//       * Ключ - ОбъектМетаданных - Объект метаданных, для которого применяются исключения.
//       * Значение - Строка, Массив - описание исключенных реквизитов.
//           Если "*", то исключены все реквизиты объекта метаданных.
//           Если массив строк, то содержит относительные имена исключенных реквизитов.
//
&НаКлиенте
Функция ИсключенияПоискаСсылок() Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ИсключенияПоискаСсылок();

КонецФункции

// Подключает компоненту, выполненную по технологии Native API и COM.
// Компонента должна храниться в макете конфигурации в виде ZIP-архива.
//
// Параметры:
//  Идентификатор   - Строка - идентификатор объекта внешней компоненты.
//  ПолноеИмяМакета - Строка - полное имя макета конфигурации, хранящего ZIP-архив.
//
// Возвращаемое значение:
//  AddIn, Неопределено - экземпляр объекта внешней компоненты или Неопределено, если не удалось создать.
//
// Пример:
//
//  ПодключаемыйМодуль = ОбщегоНазначения.ПодключитьКомпонентуИзМакета(
//      "QRCodeExtension",
//      "ОбщийМакет.КомпонентаПечатиQRКода");
//
//  Если ПодключаемыйМодуль <> Неопределено Тогда 
//      // ПодключаемыйМодуль содержит созданный экземпляр подключенной компоненты.
//  КонецЕсли;
//
//  ПодключаемыйМодуль = Неопределено;
//
&НаКлиенте
Функция ПодключитьКомпонентуИзМакета(Идентификатор, ПолноеИмяМакета) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ПодключитьКомпонентуИзМакета(Идентификатор,ПолноеИмяМакета);

КонецФункции


// Возвращает описание предмета в виде текстовой строки.
// 
// Параметры:
//  СсылкаНаПредмет - ЛюбаяСсылка - объект ссылочного типа.
//
// Возвращаемое значение:
//   Строка - представление предмета.
// 
&НаКлиенте
Функция ПредметСтрокой(СсылкаНаПредмет) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ПредметСтрокой(СсылкаНаПредмет);

КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьОшибкуЗамены(Результат, Знач Ссылка, Знач ОписаниеОшибки)

	УИ_ГЕНЕРАЦИЯ_ЗарегистрироватьОшибкуЗамены(Результат,Ссылка,ОписаниеОшибки);

КонецПроцедуры

&НаКлиенте
Функция ОписаниеОшибкиЗамены(Знач ТипОшибки, Знач ОбъектОшибки, Знач ПредставлениеОбъектаОшибки, Знач ТекстОшибки)
	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеОшибкиЗамены(ТипОшибки,ОбъектОшибки,ПредставлениеОбъектаОшибки,ТекстОшибки);
КонецФункции

// Возвращает описание типа, включающего в себя все возможные ссылочные типы конфигурации.
//
// Возвращаемое значение:
//  ОписаниеТипов - все ссылочные типы конфигурации.
//
&НаКлиенте
Функция ОписаниеТипаВсеСсылки() Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеТипаВсеСсылки();

КонецФункции

#Область СравнениеОбъектов

&НаКлиенте
Процедура ДобавитьОбъектВМассивОбъектовКСравнению(МассивОБъектов, СсылкаНаОбъект)
	УИ_ГЕНЕРАЦИЯ_ДобавитьОбъектВМассивОбъектовКСравнению(МассивОБъектов,СсылкаНаОбъект);
КонецПроцедуры

&НаКлиенте
Функция КлючНастроекОбъектовКСравнению() Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_КлючНастроекОбъектовКСравнению();
КонецФункции

&НаКлиенте
Процедура ДобавитьМассивОбъектовКСравнению(Объекты) Экспорт
	УИ_ГЕНЕРАЦИЯ_ДобавитьМассивОбъектовКСравнению(Объекты);

КонецПроцедуры

&НаКлиенте
Функция ОбъектыДобавленныеКСравнению() Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектыДобавленныеКСравнению();
КонецФункции

&НаКлиенте
Процедура ОчиститьОбъектыДобавленныеКСравнению() Экспорт
	УИ_ГЕНЕРАЦИЯ_ОчиститьОбъектыДобавленныеКСравнению();
КонецПроцедуры

#КонецОбласти

#Область НастройкаОтладкаДополнительныхОтчетовИОбработок

&НаКлиенте
Функция КлючНастроекОтладкиДополнительныхОтчетовИОбработок() Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_КлючНастроекОтладкиДополнительныхОтчетовИОбработок();
КонецФункции

&НаКлиенте
Функция НовыйСтруктураНастройкиОтладкиДополнительнойОбработки() Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_НовыйСтруктураНастройкиОтладкиДополнительнойОбработки();
КонецФункции

&НаКлиенте
Функция НастройкиОтладкиДополнительнойОбработки(ДополнительнаяОбработка) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_НастройкиОтладкиДополнительнойОбработки(ДополнительнаяОбработка);
КонецФункции

&НаКлиенте
Процедура ЗаписатьНастройкиОтладкиДополнительнойОбработки(ДополнительнаяОбработка, Настройки) Экспорт
	УИ_ГЕНЕРАЦИЯ_ЗаписатьНастройкиОтладкиДополнительнойОбработки(ДополнительнаяОбработка,Настройки);

КонецПроцедуры

#КонецОбласти

#Область ДанныеВБазе

////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции для работы с данными в базе.

// Производит замену ссылок во всех данных. После замены неиспользуемые ссылки опционально удаляются.
// Замена ссылок происходит с транзакциями по изменяемому объекту и его связям, не по анализируемой ссылке.
// При вызове в неразделенном сеансе не выявляет ссылок в разделенных областях.
//
// Параметры:
//   ПарыЗамен - Соответствие - пары замен.
//       * Ключ     - ЛюбаяСсылка - что ищем (дубль).
//       * Значение - ЛюбаяСсылка - на что заменяем (оригинал).
//       Ссылки сами на себя и пустые ссылки для поиска будут проигнорированы.
//   
//   Параметры - Структура - Необязательный. Параметры замены.
//       
//       * СпособУдаления - Строка - необязательный. Что делать с дублем после успешной замены.
//           ""                - по умолчанию. Не предпринимать никаких действий.
//           "Пометка"         - помечать на удаление.
//           "Непосредственно" - удалять непосредственно.
//       
//       * УчитыватьПрикладныеПравила - Булево - необязательный. Режим проверки параметра ПарыЗамен.
//           Истина - по умолчанию. Проверять каждую пару "дубль-оригинал" (вызывается функция
//                    ВозможностьЗаменыЭлементов модуля менеджера).
//           Ложь   - отключить прикладные проверки пар.
//       
//       * ПараметрыЗаписи.ЗаписьВРежимеЗагрузки  - Булево - необязательный. 
//			Режим записи мест использования при замене дублей на оригиналы.
//           Истина - по умолчанию. Места использования дублей записываются в режиме ОбменДанными.Загрузка = Ложь.
//           Ложь   - запись ведется в режиме ОбменДанными.Загрузка = Истина.
//       
//       * ЗаменаПарыВТранзакции - Булево - необязательный. Определяет размер транзакции.
//           Истина - по умолчанию. Транзакция охватывает все места использования одного дубля. Может быть очень ресурсоемко 
//                    в случае большого количества мест использований.
//           Ложь   - замена каждого места использования выполняется в отдельной транзакции.
//       
//       * ПараметрыЗаписи.ПривелигированныйРежим - Булево - необязательный. 
//			Требуется ли устанавливать привилегированный режим перед запись.
//           Ложь   - по умолчанию. Записывать с текущими правами.
//           Истина - записывать в привилегированном режиме.
//
// Возвращаемое значение:
//   ТаблицаЗначений - неуспешные замены (ошибки).
//       * Ссылка - ЛюбаяСсылка - ссылка, которую заменяли.
//       * ОбъектОшибки - Произвольный - объект - причина ошибки.
//       * ПредставлениеОбъектаОшибки - Строка - строковое представление объекта ошибки.
//       * ТипОшибки - Строка - тип ошибки:
//           "ОшибкаБлокировки"  - при обработке ссылки некоторые объекты были заблокированы.
//           "ДанныеИзменены"    - в процессе обработки данные были изменены другим пользователем.
//           "ОшибкаЗаписи"      - не смогли записать объект, или метод ВозможностьЗаменыЭлементов вернул отказ.
//           "ОшибкаУдаления"    - не смогли удалить объект.
//           "НеизвестныеДанные" - при обработке были найдены данные, которые не планировались к анализу, замена не реализована.
//       * ТекстОшибки - Строка - подробное описание ошибки.
//
&НаКлиенте
Функция ЗаменитьСсылки(Знач ПарыЗамен, Знач Параметры = Неопределено) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЗаменитьСсылки(ПарыЗамен,Параметры);
КонецФункции

// Получает все места использования ссылок.
// Если какая-либо ссылка нигде не используется, то строк для нее в результирующей таблице не будет.
// При вызове в неразделенном сеансе не выявляет ссылок в разделенных областях.
//
// Параметры:
//     НаборСсылок     - Массив - ссылки, для которых ищем места использования.
//     АдресРезультата - Строка - необязательный адрес во временном хранилище, куда будет помещен копия результата
//                                замены.
// 
// Возвращаемое значение:
//     ТаблицаЗначений - состоит из колонок:
//       * Ссылка - ЛюбаяСсылка - ссылка, которая анализируется.
//       * Данные - Произвольный - данные, содержащие анализируемую ссылку.
//       * Метаданные - ОбъектМетаданных - метаданные найденных данных.
//       * ПредставлениеДанных - Строка - представление данных, содержащих анализируемую ссылку.
//       * ТипСсылки - Тип - тип анализируемой ссылки.
//       * ВспомогательныеДанные - Булево - Истина, если данные используются анализируемой ссылкой как
//           вспомогательные данные (ведущее измерение или попали в исключение ПриДобавленииИсключенийПоискаСсылок).
//       * ЭтоСлужебныеДанные - Булево - данные попали в исключение ПриДобавленииИсключенийПоискаСсылок
//
&НаКлиенте
Функция МестаИспользования(Знач НаборСсылок, Знач АдресРезультата = "") Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_МестаИспользования(НаборСсылок,АдресРезультата);
КонецФункции

#КонецОбласти
#Область ВнешниеКомпоненты

// Проверка существования макета по метаданным конфигурации и расширений.
//
// Параметры:
//  ПолноеИмяМакета - Строка - полное имя макета.
//
// Возвращаемое значение:
//  Булево - признак существования макета.
//
&НаКлиенте
Функция МакетСуществует(ПолноеИмяМакета)

	Возврат УИ_ГЕНЕРАЦИЯ_МакетСуществует(ПолноеИмяМакета);

КонецФункции

#КонецОбласти

#Область МестаИспользования

&НаКлиенте
Функция ОписаниеТипаКлючиЗаписей()

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеТипаКлючиЗаписей();
КонецФункции

&НаКлиенте
Функция ОписаниеИзмеренийНабора(Знач МетаданныеРегистра, КэшИзмеренийРегистров)

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеИзмеренийНабора(МетаданныеРегистра,КэшИзмеренийРегистров);

КонецФункции

#КонецОбласти

#Область ЗаменитьСсылки

&НаКлиенте
Функция РазметитьМестаИспользования(Знач ПараметрыВыполнения, Знач Ссылка, Знач ЦелеваяСсылка, Знач ТаблицаПоиска)
	Возврат УИ_ГЕНЕРАЦИЯ_РазметитьМестаИспользования(ПараметрыВыполнения,Ссылка,ЦелеваяСсылка,ТаблицаПоиска);
КонецФункции

&НаКлиенте
Процедура ЗаменитьСсылкиКороткимиТранзакциями(Результат, Знач ПараметрыВыполнения, Знач Дубли, Знач ТаблицаПоиска)
	
	// Основной цикл обработки
	УИ_ГЕНЕРАЦИЯ_ЗаменитьСсылкиКороткимиТранзакциями(Результат,ПараметрыВыполнения,Дубли,ТаблицаПоиска);

КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьСсылкуОднойТранзакцией(Результат, Знач Дубль, Знач ПараметрыВыполнения, Знач ТаблицаПоиска)
	УИ_ГЕНЕРАЦИЯ_ЗаменитьСсылкуОднойТранзакцией(Результат,Дубль,ПараметрыВыполнения,ТаблицаПоиска);

КонецПроцедуры

&НаКлиенте
Процедура ПроизвестиЗаменуВКонстанте(Результат, Знач МестоИспользования, Знач ПараметрыЗаписи,
	Знач ВнутренняяТранзакция = Истина)

	УИ_ГЕНЕРАЦИЯ_ПроизвестиЗаменуВКонстанте(Результат,МестоИспользования,ПараметрыЗаписи,ВнутренняяТранзакция);

КонецПроцедуры

&НаКлиенте
Процедура ПроизвестиЗаменуВОбъекте(Результат, Знач МестоИспользования, Знач ПараметрыВыполнения,
	Знач ВнутренняяТранзакция = Истина)

	УИ_ГЕНЕРАЦИЯ_ПроизвестиЗаменуВОбъекте(Результат,МестоИспользования,ПараметрыВыполнения,ВнутренняяТранзакция);

КонецПроцедуры

&НаКлиенте
Процедура ПроизвестиЗаменуВНаборе(Результат, Знач МестоИспользования, Знач ПараметрыВыполнения,
	Знач ВнутренняяТранзакция = Истина)
	УИ_ГЕНЕРАЦИЯ_ПроизвестиЗаменуВНаборе(Результат,МестоИспользования,ПараметрыВыполнения,ВнутренняяТранзакция);

КонецПроцедуры

&НаКлиенте
Процедура ПроизвестиЗаменуВРегистреСведений(Результат, Знач МестоИспользования, Знач ПараметрыВыполнения,
	Знач ВнутренняяТранзакция = Истина)

	УИ_ГЕНЕРАЦИЯ_ПроизвестиЗаменуВРегистреСведений(Результат,МестоИспользования,ПараметрыВыполнения,ВнутренняяТранзакция);

КонецПроцедуры

&НаКлиенте
Функция ИзмененныеОбъектыПриЗаменеВОбъекте(ПараметрыВыполнения, МестоИспользования, ОбрабатываемыеСтроки)
	Возврат УИ_ГЕНЕРАЦИЯ_ИзмененныеОбъектыПриЗаменеВОбъекте(ПараметрыВыполнения,МестоИспользования,ОбрабатываемыеСтроки);
КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьФактЗамены(Объект, СсылкаДубля, СсылкаОригинала, ВидРеквизита, ИмяРеквизита,
	Индекс = Неопределено, ИмяКолонки = Неопределено)
	УИ_ГЕНЕРАЦИЯ_ЗарегистрироватьФактЗамены(Объект,СсылкаДубля,СсылкаОригинала,ВидРеквизита,ИмяРеквизита,Индекс,ИмяКолонки);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСсылкиНемонопольно(Результат, Знач СписокСсылок, Знач ПараметрыВыполнения, Знач УдалятьНепосредственно)

	УИ_ГЕНЕРАЦИЯ_УдалитьСсылкиНемонопольно(Результат,СписокСсылок,ПараметрыВыполнения,УдалятьНепосредственно);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРезультатыЗаменыИзмененныхОбъектов(Результат, ТаблицаПовторногоПоиска)

	УИ_ГЕНЕРАЦИЯ_ДобавитьРезультатыЗаменыИзмененныхОбъектов(Результат,ТаблицаПовторногоПоиска);

КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьМестаИспользования(ПараметрыВыполнения, Блокировка, МестаИспользования)

	УИ_ГЕНЕРАЦИЯ_ЗаблокироватьМестаИспользования(ПараметрыВыполнения,Блокировка,МестаИспользования);

КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьМестоИспользования(ПараметрыВыполнения, Блокировка, МестоИспользования)

	УИ_ГЕНЕРАЦИЯ_ЗаблокироватьМестоИспользования(ПараметрыВыполнения,Блокировка,МестоИспользования);

КонецПроцедуры

&НаКлиенте
Функция ОписаниеДвижений(Знач Мета)
	// можно закэшировать по Мета

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеДвижений(Мета);
КонецФункции

&НаКлиенте
Функция ОписаниеПоследовательностей(Знач Мета)

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеПоследовательностей(Мета);
КонецФункции

&НаКлиенте
Функция ОписаниеОбъекта(Знач Мета)
	// можно закэшировать по Мета

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеОбъекта(Мета);
КонецФункции

&НаКлиенте
Функция ОписаниеКлючаЗаписи(Знач Мета)
	// можно закэшировать по Мета

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеКлючаЗаписи(Мета);
КонецФункции

&НаКлиенте
Функция ОписанияТиповПересекаются(Знач Описание1, Знач Описание2)

	Возврат УИ_ГЕНЕРАЦИЯ_ОписанияТиповПересекаются(Описание1,Описание2);
КонецФункции

// Возвращает описание по имени таблицы или по набору записей.
&НаКлиенте
Функция СпискиПолейПоТипу(Знач ИсточникДанных, Знач МетаИзмерения, Знач ИсключатьПоля)
	// можно закэшировать

	Возврат УИ_ГЕНЕРАЦИЯ_СпискиПолейПоТипу(ИсточникДанных,МетаИзмерения,ИсключатьПоля);
КонецФункции

&НаКлиенте
Процедура ЗаменитьВКоллекцииСтрок(ВидКоллекции, ИмяКоллекции, Объект, Коллекция, Знач СписокПолей, Знач ПарыЗамен)
	УИ_ГЕНЕРАЦИЯ_ЗаменитьВКоллекцииСтрок(ВидКоллекции,ИмяКоллекции,Объект,Коллекция,СписокПолей,ПарыЗамен);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОбъектСПерехватомСообщенийПриЗаменеСсылок(Знач Объект, Знач Действие, Знач РежимЗаписи,
	Знач ПараметрыЗаписи)
	
	// Текущие сообщения до исключения запоминаем.
	УИ_ГЕНЕРАЦИЯ_ОбработатьОбъектСПерехватомСообщенийПриЗаменеСсылок(Объект,Действие,РежимЗаписи,ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура СообщитьОтложенныеСообщения(Знач Сообщения)

	УИ_ГЕНЕРАЦИЯ_СообщитьОтложенныеСообщения(Сообщения);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбъектПриЗаменеСсылок(Знач Объект, Знач ПараметрыЗаписи)

	УИ_ГЕНЕРАЦИЯ_ЗаписатьОбъектПриЗаменеСсылок(Объект,ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Функция СобытиеЖурналаРегистрацииЗаменыСсылок()

	Возврат УИ_ГЕНЕРАЦИЯ_СобытиеЖурналаРегистрацииЗаменыСсылок();

КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьОшибкуВТаблицу(Результат, Дубль, Оригинал, Данные, Информация, ТипОшибки, ИнформацияОбОшибке)
	УИ_ГЕНЕРАЦИЯ_ЗарегистрироватьОшибкуВТаблицу(Результат,Дубль,Оригинал,Данные,Информация,ТипОшибки,ИнформацияОбОшибке);

КонецПроцедуры

// Формирует информацию о типе объекта метаданных: полное имя, представления, вид и т.п.
&НаКлиенте
Функция ИнформацияОТипе(ПолноеИмяИлиМетаданныеИлиТип, Кэш)
	Возврат УИ_ГЕНЕРАЦИЯ_ИнформацияОТипе(ПолноеИмяИлиМетаданныеИлиТип,Кэш);
КонецФункции

&НаКлиенте
Функция ИнформацияПоРеквизиту(МетаданныеРеквизита)
	// ОписаниеСтандартногоРеквизита
	// ОбъектМетаданных: Измерение
	// ОбъектМетаданных: Ресурс
	// ОбъектМетаданных: Реквизит
	Возврат УИ_ГЕНЕРАЦИЯ_ИнформацияПоРеквизиту(МетаданныеРеквизита);
КонецФункции

&НаКлиенте
Функция ЭтоСлужебныеДанные(МестоИспользования, ИсключенияПоискаСсылок)

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоСлужебныеДанные(МестоИспользования,ИсключенияПоискаСсылок);

КонецФункции

#КонецОбласти

#Область Метаданные

////////////////////////////////////////////////////////////////////////////////
// Функции определения типов объектов метаданных.

// Ссылочные типы данных

// Определяет принадлежность объекта метаданных к общему типу "Документ".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к документам.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является документом.
//
&НаКлиенте
Функция ЭтоДокумент(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоДокумент(ОбъектМетаданных);

КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Справочник".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является справочником.
//
&НаКлиенте
Функция ЭтоСправочник(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоСправочник(ОбъектМетаданных);

КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Перечисление".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является перечислением.
//
&НаКлиенте
Функция ЭтоПеречисление(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоПеречисление(ОбъектМетаданных);

КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "План обмена".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является планом обмена.
//
&НаКлиенте
Функция ЭтоПланОбмена(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоПланОбмена(ОбъектМетаданных);

КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "План видов характеристик".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является планом видов характеристик.
//
&НаКлиенте
Функция ЭтоПланВидовХарактеристик(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоПланВидовХарактеристик(ОбъектМетаданных);

КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Бизнес-процесс".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является бизнес-процессом.
//
&НаКлиенте
Функция ЭтоБизнесПроцесс(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоБизнесПроцесс(ОбъектМетаданных);

КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Задача".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является задачей.
//
&НаКлиенте
Функция ЭтоЗадача(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоЗадача(ОбъектМетаданных);

КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "План счетов".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является планом счетов.
//
&НаКлиенте
Функция ЭтоПланСчетов(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоПланСчетов(ОбъектМетаданных);

КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "План видов расчета".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является планом видов расчета.
//
&НаКлиенте
Функция ЭтоПланВидовРасчета(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоПланВидовРасчета(ОбъектМетаданных);

КонецФункции

// Регистры

// Определяет принадлежность объекта метаданных к общему типу "Регистр сведений".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является регистром сведений.
//
&НаКлиенте
Функция ЭтоРегистрСведений(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоРегистрСведений(ОбъектМетаданных);

КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Регистр накопления".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является регистром накопления.
//
&НаКлиенте
Функция ЭтоРегистрНакопления(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоРегистрНакопления(ОбъектМетаданных);

КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Регистр бухгалтерии".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является регистром бухгалтерии.
//
&НаКлиенте
Функция ЭтоРегистрБухгалтерии(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоРегистрБухгалтерии(ОбъектМетаданных);

КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Регистр расчета".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является регистром расчета.
//
&НаКлиенте
Функция ЭтоРегистрРасчета(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоРегистрРасчета(ОбъектМетаданных);

КонецФункции

// Константы

// Определяет принадлежность объекта метаданных к общему типу "Константа".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является константой.
//
&НаКлиенте
Функция ЭтоКонстанта(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоКонстанта(ОбъектМетаданных);

КонецФункции

// Журналы документов

// Определяет принадлежность объекта метаданных к общему типу "Журнал документов".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является журналом документов.
//
&НаКлиенте
Функция ЭтоЖурналДокументов(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоЖурналДокументов(ОбъектМетаданных);

КонецФункции

// Последовательности

// Определяет принадлежность объекта метаданных к общему типу "Последовательности".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является последовательностью.
//
&НаКлиенте
Функция ЭтоПоследовательность(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоПоследовательность(ОбъектМетаданных);

КонецФункции

// РегламентныеЗадания

// Определяет принадлежность объекта метаданных к общему типу "Регламентные задания".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является регламентным заданием.
//
&НаКлиенте
Функция ЭтоРегламентноеЗадание(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоРегламентноеЗадание(ОбъектМетаданных);

КонецФункции

// Общие

// Определяет принадлежность объекта метаданных к типу регистр.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект является каким-либо регистром.
//
&НаКлиенте
Функция ЭтоРегистр(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоРегистр(ОбъектМетаданных);

КонецФункции

// Определяет принадлежность объекта метаданных к ссылочному типу.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//   Булево - Истина, если объект ссылочного типа.
//
&НаКлиенте
Функция ЭтоОбъектСсылочногоТипа(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоОбъектСсылочногоТипа(ОбъектМетаданных);

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с типами, объектами метаданных и их строковыми представлениями.

// Возвращает имена реквизитов объекта заданного типа.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка на элемент базы данных, для которого требуется получить результат функции;
//  Тип    - Тип - тип значения реквизита.
// 
// Возвращаемое значение:
//  Строка - строка реквизитов объекта метаданных конфигурации, разделенных символом ",".
//
// Пример:
//  РеквизитыОрганизации = ОбщегоНазначения.ИменаРеквизитовПоТипу(Документ.Ссылка, Тип("СправочникСсылка.Организации"));
//
&НаКлиенте
Функция ИменаРеквизитовПоТипу(Ссылка, Тип) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ИменаРеквизитовПоТипу(Ссылка,Тип);
КонецФункции

// Возвращает имя базового типа по переданному значению объекта метаданных.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект метаданных, по которому необходимо определить базовый тип.
// 
// Возвращаемое значение:
//  Строка - имя базового типа по переданному значению объекта метаданных.
//
// Пример:
//  ИмяБазовогоТипа = ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(Метаданные.Справочники.Номенклатура); = "Справочники".
//
&НаКлиенте
Функция ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных);

КонецФункции

// Возвращает менеджер объекта по полному имени объекта метаданных.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных. Пример: "Справочник.Организации".
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер, ОбработкаМенеджер, РегистрСведенийМенеджер - менеджер объекта.
// 
// Пример:
//  МенеджерСправочника = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Справочник.Организации");
//  ПустаяСсылка = МенеджерСправочника.ПустаяСсылка();
//
&НаКлиенте
Функция МенеджерОбъектаПоПолномуИмени(ПолноеИмя) Экспорт
	Перем КлассОМ, ИмяОМ, Менеджер;

	Возврат УИ_ГЕНЕРАЦИЯ_МенеджерОбъектаПоПолномуИмени(ПолноеИмя);

КонецФункции

// Возвращает менеджер объекта по ссылке на объект.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
// См. также ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, менеджер которого требуется получить.
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер, ОбработкаМенеджер, РегистрСведенийМенеджер - менеджер объекта.
//
// Пример:
//  МенеджерСправочника = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаОрганизацию);
//  ПустаяСсылка = МенеджерСправочника.ПустаяСсылка();
//
&НаКлиенте
Функция МенеджерОбъектаПоСсылке(Ссылка) Экспорт
	
	//@skip-warning
	Возврат УИ_ГЕНЕРАЦИЯ_МенеджерОбъектаПоСсылке(Ссылка);

КонецФункции

// Проверка того, что переданный тип является ссылочным типом данных.
// Для типа "Неопределено" возвращается Ложь.
//
// Параметры:
//  ПроверяемыйТип - Тип - для проверки на ссылочный тип данных.
//
// Возвращаемое значение:
//  Булево - Истина, если это ссылка.
//
&НаКлиенте
Функция ЭтоСсылка(ПроверяемыйТип) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоСсылка(ПроверяемыйТип);

КонецФункции

// Проверяет физическое наличие записи в информационной базе данных о переданном значении ссылки.
//
// Параметры:
//  ПроверяемаяСсылка - ЛюбаяСсылка - значение любой ссылки информационной базы данных.
// 
// Возвращаемое значение:
//  Булево - Истина, если существует.
//
&НаКлиенте
Функция СсылкаСуществует(ПроверяемаяСсылка) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_СсылкаСуществует(ПроверяемаяСсылка);

КонецФункции

// Возвращает имя вида объектов метаданных по ссылке на объект.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
// См. так же ВидОбъектаПоТипу.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, вид которого требуется получить.
//
// Возвращаемое значение:
//  Строка - имя вида объектов метаданных. Например: "Справочник", "Документ".
// 
&НаКлиенте
Функция ВидОбъектаПоСсылке(Ссылка) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ВидОбъектаПоСсылке(Ссылка);

КонецФункции 

// Возвращает имя вида объектов метаданных по типу объекта.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
// См. так же ВидОбъектаПоСсылке.
//
// Параметры:
//  ТипОбъекта - Тип - Тип прикладного объекта, определенный в конфигурации.
//
// Возвращаемое значение:
//  Строка - имя вида объектов метаданных. Например: "Справочник", "Документ".
// 
&НаКлиенте
Функция ВидОбъектаПоТипу(ТипОбъекта) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ВидОбъектаПоТипу(ТипОбъекта);

КонецФункции

// Возвращает полное имя объекта метаданных по переданному значению ссылки.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, для которого необходимо получить имя таблицы ИБ.
// 
// Возвращаемое значение:
//  Строка - полное имя объекта метаданных для указанного объекта. Например: "Справочник.Номенклатура".
//
&НаКлиенте
Функция ИмяТаблицыПоСсылке(Ссылка) Экспорт
	
	//@skip-warning
	Возврат УИ_ГЕНЕРАЦИЯ_ИмяТаблицыПоСсылке(Ссылка);

КонецФункции

// Проверяет, что переданное значение имеет ссылочный тип данных.
//
// Параметры:
//  Значение - Произвольный - проверяемое значение.
//
// Возвращаемое значение:
//  Булево - Истина, если тип значения ссылочный.
//
&НаКлиенте
Функция ЗначениеСсылочногоТипа(Значение) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЗначениеСсылочногоТипа(Значение);

КонецФункции

// Проверяет, является ли объект группой элементов.
//
// Параметры:
//  Объект - ЛюбаяСсылка, Объект - проверяемый объект.
//
// Возвращаемое значение:
//  Булево - Истина, если является.
//
&НаКлиенте
Функция ОбъектЯвляетсяГруппой(Объект) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектЯвляетсяГруппой(Объект);

КонецФункции

// Возвращает строковое представление типа. 
// Для ссылочных типов возвращает в формате "СправочникСсылка.ИмяОбъекта" или "ДокументСсылка.ИмяОбъекта".
// Для остальных типов приводит тип к строке, например "Число".
//
// Параметры:
//  Тип - тип - для которого надо получить представление.
//
// Возвращаемое значение:
//  Строка - представление типа.
//
&НаКлиенте
Функция СтроковоеПредставлениеТипа(Тип) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_СтроковоеПредставлениеТипа(Тип);

КонецФункции

// Возвращает таблицу значений с описанием требуемых свойств всех реквизитов объекта метаданных.
// Получает значения свойств стандартных реквизитов и пользовательских реквизитов (созданных в режиме конфигуратора).
//
// Параметры:
//  ОбъектМетаданных  - ОбъектМетаданных - объект, для которого необходимо получить значение свойств реквизитов.
//                      Например: Метаданные.Документ.РеализацияТоваровИУслуг
//  Свойства - Строка - свойства реквизитов, перечисленные через запятую, значение которых необходимо получить.
//                      Например: "Имя, Тип, Синоним, Подсказка".
//
// Возвращаемое значение:
//  ТаблицаЗначений - описание требуемых свойств всех реквизитов объекта метаданных.
//
&НаКлиенте
Функция ОписаниеСвойствОбъекта(ОбъектМетаданных, Свойства) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеСвойствОбъекта(ОбъектМетаданных,Свойства);

КонецФункции

// Возвращает признак того, что реквизит входит в подмножество стандартных реквизитов.
//
// Параметры:
//  СтандартныеРеквизиты - ОписанияСтандартныхРеквизитов - тип и значение, описывающие коллекцию настроек различных
//                                                         стандартных реквизитов;
//  ИмяРеквизита         - Строка - реквизит, который необходимо проверить на принадлежность множеству стандартных
//                                  реквизитов.
// 
// Возвращаемое значение:
//   Булево - Истина, если реквизит входит в подмножество стандартных реквизитов.
//
&НаКлиенте
Функция ЭтоСтандартныйРеквизит(СтандартныеРеквизиты, ИмяРеквизита) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЭтоСтандартныйРеквизит(СтандартныеРеквизиты,ИмяРеквизита);

КонецФункции

// Позволяет определить, есть ли среди реквизитов объекта реквизит с переданным именем.
//
// Параметры:
//  ИмяРеквизита - Строка - имя реквизита;
//  МетаданныеОбъекта - ОбъектМетаданных - объект, в котором требуется проверить наличие реквизита.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
&НаКлиенте
Функция ЕстьРеквизитОбъекта(ИмяРеквизита, МетаданныеОбъекта) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЕстьРеквизитОбъекта(ИмяРеквизита,МетаданныеОбъекта);

КонецФункции

// Проверить, что описание типа состоит из единственного типа значения и 
// совпадает с нужным типом.
//
// Параметры:
//   ОписаниеТипа - ОписаниеТипов - проверяемая коллекция типов;
//   ТипЗначения  - Тип - проверяемый тип.
//
// Возвращаемое значение:
//   Булево - Истина, если совпадает.
//
// Пример:
//  Если ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ТипЗначенияСвойства, Тип("Булево") Тогда
//    // Выводим поле в виде флажка.
//  КонецЕсли;
//
&НаКлиенте
Функция ОписаниеТипаСостоитИзТипа(ОписаниеТипа, ТипЗначения) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеТипаСостоитИзТипа(ОписаниеТипа,ТипЗначения);

КонецФункции

// Создает объект ОписаниеТипов, содержащий тип Строка.
//
// Параметры:
//  ДлинаСтроки - Число - длина строки.
//
// Возвращаемое значение:
//  ОписаниеТипов - описание типа Строка.
//
&НаКлиенте
Функция ОписаниеТипаСтрока(ДлинаСтроки) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеТипаСтрока(ДлинаСтроки);

КонецФункции

// Создает объект ОписаниеТипов, содержащий тип Число.
//
// Параметры:
//  Разрядность - Число - общее количество разрядов числа (количество разрядов
//                        целой части плюс количество разрядов дробной части).
//  РазрядностьДробнойЧасти - Число - число разрядов дробной части.
//  ЗнакЧисла - ДопустимыйЗнак - допустимый знак числа.
//
// Возвращаемое значение:
//  ОписаниеТипов - описание типа Число.
&НаКлиенте
Функция ОписаниеТипаЧисло(Разрядность, РазрядностьДробнойЧасти = 0, ЗнакЧисла = Неопределено) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеТипаЧисло(Разрядность,РазрядностьДробнойЧасти,ЗнакЧисла);

КонецФункции

// Создает объект ОписаниеТипов, содержащий тип Дата.
//
// Параметры:
//  ЧастиДаты - ЧастиДаты - набор вариантов использования значений типа Дата.
//
// Возвращаемое значение:
//  ОписаниеТипов - описание типа Дата.
&НаКлиенте
Функция ОписаниеТипаДата(ЧастиДаты) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ОписаниеТипаДата(ЧастиДаты);

КонецФункции
#КонецОбласти

#Область ХранилищеНастроек

////////////////////////////////////////////////////////////////////////////////
// Сохранение, чтение и удаление настроек из хранилищ.

// Сохраняет настройку в хранилище общих настроек, как метод платформы Сохранить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, сохранение пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта       - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек      - Строка           - см. синтакс-помощник платформы.
//   Настройки         - Произвольный     - см. синтакс-помощник платформы.
//   ОписаниеНастроек  - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя   - Строка           - см. синтакс-помощник платформы.
//   ОбновитьПовторноИспользуемыеЗначения - Булево - выполнить одноименный метод платформы.
//
&НаКлиенте
Процедура ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек = Неопределено,
	ИмяПользователя = Неопределено, ОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);

КонецПроцедуры

// Сохраняет несколько настроек в хранилище общих настроек, как метод платформы Сохранить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, сохранение пропускается без ошибки.
// 
// Параметры:
//   НесколькоНастроек - Массив - со значениями:
//     * Значение - Структура - со свойствами:
//         * Объект    - Строка       - см. параметр КлючОбъекта  в синтакс-помощнике платформы.
//         * Настройка - Строка       - см. параметр КлючНастроек в синтакс-помощнике платформы.
//         * Значение  - Произвольный - см. параметр Настройки    в синтакс-помощнике платформы.
//
//   ОбновитьПовторноИспользуемыеЗначения - Булево - выполнить одноименный метод платформы.
//
&НаКлиенте
Процедура ХранилищеОбщихНастроекСохранитьМассив(НесколькоНастроек, ОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекСохранитьМассив(НесколькоНастроек,ОбновитьПовторноИспользуемыеЗначения);

КонецПроцедуры

// Загружает настройку из хранилища общих настроек, как метод платформы Загрузить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Кроме того, возвращает указанное значение по умолчанию, если настройки не найдены.
// Если нет права СохранениеДанныхПользователя, возвращается значение по умолчанию без ошибки.
//
// В возвращаемом значении очищаются ссылки на несуществующий объект в базе данных, а именно
// - возвращаемая ссылка заменяется на указанное значение по умолчанию;
// - из данных типа Массив ссылки удаляются;
// - у данных типа Структура и Соответствие ключ не меняется, а значение устанавливается Неопределено;
// - анализ значений в данных типа Массив, Структура, Соответствие выполняется рекурсивно.
//
// Параметры:
//   КлючОбъекта          - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек         - Строка           - см. синтакс-помощник платформы.
//   ЗначениеПоУмолчанию  - Произвольный     - значение, которое возвращается, если настройки не найдены.
//                                             Если не указано, возвращается значение Неопределено.
//   ОписаниеНастроек     - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя      - Строка           - см. синтакс-помощник платформы.
//
// Возвращаемое значение: 
//   Произвольный - см. синтакс-помощник платформы.
//
&НаКлиенте
Функция ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию = Неопределено,
	ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);

КонецФункции

// Удаляет настройку из хранилища общих настроек, как метод платформы Удалить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, удаление пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта     - Строка, Неопределено - см. синтакс-помощник платформы.
//   КлючНастроек    - Строка, Неопределено - см. синтакс-помощник платформы.
//   ИмяПользователя - Строка, Неопределено - см. синтакс-помощник платформы.
//
&НаКлиенте
Процедура ХранилищеОбщихНастроекУдалить(КлючОбъекта, КлючНастроек, ИмяПользователя) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя);

КонецПроцедуры

// Сохраняет настройку в хранилище системных настроек, как метод платформы Сохранить
// объекта СтандартноеХранилищеНастроекМенеджер, но с поддержкой длины ключа настроек
// более 128 символов путем хеширования части, которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, сохранение пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта       - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек      - Строка           - см. синтакс-помощник платформы.
//   Настройки         - Произвольный     - см. синтакс-помощник платформы.
//   ОписаниеНастроек  - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя   - Строка           - см. синтакс-помощник платформы.
//   ОбновитьПовторноИспользуемыеЗначения - Булево - выполнить одноименный метод платформы.
//
&НаКлиенте
Процедура ХранилищеСистемныхНастроекСохранить(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек = Неопределено,
	ИмяПользователя = Неопределено, ОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеСистемныхНастроекСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);

КонецПроцедуры

// Загружает настройку из хранилища системных настроек, как метод платформы Загрузить,
// объекта СтандартноеХранилищеНастроекМенеджер, но с поддержкой длины ключа настроек
// более 128 символов путем хеширования части, которая превышает 96 символов.
// Кроме того, возвращает указанное значение по умолчанию, если настройки не найдены.
// Если нет права СохранениеДанныхПользователя, возвращается значение по умолчанию без ошибки.
//
// В возвращаемом значении очищаются ссылки на несуществующий объект в базе данных, а именно:
// - возвращаемая ссылка заменяется на указанное значение по умолчанию;
// - из данных типа Массив ссылки удаляются;
// - у данных типа Структура и Соответствие ключ не меняется, а значение устанавливается Неопределено;
// - анализ значений в данных типа Массив, Структура, Соответствие выполняется рекурсивно.
//
// Параметры:
//   КлючОбъекта          - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек         - Строка           - см. синтакс-помощник платформы.
//   ЗначениеПоУмолчанию  - Произвольный     - значение, которое возвращается, если настройки не найдены.
//                                             Если не указано, возвращается значение Неопределено.
//   ОписаниеНастроек     - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя      - Строка           - см. синтакс-помощник платформы.
//
// Возвращаемое значение: 
//   Произвольный - см. синтакс-помощник платформы.
//
&НаКлиенте
Функция ХранилищеСистемныхНастроекЗагрузить(КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию = Неопределено,
	ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ХранилищеСистемныхНастроекЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);

КонецФункции

// Удаляет настройку из хранилища системных настроек, как метод платформы Удалить,
// объекта СтандартноеХранилищеНастроекМенеджер, но с поддержкой длины ключа настроек
// более 128 символов путем хеширования части, которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, удаление пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта     - Строка, Неопределено - см. синтакс-помощник платформы.
//   КлючНастроек    - Строка, Неопределено - см. синтакс-помощник платформы.
//   ИмяПользователя - Строка, Неопределено - см. синтакс-помощник платформы.
//
&НаКлиенте
Процедура ХранилищеСистемныхНастроекУдалить(КлючОбъекта, КлючНастроек, ИмяПользователя) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеСистемныхНастроекУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя);

КонецПроцедуры

// Сохраняет настройку в хранилище настроек данных форм, как метод платформы Сохранить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, сохранение пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта       - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек      - Строка           - см. синтакс-помощник платформы.
//   Настройки         - Произвольный     - см. синтакс-помощник платформы.
//   ОписаниеНастроек  - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя   - Строка           - см. синтакс-помощник платформы.
//   ОбновитьПовторноИспользуемыеЗначения - Булево - выполнить одноименный метод платформы.
//
&НаКлиенте
Процедура ХранилищеНастроекДанныхФормСохранить(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек = Неопределено,
	ИмяПользователя = Неопределено, ОбновитьПовторноИспользуемыеЗначения = Ложь) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеНастроекДанныхФормСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);

КонецПроцедуры

// Загружает настройку из хранилища настроек данных форм, как метод платформы Загрузить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Кроме того, возвращает указанное значение по умолчанию, если настройки не найдены.
// Если нет права СохранениеДанныхПользователя, возвращается значение по умолчанию без ошибки.
//
// В возвращаемом значении очищаются ссылки на несуществующий объект в базе данных, а именно
// - возвращаемая ссылка заменяется на указанное значение по умолчанию;
// - из данных типа Массив ссылки удаляются;
// - у данных типа Структура и Соответствие ключ не меняется, а значение устанавливается Неопределено;
// - анализ значений в данных типа Массив, Структура, Соответствие выполняется рекурсивно.
//
// Параметры:
//   КлючОбъекта          - Строка           - см. синтакс-помощник платформы.
//   КлючНастроек         - Строка           - см. синтакс-помощник платформы.
//   ЗначениеПоУмолчанию  - Произвольный     - значение, которое возвращается, если настройки не найдены.
//                                             Если не указано, возвращается значение Неопределено.
//   ОписаниеНастроек     - ОписаниеНастроек - см. синтакс-помощник платформы.
//   ИмяПользователя      - Строка           - см. синтакс-помощник платформы.
//
// Возвращаемое значение: 
//   Произвольный - см. синтакс-помощник платформы.
//
&НаКлиенте
Функция ХранилищеНастроекДанныхФормЗагрузить(КлючОбъекта, КлючНастроек, ЗначениеПоУмолчанию = Неопределено,
	ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ХранилищеНастроекДанныхФормЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);

КонецФункции

// Удаляет настройку из хранилища настроек данных форм, как метод платформы Удалить,
// объектов СтандартноеХранилищеНастроекМенеджер или ХранилищеНастроекМенеджер.<Имя хранилища>,
// но с поддержкой длины ключа настроек более 128 символов путем хеширования части,
// которая превышает 96 символов.
// Если нет права СохранениеДанныхПользователя, удаление пропускается без ошибки.
//
// Параметры:
//   КлючОбъекта     - Строка, Неопределено - см. синтакс-помощник платформы.
//   КлючНастроек    - Строка, Неопределено - см. синтакс-помощник платформы.
//   ИмяПользователя - Строка, Неопределено - см. синтакс-помощник платформы.
//
&НаКлиенте
Процедура ХранилищеНастроекДанныхФормУдалить(КлючОбъекта, КлючНастроек, ИмяПользователя) Экспорт

	УИ_ГЕНЕРАЦИЯ_ХранилищеНастроекДанныхФормУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя);

КонецПроцедуры

#КонецОбласти

#Область Алгоритмы

&НаКлиенте
Функция ВыполнитьАлгоритм(АлгоритмСсылка, ВходящиеПараметры = Неопределено, ОшибкаВыполнения = Ложь,
	СообщениеОбОшибке = "") Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ВыполнитьАлгоритм(АлгоритмСсылка,ВходящиеПараметры,ОшибкаВыполнения,СообщениеОбОшибке)
КонецФункции

&НаКлиенте
Функция ПолучитьСсылкуСправочникАлгоритмы(Алгоритм) Экспорт
	Возврат УИ_ГЕНЕРАЦИЯ_ПолучитьСсылкуСправочникАлгоритмы(Алгоритм);
КонецФункции

#КонецОбласти

#Область ЗаписьОбъектов

&НаКлиенте
Процедура УстановитьПризнакЗаписиБезАвторегистрацииИзменений(Объект, БезАвторегистрации = Ложь)
	УИ_ГЕНЕРАЦИЯ_УстановитьПризнакЗаписиБезАвторегистрацииИзменений(Объект,БезАвторегистрации);
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьПроцедуруПередЗаписьюОбъекта(Объект, _ТекстПроцедурыПередЗаписью)
	Возврат УИ_ГЕНЕРАЦИЯ_ВыполнитьПроцедуруПередЗаписьюОбъекта(Объект,_ТекстПроцедурыПередЗаписью);
КонецФункции

&НаКлиенте
Функция ЗаписатьОбъектВБазу(Объект, ПараметрыЗаписи, Знач Действие = "Запись", Знач РежимЗаписи = Неопределено,
	ЗаменаСсылок = Ложь) Экспорт

	Возврат УИ_ГЕНЕРАЦИЯ_ЗаписатьОбъектВБазу(Объект,ПараметрыЗаписи,Действие,РежимЗаписи,ЗаменаСсылок);
КонецФункции
#КонецОбласти
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОбъектМодуля()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции


&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_РазделениеВключено()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().РазделениеВключено();
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ПодсистемаСуществует(ПолноеИмяПодсистемы)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПодсистемаСуществует(ПолноеИмяПодсистемы);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОбщийМодуль(Имя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОбщийМодуль(Имя);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_СерверныйМодульМенеджера(Имя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СерверныйМодульМенеджера(Имя);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ДоступноИспользованиеРазделенныхДанных()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ДоступноИспользованиеРазделенныхДанных();
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоПодчиненныйУзелРИБ()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоПодчиненныйУзелРИБ();
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЗначениеВСтрокуXML(Значение)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗначениеВСтрокуXML(Значение);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЗначениеИзСтрокиXML(СтрокаXML,Тип)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗначениеИзСтрокиXML(СтрокаXML,Тип);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ИнформационнаяБазаФайловая(СтрокаСоединенияИнформационнойБазы)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ИнформационнаяБазаФайловая(СтрокаСоединенияИнформационнойБазы);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_УстановитьБезопасныйРежимБСП()
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().УстановитьБезопасныйРежимБСП();
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ВыполнитьМетодОбъекта(Объект,ИмяМетода,Параметры)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ВыполнитьМетодОбъекта(Объект,ИмяМетода,Параметры);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ВыполнитьМетодКонфигурации(ИмяМетода,Параметры)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ВыполнитьМетодКонфигурации(ИмяМетода,Параметры);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ПроверитьИмяПроцедурыКонфигурации(ИмяПроцедуры)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПроверитьИмяПроцедурыКонфигурации(ИмяПроцедуры);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_МенеджерОбъектаПоИмени(Имя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().МенеджерОбъектаПоИмени(Имя);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеСохранить(МенеджерХранилища,КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеСохранить(МенеджерХранилища,КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ХранилищеЗагрузить(МенеджерХранилища,КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеЗагрузить(МенеджерХранилища,КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеУдалить(МенеджерХранилища,КлючОбъекта,КлючНастроек,ИмяПользователя)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеУдалить(МенеджерХранилища,КлючОбъекта,КлючНастроек,ИмяПользователя);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_КлючНастроек(Строка)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().КлючНастроек(Строка);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_СократитьСтрокуКонтрольнойСуммой(Строка,МаксимальнаяДлина)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СократитьСтрокуКонтрольнойСуммой(Строка,МаксимальнаяДлина);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_УдалитьБитыеСсылки(СсылкаИлиКоллекция)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().УдалитьБитыеСсылки(СсылкаИлиКоллекция);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЗначенияРеквизитовОбъекта(Ссылка,Реквизиты,ВыбратьРазрешенные)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗначенияРеквизитовОбъекта(Ссылка,Реквизиты,ВыбратьРазрешенные);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита,ВыбратьРазрешенные)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита,ВыбратьРазрешенные);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_НайтиОшибкуДоступностиРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных,ПроверяемыеВыражения)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().НайтиОшибкуДоступностиРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных,ПроверяемыеВыражения);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ПолеИсточникаСхемыЗапросаДоступно(ИсточникОператора,ПроверяемоеВыражение)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПолеИсточникаСхемыЗапросаДоступно(ИсточникОператора,ПроверяемоеВыражение);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоАвтономноеРабочееМесто()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоАвтономноеРабочееМесто();
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЕстьПравоНаИспользованиеИнструментов()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЕстьПравоНаИспользованиеИнструментов();
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ДобавитьВКоманднуюПанельОбщиеКоманды(Форма,ОсновнаяКоманднаяПанельФормы)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ДобавитьВКоманднуюПанельОбщиеКоманды(Форма,ОсновнаяКоманднаяПанельФормы);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ФормаИнструментаПриСозданииНаСервере(Форма,Отказ,СтандартнаяОбработка,ОсновнаяКоманднаяПанельФормы)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ФормаИнструментаПриСозданииНаСервере(Форма,Отказ,СтандартнаяОбработка,ОсновнаяКоманднаяПанельФормы);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ВариантРедактораКода1С()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ВариантРедактораКода1С();
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_УстановитьВариантРедактораКода1С(НовыйВариант)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().УстановитьВариантРедактораКода1С(НовыйВариант);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ИсключенияПоискаСсылок()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ИсключенияПоискаСсылок();
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ПодключитьКомпонентуИзМакета(Идентификатор,ПолноеИмяМакета)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПодключитьКомпонентуИзМакета(Идентификатор,ПолноеИмяМакета);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ПредметСтрокой(СсылкаНаПредмет)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПредметСтрокой(СсылкаНаПредмет);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ЗарегистрироватьОшибкуЗамены(Результат,Ссылка,ОписаниеОшибки)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗарегистрироватьОшибкуЗамены(Результат,Ссылка,ОписаниеОшибки);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеОшибкиЗамены(ТипОшибки,ОбъектОшибки,ПредставлениеОбъектаОшибки,ТекстОшибки)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеОшибкиЗамены(ТипОшибки,ОбъектОшибки,ПредставлениеОбъектаОшибки,ТекстОшибки);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеТипаВсеСсылки()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеТипаВсеСсылки();
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ДобавитьОбъектВМассивОбъектовКСравнению(МассивОБъектов,СсылкаНаОбъект)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ДобавитьОбъектВМассивОбъектовКСравнению(МассивОБъектов,СсылкаНаОбъект);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_КлючНастроекОбъектовКСравнению()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().КлючНастроекОбъектовКСравнению();
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ДобавитьМассивОбъектовКСравнению(Объекты)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ДобавитьМассивОбъектовКСравнению(Объекты);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОбъектыДобавленныеКСравнению()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОбъектыДобавленныеКСравнению();
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ОчиститьОбъектыДобавленныеКСравнению()
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОчиститьОбъектыДобавленныеКСравнению();
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_КлючНастроекОтладкиДополнительныхОтчетовИОбработок()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().КлючНастроекОтладкиДополнительныхОтчетовИОбработок();
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_НовыйСтруктураНастройкиОтладкиДополнительнойОбработки()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().НовыйСтруктураНастройкиОтладкиДополнительнойОбработки();
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_НастройкиОтладкиДополнительнойОбработки(ДополнительнаяОбработка)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().НастройкиОтладкиДополнительнойОбработки(ДополнительнаяОбработка);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ЗаписатьНастройкиОтладкиДополнительнойОбработки(ДополнительнаяОбработка,Настройки)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗаписатьНастройкиОтладкиДополнительнойОбработки(ДополнительнаяОбработка,Настройки);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЗаменитьСсылки(ПарыЗамен,Параметры)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗаменитьСсылки(ПарыЗамен,Параметры);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_МестаИспользования(НаборСсылок,АдресРезультата)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().МестаИспользования(НаборСсылок,АдресРезультата);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_МакетСуществует(ПолноеИмяМакета)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().МакетСуществует(ПолноеИмяМакета);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеТипаКлючиЗаписей()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеТипаКлючиЗаписей();
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеИзмеренийНабора(МетаданныеРегистра,КэшИзмеренийРегистров)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеИзмеренийНабора(МетаданныеРегистра,КэшИзмеренийРегистров);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_РазметитьМестаИспользования(ПараметрыВыполнения,Ссылка,ЦелеваяСсылка,ТаблицаПоиска)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().РазметитьМестаИспользования(ПараметрыВыполнения,Ссылка,ЦелеваяСсылка,ТаблицаПоиска);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ЗаменитьСсылкиКороткимиТранзакциями(Результат,ПараметрыВыполнения,Дубли,ТаблицаПоиска)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗаменитьСсылкиКороткимиТранзакциями(Результат,ПараметрыВыполнения,Дубли,ТаблицаПоиска);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ЗаменитьСсылкуОднойТранзакцией(Результат,Дубль,ПараметрыВыполнения,ТаблицаПоиска)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗаменитьСсылкуОднойТранзакцией(Результат,Дубль,ПараметрыВыполнения,ТаблицаПоиска);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ПроизвестиЗаменуВКонстанте(Результат,МестоИспользования,ПараметрыЗаписи,ВнутренняяТранзакция)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПроизвестиЗаменуВКонстанте(Результат,МестоИспользования,ПараметрыЗаписи,ВнутренняяТранзакция);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ПроизвестиЗаменуВОбъекте(Результат,МестоИспользования,ПараметрыВыполнения,ВнутренняяТранзакция)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПроизвестиЗаменуВОбъекте(Результат,МестоИспользования,ПараметрыВыполнения,ВнутренняяТранзакция);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ПроизвестиЗаменуВНаборе(Результат,МестоИспользования,ПараметрыВыполнения,ВнутренняяТранзакция)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПроизвестиЗаменуВНаборе(Результат,МестоИспользования,ПараметрыВыполнения,ВнутренняяТранзакция);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ПроизвестиЗаменуВРегистреСведений(Результат,МестоИспользования,ПараметрыВыполнения,ВнутренняяТранзакция)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПроизвестиЗаменуВРегистреСведений(Результат,МестоИспользования,ПараметрыВыполнения,ВнутренняяТранзакция);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ИзмененныеОбъектыПриЗаменеВОбъекте(ПараметрыВыполнения,МестоИспользования,ОбрабатываемыеСтроки)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ИзмененныеОбъектыПриЗаменеВОбъекте(ПараметрыВыполнения,МестоИспользования,ОбрабатываемыеСтроки);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ЗарегистрироватьФактЗамены(Объект,СсылкаДубля,СсылкаОригинала,ВидРеквизита,ИмяРеквизита,Индекс,ИмяКолонки)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗарегистрироватьФактЗамены(Объект,СсылкаДубля,СсылкаОригинала,ВидРеквизита,ИмяРеквизита,Индекс,ИмяКолонки);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_УдалитьСсылкиНемонопольно(Результат,СписокСсылок,ПараметрыВыполнения,УдалятьНепосредственно)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().УдалитьСсылкиНемонопольно(Результат,СписокСсылок,ПараметрыВыполнения,УдалятьНепосредственно);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ДобавитьРезультатыЗаменыИзмененныхОбъектов(Результат,ТаблицаПовторногоПоиска)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ДобавитьРезультатыЗаменыИзмененныхОбъектов(Результат,ТаблицаПовторногоПоиска);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ЗаблокироватьМестаИспользования(ПараметрыВыполнения,Блокировка,МестаИспользования)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗаблокироватьМестаИспользования(ПараметрыВыполнения,Блокировка,МестаИспользования);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ЗаблокироватьМестоИспользования(ПараметрыВыполнения,Блокировка,МестоИспользования)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗаблокироватьМестоИспользования(ПараметрыВыполнения,Блокировка,МестоИспользования);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеДвижений(Мета)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеДвижений(Мета);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеПоследовательностей(Мета)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеПоследовательностей(Мета);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеОбъекта(Мета)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеОбъекта(Мета);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеКлючаЗаписи(Мета)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеКлючаЗаписи(Мета);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписанияТиповПересекаются(Описание1,Описание2)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписанияТиповПересекаются(Описание1,Описание2);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_СпискиПолейПоТипу(ИсточникДанных,МетаИзмерения,ИсключатьПоля)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СпискиПолейПоТипу(ИсточникДанных,МетаИзмерения,ИсключатьПоля);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ЗаменитьВКоллекцииСтрок(ВидКоллекции,ИмяКоллекции,Объект,Коллекция,СписокПолей,ПарыЗамен)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗаменитьВКоллекцииСтрок(ВидКоллекции,ИмяКоллекции,Объект,Коллекция,СписокПолей,ПарыЗамен);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ОбработатьОбъектСПерехватомСообщенийПриЗаменеСсылок(Объект,Действие,РежимЗаписи,ПараметрыЗаписи)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОбработатьОбъектСПерехватомСообщенийПриЗаменеСсылок(Объект,Действие,РежимЗаписи,ПараметрыЗаписи);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_СообщитьОтложенныеСообщения(Сообщения)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СообщитьОтложенныеСообщения(Сообщения);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ЗаписатьОбъектПриЗаменеСсылок(Объект,ПараметрыЗаписи)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗаписатьОбъектПриЗаменеСсылок(Объект,ПараметрыЗаписи);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_СобытиеЖурналаРегистрацииЗаменыСсылок()
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СобытиеЖурналаРегистрацииЗаменыСсылок();
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ЗарегистрироватьОшибкуВТаблицу(Результат,Дубль,Оригинал,Данные,Информация,ТипОшибки,ИнформацияОбОшибке)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗарегистрироватьОшибкуВТаблицу(Результат,Дубль,Оригинал,Данные,Информация,ТипОшибки,ИнформацияОбОшибке);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ИнформацияОТипе(ПолноеИмяИлиМетаданныеИлиТип,Кэш)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ИнформацияОТипе(ПолноеИмяИлиМетаданныеИлиТип,Кэш);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ИнформацияПоРеквизиту(МетаданныеРеквизита)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ИнформацияПоРеквизиту(МетаданныеРеквизита);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоСлужебныеДанные(МестоИспользования,ИсключенияПоискаСсылок)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоСлужебныеДанные(МестоИспользования,ИсключенияПоискаСсылок);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоДокумент(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоДокумент(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоСправочник(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоСправочник(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоПеречисление(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоПеречисление(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоПланОбмена(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоПланОбмена(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоПланВидовХарактеристик(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоПланВидовХарактеристик(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоБизнесПроцесс(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоБизнесПроцесс(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоЗадача(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоЗадача(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоПланСчетов(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоПланСчетов(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоПланВидовРасчета(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоПланВидовРасчета(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоРегистрСведений(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоРегистрСведений(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоРегистрНакопления(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоРегистрНакопления(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоРегистрБухгалтерии(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоРегистрБухгалтерии(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоРегистрРасчета(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоРегистрРасчета(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоКонстанта(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоКонстанта(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоЖурналДокументов(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоЖурналДокументов(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоПоследовательность(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоПоследовательность(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоРегламентноеЗадание(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоРегламентноеЗадание(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоРегистр(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоРегистр(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоОбъектСсылочногоТипа(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоОбъектСсылочногоТипа(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ИменаРеквизитовПоТипу(Ссылка,Тип)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ИменаРеквизитовПоТипу(Ссылка,Тип);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_МенеджерОбъектаПоПолномуИмени(ПолноеИмя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_МенеджерОбъектаПоСсылке(Ссылка)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().МенеджерОбъектаПоСсылке(Ссылка);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоСсылка(ПроверяемыйТип)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоСсылка(ПроверяемыйТип);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_СсылкаСуществует(ПроверяемаяСсылка)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СсылкаСуществует(ПроверяемаяСсылка);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ВидОбъектаПоСсылке(Ссылка)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ВидОбъектаПоСсылке(Ссылка);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ВидОбъектаПоТипу(ТипОбъекта)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ВидОбъектаПоТипу(ТипОбъекта);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ИмяТаблицыПоСсылке(Ссылка)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ИмяТаблицыПоСсылке(Ссылка);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЗначениеСсылочногоТипа(Значение)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗначениеСсылочногоТипа(Значение);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОбъектЯвляетсяГруппой(Объект)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОбъектЯвляетсяГруппой(Объект);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_СтроковоеПредставлениеТипа(Тип)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().СтроковоеПредставлениеТипа(Тип);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеСвойствОбъекта(ОбъектМетаданных,Свойства)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеСвойствОбъекта(ОбъектМетаданных,Свойства);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЭтоСтандартныйРеквизит(СтандартныеРеквизиты,ИмяРеквизита)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЭтоСтандартныйРеквизит(СтандартныеРеквизиты,ИмяРеквизита);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЕстьРеквизитОбъекта(ИмяРеквизита,МетаданныеОбъекта)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЕстьРеквизитОбъекта(ИмяРеквизита,МетаданныеОбъекта);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеТипаСостоитИзТипа(ОписаниеТипа,ТипЗначения)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеТипаСостоитИзТипа(ОписаниеТипа,ТипЗначения);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеТипаСтрока(ДлинаСтроки)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеТипаСтрока(ДлинаСтроки);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеТипаЧисло(Разрядность,РазрядностьДробнойЧасти,ЗнакЧисла)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеТипаЧисло(Разрядность,РазрядностьДробнойЧасти,ЗнакЧисла);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ОписаниеТипаДата(ЧастиДаты)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ОписаниеТипаДата(ЧастиДаты);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеОбщихНастроекСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекСохранитьМассив(НесколькоНастроек,ОбновитьПовторноИспользуемыеЗначения)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеОбщихНастроекСохранитьМассив(НесколькоНастроек,ОбновитьПовторноИспользуемыеЗначения);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеОбщихНастроекЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеОбщихНастроекУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеОбщихНастроекУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеСистемныхНастроекСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеСистемныхНастроекСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ХранилищеСистемныхНастроекЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеСистемныхНастроекЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеСистемныхНастроекУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеСистемныхНастроекУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя);
КонецПроцедуры
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеНастроекДанныхФормСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеНастроекДанныхФормСохранить(КлючОбъекта,КлючНастроек,Настройки,ОписаниеНастроек,ИмяПользователя,ОбновитьПовторноИспользуемыеЗначения);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ХранилищеНастроекДанныхФормЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеНастроекДанныхФормЗагрузить(КлючОбъекта,КлючНастроек,ЗначениеПоУмолчанию,ОписаниеНастроек,ИмяПользователя);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_ХранилищеНастроекДанныхФормУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ХранилищеНастроекДанныхФормУдалить(КлючОбъекта,КлючНастроек,ИмяПользователя);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ВыполнитьАлгоритм(АлгоритмСсылка,ВходящиеПараметры,ОшибкаВыполнения,СообщениеОбОшибке)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ВыполнитьАлгоритм(АлгоритмСсылка,ВходящиеПараметры,ОшибкаВыполнения,СообщениеОбОшибке);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ПолучитьСсылкуСправочникАлгоритмы(Алгоритм)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ПолучитьСсылкуСправочникАлгоритмы(Алгоритм);
КонецФункции
&НаСервере
Процедура УИ_ГЕНЕРАЦИЯ_УстановитьПризнакЗаписиБезАвторегистрацииИзменений(Объект,БезАвторегистрации)
	УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().УстановитьПризнакЗаписиБезАвторегистрацииИзменений(Объект,БезАвторегистрации);
КонецПроцедуры
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ВыполнитьПроцедуруПередЗаписьюОбъекта(Объект,_ТекстПроцедурыПередЗаписью)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ВыполнитьПроцедуруПередЗаписьюОбъекта(Объект,_ТекстПроцедурыПередЗаписью);
КонецФункции
&НаСервере
Функция УИ_ГЕНЕРАЦИЯ_ЗаписатьОбъектВБазу(Объект,ПараметрыЗаписи,Действие,РежимЗаписи,ЗаменаСсылок)
	Возврат УИ_ГЕНЕРАЦИЯ_ОбъектМодуля().ЗаписатьОбъектВБазу(Объект,ПараметрыЗаписи,Действие,РежимЗаписи,ЗаменаСсылок);
КонецФункции

