
Функция ПолучитьРеквизитыВладельцевДополнительныхРеквизитов(Объект) Экспорт

	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		ИмяТипаОбъекта = Объект;
	Иначе
		ИмяТипаОбъекта = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИмяТипаОбъекта(Объект);
	КонецЕсли;
	
	Реквизиты = Новый Массив;
	Если ИмяТипаОбъекта="Справочник.вмс_Контейнеры" Тогда
		Реквизиты.Добавить("Вид");
	ИначеЕсли ИмяТипаОбъекта="Документ.вмс_ЗаданиеКладовщику" Тогда
		Реквизиты.Добавить("Правило");
	КонецЕсли;
	
	Возврат Реквизиты;

КонецФункции
