// Адаптация: в расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ОбщийМодуль(ИмяМодуля);
КонецФункции

Функция НовыйОбъект(ИмяКласса, ИдентификаторОбъекта=Неопределено, знач ПроцессорКода=Неопределено) Экспорт
	
	Если ПроцессорКода=Неопределено Тогда
		ПроцессорКода = вмс_ВыполнениеПрограммногоКода.ГлобальныйПроцессорКода();
	КонецЕсли;
	
	Класс = ПроцессорКода.ТекущиеДанныеДляВыполненияКода.ДанныеКлассов[ИмяКласса];
	
	Если Класс=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ИдентификаторОбъекта=Неопределено Тогда
		ИдентификаторОбъекта = ПроцессорКода.ИдентификаторНовогоОбъекта;
		ПроцессорКода.ИдентификаторНовогоОбъекта = ИдентификаторОбъекта + 1;
	КонецЕсли;
	
	ПроцессорКода.ПулОбъектов.Вставить(ИдентификаторОбъекта, Неопределено); //подготовим место в пуле объектов
	
	СсылкаНаОбъект = Новый Структура;
	СсылкаНаОбъект.Вставить("ИдентификаторОбъекта", ИдентификаторОбъекта);
	СсылкаНаОбъект.Вставить("ЭтоСсылкаНаКлассныйОбъект", Истина);
	
	Объект = Новый Структура;
	Объект.Вставить("ИмяКласса", ИмяКласса);
	Объект.Вставить("ИмяКлассаДляВыполненияКода", ИмяКласса);
	Объект.Вставить("НативныйОбъект");
	Объект.Вставить("Поля", Новый Структура);
	Для Каждого ЭлементПоля Из Класс.Поля Цикл
		Объект.Поля.Вставить(ЭлементПоля.Ключ);
	КонецЦикла;
	Объект.Вставить("ЭтоКлассныйОбъект", Истина);
	Объект.Вставить("Ссылка", СсылкаНаОбъект);
	
	КонструкторОбъекта(Объект, Класс, ПроцессорКода);
	
	Возврат Объект;
	
КонецФункции

Функция КонструкторОбъекта(Объект, Класс, ПроцессорКода)
	
	Для Каждого ИмяКонструктора Из Класс.Конструкторы Цикл
		вмс_ВыполнениеПрограммногоКода.ВызовПодпрограммы(Объект, Объект.ИмяКласса, ИмяКонструктора, ПроцессорКода);
	КонецЦикла;
	
КонецФункции

Функция ЭтоКлассныйОбъект(Объект) Экспорт
	
	Возврат ТипЗнч(Объект)=Тип("Структура") И Объект.Свойство("ЭтоКлассныйОбъект");
	
КонецФункции

Функция ПолучитьКлассныйОбъект(Объект, ПроцессорКода) Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Если ТипОбъекта=Тип("Структура") Тогда
		Если Объект.Свойство("ЭтоКлассныйОбъект") Тогда
			Возврат Объект;
		КонецЕсли;

		Если Объект.Свойство("ЭтоСсылкаНаКлассныйОбъект") Тогда
			Объект = ПроцессорКода.ПулОбъектов[Объект.ИдентификаторОбъекта];
			Возврат Объект;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипОбъекта=Тип("ФормаКлиентскогоПриложения") И Объект.ИмяФормы="ОбщаяФорма.вмс_ФормаШаблон" Тогда
		Возврат Объект.Переменные.КлассноеРасширение;
	КонецЕсли;
	
КонецФункции

Функция УстановитьЗначениеПоля(Объект, ИмяПоля, ЗначениеПоля, ПроцессорКода) Экспорт
	
	Возврат ВыполнитьМетод(Объект, "УстановитьЗначениеПоля", ПроцессорКода, ИмяПоля, ЗначениеПоля);
	
КонецФункции

Функция ПолучитьЗначениеПоля(Объект, ИмяПоля, ПроцессорКода) Экспорт
	
	Возврат ВыполнитьМетод(Объект, "ПолучитьЗначениеПоля", ПроцессорКода, ИмяПоля);
	
КонецФункции

Функция ВыполнитьМетод(знач ОбъектКонтекста_e8a17f9465ac4b1dbd98b4f6427d0162, ИмяМетода, ПроцессорКода=Неопределено, Параметр1_e8a17f9465ac4b1dbd98b4f6427d0162=null, Параметр2_e8a17f9465ac4b1dbd98b4f6427d0162=null, Параметр3_e8a17f9465ac4b1dbd98b4f6427d0162=null, Параметр4_e8a17f9465ac4b1dbd98b4f6427d0162=null, Параметр5_e8a17f9465ac4b1dbd98b4f6427d0162=null) Экспорт
	
	Класс = ПроцессорКода.ДанныеДляВыполненияКода.ДанныеКлассов[ОбъектКонтекста_e8a17f9465ac4b1dbd98b4f6427d0162.ИмяКласса];
	КодМетода = Класс.КодыПодпрограмм[ВРЕГ(ИмяМетода)];
	
	Результат_e8a17f9465ac4b1dbd98b4f6427d0162 = Неопределено;
	Выполнить(КодМетода);
	Возврат Результат_e8a17f9465ac4b1dbd98b4f6427d0162;
	
КонецФункции

Функция ПолучитьЗначениеПоляПриватно(Объект, ИмяПоля, ПроцессорКода=Неопределено) Экспорт
	
	Если ПроцессорКода=Неопределено Тогда
		ПроцессорКода = вмс_ВыполнениеПрограммногоКода.ГлобальныйПроцессорКода();
	КонецЕсли;

	КлассныйОбъект = ПолучитьКлассныйОбъект(Объект, ПроцессорКода);
	
	Если КлассныйОбъект <> Неопределено Тогда
		
		Если КлассныйОбъект.Поля.Свойство(ИмяПоля) Тогда
			
			Возврат КлассныйОбъект.Поля[ИмяПоля];
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если КлассныйОбъект.НативныйОбъект <> Неопределено Тогда
		
		Возврат КлассныйОбъект.НативныйОбъект[ИмяПоля];
		
	КонецЕсли;
	
КонецФункции

Функция УстановитьЗначениеПоляПриватно(Объект, ИмяПоля, ЗначениеПоля, ПроцессорКода=Неопределено) Экспорт
	
	Если ПроцессорКода=Неопределено Тогда
		ПроцессорКода = вмс_ВыполнениеПрограммногоКода.ГлобальныйПроцессорКода();
	КонецЕсли;
	
	КлассныйОбъект = ПолучитьКлассныйОбъект(Объект, ПроцессорКода);
	
	Если КлассныйОбъект <> Неопределено Тогда
		
		Если КлассныйОбъект.Поля.Свойство(ИмяПоля) Тогда
			
			КлассныйОбъект.Поля[ИмяПоля] = ЗначениеПоля;
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если КлассныйОбъект.НативныйОбъект <> Неопределено Тогда
		
		КлассныйОбъект.НативныйОбъект[ИмяПоля] = ЗначениеПоля;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьНативныйОбъект(Объект) Экспорт
	
	Возврат Объект.НативныйОбъект;
	
КонецФункции

Функция УстановитьНативныйОбъект(Объект, НативныйОбъект) Экспорт
	
	Объект.НативныйОбъект = НативныйОбъект;
	
КонецФункции
