&НаКлиенте
Процедура ОткрытьПравило(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Объет не записан");
		Возврат;
	КонецЕсли;  
	
	ОО = Новый ОписаниеОповещения("ОбработкаЗакрытияУниверсальнойФормыВвода", ЭтаФорма);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПравилоКонвертации", Объект.Ссылка);
	ОткрытьФорму("Обработка.вмс_УниверсальныйВводНаОсновании.Форма.Форма", ДополнительныеПараметры, ЭтаФорма,,,,ОО);  
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаЗакрытияУниверсальнойФормыВвода(Результат, ДополнительныеДанные) Экспорт

	ЭтотОбъект.Прочитать();   
	
КонецПроцедуры