#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ПериодОтчета = Новый СтандартныйПериод;
	Отчет.ПериодОтчета.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Отчет.ПериодОтчета.ДатаОкончания = ТекущаяДата(); 
	
	ПараметрДанных= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрДанных.Значение = Отчет.ПериодОтчета;
	ПараметрДанных.Использование=Истина; 
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Отчет.ПериодОтчета.ДатаНачала > Отчет.ПериодОтчета.ДатаОкончания Тогда
		
		Перенос = Отчет.ПериодОтчета.ДатаНачала;
		Отчет.ПериодОтчета.ДатаНачала = Отчет.ПериодОтчета.ДатаОкончания;
		Отчет.ПериодОтчета.ДатаОкончания = Перенос;
		
	КонецЕсли;
	
	Если Отчет.ПериодОтчета.ДатаОкончания > ТекущаяДата() Тогда
		
		Отчет.ПериодОтчета.ДатаОкончания = ТекущаяДата();		
		
	КонецЕсли;
	
	Если Отчет.ПериодОтчета.ДатаНачала > ТекущаяДата() Тогда
		
		Отчет.ПериодОтчета.ДатаНачала = ТекущаяДата();		
		
	КонецЕсли;  	
	
	ПараметрДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрДанных.Значение = Отчет.ПериодОтчета;
	ПараметрДанных.Использование=Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗаказПокупателя(Команда)
	РезультатСоздания = СоздатьЗаказ(Отчет.ПериодОтчета);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьЗаказ(Период);
		
	Запрос = ЗапросПоУслугам(Период);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	НовыйДокумент = Неопределено; 
	СтрокаЗаписи = Новый Структура;
	СтрокаЗаписи.Вставить("Контрагент"); 
	СтрокаЗаписи.Вставить("Организация");
	СтрокаЗаписи.Вставить("Вид");
	МассивДокументов = Новый Массив;    
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_УслугиОтветственногоХранения.Номенклатура КАК Номенклатура
	|ИЗ
	|	Справочник.вмс_УслугиОтветственногоХранения КАК вмс_УслугиОтветственногоХранения
	|ГДЕ
	|	вмс_УслугиОтветственногоХранения.Ссылка = &Ссылка";
	
	//ТУ_Кошелев 11.12.24 - Адаптация под УНФ; вызов метода Заполнить() после создания документа, для корректного отображения в списке и заполнения всех необходимых полей
	КонфигурацияУНФ = вмс_АдаптацияКонфигураций.ЭтоУНФ();
	Для каждого Строка Из Таблица Цикл  
		
		Если Строка.Вид = "Услуги" Тогда 
			
			Если СтрокаЗаписи.Контрагент <> Строка.Контрагент ИЛИ СтрокаЗаписи.Организация <> Строка.Организация Тогда
				
				Если КонфигурацияУНФ Тогда
					
					НовыйДокумент = Документы.ЗаказПокупателя.СоздатьДокумент();
					НовыйДокумент.Заполнить(Неопределено);
					
					НовыйДокумент.Контрагент = Строка.Контрагент;
					НовыйДокумент.Организация = Строка.Организация;
					НовыйДокумент.Дата = ТекущаяДата(); 
					
					НовыйДокумент.СуммаВключаетНДС = Истина;
					НовыйДокумент.ВалютаДокумента = Константы.ВалютаУчета.Получить();
					НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
					ДокументСтруктура = Новый Структура;
					ДокументСтруктура.Вставить("Документ");
					ДокументСтруктура.Вставить("Контрагент", НовыйДокумент.Контрагент);
					ДокументСтруктура.Вставить("Организация", НовыйДокумент.Организация);
				Иначе
					
					НовыйДокумент = Документы.ЗаказКлиента.СоздатьДокумент();
					НовыйДокумент.Заполнить(Неопределено);
					
					НовыйДокумент.Контрагент = Строка.Контрагент;
					НовыйДокумент.Организация = Строка.Организация;
					НовыйДокумент.Дата = ТекущаяДата(); 
					
					НовыйДокумент.Партнер = Строка.Контрагент.Партнер;  
					НовыйДокумент.ЦенаВключаетНДС = Истина;
					НовыйДокумент.Валюта =  Константы.ВалютаРегламентированногоУчета.Получить();
					НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;   
					НовыйДокумент.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению; 
					НовыйДокумент.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
					НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
					ДокументСтруктура = Новый Структура;
					ДокументСтруктура.Вставить("Документ");
					ДокументСтруктура.Вставить("Контрагент", НовыйДокумент.Контрагент);
					ДокументСтруктура.Вставить("Организация", НовыйДокумент.Организация);
				КонецЕсли;
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если Строка.Вид = "Хранение" Тогда  
			
			НайденныйДокумент = Неопределено;
			
			Для каждого Документ Из МассивДокументов Цикл
				
				Если Документ.Контрагент = Строка.Контрагент И Документ.Организация = Строка.Организация Тогда
					НайденныйДокумент = Документ;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НайденныйДокумент = Неопределено Тогда
				
				Если КонфигурацияУНФ Тогда
					
					НовыйДокумент = Документы.ЗаказПокупателя.СоздатьДокумент();
					НовыйДокумент.Заполнить(Неопределено);
					
					НовыйДокумент.Контрагент = Строка.Контрагент;
					НовыйДокумент.Организация = Строка.Организация;
					НовыйДокумент.Дата = ТекущаяДата();
					
					НовыйДокумент.СуммаВключаетНДС = Истина;
					НовыйДокумент.ВалютаДокумента = Константы.ВалютаУчета.Получить();
					НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
				Иначе   
					
					НовыйДокумент = Документы.ЗаказКлиента.СоздатьДокумент();
					НовыйДокумент.Заполнить(Неопределено);
					
					НовыйДокумент.Контрагент = Строка.Контрагент;
					НовыйДокумент.Организация = Строка.Организация;
					НовыйДокумент.Дата = ТекущаяДата();
					
					НовыйДокумент.Партнер = Строка.Контрагент.Партнер;  
					НовыйДокумент.ЦенаВключаетНДС = Истина;
					НовыйДокумент.Валюта =  Константы.ВалютаРегламентированногоУчета.Получить();
					НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
					НовыйДокумент.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению; 
					НовыйДокумент.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
					НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
				КонецЕсли;
			Иначе
				Отбор = Новый Структура;
				Отбор.Вставить("Содержание", Строка.Операция);
				Если НайденныйДокумент.Товары.НайтиСтроки(Отбор).Количество() <> 0 Тогда
					
					Если КонфигурацияУНФ Тогда
						
						НовыйДокумент = Документы.ЗаказПокупателя.СоздатьДокумент();
						НовыйДокумент.Заполнить(Неопределено);
						
						НовыйДокумент.Контрагент = Строка.Контрагент;
						НовыйДокумент.Организация = Строка.Организация;
						НовыйДокумент.Дата = ТекущаяДата();
						
						
						НовыйДокумент.СуммаВключаетНДС = Истина;
						НовыйДокумент.ВалютаДокумента = Константы.ВалютаУчета.Получить();
						НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
					Иначе 
						
						НовыйДокумент = Документы.ЗаказКлиента.СоздатьДокумент();
						НовыйДокумент.Заполнить(Неопределено);
						
						НовыйДокумент.Контрагент = Строка.Контрагент;
						НовыйДокумент.Организация = Строка.Организация;
						НовыйДокумент.Дата = ТекущаяДата();
						
						
						НовыйДокумент.Партнер = Строка.Контрагент.Партнер;  
						НовыйДокумент.ЦенаВключаетНДС = Истина;  
						НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
						НовыйДокумент.Валюта =  Константы.ВалютаРегламентированногоУчета.Получить();  
						НовыйДокумент.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению; 
						НовыйДокумент.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
						НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
					КонецЕсли;
					
				Иначе
					НовыйДокумент = НайденныйДокумент;
				КонецЕсли;
				
			КонецЕсли;            
			
			
		КонецЕсли;  
		
		СтрокаЗаписи = Строка;
		
		Если КонфигурацияУНФ Тогда
			СтрокаТЧ = НовыйДокумент.Запасы.Добавить();	
			Запрос.УстановитьПараметр("Ссылка", Строка.Операция);
			Выборка = Запрос.Выполнить().Выбрать(); 
			Выборка.Следующий();
			СтрокаТЧ.Номенклатура = Выборка.Номенклатура;
			СтрокаТЧ.Содержание = СтрокаЗаписи.Операция;
			СтрокаТЧ.Количество = СтрокаЗаписи.Количество;
			СтрокаТЧ.Сумма = СтрокаЗаписи.Сумма;
			СтрокаТЧ.Цена = СтрокаЗаписи.Сумма / СтрокаЗаписи.Количество;
			ОбработатьСтрокуТабличнойЧасти(СтрокаТЧ, НовыйДокумент);
		Иначе
			СтрокаТЧ = НовыйДокумент.Товары.Добавить();	
			Запрос.УстановитьПараметр("Ссылка", Строка.Операция);
			Выборка = Запрос.Выполнить().Выбрать(); 
			Выборка.Следующий();
			СтрокаТЧ.Номенклатура = Выборка.Номенклатура;
			СтрокаТЧ.Содержание = СтрокаЗаписи.Операция;
			СтрокаТЧ.Количество = СтрокаЗаписи.Количество;
			СтрокаТЧ.КоличествоУпаковок = СтрокаЗаписи.Количество;
			СтрокаТЧ.Сумма = СтрокаЗаписи.Сумма;
			СтрокаТЧ.Цена = СтрокаЗаписи.Сумма / СтрокаЗаписи.Количество;  
			СтрокаТЧ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;	
			СтрокаТЧ.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("20%");
			ОбработатьСтрокуТабличнойЧасти(СтрокаТЧ, НовыйДокумент);
		КонецЕсли;
		
		НайденныйДокумент = Неопределено;
		
		Для каждого Документ Из МассивДокументов Цикл
			
			Если Документ.Контрагент = Строка.Контрагент И Документ.Организация = Строка.Организация Тогда
				НайденныйДокумент = Документ;
				Прервать;
			КонецЕсли;
			
		КонецЦикла; 
		
		Если НайденныйДокумент = Неопределено Тогда		
			МассивДокументов.Добавить(НовыйДокумент);
		Иначе
			НайденныйДокумент = НовыйДокумент;
		КонецЕсли;
		
	КонецЦикла; 
	
	Для каждого Документ Из МассивДокументов Цикл
		
		//ТУ_Прошин_11.04.24++  
		Если КонфигурацияУНФ Тогда  
			ИтоговаяСумма = Документ.Товары.Итог("СуммаСНДС"); 
			Документ.СуммаДокумента = ИтоговаяСумма; 	
		Иначе
			ИтоговаяСумма = Документ.Запасы.Итог("СуммаСНДС"); 
			Документ.СуммаДокумента = ИтоговаяСумма; 
		КонецЕсли;
		//ТУ_Прошин_11.04.24--
		
		Документ.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
	Возврат Истина; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОбработатьСтрокуТабличнойЧасти(СтрокаТабличнойЧасти, Документ) 
	
	Если вмс_АдаптацияКонфигураций.ЭтоУТ() Тогда  
		
		СтруктураПересчетаСуммы = Новый Структура;
		
		Выполнить("СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Документ)"); 
		СтруктураДействий = Новый Структура; 
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы); 
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы); 
		СтруктураДействий.Вставить("ПересчитатьСумму");   
		Выполнить("ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТабличнойЧасти, СтруктураДействий, Неопределено)");
		
		
	КонецЕсли; 
	
	Если вмс_АдаптацияКонфигураций.ЭтоЕРП() Тогда    
		
		СтруктураПересчетаСуммы = Новый Структура;
		
		Выполнить("СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Документ)"); 
		СтруктураДействий = Новый Структура; 
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы); 
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы); 
		СтруктураДействий.Вставить("ПересчитатьСумму");   
		Выполнить("ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТабличнойЧасти, СтруктураДействий, Неопределено)");
		
	КонецЕсли;
	
	Если вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		
		ПараметрыРасчета = Новый Структура("СброситьФлагСкидкиРассчитаны",Истина);
		ПараметрыРасчета.Вставить("СуммаВключаетНДС",Документ.СуммаВключаетНДС);
		ПараметрыРасчета.Вставить("ИспользоватьМинимальныеЦены", Ложь);
		
		Выполнить("ТабличныеЧастиУНФКлиентСервер.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета)");	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапросПоУслугам(Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	               	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, aa.a * 1000 + bb.b * 100 + cc.c * 10 + dd.d) КАК Период
	|	               ПОМЕСТИТЬ ВТ_ДниРасчета
	|	               ИЗ
	|	               	(ВЫБРАТЬ
	|	               		0 КАК a
	|	               	
	|	               	ОБЪЕДИНИТЬ
	|	               	
	|	               	ВЫБРАТЬ
	|	               		1
	|	               	
	|	               	ОБЪЕДИНИТЬ
	|	               	
	|	               	ВЫБРАТЬ
	|	               		2
	|	               	
	|	               	ОБЪЕДИНИТЬ
	|	               	
	|	               	ВЫБРАТЬ
	|	               		3
	|	               	
	|	               	ОБЪЕДИНИТЬ
	|	               	
	|	               	ВЫБРАТЬ
	|	               		4
	|	               	
	|	               	ОБЪЕДИНИТЬ
	|	               	
	|	               	ВЫБРАТЬ
	|	               		5
	|	               	
	|	               	ОБЪЕДИНИТЬ
	|	               	
	|	               	ВЫБРАТЬ
	|	               		6
	|	               	
	|	               	ОБЪЕДИНИТЬ
	|	               	
	|	               	ВЫБРАТЬ
	|	               		7
	|	               	
	|	               	ОБЪЕДИНИТЬ
	|	               	
	|	               	ВЫБРАТЬ
	|	               		8
	|	               	
	|	               	ОБЪЕДИНИТЬ
	|	               	
	|	               	ВЫБРАТЬ
	|	               		9) КАК aa
	|	               		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|	               			0 КАК b
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			1
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			2
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			3
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			4
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			5
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			6
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			7
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			8
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			9) КАК bb
	|	               		ПО (ИСТИНА)
	|	               		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|	               			0 КАК c
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			1
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			2
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			3
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			4
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			5
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			6
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			7
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			8
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			9) КАК cc
	|	               		ПО (ИСТИНА)
	|	               		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|	               			0 КАК d
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			1
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			2
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			3
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			4
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			5
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			6
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			7
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			8
	|	               		
	|	               		ОБЪЕДИНИТЬ
	|	               		
	|	               		ВЫБРАТЬ
	|	               			9) КАК dd
	|	               		ПО (ИСТИНА)
	|	               ГДЕ
	|	               	aa.a * 1000 + bb.b * 100 + cc.c * 10 + dd.d <= РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, ДЕНЬ)
	|	               ;
	|	               
	|	               ////////////////////////////////////////////////////////////////////////////////
	|	               ВЫБРАТЬ
	|	               	ВТ_ДниРасчета.Период КАК Период,
	|	               	УслугиХранения.Контрагент КАК Контрагент,
	|	               	УслугиХранения.Организация КАК Организация,
	|	               	УслугиХранения.Операция КАК Операция,
	|	               	SQRT(POW(УслугиХранения.СуммаОборот, 2)) КАК Сумма,
	|	               	SQRT(POW(УслугиХранения.КоличествоОборот, 2)) КАК Количество,
	|	               	""Услуги"" КАК Вид
	|	               ПОМЕСТИТЬ ВТ_ОборотыУслуг
	|	               ИЗ
	|	               	ВТ_ДниРасчета КАК ВТ_ДниРасчета
	|	               		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_РазовыеОперацииХранения.Обороты(, , День, ) КАК УслугиХранения
	|	               		ПО ВТ_ДниРасчета.Период = УслугиХранения.Период
	|	               ГДЕ
	|	               	НЕ УслугиХранения.Контрагент ЕСТЬ NULL
	|	               ;
	|	               
	|	               ////////////////////////////////////////////////////////////////////////////////
	|	               ВЫБРАТЬ
	|	               	ВТ_ДниРасчета.Период КАК Период,
	|	               	Хранение.Контрагент КАК Контрагент,
	|	               	Хранение.Организация КАК Организация,
	|	               	1 КАК Количество,
	|	               	""Хранение"" КАК Вид,
	|	               	СУММА(ВЫБОР
	|	               			КОГДА Хранение.Период = &НачалоПериода
	|	               				ТОГДА Хранение.СуммаКонечныйОстаток
	|	               			ИНАЧЕ ВЫБОР
	|	               					КОГДА Хранение.Период <= ВТ_ДниРасчета.Период
	|	               						ТОГДА Хранение.СуммаОборот
	|	               					ИНАЧЕ 0
	|	               				КОНЕЦ
	|	               		КОНЕЦ) КАК Сумма,
	|	               	Хранение.Операция КАК Операция
	|	               ПОМЕСТИТЬ ВТ_Хранение
	|	               ИЗ
	|	               	ВТ_ДниРасчета КАК ВТ_ДниРасчета
	|	               		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ПосуточныеОперацииХранения.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , ) КАК Хранение
	|	               		ПО (Хранение.Период <= ВТ_ДниРасчета.Период)
	|	                             ГДЕ 
	|	                             НЕ Хранение.Контрагент ЕСТЬ NULL
	|	                             //	Хранение.Операция.ВидДвижения <>    ЗНАЧЕНИЕ(Перечисление.вмс_ВидыДвиженияУслугОтветственногоХранения.Хранение)
	|	               
	|	               СГРУППИРОВАТЬ ПО
	|	               	ВТ_ДниРасчета.Период,
	|	               	Хранение.Контрагент,
	|	               	Хранение.Организация,
	|	               	Хранение.Операция
	|	               ;
	|	               
	|	               ////////////////////////////////////////////////////////////////////////////////
	|	               ВЫБРАТЬ
	|	               	ВТ_ОборотыУслуг.Контрагент КАК Контрагент,
	|	               	ВТ_ОборотыУслуг.Организация КАК Организация,
	|	               	ВТ_ОборотыУслуг.Операция КАК Операция,
	|	               	СУММА(ВТ_ОборотыУслуг.Сумма) КАК Сумма,
	|	               	СУММА(ВТ_ОборотыУслуг.Количество) КАК Количество,
	|	               	ВТ_ОборотыУслуг.Вид КАК Вид
	|	               ИЗ
	|	               	ВТ_ОборотыУслуг КАК ВТ_ОборотыУслуг
	|	               
	|	               СГРУППИРОВАТЬ ПО
	|	               	ВТ_ОборотыУслуг.Контрагент,
	|	               	ВТ_ОборотыУслуг.Организация,
	|	               	ВТ_ОборотыУслуг.Операция,
	|	               	ВТ_ОборотыУслуг.Вид
	|	               
	|	               ОБЪЕДИНИТЬ ВСЕ
	|	               
	|	               ВЫБРАТЬ
	|	               	ВТ_Хранение.Контрагент,
	|	               	ВТ_Хранение.Организация,
	|	               	ВТ_Хранение.Операция,
	|	               	СУММА(ВТ_Хранение.Сумма),
	|	               	СУММА(ВТ_Хранение.Количество),
	|	               	ВТ_Хранение.Вид
	|	               ИЗ
	|	               	ВТ_Хранение КАК ВТ_Хранение
	|	               
	|	               СГРУППИРОВАТЬ ПО
	|	               	ВТ_Хранение.Контрагент,
	|	               	ВТ_Хранение.Организация,
	|	               	ВТ_Хранение.Операция,
	|	               	ВТ_Хранение.Вид
	|";    
	
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

