Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
    Настройки.ФормироватьСразу = Истина;
    Настройки.РазрешеноИзменятьВарианты = Ложь;
    Настройки.События.ПриСозданииНаСервере = Истина;
КонецПроцедуры



Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт  
	
	НоваяКоманда = Форма.Команды.Добавить("КомандаОткрытьОтпуска");
	НоваяКоманда.Действие = "ОткрытьОтпуска";//Имя процедуры
	НоваяКоманда.Заголовок = "Отпуска";
	
	НовыйЭлемент = Форма.Элементы.Добавить("ЭлементОткрытьОтпуска", Тип("КнопкаФормы"), Форма.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "КомандаОткрытьОтпуска";
	
КонецПроцедуры