// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// #КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекст();
	УстановитьЗаголовок();
	ЗаполнитьСпискиВыбора();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийФормы

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	ОбновитьНаименование();
	НастроитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОформленияПриИзменении(Элемент)
	
	ОбновитьНаименование();
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиСобытийЭлементовФормы

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНаСервере();
	
	ОповеститьОбИзменении(Ссылка);
	
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти // ОбработчикиКомандФормы

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекст()
	
	Ссылка = Параметры.Ссылка;
	
	Параметры.Свойство("СсылкаДляКопирования", СсылкаДляКопирования);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СсылкаНаОбъект = Ссылка;
	ИначеЕсли ЗначениеЗаполнено(СсылкаДляКопирования) Тогда
		СсылкаНаОбъект = СсылкаДляКопирования;
	Иначе
		Активен = Истина;
		Возврат;
	КонецЕсли;
	
	ОписаниеРД = МодульОбъекта().РазрешительныйДокумент_Прочитать(СсылкаНаОбъект);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеРД,, "Ссылка");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Заголовок = МодульОбъекта().ПараметрыВСтроку(
		НСтр("ru = 'Разрешительный документ: %1'"), СокрЛП(Ссылка));
	Иначе
		Заголовок = НСтр("ru = 'Разрешительный документ: создание'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	СписокВыбора = Элементы.ВидДокумента.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ВидыРазрешительныхДокументов();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьЭлементовФормы()
	
	ВидыРД = МодульОбъекта().Перечисление_ВидыРазрешительныхДокументов();
	
	ЭтоРегУдостоверениеВетПрепарата = ВидДокумента = ВидыРД.РегистрационноеУдостоверениеВетПрепарата;
	
	Элементы.Активен.Видимость = ЗначениеЗаполнено(Ссылка);
	Элементы.Серия.Видимость = ЭтоРегУдостоверениеВетПрепарата;
	Элементы.ГлобальныйИдентификаторПродукции.Видимость = ЭтоРегУдостоверениеВетПрепарата;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ОписаниеРД = МодульОбъекта().Новый_РазрешительныйДокумент();
	ЗаполнитьЗначенияСвойств(ОписаниеРД, ЭтаФорма);
	
	Ссылка = МодульОбъекта().РазрешительныйДокумент_Записать(ОписаниеРД);
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаименование()
	
	Наименование = МодульОбъекта().РазрешительныйДокумент_СформироватьНаименование(ВидДокумента, Номер, ДатаОформления);
	
КонецПроцедуры

// #Область ПроверкаЗаполнения

&НаКлиенте
Функция ПроверитьЗаполнениеПолей()
	
	ОчиститьСообщения();
	
	Возврат ПроверитьЗаполнениеПолейНаСервере();
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеПолейНаСервере()
	
	ЕстьОшибки = Не ПроверитьЗаполнение();
	
	ВидыРД = МодульОбъекта().Перечисление_ВидыРазрешительныхДокументов();
	Если ВидДокумента = ВидыРД.РегистрационноеУдостоверение
		Или ВидДокумента = ВидыРД.РегистрационноеУдостоверениеВетПрепарата Тогда
		ЕстьОшибки = Истина;
		ШаблонОшибки = НСтр("ru = 'Ручное создание разрешительного документа с видом ""%1"" не доступно'");
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки, ВидДокумента);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ВидДокумента");
	КонецЕсли;
	
	Если Не МодульОбъекта().НомерРазрешительногоДокументаУникален(Номер, Ссылка) Тогда
		ЕстьОшибки = Истина;
		ТекстОшибки = НСтр("ru = 'Номер разрешительного документа не уникален'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "Номер");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номер) И ЗначениеЗаполнено(ВидДокумента)
		И Не МодульОбъекта().НомерРазрешительногоДокументаСоответствуетФормату(Номер, ВидДокумента) Тогда
		ЕстьОшибки = Истина;
		ТекстОшибки = НСтр("ru = 'Некорректный номер разрешительного документа'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "Номер");
	КонецЕсли;
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	Если НачалоДня(ДатаОформления) > ТекущаяДата Тогда
		ЕстьОшибки = Истина;
		ТекстОшибки = НСтр("ru = 'Дата оформления не может быть позже текущей даты'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ДатаОформления");
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

// #КонецОбласти // ПроверкаЗаполнения

// #КонецОбласти // СлужебныеПроцедурыИФункции
