//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

Функция ОткрытьКонструкторФормы(ФормаВладелец=Неопределено, ОписаниеОповещенияОЗакрытии=Неопределено, ТекстОписанияФормы=Неопределено) Экспорт
	
	Возврат глОбщийМодуль("РаботаСФормамиКлиент").ОткрытьФормуУлучшенная("Обработка.КонструкторФорм.Форма", Новый Структура("ТекстОписанияФормы", ТекстОписанияФормы), ФормаВладелец, , , , ОписаниеОповещенияОЗакрытии);

КонецФункции