#Область ПрограммныйИнтерфейс

Функция НастройкиРазмещения() Экспорт
	
	МенеджерНастроек = Справочники.вмс_НастройкиПрограммы;
	
	Настройки = Новый Структура();
	Настройки.Вставить("ИспользоватьВГХ" ,						МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("ВГХ_ИспользоватьВесогабариты"));
	Настройки.Вставить("ПриоритетДляМонотоварныхЯчеек" ,		МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("ВГХ_Приоритет_Монотовары"));
	Настройки.Вставить("ПриоритетДляСмешанныхЯчеек" ,			МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("ВГХ_Приоритет_Смешанные"));
	Настройки.Вставить("ПриоритетДляПустыхЯчеек" ,				МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("ВГХ_Приоритет_Пустые"));
	Настройки.Вставить("ПриоритетДляПрочихЯчеек" ,				МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("ВГХ_Приоритет_Прочие"));
	Настройки.Вставить("ПриоритетДляИсторическихЯчеек" ,		МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("ВГХ_Приоритет_Исторические"));
	Настройки.Вставить("ПриоритетДляСтатическихЯчеек" ,			МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("ВГХ_Приоритет_Статические"));
	Настройки.Вставить("МонотоварностьПоТовару" ,				МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("ВГХ_Монотоварность_Товар"));
	Настройки.Вставить("МонотоварностьПоТоваруХарактеристике" ,	МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("ВГХ_Монотоварность_Характеристика"));
	Настройки.Вставить("МонотоварностьПоСерии" ,				МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("ВГХ_Монотоварность_Серия"));  
	// ТУ_Прошин_22.10.25+
	Настройки.Вставить("ЭтоПодпитка" ,							Ложь);    
	ДопустимыеТипыЯчеекРазмещения = Новый Массив;
	ДопустимыеТипыЯчеекРазмещения.Добавить(Перечисления.вмс_ТипыЯчеек.Хранение);
	Настройки.Вставить("ДопустимыеТипыЯчеекРазмещения",         ДопустимыеТипыЯчеекРазмещения); 
	Настройки.Вставить("ДопустимыеЯчейки",         				Новый Массив);
	// ТУ_Прошин_22.10.25-
	
	Возврат Настройки;
	
КонецФункции


Функция ПодобратьЯчейкиПолучатели(Знач ПараметрыЗаполнения) Экспорт		
	// 1. Не хватает статических ячеек
	// 2. Не хватает ячеек по истории +
	// 3. Не хватает монотоварности по серии (сделать чтобы остатки и смешанные ячейки бились по сроку годности)
	// 4. Не понятно как обрабатывается упаковка.
	// 5. Нет планирования по контейнерам
	
	// ТУ_Васильев 01.10.25 ++ 
	//Правило = ЗаданиеКладовщику.Правило;
	//Склад = ЗаданиеКладовщику.Склад;    
	РК = вмс_РаботаСКоллекциями;
	Если ТипЗнч(ПараметрыЗаполнения) <> Тип("Структура") Тогда
		ПараметрыЗаполнения = ПолучитьПараметрыДляПолученияЯчейкиПолучателя(ПараметрыЗаполнения);		
	КонецЕсли;
	
	Правило = ПараметрыЗаполнения.Правило;
	Склад = ПараметрыЗаполнения.Склад;	
	// ТУ_Васильев 01.10.25 --
	НастройкиРазмещения = НастройкиРазмещения();  
	// ТУ_Прошин_22.10.25+
	Если ПараметрыЗаполнения.Свойство("ЭтоПодпитка") И ПараметрыЗаполнения.ЭтоПодпитка Тогда     
		НастройкиРазмещения.ЭтоПодпитка = Истина;      
		ДопустимыеТипыЯчеекРазмещения = Новый Массив;
		ДопустимыеТипыЯчеекРазмещения.Добавить(Перечисления.вмс_ТипыЯчеек.ЗонаОтбора);   
		НастройкиРазмещения.ДопустимыеТипыЯчеекРазмещения = ДопустимыеТипыЯчеекРазмещения; 
	КонецЕсли;  
	
	Если ПараметрыЗаполнения.Свойство("ДопустимыеЯчейки") И ПараметрыЗаполнения.ДопустимыеЯчейки.Количество() > 0 Тогда  
		НастройкиРазмещения.ДопустимыеЯчейки = ПараметрыЗаполнения.ДопустимыеЯчейки;	
	КонецЕсли;
	
	// ТУ_Прошин_22.10.25-
	
	МаршрутРазмещения 	 = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("Контейнер, Ячейка, Приоритет, ПорядокЯчейки, Товар, Характеристика, Серия, Упаковка, Количество");  
	
	// ТУ_Васильев 01.10.25 ++
	//ТаблицаТоваров		 = ПодготовитьВходящуюТаблицу(ЗаданиеКладовщику.Товары); 
	вмс_РаботаСКоллекциями.ТипизироватьТаблицуЗначений(ПараметрыЗаполнения.Товары);
	ТаблицаТоваров		 = ПараметрыЗаполнения.Товары; 	
	// ТУ_Васильев 01.10.25 -- 
	
	// ТУ_Прошин_14.11.25+  пока закомментил       
	//ТаблицаКонтейнеров =  вмс_РаботаСКоллекциями.СкопироватьТаблицуЗначений(ТаблицаТоваров);       
	//
	//Для сч = -ТаблицаКонтейнеров.Количество() + 1 По 0 Цикл
	//	Если НЕ (ЗначениеЗаполнено(ТаблицаКонтейнеров[-сч].Контейнер) И НЕ ЗначениеЗаполнено(ТаблицаКонтейнеров[-сч].Товар)) Тогда
	//		ТаблицаКонтейнеров.Удалить(-сч);
	//	КонецЕсли;
	//КонецЦикла;   
	// ТУ_прошин_14.11.25-
	
	// ТУ_Прошин_14.11.25+    
	ПодготовитьТаблицуТоваровДляРазмещенияКонтейнеров(ТаблицаТоваров, Правило); 
	// ТУ_Прошин_14.11.25-
	
	ОбщаяТаблицаЗначений = СоздатьОбщуюТаблицуЯчеек();
	МенеджерВременныхТаблиц 	= МенеджерВременныхТаблиц_ВходящиеТовары(ТаблицаТоваров);
	
	ТаблицаМонотоварныхЯчеек 	= ПолучитьМонотоварныеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения);
	ДополнитьТаблицу(ТаблицаМонотоварныхЯчеек, ОбщаяТаблицаЗначений);
	
	ТаблицаСмешанныеЯчейки 		= ПолучитьСмешанныеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения);
	ДополнитьТаблицу(ТаблицаСмешанныеЯчейки, ОбщаяТаблицаЗначений);
	
	ТаблицаПустыеЯчейки 		= ПолучитьПустыеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения);
	ДополнитьТаблицу(ТаблицаПустыеЯчейки, ОбщаяТаблицаЗначений);
	
	ТаблицаИсторическиеЯчейки 	= ПолучитьЯчейкиПоИсторииТовара(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения);
	ДополнитьТаблицу(ТаблицаИсторическиеЯчейки, ОбщаяТаблицаЗначений);   
	
	// прочие - ячейки вообще с другим товаром.
	ТаблицаПрочиеЯчейки 		= ПолучитьПрочиеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, ОбщаяТаблицаЗначений, НастройкиРазмещения);	
	ДополнитьТаблицу(ТаблицаПрочиеЯчейки, ОбщаяТаблицаЗначений);    
	
	// ТУ_Васильев 01.10.25 ++
	ТаблицаСтатическиеЯчейки =  ПолучитьСтатическиеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения);
	ДополнитьТаблицу(ТаблицаСтатическиеЯчейки, ОбщаяТаблицаЗначений);
	ОбщаяТаблицаЗначений.Свернуть("Приоритет,СвободныйОбъем,Серия,Товар,Упаковка,Характеристика,Ячейка");
	// ТУ_Васильев 01.10.25 --
	
	// ТУ_Прошин_17.11.25+   
	Если НЕ НастройкиРазмещения.ИспользоватьВГХ Тогда 	 
		СостояниеКонтейнеров = ТаблицаТоваров.Скопировать();  
		СостояниеКонтейнеров.Свернуть("Контейнер");
		РК.УдалитьПустыеСтрокиКоллекции(СостояниеКонтейнеров,"Контейнер");
		Если СостояниеКонтейнеров.Количество() > 0 Тогда
			ЕстьКонтейнерыКРазмещениюБезВгх = Истина;     
			СостояниеКонтейнеров.Колонки.Добавить("Размещен", Новый ОписаниеТипов("Булево"));	
		Иначе
			ЕстьКонтейнерыКРазмещениюБезВгх = Ложь;
		КонецЕсли; 
	Иначе         
		ОпределитьОбъемТарыДляКонтейнеров(ТаблицаТоваров);
		ЕстьКонтейнерыКРазмещениюБезВгх = Ложь;
	КонецЕсли;
	
	// ТУ_Прошин_17.11.25-
	
	ОбщаяТаблицаЗначений.Сортировать("Приоритет ВОЗР");
	
	Для каждого СтрокаРаспоряжения Из ТаблицаТоваров Цикл
		
		ПараметрыОтбораПоТовару = Новый Структура;
		ПараметрОтбораПустойТовар = Новый Структура;
		МассивСтрок = Новый Массив;
		
		ПараметрыОтбораПоТовару.Вставить("Товар", СтрокаРаспоряжения.Товар);
		ПараметрыОтбораПоТовару.Вставить("Характеристика", СтрокаРаспоряжения.Характеристика);
		Если СтрокаРаспоряжения.Упаковка = Null ИЛИ СтрокаРаспоряжения.Упаковка = Неопределено Тогда
			ПараметрыОтбораПоТовару.Вставить("Упаковка", вмс_АдаптацияКонфигураций.ПустаяУпаковка());	
		Иначе
			ПараметрыОтбораПоТовару.Вставить("Упаковка", СтрокаРаспоряжения.Упаковка);		
		КонецЕсли;
		
		//ТУ_Августинович ++ 30.03.2026
		Если СтрокаРаспоряжения.ОбъемЕдиницыТовара = Null Тогда
			СтрокаРаспоряжения.ОбъемЕдиницыТовара = 0;
		КонецЕсли;
		//ТУ_Августинович -- 30.03.2026
		
		НайденныеЯчейки = ОбщаяТаблицаЗначений.НайтиСтроки(ПараметрыОтбораПоТовару);
		
		ПараметрОтбораПустойТовар.Вставить("Товар", Справочники.Номенклатура.ПустаяСсылка());
		ПустыеЯчейки = ОбщаяТаблицаЗначений.НайтиСтроки(ПараметрОтбораПустойТовар);
		
		ПодобранныеЯчейки = вмс_РаботаСКоллекциями.СложениеМассивов(НайденныеЯчейки, ПустыеЯчейки); 
		
		ПодобраноЯчеек = 0;
		
		Для каждого СтрокаПодобраннойЯчейки Из ПодобранныеЯчейки Цикл
			
			Если ОбщаяТаблицаЗначений.Индекс(СтрокаПодобраннойЯчейки)=-1 Тогда
				// строка удалена
				Продолжить;
			КонецЕсли;
			
			КоличествоКРазмещению = СтрокаРаспоряжения.Количество;   
			
			Если КоличествоКРазмещению <> 0 Тогда				
				Если НастройкиРазмещения.ИспользоватьВГХ Тогда    
					
					Если ЗначениеЗаполнено(СтрокаРаспоряжения.Контейнер) Тогда  
						
						// если товар в контейнере его нельзя раскидывать на разные ячейки
						Отбор = Новый Структура("Контейнер",СтрокаРаспоряжения.Контейнер);
						НайденныйМаршрутКонтейнера = МаршрутРазмещения.НайтиСтроки(Отбор);
						Если НайденныйМаршрутКонтейнера.Количество() > 0 Тогда     
							СтрокаМаршрута = НайденныйМаршрутКонтейнера[0];
							НоваяСтрока = МаршрутРазмещения.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспоряжения);
							НоваяСтрока.Ячейка = СтрокаМаршрута.Ячейка;
							НоваяСтрока.Приоритет = СтрокаМаршрута.Приоритет;
							НоваяСтрока.ПорядокЯчейки = НоваяСтрока.Ячейка.Приоритет;
							НоваяСтрока.Количество = КоличествоКРазмещению;
							СтрокаРаспоряжения.Количество = 0; 
						Иначе
							Если СтрокаПодобраннойЯчейки.СвободныйОбъем >= СтрокаРаспоряжения.ОбъемТары Тогда
								НоваяСтрока = МаршрутРазмещения.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспоряжения);
								НоваяСтрока.Ячейка = СтрокаПодобраннойЯчейки.Ячейка;
								НоваяСтрока.Приоритет = СтрокаПодобраннойЯчейки.Приоритет;
								НоваяСтрока.ПорядокЯчейки = НоваяСтрока.Ячейка.Приоритет;
								НоваяСтрока.Количество = КоличествоКРазмещению;
								ИзменитьСвободныйОбъемВЯчейках(ОбщаяТаблицаЗначений, СтрокаРаспоряжения.ОбъемТары, КоличествоКРазмещению, СтрокаПодобраннойЯчейки.Ячейка, Истина); 
								СтрокаРаспоряжения.Количество = 0;  
							Иначе     
								Продолжить;
							КонецЕсли;  
						КонецЕсли;
					Иначе
						
						// размещение с учетом ВГХ
						ДоступноеКолвоКРазм = Цел(СтрокаПодобраннойЯчейки.СвободныйОбъем / ?(СтрокаРаспоряжения.ОбъемЕдиницыТовара = 0, 1 ,СтрокаРаспоряжения.ОбъемЕдиницыТовара));
						Если ДоступноеКолвоКРазм >= 1 Тогда
							
							НоваяСтрока = МаршрутРазмещения.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспоряжения);
							НоваяСтрока.Ячейка = СтрокаПодобраннойЯчейки.Ячейка;
							НоваяСтрока.Приоритет = СтрокаПодобраннойЯчейки.Приоритет;
							НоваяСтрока.ПорядокЯчейки = НоваяСтрока.Ячейка.Приоритет;
							
							Если ДоступноеКолвоКРазм >= КоличествоКРазмещению Тогда
								НоваяСтрока.Количество = КоличествоКРазмещению;
								ИзменитьСвободныйОбъемВЯчейках(ОбщаяТаблицаЗначений, СтрокаРаспоряжения.ОбъемЕдиницыТовара, КоличествоКРазмещению, СтрокаПодобраннойЯчейки.Ячейка); 
								СтрокаРаспоряжения.Количество = 0; 
							Иначе
								НоваяСтрока.Количество = ДоступноеКолвоКРазм;
								ИзменитьСвободныйОбъемВЯчейках(ОбщаяТаблицаЗначений, СтрокаРаспоряжения.ОбъемЕдиницыТовара, ДоступноеКолвоКРазм, СтрокаПодобраннойЯчейки.Ячейка);	
								КоличествоКРазмещению = КоличествоКРазмещению - ДоступноеКолвоКРазм;
								СтрокаРаспоряжения.Количество = КоличествоКРазмещению;
							КонецЕсли;
							
						Иначе
							Продолжить;
						КонецЕсли;
					КонецЕсли;
				Иначе
					
					// Размещение без вгх.
					// Добавляем в маршрут все доступные ячейки, чтобы потом можно было заполнить доп. ячейки.
					// Использованные ячейки удаляем, чтобы они не попали в другой план
					ДоступноеКолвоКРазм = 1000000000;
					Если ДоступноеКолвоКРазм >= 1 Тогда													
						
						Если ЕстьКонтейнерыКРазмещениюБезВгх Тогда
							Если ЗначениеЗаполнено(СтрокаРаспоряжения.Контейнер) Тогда        
								Отбор = Новый Структура("Контейнер", СтрокаРаспоряжения.Контейнер);
								СтрокиСостоянияКонтейнера = СостояниеКонтейнеров.НайтиСтроки(Отбор); 
								Если СтрокиСостоянияКонтейнера.Количество() > 0 Тогда 
									// всегда так должно быть
									СтрокаСостоянияКонтейнера = СтрокиСостоянияКонтейнера[0];
									Если СтрокаСостоянияКонтейнера.Размещен Тогда 
										Прервать;
									КонецЕсли;			
								КонецЕсли;
								
							КонецЕсли;	
						КонецЕсли;
						
						
						НоваяСтрока = МаршрутРазмещения.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспоряжения);
						НоваяСтрока.Ячейка = СтрокаПодобраннойЯчейки.Ячейка;
						НоваяСтрока.Приоритет = СтрокаПодобраннойЯчейки.Приоритет;
						НоваяСтрока.ПорядокЯчейки = НоваяСтрока.Ячейка.Приоритет;
						
						Если ДоступноеКолвоКРазм >= КоличествоКРазмещению Тогда
							НоваяСтрока.Количество = КоличествоКРазмещению;
							ИзменитьСвободныйОбъемВЯчейках(ОбщаяТаблицаЗначений, СтрокаРаспоряжения.ОбъемЕдиницыТовара, КоличествоКРазмещению, СтрокаПодобраннойЯчейки.Ячейка);
							
							ИспользованныеЯчейки = ОбщаяТаблицаЗначений.НайтиСтроки(Новый Структура("Ячейка", СтрокаПодобраннойЯчейки.Ячейка));
							Для каждого СтрокаТаблицы Из ИспользованныеЯчейки Цикл
								ОбщаяТаблицаЗначений.Удалить(СтрокаТаблицы)
							КонецЦикла;
							
						КонецЕсли;
						
						ПодобраноЯчеек = ПодобраноЯчеек + 1;
						
						Если ПодобраноЯчеек >= 5 Тогда
							Прервать;
						КонецЕсли;
						
					Иначе
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				Прервать;
			КонецЕсли; 
		КонецЦикла;      
		
		Если ЕстьКонтейнерыКРазмещениюБезВгх Тогда
			Если ЗначениеЗаполнено(СтрокаРаспоряжения.Контейнер) Тогда
				Отбор = Новый Структура("Контейнер", СтрокаРаспоряжения.Контейнер);
				СтрокиСостоянияКонтейнера = СостояниеКонтейнеров.НайтиСтроки(Отбор);     
				Если СтрокиСостоянияКонтейнера.Количество() > 0 Тогда 
					// всегда так должно быть
					СтрокаСостоянияКонтейнера = СтрокиСостоянияКонтейнера[0];
					Если НЕ СтрокаСостоянияКонтейнера.Размещен Тогда 
						СтрокаСостоянияКонтейнера.Размещен = Истина; 
					Иначе
						НайденныеСтрокиМаршрута = МаршрутРазмещения.НайтиСтроки(Отбор);
						Для Каждого СтрокаМаршрута Из НайденныеСтрокиМаршрута Цикл
							НоваяСтрока = МаршрутРазмещения.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспоряжения);	
							НоваяСтрока.Ячейка = СтрокаМаршрута.Ячейка; 
							НоваяСтрока.Приоритет = СтрокаМаршрута.Приоритет;
							НоваяСтрока.ПорядокЯчейки = СтрокаМаршрута.ПорядокЯчейки;
						КонецЦикла;
						
					КонецЕсли;			
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;   
	
	//Для Каждого СтрокаКонтейнера Из ТаблицаКонтейнеров Цикл
	//Ячейки = ПолучитьЯчейкуДляКонтейнера(СтрокаКонтейнера.Контейнер, Склад, НастройкиРазмещения);		
	//КонецЦикла;	
	
	МаршрутРазмещения.Свернуть("Ячейка, Приоритет, ПорядокЯчейки, Товар, Характеристика, Упаковка, Контейнер", "Количество");
	МаршрутРазмещения.Сортировать("Приоритет, ПорядокЯчейки ВОЗР, Ячейка ВОЗР");
	
	Возврат МаршрутРазмещения;
	
КонецФункции

// ТУ_Васильев 01.10.25 ++

// Формирует параметры для получения ячейки получателя по данным документа-основания.
// Если документ не передан, возвращает пустую структуру.
//
// Параметры:
//  ДокументОсонование - ДокументСсылка, Неопределено - документ, на основе которого заполняются параметры.
//                       При пустом значении возвращается пустая структура с параметрами.
//
// Возвращаемое значение:
//  Структура - содержит ключи: Правило, Склад, Товары
//
Функция ПолучитьПараметрыДляПолученияЯчейкиПолучателя(ДокументОсонование = Неопределено) Экспорт
	
	Параметры = ПолучитьПустыеПараметрыДляПолученияЯчейкиПолучателя();
	
	Если ДокументОсонование = Неопределено Тогда
		Возврат Параметры;	
	КонецЕсли;
	
	МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипЗнч(ДокументОсонование));
	
	Если МетаданныеДокумента.Реквизиты.Найти("Правило") <> Неопределено Тогда
		Параметры.Правило = ДокументОсонование.Правило;			
	КонецЕсли;      
	
	Если МетаданныеДокумента.Реквизиты.Найти("Склад") <> Неопределено Тогда
		Параметры.Склад = ДокументОсонование.Склад;			
	КонецЕсли;  
	
	Если МетаданныеДокумента.ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда 
		
		ТоварыДокумента =  ДокументОсонование.Товары; 
		
		Если  МетаданныеДокумента.ТабличныеЧасти.Товары.Реквизиты.Найти("Товар") = Неопределено И  МетаданныеДокумента.ТабличныеЧасти.Товары.Реквизиты.Найти("Номенклатура") <> Неопределено Тогда 
			ТоварыДокумента = ДокументОсонование.Товары.Выгрузить();     		
			// ТУ_ПРошин_17.11.25+   
			ТоварыДокумента.Колонки.Добавить("ОбъемТары", Новый ОписаниеТипов("Число")); 
			//УстановитьОбъемТарыКонтейнеровВТаблицеТоваров(ТоварыДокумента);
			// ТУ_Прошин_17.11.25-
			вмс_РаботаСКоллекциями.ПереименоватьКолонкуКоллекцииЗначений(ТоварыДокумента, "Номенклатура", "Товар"); 		
		КонецЕсли;

		вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(Параметры.Товары, ТоварыДокумента);		
	КонецЕсли;
	
	Возврат Параметры; 
	
КонецФункции

// ТУ_Васильев 01.10.25 ++

// Возвращает пустую структуру параметров для получения ячейки получателя.
//
// Возвращаемое значение:
//  Структура - структура с ключами "Правило", "Склад" и "Товары",
//              где "Товары" содержит пустую коллекцию значений требуемого состава.
Функция ПолучитьПустыеПараметрыДляПолученияЯчейкиПолучателя() Экспорт
	Параметры = Новый Структура();
	Параметры.Вставить("Правило", ); 
	Параметры.Вставить("Склад", );

	Параметры.Вставить("Товары", вмс_РаботаСКоллекциями.НоваяКоллекцияЗначений("Контейнер, Товар, Характеристика, Серия, Упаковка, Количество, ВесЕдиницыТовара, ОбъемЕдиницыТовара, ОбъемТары") );
	
	Возврат Параметры;	
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 

// Ищет в базе данных монотоварные ячейки с переданным товаром 
// Параметры:
// МенеджерВременныхТаблиц - менеджер временных таблиц, где находится временная таблица с товарами
// Возвращает таблицу значений, содержащую монотоварные ячейки, свободный объем в ячейке, приоритет при размещении и товары
//
Функция ПолучитьМонотоварныеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения) 
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОперацияПоЯчейкамОстатки.Товар) КАК КоличествоТовара
	|ПОМЕСТИТЬ КоличествоТоваровВЯчейках
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(, Ячейка.Владелец В (&Склад) И Ячейка.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения) И Ячейка В(&ДопустимыеЯчейки)) КАК вмс_ОперацияПоЯчейкамОстатки
	|СГРУППИРОВАТЬ ПО
	|   вмс_ОперацияПоЯчейкамОстатки.Ячейка
	|ИМЕЮЩИЕ
	|	УсловиеОтбора 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	ТаблицаТоваров.Товар КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Серия КАК Серия,
	|	ТаблицаТоваров.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ЯчейкиТоваров
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(, Ячейка.Владелец В (&Склад) И Ячейка.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения) И Ячейка В(&ДопустимыеЯчейки) ) КАК вмс_ОперацияПоЯчейкамОстатки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО УсловиеСоединения
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоТоваровВЯчейках КАК КоличествоТоваровВЯчейках
	|		ПО вмс_ОперацияПоЯчейкамОстатки.Ячейка = КоличествоТоваровВЯчейках.Ячейка
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЯчейкиТоваров.Ячейка КАК Ячейка,
	|	ЯчейкиТоваров.Упаковка КАК Упаковка, 
	|	МАКСИМУМ(ЯчейкиТоваров.Ячейка.Объем) КАК Объем,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия КАК Серия,
	|	МАКСИМУМ(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ ТоварыВЯчейке
	|ИЗ
	|	ЯчейкиТоваров КАК ЯчейкиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
	|				,
	|				Ячейка.Владелец В (&Склад)
	|					И Ячейка.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения) И Ячейка В(&ДопустимыеЯчейки)) КАК вмс_ОперацияПоЯчейкамОстатки
	|		ПО (вмс_ОперацияПоЯчейкамОстатки.Ячейка = ЯчейкиТоваров.Ячейка)
	
	|СГРУППИРОВАТЬ ПО
	|	ЯчейкиТоваров.Ячейка,
	|	ЯчейкиТоваров.Упаковка,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейке.Ячейка КАК Ячейка,
	|	СУММА(ТоварыВЯчейке.Количество * (&ТекстЗапросаОбъемВЯчейке)) КАК ЗанятыйОбъем
	|ПОМЕСТИТЬ ЗанятыйОбъемВЯчейке 
	|ИЗ
	|	ТоварыВЯчейке КАК ТоварыВЯчейке
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейке.Ячейка	
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейке.Ячейка КАК Ячейка,	
	|	МАКСИМУМ((ВЫБОР КОГДА ТоварыВЯчейке.Ячейка.ЯчейкаБезразмерная ТОГДА 1000000 ИНАЧЕ ТоварыВЯчейке.Объем КОНЕЦ) - ЗанятыйОбъемВЯчейке.ЗанятыйОбъем) КАК СвободныйОбъем
	|ПОМЕСТИТЬ СвободныйОбъемВЯчейке 
	|ИЗ
	|	ТоварыВЯчейке КАК ТоварыВЯчейке
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗанятыйОбъемВЯчейке КАК ЗанятыйОбъемВЯчейке
	|	ПО ЗанятыйОбъемВЯчейке.Ячейка = ТоварыВЯчейке.Ячейка
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейке.Ячейка	
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныйОбъемВЯчейке.Ячейка КАК Ячейка,
	|	ЯчейкиТоваров.Товар КАК Товар,
	|	ЯчейкиТоваров.Характеристика КАК Характеристика,
	|	ЯчейкиТоваров.Серия КАК Серия,
	|	ЯчейкиТоваров.Упаковка КАК Упаковка,
	|	СвободныйОбъемВЯчейке.СвободныйОбъем КАК СвободныйОбъем,
	|	&Приоритет КАК Приоритет
	|ИЗ
	|	СвободныйОбъемВЯчейке КАК СвободныйОбъемВЯчейке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЯчейкиТоваров КАК ЯчейкиТоваров
	|		ПО (ЯчейкиТоваров.Ячейка = СвободныйОбъемВЯчейке.Ячейка)
	|;
	|УНИЧТОЖИТЬ ЯчейкиТоваров
	|;
	|УНИЧТОЖИТЬ ЗанятыйОбъемВЯчейке
	|;
	|УНИЧТОЖИТЬ СвободныйОбъемВЯчейке
	|;
	|УНИЧТОЖИТЬ КоличествоТоваровВЯчейках
	|;
	|УНИЧТОЖИТЬ ТоварыВЯчейке";
	
	
	ПоляДляМонотоварности = Новый Массив;
	УсловияМонотоварности = Новый Структура;
	
	Если НастройкиРазмещения.МонотоварностьПоТовару Тогда
		ПоляДляМонотоварности.Добавить("Товар");
	КонецЕсли;
	Если НастройкиРазмещения.МонотоварностьПоТоваруХарактеристике Тогда
		ПоляДляМонотоварности.Добавить("Характеристика");
	КонецЕсли;
		Если НастройкиРазмещения.МонотоварностьПоСерии Тогда
		ПоляДляМонотоварности.Добавить("Серия");
	КонецЕсли;
	
	СтрокаУсловиеСоединения = "";
	Для каждого ПолеМонотоварности Из ПоляДляМонотоварности Цикл
		СтрокаУсловиеСоединения = СтрокаУсловиеСоединения + СтрШаблон("ТаблицаТоваров.%1 = вмс_ОперацияПоЯчейкамОстатки.%1", ПолеМонотоварности) + " И ";
	КонецЦикла;
	СтрокаУсловиеСоединения = Лев(СтрокаУсловиеСоединения, СтрДлина(СтрокаУсловиеСоединения) - 3);
	
	СтрокаУсловиеОтбора = "";
	Для каждого ПолеМонотоварности Из ПоляДляМонотоварности Цикл
		СтрокаУсловиеОтбора = СтрокаУсловиеОтбора + СтрШаблон("КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОперацияПоЯчейкамОстатки.%1) = 1", ПолеМонотоварности) + " И ";
	КонецЦикла;
	СтрокаУсловиеОтбора = Лев(СтрокаУсловиеОтбора, СтрДлина(СтрокаУсловиеОтбора) - 3);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "УсловиеСоединения", СтрокаУсловиеСоединения);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "УсловиеОтбора", СтрокаУсловиеОтбора);
		
	Если НастройкиРазмещения.ИспользоватьВГХ Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаОбъемВЯчейке", вмс_АдаптацияКонфигураций.ТекстЗапросаОбъемНоменклатуры("ТоварыВЯчейке.Упаковка", "ТоварыВЯчейке.Товар"));

	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаОбъемВЯчейке", 
		"0");
	КонецЕсли;  
	
	// ТУ_Прошин_24.10.25+
	Если НастройкиРазмещения.Свойство("ДопустимыеЯчейки") И НастройкиРазмещения.ДопустимыеЯчейки.Количество() > 0 Тогда 
		Запрос.УстановитьПараметр("ДопустимыеЯчейки", НастройкиРазмещения.ДопустимыеЯчейки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ячейка В(&ДопустимыеЯчейки)", 
		""); 
	КонецЕсли;	
	// ТУ_Прошин_24.10.25-
	
	Запрос.УстановитьПараметр("Склад", Склад);				
	Запрос.УстановитьПараметр("Приоритет", НастройкиРазмещения.ПриоритетДляМонотоварныхЯчеек);	
	// ТУ_Прошин_22.10.25+
	//Запрос.УстановитьПараметр("ДопустимыеТипыЯчеекРазмещения", Перечисления.вмс_ТипыЯчеек.Хранение);   
	Запрос.УстановитьПараметр("ДопустимыеТипыЯчеекРазмещения", НастройкиРазмещения.ДопустимыеТипыЯчеекРазмещения); 
	// ТУ_Прошин_22.10.25-
	
	ТаблицаМонотоваров = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаМонотоваров;
	
КонецФункции

// Ищет в базе данных пустые ячейки 
// Параметры:
// МенеджерВременныхТаблиц - менеджер временных таблиц, где находится временная таблица с товарами
// Возвращает таблицу значений, содержащую пустые ячейки, свободный объем в ячейке, приоритет при размещении и товары 	
//
Функция ПолучитьПустыеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ячейка,
	|	ВЫБОР
	|		КОГДА вмс_МестаХранения.ЯчейкаБезразмерная
	|			ТОГДА 10000000000
	|		ИНАЧЕ вмс_МестаХранения.Объем
	|	КОНЕЦ КАК СвободныйОбъем,
	|	&Приоритет КАК Приоритет,
	|	0 КАК ЗанятоеКоличество
	|ПОМЕСТИТЬ ПустыеЯчейки
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(, ) КАК вмс_ОперацияПоЯчейкамОстатки
	|		ПО вмс_МестаХранения.Ссылка = вмс_ОперацияПоЯчейкамОстатки.Ячейка
	|ГДЕ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка ЕСТЬ NULL
	|	И вмс_МестаХранения.ЭтоГруппа = ЛОЖЬ
	|	И вмс_МестаХранения.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения)
	|	И вмс_МестаХранения.Владелец = &Склад
	|	И &УсловиеКонкретныеЯчейкиРазмещения
	|	И ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПустыеЯчейки.Ячейка КАК Ячейка,
	|	ПустыеЯчейки.СвободныйОбъем КАК СвободныйОбъем,
	|	ПустыеЯчейки.Приоритет КАК Приоритет,
	|	ПустыеЯчейки.ЗанятоеКоличество КАК ЗанятоеКоличество
	|ИЗ
	|	ПустыеЯчейки КАК ПустыеЯчейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вмс_НастройкиОператора КАК вмс_НастройкиОператора
	|		ПО ПустыеЯчейки.Ячейка = вмс_НастройкиОператора.ЯчейкаОтветственногоХранения
	|ГДЕ
	|	вмс_НастройкиОператора.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ДопустимыеТипыЯчеекРазмещения", НастройкиРазмещения.ДопустимыеТипыЯчеекРазмещения);
	Запрос.УстановитьПараметр("Приоритет", НастройкиРазмещения.ПриоритетДляПустыхЯчеек);
	
	// ТУ_Прошин_27.10.25+
	Если ЗначениеЗаполнено(НастройкиРазмещения.ДопустимыеЯчейки) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонкретныеЯчейкиРазмещения", "вмс_МестаХранения.Ссылка В (&ДопустимыеЯчейки)");
		Запрос.УстановитьПараметр("ДопустимыеЯчейки", НастройкиРазмещения.ДопустимыеЯчейки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонкретныеЯчейкиРазмещения", "ИСТИНА");
	КонецЕсли;
	// ТУ_Прошин_27.10.25-
	
	ТаблицаПустыхЯчеек = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПустыхЯчеек; 
	
КонецФункции

// Ищет в базе данных смешанные ячейки (ячейки, где есть данный товар вместе с остальными) 
// Параметры:
// МенеджерВременныхТаблиц - менеджер временных таблиц, где находится временная таблица с товарами
// Возвращает таблицу значений, содержащую смешанные ячейки, свободный объем в ячейке, приоритет при размещении и товары
//
Функция ПолучитьСмешанныеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОперацияПоЯчейкамОстатки.Товар) КАК КоличествоТовара
	|ПОМЕСТИТЬ КоличествоТоваровВЯчейках
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(, Ячейка.Владелец В (&Склад) И Ячейка.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения) И Ячейка В(&ДопустимыеЯчейки)) КАК вмс_ОперацияПоЯчейкамОстатки
	|СГРУППИРОВАТЬ ПО
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка
	|ИМЕЮЩИЕ
	|	УсловиеМонотоварности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	ТаблицаТоваров.Товар КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Серия КАК Серия,
	|	ТаблицаТоваров.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ЯчейкиТоваров
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(, Ячейка.Владелец В (&Склад) И Ячейка.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения) И Ячейка В(&ДопустимыеЯчейки)) КАК вмс_ОперацияПоЯчейкамОстатки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО вмс_ОперацияПоЯчейкамОстатки.Товар = ТаблицаТоваров.Товар
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоТоваровВЯчейках КАК КоличествоТоваровВЯчейках
	|		ПО вмс_ОперацияПоЯчейкамОстатки.Ячейка = КоличествоТоваровВЯчейках.Ячейка
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЯчейкиТоваров.Ячейка КАК Ячейка,
	|	ЯчейкиТоваров.Упаковка КАК Упаковка,
	|	МАКСИМУМ(ЯчейкиТоваров.Ячейка.Объем) КАК Объем,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия КАК Серия,
	|	МАКСИМУМ(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ ТоварыВЯчейке
	|ИЗ
	|	ЯчейкиТоваров КАК ЯчейкиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
	|				,
	|				Ячейка.Владелец В (&Склад)
	|					И Ячейка.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения) И Ячейка В(&ДопустимыеЯчейки)) КАК вмс_ОперацияПоЯчейкамОстатки
	|		ПО (вмс_ОперацияПоЯчейкамОстатки.Ячейка = ЯчейкиТоваров.Ячейка)
	
	|СГРУППИРОВАТЬ ПО
	|	ЯчейкиТоваров.Ячейка,
	|	ЯчейкиТоваров.Упаковка,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейке.Ячейка КАК Ячейка,	
	|	СУММА(ТоварыВЯчейке.Количество * (&ТекстЗапросаОбъемВЯчейке)) КАК ЗанятыйОбъем
	|ПОМЕСТИТЬ ЗанятыйОбъемВЯчейке 
	|ИЗ
	|	ТоварыВЯчейке КАК ТоварыВЯчейке
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейке.Ячейка	
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейке.Ячейка КАК Ячейка,	
	|	МАКСИМУМ((ВЫБОР КОГДА ТоварыВЯчейке.Ячейка.ЯчейкаБезразмерная ТОГДА 100000000 ИНАЧЕ ТоварыВЯчейке.Объем КОНЕЦ) - ЗанятыйОбъемВЯчейке.ЗанятыйОбъем) КАК СвободныйОбъем
	|ПОМЕСТИТЬ СвободныйОбъемВЯчейке 
	|ИЗ
	|	ТоварыВЯчейке КАК ТоварыВЯчейке
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗанятыйОбъемВЯчейке КАК ЗанятыйОбъемВЯчейке
	|	ПО ЗанятыйОбъемВЯчейке.Ячейка = ТоварыВЯчейке.Ячейка
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейке.Ячейка	
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныйОбъемВЯчейке.Ячейка КАК Ячейка,
	|	ЯчейкиТоваров.Товар КАК Товар,
	|	ЯчейкиТоваров.Характеристика КАК Характеристика,
	|	ЯчейкиТоваров.Серия КАК Серия,
	|	ЯчейкиТоваров.Упаковка КАК Упаковка,
	|	СвободныйОбъемВЯчейке.СвободныйОбъем КАК СвободныйОбъем,
	|	&Приоритет КАК Приоритет
	|ИЗ
	|	СвободныйОбъемВЯчейке КАК СвободныйОбъемВЯчейке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЯчейкиТоваров КАК ЯчейкиТоваров
	|		ПО (ЯчейкиТоваров.Ячейка = СвободныйОбъемВЯчейке.Ячейка)
	|;
	|УНИЧТОЖИТЬ ЯчейкиТоваров
	|;
	|УНИЧТОЖИТЬ ЗанятыйОбъемВЯчейке
	|;
	|УНИЧТОЖИТЬ СвободныйОбъемВЯчейке
	|;
	|УНИЧТОЖИТЬ КоличествоТоваровВЯчейках
	|;
	|УНИЧТОЖИТЬ ТоварыВЯчейке";
		
	
	// сделать: неправильно работает условие монотоварности.
	Если НастройкиРазмещения.МонотоварностьПоТовару Тогда
		УсловиеМонотоварности = "КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОперацияПоЯчейкамОстатки.Товар) > 1";	
	ИначеЕсли НастройкиРазмещения.МонотоварностьПоТоваруХарактеристике Тогда	
		УсловиеМонотоварности = "КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОперацияПоЯчейкамОстатки.Товар) > 1 ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОперацияПоЯчейкамОстатки.Характеристика) > 1";
	КонецЕсли;	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "УсловиеМонотоварности", УсловиеМонотоварности);
	
	Если НастройкиРазмещения.ИспользоватьВГХ Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаОбъемВЯчейке", вмс_АдаптацияКонфигураций.ТекстЗапросаОбъемНоменклатуры("ТоварыВЯчейке.Упаковка", "ТоварыВЯчейке.Товар"));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаОбъемВЯчейке", 
		"0");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склад", Склад);
	// ТУ_Прошин_22.10.25+
	//Запрос.УстановитьПараметр("ДопустимыеТипыЯчеекРазмещения", Перечисления.вмс_ТипыЯчеек.Хранение);   
	Запрос.УстановитьПараметр("ДопустимыеТипыЯчеекРазмещения", НастройкиРазмещения.ДопустимыеТипыЯчеекРазмещения); 
	// ТУ_Прошин_22.10.25-
	// ТУ_Прошин_27.10.25+
	Если НастройкиРазмещения.Свойство("ДопустимыеЯчейки") И НастройкиРазмещения.ДопустимыеЯчейки.Количество() > 0 Тогда 
		Запрос.УстановитьПараметр("ДопустимыеЯчейки", НастройкиРазмещения.ДопустимыеЯчейки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ячейка В(&ДопустимыеЯчейки)", 
		""); 
	КонецЕсли;	
	// ТУ_Прошин_27.10.25-
	
	Запрос.УстановитьПараметр("Приоритет", НастройкиРазмещения.ПриоритетДляСмешанныхЯчеек);
	
	ТаблицаСмешанныхЯчеек = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСмешанныхЯчеек;
	
КонецФункции 

// Ищет в базе данных ячейки, где ранее двигался товар
// Параметры:
// МенеджерВременныхТаблиц - менеджер временных таблиц, где находится временная таблица с товарами
// Возвращает таблицу значений, содержащую смешанные ячейки, свободный объем в ячейке, приоритет при размещении и товары
//
Функция ПолучитьЯчейкиПоИсторииТовара(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЯчейкиИсторические.Ячейка КАК Ячейка,
	|	ЯчейкиИсторические.Товар КАК Товар,
	|	ЯчейкиИсторические.Характеристика КАК Характеристика,
	|	ЯчейкиИсторические.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ЯчейкиИсторические.КоличествоПриход КАК КоличествоПриход,
	|	ЯчейкиИсторические.КоличествоРасход КАК КоличествоРасход,
	|	ЯчейкиИсторические.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток, 
	// ТУ_Васильев 03.10.25 ++
	|	ТаблицаТоваров.Упаковка КАК Упаковка	
	// ТУ_Васильев 03.10.25 --
	|ПОМЕСТИТЬ ЯчейкиИсторические
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.ОстаткиИОбороты(
	|				,
	|				,
	|				,
	|				,
	|				Ячейка.Владелец = &Склад
	|					И Ячейка.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения) И Ячейка В(&ДопустимыеЯчейки)) КАК ЯчейкиИсторические 
	// ТУ_Васильев 02.10.25 ++	
	//|		ПО (&УсловиеМонотоварности)
	//|ГДЕ
	//|	ЯчейкиИсторические.КоличествоКонечныйОстаток = 0
	|	ПО ТаблицаТоваров.Товар = ЯчейкиИсторические.Товар
	|	ГДЕ
	|		ЯчейкиИсторические.КоличествоКонечныйОстаток = 0  
	|	СГРУППИРОВАТЬ ПО
	|		ЯчейкиИсторические.Ячейка,
	|		ЯчейкиИсторические.Товар,
	|		ЯчейкиИсторические.Характеристика,
	|		ЯчейкиИсторические.КоличествоКонечныйОстаток,
	|		ЯчейкиИсторические.КоличествоРасход,
	|		ЯчейкиИсторические.КоличествоПриход,
	|		ЯчейкиИсторические.КоличествоНачальныйОстаток,
	|		ТаблицаТоваров.Упаковка
	|	ИМЕЮЩИЕ
	|		&УсловиеМонотоварности
	// ТУ_Васильев 02.10.25 --
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЯчейкиИсторические.Ячейка КАК Ячейка,
	|	СУММА(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток * &ТекстЗапросаОбъемВЯчейке) КАК ЗанятыйОбъем
	|ПОМЕСТИТЬ ЗанятыйОбъемЯчеек
	|ИЗ
	|	ЯчейкиИсторические КАК ЯчейкиИсторические,
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки КАК вмс_ОперацияПоЯчейкамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЯчейкиИсторические.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗанятыйОбъемЯчеек.Ячейка КАК Ячейка,
	|	ВЫБОР
	|		КОГДА ЗанятыйОбъемЯчеек.Ячейка.ЯчейкаБезразмерная
	|			ТОГДА 100000000
	|		ИНАЧЕ ЗанятыйОбъемЯчеек.Ячейка.Объем
	|	КОНЕЦ - ЗанятыйОбъемЯчеек.ЗанятыйОбъем КАК СвободныйОбъемЯчеек
	|ПОМЕСТИТЬ СвободныйОбъем
	|ИЗ
	|	ЗанятыйОбъемЯчеек КАК ЗанятыйОбъемЯчеек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЯчейкиИсторические.Ячейка КАК Ячейка,
	|	ЯчейкиИсторические.Товар КАК Товар,
	|	ЯчейкиИсторические.Характеристика КАК Характеристика,
	|	&Приоритет КАК Приоритет
	|ИЗ
	|	ЯчейкиИсторические КАК ЯчейкиИсторические,
	|	СвободныйОбъем КАК СвободныйОбъем
	|";
	
	
	Если НастройкиРазмещения.МонотоварностьПоТовару Тогда
		УсловиеМонотоварности = "КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЯчейкиИсторические.Товар) > 1";
	ИначеЕсли НастройкиРазмещения.МонотоварностьПоТоваруХарактеристике Тогда
		УсловиеМонотоварности = "КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЯчейкиИсторические.Товар) > 1 ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЯчейкиИсторические.Характеристика) > 1";
	КонецЕсли;	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМонотоварности", УсловиеМонотоварности);
	
	Если НастройкиРазмещения.ИспользоватьВГХ Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаОбъемВЯчейке", вмс_АдаптацияКонфигураций.ТекстЗапросаОбъемНоменклатуры("ЯчейкиИсторические.Упаковка", "ЯчейкиИсторические.Товар"));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаОбъемВЯчейке", 
		"0");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склад", Склад);
	// ТУ_Прошин_22.10.25+
	//Запрос.УстановитьПараметр("ДопустимыеТипыЯчеекРазмещения", Перечисления.вмс_ТипыЯчеек.Хранение);
	Запрос.УстановитьПараметр("ДопустимыеТипыЯчеекРазмещения", НастройкиРазмещения.ДопустимыеТипыЯчеекРазмещения);
	// ТУ_Прошин_22.10.25-	 
	// ТУ_Прошин_27.10.25+
	Если НастройкиРазмещения.Свойство("ДопустимыеЯчейки") И НастройкиРазмещения.ДопустимыеЯчейки.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ДопустимыеЯчейки", НастройкиРазмещения.ДопустимыеЯчейки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ячейка В(&ДопустимыеЯчейки)", 
		""); 
	КонецЕсли;
	// ТУ_Прошин_27.10.25-
	Запрос.УстановитьПараметр("Приоритет", НастройкиРазмещения.ПриоритетДляИсторическихЯчеек);
	
	ТаблицаСмешанныхЯчеек = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСмешанныхЯчеек;
	
КонецФункции 

// Ищет в базе данных прочие ячейки (смешанные ячейки с прочим товаром, где нет данного) 
// Параметры:
// МенеджерВременныхТаблиц - менеджер временных таблиц, где находится временная таблица с товарами
// Возвращает таблицу значений, содержащую прочие ячейки, свободный объем в ячейке, приоритет при размещении и товары
//
Функция ПолучитьПрочиеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, ТаблицаПредыдущихЯчеек, НастройкиРазмещения)
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаПредыдущихЯчеек.Ячейка КАК Ячейка,
	|	ТаблицаПредыдущихЯчеек.Товар КАК Товар,
	|	ТаблицаПредыдущихЯчеек.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ВыбранныеЯчейки
	|ИЗ
	|	&ТаблицаПредыдущихЯчеек КАК ТаблицаПредыдущихЯчеек
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОперацияПоЯчейкамОстатки.Товар) КАК КоличествоТоваров
	|ПОМЕСТИТЬ КоличествоТоваровВЯчейках
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(, Ячейка.Владелец В (&Склад) И Ячейка.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения) И Ячейка В(&ДопустимыеЯчейки)) КАК вмс_ОперацияПоЯчейкамОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыбранныеЯчейки КАК ВыбранныеЯчейки
	|		ПО вмс_ОперацияПоЯчейкамОстатки.Ячейка = ВыбранныеЯчейки.Ячейка
	|ГДЕ
	|	ВыбранныеЯчейки.Ячейка ЕСТЬ NULL
	
	|СГРУППИРОВАТЬ ПО
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка
	
	//|ИМЕЮЩИЕ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОперацияПоЯчейкамОстатки.Товар) > 1
	|;
	
	|ВЫБРАТЬ
	|	КоличествоТоваровВЯчейках.Ячейка КАК Ячейка,
	|	МАКСИМУМ(КоличествоТоваровВЯчейках.Ячейка.Объем) КАК Объем,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия КАК Серия,
	//|	ВыбранныеЯчейки.Упаковка КАК Упаковка,
	|	МАКСИМУМ(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ ТоварыВЯчейке
	|ИЗ
	|	КоличествоТоваровВЯчейках КАК КоличествоТоваровВЯчейках
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
	|				,
	|				Ячейка.Владелец В (&Склад)
	|					И Ячейка.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения) И Ячейка В(&ДопустимыеЯчейки)) КАК вмс_ОперацияПоЯчейкамОстатки
	|		ПО (вмс_ОперацияПоЯчейкамОстатки.Ячейка = КоличествоТоваровВЯчейках.Ячейка)
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеЯчейки КАК ВыбранныеЯчейки
	//|		ПО (ВыбранныеЯчейки.Товар = вмс_ОперацияПоЯчейкамОстатки.Товар)
	
	|СГРУППИРОВАТЬ ПО
	|	КоличествоТоваровВЯчейках.Ячейка,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия
	//|	ВыбранныеЯчейки.Упаковка
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейке.Ячейка КАК Ячейка,	
	|	СУММА(ТоварыВЯчейке.Количество * (&ТекстЗапросаОбъемВЯчейке)) КАК ЗанятыйОбъем
	|ПОМЕСТИТЬ ЗанятыйОбъемВЯчейке 
	|ИЗ
	|	ТоварыВЯчейке КАК ТоварыВЯчейке
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейке.Ячейка	
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейке.Ячейка КАК Ячейка,	
	|	МАКСИМУМ((ВЫБОР КОГДА ТоварыВЯчейке.Ячейка.ЯчейкаБезразмерная ТОГДА 1000000 ИНАЧЕ ТоварыВЯчейке.Объем КОНЕЦ) - ЗанятыйОбъемВЯчейке.ЗанятыйОбъем) КАК СвободныйОбъем,
	|	&Приоритет КАК Приоритет
	|ИЗ
	|	ТоварыВЯчейке КАК ТоварыВЯчейке
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗанятыйОбъемВЯчейке КАК ЗанятыйОбъемВЯчейке
	|	ПО ЗанятыйОбъемВЯчейке.Ячейка = ТоварыВЯчейке.Ячейка
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейке.Ячейка	
	|;
	
	|УНИЧТОЖИТЬ ЗанятыйОбъемВЯчейке
	|;
	|УНИЧТОЖИТЬ КоличествоТоваровВЯчейках 
	// ТУ_Васильев 02.10.25 ++
	|;
	|УНИЧТОЖИТЬ ТоварыВЯчейке 
	// ТУ_Васильев 02.10.25 --
	|";
	
	//Если НастройкиРазмещения.ИспользоватьВГХ Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаОбъемВЯчейке", 
	//	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("ТоварыВЯчейке.Упаковка", "ТоварыВЯчейке.Товар"));
	//Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаОбъемВЯчейке",
		"0");
	//КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаПредыдущихЯчеек", ТаблицаПредыдущихЯчеек);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Приоритет", НастройкиРазмещения.ПриоритетДляПрочихЯчеек);
	// ТУ_Прошин_22.10.25+
	//Запрос.УстановитьПараметр("ДопустимыеТипыЯчеекРазмещения", Перечисления.вмс_ТипыЯчеек.Хранение);
	Запрос.УстановитьПараметр("ДопустимыеТипыЯчеекРазмещения", НастройкиРазмещения.ДопустимыеТипыЯчеекРазмещения);
	// ТУ_Прошин_22.10.25-
	// ТУ_Прошин_27.10.25+
	Если НастройкиРазмещения.Свойство("ДопустимыеЯчейки") И НастройкиРазмещения.ДопустимыеЯчейки.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ДопустимыеЯчейки", НастройкиРазмещения.ДопустимыеЯчейки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ячейка В(&ДопустимыеЯчейки)", 
		""); 
	КонецЕсли;
	// ТУ_Прошин_27.10.25-
	ТаблицаПрочихЯчеек = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПрочихЯчеек;
	
КонецФункции

// ТУ_Васильев 01.10.25 ++
Функция ПолучитьСтатическиеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_МестаХраненияНоменклатуры.МестоХранения КАК МестоХранения
	|ПОМЕСТИТЬ СтатическиеЯчейки
	|ИЗ
	|	РегистрСведений.вмс_МестаХраненияНоменклатуры КАК вмс_МестаХраненияНоменклатуры
	|ГДЕ
	|	вмс_МестаХраненияНоменклатуры.МестоХранения.Владелец = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОперацияПоЯчейкамОстатки.Товар) КАК КоличествоТовара
	|ПОМЕСТИТЬ КоличествоТоваровВЯчейках
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
	|			,
	|			Ячейка.Владелец В (&Склад)
	|				И Ячейка.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения) И Ячейка В(&ДопустимыеЯчейки)) КАК вмс_ОперацияПоЯчейкамОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатическиеЯчейки КАК СтатическиеЯчейки
	|		ПО (СтатическиеЯчейки.МестоХранения = вмс_ОперацияПоЯчейкамОстатки.Ячейка)
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_ОперацияПоЯчейкамОстатки.Товар) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	ТаблицаТоваров.Товар КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Серия КАК Серия,
	|	ТаблицаТоваров.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ЯчейкиТоваров
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
	|			,
	|			Ячейка.Владелец В (&Склад)
	|				И Ячейка.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения) И Ячейка В(&ДопустимыеЯчейки)) КАК вмс_ОперацияПоЯчейкамОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО вмс_ОперацияПоЯчейкамОстатки.Товар = ТаблицаТоваров.Товар
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоТоваровВЯчейках КАК КоличествоТоваровВЯчейках
	|		ПО вмс_ОперацияПоЯчейкамОстатки.Ячейка = КоличествоТоваровВЯчейках.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЯчейкиТоваров.Ячейка КАК Ячейка,
	|	ЯчейкиТоваров.Упаковка КАК Упаковка,
	|	МАКСИМУМ(ЯчейкиТоваров.Ячейка.Объем) КАК Объем,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия КАК Серия,
	|	МАКСИМУМ(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ ТоварыВЯчейке
	|ИЗ
	|	ЯчейкиТоваров КАК ЯчейкиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
	|				,
	|				Ячейка.Владелец В (&Склад)
	|					И Ячейка.ТипЯчейки В (&ДопустимыеТипыЯчеекРазмещения) И Ячейка В(&ДопустимыеЯчейки)) КАК вмс_ОперацияПоЯчейкамОстатки
	|		ПО (вмс_ОперацияПоЯчейкамОстатки.Ячейка = ЯчейкиТоваров.Ячейка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЯчейкиТоваров.Ячейка,
	|	ЯчейкиТоваров.Упаковка,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика,
	|	вмс_ОперацияПоЯчейкамОстатки.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейке.Ячейка КАК Ячейка,
	|	СУММА(ТоварыВЯчейке.Количество * &ТекстЗапросаОбъемВЯчейке) КАК ЗанятыйОбъем
	|ПОМЕСТИТЬ ЗанятыйОбъемВЯчейке
	|ИЗ
	|	ТоварыВЯчейке КАК ТоварыВЯчейке
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейке.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейке.Ячейка КАК Ячейка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТоварыВЯчейке.Ячейка.ЯчейкаБезразмерная
	|				ТОГДА 100000000
	|			ИНАЧЕ ТоварыВЯчейке.Объем
	|		КОНЕЦ - ЗанятыйОбъемВЯчейке.ЗанятыйОбъем) КАК СвободныйОбъем
	|ПОМЕСТИТЬ СвободныйОбъемВЯчейке
	|ИЗ
	|	ТоварыВЯчейке КАК ТоварыВЯчейке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗанятыйОбъемВЯчейке КАК ЗанятыйОбъемВЯчейке
	|		ПО (ЗанятыйОбъемВЯчейке.Ячейка = ТоварыВЯчейке.Ячейка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейке.Ячейка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейке.Ячейка КАК Ячейка,
	|	МАКСИМУМ((ВЫБОР КОГДА ТоварыВЯчейке.Ячейка.ЯчейкаБезразмерная ТОГДА 1000000 ИНАЧЕ ТоварыВЯчейке.Объем КОНЕЦ) - ЗанятыйОбъемВЯчейке.ЗанятыйОбъем) КАК СвободныйОбъем,
	|	&Приоритет КАК Приоритет
	|ИЗ
	|	ТоварыВЯчейке КАК ТоварыВЯчейке
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗанятыйОбъемВЯчейке КАК ЗанятыйОбъемВЯчейке
	|	ПО ЗанятыйОбъемВЯчейке.Ячейка = ТоварыВЯчейке.Ячейка
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейке.Ячейка
	|;
	
	|УНИЧТОЖИТЬ СтатическиеЯчейки
	|;
	|УНИЧТОЖИТЬ ЯчейкиТоваров
	|;
	|УНИЧТОЖИТЬ ЗанятыйОбъемВЯчейке
	|;
	|УНИЧТОЖИТЬ СвободныйОбъемВЯчейке
	|;
	|УНИЧТОЖИТЬ КоличествоТоваровВЯчейках
	|;
	|УНИЧТОЖИТЬ ТоварыВЯчейке";
	
	Если НастройкиРазмещения.ИспользоватьВГХ Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаОбъемВЯчейке", вмс_АдаптацияКонфигураций.ТекстЗапросаОбъемНоменклатуры("ТоварыВЯчейке.Упаковка", "ТоварыВЯчейке.Товар"));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаОбъемВЯчейке", 
		"0");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Приоритет", НастройкиРазмещения.ПриоритетДляСтатическихЯчеек);
	// ТУ_Прошин_22.10.25+
	//Запрос.УстановитьПараметр("ДопустимыеТипыЯчеекРазмещения", Перечисления.вмс_ТипыЯчеек.Хранение);
	Запрос.УстановитьПараметр("ДопустимыеТипыЯчеекРазмещения", НастройкиРазмещения.ДопустимыеТипыЯчеекРазмещения);
	// ТУ_Прошин_22.10.25-     
	// ТУ_Прошин_27.10.25+
	Если НастройкиРазмещения.Свойство("ДопустимыеЯчейки") И НастройкиРазмещения.ДопустимыеЯчейки.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ДопустимыеЯчейки", НастройкиРазмещения.ДопустимыеЯчейки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ячейка В(&ДопустимыеЯчейки)",
		"");
	КонецЕсли;
	// ТУ_Прошин_27.10.25-

	
	ТаблицаПрочихЯчеек = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПрочихЯчеек;
	
КонецФункции

Функция ПодготовитьВходящуюТаблицу(Товары)
	
	ТаблицаТоваров = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("Номенклатура, Характеристика, Серия, Упаковка, Количество, ВесЕдиницыТовара, ОбъемЕдиницыТовара", Товары);
	
	вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(ТаблицаТоваров, Товары);
	
	вмс_РаботаСКоллекциями.ТипизироватьТаблицуЗначений(ТаблицаТоваров);
	
	вмс_РаботаСКоллекциями.ПереименоватьКолонкуКоллекцииЗначений(ТаблицаТоваров, "Номенклатура", "Товар");
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция МенеджерВременныхТаблиц_ВходящиеТовары(ТаблицаТоваров)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяУпаковка", вмс_АдаптацияКонфигураций.ПустаяУпаковка());
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	//// ПАКЕТ ДЛЯ ОТЛАДКИ ЧЕРЕЗ ССЫЛКУ, А НЕ ЧЕРЕЗ ВРЕМ.ТАБ +
	//"ВЫБРАТЬ
	//|	вмс_ЗаданиеКладовщикуТовары.Номенклатура КАК Номенклатура,
	//|	вмс_ЗаданиеКладовщикуТовары.Характеристика КАК Характеристика,
	//|	вмс_ЗаданиеКладовщикуТовары.Серия КАК Серия,
	//|	вмс_ЗаданиеКладовщикуТовары.Упаковка КАК Упаковка,
	//|	вмс_ЗаданиеКладовщикуТовары.Количество КАК Количество
	//|ПОМЕСТИТЬ ТЗ
	//|ИЗ
	//|	Документ.вмс_ЗаданиеКладовщику.Товары КАК вмс_ЗаданиеКладовщикуТовары
	//|ГДЕ
	//|	вмс_ЗаданиеКладовщикуТовары.Ссылка = &Ссылка"
	//// ПАКЕТ ДЛЯ ОТЛАДКИ ЧЕРЕЗ ССЫЛКУ, А НЕ ЧЕРЕЗ ВРЕМ.ТАБ -

	Запрос.Текст = "ВЫБРАТЬ  
	|	ТаблицаТоваров.Контейнер КАК Контейнер, 
	|	ТаблицаТоваров.ОбъемТары КАК ОбъемТары, 
	|	ТаблицаТоваров.Товар КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.Упаковка ЕСТЬ NULL ТОГДА
	|			&ПустаяУпаковка ИНАЧЕ ТаблицаТоваров.Упаковка 
	|	КОНЕЦ КАК Упаковка,
	|	ТаблицаТоваров.Количество КАК Количество
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Контейнер КАК Контейнер, 
	|	ТЗ.ОбъемТары КАК ОбъемТары, 
	|	Номенклатура.Ссылка КАК Товар,
	|	ТЗ.Характеристика КАК Характеристика,
	|	ТЗ.Серия КАК Серия,
	|	ТЗ.Упаковка КАК Упаковка,
	|	ТЗ.Количество КАК Количество,
	|	&ТекстЗапросаОбъемВЯчейке КАК ОбъемЕдиницыТовара,
	|	&ТекстЗапросаВесВЯчейке КАК ВесЕдиницыТовара
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ
	|		ПО (Номенклатура.Ссылка = ТЗ.Товар)";
	

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаОбъемВЯчейке", вмс_АдаптацияКонфигураций.ТекстЗапросаОбъемНоменклатуры("ТЗ.Упаковка", "Номенклатура.Ссылка"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаВесВЯчейке", вмс_АдаптацияКонфигураций.ТекстЗапросаВесНоменклатуры("ТЗ.Упаковка", "Номенклатура.Ссылка"));
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	
	Запрос.Выполнить();
	ТаблицаТоваров = Запрос.МенеджерВременныхТаблиц.Таблицы["ТаблицаТоваров"].ПолучитьДанные().Выгрузить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

Функция СоздатьОбщуюТаблицуЯчеек()
	
	ОбщаяТаблицаЗначений = Новый ТаблицаЗначений;
	ОбщаяТаблицаЗначений.Колонки.Добавить("Контейнер", Новый ОписаниеТипов("СправочникСсылка.вмс_Контейнеры"));
	ОбщаяТаблицаЗначений.Колонки.Добавить("Ячейка", Новый ОписаниеТипов("СправочникСсылка.вмс_МестаХранения"));
	ОбщаяТаблицаЗначений.Колонки.Добавить("Товар", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ОбщаяТаблицаЗначений.Колонки.Добавить("Характеристика", Новый ОписаниеТипов(вмс_РаботаСКоллекциями.ЗначениеВМассив(ТипЗнч(вмс_АдаптацияКонфигураций.ПустаяХарактеристика()))));
	ОбщаяТаблицаЗначений.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.вмс_СерииНоменклатуры"));
	ОбщаяТаблицаЗначений.Колонки.Добавить("Упаковка", Новый ОписаниеТипов(вмс_АдаптацияКонфигураций.ПолучитьИмяТипаСправочникаУпаковки()));
	ОбщаяТаблицаЗначений.Колонки.Добавить("СвободныйОбъем",  Новый ОписаниеТипов("Число"));
	ОбщаяТаблицаЗначений.Колонки.Добавить("Приоритет",  Новый ОписаниеТипов("Число"));
	
	Возврат ОбщаяТаблицаЗначений;
	
КонецФункции

Процедура ИзменитьСвободныйОбъемВЯчейках(ТаблицаЗначений, Объем, Количество, Ячейка, ЭтоОбъемТары = Ложь)
	// ТУ_Прошин_17.11.25
	// добавил параметр ЭтоОбъемТары
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Ячейка", Ячейка);
	МассивСтрок = ТаблицаЗначений.НайтиСтроки(ПараметрыПоиска);
	Для каждого Строка Из МассивСтрок Цикл
		Если НЕ ЭтоОбъемТары Тогда
			Строка.СвободныйОбъем = Строка.СвободныйОбъем - (Объем * Количество); 
		Иначе
			Строка.СвободныйОбъем = Строка.СвободныйОбъем - Объем;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник)
	
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
		
	КонецЦикла;
	
КонецПроцедуры

// ТУ_Сетраков 28.10.2025 --

Функция ПолучитьЯчейкуДляКонтейнера(Контейнер, Склад, НастройкиРазмещения)
	
	
	Запрос = Новый Запрос;
	
	// Установка значений параметров
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_Контейнеры.Ссылка КАК Ссылка,
	|	&ПоляТоваров
	|	СУММА(вмс_ОстаткиВКонтейнерахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.вмс_ОстаткиВКонтейнерах.Остатки КАК вмс_ОстаткиВКонтейнерахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вмс_Контейнеры КАК вмс_Контейнеры
	|		ПО вмс_ОстаткиВКонтейнерахОстатки.Контейнер = вмс_Контейнеры.Ссылка
	|ГДЕ
	|	вмс_ОстаткиВКонтейнерахОстатки.Контейнер = &Контейнер
	|СГРУППИРОВАТЬ ПО  
	|	&ГруппировкаТоваров
	|	вмс_Контейнеры.Ссылка
	|;";

	ПоляДляМонотоварности = Новый Массив;
	
	
	Если НастройкиРазмещения.МонотоварностьПоТовару Тогда
		ПоляДляМонотоварности.Добавить("Товар");
	КонецЕсли;
	Если НастройкиРазмещения.МонотоварностьПоТоваруХарактеристике Тогда
		ПоляДляМонотоварности.Добавить("Характеристика");
	КонецЕсли;
		Если НастройкиРазмещения.МонотоварностьПоСерии Тогда
		ПоляДляМонотоварности.Добавить("Серия");
	КонецЕсли;
	
	СтрокаПоляй = "";
	СтрокаГруппировки = "";
	Для Каждого Поле Из ПоляДляМонотоварности Цикл
		СтрокаПоляй = СтрокаПоляй + СтрШаблон("вмс_ОстаткиВКонтейнерахОстатки.%1 КАК %1,", Поле);
		СтрокаГруппировки = СтрокаГруппировки + СтрШаблон("вмс_ОстаткиВКонтейнерахОстатки.%1,", Поле)
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляТоваров", СтрокаПоляй);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ГруппировкаТоваров", СтрокаГруппировки);
	
	ТоварыКонтейнера = Запрос.Выполнить().Выгрузить();
	
	ОбщаяТаблицаЗначений = СоздатьОбщуюТаблицуЯчеек();
	МенеджерВременныхТаблиц 	= МенеджерВременныхТаблиц_ВходящиеТовары(ТоварыКонтейнера);
 
	Если ТоварыКонтейнера.Количество() = 1 Тогда //Это монотоварный контейнер
		ТаблицаМонотоварныхЯчеек = ПолучитьМонотоварныеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения);
		ДополнитьТаблицу(ТаблицаМонотоварныхЯчеек, ОбщаяТаблицаЗначений);
	КонецЕсли;
	
	ТаблицаМонотоварныхЯчеек 	= ПолучитьМонотоварныеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения);
	ДополнитьТаблицу(ТаблицаМонотоварныхЯчеек, ОбщаяТаблицаЗначений);
	
	ТаблицаСмешанныеЯчейки 		= ПолучитьСмешанныеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения);
	ДополнитьТаблицу(ТаблицаСмешанныеЯчейки, ОбщаяТаблицаЗначений);

	ТаблицаПустыеЯчейки 		= ПолучитьПустыеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения);
	ДополнитьТаблицу(ТаблицаПустыеЯчейки, ОбщаяТаблицаЗначений);
	
	ТаблицаИсторическиеЯчейки 	= ПолучитьЯчейкиПоИсторииТовара(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения);
	ДополнитьТаблицу(ТаблицаИсторическиеЯчейки, ОбщаяТаблицаЗначений);
	
	// прочие - ячейки вообще с другим товаром.
	ТаблицаПрочиеЯчейки 		= ПолучитьПрочиеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, ОбщаяТаблицаЗначений, НастройкиРазмещения);
	ДополнитьТаблицу(ТаблицаПрочиеЯчейки, ОбщаяТаблицаЗначений);
	
	// ТУ_Васильев 01.10.25 ++
	ТаблицаСтатическиеЯчейки =  ПолучитьСтатическиеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения);
	ДополнитьТаблицу(ТаблицаСтатическиеЯчейки, ОбщаяТаблицаЗначений);
	ОбщаяТаблицаЗначений.Свернуть("Приоритет,СвободныйОбъем,Серия,Товар,Упаковка,Характеристика,Ячейка");

КонецФункции

// ТУ_Сетраков 28.10.2025 ++

Функция ПолучитьПустуюЯчейкуДляКонтейнера(Контейнеры)
	
	Для Каждого Контейнер Из Контейнеры Цикл
		
		Если Контейнер.ТипТары.Объем = 0 Тогда 
			
			//ТаблицаПустыеЯчейки = ПолучитьПустыеЯчейкиДляРазмещения(МенеджерВременныхТаблиц, Склад, НастройкиРазмещения);
			
		КонецЕсли;
		
	КонецЦикла;

КонецФункции
// ТУ_Прошин_14.11.25+
Функция ДополнитьТаблицуСоставаКонтейнеровОбъемомТарыИООбъемомСостава(ТаблицаСоставКонтейнеров)
	ТочкаОстановы=1;
КонецФункции

Функция ПодготовитьТаблицуТоваровДляРазмещенияКонтейнеров(ТаблицаТоваров, Правило) 
	
	РК = вмс_РаботаСКоллекциями;
	
	ПустойКонтейнер = Справочники.вмс_Контейнеры.ПустаяСсылка();
	ТаблицаТоваровПромежуточная = ТаблицаТоваров.Скопировать();
	
	Если Правило.РазмещатьКонтейнерыБезПересчета Тогда
		
		// Необходимо получить состав
		МассивКонтейнеров = ТаблицаТоваров.ВыгрузитьКолонку("Контейнер");
		РК.УдалитьДублиВМассиве(МассивКонтейнеров);
		РК.УдалитьПустыеСтрокиКоллекции(МассивКонтейнеров);
		ТаблицаСоставКонтейнеров = вмс_ПартионныйУчетСервер.ПолучитьТаблицуСоставаПоКонтейнерам(МассивКонтейнеров);
		ТаблицаСоставКонтейнеров.Колонки.КоличествоОстаток.Имя = "Количество";
		Для Каждого Контейнер Из МассивКонтейнеров Цикл
			Отбор = Новый Структура("Контейнер", Контейнер);
			НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(Отбор);
			РК.УдалитьЭлементыКоллекции(ТаблицаТоваров,НайденныеСтроки);
		КонецЦикла;
		
		РК.ДобавитьЭлементыКоллекции(ТаблицаТоваров,ТаблицаСоставКонтейнеров);
	КонецЕсли;
	
	УстановитьОбъемТарыКонтейнеровВТаблицеТоваров(ТаблицаТоваров);
	
КонецФункции 

Функция УстановитьОбъемТарыКонтейнеровВТаблицеТоваров(ТаблицаТоваров)
	
	Для Каждого Строка Из ТаблицаТоваров Цикл
		Строка.ОбъемТары = Строка.Контейнер.ТипТары.Объем;
	КонецЦикла;
	
КонецФункции 

Функция ОпределитьОбъемТарыДляКонтейнеров(ТаблицаТоваров) 
	
	РК = вмс_РаботаСКоллекциями;
	МассивКонтейнеров = ТаблицаТоваров.ВыгрузитьКолонку("Контейнер");
	РК.УдалитьДублиВМассиве(МассивКонтейнеров);
	РК.УдалитьПустыеСтрокиКоллекции(МассивКонтейнеров);
	
	Если МассивКонтейнеров.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	// Необходимо определить что больше объем самой тары или объем на таре от этого и плясать
	Для Каждого Контейнер Из МассивКонтейнеров Цикл
		Отбор = Новый Структура("Контейнер", Контейнер);
		НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(Отбор);
		ОбъемНаКонтейнере = 0; 
		ОбъемТары = Контейнер.ТипТары.Объем;   
		Для Каждого Строка Из НайденныеСтроки Цикл
			ОбъемНаКонтейнере = ОбъемНаКонтейнере + (Строка.ОбъемЕдиницыТовара * Строка.Количество);
		КонецЦикла;
		
		Если ОбъемНаКонтейнере > ОбъемТары Тогда 
			РК.ЗаполнитьЗначенияКоллекции(НайденныеСтроки,ОбъемНаКонтейнере,"ОбъемТары");
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции
// ТУ_Прошин_14.11.25-

#КонецОбласти

