
#Область Переменные

&НаКлиенте
Перем ПеременныеКлиент;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьХранилищаЗначений();
	
	вмс_УправлениеСвойствамиСервер.ПриСозданииНаСервере(ЭтаФорма, ЭтаФорма.Объект, , "СтраницаСвойстваОперации");
	
	Элементы.ИмяФормы.КнопкаВыпадающегоСписка = Истина;
	СписокФормОперации = Элементы.ИмяФормы.СписокВыбора;
	СписокФормОперации.Очистить();
	СписокФормОперации.Добавить("ФормаОперацииПоЗаданиюКладовщику");
	
	Объект.ЗаданиеКладовщикуРаспоряжение = "Документ.вмс_ЗаданиеКладовщику";
	
	// ТУ_Алфимов 01.04.26 ++ 
	ДобавляемыеРеквизиты = Новый Массив();
	РеквизитТестовый = Новый РеквизитФормы("ЭтоИнвентаризация",Новый ОписаниеТипов("Булево"),,,Истина);
	ДобавляемыеРеквизиты.Добавить(РеквизитТестовый);
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	ГруппаДляРазмещения = ЭтотОбъект.Элементы.Найти("СтандартныеРеквизитыГруппа");
	НовЭлемент = Элементы.Добавить("ЭтоИнвентаризация", Тип("ПолеФормы"),ГруппаДляРазмещения);
	НовЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовЭлемент.Заголовок = "Это инвентаризация";
	НовЭлемент.ПутьКДанным = "Объект.ЭтоИнвентаризация";
	НовЭлемент.Видимость = Истина;
	// ТУ_Алфимов 01.04.26 --

	ЗаполнитьСписокКлассовОперации();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗагрузитьДанныеМетодов();
	
	//3.2.5 - Переход на отдельное хранилище данных
	//ДанныеСКД = ТекущийОбъект.ДанныеСКД.Получить();
	ДанныеСКД = Справочники.вмс_ИсточникиДанных.ИсточникДанных("ДанныеСКД", ТекущийОбъект.Ссылка);
	Если ТипЗнч(ДанныеСКД)=Тип("Структура") Тогда
		ТекущиеДанныеСКД = ПолучитьТекущиеДанныеСКД();
		Для Каждого ЭлементДанныхСКД Из ДанныеСКД Цикл
			ИмяСКД = ЭлементДанныхСКД.Ключ;
			Если ТекущиеДанныеСКД.Свойство(ИмяСКД) Тогда
				СохранитьСКД(ЭлементДанныхСКД.Значение, ЭтаФорма["АдресДанныеСКД" + ИмяСКД]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПеременныеКлиент = Новый Структура;
	УстановитьВидимостьНастроекРаспоряжений();
	вмс_УправлениеСвойствамиКлиент.ПриОткрытии(ЭтаФорма, Отказ); 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	вмс_РаботаСФормамиКлиент.ПередЗакрытием(ЭтаФорма, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы = Ложь Тогда
		УдалитьХранищаНаФорме();	
	КонецЕсли;
	
	вмс_УправлениеСвойствамиКлиент.ПриЗакрытии(ЭтаФорма, ЗавершениеРаботы);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	вмс_УправлениеСвойствамиСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОперацияВладелец = Справочники.вмс_Операции.ПолучитьСсылку();
		ОбъектСправочника = РеквизитФормыВЗначение("Объект");
		ОбъектСправочника.УстановитьСсылкуНового(ОперацияВладелец);
	Иначе
		ОперацияВладелец = Объект.Ссылка;	
	КонецЕсли;
	
	Если СтрНайти(ТекущийОбъект.КлассОперации, "ВнешняяОбработка.") <> 1 Тогда
		//удалить неиспользуемую внешнюю обработку
		ТекущийОбъект.КлассОперацииХранилище = Справочники.вмс_ИсточникиДанных.СохранитьИсточникДанных("КлассОперацииХранилище", ОперацияВладелец, Неопределено);
	ИначеЕсли ЗначениеЗаполнено(АдресКлассОперацииХранилище) Тогда
		ТекущийОбъект.КлассОперацииХранилище = Справочники.вмс_ИсточникиДанных.СохранитьИсточникДанных("КлассОперацииХранилище", ОперацияВладелец, ПолучитьИзВременногоХранилища(АдресКлассОперацииХранилище));
	КонецЕсли;
	
	
	//3.2.5 - Переход на отдельное хранилище данных
	//ТекущийОбъект.ДанныеСКД = Новый ХранилищеЗначения(ПолучитьТекущиеДанныеСКД());
	//ТекущийОбъект.ХранилищеСКДЗаданияКладовщику = Новый ХранилищеЗначения(ПолучитьСКД(АдресДанныеСКДЗаданияКладовщику));
	
	ТекущийОбъект.ДанныеСКД = Справочники.вмс_ИсточникиДанных.СохранитьИсточникДанных("ДанныеСКД", ОперацияВладелец, ПолучитьТекущиеДанныеСКД());
	ТекущийОбъект.ХранилищеСКДЗаданияКладовщику = Справочники.вмс_ИсточникиДанных.СохранитьИсточникДанных("ХранилищеСКДЗаданияКладовщику", ОперацияВладелец, ПолучитьСКД(АдресДанныеСКДЗаданияКладовщику));
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	
	СохранитьДанныеМетодов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗагрузитьДанныеМетодов();	
	ЗаписатьНормыKPI();
	ОбновитьДополнительныеРеквизиты();
КонецПроцедуры

&НаСервере
Функция ОбновитьДополнительныеРеквизиты()
	
	вмс_УправлениеСвойствамиСервер.ОбновитьДополнительныеРеквизиты(ЭтаФорма);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ОперациОХРНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Функция ОперациОХРНаСервере(Значения)
	Если ТипЗнч(Значения) = Тип ("Структура") Тогда
		Если ЗначениеЗаполнено(Объект.ОтветственноеХранение.НайтиСтроки(Новый Структура("Операция",Значения.вмс_УслугиОтветственногоХранения))) Тогда
			Возврат Ложь;
		Иначе 
			Для Каждого Элемент из Значения.вмс_УслугиОтветственногоХранения Цикл
			Строка = Объект.ОтветственноеХранение.Добавить();
			Строка.Операция = Элемент; 
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значения) = Тип ("Массив") Тогда  
		Для Каждого Значение из Значения Цикл
			Если ЗначениеЗаполнено(Объект.ОтветственноеХранение.НайтиСтроки(Новый Структура("Операция",Значение.Ссылка))) Тогда 
				Продолжить
			Иначе
				Строка = Объект.ОтветственноеХранение.Добавить();
				Строка.Операция = Значение.Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаАрхитектура2 Тогда
		
		ЗаполнитьСписокКлассовОперации();
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаKPI Тогда
		
		ЗаполнитьСтраницуKPI();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоРаспоряжениюПриИзменении(Элемент)
	
	УстановитьВидимостьНастроекРаспоряжений();
	
	Если Объект.ПоРаспоряжению Тогда
		УстановитьСКДЗаданияКладовщику();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСКДЗаданияКладовщику()
	
	спрОбъект = РеквизитФормыВЗначение("Объект");
	СКДДокументы = спрОбъект.ПолучитьСКДДокументы(Ложь);
	АдресДанныеСКДЗаданияКладовщику = СохранитьСКД(СКДДокументы, АдресДанныеСКДЗаданияКладовщику);
		
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспоряжения

&НаКлиенте
Процедура РаспоряженияРаспоряжениеПриИзменении(Элемент)
	Модифицированность = Истина;
	УстановитьВидимостьНастроекРаспоряжений();
КонецПроцедуры  

&НаКлиенте
Процедура РаспоряженияСсылкаНаРаспоряжениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	Если Объект.Распоряжения.НайтиСтроки(Новый Структура("СсылкаНаРаспоряжение", ВыбранноеЗначение)).Количество() > 0 Тогда  
		ОбщегоНазначенияКлиент.СообщитьПользователю("Распоряжение уже в списке");
		СтандартнаяОбработка = Ложь;  
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаРаспоряжение(Имя, Представление)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Имя", Имя);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_РаспоряженияОпераций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_РаспоряженияОпераций КАК вмс_РаспоряженияОпераций
	|ГДЕ
	|	НЕ вмс_РаспоряженияОпераций.ПометкаУдаления
	|	И вмс_РаспоряженияОпераций.РаспоряжениеКонфигуратор = &Имя";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		СсылкаНаРаспоряжение = Выборка.Ссылка;
		Распоряжение = СсылкаНаРаспоряжение.ПолучитьОбъект();
		Если Распоряжение <> Неопределено Тогда
			Возврат СсылкаНаРаспоряжение;
		КонецЕсли;
	КонецЕсли;
	
	Распоряжение = Справочники.вмс_РаспоряженияОпераций.СоздатьЭлемент();
	Распоряжение.Заполнить(Неопределено);
	Распоряжение.Имя = Имя;
	Распоряжение.Наименование = Представление;
	Распоряжение.Записать();
	
	Возврат Распоряжение.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура РаспоряженияПослеУдаления(Элемент)
	УстановитьВидимостьНастроекРаспоряжений();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	ЗначениеОтбора = Новый Структура ("Посуточно",Ложь);
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, РежимПодбора, Отбор", Истина, Истина, Истина,ЗначениеОтбора);
	ОткрытьФорму("Справочник.вмс_УслугиОтветственногоХранения.ФормаВыбора", ПараметрыПодбора,ЭтаФорма);
КонецПроцедуры 

&НаКлиенте
Процедура РаспоряженияСтараяВерсия(Команда)
	Элементы.ГруппаРаспоряжения.ТекущаяСтраница = Элементы.ГруппаРаспоряженияСтарые;
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНоваяВерсия(Команда)
	Если Объект.Распоряжения.Количество() > 0 Тогда
		Объект.Распоряжения.Очистить();
		Модифицированность = Истина;
	КонецЕсли;
	УстановитьВидимостьНастроекРаспоряжений();
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрРезультатов(Команда)
	ТабДок = ПросмотрРезультатовСервер(); 
	ТабДок.Показать();
КонецПроцедуры  

&НаСервере
Функция ПросмотрРезультатовСервер()
	
	ТабДок = Новый ТабличныйДокумент;
	
	ВходящиеПараметры = Новый Структура("Операция, Оператор", ЭтотОбъект.Объект.Ссылка, ОператорДляТестирования);
	Результат = Справочники.вмс_Операции.ПолучитьСписокДокументовПоОперации(ВходящиеПараметры);
	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Результат.Таблица);
	Построитель.Вывести(ТабДок);
		
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьОбработкуКлассОперации(Команда)
	
	ОО = Новый ОписаниеОповещения("ОбработчикВыбораФайлаКлассаОперации", ЭтаФорма);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "Файлы обработок|*.epf";
	ДиалогВыбораФайла.Показать(ОО);
	
КонецПроцедуры

&НаКлиенте
Функция ОбработчикВыбораФайлаКлассаОперации(МассивВыбранныхФайлов, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(МассивВыбранныхФайлов) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВыбранныйФайл = МассивВыбранныхФайлов[0];
	
	ДанныеОбработки = Новый ДвоичныеДанные(ВыбранныйФайл);
	Если ЗначениеЗаполнено(АдресКлассОперацииХранилище) Тогда
		ПоместитьВоВременноеХранилище(ДанныеОбработки, АдресКлассОперацииХранилище);
	Иначе
		АдресКлассОперацииХранилище = ПоместитьВоВременноеХранилище(ДанныеОбработки, УникальныйИдентификатор);
	КонецЕсли;
	
	ИмяОбработки = ПодключитьВнешнююОбработку(АдресКлассОперацииХранилище);
	Если Не ЗначениеЗаполнено(ИмяОбработки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗаполнитьСписокКлассовОперации();
	Объект.КлассОперации = "ВнешняяОбработка." + ИмяОбработки;
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодключитьВнешнююОбработку(АдресХранилищаДанныхОбработки)
	Попытка
		ИмяОбработки = ВнешниеОбработки.Подключить(АдресХранилищаДанныхОбработки);
		Возврат ИмяОбработки;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьИмяРаспоряженияКонфигураторе(Распоряжение)
	Возврат Распоряжение.РаспоряжениеКонфигуратор;
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьНастроекРаспоряжений()
	Элементы.СтраницаРаспоряжения.Видимость = Объект.ПоРаспоряжению;
	Если Объект.Распоряжения.Количество()=0 Тогда
		Элементы.ГруппаРаспоряжения.ТекущаяСтраница = Элементы.ГруппаРаспоряженияНовые;
	Иначе
		Элементы.ГруппаРаспоряжения.ТекущаяСтраница = Элементы.ГруппаРаспоряженияСтарые;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИнициализироватьХранилищаЗначений()
	
	спрОбъект = РеквизитФормыВЗначение("Объект");
	
КонецФункции

&НаСервере
Функция ЗагрузитьЗначениеВХранилищеНаФорме(Имя, Значение)
	
	Перем АдресХранилища;
	
	СписокАдресовХранилищЗначений = ПолучитьСписокАдресовХранилищЗначений();
	
	СписокАдресовХранилищЗначений.Свойство(Имя, АдресХранилища);

	Если АдресХранилища <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(Значение, АдресХранилища);
	Иначе
		АдресХранилища = ПоместитьВоВременноеХранилище(Значение, ЭтаФорма.УникальныйИдентификатор);
		СписокАдресовХранилищЗначений.Вставить(Имя, АдресХранилища);
	КонецЕсли;
	
	Возврат АдресХранилища;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеИзХранилищаНаФорме(Имя)
	
	АдресХранилища = ПолучитьАдресХранилищаНаФорме(Имя);
	Если ЗначениеЗаполнено(АдресХранилища) Тогда
		Возврат ПолучитьИзВременногоХранилища(АдресХранилища);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьАдресХранилищаНаФорме(Имя)
	
	Перем АдресХранилища;
	
	ПолучитьСписокАдресовХранилищЗначений().Свойство(Имя, АдресХранилища);

	Возврат АдресХранилища;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокАдресовХранилищЗначений()
	
	ВсеРеквизитыФормы = ПолучитьРеквизиты();
	Для Каждого РеквизитФормы Из ВсеРеквизитыФормы Цикл
		Если РеквизитФормы.Имя = "СписокАдресовХранилищЗначений" Тогда
			Возврат ЭтаФорма.СписокАдресовХранилищЗначений;
		КонецЕсли;
	КонецЦикла;
	
	НовыеРеквизиты = Новый Массив;
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("СписокАдресовХранилищЗначений", Новый ОписаниеТипов));
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	ЭтаФорма.СписокАдресовХранилищЗначений = Новый Структура;
	Возврат ЭтаФорма.СписокАдресовХранилищЗначений;
	
КонецФункции

&НаСервере
Функция УдалитьХранищаНаФорме()
	
	СписокАдресовХранилищЗначений = ПолучитьСписокАдресовХранилищЗначений();
	
	Для Каждого АдресХранилищаЗначения Из СписокАдресовХранилищЗначений Цикл
		УдалитьИзВременногоХранилища(АдресХранилищаЗначения.Значение);
	КонецЦикла;
	
	СписокАдресовХранилищЗначений.Очистить();
	
КонецФункции

&НаСервере
Функция ЗаполнитьСписокКлассовОперации()
	
	СписокКлассов = Элементы.КлассОперации.СписокВыбора;
	
	СписокКлассов.Очистить();
	
	Для Каждого МетаданныеОбработки Из Метаданные.Обработки Цикл
		
		Если СтрНайти(МетаданныеОбработки.Имя, "вмс_СерверУправляемыйМодульОперацияПоЯчейкам") <> 1 Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектМодуляОперации = Обработки[МетаданныеОбработки.Имя].Создать();
		ЭтоСлужебныйМодуль = ОбъектМодуляОперации.ВыполнитьДействие(вмс_СерверУправляемыеОбработки.Действие("ЭтоСлужебныйМодуль"))=Истина;
		Если ЭтоСлужебныйМодуль Тогда
			Продолжить;
		КонецЕсли;
		
		СписокКлассов.Добавить(МетаданныеОбработки.ПолноеИмя(), МетаданныеОбработки.Синоним);
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(АдресКлассОперацииХранилище) И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//3.2.5 - Переход на отдельное хранилище данных
		//ДанныеОбработкиКлассОперации = Объект.Ссылка.ПолучитьОбъект().УдалитьКлассОперацииХранилище.Получить();
		ДанныеОбработкиКлассОперации = Справочники.вмс_ИсточникиДанных.ИсточникДанных("КлассОперацииХранилище", Объект.Ссылка);
		Если ДанныеОбработкиКлассОперации <> Неопределено Тогда
			АдресКлассОперацииХранилище = ПоместитьВоВременноеХранилище(ДанныеОбработкиКлассОперации, УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресКлассОперацииХранилище) Тогда
		ИмяОбработки = ПодключитьВнешнююОбработку(АдресКлассОперацииХранилище);
		Если ЗначениеЗаполнено(ИмяОбработки) Тогда
			МетаданныеОбработки = ВнешниеОбработки.Создать(ИмяОбработки).Метаданные();
			СписокКлассов.Добавить(МетаданныеОбработки.ПолноеИмя(), МетаданныеОбработки.Синоним + " (внешняя)");
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗагрузитьДанныеМетодов()
	
	Перем РаботаСXML, ОперацииПоЯчейкамКлиентСервер;
	
	РаботаСXML = вмс_РаботаСXMLКлиентСервер;
	ОперацииПоЯчейкамКлиентСервер = вмс_ОперацииПоЯчейкамКлиентСервер;
	
	Для Каждого СтрокаМетодаОперации Из Объект.МетодыОперации Цикл
		
		ОписаниеМетодаОперации = РаботаСXML.ПрочитатьТекстXMLУлучшенная(СтрокаМетодаОперации.Данные);
		Если ТипЗнч(ОписаниеМетодаОперации)<>Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеМетодаОперации.Свойство("ПолныйКод", СтрокаМетодаОперации.ТекстКодаМетода);
		
		ОписаниеМетода = ОперацииПоЯчейкамКлиентСервер.ПолучитьОписаниеМетода(СтрокаМетодаОперации.ТекстКодаМетода);
		Если ОписаниеМетода<>Неопределено Тогда
			СтрокаМетодаОперации.ЕстьОшибкиСинтаксиса = Ложь;
		Иначе
			СтрокаМетодаОперации.ЕстьОшибкиСинтаксиса = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция СохранитьДанныеМетодов()

	Перем РаботаСXML, ОперацииПоЯчейкамКлиентСервер;
	
	РаботаСXML = вмс_РаботаСXMLКлиентСервер;
	ОперацииПоЯчейкамКлиентСервер = вмс_ОперацииПоЯчейкамКлиентСервер;
	
	Для Каждого СтрокаМетодаОперации Из Объект.МетодыОперации Цикл
		
		ОписаниеМетодаОперации = ОперацииПоЯчейкамКлиентСервер.ПолучитьОписаниеМетода(СтрокаМетодаОперации.ТекстКодаМетода);
		Если ОписаниеМетодаОперации=Неопределено Тогда
			ОписаниеМетодаОперации = ОперацииПоЯчейкамКлиентСервер.НовоеОписаниеМетода();
			ОписаниеМетодаОперации.Имя = СтрокаМетодаОперации.ИмяМетода;
		КонецЕсли;
		ОписаниеМетодаОперации.ПолныйКод = СтрокаМетодаОперации.ТекстКодаМетода;
		
		СтрокаМетодаОперации.Данные = РаботаСXML.XMLСтрокаИзЗначенияУлучшенная(ОписаниеМетодаОперации);
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ТекстКодаМетодаПриИзменении(Элемент)
	
	Перем ОперацииПоЯчейкамКлиентСервер;
	
	ОперацииПоЯчейкамКлиентСервер = вмс_ОперацииПоЯчейкамКлиентСервер;

	СтрокаМетодаОперации = Элементы.МетодыОперации.ТекущиеДанные;
	ТекстКодаМетода = СтрокаМетодаОперации.ТекстКодаМетода;
	
	ОписаниеМетода = ОперацииПоЯчейкамКлиентСервер.ПолучитьОписаниеМетода(ТекстКодаМетода);
	
	Если ОписаниеМетода<>Неопределено Тогда
		СтрокаМетодаОперации.ИмяМетода = ОписаниеМетода.Имя;
		СтрокаМетодаОперации.ЕстьОшибкиСинтаксиса = Ложь;
	Иначе
		СтрокаМетодаОперации.ЕстьОшибкиСинтаксиса = Истина;
	КонецЕсли;
	
КонецПроцедуры

#Область Подключаемые_команды 

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	вмс_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, Объект);
КонецПроцедуры

#КонецОбласти

#Область РаботасСКДЗаданияКладовщику

&НаКлиенте
Процедура РедактироватьСКДЗаданияКладовщику(Команда)
		
	Распоряжение = Объект.ЗаданиеКладовщикуРаспоряжение;
	
	Если Распоряжение <> "" Тогда
		ОО = Новый ОписаниеОповещения("СохранитьНастройкиРедактораЗаданийКладовщику",ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ФормаРедакторНастроекСКД", Новый Структура("СКД", АдресДанныеСКДЗаданияКладовщику),ЭтаФорма,,,,ОО);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран документ - основание");
	КонецЕсли;

КонецПроцедуры   

&НаСервере
Функция СохранитьНастройкиРедактораЗаданийКладовщику(АдресСхемыРедактора, ДополнительныеПараметры) Экспорт
	
	Если АдресСхемыРедактора = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СхемыКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыРедактора);
	АдресДанныеСКДЗаданияКладовщику = СохранитьСКД(СхемыКомпоновкиДанных, АдресДанныеСКДЗаданияКладовщику);
	ЭтаФорма.Модифицированность = Истина;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СохранитьСКД(СхемаКомпоновки, АдресСКД)
	
	Если СхемаКомпоновки <> Неопределено Тогда
		Если ЗначениеЗаполнено(АдресСКД) Тогда
			ПоместитьВоВременноеХранилище(СхемаКомпоновки, АдресСКД);
		Иначе
			АдресСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновки, ЭтаФорма.УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	Возврат АдресСКД;
	
КонецФункции

 &НаКлиенте
Процедура ПосмотретьСписокДокументовПоОперации(Команда)
	Если ЭтотОбъект.Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Есть не записанные изменения. Операция не может быть выполнена");
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТабДок = ПросмотрРезультатовДокументыНаСервере();
		ТабДок.Показать();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран тип операции");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПросмотрРезультатовДокументыНаСервере()
	
	ВходящиеПараметры = Новый Структура();
	
	ТабДок = Справочники.вмс_Операции.ПолучитьДанныеПоРаспоряжению(Объект.Ссылка, ЭтотОбъект.Объект.Ссылка,ВходящиеПараметры, Истина);
		
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ПолучитьСКД(АдресСКД)
	
	Если ЗначениеЗаполнено(АдресСКД) Тогда
		СхемаКомпоновки = ПолучитьИзВременногоХранилища(АдресСКД);
		Возврат СхемаКомпоновки;
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПолучитьТекущиеДанныеСКД()
	
	ДанныеСКД = Новый Структура;
	ДанныеСКД.Вставить("ЗаданияКладовщику", ПолучитьСКД(АдресДанныеСКДЗаданияКладовщику));
	Возврат ДанныеСКД;
	
КонецФункции

#КонецОбласти

#Область KPI

&НаКлиенте
Функция ЗаполнитьСтраницуKPI()
	
	Если НЕ НормыKPIЗаполнены() Тогда
		ПеременныеКлиент.Вставить("KPIЗаполнен", Истина);
		ПеременныеКлиент.Вставить("НормыKPIИзменены", Ложь);
		
		ДатаУстановкиНормKPI = ТекущаяДата();
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЗаполнитьНормыKPI();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция НормыKPIЗаполнены()
	
	Возврат ПеременныеКлиент.Свойство("KPIЗаполнен") И ПеременныеКлиент.KPIЗаполнен;
	
КонецФункции

&НаСервере
Функция ЗаполнитьНормыKPI()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НормыKPI.Загрузить(ПолучитьНормыKPI());
	Иначе
		НормыKPI.Очистить();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьНормыKPI(Период=Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_НормыKPIСрезПоследних.Период КАК Период,
	|	вмс_НормыKPIСрезПоследних.Операция КАК Операция,
	|	вмс_НормыKPIСрезПоследних.Единица КАК Единица,
	|	вмс_НормыKPIСрезПоследних.КоличествоМинут КАК КоличествоМинут,
	|	вмс_НормыKPIСрезПоследних.КоличествоЕдиниц КАК КоличествоЕдиниц
	|ИЗ
	|	РегистрСведений.вмс_НормыKPI.СрезПоследних(&Период, Операция = &Операция) КАК вмс_НормыKPIСрезПоследних
	|ГДЕ
	|	вмс_НормыKPIСрезПоследних.КоличествоМинут <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Единица";
	Запрос.УстановитьПараметр("Операция", Объект.Ссылка);
	Если Период=Неопределено Тогда
		Запрос.УстановитьПараметр("Период", ДатаУстановкиНормKPI);
	Иначе
		Запрос.УстановитьПараметр("Период", Период);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	НормыKPIПоЗапросу = РезультатЗапроса.Выгрузить();
	
	Возврат НормыKPIПоЗапросу;
	
КонецФункции

&НаКлиенте
Функция ЗаписатьНормыKPI()
	
	Если НормыKPIЗаполнены() И ПеременныеКлиент.НормыKPIИзменены Тогда
		ЗаписатьНормыKPIНаСервере();
		ПеременныеКлиент.НормыKPIИзменены = Ложь;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ЗаписатьНормыKPIНаСервере()
	
	НормыKPIПоЗапросу = ПолучитьНормыKPI(ДатаУстановкиНормKPI-1);

	НаборЗаписей = РеквизитФормыВЗначение("НормыKPI");
	ТаблицаНормKPI = НаборЗаписей.Выгрузить();
	
	Отбор = Новый Структура("Единица");
	Для Каждого НормаKPIПоЗапросу Из НормыKPIПоЗапросу Цикл
		ЗаполнитьЗначенияСвойств(Отбор, НормаKPIПоЗапросу);
		НайденныеНормыKPI = ТаблицаНормKPI.НайтиСтроки(Отбор);
		Если НайденныеНормыKPI.Количество()=0 Тогда
			//норма удалена, запишем в регистр нулевую норму
			НормаKPI = ТаблицаНормKPI.Добавить();
			ЗаполнитьЗначенияСвойств(НормаKPI, Отбор);
			НормаKPI.КоличествоМинут = 0;
			НормаKPI.КоличествоЕдиниц = 1;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого НормаKPI Из ТаблицаНормKPI Цикл
		НормаKPI.Период = ДатаУстановкиНормKPI;
		НормаKPI.Операция = Объект.Ссылка;
	КонецЦикла;
	
	НаборЗаписей.Отбор.Период.Установить(ДатаУстановкиНормKPI);
	НаборЗаписей.Отбор.Операция.Установить(Объект.Ссылка);
	НаборЗаписей.Загрузить(ТаблицаНормKPI);
	НаборЗаписей.Записать();
	
КонецФункции

&НаКлиенте
Процедура ДатаУстановкиНормKPIПриИзменении(Элемент)
	
	ЗаполнитьНормыKPI();
	
КонецПроцедуры

&НаКлиенте
Процедура НормыKPIПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ПеременныеКлиент.НормыKPIИзменены = Истина;
	
КонецПроцедуры


#КонецОбласти

#Область МетодыОперации

&НаКлиенте
Процедура МетодыОперацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Перем ОперацииПоЯчейкамКлиентСервер;
	
	ОперацииПоЯчейкамКлиентСервер = вмс_ОперацииПоЯчейкамКлиентСервер;

	Отказ = Истина;
	
	ОписаниеМетода = ОперацииПоЯчейкамКлиентСервер.НовоеОписаниеМетода();
	ОписаниеМетода.Директива = "НаКлиенте";
	ОписаниеМетода.Имя = ПолучитьИмяНовогоМетода();
	ОписаниеМетода.Код = "Возврат 0;";
	ПолныйКодМетода = ОперацииПоЯчейкамКлиентСервер.ПолучитьПолныйКодМетода(ОписаниеМетода);
	
	СтрокаМетодаОперации = Объект.МетодыОперации.Добавить();
	СтрокаМетодаОперации.ИмяМетода = ОписаниеМетода.Имя;
	СтрокаМетодаОперации.ТекстКодаМетода = ПолныйКодМетода;
	
	Элементы.МетодыОперации.ТекущаяСтрока = СтрокаМетодаОперации.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяНовогоМетода()
	
	Возврат ПолучитьИмяНовогоЭлемента("НовыйМетод", Объект.МетодыОперации, "ИмяМетода");
	
КонецФункции

&НаКлиенте
Процедура ПараметрыОперацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ИмяНовогоПараметра = ПолучитьИмяНовогоПараметра();
	
	ПараметрОперации = Объект.ПараметрыОперации.Добавить();
	ПараметрОперации.Имя = ИмяНовогоПараметра;
	ПараметрОперации.НаФронтенде = Истина;
	
	Если Копирование Тогда
		
		ПараметрОперацииИсточник = Элементы.ПараметрыОперации.ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(ПараметрОперации, ПараметрОперацииИсточник, , "Имя");
		
	КонецЕсли;
	
	Элементы.ПараметрыОперации.ТекущаяСтрока = ПараметрОперации.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяНовогоПараметра()
	
	Возврат ПолучитьИмяНовогоЭлемента("Параметр", Объект.ПараметрыОперации, "Имя");
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяНовогоЭлемента(ПрефиксЭлемента, ВсеЭлементы, ПолеИмениЭлемента)
	
	ЗарегистрированныеИменаЭлементов = Новый Соответствие;
	
	Для Каждого Элемент Из ВсеЭлементы Цикл
		ЗарегистрированныеИменаЭлементов[ВРЕГ(СокрЛП(Элемент[ПолеИмениЭлемента]))] = Истина;
	КонецЦикла;
	
	НомерЭлемента = 1;
	Пока Истина Цикл
		
		ИмяНовогоЭлемента = ПрефиксЭлемента + Формат(НомерЭлемента, "ЧГ=0");
		Если ЗарегистрированныеИменаЭлементов[ВРЕГ(ИмяНовогоЭлемента)] <> Истина Тогда
			Возврат ИмяНовогоЭлемента;
		КонецЕсли;
		
		НомерЭлемента = НомерЭлемента + 1;
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти

//Для того, чтобы получить серверную форму, например, для добавления новых элементов формы
&НаСервере
Функция СлужебнаяФункцияВызовСервера(ПрограммныйКод, ДополнительныеПараметры=Неопределено) Экспорт
	Возврат вмс_ОбщегоНазначенияСервер.СлужебнаяФункцияВызовСервераНаФорме(ЭтаФорма, ПрограммныйКод, ДополнительныеПараметры);
КонецФункции

#КонецОбласти









