
//#Область ПрограммныйИнтерфейс

// Создает форму МодульКлиента обработки Контур.Маркировка
//
// Параметры:
//  ОтключитьИнициализацию - Булево - (необязательный) Истина, если инициализацию модуля выполнять не нужно;
//  ИдентификаторСеанса - УникальныйИдентификатор - (необязательный) идентификатор сеанса маркировки;
//  ПутьКФорме - Строка - (необязательный) путь к форме модуля клиента;
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения - форма модуля клиента маркировки;
//
Функция МодульМаркировкиКлиент(ОтключитьИнициализацию = Ложь, Знач ИдентификаторСеанса = Неопределено, Знач ПутьКФорме = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторСеанса) Или Не ЗначениеЗаполнено(ПутьКФорме) Тогда
		ПараметрыСоздания = ВзаимодействиеКонтурМаркировкаВызовСервера.ПараметрыСозданияМодуляКлиента(ОтключитьИнициализацию);
		ИдентификаторСеанса = ПараметрыСоздания.ИдентификаторСеанса;
		ПутьКФорме = ПараметрыСоздания.ПутьКФормеМодуляКлиента;
	КонецЕсли;
	
	Результат = ВзаимодействиеКонтурМаркировкаКлиентПовтИсп.МодульМаркировкиКлиент(Строка(ИдентификаторСеанса), ПутьКФорме);
	
	Возврат Результат
	
КонецФункции

// Открывает рабочий стол модуля маркировки
//
Процедура ОткрытьОсновнуюФорму() Экспорт
	
	ОткрытьФорму(ВзаимодействиеКонтурМаркировкаВызовСервера.ПутьКОсновнойФормеМодуля());
	
КонецПроцедуры

// Открывает форму модуля маркировки
//
Процедура ОткрытьФормуМодуля() Экспорт
	
	ОткрытьФорму(ВзаимодействиеКонтурМаркировкаВызовСервера.ПутьКФормеМодуля());
	
КонецПроцедуры

//#КонецОбласти // ПрограммныйИнтерфейс

// #Область УстаревшиеМетоды

// Устарела. следует использовать МодульМаркировкиКлиент
//
Функция МодульКонтурМаркировкаКлиент() Экспорт
	
	Возврат МодульМаркировкиКлиент();
	
КонецФункции

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуНастройкиПодписания()
//
Процедура ОткрытьФормуНастройкиПодписания(Организация, Пользователь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Пользователь", Пользователь);
	
	МодульМаркировкиКлиент().ОткрытьФормуНастройкиПодписания(ПараметрыФормы);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуСпискаКоэффициентовПересчета()
//
// Открывает форму списка коэффицентов для расчета количества кодов по количеству товаров
//
Процедура ОткрытьФормуСпискаКоэффициентовПересчета() Экспорт
	
	МодульМаркировкиКлиент().ОткрытьФормуСпискаКоэффициентовПересчета();
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуКоэффициентаПересчета()
//
// Открывает форму коэффицента для расчета количества кодов по количеству товаров
//
// Параметры:
//  КлючНоменклатуры1С - СправочникСсылка.КонтурМаркировка_КлючиНоменклатуры1С - ключ номенклатуры 1С
//
Процедура ОткрытьФормуКоэффициентаПересчета(КлючНоменклатуры1С) Экспорт
	
	МодульМаркировкиКлиент().ОткрытьФормуКоэффициентаПересчета(КлючНоменклатуры1С);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуСпискаНастроекПодписания()
//
// Открывает форму списка настроек подписания
//
Процедура ОткрытьФормуСпискаНастроекПодписания() Экспорт
	
	МодульМаркировкиКлиент().ОткрытьФормуСпискаНастроекПодписания();
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуСертификата()
//
// Открывает форму сертификата
//
// Параметры:
//  Сертификат     - СправочникСсылка.КонтурМаркировка_Сертификаты - сертификат;
//
Процедура ОткрытьФормуСертификата(Сертификат) Экспорт
	
	МодульМаркировкиКлиент().ОткрытьФормуСертификата(Сертификат);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуКодаМаркировки()
//
// Открывает форму кода через модуль маркировки
//
// Параметры:
//  КодМаркировки - Строка - нормализованный код, карточку которого нужно открыть
//
Процедура ОткрытьФормуКодаМаркировки(КодМаркировки) Экспорт
	
	Если Не ЗначениеЗаполнено(КодМаркировки) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан код маркировки'");
	КонецЕсли;
	
	МодульМаркировкиКлиент().ОткрытьФормуКодаМаркировки(КодМаркировки);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуШаблонаЭтикетки()
//
// Открывает форму шаблона этикетки через модуль маркировки
//
// Параметры:
//  ШаблонЭтикетки - СправочникСсылка.КонтурМаркировка_ШаблоныЭтикеток - шаблон этикетки, который нужно открыть
//
Процедура ОткрытьФормуШаблонаЭтикетки(ШаблонЭтикетки) Экспорт
	
	Если Не ЗначениеЗаполнено(ШаблонЭтикетки) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан шаблона этикетки'");
	КонецЕсли;
	
	МодульМаркировкиКлиент().ОткрытьФормуШаблонаЭтикетки(ШаблонЭтикетки);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуМобильноеУстройство()
//
// Открывает форму Мобильного ТСД через модуль маркировки
//
// Параметры:
//  МобильныйТСД - СправочникСсылка.КонтурМаркировка_МобильныеТСД - Мобильный ТСД
//
Процедура ОткрытьФормуМобильноеУстройство(МобильноеУстройство) Экспорт
	
	Если Не ЗначениеЗаполнено(МобильноеУстройство) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан Мобильный ТСД'");
	КонецЕсли;
	
	МодульМаркировкиКлиент().ОткрытьФормуМобильноеУстройство(МобильноеУстройство);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуПлощадки()
//
// Открывает форму площадки через модуль маркировки
//
// Параметры:
//  Площадка - СправочникСсылка.КонтурМаркировка_Площадки - площадка;
//
Процедура ОткрытьФормуПлощадки(Площадка) Экспорт
	
	Если Не ЗначениеЗаполнено(Площадка) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана площадка'");
	КонецЕсли;
	
	МодульМаркировкиКлиент().ОткрытьФормуПлощадки(Площадка);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуСервисПровайдера()
//
// Открывает форму сервис провайдера через модуль маркировки
//
// Параметры:
//  СервисПровайдер - СправочникСсылка.КонтурМаркировка_СервисПровайдеры - сервис-провайдер
//
Процедура ОткрытьФормуСервисПровайдера(СервисПровайдер) Экспорт
	
	Если Не ЗначениеЗаполнено(СервисПровайдер) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан сервис-провайдер'");
	КонецЕсли;
	
	МодульМаркировкиКлиент().ОткрытьФормуСервисПровайдера(СервисПровайдер);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуВидаАгрегата()
//
// Открывает форму вида агрегата через модуль маркировки
//
// Параметры:
//  ВидАгрегата - СправочникСсылка.КонтурМаркировка_ВидыАгрегатов - вид агрегата, который нужно открыть
//
Процедура ОткрытьФормуВидаАгрегата(ВидАгрегата) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидАгрегата) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан вид агрегата'");
	КонецЕсли;
	
	МодульМаркировкиКлиент().ОткрытьФормуВидаАгрегата(ВидАгрегата);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуТовара()
//
// Открывает форму товара через модуль маркировки
//
// Параметры:
//  Товар - СправочникСсылка.КонтурМаркировка_Товары - товар, который нужно открыть
//
Процедура ОткрытьФормуТовара(Товар) Экспорт
	
	Если Не ЗначениеЗаполнено(Товар) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан товар'");
	КонецЕсли;
	
	МодульМаркировкиКлиент().ОткрытьФормуТовара(Товар);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуОрганизации()
//
// Открывает форму организации через модуль маркировки
//
// Параметры:
//  Организация - СправочникСсылка.КонтурМаркировка_Организации - организация, которую нужно открыть
//
Процедура ОткрытьФормуОрганизации(Организация) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана организация'");
	КонецЕсли;
	
	МодульМаркировкиКлиент().ОткрытьФормуОрганизации(Организация);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуСклада()
//
// Открывает форму склада через модуль маркировки
//
// Параметры:
//  Склад - СправочникСсылка.КонтурМаркировка_Склады - склад, который нужно открыть
//
Процедура ОткрытьФормуСклада(Склад) Экспорт
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан склад'");
	КонецЕсли;
	
	МодульМаркировкиКлиент().ОткрытьФормуСклада(Склад);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуДокументаУчета()
//
// Открывает форму документа учета через модуль маркировки
//
// Параметры:
//  ДокументУчета - СправочникСсылка.КонтурМаркировка_ДокументыУчета - документ учета, который нужно открыть
//
Процедура ОткрытьФормуДокументаУчета(ДокументУчета) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан документ учета'");
	КонецЕсли;
	
	МодульМаркировкиКлиент().ОткрытьФормуДокументаУчета(ДокументУчета);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуОперации()
//
// Открывает форму операции через модуль маркировки
//
// Параметры:
//  Операция - СправочникСсылка.КонтурМаркировка_Операции - операция, которую нужно открыть
//
Процедура ОткрытьФормуОперации(Операция) Экспорт
	
	Если Не ЗначениеЗаполнено(Операция) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана операция'");
	КонецЕсли;
	
	МодульМаркировкиКлиент().ОткрытьФормуОперации(Операция);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуДокументаУчетаПоДокументу1С()
//
Процедура ОткрытьФормуДокументаУчетаПоДокументу(Документ1С) Экспорт
	
	Модуль = МодульМаркировкиКлиент();
	
	Модуль.ОткрытьФормуДокументаУчетаПоДокументу1С(Документ1С, Модуль);
	
КонецПроцедуры

// Устарела. Следует использовать МодульМаркировкиКлиент().ОткрытьФормуДокументаУчетаПоДокументу1С()
//
// Находит или создает документ учета в маркировке по документу 1С и открывает его форму
// Проходит авторизацию для нормализации, если в документ загружены коды
//
// Параметры:
//  Документ1С - ДокументСсылка - документ 1С;
//  ВызывающаяФорма - ФормаКлиентскогоПриложения - вызывающая форма;
//
Процедура ОткрытьФормуДокументаУчетаПоДокументу1С(Документ1С, ВызывающаяФорма) Экспорт
	
	МодульМаркировкиКлиент().ОткрытьФормуДокументаУчетаПоДокументу1С(Документ1С, ВызывающаяФорма);
	
КонецПроцедуры

// #КонецОбласти
