
&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.ОперацииОтветственногоХранения.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОХР_Операции.Ссылка КАК Ссылка,
	|	ОХР_Операции.Наименование КАК Наименование
	|ИЗ
	|	Справочник.вмс_УслугиОтветственногоХранения КАК ОХР_Операции
	|ГДЕ
	|	НЕ ОХР_Операции.Посуточно";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Строка = Объект.ОперацииОтветственногоХранения.Добавить();
		Строка.Операция = Результат.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ЗначениеОтбора = Новый Структура ("Посуточно",Ложь);
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, Отбор", Истина, Истина,ЗначениеОтбора);
	ОткрытьФорму("Справочник.вмс_УслугиОтветственногоХранения.ФормаВыбора", ПараметрыПодбора,ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ОперацииОХРНаСервере(Значения)
	Если ТипЗнч(Значения) = Тип ("Структура") Тогда
		Если ЗначениеЗаполнено(Объект.ОперацииОтветственногоХранения.НайтиСтроки(Новый Структура("Операция",Значения.ОХР_Операции))) Тогда
			Возврат Ложь;
		Иначе 
			Для Каждого Элемент из Значения.ОХР_Операции Цикл
			Строка = Объект.ОперацииОтветственногоХранения.Добавить();
			Строка.Операция = Элемент;  
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значения) = Тип ("Массив") Тогда  
		Для Каждого Значение из Значения Цикл
			Если ЗначениеЗаполнено(Объект.ОперацииОтветственногоХранения.НайтиСтроки(Новый Структура("Операция",Значение.Ссылка))) Тогда 
				Продолжить
			Иначе
				Строка = Объект.ОперацииОтветственногоХранения.Добавить();
				Строка.Операция = Значение.Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОперацииОХРНаСервере (ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Префикс = ВРег(ТекущийОбъект.Префикс);
	ТекущийОбъект.Записать();
	Элемент = ПланыВидовХарактеристик.вмс_СоответствиеМетаданных.НайтиПоНаименованию("Контейнер");
	Найдено = Ложь;
	
	Для Каждого Запись из Элемент.ПрефиксыШтрихкодов Цикл
		Если Запись.Префикс = ТекущийОбъект.Префикс Тогда
			Найдено= Истина;
		КонецЕсли;
		Если Найдено Тогда 
			Прервать;	
		КонецЕсли;
	КонецЦикла;
	
	Если Не Найдено Тогда
		Элемент = Элемент.ПолучитьОбъект();
		ЗаписатьПрефикс = Элемент.ПрефиксыШтрихкодов.Добавить();
		ЗаписатьПрефикс.Префикс = ТекущийОбъект.Префикс; 
		Элемент.Записать();
	КонецЕсли; 
КонецПроцедуры

//Плугина +
&НаКлиенте
Процедура ИспользоватьВнешнююПечатнуюФормуПриИзменении(Элемент)
	ПриИзмененииГалочки();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииГалочки()
	Если Объект.ИспользоватьВнешнююПечатнуюФорму = Истина Тогда 
		Элементы.ЗагрузитьОбработку.Доступность = Истина;
		Элементы.ШаблонЭтикетки.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ПредставлениеВнешнейОбработки.ТолькоПросмотр = Истина; 
		Элементы.ЗагрузитьОбработку.Доступность = Ложь;
		Элементы.ШаблонЭтикетки.ТолькоПросмотр = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриИзмененииГалочки(); 
	ОбновитьПредставлениеОбработки()
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбработку(Команда)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "Файл внешней обработки (*.epf)|*.epf";
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ЗагрузитьОбработкуПередЗавершением_ОбработкаВыбораФайла", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбработкуПередЗавершением_ОбработкаВыбораФайла(СписокФайлов, ДополнительныеПараметры) Экспорт
	Если СписокФайлов = Неопределено Тогда
		//операция отменена
		Возврат;
	КонецЕсли;
	
	ИмяФайла = СписокФайлов[0];
	ЗагрузитьОбработкуВХранилище(ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла)));
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОбработкуВХранилище(Адрес) 
	ПФ = Новый Структура;
	ПФ.Вставить("ФайлПФ",ПолучитьИзВременногоХранилища(Адрес));
	
	Адрес = ПоместитьВоВременноеХранилище(ПФ.ФайлПФ); 
	ИмяОбработки = ВнешниеОбработки.Подключить(Адрес, , Ложь, ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
	ПФ.Вставить("НаименованиеПФ",ИмяОбработки);
	
	КонтейнерОбъект = Объект.Ссылка.ПолучитьОбъект(); 
	КонтейнерОбъект.ВнешняяПечатнаяФорма = Новый ХранилищеЗначения(ПФ, Новый СжатиеДанных(9));  
	КонтейнерОбъект.Записать();
	
	ОбновитьПредставлениеОбработки();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеОбработки()
	ПФ = Объект.Ссылка.ВнешняяПечатнаяФорма.Получить();
	Если ПФ <> Неопределено Тогда
		ЭтотОбъект.ПредставлениеВнешнейОбработки =  ПФ.НаименованиеПФ;	
	КонецЕсли;	
КонецПроцедуры 
//Плугина -
