Функция ПередРаботойСФайлами(КлиентскоеОО=Неопределено) Экспорт

	// Попробуем подключить расширение работы с файлами
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КлиентскоеОО", КлиентскоеОО);
	ДополнительныеПараметры.Вставить("Установить", Истина);
	ОО = Новый ОписаниеОповещения("ПриПодключенииРасширенияДляРаботыСФайлами", вмс_РаботаСФайламиКлиент, ДополнительныеПараметры);

#Если ВебКлиент Тогда
	НачатьПодключениеРасширенияРаботыСФайлами(ОО);
	Возврат Ложь;
#КонецЕсли

	ВыполнитьОбработкуОповещения(ОО, Истина);
	Возврат Истина;
	
КонецФункции

Функция ПриПодключенииРасширенияДляРаботыСФайлами(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		КлиентскоеОО = ДополнительныеПараметры.КлиентскоеОО;
		Если КлиентскоеОО<>Неопределено Тогда
			ВыполнитьОбработкуОповещения(КлиентскоеОО, Истина);
		КонецЕсли;
		
	ИначеЕсли ДополнительныеПараметры.Установить Тогда
		
		ОО = Новый ОписаниеОповещения("ПриУстановкеРасширенияДляРаботыСФайлами", вмс_РаботаСФайламиКлиент, ДополнительныеПараметры);
		НачатьУстановкуРасширенияРаботыСФайлами(ОО);
		
	Иначе
		
		ПоказатьПредупреждение( , НСтр("ru = 'Для выполнения данной операции нужно установить расширение работы с файлами.'"));
		
	КонецЕсли;
	
КонецФункции

Функция ПриУстановкеРасширенияДляРаботыСФайлами(ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Установить = Ложь;
	ОО = Новый ОписаниеОповещения("ПриПодключенииРасширенияДляРаботыСФайлами", вмс_РаботаСФайламиКлиент, ДополнительныеПараметры);
	НачатьПодключениеРасширенияРаботыСФайлами(ОО);
	
КонецФункции
