#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() И ХранилищеСКДТовары.Получить() = Неопределено Тогда 
		СхемаКомпоновкиДанных = ПолучитьСКДСпискаТоваровДокумента(Ложь);
		ХранилищеСКДТовары = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
	КонецЕсли;   
		
	Если Не ЗначениеЗаполнено(Ссылка) И ХранилищеСКДДокументы.Получить() = Неопределено Тогда 
		СхемаКомпоновкиДанных = ПолучитьСКДДокументы(Ложь);
		ХранилищеСКДДокументы = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
	КонецЕсли;
		
КонецПроцедуры 

#Область СКДДокументы

Функция ПолучитьСКДДокументы(ПустойЗапрос) Экспорт
	СхемаКомпоновкиДанных = ПолучитьМакет("СКДСпискаДокументов"); 
	
	НаборДанныхЗапросСхемыКомпоновкиДанных = СхемаКомпоновкиДанных.НаборыДанных.Получить(0);   
	                                                                    
	Если ПустойЗапрос Тогда
		НаборДанныхЗапросСхемыКомпоновкиДанных.Запрос = ПолучитьПустойЗапросПоДокументам();
	Иначе     
		Попытка
			//См. секцию "СКД ДОКУМЕНТЫ УНИКАЛЬНЫЕ ЗАПРОСЫ" здесь же
			Если СтрНайти(ЭтотОбъект.Наименование, "(Поступление)") <> 0 Тогда 
				ТипОперации = "Поступление";
			ИначеЕсли СтрНайти(ЭтотОбъект.Наименование, "(Выбытие)") <> 0 Тогда    
				ТипОперации = "Выбытие";
			Иначе
				ТипОперации = "";
			КонецЕсли;    
			
			УникальныйЗапрос = ПолучитьУникальныйЗапросДокументы(ТипОперации);             
			ТекстЗапроса = УникальныйЗапрос;
		Исключение
			ИсходныйЗапрос = НаборДанныхЗапросСхемыКомпоновкиДанных.Запрос;
			ТекстЗапроса = ПолучитьБазовыйЗапросПоДокументам(ИсходныйЗапрос);	
		КонецПопытки;    
		НаборДанныхЗапросСхемыКомпоновкиДанных.Запрос = ТекстЗапроса;
	КонецЕсли;
	
	МассивТипов = Новый Массив;	
	ПолноеИмяТипа = СтрЗаменить(РаспоряжениеКонфигуратор, ".", "Ссылка.");
	МассивТипов.Добавить(Тип(ПолноеИмяТипа));				
	
	ПолеНабораДанныхСхемыКомпоновкиДанных = НаборДанныхЗапросСхемыКомпоновкиДанных.Поля.Найти("Ссылка");
	ПолеНабораДанныхСхемыКомпоновкиДанных.ТипЗначения = Новый ОписаниеТипов(МассивТипов); 
			
	Возврат СхемаКомпоновкиДанных;
КонецФункции

Функция ПолучитьБазовыйЗапросПоДокументам(ИсходныйЗапрос) Экспорт
	ПозицияВТексте = СтрНайти(ИсходныйЗапрос, Символы.ПС + ";");
	Если ПозицияВТексте = 0 Тогда
		ПозицияВТексте = СтрНайти(ИсходныйЗапрос, ";");
	КонецЕсли;
	
	Если ПозицияВТексте > 0 Тогда
		ПозицияВТексте = ПозицияВТексте - 1;
	Иначе
		ПозицияВТексте = СтрДлина(ИсходныйЗапрос);
	КонецЕсли;
	
	ЛеваяЧастьЗапроса = Лев(ИсходныйЗапрос, ПозицияВТексте);
	ПраваяЧастьЗапроса = Сред(ИсходныйЗапрос, ПозицияВТексте+1);
		
	ИменаСкладаЗапрос = вмс_АдаптацияКонфигураций.ПолучитьИмяСкладаЗапрос();
	
	Реквизиты = Метаданные.НайтиПоПолномуИмени(РаспоряжениеКонфигуратор).Реквизиты; 
	
	СкладВЗапросе = Неопределено;
	
	Для Каждого ИмяСклада Из ИменаСкладаЗапрос Цикл
		Если Реквизиты.Найти(ИмяСклада) <> Неопределено Тогда
			СкладВЗапросе = "ТаблицаДокументов." + ИмяСклада;
			Прервать; //Нужен первый найденный, приоритет важен
		КонецЕсли;
	КонецЦикла;
	
	Если СкладВЗапросе = Неопределено Тогда  
		Если Реквизиты.Найти("СкладОтправитель") <> Неопределено И Реквизиты.Найти("СкладПолучатель") <> Неопределено Тогда
			СкладВЗапросе =
			"ВЫБОР
			|	КОГДА (&ОперацияИмяДляПоиска = ""Приемка"" ИЛИ &ОперацияИмяДляПоиска = ""Размещение"" ИЛИ &ОперацияИмяДляПоиска = ""ПриемкаВЯчейки"")
			|		ТОГДА ТаблицаДокументов.СкладПолучатель
			|		ИНАЧЕ ТаблицаДокументов.СкладОтправитель
			|	КОНЕЦ";
		Иначе   
			СкладВЗапросе = "Неопределено";
		КонецЕсли;           
	КонецЕсли;
	
	ЛеваяЧастьЗапроса = СтрЗаменить(ЛеваяЧастьЗапроса, "&ИмяДокумента", РаспоряжениеКонфигуратор);
	ЛеваяЧастьЗапроса = СтрЗаменить(ЛеваяЧастьЗапроса, "ТаблицаДокументов.Склад", СкладВЗапросе);
			
	Возврат ЛеваяЧастьЗапроса + ПраваяЧастьЗапроса;
КонецФункции

Функция ПолучитьУникальныйЗапросДокументы(ТипОперации)
	//См. секцию "СКД ТОВАРЫ УНИКАЛЬНЫЕ ЗАПРОСЫ" здесь же
	ПрефиксФункции = вмс_АдаптацияКонфигураций.ПрефиксФункции();
	НазваниеДокумента = СтрЗаменить(РаспоряжениеКонфигуратор, "Документ.", ""); 
	Возврат Вычислить("УникальныйЗапросДокументы" + ПрефиксФункции + НазваниеДокумента + ТипОперации + "()");
КонецФункции

Функция ПолучитьПустойЗапросПоДокументам() Экспорт   
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Неопределено КАК Ссылка,
	|	Неопределено КАК Номер,
	|	Неопределено КАК Дата,
	|	Неопределено КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов";
	Возврат ТекстЗапроса; 
КонецФункции

#КонецОбласти

#Область СКДТовары

Функция ПолучитьСКДСпискаТоваровДокумента(ПустойЗапрос) Экспорт
	СхемаКомпоновкиДанных = ПолучитьМакет("СКДСпискаТоваровДокумента");
	
	НаборДанныхЗапросСхемыКомпоновкиДанных = СхемаКомпоновкиДанных.НаборыДанных.Получить(0);    
	
	Если ПустойЗапрос Тогда	
		НаборДанныхЗапросСхемыКомпоновкиДанных.Запрос = ПолучитьПустойЗапросПоТоварам();
	Иначе
		Попытка
			//См. секцию "СКД ТОВАРЫ УНИКАЛЬНЫЕ ЗАПРОСЫ" здесь же
			Если СтрНайти(ЭтотОбъект.Наименование, "(Поступление)") <> 0 Тогда 
				ТипОперации = "Поступление";
			ИначеЕсли СтрНайти(ЭтотОбъект.Наименование, "(Выбытие)") <> 0 Тогда    
				ТипОперации = "Выбытие";
			Иначе
				ТипОперации = "";
			КонецЕсли;    
			
			УникальныйЗапрос = ПолучитьУникальныйЗапросТовары(ТипОперации);             
			ТекстЗапроса = УникальныйЗапрос;
		Исключение                                                                                                           
			ТекстЗапроса = ПолучитьБазовыйЗапросПоТоварам();
		КонецПопытки; 
		НаборДанныхЗапросСхемыКомпоновкиДанных.Запрос = ТекстЗапроса;
	КонецЕсли;  

	Возврат СхемаКомпоновкиДанных;
КонецФункции

Функция ПолучитьБазовыйЗапросПоТоварам() Экспорт 
	Если СтрНайти(ЭтотОбъект.Наименование, "(Поступление)") <> 0 Тогда 
		ТипОперации = "Поступление";
	Иначе    
		ТипОперации = "Выбытие";
	КонецЕсли;
	
	РК = вмс_РаботаСКоллекциями;                                               
	АК = вмс_АдаптацияКонфигураций;
	ТекстЗапроса = "";    
	ПсевдонимОсновнойТаблицы = "ТаблицаТоваров";                    
	СтандартныеРеквизиты = РК.СтрокуВМассив("Ссылка, Номенклатура, Характеристика, Количество");
	РазделительЗапросов = "////////////////////////////////////////////////////////////////////////////////";
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(РаспоряжениеКонфигуратор);
	ИменаТабличныхЧастей = АК.ПолучитьИмяТабличнойЧасти(); 
	НесколькоТаблиц = АК.ПолучитьДокументыСНесколькимиТЧ().Получить(РаспоряжениеКонфигуратор); 	
	
	//Для работы по заданию кладовщику в конфигурациях, где стандартная ТЧ называется не "Товары"
	Если РаспоряжениеКонфигуратор = "Документ.вмс_ЗаданиеКладовщику" Тогда
		ИменаТабличныхЧастей = Новый Массив;
		ИменаТабличныхЧастей.Добавить("Товары");
		НесколькоТаблиц = Неопределено;
	КонецЕсли;
	
	Если НесколькоТаблиц <> Неопределено Тогда  
		Если ТипЗнч(НесколькоТаблиц) = Тип("Структура") Тогда //Если распоряжение одного типа (Поступление/Выбытие), то Массив, иначе Структура("Поступление, Выбытие", Массив1, Массив2)
			НесколькоТаблиц = НесколькоТаблиц[ТипОперации];
		КонецЕсли;
		
		КоличествоТаблиц = НесколькоТаблиц.Количество()-1;
		Для Индекс = 0 По КоличествоТаблиц Цикл  
			ИмяТЧ = НесколькоТаблиц[Индекс];   
			
			Если Индекс = 0 Тогда      
				ДобавитьПсевдонимПоля = Истина;
			Иначе
				ДобавитьПсевдонимПоля = Ложь;
			КонецЕсли;         
			
			ТекстЗапроса = ТекстЗапроса + ПолучитьПервуюЧастьЗапросаТовары(ПсевдонимОсновнойТаблицы, РаспоряжениеКонфигуратор + "." + ИмяТЧ, ДобавитьПсевдонимПоля, СтандартныеРеквизиты, Неопределено);
			
			Если Индекс <> КоличествоТаблиц Тогда   
				ТекстЗапроса = ТекстЗапроса + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ИмяТабличнойЧасти Из ИменаТабличныхЧастей Цикл
			МетаданныеТабличнойЧасти = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
			Если МетаданныеТабличнойЧасти <> Неопределено Тогда  
				ИмяТЧ = МетаданныеТабличнойЧасти.Имя;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ТекстЗапроса = ТекстЗапроса + ПолучитьПервуюЧастьЗапросаТовары(ПсевдонимОсновнойТаблицы, РаспоряжениеКонфигуратор + "." + ИмяТЧ, Истина, СтандартныеРеквизиты, Неопределено);
	КонецЕсли;
													   
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС + РазделительЗапросов + Символы.ПС;       
	
	ТекстЗапроса = ТекстЗапроса + ПолучитьВторуюЧастьЗапросаТовары(ПсевдонимОсновнойТаблицы, СтандартныеРеквизиты, Неопределено, Неопределено);
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ПолучитьУникальныйЗапросТовары(ТипОперации)
	//См. секцию "СКД ТОВАРЫ УНИКАЛЬНЫЕ ЗАПРОСЫ" здесь же
	ПрефиксФункции = вмс_АдаптацияКонфигураций.ПрефиксФункции();
	НазваниеДокумента = СтрЗаменить(РаспоряжениеКонфигуратор, "Документ.", ""); 
	Возврат Вычислить("УникальныйЗапросТовары" + ПрефиксФункции + НазваниеДокумента + ТипОперации + "()");
КонецФункции

Функция ПолучитьПустойЗапросПоТоварам() Экспорт   
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|  Неопределено КАК Ссылка,
	|  Неопределено КАК Товар,
	|  Неопределено КАК Характеристика,
	|  0 КАК Количество
	|ПОМЕСТИТЬ ТаблицаТоваров";
	
	Возврат ТекстЗапроса; 
КонецФункции


#КонецОбласти

#Область СКДТоварыУникальныеЗапросы


//Для выбытия запрос формируется стандартными методами
Функция УникальныйЗапросТоварыУНФ_КомплектацияЗапасовПоступление()     
	Текст = "
	|ВЫБРАТЬ
	|	КомплектацияЗапасов.Номенклатура КАК Товар,
	|	КомплектацияЗапасов.Характеристика КАК Характеристика,
	|	КомплектацияЗапасов.Ссылка КАК Ссылка,
	|	КомплектацияЗапасов.Количество КАК Количество
	|ИЗ
	|	Документ.КомплектацияЗапасов КАК КомплектацияЗапасов";
	Возврат Текст;
КонецФункции

//Для выбытия запрос формируется стандартными методами
Функция УникальныйЗапросТоварыУНФ_ПересортицаЗапасовПоступление()     
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.НоменклатураОприходование КАК Номенклатура,
	|	ТаблицаТоваров.ХарактеристикаОприходование КАК Характеристика,
	|	ТаблицаТоваров.Количество КАК Количество
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.ПересортицаЗапасов.Запасы КАК ТаблицаТоваров
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика";
	Возврат Текст;
КонецФункции

//УТ ЗаказНаСборку - одинаковые запросы для поступления/выбытия из-за специфики документа
Функция УникальныйЗапросТоварыУТ_ЗаказНаСборкуПоступление()
	Текст = "
	|ВЫБРАТЬ
	|	ЗаказНаСборку.Ссылка КАК Ссылка,
	|	ЗаказНаСборку.Номенклатура КАК Номенклатура,
	|	ЗаказНаСборку.Характеристика КАК Характеристика,
	|	ЗаказНаСборку.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ЗаказНаСборку.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|		ТОГДА ""Поступление""
	|		ИНАЧЕ ""Выбытие""
	|	КОНЕЦ КАК Операция
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.ЗаказНаСборку КАК ЗаказНаСборку

	|ОБЪЕДИНИТЬ ВСЕ

	|ВЫБРАТЬ
	|	ЗаказНаСборкуТовары.Ссылка,
	|	ЗаказНаСборкуТовары.Номенклатура,
	|	ЗаказНаСборкуТовары.Характеристика,
	|	ЗаказНаСборкуТовары.Количество,
	|	ВЫБОР
	|		КОГДА ЗаказНаСборкуТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|		ТОГДА ""Выбытие""
	|		ИНАЧЕ ""Поступление""
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЗаказНаСборку.Товары КАК ЗаказНаСборкуТовары
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Операция = 
	|		ВЫБОР
	|			КОГДА &ОперацияИмяДляПоиска = ""Приемка"" ИЛИ &ОперацияИмяДляПоиска = ""Размещение"" ИЛИ &ОперацияИмяДляПоиска = ""ПриемкаВЯчейки""
	|			ТОГДА ""Поступление""
	|			ИНАЧЕ ""Выбытие""
	|		КОНЕЦ

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика";	   
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросТоварыУТ_ЗаказНаСборкуВыбытие()
	Текст = "
	|ВЫБРАТЬ
	|	ЗаказНаСборку.Ссылка КАК Ссылка,
	|	ЗаказНаСборку.Номенклатура КАК Номенклатура,
	|	ЗаказНаСборку.Характеристика КАК Характеристика,
	|	ЗаказНаСборку.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ЗаказНаСборку.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|		ТОГДА ""Поступление""
	|		ИНАЧЕ ""Выбытие""
	|	КОНЕЦ КАК Операция
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.ЗаказНаСборку КАК ЗаказНаСборку

	|ОБЪЕДИНИТЬ ВСЕ

	|ВЫБРАТЬ
	|	ЗаказНаСборкуТовары.Ссылка,
	|	ЗаказНаСборкуТовары.Номенклатура,
	|	ЗаказНаСборкуТовары.Характеристика,
	|	ЗаказНаСборкуТовары.Количество,
	|	ВЫБОР
	|		КОГДА ЗаказНаСборкуТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|		ТОГДА ""Выбытие""
	|		ИНАЧЕ ""Поступление""
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЗаказНаСборку.Товары КАК ЗаказНаСборкуТовары
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Операция = 
	|		ВЫБОР
	|			КОГДА &ОперацияИмяДляПоиска = ""Приемка"" ИЛИ &ОперацияИмяДляПоиска = ""Размещение"" ИЛИ &ОперацияИмяДляПоиска = ""ПриемкаВЯчейки""
	|			ТОГДА ""Поступление""
	|			ИНАЧЕ ""Выбытие""
	|		КОНЕЦ

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика";	   
	Возврат Текст;
КонецФункции

//УТ СборкаТоваров - одинаковые запросы для поступления/выбытия из-за специфики документа
Функция УникальныйЗапросТоварыУТ_СборкаТоваровПоступление()
	Текст = "
	|ВЫБРАТЬ
	|	СборкаТоваров.Ссылка КАК Ссылка,
	|	СборкаТоваров.Номенклатура КАК Номенклатура,
	|	СборкаТоваров.Характеристика КАК Характеристика,
	|	СборкаТоваров.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА СборкаТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|		ТОГДА ""Поступление""
	|		ИНАЧЕ ""Выбытие""
	|	КОНЕЦ КАК Операция
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.СборкаТоваров КАК СборкаТоваров

	|ОБЪЕДИНИТЬ ВСЕ

	|ВЫБРАТЬ
	|	СборкаТоваровТовары.Ссылка,
	|	СборкаТоваровТовары.Номенклатура,
	|	СборкаТоваровТовары.Характеристика,
	|	СборкаТоваровТовары.Количество,
	|	ВЫБОР
	|		КОГДА СборкаТоваровТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|		ТОГДА ""Выбытие""
	|		ИНАЧЕ ""Поступление""
	|	КОНЕЦ
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК СборкаТоваровТовары
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Операция = 
	|		ВЫБОР
	|			КОГДА &ОперацияИмяДляПоиска = ""Приемка"" ИЛИ &ОперацияИмяДляПоиска = ""Размещение"" ИЛИ &ОперацияИмяДляПоиска = ""ПриемкаВЯчейки""
	|			ТОГДА ""Поступление""
	|			ИНАЧЕ ""Выбытие""
	|		КОНЕЦ

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика";	   
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросТоварыУТ_СборкаТоваровВыбытие()
	Текст = "
	|ВЫБРАТЬ
	|	СборкаТоваров.Ссылка КАК Ссылка,
	|	СборкаТоваров.Номенклатура КАК Номенклатура,
	|	СборкаТоваров.Характеристика КАК Характеристика,
	|	СборкаТоваров.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА СборкаТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|		ТОГДА ""Поступление""
	|		ИНАЧЕ ""Выбытие""
	|	КОНЕЦ КАК Операция
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.СборкаТоваров КАК СборкаТоваров

	|ОБЪЕДИНИТЬ ВСЕ

	|ВЫБРАТЬ
	|	СборкаТоваровТовары.Ссылка,
	|	СборкаТоваровТовары.Номенклатура,
	|	СборкаТоваровТовары.Характеристика,
	|	СборкаТоваровТовары.Количество,
	|	ВЫБОР
	|		КОГДА СборкаТоваровТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|		ТОГДА ""Выбытие""
	|		ИНАЧЕ ""Поступление""
	|	КОНЕЦ
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК СборкаТоваровТовары
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Операция = 
	|		ВЫБОР
	|			КОГДА &ОперацияИмяДляПоиска = ""Приемка"" ИЛИ &ОперацияИмяДляПоиска = ""Размещение"" ИЛИ &ОперацияИмяДляПоиска = ""ПриемкаВЯчейки""
	|			ТОГДА ""Поступление""
	|			ИНАЧЕ ""Выбытие""
	|		КОНЕЦ

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика";	   
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросТоварыУТ_АктОРасхожденияхПослеПриемкиПоступление()
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу КАК Количество
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу > 0
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика"; 
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросТоварыУТ_АктОРасхожденияхПослеПриемкиВыбытие()
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	(ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу) * -1 КАК Количество
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу < 0
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика"; 
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросТоварыУТ_АктОРасхожденияхПослеПеремещенияПоступление()
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу КАК Количество
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу > 0
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика"; 
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросТоварыУТ_АктОРасхожденияхПослеПеремещенияВыбытие()
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	(ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу) * -1 КАК Количество
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу < 0
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика"; 
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросТоварыУТ_АктОРасхожденияхПослеОтгрузкиПоступление()
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу КАК Количество
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеОтгрузки.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу > 0
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика"; 
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросТоварыУТ_АктОРасхожденияхПослеОтгрузкиВыбытие()
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	(ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу) * -1 КАК Количество
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеОтгрузки.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу < 0
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Номенклатура КАК Товар,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика"; 
	Возврат Текст;
КонецФункции


#КонецОбласти

#Область СКДДокументыУникальныеЗапросы

Функция УникальныйЗапросДокументыУНФ_ПеремещениеЗапасовПоступление()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиницаПолучатель КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ПеремещениеЗапасов КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ 
	|	И ТаблицаДокументов.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО (ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ)";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУНФ_ПеремещениеЗапасовВыбытие()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиница КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ПеремещениеЗапасов КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО (ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ)";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУНФ_ЗаказПокупателяПоступление()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиницаРезерв КАК Склад,
	|	СУММА(ЕСТЬNULL(ЗаказПокупателяМатериалыЗаказчика.Количество, 0)) КАК Количество
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.МатериалыЗаказчика КАК ЗаказПокупателяМатериалыЗаказчика
	|		ПО (ЗаказПокупателяМатериалыЗаказчика.Ссылка = ТаблицаДокументов.Ссылка)
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|	И ТаблицаДокументов.СтруктурнаяЕдиницаРезерв <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	И ТаблицаДокументов.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументов.Ссылка,
	|	ТаблицаДокументов.Номер,
	|	ТаблицаДокументов.Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиницаРезерв
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|ГДЕ
	|	ТаблицаДокументов.Количество > 0";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУНФ_ЗаказПокупателяВыбытие()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиницаРезерв КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|	И ТаблицаДокументов.СтруктурнаяЕдиницаРезерв <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) 
	|	И ТаблицаДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУНФ_ЗаказПоставщикуПоступление()
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиницаРезерв КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|	И ТаблицаДокументов.СтруктурнаяЕдиницаРезерв <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ";	   
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУНФ_ЗаказПоставщикуВыбытие()
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.СтруктурнаяЕдиницаРезерв КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|	И ТаблицаДокументов.СтруктурнаяЕдиницаРезерв <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	И ТаблицаДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПоставщику.ЗаказНаПереработку)
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ";	   
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_ЗаявкаНаВозвратТоваровОтКлиентаВыбытие()
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	СУММА(ЕСТЬNULL(ЗаявкаНаВозвратТоваровОтКлиентаЗаменяющиеТовары.Количество, 0)) КАК Количество
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ЗаявкаНаВозвратТоваровОтКлиентаЗаменяющиеТовары
	|		ПО (ЗаявкаНаВозвратТоваровОтКлиентаЗаменяющиеТовары.Ссылка = ТаблицаДокументов.Ссылка)
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ

	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументов.Ссылка,
	|	ТаблицаДокументов.Номер,
	|	ТаблицаДокументов.Дата,
	|	ТаблицаДокументов.Склад
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|ГДЕ
	|	ТаблицаДокументов.Количество > 0";	
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_АктОРасхожденияхПослеПриемкиПоступление()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу > 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТоваров.Ссылка ЕСТЬ NULL";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_АктОРасхожденияхПослеПриемкиВыбытие()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу < 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТоваров.Ссылка ЕСТЬ NULL";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_АктОРасхожденияхПослеПеремещенияПоступление()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу > 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПеремещения КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТоваров.Ссылка ЕСТЬ NULL";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_АктОРасхожденияхПослеПеремещенияВыбытие()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу < 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПеремещения КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТоваров.Ссылка ЕСТЬ NULL";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_АктОРасхожденияхПослеОтгрузкиПоступление()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеОтгрузки.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу > 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.АктОРасхожденияхПослеОтгрузки КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТоваров.Ссылка ЕСТЬ NULL";
	Возврат Текст;
КонецФункции

Функция УникальныйЗапросДокументыУТ_АктОРасхожденияхПослеОтгрузкиВыбытие()  
	Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.АктОРасхожденияхПослеОтгрузки.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоУпаковок - ТаблицаТоваров.КоличествоУпаковокПоДокументу < 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Склад
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.АктОРасхожденияхПослеОтгрузки КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.ПометкаУдаления = ЛОЖЬ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Номер КАК Номер,
	|	ТаблицаДокументов.Дата КАК Дата,
	|	ТаблицаДокументов.Склад КАК Склад,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТаблицаДокументов.Ссылка = вмс_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаТоваров.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТоваров.Ссылка ЕСТЬ NULL";
	Возврат Текст;
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункции

Функция ПолучитьПервуюЧастьЗапросаТовары(ПсевдонимТаблицы, ИмяТаблицы, ДобавитьПсевдонимПоля, СтандартныеРеквизиты, РеквизитыСПсевдонимами)    
	Текст = "ВЫБРАТЬ";
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + "." + Реквизит;
		Если ДобавитьПсевдонимПоля Тогда
			Текст = Текст + " КАК " + Реквизит + ",";
		Иначе
			Текст = Текст + ",";
		КонецЕсли;
	КонецЦикла;  
	
	Если РеквизитыСПсевдонимами <> Неопределено Тогда
		Для Каждого Реквизит Из РеквизитыСПсевдонимами Цикл
			Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + "." + Реквизит.Значение;
			Если ДобавитьПсевдонимПоля Тогда
				Текст = Текст + " КАК " + Реквизит.Ключ + ",";
			Иначе
				Текст = Текст + ",";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Текст = Лев(Текст, СтрДлина(Текст) - 1); //Убрать запятую
	
	Если ДобавитьПсевдонимПоля Тогда
		Текст = Текст + Символы.ПС + "ПОМЕСТИТЬ " + ПсевдонимТаблицы;
	КонецЕсли;
	
	Текст = Текст + Символы.ПС + "ИЗ";
	Текст = Текст + Символы.ПС + Символы.Таб + ИмяТаблицы + " КАК " + ПсевдонимТаблицы;   
	
	Возврат Текст;
КонецФункции	

Функция ПолучитьВторуюЧастьЗапросаТовары(ПсевдонимТаблицы, СтандартныеРеквизиты, РеквизитыСПсевдонимами, Условия)    
	Текст = "ВЫБРАТЬ";
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		Если Реквизит = "Количество" Тогда
			Текст = Текст + Символы.ПС + Символы.Таб + "СУММА(" + ПсевдонимТаблицы + ".Количество)"; 
		Иначе
			Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + "." + Реквизит;  
		КонецЕсли; 
		
		Если Реквизит = "Номенклатура" Тогда
			Текст = Текст + " КАК Товар,";
		Иначе
			Текст = Текст + " КАК " + Реквизит + ",";
		КонецЕсли;
	КонецЦикла;
	
	Если РеквизитыСПсевдонимами <> Неопределено Тогда
		Для Каждого Реквизит Из РеквизитыСПсевдонимами Цикл
			Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + "." + Реквизит.Значение;
			Текст = Текст + " КАК " + Реквизит.Ключ + ",";
		КонецЦикла;
	КонецЕсли;
		
	Текст = Лев(Текст, СтрДлина(Текст) - 1); //Убрать запятую
	
	Текст = Текст + Символы.ПС + "ИЗ";
	Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + " КАК " + ПсевдонимТаблицы;   
	
	Если Условия <> Неопределено Тогда                                                                                                                     
		Текст = Текст + Символы.ПС + "ГДЕ"; 
		Текст = Текст + Символы.ПС + Условия;
	КонецЕсли;  
	
	Текст = Текст + Символы.ПС + "СГРУППИРОВАТЬ ПО"; 
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		Если Реквизит <> "Количество" Тогда
			Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + "." + Реквизит + ",";
		КонецЕсли;
	КонецЦикла;
	
	Если РеквизитыСПсевдонимами <> Неопределено Тогда
		Для Каждого Реквизит Из РеквизитыСПсевдонимами Цикл
			Текст = Текст + Символы.ПС + Символы.Таб + ПсевдонимТаблицы + "." + Реквизит.Значение + ",";
		КонецЦикла;
	КонецЕсли;
	
	Текст = Лев(Текст, СтрДлина(Текст) - 1); //Убрать запятую
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#Иначе

#КонецЕсли




