#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
//3.2.4 - Добавлен реквизит ШТРИХКОД и его заполнение для новых объектов.
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеТехническое = вмс_РаботаСКоллекциями.ДобавитьЛидирующиеНулиЧиселВСтроке(Наименование, 3);
	
	Если Не ЗначениеЗаполнено(Владелец) Тогда
		Если ЗначениеЗаполнено(Родитель.Владелец) Тогда  
			Владелец = Родитель.Владелец;
		Иначе
			Владелец = вмс_ОперацииПоЯчейкамСервер.ПолучитьСкладПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
	// 3.2.4 - по умолчанию штрихкод ячейки формируется из кода, если нет другого штрихкода.
	Если Не ЗначениеЗаполнено(Код) Тогда
		УстановитьНовыйКод();
		Если Не ЗначениеЗаполнено(Штрихкод) И НЕ ЭтоГруппа Тогда
			Штрихкод = Код;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель) И Владелец <> Родитель.Владелец Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя поместить ячейку склада " + Владелец + " В группу склада " + Родитель.Владелец;
		Сообщение.Сообщить(); 
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоНовый() ИЛИ Ссылка.Наименование <> Наименование ИЛИ Ссылка.Владелец <> Владелец Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	вмс_МестаХранения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
		|ГДЕ
		|	вмс_МестаХранения.Наименование = &Наименование
		|	И вмс_МестаХранения.Владелец = &Владелец
		|	И вмс_МестаХранения.Ссылка <> &Ссылка";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ТекстСообщения = НСтр("ru = 'Место хранения с таким наименованием уже создано!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Иначе

#КонецЕсли