&НаКлиенте
Перем Переменные Экспорт;

//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

&НаКлиентеНаСервереБезКонтекста
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Перем РК;
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	ЭтаФорма.ИмяЭлемента = Переменные.Элемент.ИмяЭлемента;
	ЭтаФорма.ТипЭлемента = Переменные.Элемент.ТипЭлемента;
	ЭтаФорма.ВидЭлемента = Переменные.Элемент.ВидЭлемента;
	Переменные.ИсходноеИмяЭлемента =  Переменные.Элемент.ИмяЭлемента;
	Переменные.ПрежнееИмяЭлемента = Переменные.Элемент.ИмяЭлемента;
	Переменные.СведенияОТипахЭлементовФормы = ВладелецФормы.Переменные.СведенияОТипахЭлементовФормы;
	
	Переменные.СписокВыбораВидаЭлемента = вмс_КонструкторФорм.ПолучитьСписокВыбораДоступныхВидовЭлемента(Переменные.СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента, Переменные.Элемент.ПолучитьРодителя());
	
	ЗначенияСвойствЭлемента = РК.НайтиЭлементыКоллекции(ВладелецФормы.Переменные.ТаблицаЗначенийСвойствЭлементов, Новый Структура("ИмяЭлемента", ИмяЭлемента));
	РК.УстановитьЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойств, ЗначенияСвойствЭлемента);
	
	ОбработчикиСобытийЭлемента = РК.НайтиЭлементыКоллекции(ВладелецФормы.Переменные.ТаблицаОбработчиковСобытийЭлементов, Новый Структура("ИмяЭлемента", ИмяЭлемента));
	РК.УстановитьЭлементыКоллекции(Переменные.ТаблицаОбработчиковСобытий, ОбработчикиСобытийЭлемента);
	
	ЗаполнитьТаблицуСвойствНаФорме();
	ЗаполнитьТаблицуОбработчиковСобытийНаФорме();
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьТаблицуСвойствНаФорме()

	Перем РК;
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	ЭтаФорма.ТаблицаЗначенийСвойств.Очистить();

	СвойстваЭлемента = РК.НайтиЭлементыКоллекции(Переменные.СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов, Новый Структура("ТипЭлемента, ВидЭлемента", Переменные.Элемент.ТипЭлемента, ЭтаФорма.ВидЭлемента));
	
	ОтборЗначенийСвойствЭлемента = Новый Структура("ИмяСвойства");
	
	Для Каждого СвойствоЭлемента Из СвойстваЭлемента Цикл
		
		Если СвойствоЭлемента.ИмяСвойства="Вид" Тогда
			СписокВыбора = Переменные.СписокВыбораВидаЭлемента;
		Иначе
			СписокВыбора = СвойствоЭлемента.СписокВыбора;
		КонецЕсли;
		ОтборЗначенийСвойствЭлемента.ИмяСвойства = СвойствоЭлемента.ИмяСвойства;
		НайденныеЗначенияСвойстваЭлемента = РК.НайтиЭлементыКоллекции(Переменные.ТаблицаЗначенийСвойств, ОтборЗначенийСвойствЭлемента);
		Если НайденныеЗначенияСвойстваЭлемента.Количество() > 0 Тогда
			СтрокаЗначенияСвойства = НайденныеЗначенияСвойстваЭлемента[0];
			ЗначениеСвойства = СтрокаЗначенияСвойства.ЗначениеСвойства;
			Если СписокВыбора=Неопределено Тогда
				ОписаниеТипов = Новый ОписаниеТипов(СвойствоЭлемента.Тип);
				ЗначениеСвойства = ОписаниеТипов.ПривестиЗначение(ЗначениеСвойства);
			КонецЕсли;
		Иначе
			ЗначениеСвойства = СвойствоЭлемента.ЗначениеПоУмолчанию;
			СтрокаЗначенияСвойства = РК.ДобавитьЭлементКоллекции(Переменные.ТаблицаЗначенийСвойств, ОтборЗначенийСвойствЭлемента);
			СтрокаЗначенияСвойства.ЗначениеСвойства = ЗначениеСвойства;
		КонецЕсли;
		
		СтрокаЗначенияСвойства.СписокВыбора = СписокВыбора;
		СтрокаЗначенияСвойства.Тип = СвойствоЭлемента.Тип;

		Если СписокВыбора<>Неопределено Тогда
			
			Если СвойствоЭлемента.ИмяСвойства="Вид" Тогда
				ОписаниеВидаЭлемента = ПолучитьОписаниеВидаЭлементаПоЗначениюСвойства(ЗначениеСвойства);
				ЭлементСписка = СписокВыбора.НайтиПоЗначению(ОписаниеВидаЭлемента);
				Если ЭлементСписка=Неопределено Тогда
					Если СписокВыбора.Количество() > 0 Тогда
						//вид по умолчанию недоступен
						//поменяем на первый доступный
						ЭлементСписка = СписокВыбора.Получить(0);
						ОписаниеВидаЭлемента = ЭлементСписка.Значение;
					КонецЕсли;
				КонецЕсли;
				ЭтаФорма.ВидЭлемента = ОписаниеВидаЭлемента.ВидЭлемента;
			Иначе
				ЭлементСписка = СписокВыбора.НайтиПоЗначению(ЗначениеСвойства);
			КонецЕсли;
			
			Если ЭлементСписка<>Неопределено Тогда
				ЗначениеСвойстваНаФорме = ЭлементСписка.Представление;
			Иначе
				ЗначениеСвойстваНаФорме = Неопределено;
			КонецЕсли;
			
		Иначе
			ЗначениеСвойстваНаФорме = ЗначениеСвойства;
		КонецЕсли;

		СтрокаЗначенияСвойства = ЭтаФорма.ТаблицаЗначенийСвойств.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗначенияСвойства, СвойствоЭлемента);
		
		//не все типы значений можно впихнуть в таблицу формы, также нужно для отображения представлений значений
		Если ТипЗнч(ЗначениеСвойстваНаФорме)=Тип("Картинка") Тогда
			СтрокаЗначенияСвойства.ЗначениеСвойстваКартинка = ЗначениеСвойстваНаФорме; 
		Иначе
			СтрокаЗначенияСвойства.ЗначениеСвойства = ЗначениеСвойстваНаФорме; 
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьТаблицуОбработчиковСобытийНаФорме()
	
	Перем РК;
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;

	СобытияЭлементов = вмс_КонструкторФорм.ПолучитьСобытияЭлементаФормы(Переменные.СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента);
	
	ЭтаФорма.ТаблицаОбработчиковСобытий.Очистить();
	Для Каждого СобытиеЭлемента Из СобытияЭлементов Цикл
		
		ОтборОбработчикаСобытия = Новый Структура("ИмяСобытия", СобытиеЭлемента.ИмяСобытия);
		НайденныйОбработчикСобытия = РК.НайтиЭлементКоллекции(Переменные.ТаблицаОбработчиковСобытий, ОтборОбработчикаСобытия);
		Если НайденныйОбработчикСобытия <> Неопределено Тогда
			ИмяОбработчика = НайденныйОбработчикСобытия.ИмяОбработчика;
		Иначе
			ИмяОбработчика = "";
			СтрокаОбработчикаСобытия = РК.ДобавитьЭлементКоллекции(Переменные.ТаблицаОбработчиковСобытий, ОтборОбработчикаСобытия);
			СтрокаОбработчикаСобытия.ИмяОбработчика = ИмяОбработчика;
		КонецЕсли;

		СтрокаОбработчикаСобытия = ЭтаФорма.ТаблицаОбработчиковСобытий.Добавить();
		СтрокаОбработчикаСобытия.ИмяСобытия = СобытиеЭлемента.ИмяСобытия;
		СтрокаОбработчикаСобытия.ИмяОбработчика = ИмяОбработчика;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеВидаЭлементаПоЗначениюСвойства(ЗначениеСвойства)
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	ОписаниеВидаЭлемента = РК.НайтиЭлементКоллекции(Переменные.СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов, Новый Структура("ЗначениеСвойстваВидЭлемента", ЗначениеСвойства));
	
	Возврат ОписаниеВидаЭлемента;
	
КонецФункции

&НаКлиенте
Функция Инициализация()
	
	Перем РК, РаботаСФормамиКлиент;
	Перем ТаблицаЗначенийСвойств, ТаблицаОбработчиковСобытий;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	РаботаСФормамиКлиент = глОбщийМодуль("РаботаСФормамиКлиент");
	ОбщиеМодули = Новый Структура;
	ОбщиеМодули.Вставить("РаботаСКоллекциями", РК);
	ОбщиеМодули.Вставить("РаботаСФормамиКлиент", РаботаСФормамиКлиент);
	
	ТаблицаЗначенийСвойств = РК.НоваяКоллекцияЗначений("ИмяЭлемента, ИмяСвойства, ЗначениеСвойства, СписокВыбора, Тип");
	РК.ДобавитьИндексКоллекции(ТаблицаЗначенийСвойств, "ИмяСвойства");
	
	ТаблицаОбработчиковСобытий = РК.НоваяКоллекцияЗначений("ИмяЭлемента, ИмяСобытия, ИмяОбработчика");
	РК.ДобавитьИндексКоллекции(ТаблицаОбработчиковСобытий, "ИмяСобытия");
	
	Переменные = Новый Структура;
	Переменные.Вставить("Элемент", Неопределено);
	Переменные.Вставить("ИсходноеИмяЭлемента", "");
	Переменные.Вставить("ПрежнееИмяЭлемента", "");
	Переменные.Вставить("СведенияОТипахЭлементовФормы");
	Переменные.Вставить("СписокВыбораВидаЭлемента", Новый СписокЗначений);
	Переменные.Вставить("ТаблицаЗначенийСвойств", ТаблицаЗначенийСвойств);
	Переменные.Вставить("ТаблицаОбработчиковСобытий", ТаблицаОбработчиковСобытий);
	Переменные.Вставить("ОбщиеМодули", ОбщиеМодули);

КонецФункции

&НаКлиенте
Процедура ТаблицаЗначенийСвойствПередНачаломИзменения(Элемент, Отказ)
	
	Перем РК;
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;

	СтрокаЗначенияСвойстваНаФорме = Элементы.ТаблицаЗначенийСвойств.ТекущиеДанные;

	СтрокаЗначенияСвойства = РК.НайтиЭлементКоллекции(Переменные.ТаблицаЗначенийСвойств, Новый Структура("ИмяСвойства", СтрокаЗначенияСвойстваНаФорме.ИмяСвойства));

	Если СтрокаЗначенияСвойства.Тип="Картинка" Тогда
		Отказ = Истина;
		ОткрытьДиалогВыбораКартинки(СтрокаЗначенияСвойства, СтрокаЗначенияСвойстваНаФорме);
	Иначе
		Элементы.ТаблицаЗначенийСвойствЗначениеСвойства.РедактированиеТекста = СтрокаЗначенияСвойства.СписокВыбора=Неопределено;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Функция	ОткрытьДиалогВыбораКартинки(СтрокаЗначенияСвойства, СтрокаЗначенияСвойстваНаФорме)

	Перем РаботаСФормамиКлиент;
	
	РаботаСФормамиКлиент = Переменные.ОбщиеМодули.РаботаСФормамиКлиент;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтрокаЗначенияСвойства", СтрокаЗначенияСвойства);
	ДополнительныеПараметры.Вставить("СтрокаЗначенияСвойстваНаФорме", СтрокаЗначенияСвойстваНаФорме);
	
	ОО = Новый ОписаниеОповещения("ОбработчикВыбораЗначенияКартинкиСвойства", ЭтаФорма, ДополнительныеПараметры);
	
	ТекущаяКартинка = СтрокаЗначенияСвойства.ЗначениеСвойства;
	
	РаботаСФормамиКлиент.ОткрытьДиалогВыбораКартинки(ОО, ЭтаФорма, ТекущаяКартинка);
	
КонецФункции

&НаКлиенте
Процедура ОбработчикВыбораЗначенияКартинкиСвойства(Картинка, ДополнительныеПараметры) Экспорт
	
	Если Картинка=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.СтрокаЗначенияСвойства.ЗначениеСвойства = Картинка;
	ДополнительныеПараметры.СтрокаЗначенияСвойстваНаФорме.ЗначениеСвойстваКартинка = Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийСвойствЗначениеСвойстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	СтрокаЗначенияСвойстваНаФорме = Элементы.ТаблицаЗначенийСвойств.ТекущиеДанные;
	
	СтрокаЗначенияСвойства = РК.НайтиЭлементКоллекции(Переменные.ТаблицаЗначенийСвойств, Новый Структура("ИмяСвойства", СтрокаЗначенияСвойстваНаФорме.ИмяСвойства));
	
	Если СтрокаЗначенияСвойстваНаФорме.ИмяСвойства="Вид" Тогда
		СписокВыбораЗначения = Переменные.СписокВыбораВидаЭлемента;
		ОписаниеВидаЭлемента = ПолучитьОписаниеВидаЭлементаПоЗначениюСвойства(СтрокаЗначенияСвойства.ЗначениеСвойства);
		Если СписокВыбораЗначения<>Неопределено Тогда
			ЭлементТекущегоЗначения = СписокВыбораЗначения.НайтиПоЗначению(ОписаниеВидаЭлемента);
		КонецЕсли;
	Иначе
		СписокВыбораЗначения = СтрокаЗначенияСвойства.СписокВыбора;
		Если СписокВыбораЗначения<>Неопределено Тогда
			ЭлементТекущегоЗначения = СписокВыбораЗначения.НайтиПоЗначению(СтрокаЗначенияСвойства.ЗначениеСвойства);
		КонецЕсли;
	КонецЕсли;
	
	Если СписокВыбораЗначения<>Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;

		Если СписокВыбораЗначения.Количество() > 0 Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("СтрокаЗначенияСвойстваНаФорме", СтрокаЗначенияСвойстваНаФорме);
			ДополнительныеПараметры.Вставить("СтрокаЗначенияСвойства", СтрокаЗначенияСвойства);
			ОО = Новый ОписаниеОповещения("ОбработкаВыбораЗначенияСвойстваИзСписка", ЭтаФорма, ДополнительныеПараметры);
			СписокВыбораЗначения.ПоказатьВыборЭлемента(ОО, СтрокаЗначенияСвойстваНаФорме.ПредставлениеСвойства, ЭлементТекущегоЗначения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗначенияСвойстваИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		СтрокаЗначенияСвойства = ДополнительныеПараметры.СтрокаЗначенияСвойства;
		СтрокаЗначенияСвойстваНаФорме = ДополнительныеПараметры.СтрокаЗначенияСвойстваНаФорме;
		
		Если СтрокаЗначенияСвойства.ИмяСвойства="Вид" Тогда
			ОписаниеВидаЭлемента = ВыбранныйЭлемент.Значение;
			СтрокаЗначенияСвойства.ЗначениеСвойства = ОписаниеВидаЭлемента.ЗначениеСвойстваВидЭлемента;
			СтрокаЗначенияСвойстваНаФорме.ЗначениеСвойства = ОписаниеВидаЭлемента.ПредставлениеЗначенияСвойстваВидЭлемента;

			ЭтаФорма.ВидЭлемента = ОписаниеВидаЭлемента.ВидЭлемента;
			ЗаполнитьТаблицуСвойствНаФорме();
			ЗаполнитьТаблицуОбработчиковСобытийНаФорме();
		Иначе
			СтрокаЗначенияСвойства.ЗначениеСвойства = ВыбранныйЭлемент.Значение;
			СтрокаЗначенияСвойстваНаФорме.ЗначениеСвойства = ВыбранныйЭлемент.Представление;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийСвойствЗначениеСвойстваПриИзменении(Элемент)
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	СтрокаЗначенияСвойстваНаФорме = Элементы.ТаблицаЗначенийСвойств.ТекущиеДанные;

	СтрокаЗначенияСвойства = РК.НайтиЭлементКоллекции(Переменные.ТаблицаЗначенийСвойств, Новый Структура("ИмяСвойства", СтрокаЗначенияСвойстваНаФорме.ИмяСвойства));
	СтрокаЗначенияСвойства.ЗначениеСвойства = СтрокаЗначенияСвойстваНаФорме.ЗначениеСвойства;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийСвойствПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбработчиковСобытийИмяОбработчикаПриИзменении(Элемент)

	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	СтрокаОбработчикаСобытияНаФорме = Элементы.ТаблицаОбработчиковСобытий.ТекущиеДанные;

	СтрокаОбработчикаСобытия = РК.НайтиЭлементКоллекции(Переменные.ТаблицаОбработчиковСобытий, Новый Структура("ИмяСобытия", СтрокаОбработчикаСобытияНаФорме.ИмяСобытия));
	СтрокаОбработчикаСобытия.ИмяОбработчика = СтрокаОбработчикаСобытияНаФорме.ИмяОбработчика;

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Результат = ПолучитьРезультат();
	
    Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРезультат()
	
	РК = Переменные.ОбщиеМодули.РаботаСКоллекциями;
	
	РК.ЗаполнитьЗначенияКоллекции(Переменные.ТаблицаЗначенийСвойств, ЭтаФорма.ИмяЭлемента, "ИмяЭлемента");
	РК.ЗаполнитьЗначенияКоллекции(Переменные.ТаблицаОбработчиковСобытий, ЭтаФорма.ИмяЭлемента, "ИмяЭлемента");

	Результат = Новый Структура;
	Результат.Вставить("ИмяЭлемента", ЭтаФорма.ИмяЭлемента);
	Результат.Вставить("ВидЭлемента", ЭтаФорма.ВидЭлемента);
	Результат.Вставить("ТаблицаЗначенийСвойств", Переменные.ТаблицаЗначенийСвойств);
	Результат.Вставить("ТаблицаОбработчиковСобытий", Переменные.ТаблицаОбработчиковСобытий);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ИмяЭлементаПриИзменении(Элемент)
	
	Если ИмяЭлемента=Переменные.ИсходноеИмяЭлемента ИЛИ ВладелецФормы.ПроверитьИмяЭлемента(ИмяЭлемента) Тогда
		Переменные.ПрежнееИмяЭлемента = ИмяЭлемента;
	Иначе
		ОО = Новый ОписаниеОповещения("ОбработчикВернутьПрежнееИмяЭлемента", ЭтаФорма);
		ПоказатьПредупреждение(ОО, "Неверное имя элемента!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВернутьПрежнееИмяЭлемента(ДополнительныеПараметры) Экспорт

	ИмяЭлемента = Переменные.ПрежнееИмяЭлемента;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяЭлементаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
КонецПроцедуры

#Если Клиент Тогда
Инициализация();
#КонецЕсли