
&НаКлиенте
Процедура Команда1(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкаТоварныхПолей");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМакетЭлементов(Команда)
	Макет = ПолучитьМакетЭлементовНаСервере();
	Макет.Показать("Настройки программы");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМакетВыделенныхЭлементов(Команда)
	
	СписокОбъектов = Новый Массив;
	
	Для Каждого СсылкаНаОбъект Из Элементы.Список.ВыделенныеСтроки Цикл
		СписокОбъектов.Добавить(СсылкаНаОбъект);
	КонецЦикла;
	
	Макет = ПолучитьМакетЭлементовНаСервере(СписокОбъектов);
	Макет.Показать("Выбранные настройки программы");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМакетЭлементовНаСервере(СписокОбъектов=Неопределено)
	
	// Возврат Справочники.вмс_НастройкиПрограммы.ПолучитьМакетЭлементов(СписокОбъектов);

	Возврат вмс_ОбновлениеИнформационнойБазы.ПолучитьМакетЭлементов("Справочник.вмс_НастройкиПрограммы", СписокОбъектов);
	
КонецФункции
