
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьДоступностьФормы();
	
	УстановитьЗаголовкиГиперссылок();
	ЗаполнитьИнформациюОМодуле();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПослеВыбораКоманды(Результат, ДопПараметры = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = "ОткрытьРедакторДокументаУчета" Тогда
		ОткрытьРедакторДокументаУчета();
	ИначеЕсли Результат.Значение = "ОткрытьРедакторКодаМаркировки" Тогда
		ОткрытьРедакторКодаМаркировки();
	ИначеЕсли Результат.Значение = "ПросмотретьТаблицуКодовОтчетаВСО" Тогда
		ПросмотретьТаблицуКодовОтчетаВСО();
	ИначеЕсли Результат.Значение = "ОткрытьРедакторОперации" Тогда
		ОткрытьРедакторОперации();
	ИначеЕсли Результат.Значение = "ОткрытьФормуЗагрузкиКодовВМодуль" Тогда
		ОткрытьФормуЗагрузкиКодовВМодуль();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Коды маркировки

&НаКлиенте
Процедура ОткрытьПодменюКодовМаркировки(Команда)
	
	СписокКоманд = СписокКомандКодыМаркировки();
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораКоманды", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика
	, СписокКоманд
	, Элементы["Кнопка_ПодменюКодыМаркировки"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторКодаМаркировки()
	
	МодульКлиента().ОткрытьФормуРедактораКодаМаркировки(, ВладелецФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗагрузкиКодовВМодуль()
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ОбработчикПослеУказанияКодов", ЭтаФорма);
	МодульКлиента().ОткрытьФормуЗагрузкиКодов(ЭтаФорма, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеУказанияКодов(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru='Открыть групповое изменение кодов перед загрузкой?'");
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораДействияСЗагруженнымиКодами", ЭтаФорма, Результат);
	
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика
	, ТекстВопроса
	, РежимДиалогаВопрос.ДаНет
	, НСтр("ru='Контур.Маркировка (Администратор)'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДействияСЗагруженнымиКодами(Результат, ДопПараметры = Неопределено) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		МодульКлиента().ОткрытьФормуГрупповоеИзменениеИнформацииОКодах(ЭтаФорма, ДопПараметры.АдресТаблицыКодов);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ЗагрузитьКодыВМодульНаСервере(ДопПараметры);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Документы учета

&НаКлиенте
Процедура ОткрытьПодменюДокументовУчета(Команда)
	
	СписокКоманд = СписокКомандДокументыУчета();
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораКоманды", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика
	, СписокКоманд
	, Элементы["Кнопка_ПодменюДокументУчета"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторДокументаУчета()
	
	МодульКлиента().ОткрытьФормуРедактораДокументаУчета(, ВладелецФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

// Операции

&НаКлиенте
Процедура ОткрытьПодменюОперации(Команда)
	
	СписокКоманд = СписокКомандОперации();
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораКоманды", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика
	, СписокКоманд
	, Элементы["Кнопка_ПодменюОперации"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторОперации()
	
	МодульКлиента().ОткрытьФормуРедактораОперации(, ВладелецФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

// ВСО

&НаКлиенте
Процедура ОткрытьПодменюВСО(Команда)
	
	СписокКоманд = СписокКомандВСО();
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораКоманды", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика
	, СписокКоманд
	, Элементы["Кнопка_ПодменюВСО"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьТаблицуКодовОтчетаВСО()
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораОтчетаСОборудования", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ОписаниеОбъектаДляВыбора = ОписаниеОбъектаДляВыбора(Тип("ДокументСсылка.КонтурМаркировкаВСО_ОтчетСОборудования"));
	ОписаниеОбъектаДляВыбора.ПараметрыФормы = ПараметрыФормы;
	
	МодульКлиента().ОткрытьФормуВыбораОбъектаИС(ОписаниеОбъектаДляВыбора, ЭтаФорма, ОписаниеОбработчика);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОтчетаСОборудования(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресТаблицы = ПоместитьКодыОтчетаВСОВХранилище(Результат);
	
	МодульКлиента().ОткрытьФормуПросмотраТаблицы(ЭтаФорма, АдресТаблицы, Истина);
	
КонецПроцедуры

// Прочее

&НаКлиенте
Процедура ВыполнитьРегламентныеДействия(Команда)
	
	ВыполнитьРегламентныеДействияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРегламентныеДействияНаСервере()
	
	ВзаимодействиеКонтурМаркировка.ВыполнитьРегламентныеДействия(Новый Структура());
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКодыВМодульНаСервере(Результат)
	
	ЗагружатьПолныеКоды = Результат.ЗагружатьПолныеКоды;
	ТаблицаКодов = ПолучитьИзВременногоХранилища(Результат.АдресТаблицыКодов);
	
	Если Не ЗначениеЗаполнено(ТаблицаКодов) Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	МодульОбъекта().ТаблицаКодов_ЗаписатьВсюИнформацию(ТаблицаКодов);
	Если ЗагружатьПолныеКоды Тогда
		МодульОбъекта().ПолныеКоды_Записать(ТаблицаКодов);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокОтложенныхФункцийНажатие(Элемент)
	
	СписокФункций = СписокОтложенныхФункций();
	ПослеИзменения = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеИзмененияСпискаОтложенныхФункций", ЭтаФорма);
	
	МодульКлиента().ОткрытьФормуПросмотраСтруктуры(ЭтаФорма
	, СписокФункций.ДатыВключения
	, Элемент.Заголовок
	, Истина
	, ПослеИзменения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияСпискаОтложенныхФункций(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьСписокОтложенныхФункций(Результат);
	
	МодульКлиента().СброситьКэш();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВременныхФункцийНажатие(Элемент)
	
	СписокФункций = СписокВременныхФункций();
	ПослеИзменения = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеИзмененияСпискаВременныхФункций", ЭтаФорма);
	
	МодульКлиента().ОткрытьФормуПросмотраСтруктуры(ЭтаФорма
	, СписокФункций.ДатыОтключения
	, Элемент.Заголовок
	, Истина
	, ПослеИзменения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияСпискаВременныхФункций(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьСписокВременныхФункций(Результат);
	
	МодульКлиента().СброситьКэш();
	
КонецПроцедуры

&НаКлиенте
Процедура ТарифыОрганизацийНажатие(Элемент)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ОткрытьТарифПослеВыбораОрганизации", ЭтаФорма);
	МодульКлиента().ОткрытьФормуВыбораОрганизации(ОписаниеОбработчика, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТарифПослеВыбораОрганизации(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуРедактораТарифа(ЭтаФорма, Результат);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СписокКомандКодыМаркировки()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ОткрытьРедакторКодаМаркировки"
	, "Редактор кода маркировки"
	, , БиблиотекаКартинок.КонтурМаркировка_Датаматрикс);
	Результат.Добавить("ОткрытьФормуЗагрузкиКодовВМодуль"
	, "Загрузить коды в модуль"
	, , БиблиотекаКартинок.Изменить);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокКомандДокументыУчета()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ОткрытьРедакторДокументаУчета"
	, "Редактор документа учета"
	, , БиблиотекаКартинок.КонтурМаркировка_СвязанныеДокументы);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокКомандОперации()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ОткрытьРедакторОперации"
	, "Редактор операции"
	, , БиблиотекаКартинок.КонтурМаркировка_СвязанныеДокументы);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокКомандВСО()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ПросмотретьТаблицуКодовОтчетаВСО"
	, "Таблица кодов отчета"
	, , БиблиотекаКартинок.Документ);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОписаниеОбъектаДляВыбора(ТипОбъекта)
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипОбъекта);
	
	Результат = МодульОбъекта().НовоеОписаниеВидаДокументаДляВыбора();
	
	Если ОбъектМетаданных <> Неопределено Тогда
		Результат.Представление = ОбъектМетаданных.Синоним;
		Результат.ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НастроитьДоступностьФормы()
	
	Элементы.Кнопка_ПодменюВСО.Доступность = МодульОбъекта().ЕстьПодсистемаВСО();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиГиперссылок()
	
	Шаблон = НСтр("ru='Список временных функций v.%1'");
	Элементы.СписокВременныхФункций.Заголовок = МодульОбъекта().ПараметрыВСтроку(Шаблон, СписокВременныхФункций().ВерсияСписка);
	
	Шаблон = НСтр("ru='Список отложенных функций v.%1'");
	Элементы.СписокОтложенныхФункций.Заголовок = МодульОбъекта().ПараметрыВСтроку(Шаблон, СписокОтложенныхФункций().ВерсияСписка);
	
КонецПроцедуры

&НаСервере
Функция СписокОтложенныхФункций()
	
	Возврат МодульОбъекта().СписокОтложенныхФункций();
	
КонецФункции

&НаСервере
Функция СписокВременныхФункций()
	
	Возврат МодульОбъекта().СписокВременныхФункций();
	
КонецФункции

&НаСервере
Процедура ЗаписатьСписокОтложенныхФункций(ДатыВключения)
	
	СписокФункций = СписокОтложенныхФункций();
	СписокФункций.ДатыВключения = ДатыВключения;
	
	МодульОбъекта().СписокОтложенныхФункций_Записать(СписокФункций);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСписокВременныхФункций(ДатыОтключения)
	
	СписокФункций = СписокВременныхФункций();
	СписокФункций.ДатыОтключения = ДатыОтключения;
	
	МодульОбъекта().СписокВременныхФункций_Записать(СписокФункций);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОМодуле()
	
	ДанныеДляТехподдержки = МодульОбъекта().ИнформацияДляТехПоддержки();
	
	ИнформацияОМодуле = ДанныеДляТехподдержки.ИнформацияОМодуле;
	ИнформацияОНастройках = ДанныеДляТехподдержки.ИнформацияОНастройкахМодуля;
	
	ВерсияМодуля = ИнформацияОМодуле.ВерсияМодуля;
	ВерсияКонтроля = ИнформацияОМодуле.ВерсияБиблиотекиКонтроля;
	ПМ = ИнформацияОНастройках.ПодключаемыйМодуль;
	РИБ = Формат(ЗначениеЗаполнено(ПланыОбмена.ГлавныйУзел()), "БЛ='Не используется (либо центральный узел)'; БИ=Используется");
	
	Если ПМ = "Подключен" Тогда
		ПМ = МодульОбъекта().ВерсияОбработкиПМ();
	КонецЕсли;
	
	Шаблон = НСтр(
	"ru='Версия модуля: %1
	|Библиотека контроля: %2
	|Подключаемый модуль: %3
	|РИБ: %4'");
	
	ТекстИнформацияОМодуле = МодульОбъекта().ПараметрыВСтроку(Шаблон, ВерсияМодуля, ВерсияКонтроля, ПМ, РИБ);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьКодыОтчетаВСОВХранилище(ОтчетСОборудования)
	
	ДанныеДляХранилища = Документы.КонтурМаркировкаВСО_ОтчетСОборудования.ПрочитатьДанныеИзХранилища(ОтчетСОборудования.ДанныеОтчета);
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеДляХранилища, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

// #КонецОбласти