Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

Функция ОткрытьФормуДополнительныхРеквизитовОбъекта(Объект, ФормаОбъекта=Неопределено) Экспорт
	
	ФормаДополнительныхРеквизитов = ПолучитьФормуДополнительныхРеквизитовОбъекта(Объект, ФормаОбъекта);
	ФормаДополнительныхРеквизитов.Открыть();
	Возврат ФормаДополнительныхРеквизитов;
	
КонецФункции

Функция ПодключаемаяКоманда_ОткрытьФормуДополнительныхРеквизитовОбъекта(Результат, Контекст) Экспорт
	
	ОткрытьФормуДополнительныхРеквизитовОбъекта(Контекст.Форма.Объект, Контекст.Форма);
	
КонецФункции

Функция ПолучитьФормуДополнительныхРеквизитовОбъекта(Объект, ФормаОбъекта=Неопределено)
	
	Перем УправлениеСвойствамиВызовСервера;
	
	УправлениеСвойствамиВызовСервера = глОбщийМодуль("УправлениеСвойствамиВызовСервера");
	
	ВладелецСвойств = Объект.Ссылка;
	
	СсылкаНаНаборДополнительныхРеквизитов = УправлениеСвойствамиВызовСервера.НайтиНаборДополнительныхРеквизитовПоВладельцу(ВладелецСвойств, Ложь);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", СсылкаНаНаборДополнительныхРеквизитов);
	ФормаДополнительныхРеквизитов = ПолучитьФорму("Справочник.вмс_НаборыДополнительныхРеквизитов.Форма.ФормаЭлемента", ПараметрыФормы, ФормаОбъекта);
	
	Если Не ЗначениеЗаполнено(СсылкаНаНаборДополнительныхРеквизитов) Тогда
		ДанныеФормы = ФормаДополнительныхРеквизитов.Объект;
		
		УправлениеСвойствамиВызовСервера.ПолучитьДанныеФормыДополнительныхРеквизитовОбъекта(ДанныеФормы, ВладелецСвойств);
		
		КопироватьДанныеФормы(ДанныеФормы, ФормаДополнительныхРеквизитов.Объект);
	КонецЕсли;
	
	Возврат ФормаДополнительныхРеквизитов;
	
КонецФункции

Функция ПриЗакрытии(Форма, ЗавершениеРаботы=Ложь) Экспорт

	Перем УправлениеСвойствамиКлиентСервер;
	
	УправлениеСвойствамиКлиентСервер = глОбщийМодуль("УправлениеСвойствамиКлиентСервер");
	
	Если Не УправлениеСвойствамиКлиентСервер.ДополнительныеРеквизитыИнициализированы(Форма) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Форма.ИнформацияОДополнительныхРеквизитов = Неопределено;
	Форма.ТаблицаДополнительныхРеквизитов.Очистить();
	Возврат Истина;
	
КонецФункции
Функция ПриОткрытии(Форма, Отказ=Ложь) Экспорт
	
	ДобавитьПодключаемыеКоманды(Форма);
	
КонецФункции

Функция ДобавитьПодключаемыеКоманды(Форма)
	
	Перем ПодключаемыеКомандыКлиентСервер, УправлениеСвойствамиВызовСервера, ПодключаемыеКомандыКлиент, РаботаСКоллекциями, ОбщегоНазначенияКлиентСервер;
	
	ПодключаемыеКомандыКлиентСервер = глОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	УправлениеСвойствамиВызовСервера = глОбщийМодуль("УправлениеСвойствамиВызовСервера");
	ПодключаемыеКомандыКлиент = глОбщийМодуль("ПодключаемыеКомандыКлиент");
	РаботаСКоллекциями = глОбщийМодуль("РаботаСКоллекциями");
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	ОписанияКоманд = Новый Массив;

	Команды = ПодключаемыеКомандыКлиентСервер.ТаблицаКоманд();

	Если УправлениеСвойствамиВызовСервера.ИспользоватьДополнительныеРеквизитыОбъекта(Форма.Объект.Ссылка) Тогда
		
		ИмяМодуляУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиентСервер.ПолучитьФактическоеИмяОбщегоМодуля("УправлениеСвойствамиКлиент");
		
		Команда = РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(Команды);
		Команда.ИмяВФорме = "ИзменитьСоставДополнительныхРеквизитов";
		Команда.Представление = "Изменить состав дополнительных реквизитов";
		Команда.ПоложениеКнопкиВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
		Команда.Обработчик = ИмяМодуляУправлениеСвойствамиКлиент + ".ПодключаемаяКоманда_ОткрытьФормуДополнительныхРеквизитовОбъекта";
	КонецЕсли;

	ПодключаемыеКомандыКлиент.ВывестиКоманды(Форма, Команды);
	
КонецФункции
