#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	ЗаполнитьУпаковкуПриЗаписи();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьУпаковкуПриЗаписи()
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.Номенклатура) И ЗначениеЗаполнено(Запись.Упаковка) Тогда
			Количество = вмс_АдаптацияКонфигураций.КоэффициентУпаковки(Запись.Упаковка, Запись.Номенклатура);
			Если Не ЗначениеЗаполнено(Запись.Количество) Или Запись.Количество <> Количество Тогда
				Запись.Количество = Количество;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

