
#Область ДОКУМЕНТЫ





Функция ИмяТабличнойЧастиПоУмолчанию() Экспорт
	
	Возврат вмс_РаботаСКоллекциями.СтрокуВМассив("Товары");
	
КонецФункции  

Функция ИмяТабличнойЧастиПроизводство() Экспорт
	
	Возврат "Продукция";
	
КонецФункции 

Функция ИмяБазовогоДокумента() Экспорт
	
	Возврат "Документ.РеализацияТоваровУслуг";
		
КонецФункции

Функция ИмяПриходногоДокумента() Экспорт
	
	Возврат "ПоступлениеТоваровУслуг";
		
КонецФункции



#КонецОбласти

#Область СПРАВОЧНИКИ

Функция ИспользуютсяХарактеристики() Экспорт
	Возврат Константы.ИспользоватьХарактеристикиНоменклатуры.Получить();
КонецФункции

Функция ИспользуютсяСерии() Экспорт
	Возврат Константы.ИспользоватьСерииНоменклатуры.Получить();
КонецФункции

Функция ИмяСправочникаСерии() Экспорт
	Возврат "Справочник.СерииНоменклатуры";
КонецФункции

Функция ИмяКолонкиХарактеристика() Экспорт
	
	Возврат "ХарактеристикаНоменклатуры";
		
КонецФункции 

Функция ИмяКолонкиФизЛицо() Экспорт
	
	Возврат "ФизЛицо";
		
КонецФункции 

Функция ИмяКолонкиФайлКартинки() Экспорт
	
	Возврат "ОсновноеИзображение";
		
КонецФункции 

Функция ИмяСправочникаНоменклатураПрисоединенныеФайлы() Экспорт
	
	Возврат "ХранилищеДополнительнойИнформации";
		
КонецФункции

Функция ПустаяХарактеристика() Экспорт
	Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
КонецФункции


#КонецОбласти

#Область СКЛАДЫ


Функция ИмяСправочникаСклады() Экспорт
	
	Возврат "Склады";
		
КонецФункции 

Функция ИмяСкладаЗапрос() Экспорт
	
	Возврат вмс_РаботаСКоллекциями.СтрокуВМассив("Склад");
		
КонецФункции

Функция ТипОптовогоСклада() Экспорт
	
	//@skip-check wrong-string-literal-content
	Возврат ПредопределенноеЗначение("Перечисление.ВидыСкладов.Оптовый");
	
КонецФункции

Функция ИмяПараметраТипСклада() Экспорт
	
	Возврат "ВидСклада";
		
КонецФункции

Функция ПустойСклад() Экспорт
	
	Возврат Справочники.Склады.ПустаяСсылка();
		
КонецФункции


#КонецОбласти

#Область УПАКОВКИ



Функция ИмяСправочникаУпаковки() Экспорт
	Возврат "Справочник.ЕдиницыИзмерения";		
КонецФункции

Функция ИмяТипаСправочникаУпаковки() Экспорт
	Возврат "СправочникСсылка.ЕдиницыИзмерения";		
КонецФункции

Функция КоэффициентУпаковки(Упаковка, Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УпаковкиСправочник.Коэффициент КАК Коэффициент                
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК УпаковкиСправочник
	|ГДЕ
	|	УпаковкиСправочник.Ссылка = &Упаковка И УпаковкиСправочник.Коэффициент <> 0";

	Запрос.УстановитьПараметр("Упаковка", Упаковка);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 1;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Коэффициент;

КонецФункции

Функция ПустаяУпаковка() Экспорт
	Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
КонецФункции

Функция ТекстЗапросаОбъемНоменклатуры(ИсточникУпаковки = "", ИсточникНоменклатуры = "") Экспорт
	Возврат "" + ИсточникНоменклатуры + ".ЕдиницаХраненияОстатков.Объем";
КонецФункции

Функция ТекстЗапросаВесНоменклатуры(ИсточникУпаковки = "", ИсточникНоменклатуры = "") Экспорт
	Возврат "" + ИсточникНоменклатуры + ".ЕдиницаХраненияОстатков.Вес";
КонецФункции

Функция ИмяКолонкиЕдиницыИзмерения() Экспорт
	
	Возврат "Упаковка";
		
КонецФункции 

Функция ИмяРеквизитаНоменклатурыЕдиницаИзмерения() Экспорт
	
	Возврат "ЕдиницаИзмерения";
		
КонецФункции

Функция ПолучитьЕдиницыИзмеренияТоваров(Строки) Экспорт    
	
	Возврат Неопределено;
		
КонецФункции

Функция ПолучитьУпаковкиТоваров(Товары) Экспорт
	
	//Кулалаев 
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|	ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	ЕдиницыИзмерения.Ссылка КАК Упаковка,
	|	ЕдиницыИзмерения.Коэффициент КАК Коэффициент,
	|	ЕдиницыИзмерения.Коэффициент = 1 КАК ЭтоБаза
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Номенклатура.Ссылка = ЕдиницыИзмерения.Владелец
	|			ИЛИ Номенклатура.НоменклатурнаяГруппа = ЕдиницыИзмерения.Владелец
	|ГДЕ
	|	Номенклатура.Ссылка В (&Товары)
	|";
	
	
	// Установка параметров.
	Запрос.УстановитьПараметр("Товары", Товары);
	Возврат Запрос.Выполнить().Выгрузить();    
	
КонецФункции

Функция СоздатьИПолучитьУпаковкуТовара(Товар, Коэффициент) Экспорт    
	
	Возврат Истина;
		
КонецФункции 

Функция ВесОбъемБазовойУпаковки(Товар) Экспорт
	
	Возврат Новый Структура("Вес, Объем", 0,0);
		
КонецФункции


#КонецОбласти

#Область ПАРАМЕТРЫ_УЧЕТА


Функция ПолучитьИспользованиеХарактеристикТоваровИПолучитьВладельцаДляВыбора(ВходящиеДанные) Экспорт
	
	Возврат ВходящиеДанные.Товар.ВестиУчетПоХарактеристикам;
		
КонецФункции

Функция ОпределитьМаркируемыеТовары(Товары) Экспорт
	
	//3.2.5
	ВызватьИсключение "Адаптация: Определение маркируемых товаров не поддерживается в текущей конфигурации";

	//Запрос = Новый Запрос;
	//
	//Запрос.Текст = "
	//|ВЫБРАТЬ
	//|	Номенклатура.Ссылка КАК Ссылка,
	//|	Номенклатура.ВидПродукцииИС КАК ВидПродукцииИС
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|ГДЕ
	//|	Номенклатура.ВидПродукцииИС <> &ВидПродукцииИС
	//|	И Номенклатура.Ссылка В(&Товары)";  
	//
	//Запрос.УстановитьПараметр("Товары", Товары);
	//Запрос.УстановитьПараметр("ВидПродукцииИС", Перечисления.ВидыПродукцииИС.ПустаяСсылка());
	//РезультатЗапроса = Запрос.Выполнить();
	//МаркируемыеТовары = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	//
	//Возврат МаркируемыеТовары;
	
КонецФункции

Функция ПолучитьВидыТоваров(Товары) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	Номенклатура.ВидНоменклатуры КАК ВидТовара
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&Товары)";
	Запрос.УстановитьПараметр("Товары", Товары);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаВидыНоменклатуры = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаВидыНоменклатуры;
	
КонецФункции

Функция ПолучитьДинамическиеПараметрыНоменклатуры(ПараметрыОтбора) Экспорт
	
	// ТУ_Мовчан 06.06.23 ++
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Номенклатура КАК Товар,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Назначение КАК Партия,
	|	Таблица.Серия КАК Серия,
	|	НЕОПРЕДЕЛЕНО КАК УчетныйПараметр1,
	|	НЕОПРЕДЕЛЕНО КАК УчетныйПараметр2
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаНоменклатуры КАК Таблица
	|ГДЕ
	|	Таблица.Номенклатура = &Товар
	| 	И &ДопОтбор 
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика,
	|	Таблица.Назначение,
	|	Таблица.Серия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Таблица.Назначение УБЫВ";
	
	ДопОтбор = "";
	
	Для каждого Строка Из ПараметрыОтбора Цикл	
		Если Строка.Ключ <> "Товар" Тогда
			ДопОтбор = ДопОтбор + "
			|	И Таблица." + Строка.Ключ + " = &" + Строка.Ключ;
		КонецЕсли;
		
		Запрос.УстановитьПараметр(Строка.Ключ, Строка.Значение);
	КонецЦикла;     
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ДопОтбор", ДопОтбор);  
	// ТУ_Мовчан 06.06.23 --
	ТаблицаВозможных = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаВозможных;
	
КонецФункции

Функция ПолучитьСтатическиеПараметрыНоменклатуры() Экспорт

	ТаблицаВозможных = Новый ТаблицаЗначений;
	ТаблицаВозможных.Колонки.Добавить("Качество");
	
	ИндексКачествоТовара = 0;
	Пока ИндексКачествоТовара < Перечисления.вмс_КачествоТовара.Количество() Цикл
		Строка = ТаблицаВозможных.Добавить();
		Строка.Качество = Перечисления.вмс_КачествоТовара.Получить(ИндексКачествоТовара);
		ИндексКачествоТовара = ИндексКачествоТовара + 1;
	КонецЦикла;
	
	Возврат ТаблицаВозможных;


КонецФункции

// ТУ_Самойленко 30.03.23 ++
Функция ПолучитьТипыДанныхКонфигурации(ТипыДанных) Экспорт

	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Партия", "Справочник.Назначения");
	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Характеристика", "Справочник.ХарактеристикиНоменклатуры");
	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Серия", "Справочник.СерииНоменклатуры");
	
КонецФункции
// ТУ_Самойленко 30.03.23 --  

// ТУ_Прошин_04.07.23++
Функция ПолучитьСписокТоваровПоВводуСтроки(Текст) Экспорт       
		Запрос = Новый Структура("Текст, Параметры");
		ЗапросТекст =
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	Номенклатура.Ссылка КАК Товар,
		|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	Неопределено КАК ПредставлениеТовара
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО (Номенклатура.ВидНоменклатуры = ХарактеристикиНоменклатуры.Владелец
		|				ИЛИ Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец)
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ";
		
		МассивПоиска = СтрРазделить(Текст, " ");
		Для каждого ЧастьСтроки Из МассивПоиска Цикл
			ЗапросТекст = ЗапросТекст + 
			"  И СТРНАЙТИ(Номенклатура.Ссылка.Код +"" ""+Номенклатура.Ссылка.Артикул +"" ""+Номенклатура.Ссылка.Наименование +"" ""+ ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка.Наименование, """"), """+ЧастьСтроки+""") >= 1"; 
		КонецЦикла;
		
		Запрос.Текст = ЗапросТекст;
		Запрос.Параметры = Новый Структура("",);
		Возврат Запрос;
КонецФункции
// ТУ_Прошин_04.07.23--

// ТУ_Самойленко 04.07.23 ++ [Блокировка ячеек]
Функция ПолучитьВладельцаЯчейки(ИзначальныйВладелец) Экспорт
	
	Возврат ИзначальныйВладелец;
	
КонецФункции
// ТУ_Самойленко 04.07.23 ++ [Блокировка ячеек]

Функция ПолучитьКлючиАналитикиНоменклатуры() Экспорт  
	
	// Допустимо переопределять запрос для фильтра по нужной номенклатуре
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ПометкаУдаления = ЛОЖЬ
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Товар КАК Товар,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|	СерииНоменклатуры.Ссылка КАК Серия
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ_Товары.Товар = ХарактеристикиНоменклатуры.Владелец
	|			И (ХарактеристикиНоменклатуры.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ВТ_Товары.Товар = СерииНоменклатуры.Владелец
	|			И (СерииНоменклатуры.ПометкаУдаления = ЛОЖЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ХарактеристикиНоменклатуры.Ссылка,
	|	СерииНоменклатуры.Ссылка,
	|	ВТ_Товары.Товар";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
		
КонецФункции

// ТУ_Кошелев 17.08.2023++
Функция ПривязатьФотографиюКНоменклатуре(Номенклатура, ХранилищеФайла) Экспорт
	ДвоичныеДанные = ХранилищеФайла.Получить();
	ВыбранноеИзображение = Новый Картинка(ДвоичныеДанные);
	
	Изображение = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
	Изображение.Заполнить(Неопределено);
	Изображение.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
	Изображение.Хранилище = Новый ХранилищеЗначения(ВыбранноеИзображение, Новый СжатиеДанных(0));
	Изображение.Объект = Номенклатура;
	Изображение.ИмяФайла = Номенклатура.Наименование;
	Изображение.Записать();
	
	НачатьТранзакцию();
	Попытка
		обНоменклатура = Номенклатура.ПолучитьОбъект();
		обНоменклатура.ОсновноеИзображение = Изображение.Ссылка; 
		обНоменклатура.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;
КонецФункции	
// ТУ_Кошелев 17.08.2023--

Функция ПолучитьИменаРаспоряжений() Экспорт
	Результат = Новый Структура;  
	Возврат Результат;
КонецФункции

//@skip-check module-unused-method
Функция ПолучитьСоответствияИменСправочников() Экспорт 
	Возврат Новый Структура;
КонецФункции   

Функция ПолучитьДокументыСНесколькимиТЧ() Экспорт
	Результат = Новый Соответствие;
	Возврат Результат;
КонецФункции


#КонецОбласти

#Область ПЕЧАТЬ_ЭТИКЕТКИ

Функция ПечатьЭтикеткиТовара(МассивТоваров) Экспорт
	
	Возврат Неопределено;
		
КонецФункции


#КонецОбласти

Функция ИмяРеквизитаНоменклатурыВид() Экспорт
	
	Возврат "ВидНоменклатуры";
	
КонецФункции

Функция ПолучитьИмяТипаНоменклатурыТовар() Экспорт
	Возврат "Товар";
КонецФункции