// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы 

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Организация", Организация) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	УстановитьЗаголовок();
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыСервисы

&НаКлиенте
Процедура НастройкаСервисовДоступенПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сервисы.ТекущиеДанные;
	ОбновитьДоступностьСервиса(ТекущиеДанные.Сервис, ТекущиеДанные.Доступен);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьСервиса(Сервис, Доступен)
	
	ОтборСервиса = Новый Структура("Сервис", Сервис);
	
	Для Каждого Стр Из Сервисы.НайтиСтроки(ОтборСервиса) Цикл
		Стр.Доступен = Доступен;
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Модифицированность Тогда
		
		ЗаписатьНаСервере();
		МодульКлиента().СброситьКэш();
		
		Модифицированность = Ложь;
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНаСервере()

	Отбор = Новый Структура("Доступен", Истина);
	СервисыОрганизации = Сервисы.Выгрузить(Отбор).ВыгрузитьКолонку("Сервис");
	МодульОбъекта().СвернутьМассивЛок(СервисыОрганизации);
	
	ОписаниеТарифа =  МодульОбъекта().Тариф(Организация);
	ЗаполнитьЗначенияСвойств(ОписаниеТарифа, ЭтаФорма,, "Сервисы");
	ОписаниеТарифа.Сервисы = СервисыОрганизации;
	
	МодульОбъекта().Тариф_Записать(ОписаниеТарифа);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
	Заголовок = МодульОбъекта().ПараметрыВСтроку(НСтр("ru='Редактор тарифа организации: %1'"), Организация);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	ОписаниеТарифа =  МодульОбъекта().Тариф(Организация);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеТарифа,, "Сервисы");
	
	Для Каждого КлючЗначение Из МодульОбъекта().СервисыПодписокПоТипамОпераций() Цикл
		
		Стр = Сервисы.Добавить();
		Стр.ТипОперации = КлючЗначение.Ключ;
		Стр.Сервис = КлючЗначение.Значение;
		
		Стр.Доступен = ОписаниеТарифа.Сервисы.Найти(КлючЗначение.Значение) <> Неопределено;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Сервисы.Сортировать("Сервис Убыв");
	
КонецПроцедуры

// #КонецОбласти