
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполнитьОперацииПриВводеЛицензий(Запись.Подсистема);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОперацииПриВводеЛицензий(Подсистема)
	
	//ТУ_Алфимов 21.01.26 ++
	//Выборка = Справочники.вмс_Операции.Выбрать();
	//Выборка.ПолучитьОбъект().Удалить();
	//ТУ_Алфимов 21.01.26 --
	
	Если Подсистема = "вмс_ЛицензияСклад" Тогда
		Справочники.вмс_Операции.ЗагрузитьЭлементыИзМакета(ПолучитьОбщийМакет("ПредопределенныеЭлементыОперацииТСД"), "1.0.0");
	КонецЕсли;
	
	Если Подсистема = "вмс_ЛицензияМагазин" Тогда
		Справочники.вмс_Операции.ЗагрузитьЭлементыИзМакета(ПолучитьОбщийМакет("ПредопределенныеЭлементыОперацииТСД_Лайт"), "1.0.0");
	КонецЕсли;
	
КонецПроцедуры

