Функция ОбновитьОтображениеТаблицыДанных(Форма, ОписаниеФормы, ТаблицаДанных) Экспорт
	
	Перем РК;
	
	РК = вмс_РаботаСКоллекциями;
	
	Для Каждого СтрокаДанных Из РК.ПолучитьЭлементыКоллекции(ТаблицаДанных) Цикл
		
		ОбновитьОтображениеДанных(Форма, ОписаниеФормы, СтрокаДанных);
		
	КонецЦикла;

КонецФункции

Функция ОбновитьОтображениеДанных(Форма, ОписаниеФормы, Данные) Экспорт
	
	ШаблоныДанных = ОписаниеФормы.ШаблоныДанных[Данные];
	
	Если ШаблоныДанных=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ШаблонДанных Из ШаблоныДанных Цикл
		ЗаполнитьДанныеШаблона(Форма, ШаблонДанных, Данные);
	КонецЦикла;
	
КонецФункции

Функция ЗаполнитьДанныеШаблона(Форма, Шаблон, Данные) Экспорт

	ПустоеЗначение = Шаблон.ПустоеЗначение;
	ПредставлениеПустогоЗначения = Шаблон.ПредставлениеПустогоЗначения;
	
	ЗначенияПолейШаблона = Шаблон.ЗначенияПолей;
	ЗаполнитьЗначенияСвойств(ЗначенияПолейШаблона, Шаблон.ЗначенияПолейПоУмолчанию);
	ЗаполнитьЗначенияСвойств(ЗначенияПолейШаблона, Данные);
	Для Каждого РеквизитШаблона Из Шаблон.Реквизиты Цикл
		МассивДанныхПолей = Новый Массив;
		Для Каждого ПолеРеквизита Из РеквизитШаблона.Поля Цикл
			СвойстваПоля = ПолеРеквизита.Свойства;
			Если ПолеРеквизита.ТипПоля = 0 Тогда
				СодержимоеПоля = ПолеРеквизита.Значение;
			Иначе
				ИмяПоля = ПолеРеквизита.Значение;
				СодержимоеПоля = ЗначенияПолейШаблона[ИмяПоля];
				Если СодержимоеПоля = ПустоеЗначение Тогда
					СодержимоеПоля = ПредставлениеПустогоЗначения;
				ИначеЕсли Не ЗначениеЗаполнено(СодержимоеПоля) Тогда
					СодержимоеПоля = "";
				ИначеЕсли ТипЗнч(СодержимоеПоля) <> Тип("Строка") Тогда
					СодержимоеПоля = Строка(СодержимоеПоля);
				КонецЕсли;
			КонецЕсли;
			МассивДанныхПолей.Добавить(Новый ФорматированнаяСтрока(СодержимоеПоля, , СвойстваПоля.ЦветТекста, СвойстваПоля.ЦветФона, ));
		КонецЦикла;
		Форма[РеквизитШаблона.ПутьКДанным] = Новый ФорматированнаяСтрока(МассивДанныхПолей);
	КонецЦикла;
	
КонецФункции

Функция СкопироватьШаблонОписанияФормы(ОписаниеФормы, Шаблон, знач ИмяНовогоШаблона=Неопределено) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	НовыйШаблон = НовыйШаблонОписанияФормы(ОписаниеФормы);
	Если ИмяНовогоШаблона = Неопределено Тогда
		ИмяНовогоШаблона = Шаблон.Имя;
	КонецЕсли;
	НовыйШаблон.Имя = ИмяНовогоШаблона;
	ЗаполнитьЗначенияСвойств(НовыйШаблон, Шаблон, "ИмяЭлементаФормы");
	НовыйШаблон.ЗначенияПолей = РК.СкопироватьОбъект(Шаблон.ЗначенияПолей);
	Для Каждого ЗначениеПоля Из НовыйШаблон.ЗначенияПолей Цикл
		НовыйШаблон.ЗначенияПолейПоУмолчанию.Вставить(ЗначениеПоля.Ключ, НовыйШаблон.ПустоеЗначение);
	КонецЦикла;
	
	СоответствиеЭлементов = Новый Соответствие;
	СоответствиеЭлементов[Шаблон] = НовыйШаблон;
	
	Для Каждого ЭлементШаблона Из Шаблон.Элементы Цикл
		РодительНовогоЭлемента = СоответствиеЭлементов[ЭлементШаблона.Родитель];
		НовыйЭлементШаблона = НовыйЭлементОписанияФормы(ОписаниеФормы, НовыйШаблон, РодительНовогоЭлемента);
		ЗаполнитьЗначенияСвойств(НовыйЭлементШаблона, ЭлементШаблона, "ИмяЭлемента, ТипЭлемента");
		Для Каждого СвойствоЭлемента Из ЭлементШаблона.Свойства Цикл
			НовыйЭлементШаблона.Свойства.Вставить(СвойствоЭлемента.Ключ, СвойствоЭлемента.Значение);
		КонецЦикла;
		
		РеквизитОписанияФормы = ЭлементШаблона.Реквизит;
		Если РеквизитОписанияФормы <> Неопределено Тогда
			НовыйРеквизитОписанияФормы = НовыйРеквизитОписанияФормы(ОписаниеФормы, НовыйШаблон, НовыйЭлементШаблона);
			ЗаполнитьЗначенияСвойств(НовыйРеквизитОписанияФормы, РеквизитОписанияФормы, "Тип");
			Для Каждого ПолеЭлемента Из РеквизитОписанияФормы.Поля Цикл
				НовоеПолеЭлемента = НовоеПолеРеквизитаОписанияФормы(НовыйРеквизитОписанияФормы);
				ЗаполнитьЗначенияСвойств(НовоеПолеЭлемента, ПолеЭлемента, "ТипПоля, Значение");
				Для Каждого СвойствоПоля Из ПолеЭлемента.Свойства Цикл
					НовоеПолеЭлемента.Свойства.Вставить(СвойствоПоля.Ключ, СвойствоПоля.Значение);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		СоответствиеЭлементов[ЭлементШаблона] = НовыйЭлементШаблона;
	КонецЦикла;
	
	Возврат НовыйШаблон;
	
КонецФункции

Функция ВывестиТаблицуДанных(ОписаниеФормы, ТаблицаДанных, ШаблонСтроки, ИмяГруппыФормы) Экспорт
	
	Перем РК;
	
	РК = вмс_РаботаСКоллекциями;
	
	Для Каждого СтрокаДанных Из РК.ПолучитьЭлементыКоллекции(ТаблицаДанных) Цикл
		НовыйШаблонСтроки = СкопироватьШаблонОписанияФормы(ОписаниеФормы, ШаблонСтроки);
		НовыйШаблонСтроки.ИмяЭлементаФормы = ИмяГруппыФормы;
		СвязатьДанныеСШаблоном(ОписаниеФормы, СтрокаДанных, НовыйШаблонСтроки)
	КонецЦикла;
	
КонецФункции

Функция СвязатьДанныеСШаблоном(ОписаниеФормы, Данные, Шаблон)
	
	ШаблоныДанных = ОписаниеФормы.ШаблоныДанных[Данные];
	
	Если ШаблоныДанных = Неопределено Тогда
		ШаблоныДанных = Новый Массив;
		ШаблоныДанных.Добавить(Шаблон);
		ОписаниеФормы.ШаблоныДанных[Данные] = ШаблоныДанных;
	Иначе
		Если ШаблоныДанных.Найти(Шаблон) = Неопределено Тогда
			ШаблоныДанных.Добавить(Шаблон);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция НовоеОписаниеФормыЗадания() Экспорт
	
	ОписаниеФормы = Новый Структура;
	ОписаниеФормы.Вставить("Шаблоны", Новый Массив);
	ОписаниеФормы.Вставить("Элементы", Новый Массив);
	ОписаниеФормы.Вставить("Реквизиты", Новый Массив);
	ОписаниеФормы.Вставить("ИдентификаторНовогоЭлемента", 1);
	ОписаниеФормы.Вставить("ИдентификаторНовогоРеквизита", 1);
	ОписаниеФормы.Вставить("ИдентификаторыЭлементов", Новый Соответствие);
	ОписаниеФормы.Вставить("ИдентификаторыРеквизитов", Новый Соответствие);
	ОписаниеФормы.Вставить("ШаблоныДанных", Новый Соответствие);
	
	Возврат ОписаниеФормы;
	
КонецФункции

Функция НовыйШаблонОписанияФормы(ОписаниеФормы) Экспорт
	
	Шаблон = Новый Структура;
	Шаблон.Вставить("Имя", "");
	Шаблон.Вставить("ЗначенияПолей", Новый Структура);
	Шаблон.Вставить("ЗначенияПолейПоУмолчанию", Новый Структура);
	Шаблон.Вставить("ПодчиненныеЭлементы", Новый Массив);
	Шаблон.Вставить("ИмяЭлементаФормы", "");
	Шаблон.Вставить("Элементы", Новый Массив);
	Шаблон.Вставить("Реквизиты", Новый Массив);
	Шаблон.Вставить("ПустоеЗначение", Новый Структура);
	Шаблон.Вставить("ПредставлениеПустогоЗначения", "-");
	
	ОписаниеФормы.Шаблоны.Добавить(Шаблон);
	
	Возврат Шаблон;
	
КонецФункции

Функция НовыйЭлементОписанияФормы(ОписаниеФормы, Шаблон, Родитель) Экспорт

	ЭлементШаблона = Новый Структура;
	ЭлементШаблона.Вставить("ИмяЭлемента", "");
	ЭлементШаблона.Вставить("ТипЭлемента", 0);
	ЭлементШаблона.Вставить("ИдентификаторЭлемента", ОписаниеФормы.ИдентификаторНовогоЭлемента);
	ЭлементШаблона.Вставить("Родитель", Родитель);
	ЭлементШаблона.Вставить("Реквизит");
	ЭлементШаблона.Вставить("ИмяЭлементаФормы", "");
	ЭлементШаблона.Вставить("ПодчиненныеЭлементы", Новый Массив);
	ЭлементШаблона.Вставить("Свойства", Новый Структура);
	
	Родитель.ПодчиненныеЭлементы.Добавить(ЭлементШаблона);
	
	Шаблон.Элементы.Добавить(ЭлементШаблона);
	ОписаниеФормы.Элементы.Добавить(ЭлементШаблона);
	ОписаниеФормы.ИдентификаторыЭлементов[ЭлементШаблона.ИдентификаторЭлемента] = ЭлементШаблона;
	ОписаниеФормы.ИдентификаторНовогоЭлемента = ОписаниеФормы.ИдентификаторНовогоЭлемента + 1;
	
	Возврат ЭлементШаблона;

КонецФункции

Функция НовыйРеквизитОписанияФормы(ОписаниеФормы, Шаблон, ЭлементШаблона) Экспорт
	
	РеквизитОписанияФормы = Новый Структура;
	РеквизитОписанияФормы.Вставить("Тип", Новый ОписаниеТипов);
	РеквизитОписанияФормы.Вставить("ИдентификаторРеквизита", ОписаниеФормы.ИдентификаторНовогоРеквизита);
	РеквизитОписанияФормы.Вставить("Поля", Новый Массив);
	РеквизитОписанияФормы.Вставить("ПутьКДанным", "");

	ЭлементШаблона.Реквизит = РеквизитОписанияФормы;
	Шаблон.Реквизиты.Добавить(РеквизитОписанияФормы);
	ОписаниеФормы.Реквизиты.Добавить(РеквизитОписанияФормы);
	ОписаниеФормы.ИдентификаторыРеквизитов[РеквизитОписанияФормы.ИдентификаторРеквизита] = РеквизитОписанияФормы;
	ОписаниеФормы.ИдентификаторНовогоРеквизита = ОписаниеФормы.ИдентификаторНовогоРеквизита + 1;
	
	Возврат РеквизитОписанияФормы;
	
КонецФункции

Функция НовоеПолеРеквизитаОписанияФормы(Реквизит) Экспорт
	
	Поле = Новый Структура;
	Поле.Вставить("ТипПоля", 0);
	Поле.Вставить("Значение", "");
	Поле.Вставить("Свойства", Новый Структура);
	
	Реквизит.Поля.Добавить(Поле);
	
	Возврат Поле;

КонецФункции
