Функция СохранитьИсточникДанных(Имя, Владелец, Данные) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ИсточникиДанных.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вмс_ИсточникиДанных КАК вмс_ИсточникиДанных
		|ГДЕ
		|	вмс_ИсточникиДанных.Наименование = &Наименование
		|	И вмс_ИсточникиДанных.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Наименование", Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбъектИсточник = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектИсточник.Хранилище = Новый ХранилищеЗначения(Данные);
		ОбъектИсточник.Записать();
	Иначе
		ОбъектИсточник = СоздатьЭлемент();
		ОбъектИсточник.Владелец = Владелец;
		ОбъектИсточник.Наименование = Имя;
		ОбъектИсточник.Хранилище = Новый ХранилищеЗначения(Данные);
		ОбъектИсточник.ОбменДанными.Загрузка = Истина;
		ОбъектИсточник.Записать();
	КонецЕсли;
	
	Возврат ОбъектИсточник.Ссылка;
	
КонецФункции

Функция ИсточникДанных(Имя, Владелец) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ИсточникиДанных.Хранилище КАК Хранилище
		|ИЗ
		|	Справочник.вмс_ИсточникиДанных КАК вмс_ИсточникиДанных
		|ГДЕ
		|	вмс_ИсточникиДанных.Наименование = &Наименование
		|	И вмс_ИсточникиДанных.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Наименование", Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Хранилище.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции


Процедура ПереходНаВерсию325() Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.Ссылка КАК Правило,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьХранилищеСКДДокументы КАК ХранилищеСКДДокументы,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьХранилищеСКДЗаданияКладовщику КАК ХранилищеСКДЗаданияКладовщику,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьХранилищеСКДОснований КАК ХранилищеСКДОснований,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьХранилищеСКДТовары КАК ХранилищеСКДТовары,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьХранилищеСКДШапкиДокумента КАК ХранилищеСКДШапкиДокумента,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьТестирование КАК ХранилищеТестирование,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьСоответствиеРеквизитов КАК ХранилищеСоответствиеРеквизитов,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьДанныеСКД КАК ХранилищеДанныеСКД
		|ИЗ
		|	Справочник.вмс_ПравилаЗаполненияЗадачиКладовщику КАК вмс_ПравилаЗаполненияЗадачиКладовщику";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СохранитьИсточникДанных("ХранилищеСКДДокументы", Выборка.Правило, Выборка.ХранилищеСКДДокументы.Получить());
			СохранитьИсточникДанных("ХранилищеСКДЗаданияКладовщику", Выборка.Правило, Выборка.ХранилищеСКДЗаданияКладовщику.Получить());
			СохранитьИсточникДанных("ХранилищеСКДОснований", Выборка.Правило, Выборка.ХранилищеСКДОснований.Получить());
			СохранитьИсточникДанных("ХранилищеСКДТовары", Выборка.Правило, Выборка.ХранилищеСКДТовары.Получить());
			СохранитьИсточникДанных("ХранилищеСКДШапкиДокумента", Выборка.Правило, Выборка.ХранилищеСКДШапкиДокумента.Получить());
			СохранитьИсточникДанных("ХранилищеТестирование", Выборка.Правило, Выборка.ХранилищеТестирование.Получить());
			СохранитьИсточникДанных("ХранилищеСоответствиеРеквизитов", Выборка.Правило, Выборка.ХранилищеСоответствиеРеквизитов.Получить());
			СохранитьИсточникДанных("ХранилищеДанныеСКД", Выборка.Правило, Выборка.ХранилищеДанныеСКД.Получить());
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_Операции.УдалитьХранилищеСхемыКомпоновкиДанных КАК ХранилищеСхемыКомпоновкиДанных,
		|	вмс_Операции.УдалитьКлассОперацииХранилище КАК КлассОперацииХранилище,
		|	вмс_Операции.УдалитьХранилищеСКДЗаданияКладовщику КАК ХранилищеСКДЗаданияКладовщику,
		|	вмс_Операции.УдалитьХранилищеСКДДокументы КАК ХранилищеСКДДокументы,
		|	вмс_Операции.УдалитьДанныеСКД КАК ДанныеСКД,
		|	вмс_Операции.Ссылка КАК Операция
		|ИЗ
		|	Справочник.вмс_Операции КАК вмс_Операции";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СохранитьИсточникДанных("ХранилищеСхемыКомпоновкиДанных", Выборка.Операция, Выборка.ХранилищеСхемыКомпоновкиДанных.Получить());
			СохранитьИсточникДанных("КлассОперацииХранилище", Выборка.Операция, Выборка.КлассОперацииХранилище.Получить());
			СохранитьИсточникДанных("ХранилищеСКДЗаданияКладовщику", Выборка.Операция, Выборка.ХранилищеСКДЗаданияКладовщику.Получить());
			СохранитьИсточникДанных("ХранилищеСКДДокументы", Выборка.Операция, Выборка.ХранилищеСКДДокументы.Получить());
			СохранитьИсточникДанных("ДанныеСКД", Выборка.Операция, Выборка.ДанныеСКД.Получить());
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		вмс_Журналирование.Ошибка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), "Начальное заполнение источников данных");
	КонецПопытки;
	
КонецПроцедуры

