#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПараметры() Экспорт
	мПараметры = Хранилище.Получить();
	Если мПараметры = Неопределено ИЛИ ТипЗнч(мПараметры) <> Тип("Структура")Тогда 
		мПараметры =  Новый Структура;
	КонецЕсли;
	Возврат мПараметры;
КонецФункции

Функция ПолучитьПараметр(НаименованиеПараметра) Экспорт
	мПараметры = Хранилище.Получить();
	Если мПараметры <> Неопределено И мПараметры.Свойство(НаименованиеПараметра) Тогда
		Возврат мПараметры[НаименованиеПараметра];
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция УдалитьПараметр(Ключ) Экспорт
	Попытка
		мПараметры = ПолучитьПараметры();
		мПараметры.Удалить(Ключ);
		Хранилище = Новый ХранилищеЗначения(мПараметры);
		Записать();
		Возврат Истина;	
	Исключение
		ЗаписатьВЖурналРегистрации("Удаление параметра",ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Функция ПереименоватьПараметр(Ключ, НовИмя) Экспорт
	Попытка
		мПараметры = ПолучитьПараметры();
		Значение = мПараметры[Ключ];
		мПараметры.Удалить(Ключ);
		мПараметры.Вставить(НовИмя,Значение);
		Хранилище = Новый ХранилищеЗначения(мПараметры);
		Записать();
		Возврат Истина;
	Исключение
		ЗаписатьВЖурналРегистрации("Переименовать параметр",ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Процедура ИзменитьПараметр(НовыеДанные) Экспорт
	НаименованиеПараметра = НовыеДанные.НаименованиеПараметра;
	Если ТипЗнч(НовыеДанные.ЗначениеПараметра) = Тип("Строка") Тогда
		Если Лев(НовыеДанные.ЗначениеПараметра, 1) = "{" Тогда
			Поз = СтрНайти(НовыеДанные.ЗначениеПараметра, "}");
			Если Поз > 0 Тогда
				АдресХранилища = Сред(НовыеДанные.ЗначениеПараметра, Поз + 1);
				ЗначениеПараметра = ПолучитьИЗВременногоХранилища(АдресХранилища);
				РасширениеФайла = СтрЗаменить(Сред(НовыеДанные.ЗначениеПараметра, 2, Поз - 2), Символ(32), "");
				НаименованиеПараметра = "Файл" + ВРег(РасширениеФайла) + "_" + НаименованиеПараметра;
			Иначе
				Если ВыбрасыватьИсключение Тогда
					ВызватьИсключение "Ошибка при чтении Файла из хранилища ";
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЗначениеПараметра = НовыеДанные.ЗначениеПараметра;
		КонецЕсли;
	Иначе
		ЗначениеПараметра = НовыеДанные.ЗначениеПараметра;
	КонецЕсли;
	мПараметры = Хранилище.Получить();
	Если мПараметры = Неопределено ИЛИ ТипЗнч(мПараметры) <> Тип("Структура") Тогда
		мПараметры = Новый Структура;
	КонецЕсли;
	мПараметры.Вставить(НаименованиеПараметра, ЗначениеПараметра);
	Хранилище = Новый ХранилищеЗначения(мПараметры);
	Записать();
КонецПроцедуры  

Функция ЗаписатьВЖурналРегистрации(Событие, Ошибка)
	ЗаписьЖурналаРегистрации("WMS. Алгоритмы", УровеньЖурналаРегистрации.Ошибка, ,,"" + Событие + ":" + Ошибка);		
КонецФункции


#КонецОбласти

#Иначе

#КонецЕсли