#Область ПрограммныйИнтерфейс

Процедура ПриНачалеРаботыСистемы() Экспорт

	Если НЕ ПользовательWMSАвторизован() Тогда
		ОО = Новый ОписаниеОповещения("ОбработчикПроверкаАвторизации",ЭтотОбъект);
		ОткрытьФорму("Обработка.вмс_МодульИнтеграции.Форма.ФормаАвторизации",,,,,,ОО);	
	КонецЕсли;

КонецПроцедуры

Функция ПользовательWMSАвторизован() Экспорт

	ПараметрыАвторизации = вмс_РаботаСПользователямиСервер.ПолучитьПараметрыАвторизации();
	Если ПараметрыАвторизации.Авторизован = Ложь Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПараметрыАвторизации()Экспорт

	ПараметрыАвторизации = вмс_РаботаСПользователямиСервер.ПолучитьПараметрыАвторизации();
	
	Возврат ПараметрыАвторизации;
	
КонецФункции

Функция ОбработчикПроверкаАвторизации(Результат, Параметры) Экспорт
	
	Возврат Истина;

КонецФункции

#КонецОбласти


