
Функция НовыйТекстовыйПарсер() Экспорт
	
	ЛогическиеБлоки = Новый Структура;
	ЛогическиеБлоки.Вставить("Список", Новый Массив);
	ЛогическиеБлоки.Вставить("НачалаБлоков", Новый Соответствие);
	ЛогическиеБлоки.Вставить("КонцыБлоков", Новый Соответствие);
	ЛогическиеБлоки.Вставить("ТипыБлоков", Новый Соответствие);
	
	Разделители = Новый Структура;
	Разделители.Вставить("Список", Новый Массив);
	Разделители.Вставить("ЭтоРазделитель", Новый Соответствие);
	
	ПустыеСимволы = Новый Структура;
	ПустыеСимволы.Вставить("Список", Новый Массив);
	ПустыеСимволы.Вставить("ЭтоПустойСимвол", Новый Соответствие);
	
	ТекстовыйПарсер = Новый Структура;
	ТекстовыйПарсер.Вставить("ЛогическиеБлоки", ЛогическиеБлоки);
	ТекстовыйПарсер.Вставить("Разделители", Разделители);
	ТекстовыйПарсер.Вставить("ПустыеСимволы", ПустыеСимволы);
	ТекстовыйПарсер.Вставить("ОтступБлока", Символы.Таб);
	ТекстовыйПарсер.Вставить("БлокКонтейнера");
	
	Возврат ТекстовыйПарсер;
	
КонецФункции

Функция НовыйТекстовыйПарсерСтандартный() Экспорт
	
	Кавычка = """";
	
	ТекстовыйПарсер = НовыйТекстовыйПарсер();
	ТекстовыйПарсер_ДобавитьЛогическийБлок(ТекстовыйПарсер, "Массив",		"[", "]", ",");
	ТекстовыйПарсер_ДобавитьЛогическийБлок(ТекстовыйПарсер, "Структура",	"{", "}", ",");
	ТекстовыйПарсер_ДобавитьЛогическийБлок(ТекстовыйПарсер, "КлючИЗначение",   ,    , ":");
	ТекстовыйПарсер_ДобавитьЛогическийБлок(ТекстовыйПарсер, "Строка",		Кавычка, Кавычка);

	ТекстовыйПарсер_ДобавитьРазделитель(ТекстовыйПарсер, ",");
	ТекстовыйПарсер_ДобавитьРазделитель(ТекстовыйПарсер, ":");
	
	ТекстовыйПарсер_ДобавитьПустойСимвол(ТекстовыйПарсер, " ");
	ТекстовыйПарсер_ДобавитьПустойСимвол(ТекстовыйПарсер, Символы.ПС);
	ТекстовыйПарсер_ДобавитьПустойСимвол(ТекстовыйПарсер, Символы.Таб);
	
	Возврат ТекстовыйПарсер;
	
КонецФункции

Функция НовыйТекстовыйПарсерЧеловекоЧитаемый() Экспорт
	
	Кавычка = """";
	
	ТекстовыйПарсер = НовыйТекстовыйПарсер();
	ТекстовыйПарсер_ДобавитьЛогическийБлок(ТекстовыйПарсер, "Массив",		"[" + Символы.ПС, Символы.ПС + "]", "," + Символы.ПС);
	ТекстовыйПарсер_ДобавитьЛогическийБлок(ТекстовыйПарсер, "Структура",	"{" + Символы.ПС, Символы.ПС + "}", "," + Символы.ПС);
	ТекстовыйПарсер_ДобавитьЛогическийБлок(ТекстовыйПарсер, "КлючИЗначение",   ,    , ": ");
	ТекстовыйПарсер_ДобавитьЛогическийБлок(ТекстовыйПарсер, "Строка",		Кавычка, Кавычка);

	ТекстовыйПарсер_ДобавитьРазделитель(ТекстовыйПарсер, ",");
	ТекстовыйПарсер_ДобавитьРазделитель(ТекстовыйПарсер, ":");
	
	ТекстовыйПарсер_ДобавитьПустойСимвол(ТекстовыйПарсер, " ");
	ТекстовыйПарсер_ДобавитьПустойСимвол(ТекстовыйПарсер, Символы.ПС);
	ТекстовыйПарсер_ДобавитьПустойСимвол(ТекстовыйПарсер, Символы.Таб);
	
	Возврат ТекстовыйПарсер;
	
КонецФункции

Функция НовыйТекстовыйПарсерСтрокиЗапускаПриложения() Экспорт
	
	Кавычка = """";
	
	ТекстовыйПарсер = НовыйТекстовыйПарсер();
	
	БлокСтруктура =
		ТекстовыйПарсер_ДобавитьЛогическийБлок(ТекстовыйПарсер, "Структура",	"{", "}", ",");
	ТекстовыйПарсер_ДобавитьЛогическийБлок(ТекстовыйПарсер, "Строка",		Кавычка, Кавычка);

	ТекстовыйПарсер_ДобавитьРазделитель(ТекстовыйПарсер, "=");
	ТекстовыйПарсер_ДобавитьРазделитель(ТекстовыйПарсер, ";");
	
	ТекстовыйПарсер_ДобавитьПустойСимвол(ТекстовыйПарсер, " ");
	ТекстовыйПарсер_ДобавитьПустойСимвол(ТекстовыйПарсер, Символы.ПС);
	ТекстовыйПарсер_ДобавитьПустойСимвол(ТекстовыйПарсер, Символы.Таб);
	
	ТекстовыйПарсер.БлокКонтейнера = БлокСтруктура;
	
	Возврат ТекстовыйПарсер;
	
КонецФункции

Функция ТекстовыйПарсер_ДобавитьЛогическийБлок(ТекстовыйПарсер, ИмяТипаДанных, НачалоБлока="", КонецБлока="", Разделитель="") Экспорт

	ТипДанных = Тип(ИмяТипаДанных);
	
	ЛогическиеБлоки = ТекстовыйПарсер.ЛогическиеБлоки;
	
	ЛогическийБлок = Новый Структура;
	ЛогическийБлок.Вставить("НачалоБлока", НачалоБлока);
	ЛогическийБлок.Вставить("КонецБлока", КонецБлока);
	ЛогическийБлок.Вставить("Разделитель", Разделитель);
	ЛогическийБлок.Вставить("Структурированный", НачалоБлока <> КонецБлока);
	ЛогическийБлок.Вставить("ИмяТипаДанных", ИмяТипаДанных);
	ЛогическийБлок.Вставить("ТипДанных", ТипДанных);
	
	ЛогическиеБлоки.Список.Добавить(ЛогическийБлок);
	ЛогическиеБлоки.НачалаБлоков[НачалоБлока] = ЛогическийБлок;
	ЛогическиеБлоки.КонцыБлоков[КонецБлока] = ЛогическийБлок;
	ЛогическиеБлоки.ТипыБлоков[ТипДанных] = ЛогическийБлок;
	
	Возврат ЛогическийБлок;
	
КонецФункции

Функция ТекстовыйПарсер_ДобавитьРазделитель(ТекстовыйПарсер, Разделитель) Экспорт
	
	Разделители = ТекстовыйПарсер.Разделители;
	
	Разделители.Список.Добавить(Разделитель);
	Разделители.ЭтоРазделитель[Разделитель] = Истина;
	
КонецФункции

Функция ТекстовыйПарсер_ДобавитьПустойСимвол(ТекстовыйПарсер, ПустойСимвол) Экспорт
	
	ПустыеСимволы = ТекстовыйПарсер.ПустыеСимволы;
	
	ПустыеСимволы.Список.Добавить(ПустойСимвол);
	ПустыеСимволы.ЭтоПустойСимвол[ПустойСимвол] = Истина;
	
КонецФункции

Функция ТекстовыйПарсер_РазобратьТекст(знач Текст, ТекстовыйПарсер=Неопределено) Экспорт

	Если ТекстовыйПарсер = Неопределено Тогда
		ТекстовыйПарсер = НовыйТекстовыйПарсерСтандартный();
	КонецЕсли;
	
	ЛогическиеБлоки = ТекстовыйПарсер.ЛогическиеБлоки;
	Разделители = ТекстовыйПарсер.Разделители;
	ПустыеСимволы = ТекстовыйПарсер.ПустыеСимволы;
	ПустаяСтрока = "";
	
	КонтейнерДанных = Новый Массив;
	ТекущийБлок = КонтейнерДанных;
	
	Символ = Неопределено;
	Структурированный = Истина;
	КонецБлока = Неопределено;
	ЭлементыБлока = Новый Массив;
	ЭлементБлока = ПустаяСтрока;
	СтекБлоков = Новый Массив;
	НомерСкобки = 0;
	
	Если ТекстовыйПарсер.БлокКонтейнера <> Неопределено Тогда
		// поместим данные в дополнительный контейнер
		Текст = ТекстовыйПарсер.БлокКонтейнера.НачалоБлока + Текст + ТекстовыйПарсер.БлокКонтейнера.КонецБлока;
	КонецЕсли;
	
	Для НомерСимвола=1 По СтрДлина(Текст) Цикл
		Символ0 = Символ;
		Символ = Сред(Текст, НомерСимвола, 1);
		
		Если Структурированный Тогда
			
			// блок структурированный, т.е. могут быть вложенные блоки
			
			Если Символ = КонецБлока Тогда
				// завершение блока
				Если ЭлементБлока <> ПустаяСтрока Тогда
					ЭлементыБлока.Добавить(ЭлементБлока);
				КонецЕсли;
				ТекстовыйПарсер_ЗаполнитьЛогическийБлок(ТекущийБлок, ЭлементыБлока);
				ЭлементБлока = ТекущийБлок;
				
				Если СтекБлоков.Количество() = 0 Тогда
					ТекущийБлок = Неопределено;
					Прервать;
				КонецЕсли;
				
				// переключение контекста на родительский блок
				КадрСтека = СтекБлоков[СтекБлоков.ВГраница()];
				ТекущийБлок			= КадрСтека.ТекущийБлок;
				ЭлементыБлока		= КадрСтека.ЭлементыБлока;
				Структурированный	= КадрСтека.Структурированный;
				КонецБлока			= КадрСтека.КонецБлока;
				СтекБлоков.Удалить(СтекБлоков.ВГраница());
				Продолжить;
			КонецЕсли;
			
			ОписаниеВложенногоБлока = ЛогическиеБлоки.НачалаБлоков[Символ];
			Если ОписаниеВложенногоБлока <> Неопределено Тогда
				// обнаружен вложенный блок
				
				// сохранение родительского блока в стеке и создание контекста дочернего блока
				КадрСтека = Новый Структура;
				КадрСтека.Вставить("ТекущийБлок",		ТекущийБлок);
				КадрСтека.Вставить("ЭлементыБлока",		ЭлементыБлока);
				КадрСтека.Вставить("Структурированный",	Структурированный);
				КадрСтека.Вставить("КонецБлока",		КонецБлока);
				СтекБлоков.Добавить(КадрСтека);
				
				Если ОписаниеВложенногоБлока.ИмяТипаДанных = "Строка" Тогда
					ТекущийБлок = "";
				Иначе
					ТекущийБлок = Новый(ОписаниеВложенногоБлока.ИмяТипаДанных);
				КонецЕсли;
				ЭлементыБлока = Новый Массив;
				Структурированный = ОписаниеВложенногоБлока.Структурированный;
				КонецБлока = ОписаниеВложенногоБлока.КонецБлока;
				ЭлементБлока = ПустаяСтрока;
				НомерСкобки = 0;
				Продолжить;
			КонецЕсли;
			
			Если ПустыеСимволы.ЭтоПустойСимвол[Символ] = Истина Тогда
				Если ЭлементБлока <> ПустаяСтрока Тогда
					ЭлементыБлока.Добавить(ЭлементБлока);
					ЭлементБлока = ПустаяСтрока;
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			
			Если Разделители.ЭтоРазделитель[Символ] = Истина Тогда
				ЭлементыБлока.Добавить(ЭлементБлока);
				ЭлементБлока = ПустаяСтрока;
				Продолжить;
			КонецЕсли;
			
			// читаем элемент как текст
			ЭлементБлока = ЭлементБлока + Символ;
			
		Иначе
			
			// блок неструктурированный, берем последовательно все символы в блоке
			Если Символ = КонецБлока Тогда
				НомерСкобки = НомерСкобки + 1;
				Если НомерСкобки = 2 Тогда
					ЭлементБлока = ЭлементБлока + Символ;
					НомерСкобки = 0;
				КонецЕсли;
			Иначе
				Если НомерСкобки = 1 Тогда
					// конец строки
					КадрСтека = СтекБлоков[СтекБлоков.ВГраница()];
					ТекущийБлок			= КадрСтека.ТекущийБлок;
					ЭлементыБлока		= КадрСтека.ЭлементыБлока;
					Структурированный	= КадрСтека.Структурированный;
					КонецБлока			= КадрСтека.КонецБлока;
					СтекБлоков.Удалить(СтекБлоков.ВГраница());
					
					НомерСимвола = НомерСимвола - 1; //перечитаем символ
					Продолжить;
				КонецЕсли;

				ЭлементБлока = ЭлементБлока + Символ;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭлементБлока <> ПустаяСтрока Тогда
		ЭлементыБлока.Добавить(ЭлементБлока);
	КонецЕсли;
	
	Если ТекущийБлок <> Неопределено Тогда
		ТекстовыйПарсер_ЗаполнитьЛогическийБлок(ТекущийБлок, ЭлементыБлока);
	КонецЕсли;
	
	Если КонтейнерДанных.Количество() > 0 Тогда
		Возврат КонтейнерДанных[0];
	КонецЕсли;
	
КонецФункции

Функция ТекстовыйПарсер_ЗаполнитьЛогическийБлок(Блок, Элементы)

	ТипБлока = ТипЗнч(Блок);
	Если ТипБлока = Тип("Массив") Тогда
		Для Каждого Элемент Из Элементы Цикл
			Блок.Добавить(Элемент);
		КонецЦикла;
	ИначеЕсли ТипБлока = Тип("Структура") ИЛИ ТипБлока = Тип("Соответствие") Тогда
		КоличествоЭлементов = Элементы.Количество();
		КоличествоПар = Цел(КоличествоЭлементов/2);
		ИндексЭлемента = 0;
		Для НомерПары=1 По КоличествоПар Цикл
			Блок.Вставить(Элементы[ИндексЭлемента], Элементы[ИндексЭлемента+1]);
			ИндексЭлемента = ИндексЭлемента + 2;
		КонецЦикла;
		
		Если ИндексЭлемента < КоличествоЭлементов Тогда
			Блок.Вставить(Элементы[ИндексЭлемента], Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ТекстовыйПарсер_ПолучитьТекстДанных(Данные, ТекстовыйПарсер=Неопределено) Экспорт
	
	Если ТекстовыйПарсер = Неопределено Тогда
		ТекстовыйПарсер = НовыйТекстовыйПарсерСтандартный();
	КонецЕсли;
	
	СборщикТекста = НовыйСборщикТекста();
	
	ЛогическиеБлоки = ТекстовыйПарсер.ЛогическиеБлоки;
	
	Кавычка = """";
	ДвойнаяКавычка = Кавычка + Кавычка;
	ПС = Символы.ПС;
	
	ТипСтрока = Тип("Строка");
	ТипКлючЗначение = Тип("КлючИЗначение");
	
	ТекущийБлок = Данные;
	СтекБлоков = Новый Массив;
	Действие = 0;
	УровеньБлока = 0;
	ОтступыБлока = "";
	ОтступБлока = ТекстовыйПарсер.ОтступБлока;
	ДлинаОтступаБлока = СтрДлина(ОтступБлока);
	Пока Истина Цикл
		
		Если Действие = 0 Тогда
			
			// переход к новому блоку
			ТипБлока = ТипЗнч(ТекущийБлок);
			ОписаниеБлока = ЛогическиеБлоки.ТипыБлоков[ТипБлока];
			Если ОписаниеБлока = Неопределено Тогда
				//значение
				Значение = Строка(ТекущийБлок);
				СборщикТекста_Добавить(Значение, СборщикТекста);
				Действие = 1;
				Продолжить;
			КонецЕсли;
			
			Если ОписаниеБлока.ТипДанных = ТипСтрока Тогда
				Значение = ТекущийБлок;
				Значение = СтрЗаменить(Значение, Кавычка, ДвойнаяКавычка);
				Значение = ОписаниеБлока.НачалоБлока + Значение + ОписаниеБлока.КонецБлока;
				СборщикТекста_Добавить(Значение, СборщикТекста);
				Действие = 1;
				Продолжить;
			КонецЕсли;
			
			ЭлементыБлока = Новый Массив;
			Если ТипБлока = ТипКлючЗначение Тогда
				ЭлементыБлока.Добавить(ТекущийБлок.Ключ);
				ЭлементыБлока.Добавить(ТекущийБлок.Значение);
			Иначе
				Для Каждого ЭлементБлока Из ТекущийБлок Цикл
					ЭлементыБлока.Добавить(ЭлементБлока);
				КонецЦикла;
			КонецЕсли;
			
			Если ЭлементыБлока.Количество() > 0 Тогда
				НомерТекущегоЭлементаБлока = 0;
			Иначе
				НомерТекущегоЭлементаБлока = Неопределено;
			КонецЕсли;
			
			Текст = СтрЗаменить(ОписаниеБлока.НачалоБлока, ПС, ПС+ОтступыБлока);
			СборщикТекста_Добавить(Текст, СборщикТекста);
			Действие = 2;
			
		ИначеЕсли Действие = 1 Тогда
			
			УровеньБлока = УровеньБлока - 1;
			ОтступыБлока = Лев(ОтступыБлока, УровеньБлока*ДлинаОтступаБлока);
			
			Если СтекБлоков.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			
			// вернуться к родительскому блоку
			КадрСтека = СтекБлоков[СтекБлоков.ВГраница()];
			СтекБлоков.Удалить(СтекБлоков.ВГраница());
			ОписаниеБлока = КадрСтека.ОписаниеБлока;
			ЭлементыБлока = КадрСтека.ЭлементыБлока;
			НомерТекущегоЭлементаБлока = КадрСтека.НомерТекущегоЭлементаБлока;
			Действие = 2;
			
		ИначеЕсли Действие = 2 Тогда
			
			// перейти к вложенным блокам
			Если НомерТекущегоЭлементаБлока = Неопределено Тогда
				//закончились
				ОтступыБлока2 = Лев(ОтступыБлока, (УровеньБлока-1)*ДлинаОтступаБлока);
				Текст = СтрЗаменить(ОписаниеБлока.КонецБлока, ПС, ПС+ОтступыБлока2);
				СборщикТекста_Добавить(Текст, СборщикТекста);
				Действие = 1;
				Продолжить;
			КонецЕсли;
			
			Если НомерТекущегоЭлементаБлока > 0 Тогда
				Текст = СтрЗаменить(ОписаниеБлока.Разделитель, ПС, ПС+ОтступыБлока);
				СборщикТекста_Добавить(Текст, СборщикТекста);
			КонецЕсли;
			
			ТекущийБлок = ЭлементыБлока[НомерТекущегоЭлементаБлока];
			УровеньБлока = УровеньБлока + 1;
			ОтступыБлока = ОтступыБлока + ОтступБлока;
			Действие = 0;
			
			Если НомерТекущегоЭлементаБлока < ЭлементыБлока.ВГраница() Тогда
				НомерТекущегоЭлементаБлока = НомерТекущегоЭлементаБлока + 1
			Иначе
				НомерТекущегоЭлементаБлока = Неопределено;
			КонецЕсли;
			
			КадрСтека = Новый Структура("ОписаниеБлока, ЭлементыБлока, НомерТекущегоЭлементаБлока", ОписаниеБлока, ЭлементыБлока, НомерТекущегоЭлементаБлока);
			СтекБлоков.Добавить(КадрСтека);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстДанных = СборщикТекста_Получить(СборщикТекста);
	
	Возврат ТекстДанных;
	
КонецФункции

Функция НовыйСборщикТекста() Экспорт
	
	СборщикТекста = Новый Структура;
	СборщикТекста.Вставить("МассивТекстов", Новый Массив);
	СборщикТекста.Вставить("ТекущийТекст", "");
	СборщикТекста.Вставить("МаксимальныйРазмерТекста", 500);
	
	Возврат СборщикТекста;
	
КонецФункции

Функция СборщикТекста_Добавить(Текст, СборщикТекста) Экспорт
	
	СборщикТекста.ТекущийТекст = СборщикТекста.ТекущийТекст + Текст;
	Если СтрДлина(СборщикТекста.ТекущийТекст) >= СборщикТекста.МаксимальныйРазмерТекста Тогда
		СборщикТекста.МассивТекстов.Добавить(СборщикТекста.ТекущийТекст);
		СборщикТекста.ТекущийТекст = "";
	КонецЕсли;
	
КонецФункции

Функция СборщикТекста_Получить(СборщикТекста) Экспорт
	
	Возврат вмс_РаботаСКоллекциями.МассивВСтроку(СборщикТекста.МассивТекстов) + СборщикТекста.ТекущийТекст;
	
КонецФункции
