
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗавершитьРедактирование", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокСроковГодностиИспользоватьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СрокиГодности.ТекущиеДанные;
	ТекущаяСтрока = Элементы.СрокиГодности.ТекущаяСтрока;
	
	Если ТекущиеДанные.Использовать Тогда
		РасчитатьСрокГодностиПоДатеПроизводства(ТекущаяСтрока);
	Иначе
		ТекущиеДанные.ДатаСрокаГодности = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда, ДопПараметры = Неопределено) Экспорт
	
	Модифицированность = Ложь;
	
	ЭтаФорма.ОповеститьОВыборе(НовыеАльтернативныеСрокиГодности());
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	Товар = Параметры.Товар;
	ДатаПроизводства = Параметры.ДатаПроизводства;
	
	ЗаполнитьСписокСроковГодности(Параметры.АльтернативныеСрокиГодности);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСроковГодности(АльтернативныеСрокиГодности)
	
	Если Не ЗначениеЗаполнено(АльтернативныеСрокиГодности)
		И Не ЗначениеЗаполнено(Товар) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Условие Из Товар.УсловияХранения Цикл
		
		НоваяСтрока = СрокиГодности.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Условие);
		
		ДатаСрокаГодности = АльтернативныеСрокиГодности[Условие.Тип];
		
		Если ДатаСрокаГодности = Неопределено Тогда
			НоваяСтрока.Использовать = Ложь;
		ИначеЕсли ЗначениеЗаполнено(ДатаСрокаГодности) Тогда
			НоваяСтрока.ДатаСрокаГодности = ДатаСрокаГодности;
		Иначе
			РасчитатьСрокГодностиПоДатеПроизводства(НоваяСтрока, Условие);
		КонецЕсли;
		
	КонецЦикла;
	
	СрокиГодности.Сортировать("Тип");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Заголовок = Заголовок + ": " + Строка(Товар);
	
КонецПроцедуры

&НаКлиенте
Функция НовыеАльтернативныеСрокиГодности()
	
	Результат = Новый Соответствие;
	
	Отбор = Новый Структура("Использовать", Истина);
	Для каждого Стр Из СрокиГодности.НайтиСтроки(Отбор) Цикл
		Результат.Вставить(Стр.Тип, Стр.ДатаСрокаГодности);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура РасчитатьСрокГодностиПоДатеПроизводства(СтрокаСрокаГодности, УсловиеХранения = Неопределено)
	
	Если Не ЗначениеЗаполнено(Товар)
		Или Не ЗначениеЗаполнено(ДатаПроизводства) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаСрокаГодности) = Тип("Число") Тогда
		Стр = СрокиГодности.НайтиПоИдентификатору(СтрокаСрокаГодности);
	Иначе
		Стр = СтрокаСрокаГодности;
	КонецЕсли;
	
	Если УсловиеХранения = Неопределено Тогда
		Условие = Товар.УсловияХранения.Найти(Стр.Тип, "Тип");
	Иначе
		Условие = УсловиеХранения;
	КонецЕсли;
	
	Если Условие = Неопределено Или Не ЗначениеЗаполнено(Условие.СрокХранения) Тогда
		Возврат;
	КонецЕсли;
	
	Стр.ДатаСрокаГодности = ДатаПроизводства + Условие.СрокХранения * МодульОбъекта().СекундВСутках();
	
	Модифицированность = Истина;
	
КонецПроцедуры

// #КонецОбласти
