&НаКлиенте
Процедура ПолучитьМакетЭлементов(Команда)
	Макет = ПолучитьМакетЭлементовНаСервере();
	Макет.Показать("Операции ТСД");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМакетВыделенныхЭлементов(Команда)
	
	СписокОбъектов = Новый Массив;
	
	Для Каждого СсылкаНаОбъект Из Элементы.Список.ВыделенныеСтроки Цикл
		СписокОбъектов.Добавить(СсылкаНаОбъект);
	КонецЦикла;
	
	Макет = ПолучитьМакетЭлементовНаСервере(СписокОбъектов);
	Макет.Показать("Выбранные операции");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМакетЭлементовНаСервере(СписокОбъектов=Неопределено)
	
	Возврат вмс_ОбновлениеИнформационнойБазы.ПолучитьМакетЭлементов("Справочник.вмс_Операции", СписокОбъектов);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьИзМакетаНаСервере()
	
	вмс_ОбновлениеИнформационнойБазы.ЗагрузитьЭлементыИзМакета("ПредопределенныеЭлементыОперацииТСД", "Справочник.вмс_Операции");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзМакета(Команда)
	ЗагрузитьИзМакетаНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры
