#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем РК;

#Область API
Функция ВыполнитьДействие(Действие) Экспорт
	
	Код = Действие.Код;
	ПараметрыДействия = Действие.Параметры;
	
	Если Код="ИнициализироватьМодульОбработки" Тогда
		
		ДействиеИнициализироватьМодульОбработки(Действие);
		
	ИначеЕсли Код="Инициализировать" Тогда
		
		ДействиеИнициализировать(Действие);
		
	ИначеЕсли Код="ИнициализироватьПоляОбработки" Тогда
		
		ДействиеИнициализироватьПоляОбработки(Действие);
		
	ИначеЕсли Код="ЭтоСлужебныйМодуль" Тогда
		
		ЭтоСлужебныйМодуль = Метаданные().Имя="вмс_СерверУправляемыйМодульОперацияПоЯчейкамШаблон";
		вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, ЭтоСлужебныйМодуль);
		
	КонецЕсли;
	
	Возврат Действие.Результат;
	
КонецФункции
#КонецОбласти

Функция ДействиеИнициализироватьМодульОбработки(Действие)
	
КонецФункции

Функция ДействиеИнициализировать(Действие)
	
КонецФункции

Функция ДействиеИнициализироватьПоляОбработки(Действие)
	
КонецФункции















































//////////////////////////////////////////////////////////////////////////////////
//
//					Объявления функций+
//

#Область ОбъявленияФункций

Функция ПолучитьФормуОбработки()
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ПолучениеФормыОбработки"));
	
КонецФункции

Функция ОткрытьФормуОбработки(ИмяФормы)
	
	ДобавитьДействиеНаКлиенте("ОткрытьФормуОбработки", Новый Структура("ИмяФормы", ИмяФормы));
	
КонецФункции

Функция НачатьТранзакциюОбработки(СборщикиДанных=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("НачатьТранзакциюОбработки", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

Функция ЗафиксироватьТранзакциюОбработки(СборщикиДанных=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗафиксироватьТранзакциюОбработки", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, знач Модуль=Неопределено, ДополнительныеПараметры=Неопределено, ИмяПроцедурыОбработкиОшибки=Неопределено, МодульОбработкиОшибки=Неопределено)
	
	Если Модуль=Неопределено Тогда
		Модуль = ЭтотОбъект;
	КонецЕсли;
	
	Возврат вмс_СерверУправляемыеОбработки.НовыйОписаниеОповещения(ИмяПроцедуры, ПараметрыОбработки, Модуль, ДополнительныеПараметры, ИмяПроцедурыОбработкиОшибки, МодульОбработкиОшибки);
	
КонецФункции

Функция ПереключитьСтраницу(ИмяСтраницы)
	
	Возврат СтандартныйМодуль.ПереключитьСтраницу(ИмяСтраницы);
	
КонецФункции

Функция ДобавитьДействиеНаКлиенте(КодДействие, знач ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ДобавитьДействиеНаКлиенте(ПараметрыОбработки, КодДействие, ПараметрыДействия);
	
КонецФункции

Функция ДобавитьТаймер(ИД, Интервал_мс, знач ОписаниеОповещения=Неопределено, ВремяЗаморозки=0)
	
	Если ОписаниеОповещения=Неопределено Тогда
		//обработчик на основании имени таймера
		ОписаниеОповещения = НовыйОписаниеОповещения(ИД);
	КонецЕсли;
	
	Возврат СтандартныйМодуль.ДобавитьТаймер(ИД, Интервал_мс, ОписаниеОповещения, ВремяЗаморозки);
	
КонецФункции

Функция Действие(Код, ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.Действие(Код, ПараметрыДействия, ПараметрыОбработки.Идентификатор, ПараметрыОбработки, ЭтотОбъект);
	
КонецФункции

Функция ДействиеВыполняетсяПосле(Действие)
	
	Возврат вмс_СерверУправляемыеОбработки.ДействиеВыполняетсяПосле(Действие);
	
КонецФункции

Функция УстановитьРезультатДействия(Действие, Результат=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, Результат);
	
КонецФункции

Функция ВвестиДанные(ВходящиеДанные)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ВвестиДанные", Новый Структура("ВходящиеДанные", ВходящиеДанные)));
	
КонецФункции

Функция ВвестиДанныеПоля(ИмяПоля, ЗначениеПоля)
	
	Возврат СтандартныйМодуль.ВвестиДанныеПоля(ИмяПоля, ЗначениеПоля);
	
КонецФункции

Функция НовыеВходящиеДанные(Данные=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.НовыеВходящиеДанные(Данные);
	
КонецФункции

Функция ДобавитьЭтапВводаДанных(ОписаниеОбработчика, Группа, Место=Неопределено, Параметр=Неопределено, Имя=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ДобавитьЭтапВводаДанных", Новый Структура("ОписаниеОбработчика, Группа, Место, Параметр, Имя", ОписаниеОбработчика, Группа, Место, Параметр, Имя)));
	
КонецФункции

Функция ПолучитьЭлементТаблицыПоИдентификатору(ИмяТаблицы, ИдентификаторЭлемента)
	
	Возврат СтандартныйМодуль.ПолучитьЭлементТаблицыПоИдентификатору(ИмяТаблицы, ИдентификаторЭлемента);
	
КонецФункции

Функция ОбновитьСостояниеКлиента()
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ОбновитьСостояниеКлиента"));
	
КонецФункции

Функция ПараметрыТаблицы(ИмяТаблицы)
	
	Возврат СтандартныйМодуль.ПараметрыТаблицы(ИмяТаблицы);
	
КонецФункции

Функция ЗаполнитьТаблицы()
	
	Возврат СтандартныйМодуль.ЗаполнитьТаблицы();
	
КонецФункции

Функция ЗаполнитьДанныеПолей(СборщикиДанных=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗаполнитьДанныеПолей", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

Функция ОчиститьДанныеПолей(Поля=Неопределено, ИмяДанных=Неопределено, СборщикиДанных=Неопределено)
	
	Возврат СтандартныйМодуль.ОчиститьДанныеПолей(Поля, ИмяДанных, СборщикиДанных);
	
КонецФункции

#Область РаботаСДокументомОперацияПоЯчейкам
Функция ЗаписатьДокументОперацииПоЯчейкам(ОперацияПоЯчейкам)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗаписатьДокументОперацииПоЯчейкам", Новый Структура("ОперацияПоЯчейкам", ОперацияПоЯчейкам)));
	
КонецФункции

Функция ПолучитьДокументОперацииПоЯчейкам(Создавать=Истина)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ПолучитьДокументОперацииПоЯчейкам", Новый Структура("Создавать", Создавать)));
	
КонецФункции

Функция НовыйДокументОперацииПоЯчейкам()
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("НовыйДокументОперацииПоЯчейкам"));
	
КонецФункции
#КонецОбласти
Функция ЗавершитьРаботуОбработки()
	
	вмс_СерверУправляемыеОбработки.ЗавершитьРаботуОбработки(ПараметрыОбработки);
	
КонецФункции

Функция ВыполнитьЗавершениеОперации()
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ВыполнитьЗавершениеОперации"));
	
КонецФункции

/////////////////////////////////////////////////////////////////////////
//
//				Поля обработки+
//

Функция УстановитьОбработчикиСобытийПолейОбработки(Поля=Неопределено, События)
	
	Возврат СтандартныйМодуль.УстановитьОбработчикиСобытийПолейОбработки(Поля, События);
	
КонецФункции

Функция ВосстановитьИсходныеСвойстваПолейОбработки(Поля=Неопределено)
	
	Возврат СтандартныйМодуль.ВосстановитьИсходныеСвойстваПолейОбработки(Поля);
	
КонецФункции

//возвращает всю таблицу полей или массив полей по отбору
Функция ПоляОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ПолеОбработки(Отбор)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

//возвращает поля с указанными именами, если поля нет, то создает новое
Функция ПолучитьПоляОбработки(Поля=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьПоляОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция УстановитьСвойстваПолейОбработки(Поля=Неопределено, Свойства=Неопределено, Значение=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьСвойстваПолейОбработки(ПараметрыОбработки, Поля, Свойства, Значение);
	
КонецФункции

Функция ПолучитьЗначениеСвойстваПоляОбработки(Поле, ИмяСвойства)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеСвойстваПоляОбработки(ПараметрыОбработки, Поле, ИмяСвойства);
	
КонецФункции

Функция УстановитьПоляВводаОбработки(Поля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьПоляВводаОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция УстановитьПоляВыводаОбработки(Поля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьПоляВыводаОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция СписокПолейВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВвода(ПараметрыОбработки);
	
КонецФункции

Функция ПоляВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВвода(ПараметрыОбработки);
	
КонецФункции

Функция СписокПолейВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВывода(ПараметрыОбработки);
	
КонецФункции

Функция ПоляВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВывода(ПараметрыОбработки);
	
КонецФункции

Функция СписокПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ТаблицаПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ТаблицаПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ПолучитьЗначениеДанныхПоляОбработки(Поле, ИмяСвойства)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеДанныхПоляОбработки(ПараметрыОбработки, Поле, ИмяСвойства);
	
КонецФункции

Функция УстановитьЗначениеДанныхПоляОбработки(Поле, Значение)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьЗначениеДанныхПоляОбработки(ПараметрыОбработки, Поле, Значение);
	
КонецФункции

Функция ПрочитатьПутиКДаннымПолей(ПолеПути, Поля=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПрочитатьПутиКДаннымПолей(ПараметрыОбработки, ПолеПути, Поля);
	
КонецФункции

Функция ЗаписатьПутиКДаннымПолей(ПолеПути, ТаблицаПутейКДаннымПолей)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ЗаписатьПутиКДаннымПолей(ПараметрыОбработки, ПолеПути, ТаблицаПутейКДаннымПолей);
	
КонецФункции

//
//				Поля обработки-
//
/////////////////////////////////////////////////////////////////////////

Функция СборщикиДанных(Отбор=Неопределено) Экспорт
	
	Возврат СтандартныйМодуль.СборщикиДанных(Отбор);
	
КонецФункции

Функция СборщикДанных(Отбор) Экспорт
	
	Возврат СтандартныйМодуль.СборщикДанных(Отбор);
	
КонецФункции

Функция УстановитьОбработчикиСобытийЭлементовВывода(Элементы, События)
	
	Возврат СтандартныйМодуль.УстановитьОбработчикиСобытийЭлементовВывода(Элементы, События);
	
КонецФункции

Функция УстановитьСвойстваЭлементовВывода(Элементы, Свойства=Неопределено, ЗначениеСвойства=Неопределено)
	
	Возврат СтандартныйМодуль.УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства);
	
КонецФункции

Функция ПолучитьЭлементВывода(Имя)
	
	Возврат СтандартныйМодуль.ПолучитьЭлементВывода(Имя);
	
КонецФункции

Функция ПолучитьЭлементВыводаДляПоляОбработки(ЭлементВывода, ПолеДанныхЭлемента=Неопределено)
	
	Возврат СтандартныйМодуль.ПолучитьЭлементВыводаДляПоляОбработки(ЭлементВывода, ПолеДанныхЭлемента);
	
КонецФункции

Функция ЭлементВывода(ОтборЭлемента)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ЭлементВывода(ПараметрыОбработки, ОтборЭлемента);
	
КонецФункции

Функция ЭлементыВывода(ОтборЭлементов)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ЭлементыВывода(ПараметрыОбработки, ОтборЭлементов);
	
КонецФункции

Функция ПоказатьДиалогНаКлиенте(знач ОписаниеОповещения=Неопределено, Текст, знач Кнопки=Неопределено, знач Таймаут=Неопределено, КнопкаПоУмолчанию=Неопределено, Заголовок=Неопределено, ИмяЗвука="Сигнал")
	
	Если ТипЗнч(ОписаниеОповещения)=Тип("Строка") Тогда
		ОписаниеОповещения = НовыйОписаниеОповещения(ОписаниеОповещения);
	КонецЕсли;
	
	Возврат СтандартныйМодуль.ПоказатьДиалогНаКлиенте(ОписаниеОповещения, Текст, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, ИмяЗвука);
	
КонецФункции
#КонецОбласти

//
//					Объявления функций-
//
//////////////////////////////////////////////////////////////////////////////////

РК = вмс_РаботаСКоллекциями;
	
#КонецЕсли

