#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеКопирования = Неопределено;
	Если Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования) И ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ПриЧтенииНаСервере(ЗначениеКопирования);
	КонецЕсли;
	
	ЗаполнитьДанныеТестирования(); 
	
	УправлениеЭлементамиФормы();
	
	Объект.ЗаданиеКладовщикуРаспоряжение = "Документ.вмс_ЗаданиеКладовщику";
	
	вмс_УправлениеСвойствамиСервер.ПриСозданииНаСервере(ЭтаФорма, ЭтаФорма.Объект, , "СтраницаДополнительно");
	
	//СтруктураНастройкиПолей = Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.СтруктураНастройкиПолей(Объект);
	//Справочники.вмс_НастройкиПолейЗадания.ПриСозданииФормы(ЭтаФорма, СтруктураНастройкиПолей);
	
	вмс_НастройкиПолейЗаданияСервер1.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	вмс_УправлениеСвойствамиКлиент.ПриОткрытии(ЭтаФорма, Отказ); 
	
	вмс_НастройкиПолейЗаданияКлиент1.ПриОткрытии(ЭтаФорма, Отказ, ДанныеОбъектаНастройкиПолейЗадания(Истина));
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	вмс_ПараметрыПриложения["КлиентскиеПеременные"].Удалить(ЭтаФорма);
	вмс_УправлениеСвойствамиКлиент.ПриЗакрытии(ЭтаФорма, ЗавершениеРаботы);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//3.2.5 - Переход на отдельное хранилище данных
	//ДанныеСКД = ТекущийОбъект.ДанныеСКД.Получить();
	ДанныеСКД = Справочники.вмс_ИсточникиДанных.ИсточникДанных("ХранилищеДанныеСКД", ТекущийОбъект.Ссылка);
	
	Если ТипЗнч(ДанныеСКД)=Тип("Структура") Тогда
		ТекущиеДанныеСКД = ПолучитьТекущиеДанныеСКД();
		Для Каждого ЭлементДанныхСКД Из ДанныеСКД Цикл
			ИмяСКД = ЭлементДанныхСКД.Ключ;
			Если ТекущиеДанныеСКД.Свойство(ИмяСКД) Тогда
				СохранитьСКД(ЭлементДанныхСКД.Значение, ЭтаФорма["АдресДанныеСКД" + ИмяСКД]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//3.2.5 - Переход на отдельное хранилище данных
	//АдресДанныеТестирования = ПоместитьВоВременноеХранилище(ТекущийОбъект.Тестирование.Получить(), УникальныйИдентификатор);
	АдресДанныеТестирования = ПоместитьВоВременноеХранилище(Справочники.вмс_ИсточникиДанных.ИсточникДанных("ХранилищеТестирование", ТекущийОбъект.Ссылка), УникальныйИдентификатор);
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//3.2.5 - Переход на отдельное хранилище данных
	//ТекущийОбъект.ДанныеСКД = Новый ХранилищеЗначения(ПолучитьТекущиеДанныеСКД());
	//
	//ПоместитьДанныеТестированияВХранилище();
	//ТекущийОбъект.Тестирование = Новый ХранилищеЗначения(ПолучитьДанныеТестирования());
	//ТекущийОбъект.ХранилищеСКДТовары = Новый ХранилищеЗначения(); // совместимость
	//ТекущийОбъект.ХранилищеСКДДокументы = Новый ХранилищеЗначения(ПолучитьСКД(АдресСКДДокументы));
	//ТекущийОбъект.ХранилищеСКДЗаданияКладовщику = Новый ХранилищеЗначения(ПолучитьСКД(АдресДанныеСКДЗаданияКладовщику));
	//ТекущийОбъект.ХранилищеСКДОснований = Новый ХранилищеЗначения(ПолучитьСКД(АдресДанныеСКДОснования));
	//ТекущийОбъект.ХранилищеСКДШапкиДокумента = Новый ХранилищеЗначения(ПолучитьСКД(АдресДанныеСКДШапки));
	//
	//3.2.5 - Переход на отдельное хранилище данных
	
	Если НЕ ТекущийОбъект.ЭтоНовый() Тогда
		
		вмс_УправлениеСвойствамиСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
		
		ПравилоВладелец = ТекущийОбъект.Ссылка;
		ПоместитьДанныеТестированияВХранилище();
		ТекущийОбъект.ХранилищеТестирование 					= Справочники.вмс_ИсточникиДанных.СохранитьИсточникДанных(
														"ХранилищеТестирование", ПравилоВладелец, ПолучитьДанныеТестирования());
		ТекущийОбъект.ХранилищеСКДТовары 			= Справочники.вмс_ИсточникиДанных.СохранитьИсточникДанных(
														"ХранилищеСКДТовары", ПравилоВладелец, Новый ХранилищеЗначения(Неопределено));
		ТекущийОбъект.ХранилищеСКДДокументы 		= Справочники.вмс_ИсточникиДанных.СохранитьИсточникДанных(
														"ХранилищеСКДДокументы", ПравилоВладелец, ПолучитьСКД(АдресСКДДокументы));
		ТекущийОбъект.ХранилищеСКДЗаданияКладовщику = Справочники.вмс_ИсточникиДанных.СохранитьИсточникДанных(
														"ХранилищеСКДЗаданияКладовщику", ПравилоВладелец, ПолучитьСКД(АдресДанныеСКДЗаданияКладовщику));
		ТекущийОбъект.ХранилищеСКДОснований 		= Справочники.вмс_ИсточникиДанных.СохранитьИсточникДанных(
														"ХранилищеСКДОснований", ПравилоВладелец, ПолучитьСКД(АдресДанныеСКДОснования));
		ТекущийОбъект.ХранилищеСКДШапкиДокумента 	= Справочники.вмс_ИсточникиДанных.СохранитьИсточникДанных(
														"ХранилищеСКДШапкиДокумента", ПравилоВладелец, ПолучитьСКД(АдресДанныеСКДШапки));
		ТекущийОбъект.ХранилищеДанныеСКД 			= Справочники.вмс_ИсточникиДанных.СохранитьИсточникДанных(
														"ХранилищеДанныеСКД", ПравилоВладелец, ПолучитьТекущиеДанныеСКД());
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаписьНового", ТекущийОбъект.ЭтоНовый());
	
КонецПроцедуры  

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.РежимФормированияЗаданий=0 Тогда
		Если НЕ ЗначениеЗаполнено(Объект.РаспоряжениеКонфигуратор) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не указано распоряжение";
			Сообщение.ПутьКДанным = "Объект.РаспоряжениеКонфигуратор";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ДополнительныеСвойства.ЗаписьНового Тогда
		// нужно записать еще раз, чтобы сохранить ссылку на владельца в источниках
		// после того, как сслыка сформировалась
		Записать(ПараметрыЗаписи);
		Возврат;
	КонецЕсли;
	
	//Если ТекущийОбъект.АвтоНастройкаПолей Тогда
	//	// обработано неинтерактивно в модуле объекта
	//	// просто перечитаем результат
	//	СсылкаНастройкиПолей = Справочники.вмс_НастройкиПолейЗадания.НайтиНастройкуПолейПоВладельцу(Объект.Ссылка);
	//	Если ЗначениеЗаполнено(СсылкаНастройкиПолей) Тогда
	//		СтруктураНастройкиПолей = Справочники.вмс_НастройкиПолейЗадания.СтруктураНастройкиПолей(СсылкаНастройкиПолей);
	//		Справочники.вмс_НастройкиПолейЗадания.ЗаполнитьНастройкуПолейНаФорме(ЭтаФорма, СтруктураНастройкиПолей);
	//	КонецЕсли;
	//Иначе
	//	// обработка интерактивных изменений настройки
	//	Справочники.вмс_НастройкиПолейЗадания.ПослеЗаписиНаФорме(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьДополнительныеРеквизиты();
	
	СохранитьНастройкиПолей();
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДополнительныеРеквизиты()
	
	вмс_УправлениеСвойствамиСервер.ОбновитьДополнительныеРеквизиты(ЭтаФорма);
	
КонецФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ПараллельноеФормированиеЗаданийСледующегоЭтапа.Доступность = ЗначениеЗаполнено(Объект.СледующееПравило);
	
	НеЗаполнятьПоПредыдущейОперации = НЕ Объект.ЗаполнятьПлан ИЛИ Объект.Товары_Переопределяемые;
	
	Элементы.Товары_ЗаполнятьПоОтобранным.ТолькоПросмотр = НеЗаполнятьПоПредыдущейОперации ИЛИ Объект.Товары_ЗаполнятьПоПринятым;
	Элементы.Товары_ЗаполнятьПоПринятым.ТолькоПросмотр = НеЗаполнятьПоПредыдущейОперации ИЛИ Объект.Товары_ЗаполнятьПоОтобранным;
	
	// ТУ_Алфимов 20.08.25 ++
	Элементы.РаспоряжениеКонфигуратор.СписокВыбора.Очистить();
	вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(Элементы.РаспоряжениеКонфигуратор.СписокВыбора, ПолучитьСписокДокументовКонфигурации()); 
	// ТУ_Алфимов 20.08.25 --
	
	//Элементы.ПодбиратьЯчейкиПоПомещениям.Доступность = Объект.ПодбиратьЯчейкиОтправители; // Кулалаев. Убрал с формы, пока не обработана логика работы с помещениями
	
	Элементы.ГруппаНастройкиОтбораОбщая.Доступность = Объект.ПодбиратьЯчейкиОтправители;
	Элементы.ПерейтиВРегистрНастроекОСГ.Доступность = Объект.ПодбиратьЯчейкиОтправители И Объект.ИспользоватьОСГНаОтбор;
	Элементы.ГруппаНастройкиОтбораВыборЗоныОтправителя.Доступность = Объект.ИспользоватьЗонуОтправитель;
	
	
	Элементы.ГруппаНастроекРазмещения.Доступность = Объект.ПодбиратьЯчейкиПолучатели;
	Элементы.ПоказыватьДополнительныеЯчейкиПриемки.Доступность = Объект.ПодбиратьЯчейкиПолучатели И Объект.СтрогоеПланированиеЯчейки = Ложь И Объект.ПриниматьНаСлужебнуюЗонуПолучатель = Ложь; 
	
	Элементы.ТипЗоныПолучателя.Доступность = Объект.ПриниматьНаСлужебнуюЗонуПолучатель;
	Элементы.ТипЗоныОтправителя.Доступность = Объект.ОтгружатьСоСлужебнойЗоныОтправителя;
	Элементы.ЗонаОтправитель.Доступность = Объект.УстанавливатьЯчейкуОтправитель;
	Элементы.ЗонаПолучатель.Доступность = Объект.УстанавливатьЯчейкуПолучатель;
	Элементы.ПодтверждатьЗонуПолучатель.Доступность = НЕ Объект.РучнойВводЗоныПолучателя;
	Элементы.ГруппаНастройкиРазмещениеВыборЗоны.Доступность = НЕ Объект.РучнойВводЗоныПолучателя;
	
	
	// доступность ОСГ
	ИспользуютсяСерии = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля().Найти("Серия") <> Неопределено;
	Элементы.ГруппаНастройкиОСГ.ТолькоПросмотр = НЕ ИспользуютсяСерии;
	Элементы.Подпитка_ИспользоватьОСГНаОтбор.ТолькоПросмотр = НЕ ИспользуютсяСерии;
	
	// помещения
	ИспользоватьПомещения = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ИспользоватьПомещения", Ложь);
	Элементы.ОтбиратьПоПомещениям.ТолькоПросмотр = НЕ ИспользоватьПомещения;
	Элементы.Подпитка_ПодбиратьЯчейкиПоПомещениям.ТолькоПросмотр = НЕ ИспользоватьПомещения;
	
	// расширенный режим редактирования
	Элементы.Шапка_Переопределяемая.Видимость = Объект.РасширенныйРежимРедактирования;
	Элементы.Товары_Переопределяемые.Видимость = Объект.РасширенныйРежимРедактирования;
	
	// контейнеры
	ИспользоватьКонтейнеры = вмс_ОбщегоНазначенияВызовСервера.Модуль("вмс_ЗащищенныйМодуль").вмс_ИспользованиеТары();
	
	Если ИспользоватьКонтейнеры = Ложь Тогда
		Элементы.Контейнеры_СообщенияОшибок.Видимость = Истина;
		Элементы.СтраницаКонтейнеры.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ОтгружатьКонтейнерыБезПересчета.Доступность = Объект.ПодбиратьЯчейкиОтправители;     
		Элементы.ОтгрузкаКонтейнеров_СначалаКонтейнеры.Доступность = Объект.ПодбиратьЯчейкиОтправители; 
		Элементы.ОтгрузкаКонтейнеров_СначалаМонотоварныеКонтейнеры.Доступность = Объект.ПодбиратьЯчейкиОтправители;   
		Элементы.ОтгрузкаКонтейнеров_СначалаЦелые.Доступность = Объект.ПодбиратьЯчейкиОтправители;
		Элементы.РазмещатьКонтейнерыБезПересчета.Доступность = Объект.ПодбиратьЯчейкиПолучатели;
	КонецЕсли;
	
	Если Объект.РежимФормированияЗаданий=0 Тогда
		Элементы.Группа_НастройкиОснований.Видимость = Истина;
		Элементы.ГруппаЗаполнятьТоварыПоПредыдущимОперациям.Видимость = Ложь;
		Элементы.ПредыдущиеОперации.Видимость = Ложь;
		Элементы.РаспоряжениеКонфигуратор.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Если Объект.РежимФормированияЗаданий=1 Тогда
			Элементы.Группа_НастройкиОснований.Видимость = Ложь;
			Элементы.ГруппаЗаполнятьТоварыПоПредыдущимОперациям.Видимость = Истина;
			Элементы.ПредыдущиеОперации.Видимость = Истина;
		Иначе
			Элементы.Группа_НастройкиОснований.Видимость = Ложь;
			Элементы.ГруппаЗаполнятьТоварыПоПредыдущимОперациям.Видимость = Ложь;
			Элементы.ПредыдущиеОперации.Видимость = Ложь;
		КонецЕсли;
		Элементы.РаспоряжениеКонфигуратор.АвтоОтметкаНезаполненного = Ложь;
		Элементы.РаспоряжениеКонфигуратор.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаполнятьПланПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОперацияНазначениеПриИзменении(Элемент)
	СформироватьНаименование();
	УстановитьНастройкиСКДШапкиПоУмолчаниюНаСервере(Объект.ОперацияНазначение);
КонецПроцедуры

&НаКлиенте
Процедура Товары_ЗаполнятьПоОтобраннымПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура Товары_ЗаполнятьПоПринятымПриИзменении(Элемент)
	
	УстановитьНастройкиСКДТоварыПоУмолчаниюНаСервере();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Товары_ПереопределяемыеПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура РазмещатьКонтейнерыБезПересчетаПриИзменении(Элемент)
	
	УстановитьНастройкиСКДТоварыПоУмолчаниюНаСервере();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодбиратьЯчейкиОтправителиПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗонуОтправительПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПодбиратьЯчейкиПолучателиПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура СтрогоеПланированиеЯчейкиПриИзменении(Элемент)
	Объект.ПоказыватьДополнительныеЯчейкиПриемки = Ложь;
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОСГНаОтборПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура РаспоряжениеКонфигураторПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РаспоряжениеКонфигуратор) Тогда
		Объект.РежимФормированияЗаданий = 0;
		Объект.ЗаполнятьПлан = Истина;
	Иначе
		Объект.РежимФормированияЗаданий = 2;
		Объект.ЗаполнятьПлан = Ложь;
	КонецЕсли;
	
	СформироватьНаименование();
	
	РаспоряжениеКонфигураторПриИзмененииСервер();
	//УстановитьНастройкиСКДДокументовЗаданияКладовщику(Объект.ЗаданиеКладовщикуРаспоряжение);
	УстановитьНастройкиСКДОснованияПоУмолчаниюНаСервере();
	УстановитьНастройкиСКДШапкиПоУмолчаниюНаСервере(Объект.ОперацияНазначение);
	УстановитьНастройкиСКДТоварыПоУмолчаниюНаСервере();
	УправлениеЭлементамиФормы();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриниматьНаЗонуПриемкиПриИзменении(Элемент)
	Объект.ПоказыватьДополнительныеЯчейкиПриемки = Ложь;
	
	Если Объект.ПриниматьНаСлужебнуюЗонуПолучатель = Ложь Тогда
		Объект.ТипЗоныПолучателя = Неопределено;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОтгружатьСЗоныОтгрузкиПриИзменении(Элемент)
	Если Объект.ОтгружатьСоСлужебнойЗоныОтправителя = Ложь Тогда
		Объект.ТипЗоныОтправителя = Неопределено;
	// ТУ_Кукушкин 29.12.25 ++
	Иначе 
		Объект.НестрогоеПланированиеЯчейкиОтбора = Ложь;
	// ТУ_Кукушкин 29.12.25 --
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждатьЗонуПолучательПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстанавливатьЯчейкуПолучательПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстанавливатьЯчейкуОтправительПриИзменении(Элемент)
	
	// ТУ_Кукушкин 29.12.25 ++
	Если Объект.УстанавливатьЯчейкуОтправитель Тогда
		Объект.НестрогоеПланированиеЯчейкиОтбора = Ложь;
	КонецЕсли;   
	// ТУ_Кукушкин 29.12.25 --
	
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура РучнойВводЗоныПолучателяПриИзменении(Элемент)
	Если Объект.РучнойВводЗоныПолучателя Тогда
		Объект.ПодтверждатьЗонуПолучатель = Истина;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура РежимФормированияЗаданийПриИзменении(Элемент)
	
	Если Объект.РежимФормированияЗаданий=2 Тогда
		Объект.РаспоряжениеКонфигуратор = Неопределено;
		РаспоряжениеКонфигураторПриИзменении(Элементы.РаспоряжениеКонфигуратор);
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура РедактироватьСКДОснований(Команда)
	
	РедактироватьСКД("Основания");
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСКДШапок(Команда)
	
	РедактироватьСКД("Шапки");
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСКДТоваров(Команда)
	
	РедактироватьСКД("Товары");
	
	Элементы.КнопкаРедактироватьСКДТоваров.Картинка = Новый Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСКДКодовМаркировки(Команда)

	РедактироватьСКД("КодыМаркировки");
	
КонецПроцедуры

&НаКлиенте
Процедура ТестированиеПолучитьДанные(Команда)
	
	Результат = ТестированиеПолучитьДанныеНаСервере();
	
	Для Каждого ЭлементТабДок Из Результат Цикл
		
		ЭлементТабДок.Значение.Показать(ЭлементТабДок.Ключ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТестированиеПолучитьДанныеНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю("Необходимо записать правило");
		Возврат Новый Структура;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Правило = РеквизитФормыВЗначение("Объект");
	Правило.ХранилищеДанныеСКД = Справочники.вмс_ИсточникиДанных.ИсточникДанных("ХранилищеДанныеСКД", Объект.Ссылка);
	
	//////////////////////////////////////////////////////
	Если ЗначениеЗаполнено(ТестированиеРегистратор) Тогда
		Распоряжения = вмс_ФормированиеЗаданийКладовщикам.ПолучитьРаспоряженияДляФормированияЗадачиПоПравилу(Правило, ТестированиеРегистратор);
	Иначе
		Распоряжения = Новый Массив;
		Распоряжения.Добавить(ТестированиеРаспоряжение);
	КонецЕсли;
	ТаблицаРаспоряжений = вмс_РаботаСКоллекциями.ЗначениеВТаблицуЗначений(Распоряжения, "Ссылка");
	
	//////////////////////////////////////////////////////
	ТаблицаПлана = вмс_ФормированиеЗаданийКладовщикам.ПолучитьТаблицуПланПоРаспоряжению(Правило, Распоряжения);
	
	//////////////////////////////////////////////////////
	ТаблицаШапок = вмс_ФормированиеЗаданийКладовщикам.ПолучитьТаблицуШапокЗаданийПоРаспоряжению(Правило, Распоряжения, ТаблицаПлана);
	
	//////////////////////////////////////////////////////
	Если ТаблицаРаспоряжений <> Неопределено Тогда
		Результат.Вставить("Распоряжения", РаботаССКД.ВывестиТаблицуЗначенийВТабличныйДокумент(ТаблицаРаспоряжений));
	КонецЕсли;
	
	Если ТаблицаШапок <> Неопределено Тогда
		Результат.Вставить("Шапки", РаботаССКД.ВывестиТаблицуЗначенийВТабличныйДокумент(ТаблицаШапок));
	КонецЕсли;
	
	Если ТаблицаПлана <> Неопределено Тогда
		Результат.Вставить("План", РаботаССКД.ВывестиТаблицуЗначенийВТабличныйДокумент(ТаблицаПлана));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РедактироватьСКДЗаданияКладовщику(Команда)
	
	Распоряжение = Объект.ЗаданиеКладовщикуРаспоряжение;
	
	Если Распоряжение <> "" Тогда
		ОО = Новый ОписаниеОповещения("СохранитьНастройкиРедактораЗаданийКладовщику",ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ФормаРедакторНастроекСКД", Новый Структура("СКД", АдресДанныеСКДЗаданияКладовщику),ЭтаФорма,,,,ОО);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран документ - основание");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СохранитьНастройкиРедактораЗаданийКладовщику(АдресСхемыРедактора, ДополнительныеПараметры) Экспорт
	
	Если АдресСхемыРедактора = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СхемыКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыРедактора);
	АдресДанныеСКДЗаданияКладовщику = СохранитьСКД(СхемыКомпоновкиДанных, АдресДанныеСКДЗаданияКладовщику);
	ЭтаФорма.Модифицированность = Истина;
	
	Возврат Истина;
	
КонецФункции  

&НаКлиенте
Процедура ПосмотретьСписокДокументовПоОперации(Команда)
	Если ЭтотОбъект.Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Есть не записанные изменения. Операция не может быть выполнена");     
	ИначеЕсли ЗначениеЗаполнено(Объект.ОперацияНазначение) Тогда
		ТабДок = ПросмотрРезультатовДокументыНаСервере();     
		ТабДок.Показать();         
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран тип операции");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиОСГ(Команда)
	ОткрытьФорму("РегистрСведений.вмс_РеестрОстаточныхСроковГодности.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиРазмещения(Команда)
	ОткрытьФорму("Обработка.вмс_НастройкиМодуля.Форма.Форма", Новый Структура("ОткрытьНастройкиРазмещения"));
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРежимРедактирования(Команда)
	Объект.РасширенныйРежимРедактирования = НЕ Объект.РасширенныйРежимРедактирования;
	УправлениеЭлементамиФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РедактироватьСКД(ИмяСКД)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяСКД", ИмяСКД);
	ОО = Новый ОписаниеОповещения("ОбработчикРедактированияСКД", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.ФормаРедакторСКД", Новый Структура("СКД", ЭтаФорма["АдресДанныеСКД" + ИмяСКД]), ЭтаФорма, ,,, ОО);
	
КонецФункции

&НаСервере
Функция ОбработчикРедактированияСКД(АдресСхемыРедактора, ДополнительныеПараметры) Экспорт
	
	Если АдресСхемыРедактора = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяСКД = ДополнительныеПараметры.ИмяСКД;
	СхемыКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыРедактора);
	СохранитьСКД(СхемыКомпоновкиДанных, ЭтаФорма["АдресДанныеСКД" + ИмяСКД]);
	ЭтаФорма.Модифицированность = Истина;
	
	Если ИмяСКД="Товары" Тогда
		Объект.ЗаполнятьПлан = Истина;
		ОпределитьИспользование_Товары_ЗаполнятьПоПринятым(СхемыКомпоновкиДанных);
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОпределитьИспользование_Товары_ЗаполнятьПоПринятым(СхемыКомпоновкиДанных);
	
	Попытка
		Запрос = СхемыКомпоновкиДанных.НаборыДанных[0].Запрос;
	Исключение
		Запрос = "";
	КонецПопытки;
	
	Объект.Товары_ЗаполнятьПоПринятым = СтрНайти(Запрос, "&ТаблицаПринятыхТоваров") > 0;
	Возврат Объект.Товары_ЗаполнятьПоПринятым;
	
КонецФункции

&НаСервере
Функция ПолучитьТекущиеДанныеСКД()
	
	ДанныеСКД = Новый Структура;
	ДанныеСКД.Вставить("Основания", ПолучитьСКД(АдресДанныеСКДОснования));
	ДанныеСКД.Вставить("Шапки", ПолучитьСКД(АдресДанныеСКДШапки));
	ДанныеСКД.Вставить("Товары", ПолучитьСКД(АдресДанныеСКДТовары));
	ДанныеСКД.Вставить("КодыМаркировки", ПолучитьСКД(АдресДанныеСКДКодыМаркировки));
	ДанныеСКД.Вставить("ЗаданияКладовщику", ПолучитьСКД(АдресДанныеСКДЗаданияКладовщику));
	
	Возврат ДанныеСКД;
	
КонецФункции

&НаСервере
Функция СохранитьСКД(СхемаКомпоновки, АдресСКД)
	
	Если СхемаКомпоновки <> Неопределено Тогда
		Если ЗначениеЗаполнено(АдресСКД) Тогда
			ПоместитьВоВременноеХранилище(СхемаКомпоновки, АдресСКД);
		Иначе
			АдресСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновки, ЭтаФорма.УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат АдресСКД;
	
КонецФункции

&НаСервере
Функция ПолучитьСКД(АдресСКД)
	
	Если ЗначениеЗаполнено(АдресСКД) Тогда
		СхемаКомпоновки = ПолучитьИзВременногоХранилища(АдресСКД);
		Возврат СхемаКомпоновки;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеТестирования()
	
	Если ЭтоАдресВременногоХранилища(АдресДанныеТестирования) Тогда
		СохраненныеДанныеТестирования = ПолучитьИзВременногоХранилища(АдресДанныеТестирования);
	КонецЕсли;
	
	ДанныеТестирования = Новый Структура;
	ДанныеТестирования.Вставить("Регистратор");
	ДанныеТестирования.Вставить("Распоряжение");
	
	Если ТипЗнч(СохраненныеДанныеТестирования)=Тип("Структура") Тогда
		Для Каждого Поле Из ДанныеТестирования Цикл
			
			Если СохраненныеДанныеТестирования.Свойство(Поле.Ключ) Тогда
				ДанныеТестирования.Вставить(Поле.Ключ, СохраненныеДанныеТестирования[Поле.Ключ]);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеТестирования;
	
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеТестирования()
	
	ДанныеТестирования = ПолучитьДанныеТестирования();
	
	ЭтаФорма.ТестированиеРегистратор = ДанныеТестирования.Регистратор;
	ЭтаФорма.ТестированиеРаспоряжение = ДанныеТестирования.Распоряжение;
	
КонецФункции

&НаСервере
Функция ПоместитьДанныеТестированияВХранилище()
	
	ДанныеТестирования = ПолучитьДанныеТестирования();
	
	ДанныеТестирования.Регистратор = ЭтаФорма.ТестированиеРегистратор;
	ДанныеТестирования.Распоряжение = ЭтаФорма.ТестированиеРаспоряжение;
	
	Если ЭтоАдресВременногоХранилища(АдресДанныеТестирования) Тогда
		ПоместитьВоВременноеХранилище(ДанныеТестирования, АдресДанныеТестирования);
	Иначе
		АдресДанныеТестирования = ПоместитьВоВременноеХранилище(ДанныеТестирования, УникальныйИдентификатор);
	КонецЕсли;
	
КонецФункции

// ТУ_Алфимов 20.08.25 ++
&НаСервере
Функция ПолучитьСписокДокументовКонфигурации()
	
	Перем Строка;
	
	СписокДокументов = Новый СписокЗначений;
	ДопустимыеИменаТабличныхЧастей = Новый Массив;
	
	// ТУ_Мовчан 12.12.23 ++
	ИменаТабличныхЧастей = вмс_АдаптацияКонфигураций.ПолучитьИмяТабличнойЧасти();
	Если Тип("Массив") = ТипЗнч(ИменаТабличныхЧастей) Тогда
		Для Каждого ИмяТабличнойЧасти Из ИменаТабличныхЧастей Цикл
			ДопустимыеИменаТабличныхЧастей.Добавить(ИмяТабличнойЧасти);
		КонецЦикла;
	Иначе
		ДопустимыеИменаТабличныхЧастей.Добавить(ИменаТабличныхЧастей);
	КонецЕсли;
	// ТУ_Мовчан 12.12.23 --
	//ДопустимыеИменаТабличныхЧастей.Добавить(вмс_АдаптацияКонфигураций.ПолучитьИмяТабличнойЧасти()); 
	ДопустимыеИменаТабличныхЧастей.Добавить(вмс_АдаптацияКонфигураций.ПолучитьИмяТабличнойЧастиПродукция());
	ДопустимыеИменаТабличныхЧастей.Добавить("ДокументыОтгрузки"); //Маршрутные листы  
	
	Для каждого Строка Из Метаданные.Документы Цикл
		Если ЗначениеЗаполнено(Строка.ТабличныеЧасти) Тогда
			
			Для каждого ТабличнаяЧасть Из Строка.ТабличныеЧасти Цикл
				Если ДопустимыеИменаТабличныхЧастей.Найти(ТабличнаяЧасть.Имя) <> Неопределено Тогда
					СписокДокументов.Добавить(Строка.ПолноеИмя(), Строка.Синоним);
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокДокументов;
	
КонецФункции 

&НаСервере
Процедура РаспоряжениеКонфигураторПриИзмененииСервер()
	спрОбъект = РеквизитФормыВЗначение("Объект");
	СКДДокументы = спрОбъект.ПолучитьСКДДокументы(); 
	АдресСКДДокументы = СохранитьСКД(СКДДокументы, АдресСКДДокументы);
КонецПроцедуры 

&НаСервере
Функция СформироватьНаименование()
	МетаданныеРаспоряжения = Метаданные.НайтиПоПолномуИмени(Объект.РаспоряжениеКонфигуратор);
	Объект.Наименование = Строка(Объект.ОперацияНазначение);
	Если МетаданныеРаспоряжения <> Неопределено Тогда
		Объект.Наименование = Объект.Наименование + " (" + Строка(МетаданныеРаспоряжения) + ")";
	КонецЕсли;
КонецФункции

&НаСервере
Процедура УстановитьНастройкиСКДДокументовЗаданияКладовщику(ПостоянноеЗадание)
	
	спрОбъект = РеквизитФормыВЗначение("Объект");
	СКДДокументы = спрОбъект.ПолучитьСКДДокументы(); 
	АдресДанныеСКДЗаданияКладовщику = СохранитьСКД(СКДДокументы, АдресДанныеСКДЗаданияКладовщику);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиСКДОснованияПоУмолчаниюНаСервере()
	спрОбъект = РеквизитФормыВЗначение("Объект");
	СхемыКомпоновкиДанных = спрОбъект.ПолучитьСКДОснованияДокумента();
	АдресДанныеСКДОснования = СохранитьСКД(СхемыКомпоновкиДанных, АдресДанныеСКДОснования);
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиСКДТоварыПоУмолчаниюНаСервере()
	спрОбъект = РеквизитФормыВЗначение("Объект");
	СхемыКомпоновкиДанных = спрОбъект.ПолучитьСКДСпискаТоваровДокумента();
	АдресДанныеСКДТовары = СохранитьСКД(СхемыКомпоновкиДанных, АдресДанныеСКДТовары);
	Элементы.КнопкаРедактироватьСКДТоваров.Картинка = БиблиотекаКартинок.Информация;
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиСКДШапкиПоУмолчаниюНаСервере(знач ОперацияНазначение)
	спрОбъект = РеквизитФормыВЗначение("Объект");
	СхемыКомпоновкиДанных = спрОбъект.ПолучитьСКДШапкиДокумента(ОперацияНазначение);
	АдресСКДДокументы = СохранитьСКД(СхемыКомпоновкиДанных, АдресДанныеСКДШапки);
КонецПроцедуры 

&НаСервере
Функция ПросмотрРезультатовДокументыНаСервере()
	
	ТабДок = Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.ПолучитьДанныеПоРаспоряжению(Объект.ОперацияНазначение, ЭтотОбъект.Объект.Ссылка,, Истина);   
		
	Возврат ТабДок; 
	
КонецФункции




#Область КонструкторНастройкиПолей

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_ПриАктивизацииСтроки(Элемент)

	вмс_НастройкиПолейЗаданияКлиент1.СвойстваЭлементов_ПриАктивизацииСтроки(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	вмс_НастройкиПолейЗаданияКлиент1.СвойстваЭлементов_Выбор(ЭтаФорма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_ПередНачаломИзменения(Элемент, Отказ)

	вмс_НастройкиПолейЗаданияКлиент1.СвойстваЭлементов_ПередНачаломИзменения(ЭтаФорма, Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Значение_ПриИзменении(Элемент)

	вмс_НастройкиПолейЗаданияКлиент1.СвойстваЭлементов_Значение_ПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Значение_НачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)

	вмс_НастройкиПолейЗаданияКлиент1.СвойстваЭлементов_Значение_НачалоВыбораИзСписка(ЭтаФорма, Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Значение_ОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)

	вмс_НастройкиПолейЗаданияКлиент1.СвойстваЭлементов_Значение_ОбработкаВыбора(ЭтаФорма, Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Элементы_ПриАктивизацииСтроки(Элемент)
	
	вмс_НастройкиПолейЗаданияКлиент1.Элементы_ПриАктивизацииСтроки(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Элементы_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	вмс_НастройкиПолейЗаданияКлиент1.Элементы_ПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Элементы_Перетаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	вмс_НастройкиПолейЗаданияКлиент1.Элементы_Перетаскивание(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Элементы_ПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	вмс_НастройкиПолейЗаданияКлиент1.Элементы_ПроверкаПеретаскивания(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Элементы_ОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	вмс_НастройкиПолейЗаданияКлиент1.Элементы_ОкончаниеПеретаскивания(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Элементы_ПередУдалением(Элемент, Отказ)

	вмс_НастройкиПолейЗаданияКлиент1.Элементы_ПередУдалением(ЭтаФорма, Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаНастройкаПолей_Страницы_ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	вмс_НастройкиПолейЗаданияКлиент1.Страницы_ПриСменеСтраницы(ЭтаФорма, Элемент, ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеОбъектаНастройкиПолейЗадания(ЗаполнятьПоУмолчанию=Ложь)
	
	ФормаНастройкиПолейЗадания = ПолучитьФорму("Справочник.вмс_НастройкиПолейЗадания.ФормаОбъекта", Новый Структура("Ключ", ПолучитьСсылкуНастройкиПолейЗадания()));
	ДанныеОбъектаНастройкиПолейЗадания = ДанныеОбъектаНастройкиПолейЗаданияНаСервере(Объект, ФормаНастройкиПолейЗадания.Объект, ЗаполнятьПоУмолчанию);
	ДанныеОбъектаНастройкиПолейЗадания.Наименование = Строка(Объект.Ссылка);
	ДанныеОбъектаНастройкиПолейЗадания.Мастер = Объект.Ссылка;

	Возврат ДанныеОбъектаНастройкиПолейЗадания;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеОбъектаНастройкиПолейЗаданияНаСервере(знач Правило, знач ДанныеОбъектаНастройкиПолейЗадания, знач ЗаполнятьПоУмолчанию)
	
	// объект будет скопирован и отвязан от формы
	
	Если НЕ ЗначениеЗаполнено(ДанныеОбъектаНастройкиПолейЗадания.Ссылка) Тогда
		Если ЗаполнятьПоУмолчанию Тогда
			Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.ЗаполнитьНастройкуПолейПоУмолчанию1(Правило, ДанныеОбъектаНастройкиПолейЗадания);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеОбъектаНастройкиПолейЗадания;
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуНастройкиПолейЗадания()

	Возврат Справочники.вмс_НастройкиПолейЗадания.НайтиНастройкуПолейПоВладельцу(Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Функция СохранитьНастройкиПолей()
	
	ДанныеОбъектаНастройкиПолейЗадания = ДанныеОбъектаНастройкиПолейЗадания();
	вмс_НастройкиПолейЗаданияКлиент1.ПередЗаписью(ЭтаФорма, Ложь, Неопределено, ДанныеОбъектаНастройкиПолейЗадания);
	СохранитьНастройкиПолейНаСервере(ДанныеОбъектаНастройкиПолейЗадания);
	
КонецФункции

&НаСервереБезКонтекста
Функция СохранитьНастройкиПолейНаСервере(знач ДанныеОбъектаНастройкиПолейЗадания)
	
	ОбъектНастройкиПолейЗадания = ДанныеФормыВЗначение(ДанныеОбъектаНастройкиПолейЗадания, Тип("СправочникОбъект.вмс_НастройкиПолейЗадания"));
	ОбъектНастройкиПолейЗадания.Записать();
	
КонецФункции

#КонецОбласти





// ТУ_Алфимов 20.08.25 --         

#Область Подключаемые_команды 

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	вмс_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, Объект);
КонецПроцедуры

#КонецОбласти

//Для того, чтобы получить серверную форму, например, для добавления новых элементов формы
&НаСервере
Функция СлужебнаяФункцияВызовСервера(ПрограммныйКод, ДополнительныеПараметры=Неопределено) Экспорт
	Возврат вмс_ОбщегоНазначенияСервер.СлужебнаяФункцияВызовСервераНаФорме(ЭтаФорма, ПрограммныйКод, ДополнительныеПараметры);
КонецФункции

&НаКлиенте
Процедура СоздатьЗадание(Команда)
	СоздатьЗаданиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаданиеНаСервере()
	ПравилоОбъект = РеквизитФормыВЗначение("Объект");
	ПередЗаписьюНаСервере(Ложь, ПравилоОбъект, Неопределено);
	вмс_ФормированиеЗаданийКладовщикам.СформироватьЗаданияПоПравилу(ПравилоОбъект, ?(ЗначениеЗаполнено(ТестированиеРегистратор), ТестированиеРегистратор, Неопределено), ТестированиеРаспоряжение);
КонецПроцедуры

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница=Элементы.СтраницаНастройкиПолей Тогда
		//НастройкаПолей_ОткрытиеСтраницы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник=ЭтаФорма Тогда
		Если ИмяСобытия="НастройкаПолей_ПриИзменении" Тогда
			//НастройкаПолей_ПриИзменении(Параметр.СтандартнаяОбработка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СледующееПравилоПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

#КонецОбласти

