#Область ПрограммныйИнтерфейс

// Возвращает склады, которые используются в топологии СУС
//
// Возвращаемое значение:
//  Массив - склады, которые используются в компоненте СУС
//
Функция СкладыХраненияWMS() Экспорт 
	
	СкладыХраненияПодсистемы = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_МестаХранения.Владелец КАК Склад
		|ИЗ
		|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
		|
		|СГРУППИРОВАТЬ ПО
		|	вмс_МестаХранения.Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СкладыХраненияПодсистемы.Добавить(ВыборкаДетальныеЗаписи.Склад);
	КонецЦикла;
	
	Возврат СкладыХраненияПодсистемы;
	
КонецФункции

Функция ПолучитьЗонуПриемки(Склад) Экспорт
	Возврат Справочники.вмс_МестаХранения.ПолучитьЗонуПриемки(Склад);
КонецФункции

Функция ПолучитьЗонуОтгрузки(Склад) Экспорт
	Возврат Справочники.вмс_МестаХранения.ПолучитьЗонуОтгрузки(Склад);
КонецФункции

Функция ПолучитьЗонуСклада(Склад, ТипЯчейки) Экспорт
	Возврат Справочники.вмс_МестаХранения.ПолучитьЗонуСклада(Склад, ТипЯчейки);
КонецФункции



#КонецОбласти

