#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьНастройкиВидимостиЭлементов();
	УстановитьАктивнуюСтраницу();
	
	УстановитьСвязиВыбора();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Версия = 2;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	вмс_РаботаСФормамиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	вмс_РаботаСФормамиКлиент.ВключитьАвтоОбновлениеДокумента(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	
	Если Модифицированность Тогда
		Объект.РучныеИзменения = Истина;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	вмс_РаботаСФормамиКлиент.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	вмс_РаботаСФормамиКлиент.ПриЗакрытии(ЭтаФорма, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимостьДляИнвентаризации();
КонецПроцедуры     

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИерархияКонтейнеров

&НаКлиенте
Процедура ИерархияКонтейнеровПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//Кулалаев
	//При ручном редактировании таблицы иерархии устанавливаем признак ручного редактирования, чтобы не пересчитывать таблицу иерархии при записи.
	Объект.РучноеРедактированиеИерархии = Истина;
КонецПроцедуры     

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьДвижения(Команда)
	ВыполнитьДвиженияНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьДвиженияНаСервере()   
	
	Если Объект.ПометкаУдаления = Ложь Тогда
		
		Документ = РеквизитФормыВЗначение("Объект");
		Документ.ДополнительныеСвойства.Вставить("ОбменДанными", Истина);
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция УстановитьНастройкиВидимостиЭлементов()  
	
	//ИспользоватьКодыМаркировкиТоваров = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ИспользоватьКодыМаркировкиТоваров", Ложь); 	
	//Элементы.ОсновнаяПанельСтраницаКодыМаркировки.Видимость = ИспользоватьКодыМаркировкиТоваров; 
	//Элементы.АгрегацияКонтейнеровМаркировка.Видимость = ИспользоватьКодыМаркировкиТоваров;
	
	УстановитьВидимостьДляИнвентаризации();  
	
	//ТУ_Кошелев 14.09.23 ++
	ИспользоватьПомещения = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ИспользоватьПомещения", Ложь); 	
	Элементы.Помещение.Видимость = ИспользоватьПомещения;
	//ТУ_Кошелев 14.09.23 --
КонецФункции 

&НаСервере
Функция УстановитьВидимостьДляИнвентаризации()
	
	ЭтоОперацияИнвентаризации = Объект.ВидОперации.ЭтоИнвентаризация;
	
	Элементы.ОсновнаяПанельСтраницаТовары.Видимость = НЕ ЭтоОперацияИнвентаризации;
	Элементы.ОсновнаяПанельСтраницаТоварыПоИнвентаризации.Видимость = ЭтоОперацияИнвентаризации;
	
КонецФункции

&НаСервере
Функция УстановитьАктивнуюСтраницу()
	
	ПриоритетыТаблиц = Новый Массив;
	ПриоритетыТаблиц.Добавить("Товары");
	ПриоритетыТаблиц.Добавить("ТоварыПоИнвентаризации");
	ПриоритетыТаблиц.Добавить("АгрегацияКонтейнеров");
	ПриоритетыТаблиц.Добавить("ИерархияКонтейнеров");
	ПриоритетыТаблиц.Добавить("КодыМаркировки");
	
	Для Каждого ИмяТаблицы Из ПриоритетыТаблиц Цикл
		Если Объект[ИмяТаблицы].Количество() > 0 Тогда
			ИмяСтраницы = "ОсновнаяПанельСтраница" + ИмяТаблицы;
			Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы[ИмяСтраницы];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции


&НаСервере
Процедура УстановитьСвязиВыбора() 
	
	Если вмс_АдаптацияКонфигураций.ЭтоУТ() ИЛИ вмс_АдаптацияКонфигураций.ЭтоЕРП() Тогда 
		
		// установка связей параметров выбора
		// по владельцу характеристике
		
		Элементы.ТоварыХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый массив);
		
		Связи = Новый Массив();
		НоваяСвязь = Новый СвязьПараметраВыбора("Номенклатура", "Элементы.Товары.ТекущиеДанные.Товар");	
		Связи.Добавить(НоваяСвязь); 
		
		Элементы.ТоварыХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);
		
		
	КонецЕсли; 
	
	Если вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		
		Элементы.ТоварыХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый массив);
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы.Товары.ТекущиеДанные.Товар");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);	
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПоДвижениямОстатков(Команда)
	
	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии", Истина);
	ФормаОтчета = ПолучитьФорму("Отчет.вмс_ДвиженияТоваровВЯчейках.Форма", ПараметрыФормы);
	ФормаОтчета.Открыть();

	Отчет = ФормаОтчета.Отчет;
	ПоляОтбора = Новый Структура("Ячейка, Товар, Характеристика, Серия");
	ЗаполнитьЗначенияСвойств(ПоляОтбора, Элементы.Товары.ТекущиеДанные);
	УстановитьОтборСКД(Отчет.КомпоновщикНастроек, ПоляОтбора);
	УстановитьПериодСКД(Отчет.КомпоновщикНастроек, НачалоДня(Объект.Дата), КонецДня(Объект.Дата));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьОтборСКД(КомпоновщикНастроек, ПоляОтбора)
	
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для Каждого ПолеОтбора Из ПоляОтбора Цикл
		
		ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ПолеОтбора.Ключ);
		ЭлементОтбораНайден = Ложь;
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.ЛевоеЗначение=ПолеКомпоновки Тогда
				ЭлементОтбораНайден = Истина;
				Если ЭлементОтбора.ИдентификаторПользовательскойНастройки <> "" Тогда
					ЭлементОтбора = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЭлементОтбораНайден Тогда
			ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки;
		КонецЕсли;
		
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ПолеОтбора.Значение;
		
	КонецЦикла;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьПериодСКД(КомпоновщикНастроек, НачалоПериода, КонецПериода)
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ПараметрДанных.ИдентификаторПользовательскойНастройки <> "" Тогда
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПараметрДанных = ПользовательскийПараметр;
		КонецЕсли;
	КонецЕсли;
	
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = НачалоПериода;
	Период.ДатаОкончания = КонецПериода;
	
	ПараметрДанных.Использование = Истина;
	ПараметрДанных.Значение = Период;
	
КонецФункции


#КонецОбласти
