#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область API
Функция ВыполнитьДействие(Действие) Экспорт

	Код = Действие.Код;
	ПараметрыДействия = Действие.Параметры;

	Если Код="СозданиеОбработки" Тогда
		ДействиеСозданиеОбработки(Действие);
	ИначеЕсли Код="ЭтоСлужебныйМодуль" Тогда
		вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, Истина);
	КонецЕсли;
	
	Возврат Действие.Результат;

КонецФункции
#КонецОбласти

Функция ДействиеСозданиеОбработки(Действие)
	
	РК = вмс_РаботаСКоллекциями;

	ПараметрыИнициализации = Действие.Параметры;
	
	Если ПараметрыИнициализации.Свойство("СсылкаНаЗадание") И ПараметрыИнициализации.СсылкаНаЗадание <> Неопределено Тогда
		ВидОперации = ПараметрыИнициализации.СсылкаНаЗадание.Операция;
	ИначеЕсли ПараметрыИнициализации.Свойство("ВидОперации") И ПараметрыИнициализации.ВидОперации <> Неопределено Тогда
		ВидОперации = ПараметрыИнициализации.ВидОперации;
	Иначе
		ВызватьИсключение "Ошибка инициализации операции: не указан вид операции";
	КонецЕсли;
	
	КлассОперации = ВидОперации.КлассОперации;
	Если СтрНайти(КлассОперации, "Обработка.")=1 Тогда
		ПутьКДаннымМодуля = КлассОперации;
	ИначеЕсли СтрНайти(КлассОперации, "ВнешняяОбработка.")=1 Тогда
		ПутьКДаннымМодуля = ПолучитьНавигационнуюСсылку(ВидОперации, "КлассОперацииХранилище");
	Иначе
		ВызватьИсключение "Ошибка инициализации операции: не указан класс операции";
	КонецЕсли;
	
	// заменим основной модуль обработки
	вмс_СерверУправляемыеОбработки.ЗаменитьМодульОбработки(ПараметрыОбработки, ЭтотОбъект, ПутьКДаннымМодуля);
	СостояниеОбработки.ПутьКДаннымОсновногоМодуля = ПутьКДаннымМодуля;
	
	// выполним действия инициализации с новым основым модулем
	ДействиеСозданиеОбработки = РК.СкопироватьОбъект(Действие);
	вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(ДействиеСозданиеОбработки);
	
	Возврат вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, Истина);
	
КонецФункции

	
#КонецЕсли

