
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКонтекстФормы();
	НастроитьЭлементыФормы();
	УстановитьЗаголовокФормы();
	УстановитьУсловноеОФормление();
	РассчитатьОбщийРезультат(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("СохранитьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаРедактораОбъемПриИзменении(Элемент)
	
	РассчитатьОбщийРезультат(ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда, ДопПараметры = Неопределено) Экспорт
	
	СохранитьНаСервере();
	Закрыть(ОбщееКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбъем(Команда)
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("УстановитьЗначениеПослеВвода", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогВводаЗначения(Обработчик, , Элементы.ТаблицаРедактораКоличество.Заголовок, ОписаниеТиповЗначенияХарактеристики);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	Товар = Параметры.Товар;
	Операция = Параметры.Операция;
	Организация = Параметры.Организация;
	КлючСтрокиОперации = Параметры.КлючСтрокиОперации;
	
	ОписаниеТовара = МодульОбъекта().Товар_Прочитать(Товар);
	ТаблицаКодов = МодульОбъекта().КодыОпераций_Прочитать(Операция, КлючСтрокиОперации);
	МодульОбъекта().КодыМаркировки_Прочитать(ТаблицаКодов);
	МодульОбъекта().ПолныеКоды_Прочитать(ТаблицаКодов);
	
	ПеременнаяХарактеристика = ОписаниеТовара.ДопРеквизиты.ПеременнаяХарактеристика;
	НоминальноеКоличество = ОписаниеТовара.ДопРеквизиты.НоминальноеКоличество;
	ЕдиницаМаркировки = ОписаниеТовара.ЕдиницаМаркировки;
	ВидПродукции = ОписаниеТовара.ВидПродукции;
	
	ИспользоватьНоминальноеКоличество = (Параметры.ИспользоватьНоминальноеКоличество И ЗначениеЗаполнено(НоминальноеКоличество));
	
	Для каждого СтрКода Из ТаблицаКодов Цикл
		
		Стр = ТаблицаРедактора.Добавить();
		Стр.КлючКода = СтрКода.КлючКода;
		Стр.КодМаркировки = СтрКода.КодМаркировки;
		ОбъемИзКода = МодульОбъекта().ОбъемИзПолногоКода(СтрКода.ПолныйКод);
		Если ЗначениеЗаполнено(ОбъемИзКода) Тогда
			Стр.Количество = ОбъемИзКода;
			Стр.ЭтоЗначениеИзКода = Истина;
		Иначе
			Стр.Количество = СтрКода.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ТаблицаКодов = МодульОбъекта().Новый_ТаблицаКодов();
	Для каждого Стр Из ТаблицаРедактора Цикл
		ТаблицаКодов.Добавить().КлючКода = Стр.КлючКода;
	КонецЦикла;
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	ТаблицаКодов.Индексы.Добавить("КлючКода");
	Для каждого Стр Из ТаблицаРедактора.НайтиСтроки(Новый Структура("ЭтоЗначениеИзКода", Ложь)) Цикл
		ТаблицаКодов.Найти(Стр.КлючКода, "КлючКода").Количество = Стр.Количество;
	КонецЦикла;
	
	МодульОбъекта().ТаблицаКодов_ЗаписатьВсюИнформацию(ТаблицаКодов);
	
	Модифицированность = Ложь;
	
	ЗаписатьМетрики();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьМетрики()
	
	КоличествоКодов = 0;
	РазныеОбъемы = Новый Соответствие;
	Для каждого Стр Из ТаблицаРедактора Цикл
		Если ЗначениеЗаполнено(Стр.Количество) Тогда
			РазныеОбъемы.Вставить(Стр.Количество, Стр.Количество);
			КоличествоКодов = КоличествоКодов + 1;
		КонецЕсли;
	КонецЦикла;
	
	ДопСведения = Новый Структура;
	ДопСведения.Вставить("ВидПродукции", ВидПродукции);
	ДопСведения.Вставить("ПеременнаяХарактеристика", ПеременнаяХарактеристика);
	ДопСведения.Вставить("КоличествоКодов", КоличествоКодов);
	ДопСведения.Вставить("КоличествоРазличныхЗначений", РазныеОбъемы.Количество());
	
	Действие = МодульОбъекта().Перечисление_ДействияМетрики().ЗаписьВБазу;
	МодульОбъекта().Метрика_Функциональность_РедактированиеПеременнойХарактеристикиКодов(Организация);
	МодульОбъекта().Метрика_РедактированиеПеременнойХарактеристики(Действие, Организация, ДопСведения);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	ТипыПеременныхХарактеристик = МодульОбъекта().Перечисление_ТипыПеременныхХарактеристикТовара();
	
	Элементы.НоминальноеКоличество.Видимость = ИспользоватьНоминальноеКоличество;
	
	Элементы.ТаблицаРедактораКоличество.Заголовок = МодульОбъекта().ПредставлениеПеременнойХарактеристики(ПеременнаяХарактеристика);
	Элементы.ОбщееКоличество.Заголовок = МодульОбъекта().ПредставлениеИтогаПеременнойХарактеристики(ПеременнаяХарактеристика);
	Элементы.НоминальноеКоличество.Заголовок = МодульОбъекта().ПараметрыВСтроку(НСтр("ru='Номинальное значение, %1'"), ЕдиницаМаркировки);
	
	Знак = ДопустимыйЗнак.Неотрицательный;
	Если ПеременнаяХарактеристика <> ТипыПеременныхХарактеристик.Количество Тогда
		ЧислоРазрядов = 11;
		ЧислоРазрядовДробнойЧасти = 5;
	Иначе
		ЧислоРазрядов = 8;
		ЧислоРазрядовДробнойЧасти = 0;
	КонецЕсли;
	
	ОписаниеТиповЗначенияХарактеристики = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(ЧислоРазрядов, ЧислоРазрядовДробнойЧасти, Знак));
	Элементы.ТаблицаРедактораКоличество.ОграничениеТипа = ОписаниеТиповЗначенияХарактеристики;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Если ЗначениеЗаполнено(Товар) Тогда
		Заголовок = СокрЛП(Товар);
	Иначе
		Заголовок = НСтр("ru = 'Заполнение значения переменной характеристики'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОФормление()
	
	УстановитьОформлениеЭтоЗначениеИзКода();
	УстановитьОформлениеИспользоватьНоминальныйОбъем();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеЭтоЗначениеИзКода()
	
	ТаблицаФормы = Элементы.ТаблицаРедактора;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + "Количество");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".ЭтоЗначениеИзКода");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеИспользоватьНоминальныйОбъем()
	
	ТаблицаФормы = Элементы.ТаблицаРедактора;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + "Количество");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".Количество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользоватьНоминальноеКоличество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<номинальное значение>'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПослеВвода(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ИдСтроки Из Элементы.ТаблицаРедактора.ВыделенныеСтроки Цикл
		Стр = ТаблицаРедактора.НайтиПоИдентификатору(ИдСтроки);
		Если Не Стр.ЭтоЗначениеИзКода Тогда
			Стр.Количество = Результат;
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьОбщийРезультат(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьОбщийРезультат(Форма)
	
	Результат = 0;
	
	Для Каждого Стр Из Форма.ТаблицаРедактора Цикл
		
		Если ЗначениеЗаполнено(Стр.Количество) Тогда
			Количество = Стр.Количество;
		ИначеЕсли Форма.ИспользоватьНоминальноеКоличество Тогда
			Количество = Форма.НоминальноеКоличество;
		Иначе
			Количество = 0;
		КонецЕсли;
		
		Результат = Результат + Количество;
		
	КонецЦикла;
	
	Форма.ОбщееКоличество = Результат;
	
КонецПроцедуры

// #КонецОбласти



