
Функция ТекстОшибкиСозданияОбъекта() Экспорт
	
	Возврат Символ(1061) + Символ(1059) + Символ(1049);
	
КонецФункции

Функция ПолучитьМассивЦифр() Экспорт
	
	Возврат вмс_РаботаСКоллекциями.СтрокуВМассивПосимвольно("1234567890");
	
КонецФункции

Функция ПолучитьМассивРусскихБукв() Экспорт

	Возврат вмс_РаботаСКоллекциями.СтрокуВМассивПосимвольно("абвгдеёжзийклмнопрстуфхцчшщэыюяьъ");
	
КонецФункции

Функция ПолучитьМассивЛатинскихБукв() Экспорт

	Возврат вмс_РаботаСКоллекциями.СтрокуВМассивПосимвольно("abcdefghijklmnopqrstuvwxyz");
	
КонецФункции

Функция ПолучитьМассивДопустимыхСимволовИмениПрограммнойПеременной() Экспорт
	
	МассивДопустимыхСимволов = Новый Массив;
	
	Для Каждого Цифра Из ПолучитьМассивЦифр() Цикл
		МассивДопустимыхСимволов.Добавить(Цифра);
	КонецЦикла;
	
	Для Каждого Буква Из ПолучитьМассивРусскихБукв() Цикл
		МассивДопустимыхСимволов.Добавить(Буква);
		МассивДопустимыхСимволов.Добавить(ВРег(Буква));
	КонецЦикла;
	
	Для Каждого Буква Из ПолучитьМассивЛатинскихБукв() Цикл
		МассивДопустимыхСимволов.Добавить(Буква);
		МассивДопустимыхСимволов.Добавить(ВРег(Буква));
	КонецЦикла;
	
	МассивДопустимыхСимволов.Добавить("_");
	
	Возврат МассивДопустимыхСимволов;
	
КонецФункции

Функция ЭтоЦифровойСимвол(Символ) Экспорт
	
	Возврат ПолучитьМассивЦифр().Найти(Символ) <> Неопределено;
	
КонецФункции

Функция ПолучитьЛинейкуДляТекста() Экспорт

	ТабДокЛинейка = Новый ТабличныйДокумент;
	
	ЯчейкаЛинейка = ТабДокЛинейка.Область(2, 1);
	ЯчейкаЛинейка.Имя = "ЯчейкаЛинейка";
	ЯчейкаЛинейка.АвтоВысотаСтроки = Истина;
	ЯчейкаЛинейка.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	РисунокЛинейка = ТабДокЛинейка.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	РисунокЛинейка.Имя = "РисунокЛинейка";
	РисунокЛинейка.Расположить(ЯчейкаЛинейка);
	
	РисунокЛинейкаИсходная = ТабДокЛинейка.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	РисунокЛинейкаИсходная.Имя = "РисунокЛинейкаИсходная";
	РисунокЛинейкаИсходная.Высота = РисунокЛинейка.Высота;
	
	Возврат ТабДокЛинейка;
	
КонецФункции
