
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Возврат;
	
	//
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	КомпоновщикНастроек.Настройки, , ,
	Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	тз = Новый ТаблицаЗначений;   
	
	ПроцессорВывода.УстановитьОбъект(тз);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	//тз.НайтиСтроки(Новый Структура("ТипПоля",Тип("СправочникСсылка.Номенклатура"));
	
КонецПроцедуры
