
//ТУ_Кошелев 14.09.23 ++
&НаКлиенте
Процедура ВыбратьЯчейки(Команда) 
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборЯчеек",ЭтаФорма);
	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
	ОткрытьФорму("Справочник.вмс_МестаХранения.ФормаВыбора",ПараметрыФормы,,,,,ОписаниеВыбора);	
КонецПроцедуры         

&НаКлиенте
Процедура ОбработатьВыборЯчеек(РезультатВыбора, ДопПараметры) Экспорт 
	Если РезультатВыбора <> Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
		ЭтотОбъект, РезультатВыбора);	
		
		ПоказатьВопрос(Оповещение,"Установить помещение " + ЭтотОбъект.Объект.Наименование + " выбранным ячейкам?",
		РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да, "Подтвердите действие");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Ответ, Ячейки) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		ПослеЗакрытияВопросаНаСервере(Ячейки);
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервере  
Процедура ПослеЗакрытияВопросаНаСервере(Ячейки) 
	Для Каждого Ячейка Из Ячейки Цикл 
		ЯчейкаОбъект = Ячейка.ПолучитьОбъект();
		ЯчейкаОбъект.Помещение = ЭтотОбъект.Объект.Ссылка;
		ЯчейкаОбъект.Записать();
	КонецЦикла;	
КонецПроцедуры      
//ТУ_Кошелев 14.09.23 --       
