
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоздатьЭлементыФормы();
	УстановитьТипыЭлементов();
	ЗаполнитьСпискиВыбора();
	ЗаполнитьСпискиЗначений();
	
	Если Параметры.Свойство("ДокументУчета") И ЗначениеЗаполнено(Параметры.ДокументУчета) Тогда
		ДокументУчета = Параметры.ДокументУчета;
		ПрочитатьИнформациюПоДокументУчетаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументУчетаПриИзменении(Элемент)
	
	ПрочитатьИнформациюПоДокументУчетаНаСервере();
	НастроитьЭлементыФормы();
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСвязанныеРегистры Тогда
		ОбновитьДинамическиеСпискиСвязанныхРегистров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУчетаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МодульКлиента().ОткрытьФормуДокументаУчета(ДокументУчета, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Документ1СПриИзменении(Элемент)
	
	Документ1СПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьСкрытыеПоляПриИзменении(Элемент)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутМаркировкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(МаршрутМаркировки) Тогда
		МодульКлиента().ОткрытьФормуМаршрутаМаркировки(МаршрутМаркировки, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутМаркировкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	МодульКлиента().ОткрытьФормуОбработкиМодально("Форма_МаршрутыМаркировки_Список", Элемент, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутМаркировкиПриИзменении(Элемент)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПерезаполнитьЭтапыМаркировкиПослеСогласия", ЭтаФорма);
	ТекстВопроса = НСтр("ru='Перезаполнить этапы маркировки?'");
	
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЭтапыМаркировкиПослеСогласия(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПерезаполнитьЭтапыМаркировкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСвязанныеРегистры Тогда
		ОбновитьДинамическиеСпискиСвязанныхРегистров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСтатусаПриИзменении(Элемент)

	ИзмененСтатусДокумента = Истина;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыТоварыДокумента

&НаКлиенте
Процедура ТоварыДокументаПриАктивизацииСтроки(Элемент)
	
	ТоварыМаркировки_УстановитьОтборСтрок();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыОперации

&НаКлиенте
Процедура СписокОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Стр = СписокОпераций.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораСпособаОткрытияОперации", ЭтаФорма, Стр.Операция);
	СпособыОткрытия = МодульКлиента().СписокСпособовОткрытияЗначения();
	МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ПослеВыбора, СпособыОткрытия, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСпособаОткрытияОперации(Результат, Операция = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СпособыОткрытияЗначения = МодульКлиента().Перечисление_СпособыОткрытияЗначения();
	
	Если Результат.Представление = СпособыОткрытияЗначения.ВФормеОбъекта Тогда
		МодульКлиента().ОткрытьФормуОперации(Операция, ЭтаФорма);
	Иначе
		МодульКлиента().ОткрытьФормуРедактораОперации(Операция, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормы СвязанныеРегистры

&НаКлиенте
Процедура ДинамическийСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.Имя = Перечисление_СвязанныеРегистрыСведений().ДанныеФайлов Тогда
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораСпособаОткрытияФайлаДанныеФайлов"
		, ЭтаФорма
		, Элемент.ТекущиеДанные.Файл);
		
		СпособыОткрытия = МодульКлиента().СписокСпособовОткрытияЗначения();
		МодульКлиента().ПоказатьДиалогВыбораИзМеню(ЭтаФорма, ОписаниеОбработчика, СпособыОткрытия, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСпособаОткрытияФайлаДанныеФайлов(Результат, Файл = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СпособыОткрытияЗначения = МодульКлиента().Перечисление_СпособыОткрытияЗначения();
	
	Если Результат.Представление = СпособыОткрытияЗначения.ВФормеОбъекта Тогда
		МодульКлиента().ОткрытьФормуОбъектаИС(Файл);
	Иначе
		АдресТаблицы = ПоместитьДанныеФайлаВХранилище(Файл);
		МодульКлиента().ОткрытьФормуПросмотраТаблицы(ЭтаФорма, АдресТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписокПередУдалением(Элемент, Отказ)
	
	Если Элемент.Имя <> Перечисление_СвязанныеРегистрыСведений().ДанныеФайлов Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru='Не поддерживается для выбранного регистра'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаКодов

&НаКлиенте
Процедура ТаблицаКодовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыОтбора = ПараметрыОтбораКодовПоДаннымСтроки(Элемент.ТекущиеДанные);
	АдресТаблицы = ПоместитьКодыДокументаВХранилище(ПараметрыОтбора);
	
	МодульКлиента().ОткрытьФормуПросмотраТаблицы(ЭтаФорма, АдресТаблицы, Истина);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

// Команды ТаблицаКодов

&НаКлиенте
Процедура ОбновитьИнформациюОКодахИзИБ(Команда)
	
	ЗаполнитьИнформациюОКодахПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюИзГИСМТ(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ВыполнитьАвторизацию_ОрганизацияПоУмолчанию() Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСтатусыКодовДокументаНаСервере();
	ЗаполнитьИнформациюОКодахПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьДатуПечатиКодов(Команда)
	
	Если Не ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	СброситьДатуПечатиКодовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьДатуПечатиСОтбором(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = ПараметрыОтбораКодовПоТекущейСтроке();
	
	СброситьДатуПечатиКодовНаСервере(ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьИнформациюОКодахСОтбором(Команда)
	
	ПараметрыОтбора = ПараметрыОтбораКодовПоТекущейСтроке();
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;

	АдресТаблицыКодов = ПоместитьКодыДокументаВХранилище(ПараметрыОтбора);
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеЗавершенияРедактированияКодов", ЭтаФорма);
	
	МодульКлиента().ОткрытьФормуГрупповоеИзменениеИнформацииОКодах(ЭтаФорма, АдресТаблицыКодов, ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияРедактированияКодов(РезультатЗакрытия, ДопПараметры = Неопределено) Экспорт

	Если РезультатЗакрытия Тогда
		ЗаполнитьИнформациюОКодахПоДокументу();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасформироватьАгрегатыСОтбором(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = ПараметрыОтбораКодовПоТекущейСтроке();
	
	РасформироватьАгрегатыВДокументеУчета(ПараметрыОтбора);
	ЗаполнитьИнформациюОКодахПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереформироватьТранспортныеАгрегатыСОтбором(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПереформироватьТранспортныеАгрегатыПослеСогласия", ЭтаФорма);
	
	ТекстВопроса = НСтр("ru='Коды агрегатов SSCC будут переформированы с учетом настройки модуля.
	|Вы уверены, что хотите выполнить команду?'");
	
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереформироватьТранспортныеАгрегатыПослеСогласия(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПереформироватьТранспортныеАгрегатыИспользоватьВложенныеКоды", ЭтаФорма);
	
	ТекстВопроса = НСтр("ru='Изменить транспортные упаковки вложенных кодов?'");
	МодульКлиента().ПоказатьДиалогВопроса(ОписаниеОбработчика, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереформироватьТранспортныеАгрегатыИспользоватьВложенныеКоды(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = ПараметрыОтбораКодовПоТекущейСтроке();
	ИспользоватьВложенныеКоды = (Результат = КодВозвратаДиалога.Да);
	
	ПереформироватьТранспортныеАгрегаты(ДокументУчета, ПараметрыОтбора, ИспользоватьВложенныеКоды);
	ЗаполнитьИнформациюОКодахПоДокументу();
	
КонецПроцедуры

// Команды Группировки

&НаКлиенте
Процедура ИзменитьПараметрыГруппировкиКодов(Команда)
	
	ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеВыбораПолейГруппировкиКодов", ЭтаФорма);
	МодульКлиента().ПоказатьДиалогОтметкиЭлементовВСписке(ОписаниеОбработчика
	, ПараметрыГруппировкиКодов.Скопировать()
	, НСтр("ru='Выберите поля группировки'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПолейГруппировкиКодов(Результат, ДопПараметры = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОтмеченныеПоля = Ложь;
	
	Для Каждого ИмяПоляГруппировки Из Результат Цикл
		
		Если ИмяПоляГруппировки.Пометка Тогда
			ЕстьОтмеченныеПоля = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОтмеченныеПоля Тогда
		ПараметрыГруппировкиКодов = Результат.Скопировать();
	КонецЕсли;
	
	ЗаполнитьИнформациюОКодахПоДокументу();
	НастроитьВидимость_ТаблицаКодов();
	
КонецПроцедуры

// Команды ОсновнаяИнформация

&НаКлиенте
Процедура ОбновитьИнформациюИзИБ(Команда)
	
	ПрочитатьИнформациюПоДокументУчетаНаСервере();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	
	Если Модифицированность Тогда
		
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("СохранитьИзмененияПослеСогласия", ЭтаФорма);
		МодульКлиента().ПодтвердитьДействияТехническогоСпециалиста(ОписаниеОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияПослеСогласия(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаписатьДанныеНаСервере();
		НастроитьЭлементыФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьДокументУчета(Команда)
	
	ПерезаполнитьДокументУчетаНаСервере();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// Команды Контур.Маркировка Администратор

&НаКлиенте
Процедура ОткрытьОсновнуюФорму(Команда)
	
	МодульКлиента().ОткрытьФормуАдминистратораМаркировки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовоеСвязанноеОкно(Команда)
	
	МодульКлиента().ОткрытьФормуРедактораДокументаУчета(, ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

// ПриСозданииНаСервере

&НаСервере
Процедура СоздатьЭлементыФормы()
	
	Для Каждого КлючЗначение Из МодульОбъекта().Перечисление_ТипыСтатусов() Цикл
		СтатусыДокумента_СоздатьГруппуСтатусов(КлючЗначение.Ключ);
	КонецЦикла;
	
	Для Каждого КлючЗначение Из Перечисление_СвязанныеРегистрыСведений() Цикл
		МодульОбъекта().Форма_СоздатьДинамическийСписокРегистра(ЭтаФорма, КлючЗначение.Значение, Элементы.СтраницаСвязанныеРегистры);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыЭлементов()
	
	ОписаниеОбъектовИС = МодульОбъекта().ОписаниеОбъектовИС();
	
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.ТоварыДокументаНоменклатура, ОписаниеОбъектовИС.Номенклатура);
	Если ЗначениеЗаполнено(ОписаниеОбъектовИС.Характеристика) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.ТоварыДокументаХарактеристика, ОписаниеОбъектовИС.Характеристика);
		УстановитьСвязьХарактеристикиСНоменклатурой(Элементы.ТоварыДокументаХарактеристика);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОбъектовИС.Упаковка) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.ТоварыДокументаУпаковка, ОписаниеОбъектовИС.Упаковка);
		УстановитьСвязьУпаковкиСНоменклатурой(Элементы.ТоварыДокументаУпаковка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязьУпаковкиСНоменклатурой(Элемент)
	
	ПутьКДанным = "Элементы.ТоварыДокумента.ТекущиеДанные.Номенклатура";
	СвязиПараметров = Новый Массив;
	СвязиПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", ПутьКДанным));
	СвязиПараметров.Добавить(Новый СвязьПараметраВыбора("Номенклатура", ПутьКДанным));
	Элемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметров);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязьХарактеристикиСНоменклатурой(Элемент)
	
	ОписаниеОбъектовИС = МодульОбъекта().ОписаниеОбъектовИС();
	ПутьКРеквизиту = ОписаниеОбъектовИС.Номенклатура + ".Реквизиты.ИспользованиеХарактеристик";
	ЕстьОбщиеХарактеристики = МодульОбъекта().ЕстьНеобходимыеМетаданные(ПутьКРеквизиту);
	
	ПутьКДанным = "Элементы.ТоварыДокумента.ТекущиеДанные.Номенклатура";
	СвязиПараметров = Новый Массив;
	СвязиПараметров.Добавить(Новый СвязьПараметраВыбора("Номенклатура", ПутьКДанным));
	
	Если Не ЕстьОбщиеХарактеристики Тогда
		СвязиПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", ПутьКДанным));
	КонецЕсли;
	
	Элемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	СтатусыДокументовУчета = МодульОбъекта().Перечисление_СтатусыДокументовУчета();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ОсновнойСтатус.СписокВыбора, СтатусыДокументовУчета);
	
	ТребуемыеДействия = МодульОбъекта().Перечисление_ТребуемыеДействияДокументовУчета();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ТребуемоеДействие.СписокВыбора, ТребуемыеДействия);
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ЭтапыМаркировкиТребуемоеДействие.СписокВыбора, ТребуемыеДействия);
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ТребуемоеДействиеПоМаршруту.СписокВыбора, ТребуемыеДействия);
	
	СтатусыПроверки = МодульОбъекта().Перечисление_СтатусыПроверкиКодовДокумента();
	ДопИнформацияСтатусовПроверки = МодульОбъекта().Перечисление_ДопИнформацияСтатусовПроверкиКодовДокумента();
	Для Каждого КлючЗначение Из МодульОбъекта().Перечисление_ТипыСтатусовПроверкиКодов() Цикл
		ИмяПоляДопИнформация = МодульОбъекта().ИмяПоляДопИнформация(КлючЗначение.Ключ);
		МодульОбъекта().ЗаполнитьСписокВыбора(Элементы[КлючЗначение.Ключ].СписокВыбора, СтатусыПроверки);
		МодульОбъекта().ЗаполнитьСписокВыбора(Элементы[ИмяПоляДопИнформация].СписокВыбора, ДопИнформацияСтатусовПроверки);
	КонецЦикла;
	
	ВидыКорректировкиДокумента = МодульОбъекта().Перечисление_ВидыКорректировкиДокумента();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ВидКорректировки.СписокВыбора, ВидыКорректировкиДокумента);
	
	СпособыОтраженияВЧЗ = МодульОбъекта().Перечисление_СпособыОтраженияВЧЗ();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ЭтапыМаркировкиСпособОтражения.СписокВыбора, СпособыОтраженияВЧЗ);
	
	КлючиЭтапыМаркировки = МодульОбъекта().Перечисление_ЭтапыМаркировки();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ЭтапыМаркировкиЭтап.СписокВыбора, КлючиЭтапыМаркировки);
	
	ОтраженияВЭДО = МодульОбъекта().Перечисление_ОтраженияВЭДО();
	МодульОбъекта().ЗаполнитьСписокВыбора(Элементы.ОтражениеВЭДО.СписокВыбора, ОтраженияВЭДО);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиЗначений()
	
	ПараметрыГруппировкиКодов.Очистить();
	Для Каждого Значение Из Перечисление_ПоляГруппировкиКодов() Цикл
		ПараметрыГруппировкиКодов.Добавить(Значение, , Истина);
	КонецЦикла;
	
КонецПроцедуры

// ПриОткрытии

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	НастроитьВидимость();
	УстановитьЗаголовок();
	
	ТоварыМаркировки_УстановитьОтборСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость()
	
	Элементы.Кнопка_ПерезаполнитьДокументУчета.Доступность = ЗначениеЗаполнено(Документ1С);
	
	НастроитьВидимость_ТоварыДокумента();
	НастроитьВидимость_ТоварыМаркировки();
	НастроитьВидимость_ТаблицаКодов();

КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость_ТоварыДокумента()
	
	Для Каждого ИмяКолонки Из Перечисление_СкрываемыеПоляТоваровДокумента() Цикл 
		Элементы["ТоварыДокумента" + ИмяКолонки].Видимость = ОтображатьСкрытыеПоля;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТоварыДокумента) И Не ОтображатьСкрытыеПоля Тогда
		УстановитьВидимостьКолонкиТоварыДокумента("Характеристика");
		УстановитьВидимостьКолонкиТоварыДокумента("Упаковка");
		УстановитьВидимостьКолонкиТоварыДокумента("Серия");
		УстановитьВидимостьКолонкиТоварыДокумента("Цена");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость_ТоварыМаркировки()
	
	Для Каждого ИмяКолонки Из Перечисление_СкрываемыеПоляТоваровМаркировки() Цикл
		Элементы["ТоварыМаркировки" + ИмяКолонки].Видимость = ОтображатьСкрытыеПоля;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТоварыМаркировки) И Не ОтображатьСкрытыеПоля Тогда
		УстановитьВидимостьКолонкиТоварыМаркировки("НомерПартии");
		УстановитьВидимостьКолонкиТоварыМаркировки("Количество");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость_ТаблицаКодов()
	
	Для Каждого Колонка Из ПараметрыГруппировкиКодов Цикл
		Элементы["ТаблицаКодов" + Колонка.Значение].Видимость = Колонка.Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовок()
	
	ШаблонЗаголовка = НСтр("ru='Контур.Маркировка (Администратор) Редактор документа: %1'");
	ЭтаФорма.Заголовок = МодульКлиента().ПараметрыВСтроку(ШаблонЗаголовка, ДокументУчета);
	
КонецПроцедуры

// ТоварыДокумента

&НаСервере
Процедура ТоварыДокументы_РассчитатьИтоги()
	
	ИтогоЦена = ТоварыДокумента.Итог("Цена");
	ИтогоКоличество = ТоварыДокумента.Итог("Количество");
	ИтогоКоличествоУпаковок = ТоварыДокумента.Итог("КоличествоУпаковок");
	
КонецПроцедуры

// ТоварыМаркировки

&НаКлиенте
Процедура ТоварыМаркировки_УстановитьОтборСтрок()
	
	Если ОтображатьСкрытыеПоля Тогда
		Элементы.ТоварыМаркировки.ОтборСтрок = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаДокумента = Элементы.ТоварыДокумента.ТекущиеДанные;
	Если СтрокаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючСтрокиДокумента = СтрокаДокумента.КлючСтрокиДокумента;
	НеПодлежитМаркировке = СтрокаДокумента.НеПодлежитМаркировке;
	
	Если НеПодлежитМаркировке Тогда
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("КлючСтрокиДокумента", МодульОбъекта().ПустойУникальныйИдентификатор());
	Иначе
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("КлючСтрокиДокумента", КлючСтрокиДокумента);
	КонецЕсли;
	Элементы.ТоварыМаркировки.ОтборСтрок = ПараметрыОтбора;
	
КонецПроцедуры

// Таблица кодов

Процедура ТаблицаКодов_РассчитатьИтоги()
	
	ИтогКоличествоКодовДокумента = ТаблицаКодовДокумента.Итог("КоличествоКодов");
	
КонецПроцедуры

// ЗаполнитьКонтекстФормы

&НаСервере
Процедура ПрочитатьИнформациюПоДокументУчетаНаСервере()
	
	ЗаполнитьОсновнуюИнформацию();
	ЗаполнитьСтатусыДокумента();
	ЗаполнитьИнформациюОКодахПоДокументу();
	ЗаполнитьОперацииПоДокументу();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсновнуюИнформацию()
	
	ОписаниеДокумента = ОписаниеДокументаУчета();
	
	ЭтаФорма.ТоварыДокумента.Очистить();
	ЭтаФорма.ТоварыМаркировки.Очистить();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеДокумента,, "ТоварыМаркировки, ТоварыДокумента, ЭтапыМаркировки");
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеДокумента.ДопРеквизиты);
	
	ВерсияДанных1С = Неопределено;
	Если ЗначениеЗаполнено(Документ1С) Тогда
		ВерсияДанных1С = ЗначениеРеквизитаОбъектаЛок(Документ1С, "ВерсияДанных");
	КонецЕсли;
	
	ЭтаФорма.ТоварыДокумента.Загрузить(ОписаниеДокумента.ТоварыДокумента);
	ЭтаФорма.ТоварыМаркировки.Загрузить(ОписаниеДокумента.ТоварыМаркировки);
	
	ЭтаФорма.ЭтапыМаркировки.Очистить();
	Для Каждого Этап Из ОписаниеДокумента.ЭтапыМаркировки Цикл
		НоваяСтр = ЭтаФорма.ЭтапыМаркировки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, Этап);
		НоваяСтр.СпособыВыполнения.ЗагрузитьЗначения(Этап.СпособыВыполнения);
	КонецЦикла;
	
	ТоварыДокументы_РассчитатьИтоги();
	
	Параметры.ДокументУчета = ДокументУчета;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыДокумента()
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Новый_СтатусыДокумента());
	
	СтатусыДокумента = МодульОбъекта().СтатусыДокументаУчета_Прочитать(ДокументУчета);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтатусыДокумента);
	
	ИзмененСтатусДокумента = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОКодахПоДокументу()
	
	ЭтаФорма.ТаблицаКодовДокумента.Очистить();
	
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		ОписаниеКодов = ОписаниеКодовДокументаУчета(ПараметрыГруппировкиКодов);
		ЭтаФорма.ТаблицаКодовДокумента.Загрузить(ОписаниеКодов);
	КонецЕсли;
	
	ТаблицаКодов_РассчитатьИтоги();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОперацииПоДокументу()
	
	СписокОпераций.Очистить();
	
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		
		ТипыОпераций = МодульОбъекта().ТипыИнтерактивныхОпераций();
		СтатусыОпераций = МодульОбъекта().Перечисление_СтатусыОпераций();
		
		СписокОпераций.Загрузить(МодульОбъекта().ДокументУчета_СписокОпераций(ДокументУчета, ТипыОпераций));
		
		Для Каждого Стр Из СписокОпераций Цикл
			
			Если Стр.Статус = СтатусыОпераций.Новый Тогда
				Стр.ТребуемоеДействие = "Начать работу";
				Стр.НомерКартинки = 0;
			ИначеЕсли Стр.Статус = СтатусыОпераций.ОперацияЗавершена
				Или Стр.Статус = СтатусыОпераций.ОперацияОтменена
				Или Стр.Статус = СтатусыОпераций.ПринятЧастично Тогда
				Стр.ТребуемоеДействие = "Работа завершена";
				Стр.НомерКартинки = 4;
			ИначеЕсли Стр.Статус = СтатусыОпераций.ОшибкаЗаполнения
				Или Стр.Статус = СтатусыОпераций.ОшибкаОбработки
				Или Стр.Статус = СтатусыОпераций.ОшибкаОтменыОперации Тогда
				Стр.ТребуемоеДействие = "Исправить ошибки";
				Стр.НомерКартинки = 2;
			ИначеЕсли Стр.Статус = СтатусыОпераций.НеУдалосьРаспознатьКоды Тогда
				Стр.ТребуемоеДействие = "Редактировать список кодов";
				Стр.НомерКартинки = 3;
			Иначе
				Стр.ТребуемоеДействие = "Обрабатывается";
				Стр.НомерКартинки = 3;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	КоличествоОпераций = СписокОпераций.Количество();
	
КонецПроцедуры

// ПроцедурыИФункцииОбработки

&НаКлиенте
Функция ПараметрыОтбораКодовПоТекущейСтроке()
	
	ТекущиеДанные = Элементы.ТаблицаКодовДокумента.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПараметрыОтбораКодовПоДаннымСтроки(ТекущиеДанные);
	
КонецФункции

&НаКлиенте
Функция ПараметрыОтбораКодовПоДаннымСтроки(ТекущиеДанные)
	
	ИменаПолейГруппировки = Новый Массив;
	
	Для Каждого ИмяПоля Из ПараметрыГруппировкиКодов Цикл
		
		Если ИмяПоля.Пометка Тогда
			ИменаПолейГруппировки.Добавить(ИмяПоля.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура(МодульКлиента().СоединитьСтроку(ИменаПолейГруппировки, ","));
	ЗаполнитьЗначенияСвойств(Результат, ТекущиеДанные);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПерезаполнитьДокументУчетаНаСервере()
	
	МодульОбъекта().ПерезаполнитьДокументУчета(ДокументУчета, Документ1С);
	ПрочитатьИнформациюПоДокументУчетаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()

	ОписаниеДокумента = МодульОбъекта().ДокументУчета_ПрочитатьДокумент(ДокументУчета);
	
	ОписаниеДокумента.Ссылка = ДокументУчета;
	
	ЗаполнитьЗначенияСвойств(ОписаниеДокумента, ЭтаФорма,, "ТоварыМаркировки, ТоварыДокумента, ЭтапыМаркировки");
	ЗаполнитьЗначенияСвойств(ОписаниеДокумента.ДопРеквизиты, ЭтаФорма);
	
	ОписаниеДокумента.ТоварыДокумента.Очистить();
	Для Каждого Стр Из ТоварыДокумента Цикл
		ЗаполнитьЗначенияСвойств(ОписаниеДокумента.ТоварыДокумента.Добавить(), Стр,, "КлючНоменклатуры1С");
	КонецЦикла;
	
	ОписаниеДокумента.ТоварыМаркировки.Очистить();
	Для Каждого Стр Из ТоварыМаркировки Цикл
		ЗаполнитьЗначенияСвойств(ОписаниеДокумента.ТоварыМаркировки.Добавить(), Стр);
	КонецЦикла;
	
	ОписаниеДокумента.ЭтапыМаркировки.Очистить();
	Для Каждого Стр Из ЭтапыМаркировки Цикл
		НоваяСтр = ОписаниеДокумента.ЭтапыМаркировки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, Стр,, "СпособыВыполнения");
		НоваяСтр.СпособыВыполнения = Стр.СпособыВыполнения.ВыгрузитьЗначения();
	КонецЦикла;
	
	МодульОбъекта().ДокументУчета_Записать(ОписаниеДокумента);
	
	Если ИзмененСтатусДокумента Тогда
		СтатусыДокумента = Новый_СтатусыДокумента();
		ЗаполнитьЗначенияСвойств(СтатусыДокумента, ЭтаФорма);
		МодульОбъекта().СтатусыДокументаУчета_Записать(ДокументУчета, СтатусыДокумента);
	КонецЕсли;
	
	ПрочитатьИнформациюПоДокументУчетаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонкиТоварыДокумента(ИмяКолонки)
	
	ЕстьЗначения = Ложь;
	
	Для Каждого Стр Из ТоварыДокумента Цикл
		Если ЗначениеЗаполнено(Стр[ИмяКолонки]) Тогда
			ЕстьЗначения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы["ТоварыДокумента" + ИмяКолонки].Видимость = ЕстьЗначения;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонкиТоварыМаркировки(ИмяКолонки)
	
	ЕстьЗначения = Ложь;
	
	Для Каждого Стр Из ТоварыМаркировки Цикл
		Если ЗначениеЗаполнено(Стр[ИмяКолонки]) Тогда
			ЕстьЗначения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы["ТоварыМаркировки" + ИмяКолонки].Видимость = ЕстьЗначения;
	
КонецПроцедуры

&НаСервере
Процедура Документ1СПриИзмененииНаСервере()
	
	ОписаниеДокумента1С = МодульОбъекта().ОписаниеДокумента1СВМаркировке(Документ1С);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеДокумента1С);
	
КонецПроцедуры

&НаСервере
Функция ОписаниеДокументаУчета() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат МодульОбъекта().Новый_ДокументУчета();
	КонецЕсли;
	
	ОписаниеДокумента = МодульОбъекта().ДокументУчета_ПрочитатьДокумент(ДокументУчета);
	ОписаниеДокументаУчета_ДобавитьИнформациюКоличествоКодов(ОписаниеДокумента);
	
	Возврат ОписаниеДокумента;
	
КонецФункции

&НаСервере
Функция ОписаниеКодовДокументаУчета(ПараметрыГруппировки = Неопределено)

	Результат = МодульОбъекта().ТаблицаКодовДокумента(ДокументУчета);
	ТаблицаКодов_ЗаполнитьКоличествоВложенныхКодов(Результат);
	
	Если ЗначениеЗаполнено(ПараметрыГруппировки) Тогда
		
		ПоляГруппировки = Новый Массив;
		
		Для Каждого ПолеГруппировки Из ПараметрыГруппировки Цикл
			
			Если ПолеГруппировки.Пометка Тогда
				ПоляГруппировки.Добавить(ПолеГруппировки.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		ПоляГруппировки = Перечисление_ПоляГруппировкиКодов();
	КонецЕсли;
	
	Результат.Свернуть(МодульОбъекта().СоединитьСтроку(ПоляГруппировки, ","), 
	МодульОбъекта().СоединитьСтроку(Перечисление_ИменаКолонокСчетчиков(), ","));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СброситьДатуПечатиКодовНаСервере(ПараметрыОтбора = Неопределено)

	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКодов = МодульОбъекта().ТаблицаКодовДокумента(ДокументУчета);
	
	Если ЗначениеЗаполнено(ПараметрыОтбора) Тогда
		ПараметрыОтбора_ВосстановитьТипы(ПараметрыОтбора);
		ТаблицаКодовДокумента = ТаблицаКодов.Скопировать(ПараметрыОтбора);
	КонецЕсли;
	
	КодыМаркировки = ТаблицаКодов.ВыгрузитьКолонку("КодМаркировки");
	
	Если ЗначениеЗаполнено(КодыМаркировки) Тогда
		МодульОбъекта().ОчиститьИнформациюОКодах(КодыМаркировки, "ДатаПечати");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьКодыДокументаВХранилище(ПараметрыОтбора = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат ПоместитьВоВременноеХранилище(МодульОбъекта().ТаблицаНовыхКодов(), ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	ТаблицаКодов = МодульОбъекта().ТаблицаКодовДокумента(ДокументУчета);
	Если ЗначениеЗаполнено(ПараметрыОтбора) Тогда
		ПараметрыОтбора_ВосстановитьТипы(ПараметрыОтбора);
		ТаблицаКодов = ТаблицаКодов.Скопировать(ПараметрыОтбора);
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаКодов, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура РасформироватьАгрегатыВДокументеУчета(ПараметрыОтбора = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКодов = МодульОбъекта().ТаблицаКодовДокумента(ДокументУчета);
	
	Если ЗначениеЗаполнено(ПараметрыОтбора) Тогда
		ПараметрыОтбора_ВосстановитьТипы(ПараметрыОтбора);
		ТаблицаКодов = ТаблицаКодов.Скопировать(ПараметрыОтбора);
	КонецЕсли;
	
	Для Каждого Стр Из ТаблицаКодов Цикл
		
		Если Стр.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ЕдиницаТовара Тогда
			Продолжить;
		КонецЕсли;
		
		МодульОбъекта().КодыМаркировки_РасформироватьАгрегат(Стр.КлючКода);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеДокумента1СВМаркировке(Документ1С)
	
	Результат = НовоеОписаниеДокумента1С();
	
	Если ЗначениеЗаполнено(Документ1С) Тогда
		
		Результат.Документ1С 		= Документ1С;
		Результат.ТипДокумента 		= Документ1С.Метаданные().Имя;
		Результат.ВерсияДанных1С 	= ЗначениеРеквизитаОбъектаЛок(Документ1С, "ВерсияДанных");
		
		Результат.КлючДокумента1С 		= МодульОбъекта().КлючОбъекта1С(Документ1С);
		Результат.ТипКлючаДокумента1С 	= МодульОбъекта().ТипКлючаОбъекта1С(Документ1С);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НовоеОписаниеДокумента1С()
	
	Результат = Новый Структура;
	Результат.Вставить("Документ1С");
	Результат.Вставить("ВерсияДанных1С");
	Результат.Вставить("ТипДокумента");
	Результат.Вставить("КлючДокумента1С");
	Результат.Вставить("ТипКлючаДокумента1С");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПереформироватьТранспортныеАгрегаты(ДокументУчета, ПараметрыОтбора, ИспользоватьВложенныеКоды)
	
	ИспользоватьSSCC18 = МодульОбъекта().НастройкиМодуля().ИспользоватьSSCC18;
	
	ТаблицаКодов = МодульОбъекта().КодыДокументов_Прочитать(ДокументУчета);
	МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	
	Если ЗначениеЗаполнено(ПараметрыОтбора) Тогда
		ПараметрыОтбора_ВосстановитьТипы(ПараметрыОтбора);
		ТаблицаКодов = ТаблицаКодов.Скопировать(ПараметрыОтбора);
	КонецЕсли;
	
	Если ИспользоватьВложенныеКоды Тогда
		МодульОбъекта().ДобавитьВсеВложенныеКодыВТаблицуКодов(ТаблицаКодов);
		МодульОбъекта().ТаблицаКодов_ПрочитатьВсюИнформацию(ТаблицаКодов);
	КонецЕсли;
	
	ДлинаКода18 = 18;
	ЛидирующиеНули = "00";
	ДлинаКодаПереформирования = 18;
	Если ИспользоватьSSCC18 Тогда
		ДлинаКодаПереформирования = 20;
	КонецЕсли;
	
	СтрокиДляЗаписи = Новый Массив;
	ОтборТранспортныхКодов = Новый Структура("ТипШтрихкода", Перечисления.КонтурМаркировка_ТипыШтрихкодов.SSCC);
	
	Для Каждого Стр Из ТаблицаКодов.НайтиСтроки(ОтборТранспортныхКодов) Цикл
		
		Если СтрДлина(Стр.КодМаркировки) = ДлинаКодаПереформирования Тогда
			
			Если ИспользоватьSSCC18 Тогда
				НовыйКодАгрегата = Прав(Стр.КодМаркировки, ДлинаКода18);
			Иначе
				НовыйКодАгрегата = ЛидирующиеНули + Стр.КодМаркировки;
			КонецЕсли;
			
			Стр.КодМаркировки = НовыйКодАгрегата;
			Стр.ПолныйКод = НовыйКодАгрегата;
			
			СтрокиДляЗаписи.Добавить(Стр);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(СтрокиДляЗаписи) Тогда
		ТекстСообщения = НСтр("ru='Не найдены подходящие коды для переформирования.'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	НоваяТаблицаКодов = ТаблицаКодов.Скопировать(СтрокиДляЗаписи);
	НоваяТаблицаКодов.ЗаполнитьЗначения("", "ХешСуммаКодаМаркировки");
	МодульОбъекта().ТаблицаКодов_ЗаписатьВсюИнформацию(НоваяТаблицаКодов);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЭтапыМаркировкиНаСервере()
	
	ЭтапыМаркировки.Очистить();
	
	Если Не ЗначениеЗаполнено(МаршрутМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеМаршрута = МодульОбъекта().МаршрутМаркировки_Прочитать(МаршрутМаркировки);
	Для Каждого Стр Из ОписаниеМаршрута.ЭтапыМаркировки Цикл
		ЗаполнитьЗначенияСвойств(ЭтапыМаркировки.Добавить(), Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОписаниеДокументаУчета_ДобавитьИнформациюКоличествоКодов(ОписаниеДокумента)
	
	ОписаниеДокумента.ТоварыДокумента.Колонки.Добавить("КоличествоКодов");
	
	КоличествоКодовДокумента = МодульОбъекта().КодыДокументов_КоличествоКодовПоСтрокам(ОписаниеДокумента.Ссылка);
	
	Для Каждого Стр Из ОписаниеДокумента.ТоварыДокумента Цикл
		
		СтрКоличество = КоличествоКодовДокумента.Найти(Стр.КлючСтрокиДокумента, "КлючСтрокиДокумента");
		
		Если ЗначениеЗаполнено(СтрКоличество) Тогда
			Стр.КоличествоКодов = СтрКоличество.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаКодов_ЗаполнитьКоличествоВложенныхКодов(ТаблицаКодов)
	
	ТаблицаКодов_ДобавитьКолонкиСчетчиков(ТаблицаКодов);
	
	ТаблицаВложенныхКодов = ТаблицаКодов.Скопировать();
	МодульОбъекта().ДобавитьВсеВложенныеКодыВТаблицуКодов(ТаблицаВложенныхКодов);
	
	Индексы = ТаблицаВложенныхКодов.Индексы.Добавить("КлючАгрегата");
	
	Для Каждого Стр Из ТаблицаКодов Цикл
		
		Если Стр.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ЕдиницаТовара Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаКодов_ЗаполнитьВложенныеКодыАгрегата(Стр, Стр.КлючКода, ТаблицаВложенныхКодов);
		
	КонецЦикла;
	
	ТаблицаВложенныхКодов.Индексы.Удалить(Индексы);
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаКодов_ЗаполнитьВложенныеКодыАгрегата(ВерхнеУровневыйАгрегат, КлючТекущегоАгрегата, ТаблицаКодов)

	ВложенныеКоды = ТаблицаКодов.НайтиСтроки(Новый Структура("КлючАгрегата", КлючТекущегоАгрегата));
	
	Для Каждого Стр Из ВложенныеКоды Цикл

		Если Стр.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ЕдиницаТовара Тогда
			ВерхнеУровневыйАгрегат.КоличествоВложенныхКИЗ = ВерхнеУровневыйАгрегат.КоличествоВложенныхКИЗ + 1;
		ИначеЕсли Стр.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ГрупповаяУпаковка Тогда
			ВерхнеУровневыйАгрегат.КоличествоВложенныхКИГУ = ВерхнеУровневыйАгрегат.КоличествоВложенныхКИГУ + 1;
			ТаблицаКодов_ЗаполнитьВложенныеКодыАгрегата(ВерхнеУровневыйАгрегат, Стр.КлючКода, ТаблицаКодов);
		ИначеЕсли Стр.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.ТранспортнаяУпаковка Тогда
			ВерхнеУровневыйАгрегат.КоличествоВложенныхКИТУ = ВерхнеУровневыйАгрегат.КоличествоВложенныхКИТУ + 1;
			ТаблицаКодов_ЗаполнитьВложенныеКодыАгрегата(ВерхнеУровневыйАгрегат, Стр.КлючКода, ТаблицаКодов);
		ИначеЕсли Стр.ОбщийТипУпаковки = Перечисления.КонтурМаркировка_ОбщиеТипыУпаковок.Набор Тогда
			ВерхнеУровневыйАгрегат.КоличествоВложенныхНаборов = ВерхнеУровневыйАгрегат.КоличествоВложенныхНаборов + 1;
			ТаблицаКодов_ЗаполнитьВложенныеКодыАгрегата(ВерхнеУровневыйАгрегат, Стр.КлючКода, ТаблицаКодов);
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаКодов_ДобавитьКолонкиСчетчиков(ТаблицаКодов)
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	Для Каждого ИмяКолонки Из Перечисление_ИменаКолонокСчетчиков() Цикл
		ТаблицаКодов.Колонки.Добавить(ИмяКолонки, ТипЧисло);
	КонецЦикла;
	
	ТаблицаКодов.ЗаполнитьЗначения(0, "КоличествоВложенныхКИТУ, КоличествоВложенныхКИГУ, КоличествоВложенныхКИЗ, КоличествоВложенныхНаборов");
	ТаблицаКодов.ЗаполнитьЗначения(1, "КоличествоКодов");
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыОтбора_ВосстановитьТипы(ПараметрыОтбора)
	
	Если ПараметрыОтбора.Свойство("КлючСтрокиДокумента") 
		И ЗначениеЗаполнено(ПараметрыОтбора.КлючСтрокиДокумента)
		И ТипЗнч(ПараметрыОтбора.КлючСтрокиДокумента) <> Тип("УникальныйИдентификатор") Тогда
		
		ПараметрыОтбора.КлючСтрокиДокумента = Новый УникальныйИдентификатор(ПараметрыОтбора.КлючСтрокиДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДинамическиеСпискиСвязанныхРегистров()
	
	УстановитьОтборыДинамическихСписков();
	
	Для Каждого КлючЗначение Из Перечисление_СвязанныеРегистрыСведений() Цикл
		Элементы[КлючЗначение.Значение].Обновить();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыДинамическихСписков()
	
	ВидСравненияРавно = ВидСравненияКомпоновкиДанных.Равно;
	СвязанныеРегистры = Перечисление_СвязанныеРегистрыСведений();
	
	ИмяДинамическогоСписка = СвязанныеРегистры.КоличествоКодовДокументов;
	МодульОбъекта().Форма_УстановитьОтборДинамическогоСписка(ЭтаФорма, ИмяДинамическогоСписка, "ДокументУчета", ВидСравненияРавно, ДокументУчета);
	
	ИмяДинамическогоСписка = СвязанныеРегистры.ДанныеФайлов;
	МодульОбъекта().Форма_УстановитьОтборДинамическогоСписка(ЭтаФорма, ИмяДинамическогоСписка
	, "Файл.ВладелецФайла"
	, ВидСравненияРавно
	, ДокументУчета);
	
	ИмяДинамическогоСписка = СвязанныеРегистры.СтатусыДокументовУчета;
	МодульОбъекта().Форма_УстановитьОтборДинамическогоСписка(ЭтаФорма, ИмяДинамическогоСписка
	, "ДокументУчета"
	, ВидСравненияРавно
	, ДокументУчета);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеФайлаВХранилище(Файл)
	
	ОписаниеФайла = МодульОбъекта().Файл_Прочитать(Файл);
	
	Если ТипЗнч(ОписаниеФайла.ДанныеФайла) = Тип("Структура") И ОписаниеФайла.ДанныеФайла.Свойство("ТаблицаКодов") Тогда
		ДанныеФайла = ОписаниеФайла.ДанныеФайла.ТаблицаКодов;
	ИначеЕсли ТипЗнч(ОписаниеФайла.ДанныеФайла) = Тип("ТаблицаЗначений") Тогда
		ДанныеФайла = ОписаниеФайла.ДанныеФайла;
	Иначе
		ТекстОшибки = НСтр("ru='Неизвестный тип файла для просмотра таблицы значений'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Результат = ПоместитьВоВременноеХранилище(ДанныеФайла, ЭтаФорма.УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СтатусыДокумента_СоздатьГруппуСтатусов(ИмяПоляТипСтатуса)
	
	// BSLLS:MagicNumber-off
	ОписаниеТипаСтрока_250 = МодульОбъекта().ОписаниеТипа_Строка(250);
	ОписаниеТипаСтрока_50 = МодульОбъекта().ОписаниеТипа_Строка(50);
	// BSLLS:MagicNumber-on
	ОписаниеТипаДата = МодульОбъекта().ОписаниеТипа_Дата();
	
	ИмяПоляДопИнформация = МодульОбъекта().ИмяПоляДопИнформация(ИмяПоляТипСтатуса);
	ИмяПоляДатаСтатуса = МодульОбъекта().ИмяПоляДатаСтатуса(ИмяПоляТипСтатуса);
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяПоляДатаСтатуса, ОписаниеТипаДата,, ИмяПоляДатаСтатуса));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяПоляТипСтатуса, ОписаниеТипаСтрока_50,, ИмяПоляТипСтатуса, Истина));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяПоляДопИнформация, ОписаниеТипаСтрока_250,, ИмяПоляДопИнформация, Истина));
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ПрефиксГруппыТипСтатуса = "ТипСтатуса_";
	
	ОбщаяГруппа = Элементы.Добавить(ПрефиксГруппыТипСтатуса + ИмяПоляТипСтатуса, Тип("ГруппаФормы"), Элементы.СтраницаСтатусыДокумента);
	ОбщаяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ОбщаяГруппа.Заголовок = ИмяПоляТипСтатуса;
	ОбщаяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлементСтатус = Элементы.Добавить(ИмяПоляТипСтатуса, Тип("ПолеФормы"), ОбщаяГруппа);
	ЭлементСтатус.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСтатус.Заголовок = НСтр("ru='Статус'");
	ЭлементСтатус.РежимВыбораИзСписка = Истина;
	ЭлементСтатус.ПутьКДанным = ИмяПоляТипСтатуса;
	
	ЭлементДата = Элементы.Добавить(ИмяПоляДатаСтатуса, Тип("ПолеФормы"), ОбщаяГруппа);
	ЭлементДата.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементДата.Заголовок = НСтр("ru='Дата статуса'");
	ЭлементДата.ТолькоПросмотр = Истина;
	ЭлементДата.ПутьКДанным = ИмяПоляДатаСтатуса;
	
	ЭлементДопИнформация = Элементы.Добавить(ИмяПоляДопИнформация, Тип("ПолеФормы"), ОбщаяГруппа);
	ЭлементДопИнформация.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементДопИнформация.Заголовок = НСтр("ru='Доп.информация'");
	ЭлементДопИнформация.РежимВыбораИзСписка = Истина;
	ЭлементДопИнформация.ПутьКДанным = ИмяПоляДопИнформация;
	
	ЭлементСтатус.УстановитьДействие("ПриИзменении", "ДанныеСтатусаПриИзменении");
	ЭлементДопИнформация.УстановитьДействие("ПриИзменении", "ДанныеСтатусаПриИзменении");
	
КонецПроцедуры

Функция Новый_СтатусыДокумента()
	
	Результат = Новый Структура;
	
	Для Каждого КлючЗначение Из МодульОбъекта().Перечисление_ТипыСтатусов() Цикл
		
		Результат.Вставить(КлючЗначение.Ключ);
		Результат.Вставить(МодульОбъекта().ИмяПоляДатаСтатуса(КлючЗначение.Ключ));
		Результат.Вставить(МодульОбъекта().ИмяПоляДопИнформация(КлючЗначение.Ключ));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// МодульМаркировки

&НаСервере
Функция ЗначенияПолейПоУмолчанию()
	
	Возврат МодульОбъекта().ЗначенияПолейПоУмолчанию();
	
КонецФункции

&НаСервере
Процедура ОбновитьСтатусыКодовДокументаНаСервере()

	МодульОбъекта().ОбновитьСтатусыКодовДокумента(ДокументУчета);
	
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаОбъектаЛок(Ссылка, ИмяРеквизита)

	Возврат МодульОбъекта().ЗначениеРеквизитаОбъектаЛок(Ссылка, ИмяРеквизита);

КонецФункции

// Перечисления

&НаСервере
Функция Перечисление_ИменаКолонокСчетчиков()

	Результат = Новый Массив;
	Результат.Добавить("КоличествоВложенныхКИТУ");
	Результат.Добавить("КоличествоВложенныхНаборов");
	Результат.Добавить("КоличествоВложенныхКИГУ");
	Результат.Добавить("КоличествоВложенныхКИЗ");
	Результат.Добавить("КоличествоКодов");
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

&НаСервере
Функция Перечисление_ПоляГруппировкиКодов()

	Результат = Новый Массив;
	Результат.Добавить("КлючСтрокиДокумента");
	Результат.Добавить("КлючНоменклатуры1С");
	Результат.Добавить("Товар");
	Результат.Добавить("ДатаПроизводства");
	Результат.Добавить("ДатаСрокаГодности");
	Результат.Добавить("НомерПартии");
	Результат.Добавить("ИдентификаторВСД");
	Результат.Добавить("Статус");
	Результат.Добавить("СтатусПроверкиРД");
	Результат.Добавить("ОбщийТипУпаковки");
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

&НаСервере
Функция Перечисление_СвязанныеРегистрыСведений()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеФайлов", "КонтурМаркировка_ДанныеФайлов");
	Результат.Вставить("КоличествоКодовДокументов", "КонтурМаркировка_КоличествоКодовДокументов");
	Результат.Вставить("СтатусыДокументовУчета", "КонтурМаркировка_СтатусыДокументовУчета");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Перечисление_СкрываемыеПоляТоваровДокумента()
	
	Результат = Новый Массив;
	Результат.Добавить("Характеристика");
	Результат.Добавить("Упаковка");
	Результат.Добавить("Серия");
	Результат.Добавить("Цена");
	Результат.Добавить("Коэффициент");
	Результат.Добавить("НеПодлежитМаркировке");
	Результат.Добавить("КлючНоменклатуры1С");
	Результат.Добавить("КлючСтрокиДокумента");
	Результат.Добавить("ПредставлениеСтроки");
	Результат.Добавить("НомерСтрокиДокумента");
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

&НаСервере
Функция Перечисление_СкрываемыеПоляТоваровМаркировки()

	Результат = Новый Массив;
	Результат.Добавить("КлючСтрокиДокумента");
	Результат.Добавить("НомерПартии");
	Результат.Добавить("Количество");
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

// МодульКлиента

&НаКлиенте
Функция ВыполнитьАвторизацию_ОрганизацияПоУмолчанию()
	
	Результат = Ложь;
	
	ЗначенияПоУмолчанию = ЗначенияПолейПоУмолчанию();
	Организация = ЗначенияПоУмолчанию.Организация;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Результат = ВыполнитьАвторизацию(Организация);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьАвторизацию(Организация)
	
	Возврат МодульКлиента().ВыполнитьАвторизацию(Организация, МодульКлиента());
	
КонецФункции

&НаКлиенте
Процедура ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат)
	
	МодульКлиента().ВызватьОбработчикОповещения(ОписаниеОбработчика, Результат);
	
КонецПроцедуры


