
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НаборыДанныхСкд = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных;
	ТекстЗапроса = НаборыДанныхСкд.НаборДанных1.Запрос;
	
	НаборыДанныхСкд.НаборДанных1.Запрос = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки", вмс_АдаптацияКонфигураций.ТекстЗапросаОбъемНоменклатуры("&Упаковка", "ОстаткиЯчейки.Номенклатура"));
		
	Настройки = КомпоновщикНастроек.Настройки;
	ЭД = Настройки.ПараметрыДанных.Элементы.Найти("Упаковка");
	ЭД.Значение = вмс_АдаптацияКонфигураций.ПустаяУпаковка();
	ЭД.Использование = Истина;
	
КонецПроцедуры
