

&НаКлиенте
Процедура Печать(Команда)
	ПечатныеФормы = Элементы.Список.ВыделенныеСтроки;
	
	Для каждого ДанныеПечати Из ПечатныеФормы Цикл
		ТабличныйДокумент = ПолучитьТабличныйДокументПечати(ДанныеПечати);
		Если ТабличныйДокумент <> Неопределено Тогда
			ТабличныйДокумент.Показать();	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьТабличныйДокументПечати(ДанныеПечати)
	МенеджерЗаписи = РегистрыСведений.ОчередьПечати.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеПечати); 
	МенеджерЗаписи.Прочитать();
	
	ТабличныйДокумент = МенеджерЗаписи.Хранилище.Получить();
	Возврат ТабличныйДокумент;
КонецФункции


