#Область ДОКУМЕНТЫ




Функция ИмяТабличнойЧастиПоУмолчанию() Экспорт
	
	Возврат вмс_РаботаСКоллекциями.СтрокуВМассив("Товары");
	
КонецФункции  

Функция ИмяТабличнойЧастиПроизводство() Экспорт
	
	Возврат "Продукция";
	
КонецФункции 

Функция ИмяБазовогоДокумента() Экспорт
	//3.2.4 - исправлено на правильный тип
	Возврат "Документ.РасходнаяНакладная";
		
КонецФункции 

Функция ИмяПриходногоДокумента() Экспорт
	//3.2.4 - исправлено на правильный тип
	Возврат "ПриходнаяНакладная";
	
КонецФункции 

// ТУ_Васильев 25.04.25 ++
Функция ДозаполнитьДокумент(Документ) Экспорт    
		Возврат Документ;
КонецФункции	
// ТУ_Васильев 25.04.25 -- 



#КонецОбласти

#Область СПРАВОЧНИКИ


Функция ИмяСправочникаСерии() Экспорт
	Возврат Неопределено;
КонецФункции

Функция ИспользуютсяХарактеристики() Экспорт
	Возврат Ложь;
КонецФункции

Функция ИспользуютсяСерии() Экспорт
	Возврат Ложь;
КонецФункции

// Мовчан 20.03.23++
Функция ИмяКолонкиХарактеристика() Экспорт
	
	Возврат вмс_АдаптацияКонфигурацийУТ.ИмяКолонкиХарактеристика();
		
КонецФункции 

Функция ИмяКолонкиФизЛицо() Экспорт
	
	Возврат вмс_АдаптацияКонфигурацийУТ.ИмяКолонкиФизЛицо();
		
КонецФункции

Функция ИмяКолонкиФайлКартинки() Экспорт
	
	Возврат вмс_АдаптацияКонфигурацийУТ.ИмяКолонкиФайлКартинки();
		
КонецФункции 

Функция ИмяСправочникаНоменклатураПрисоединенныеФайлы() Экспорт
	
	Возврат вмс_АдаптацияКонфигурацийУТ.ИмяСправочникаНоменклатураПрисоединенныеФайлы();
		
КонецФункции
// Мовчан 20.03.23--

Функция ПустаяХарактеристика() Экспорт
	//Не используются
	Возврат "";
КонецФункции

#КонецОбласти

#Область СКЛАДЫ



Функция ИмяСправочникаСклады() Экспорт
	
	Возврат "Склады";
		
КонецФункции

Функция ИмяСкладаЗапрос() Экспорт
	
	Возврат вмс_РаботаСКоллекциями.СтрокуВМассив("Склад");
		
КонецФункции

//@skip-check module-unused-method
Функция ТипОптовогоСклада() Экспорт
	
	//@skip-check wrong-string-literal-content
	Возврат ПредопределенноеЗначение("Перечисление.ТипыСкладов.ОптовыйСклад");
	
КонецФункции
 
//@skip-check module-unused-method
Функция ИмяПараметраТипСклада() Экспорт
	
	Возврат вмс_АдаптацияКонфигурацийУТ.ИмяПараметраТипСклада();
		
КонецФункции

Функция ПустойСклад() Экспорт
	
	Возврат Справочники.Склады.ПустаяСсылка();
		
КонецФункции



#КонецОбласти

#Область УПАКОВКИ



Функция ИмяСправочникаУпаковки() Экспорт
	Возврат "Справочник.КлассификаторЕдиницИзмерения";
КонецФункции

Функция ИмяТипаСправочникаУпаковки() Экспорт
	Возврат "СправочникСсылка.КлассификаторЕдиницИзмерения";		
КонецФункции

Функция КоэффициентУпаковки(Упаковка, Номенклатура) Экспорт
	
	Возврат 1;

КонецФункции

Функция ПустаяУпаковка() Экспорт
	Возврат Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
КонецФункции

Функция ТекстЗапросаОбъемНоменклатуры(ИсточникУпаковки = "", ИсточникНоменклатуры = "") Экспорт
	Возврат "1";
КонецФункции

Функция ТекстЗапросаВесНоменклатуры(ИсточникУпаковки = "", ИсточникНоменклатуры = "") Экспорт
	Возврат "1";
КонецФункции

Функция ИмяКолонкиЕдиницыИзмерения() Экспорт
	
	Возврат "ЕдиницаИзмерения";
		
КонецФункции 

Функция ИмяРеквизитаНоменклатурыЕдиницаИзмерения() Экспорт
	
	Возврат "ЕдиницаИзмерения";
		
КонецФункции

Функция ВесОбъемБазовойУпаковки(Товар) Экспорт
	
	Возврат Новый Структура("Вес, Объем", 0,0);
		
КонецФункции

#КонецОбласти

#Область ПЕЧАТЬ_ЭТИКЕТОК


Функция ПечатьЭтикеткиТовара(МассивТоваров) Экспорт
	
	Возврат Истина;
		
КонецФункции



#КонецОбласти

#Область ПАРАМЕТРЫ_УЧЕТА



//@skip-check module-unused-method
Функция ПолучитьИспользованиеХарактеристикТоваровИПолучитьВладельцаДляВыбора(ВходящиеДанные) Экспорт
	
	Возврат Ложь;
		
КонецФункции

Функция ОпределитьМаркируемыеТовары(Товары) Экспорт
	
	// 3.2.5
	// Функция доработана для проверки маркировки на дату.
	Товары = вмс_РаботаСКоллекциями.ЗначениеВМассив(Товары);
	
	МаркируемыеТовары = Новый Массив;
	ДатаПроверки = ТекущаяДатаСеанса();
	МаркируемыеВидыПродукции = ИнтеграцияИСМП.ИспользуемыеВидыМаркируемойПродукцииИСМП();
	
	Для каждого Товар Из Товары Цикл

		ВидПродукцииИС = ИнтеграцияИСМПВызовСервера.ВидПродукцииПоНоменклатуре(Товар);
		
		Если ЗначениеЗаполнено(ВидПродукцииИС) Тогда
			ДатаОбязательнойМаркировки = ИнтеграцияИСМПКлиентСерверПовтИсп.ДатаОбязательнойМаркировкиПродукции(ВидПродукцииИС);
			
			Если ДатаПроверки >= ДатаОбязательнойМаркировки Тогда
				МаркируемыеТовары.Добавить(Товар);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МаркируемыеТовары
	
	
КонецФункции
	
Функция ПолучитьВидыТоваров(Товары) Экспорт

	Возврат вмс_АдаптацияКонфигурацийУТ.ПолучитьВидыТоваров(Товары);
	
КонецФункции

// ТУ_Самойленко 30.03.23 ++
Функция ПолучитьТипыДанныхКонфигурации(ТипыДанных) Экспорт

	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Партия", "Справочник.Назначения");
	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Характеристика", "Справочник.ХарактеристикиНоменклатуры");
	вмс_РаботаСКоллекциями.ДобавитьСтрокуТЗ(ТипыДанных, "Серия", "Справочник.СерииНоменклатуры");
	
КонецФункции
// ТУ_Самойленко 30.03.23 --     

// ТУ_Кулалаев+
Функция ПолучитьЕдиницыИзмеренияТоваров(Строки) Экспорт    
	
	Возврат Неопределено;
	
КонецФункции
// ТУ_Кулалаев-

// ТУ_Самойленко 04.07.23 ++ [Блокировка ячеек]
Функция ПолучитьВладельцаЯчейки(ИзначальныйВладелец) Экспорт
	
	Возврат ИзначальныйВладелец;
	
КонецФункции
// ТУ_Самойленко 04.07.23 ++ [Блокировка ячеек]

Функция ПолучитьКлючиАналитикиНоменклатуры() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Товар,
		|	НЕОПРЕДЕЛЕНО КАК Характеристика,
		|	НЕОПРЕДЕЛЕНО КАК Серия
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ПометкаУдаления = ЛОЖЬ
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
		
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
		
КонецФункции

// ТУ_Кошелев 17.08.2023++
Функция ПривязатьФотографиюКНоменклатуре(Номенклатура, ХранилищеФайла) Экспорт 
	// Не используется
	Возврат Ложь;
КонецФункции
// ТУ_Кошелев 17.08.2023--

Функция ПолучитьИменаРаспоряжений() Экспорт
	Результат = Новый Структура;  
	Возврат Результат;
КонецФункции

Функция ПолучитьДокументыСНесколькимиТЧ() Экспорт   
	РК = вмс_РаботаСКоллекциями;
	
	Результат = Новый Соответствие;
	Возврат Результат;
КонецФункции

//@skip-check module-unused-method
Функция ПолучитьСоответствияИменСправочников() Экспорт 
	Результат = Новый Структура;
	Возврат Результат;
КонецФункции

// ТУ_Августинович 26.08.2025 ++
Функция СтроковоеПредставлениеОстатковНаСкладе(Товар) Экспорт

	ПредставлениеОстатков = "";
	
	Возврат ПредставлениеОстатков;
	
КонецФункции
// ТУ_Августинович 26.08.2025 --


#КонецОбласти

Функция ИмяРеквизитаНоменклатурыВид() Экспорт
	
	Возврат "ВидНоменклатуры";
	
КонецФункции

Функция ПолучитьИмяТипаНоменклатурыТовар() Экспорт
	Возврат Неопределено;
КонецФункции