
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресХранилищаДанных) Тогда
		АдресХранилищаДанных = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ПоместитьВоВременноеХранилище(Параметры.ЗначениеКопирования.Данные.Получить(), АдресХранилищаДанных);
	КонецЕсли;
		
	ОбновитьЭлементыДанныеЗагружены();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЭтоАдресВременногоХранилища(АдресХранилищаДанных) Тогда
		ПоместитьВоВременноеХранилище(ТекущийОбъект.Данные.Получить(), АдресХранилищаДанных);
	Иначе
		АдресХранилищаДанных = ПоместитьВоВременноеХранилище(ТекущийОбъект.Данные.Получить(), УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Данные = Новый ХранилищеЗначения(ПолучитьДанные());
	
КонецПроцедуры

&НаСервере
Функция ОбновитьЭлементыДанныеЗагружены()
	
	ДанныеЗагружены = ДанныеЗагружены();
	
	Элементы.Сохранить.Доступность = ДанныеЗагружены;
	Элементы.Воспроизвести.Доступность = ДанныеЗагружены;
	
КонецФункции

&НаКлиенте
Асинх Процедура Загрузить(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	МассивФайлов = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	Если НЕ ЗначениеЗаполнено(МассивФайлов) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = МассивФайлов[0];
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
	
	ЗагрузитьНаСервере(ДвоичныеДанные);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Сохранить(Команда)

	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	МассивФайлов = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	Если НЕ ЗначениеЗаполнено(МассивФайлов) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = МассивФайлов[0];
	
	ДвоичныеДанные = ПолучитьДанные();
	ДвоичныеДанные.Записать(ИмяФайла);
	
КонецПроцедуры

&НаСервере
Функция ДанныеЗагружены()

	Возврат ПолучитьДанные() <> Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьДанные()
	
	Возврат ПолучитьИзВременногоХранилища(АдресХранилищаДанных);
	
КонецФункции

&НаСервере
Функция ЗагрузитьНаСервере(ДвоичныеДанные)
	
	ПоместитьВоВременноеХранилище(ДвоичныеДанные, АдресХранилищаДанных);
	ОбновитьЭлементыДанныеЗагружены();
	
КонецФункции

&НаКлиенте
Процедура Воспроизвести(Команда)
	
	вмс_РаботаСоЗвукомКлиент.ПроигратьЗвук(ПолучитьДанные());
	
КонецПроцедуры
