//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

Функция СоздатьЭлементыФормы(Форма, ОписаниеФормы) Экспорт
	
	Перем ОбщегоНазначенияКлиентСервер;
	
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	Для Каждого СвойствоФормы Из ОписаниеФормы.Свойства Цикл
		Попытка
			Форма[СвойствоФормы.Ключ] = СвойствоФормы.Значение;
		Исключение
		    точка = 0;
		КонецПопытки;
	КонецЦикла;
	
	МассивНовыхРеквизитов = Новый Массив;
	Для Каждого ОписаниеРеквизита Из ОписаниеФормы.Реквизиты Цикл
		ТипРеквизита = ОбщегоНазначенияКлиентСервер.ПолучитьОписаниеТиповИзКвазиОписанияТипов(ОписаниеРеквизита.ТипРеквизита);
		РеквизитФормы = Новый РеквизитФормы(ОписаниеРеквизита.ИмяРеквизита, ТипРеквизита, ОписаниеРеквизита.Путь, ОписаниеРеквизита.Заголовок);
		МассивНовыхРеквизитов.Добавить(РеквизитФормы);
	КонецЦикла;
	Форма.ИзменитьРеквизиты(МассивНовыхРеквизитов);
	
	Для Каждого ОписаниеКоманды Из ОписаниеФормы.Команды Цикл
		Команда = Форма.Команды.Добавить(ОписаниеКоманды.Имя);
		ЗаполнитьЗначенияСвойств(Команда, ОписаниеКоманды);
	КонецЦикла;
	
	Для Каждого ОписаниеЭлемента Из ОписаниеФормы.Элементы Цикл
		
		ЭлементФормы = Форма.Элементы.Найти(ОписаниеЭлемента.ИмяЭлемента);
		Если ЭлементФормы=Неопределено Тогда
			РодительЭлемента = Форма.Элементы.Найти(ОписаниеЭлемента.Родитель.ИмяЭлемента);
			ЭлементФормы = Форма.Элементы.Добавить(ОписаниеЭлемента.ИмяЭлемента, Тип(ОписаниеЭлемента.ТипЭлемента), РодительЭлемента);
		КонецЕсли;
		
		Для Каждого СвойствоЭлемента Из ОписаниеЭлемента.Свойства Цикл
			Попытка
				ЭлементФормы[СвойствоЭлемента.Ключ] = СвойствоЭлемента.Значение;
			Исключение
			    точка = 0;
			КонецПопытки;
		КонецЦикла;
		
	КонецЦикла;
	
КонецФункции
