
Функция ЗаписатьПоОперацииПоЯчейкамПоОснованию(ДокументОснование, ВидОперации, Ответственный, Ссылка=Неопределено, Автоввод = Истина) Экспорт
	Документ = ПолучитьДокумент(Ссылка);
	Документ.ЗаполнитьПоОперацииПоЯчейкамПоОснованию(ДокументОснование, ВидОперации);
	Документ.Дата = ТекущаяДата();      
	//ТУ_Прошин_24.05.24++  
	Если ТипЗнч(Ответственный) = Тип("СправочникСсылка.вмс_НастройкиОператора") Тогда
		Документ.Ответственный = Ответственный;
	Иначе	
		ОператорТСД = Справочники.вмс_НастройкиОператора.НайтиПоРеквизиту("Оператор", Ответственный); 
		Документ.Ответственный = ОператорТСД;    
	КонецЕсли;	
	//ТУ_Прошин_24.05.24-- 
	Документ.Автоввод = Истина;
	Если НЕ Документ.ЭтоНовый() ИЛИ Документ.Операции.Количество() > 0 Тогда
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	Возврат Документ;
	
КонецФункции

Функция ПолучитьДокумент(Ссылка=Неопределено) Экспорт
	
	Если Ссылка <> Неопределено Тогда
		Документ = Ссылка.ПолучитьОбъект();
		Если Документ = Неопределено Тогда
			Документ = Документы.ОХР_РегистрацияОпераций.СоздатьДокумент();
			Документ.УстановитьСсылкуНового(Ссылка);
		КонецЕсли;
	Иначе
		Документ = Документы.ОХР_РегистрацияОпераций.СоздатьДокумент();
	КонецЕсли;
	
	Возврат Документ;
	
КонецФункции

Функция ЗаполнитьЦеныДокумента(Документ) Экспорт
	Для Каждого СтрокаОперацииХранения Из Документ.Операции Цикл 		
		СтрокаОперацииХранения.Цена = ОХР_ОтветственноеХранениеСервер.ПолучитьЦенуКонтейнера(СтрокаОперацииХранения.Контейнер, СтрокаОперацииХранения.Операция, Документ.Контрагент, ТекущаяДата());
		СтрокаОперацииХранения.Сумма = СтрокаОперацииХранения.Цена * СтрокаОперацииХранения.Количество;			
	КонецЦикла;  
КонецФункции

Функция СоздатьДокументыРегистрацииОпераций(ПараметрыОперации, ТаблицаУслугОХР) Экспорт
	ДокументОснование = ПараметрыОперации.ДокументОснование;
	ВидОперации		  = ПараметрыОперации.ВидОперации;
	Ответственный	  = ПараметрыОперации.Ответственный;
	
	ЗаписатьПоОперацииПоЯчейкамПоОснованию(ДокументОснование, ВидОперации, Ответственный);
	
	Если ТаблицаУслугОХР <> Неопределено И ТаблицаУслугОХР.Количество() > 0 Тогда		
		Документ = Документы.ОХР_РегистрацияОпераций.СоздатьДокумент();
		
		//Заполнение по умолчанию, затем реквизитами из документа основания, совпадающими по наименованию
		Документ.Заполнить(Неопределено);
		РеквизитыШапки = вмс_РаботаСКоллекциями.ПересечениеМассивов(вмс_ОбщегоНазначенияВызовСервера.ПолучитьИменаРеквизитовШапкиОбъекта(ДокументОснование), вмс_ОбщегоНазначенияВызовСервера.ПолучитьИменаРеквизитовШапкиОбъекта(Документ));
		ЗаполнитьЗначенияСвойств(Документ, вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначенияРеквизитовОбъекта(ДокументОснование, РеквизитыШапки));
		
		Документ.Дата = ТекущаяДата(); 
		Документ.Основание = ДокументОснование;

		Для Каждого СтрокаОХР Из ТаблицаУслугОХР Цикл
			НоваяСтрока = Документ.Операции.Добавить();
			НоваяСтрока.Операция   = СтрокаОХР.Услуга;
			НоваяСтрока.Количество = СтрокаОХР.Количество;
		КонецЦикла;
		
		Документы.ОХР_РегистрацияОпераций.ЗаполнитьЦеныДокумента(Документ);
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
КонецФункции
