#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Функция ЗаполнитьПоОперацииПоЯчейкамПоОснованию(ДокументОснование, ВидОперации) Экспорт
	
	ПустойКонтейнер = Справочники.вмс_Контейнеры.ПустаяСсылка();
	
	// заполним шапку по основанию (всеми возможными реквизитами, совпадающими по имени)
	РеквизитыШапки = вмс_РаботаСКоллекциями.ПересечениеМассивов(вмс_ОбщегоНазначенияВызовСервера.ПолучитьИменаРеквизитовШапкиОбъекта(ДокументОснование), вмс_ОбщегоНазначенияВызовСервера.ПолучитьИменаРеквизитовШапкиОбъекта(ЭтотОбъект));
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначенияРеквизитовОбъекта(ДокументОснование, РеквизитыШапки));
	
	// заполним список операций хранения      
	
	УслугиОтветственногоХраненияОперации = ПолучитьУслугиХраненияОперации(ВидОперации);  	
	
	ТаблицаПринятыхТоваров = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуПринятыхТоваров(ДокументОснование, ВидОперации); 
	
	// Расчет операций по контейнерам +   
	УслугиХраненияКонтейнеры = УслугиОтветственногоХраненияОперации.Скопировать(Новый Структура("МерныйУчет", Ложь));
	
	ТаблицаПринятыхКонтейнеров = ТаблицаПринятыхТоваров.Скопировать();
	
	РК = вмс_РаботаСКоллекциями;
	ПоляКонтейнеров = "КонтейнерОтправитель, Контейнер, КонтейнерПриемник";
	ПоляКонтейнеровМассив = РК.СтрокуВМассив(ПоляКонтейнеров);
	МассивКонтейнеров = Новый Массив;
	СтрокиТоварныхПозиций = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаПринятыхКонтейнеров Цикл
		СтрокаСКонтейнерами = Ложь;
		Для Каждого ПолеКонтейнера Из ПоляКонтейнеровМассив Цикл
			Контейнер = СтрокаТаблицы[ПолеКонтейнера];
			Если Контейнер <> ПустойКонтейнер Тогда
				СтрокаСКонтейнерами = Истина;
				Если МассивКонтейнеров.Найти(Контейнер)=Неопределено Тогда
					МассивКонтейнеров.Добавить(Контейнер);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ СтрокаСКонтейнерами Тогда
			СтрокиТоварныхПозиций.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСоответствияОперацийКонтейнеров = вмс_ПартионныйУчетСервер.ПолучитьТаблицуОперацийКонтейнеров(МассивКонтейнеров);
	Для Каждого Контейнер Из МассивКонтейнеров Цикл   
		стрОперацииКонтейнера = ТаблицаСоответствияОперацийКонтейнеров.НайтиСтроки(Новый Структура("ТипКонтейнера", Контейнер.ТипТары));
		Для каждого стрОперацияКонтейнера Из стрОперацииКонтейнера Цикл 
			Если УслугиХраненияКонтейнеры.Найти(стрОперацияКонтейнера.ОперацияКонтейнера) <> Неопределено Тогда 
				СтрокаОперацииХранения = Операции.Добавить();
				СтрокаОперацииХранения.Контейнер = Контейнер;
				СтрокаОперацииХранения.Операция = стрОперацияКонтейнера.ОперацияКонтейнера;
				СтрокаОперацииХранения.Количество = 1;  
				СтрокаОперацииХранения.Цена = ОХР_ОтветственноеХранениеСервер.ПолучитьЦенуКонтейнера(СтрокаОперацииХранения.Контейнер, СтрокаОперацииХранения.Операция, Контрагент, ТекущаяДата());
				СтрокаОперацииХранения.Сумма = СтрокаОперацииХранения.Цена;
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
	// Расчет операций по контейнерам -
	
	// Расчет операций по штучным местам + 
	УслугиХраненияМерные = УслугиОтветственногоХраненияОперации.Скопировать(Новый Структура("МерныйУчет", Истина));
	
	ТаблицаТоварныхПозиций = ТаблицаПринятыхТоваров.Скопировать(СтрокиТоварныхПозиций);
	
	Для каждого СтрокаУслуга Из УслугиХраненияМерные Цикл
		ВходящиеПараметры = Новый Структура("Товары, Результат", ТаблицаТоварныхПозиций, Неопределено); 
		вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьАлгоритм(СтрокаУслуга.АлгоритмРасчетаВес, ВходящиеПараметры);  
		ВесТовара = ВходящиеПараметры.Результат;
		
		Если ЗначениеЗаполнено(ВесТовара) Тогда
			СтрокаОперацииХранения = Операции.Добавить();
			СтрокаОперацииХранения.Операция = СтрокаУслуга.Операция;
			СтрокаОперацииХранения.Количество = ВесТовара;  
			СтрокаОперацииХранения.Цена = ОХР_ОтветственноеХранениеСервер.ПолучитьЦенуКонтейнера(Неопределено, СтрокаУслуга.Операция, Контрагент, ТекущаяДата());
			СтрокаОперацииХранения.Сумма = СтрокаОперацииХранения.Количество * СтрокаОперацииХранения.Цена;
		КонецЕсли; 
		
		ВходящиеПараметры = Новый Структура("Товары, Результат", ТаблицаТоварныхПозиций, Неопределено); 
		вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьАлгоритм(СтрокаУслуга.АлгоритмРасчетаОбъем, ВходящиеПараметры);  
		ОбъемТовара = ВходящиеПараметры.Результат;
		
		Если ЗначениеЗаполнено(ОбъемТовара) Тогда
			СтрокаОперацииХранения = Операции.Добавить();
			СтрокаОперацииХранения.Операция = СтрокаУслуга.Операция;
			СтрокаОперацииХранения.Количество = ОбъемТовара;  
			СтрокаОперацииХранения.Цена = ОХР_ОтветственноеХранениеСервер.ПолучитьЦенуКонтейнера(Неопределено, СтрокаУслуга.Операция, Контрагент, ТекущаяДата());
			СтрокаОперацииХранения.Сумма = СтрокаОперацииХранения.Количество * СтрокаОперацииХранения.Цена;
		КонецЕсли;
	КонецЦикла;			
	// Расчет операций по штучным местам -
	
КонецФункции

Процедура ОбработкаПроведения2(Отказ, РежимПроведения) 
	
	ТекущаяДата = ТекущаяДата();
	
	ТаблицаОпераций = Операции.Выгрузить();	
	ТаблицаОпераций.Колонки.Добавить("Посуточно"); 
	ТаблицаОпераций.Колонки.Добавить("ДатаХранения");
	ТаблицаОпераций.Колонки.Добавить("Контрагент");
	ТаблицаОпераций.Колонки.Добавить("Период");
	
	
	Для каждого Строка Из ТаблицаОпераций Цикл
		Строка.Посуточно = Строка.Операция.Посуточно;	
	КонецЦикла;
	
	ТаблицаПосуточно = ТаблицаОпераций.Скопировать(Новый Структура("Посуточно", Истина)); 
	
	Если ТаблицаПосуточно.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;  
	
	ТаблицаПосуточно.ЗаполнитьЗначения(ТекущаяДата, "Период"); 
	ТаблицаПосуточно.ЗаполнитьЗначения(Контрагент, "Контрагент");
	
	Движения.вмс_ПосуточныеОперацииХранения.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата КАК ДатаХранения
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|";
	
	// Установка параметров.
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата));
	
	ТаблицаДней = Запрос.Выполнить().Выгрузить();  
	
	ОбщаяТаблица = ТаблицаПосуточно.Скопировать();
	ОбщаяТаблица.Очистить();
	
	Для каждого Строка Из ТаблицаПосуточно Цикл  
		
		Для каждого СтрокаДень  Из ТаблицаДней Цикл 		
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	вмс_ОстаткиВКонтейнерахОстатки.Контейнер КАК Контейнер
			|ИЗ
			|	РегистрНакопления.вмс_ОстаткиВКонтейнерах.Остатки(&Период, Контейнер = &Контейнер) КАК вмс_ОстаткиВКонтейнерахОстатки";
			
			Если СтрокаДень.ДатаХранения < НачалоДня(ТекущаяДата) Тогда
				Период = СтрокаДень.ДатаХранения;
			ИначеЕсли СтрокаДень.ДатаХранения < НачалоДня(ТекущаяДата) И Час(ТекущаяДата) >= 18 Тогда
				Период = СтрокаДень.ДатаХранения;	
			Иначе
				Продолжить;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Контейнер", Строка.Контейнер);
			Запрос.УстановитьПараметр("Период", СтрокаДень.ДатаХранения);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл  
				нСтрока = ОбщаяТаблица.Добавить(); 
				ЗаполнитьЗначенияСвойств(нСтрока, Строка);
				нСтрока.ДатаХранения = СтрокаДень.ДатаХранения;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла; 
	
	Движения.вмс_ПосуточныеОперацииХранения.Записывать = Истина;
	Движения.вмс_ПосуточныеОперацииХранения.Загрузить(ОбщаяТаблица); 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)  
	
	Запрос = Новый Запрос;		
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриходРасход.Контейнер КАК Контейнер,
	|	ПриходРасход.Операция КАК Операция,
	|	ПриходРасход.Количество КАК Количество,
	|	ПриходРасход.Сумма КАК Сумма,
	|	ПриходРасход.Ссылка КАК Ссылка,
	|	ПриходРасход.Операция.ВидДвижения КАК ОперацияВидДвижения,
	|	ПриходРасход.Ссылка.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_УслугиПриходаРасхода
	|ИЗ
	|	Документ.ОХР_РегистрацияОпераций.Операции КАК ПриходРасход
	|ГДЕ
	|	ПриходРасход.Ссылка = &Ссылка
	|	И (ПриходРасход.Операция.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.вмс_ВидыДвиженияУслугОтветственногоХранения.Приход)
	|			ИЛИ ПриходРасход.Операция.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.вмс_ВидыДвиженияУслугОтветственногоХранения.Расход))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Хранение.Контейнер КАК Контейнер,
	|	Хранение.Операция КАК Операция,
	|	Хранение.Количество КАК Количество,
	|	Хранение.Сумма КАК Сумма,
	|	Хранение.Ссылка КАК Ссылка,
	|	Хранение.Операция.ВидДвижения КАК ОперацияВидДвижения,
	|	Хранение.Ссылка.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_Хранение
	|ИЗ
	|	Документ.ОХР_РегистрацияОпераций.Операции КАК Хранение
	|ГДЕ
	|	Хранение.Ссылка = &Ссылка
	|	И Хранение.Операция.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.вмс_ВидыДвиженияУслугОтветственногоХранения.Хранение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Хранение.Контейнер КАК Контейнер,
	|	ВТ_Хранение.Операция КАК Операция,
	|	ВТ_Хранение.Количество КАК Количество,
	|	ВТ_Хранение.Сумма КАК Сумма,
	|	ВТ_Хранение.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВТ_УслугиПриходаРасхода.ОперацияВидДвижения = ЗНАЧЕНИЕ(Перечисление.вмс_ВидыДвиженияУслугОтветственногоХранения.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ВТ_УслугиПриходаРасхода.ОперацияВидДвижения = ЗНАЧЕНИЕ(Перечисление.вмс_ВидыДвиженияУслугОтветственногоХранения.Расход)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВидДвижения,
	|	ВТ_Хранение.Склад КАК Склад
	|ИЗ
	|	ВТ_Хранение КАК ВТ_Хранение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УслугиПриходаРасхода КАК ВТ_УслугиПриходаРасхода
	|		ПО (ВТ_Хранение.Ссылка = ВТ_Хранение.Ссылка)";
	
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Движения.вмс_ПосуточныеОперацииХранения.Записывать = Истина;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.вмс_ПосуточныеОперацииХранения.Добавить();
		Движение.ВидДвижения = Выборка.ВидДвижения;
		Движение.Склад = Выборка.Склад;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент; 
		Движение.Организация = Организация;
		Движение.Контейнер = Выборка.Контейнер;
		Движение.Операция = Выборка.Операция;
		Движение.Сумма = Выборка.Сумма;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;    
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Операции.Контейнер КАК Контейнер,
	|	Операции.Операция КАК Операция,
	|	Операции.Количество КАК Количество,
	|	Операции.Сумма КАК Сумма,
	|	Операции.Ссылка КАК Ссылка,
	|	Операции.Ссылка.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ1
	|ИЗ
	|	Документ.ОХР_РегистрацияОпераций.Операции КАК Операции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ1.Контейнер КАК Контейнер,
	|	ВТ1.Операция КАК Операция,
	|	ВТ1.Количество КАК Количество,
	|	ВТ1.Сумма КАК Сумма,
	|	ВТ1.Склад КАК Склад
	|ИЗ
	|	ВТ1 КАК ВТ1
	|ГДЕ
	|	ВТ1.Операция.ВидДвижения <> ЗНАЧЕНИЕ(Перечисление.вмс_ВидыДвиженияУслугОтветственногоХранения.Хранение)
	|	И ВТ1.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Движения.вмс_РазовыеОперацииХранения.Записывать = Истина;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.вмс_РазовыеОперацииХранения.Добавить();
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Контрагент = Контрагент; 
		Движение.Организация = Организация;
		Движение.Контейнер = Выборка.Контейнер;
		Движение.Операция = Выборка.Операция;
		Движение.Сумма = Выборка.Сумма;
		Движение.Количество = Выборка.Количество;
	КонецЦикла; 	
	
КонецПроцедуры

Функция ПолучитьУслугиХраненияОперации(ВидОперации) 
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СправочникУслуг.Ссылка КАК Операция,
	|	СправочникУслуг.МерныйУчет КАК МерныйУчет,
	|	СправочникУслуг.АлгоритмРасчетаВес КАК АлгоритмРасчетаВес,
	|	СправочникУслуг.АлгоритмРасчетаОбъем КАК АлгоритмРасчетаОбъем
	|ИЗ
	|	Справочник.вмс_Операции.ОтветственноеХранение КАК УслугиСкладскойОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вмс_УслугиОтветственногоХранения КАК СправочникУслуг
	|		ПО УслугиСкладскойОперации.Операция = СправочникУслуг.Ссылка
	|ГДЕ
	|	УслугиСкладскойОперации.Ссылка = &ВидОперации";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат РезультатЗапроса;
	
	
КонецФункции

#КонецЕсли

