#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем РК;

Функция ВыполнитьДействие(Действие) Экспорт
	
	Код = Действие.Код;
	
	Если Код="Инициализировать" Тогда
		
		ДействиеИнициализировать(Действие);
		
	ИначеЕсли Код="ИнициализироватьПоляОбработки" Тогда
		
		ДействиеИнициализироватьПоляОбработки(Действие);
		
	ИначеЕсли Код="ПослеЗаполненияДанныхПолей" Тогда
		
		ДействиеПослеЗаполненияДанныхПолей(Действие);
		
	ИначеЕсли Код ="ОбработатьВводШтрихкода" Тогда
		
		ДействиеОбработатьВводШтрихкода(Действие);
		
	ИначеЕсли Код = "ПолучитьФотографию" Тогда
		
		ДействиеПолучитьФотографию(Действие);
		
	ИначеЕсли Код = "НачалоОбработки" Тогда
		
		ДействиеНачалоОбработки(Действие);
		
	КонецЕсли;
	
КонецФункции

Функция ДействиеИнициализировать(Действие)	
	
	Товар = Неопределено;
	ПараметрыИнициализации = Действие.Параметры;
	ПараметрыИнициализации.Свойство("Товар", Товар);
	
	НастройкаОператора = Неопределено;
	Если ПараметрыОбработки.ИдентификаторРодителя <> 0 Тогда
		ПараметрыОбработкиРодителя = вмс_СерверУправляемыеОбработки.ПараметрыОбработки(ПараметрыОбработки.ИдентификаторРодителя);
		ПараметрыОбработкиРодителя.Свойство("НастройкаОператора", НастройкаОператора);
	Иначе
		ПараметрыОбработки.СостояниеОбработки.ПараметрыИнициализации.Свойство("НастройкаОператора", НастройкаОператора);
	КонецЕсли;
	
	ПараметрыОбработки.Вставить("Товар", Товар);
	Если ПараметрыИнициализации.Свойство("Характеристика") Тогда
		ПараметрыОбработки.Вставить("Характеристика", ПараметрыИнициализации.Характеристика);
	КонецЕсли;
	
	ПараметрыОбработки.Вставить("НастройкаОператора", НастройкаОператора);
	
КонецФункции

Функция ДействиеИнициализироватьПоляОбработки(Действие)
		
	СвойстваПоля = Новый Структура("Ввод, Вывод, Сборка, Синоним, ТипЗначения", Истина, Истина, Истина, "Артикул", Тип("Строка"));
	УстановитьСвойстваПолейОбработки("Артикул", СвойстваПоля);
	
	СвойстваПоля = Новый Структура("Ввод, Вывод, Сборка, Синоним, ТипЗначения", Истина, Истина, Истина, "Товар", Тип("СправочникСсылка.Номенклатура"));
	УстановитьСвойстваПолейОбработки("Товар", СвойстваПоля);
	
	СвойстваПоля = Новый Структура("Ввод, Вывод, Сборка, Синоним, ТипЗначения", Истина, Истина, Истина, "Характеристика", Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	УстановитьСвойстваПолейОбработки("Характеристика", СвойстваПоля);
	
	СвойстваПоля = Новый Структура("Ввод, Вывод, Сборка, Синоним, ТипЗначения", Истина, Истина, Истина, "Вес", Тип("Строка"));
	УстановитьСвойстваПолейОбработки("Вес", СвойстваПоля);
	
	СвойстваПоля = Новый Структура("Ввод, Вывод, Сборка, Синоним, ТипЗначения", Истина, Истина, Истина, "Объем", Тип("Строка"));
	УстановитьСвойстваПолейОбработки("Объем", СвойстваПоля);
	
	СвойстваПоля = Новый Структура("Ввод, Вывод, Сборка, Синоним, ТипЗначения", Истина, Истина, Истина, "Остатки", Тип("Строка"));
	УстановитьСвойстваПолейОбработки("Остатки", СвойстваПоля);
	
	СвойстваПоля = Новый Структура("Ввод, Вывод, Сборка, Синоним, ТипЗначения", Истина, Истина, Истина, "Ячейки", Тип("Строка"));
	УстановитьСвойстваПолейОбработки("Ячейки", СвойстваПоля);	
		
	УстановитьСвойстваЭлементовВывода("КнопкаПечать", Новый Структура("Заголовок", "Печать"));
	УстановитьОбработчикиСобытийЭлементовВывода("КнопкаПечать",	Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикНажатиеКнопкаПечать")));
	
	УстановитьСвойстваЭлементовВывода("КнопкаДобавитьФото", Новый Структура("Заголовок", "Добавить фото"));
	УстановитьОбработчикиСобытийЭлементовВывода("КнопкаДобавитьФото",	Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикНажатиеКнопкаДобавитьФото")));
	
	УстановитьСвойстваЭлементовВывода("ФотографияТовара",		"Значение",	Новый Картинка);
	
	УстановитьРезультатДействия(Действие, Истина);
	
КонецФункции

Функция ДействиеНачалоОбработки(Действие)
	Если ЗначениеЗаполнено(ПараметрыОбработки.Товар) Тогда	
		ВвестиДанные(НовыеВходящиеДанные(Новый Структура("Товар, Характеристика", ПараметрыОбработки.Товар, ПараметрыОбработки.Характеристика)));
		ЗаполнитьДанныеПолей_Кастомная();
	КонецЕсли;
КонецФункции

Функция ДействиеОбработатьВводШтрихкода(Действие)
		
	РК = вмс_РаботаСКоллекциями;
	Действие.СтандартнаяОбработка = Ложь;
	Действие.Обработано = Истина;
	Штрихкод = Действие.Параметры;
	
	ВходящиеДанные = НовыеВходящиеДанные(Штрихкод); 
	ВвестиДанные(ВходящиеДанные);
	Результат = ВходящиеДанные.ДанныеШтрихкода.Результат;
	
	ЗаполнитьДанныеПолей_Кастомная();

	
КонецФункции

Функция ДействиеПолучитьФотографию(Действие)
	
	ВведенныеДанные = ПараметрыОбработки.ДанныеТранзакции.ВведенныеДанныеПолей;
	
	ДвоичныеДанные = Действие.Параметры;
	
	вмс_АдаптацияКонфигураций.ПривязатьФотографиюКНоменклатуре(ВведенныеДанные.Товар, Новый ХранилищеЗначения(ДвоичныеДанные));
	УстановитьСвойстваЭлементовВывода("ФотографияТовара",		"Значение",	ДанныеКартинкиТовара(ВведенныеДанные.Товар));
	
КонецФункции

Функция ЯчейкиТовара(Товар)   
	
	//Временное решение для Олимпийского, в будущем стоит предусмотреть отбор ячеек по складу и т.п., 
	//с ограничениями из правила заполнения задания кладовщику
	мТовары = Новый Массив;
	
	мТовары.Добавить(Товар);
	
	ТипыЯчеек = Новый Массив;
	
	ТипыЯчеек.Добавить(ПредопределенноеЗначение("Перечисление.вмс_ТипыЯчеек.Хранение"));   
	
	ТипыЯчеек.Добавить(ПредопределенноеЗначение("Перечисление.вмс_ТипыЯчеек.ЗонаПриемки"));  
	
	ЯчейкиТЗ = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуОстатковВЯчейках(мТовары, , ТипыЯчеек);  
	
	Если ЯчейкиТЗ.Количество() = 0 Тогда 
		Возврат "";
	КонецЕсли;
	
	ПредставлениеОстатка = "";
	
	Для каждого СтрокаЯчейки Из ЯчейкиТЗ Цикл
		вмс_РаботаСКоллекциями.ДобавитьЗначенияВСтроку(ПредставлениеОстатка, СтрШаблон("%1 - %2 ед.", СтрокаЯчейки.Ячейка, СтрокаЯчейки.Количество));
	КонецЦикла;
	
	Возврат ПредставлениеОстатка;
	
КонецФункции

Функция ДанныеКартинкиТовара(Товар)
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		АдресКартинки = РаботаСФайлами.ДанныеФайла(Товар.ФайлКартинки).СсылкаНаДвоичныеДанныеФайла;
		ДанныеКартинки = ПолучитьИзВременногоХранилища(АдресКартинки);
		УдалитьИзВременногоХранилища(АдресКартинки);
	Исключение
		ДанныеКартинки = Новый Картинка;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДанныеКартинки;
	
КонецФункции

Функция ДействиеПослеЗаполненияДанныхПолей(Действие)
	
	ОбновитьЭлементыВывода();
	
КонецФункции

Функция ОбновитьЭлементыВывода()
КонецФункции

Процедура ЗаполнитьДанныеПолей_Кастомная()
		
	ВведенныеДанные = ПараметрыОбработки.ДанныеТранзакции.ВведенныеДанныеПолей;
	
	Если ЗначениеЗаполнено(ВведенныеДанные.Товар) Тогда
		
		Товар = ВведенныеДанные.Товар;
		Характеристика = ВведенныеДанные.Характеристика;
		ВесОбъем = вмс_АдаптацияКонфигураций.ВесОбъемБазовойУпаковки(Товар);
		
		ВвестиДанныеПоля("Артикул", Товар.Артикул);
		ВвестиДанныеПоля("Ячейки", ЯчейкиТовара(Товар));
		ВвестиДанныеПоля("Остатки", вмс_АдаптацияКонфигураций.СтроковоеПредставлениеОстатковНаСкладе(Товар));
		ВвестиДанныеПоля("Вес", ВесОбъем.Вес);
		ВвестиДанныеПоля("Объем", ВесОбъем.Объем);
		
		УстановитьСвойстваЭлементовВывода("ФотографияТовара",		"Значение",	ДанныеКартинкиТовара(Товар));
		
	КонецЕсли;

КонецПроцедуры


//печать
Функция ОбработчикНажатиеКнопкаПечать(Параметр, ДополнительныеПараметры) Экспорт
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Товар", ПараметрыОбработки.Товар);
	ДанныеПечати.Вставить("Количество", 1);
	Если ПараметрыОбработки.Свойство("Характеристика") Тогда
		ДанныеПечати.Вставить("Характеристика", ПараметрыОбработки.Характеристика);
	КонецЕсли;
	
	Этикетка = вмс_Печать.СформироватьПечатнуюФормуЭтикеткиТовара(ДанныеПечати);
	НачатьПечатьЭтикетки(Этикетка);
		
КонецФункции

Функция ОбработчикНажатиеКнопкаДобавитьФото(Параметр, ДополнительныеПараметры) Экспорт
	
	ДобавитьДействиеНаКлиенте("СделатьФотографию");
		
КонецФункции

Процедура НачатьПечатьЭтикетки(Этикетка)
		
	ТаблицаПринтеров = вмс_Печать.ПолучитьТаблицуНастроекПринтеров(ПараметрыОбработки.НастройкаОператора);
	
	Если ЗначениеЗаполнено(ТаблицаПринтеров) Тогда
		
		Если ТаблицаПринтеров.Количество() = 1 Тогда
			// принтер один - берем его
			ОбработчикВыбораПринтера(ТаблицаПринтеров[0].Принтер, Этикетка);
		Иначе
			// принтеров несколько. Пробуем по умолчанию, либо выбор
			ПринтерыПоУмолчанию = ТаблицаПринтеров.НайтиСтроки(Новый Структура("ПоУмолчанию", Истина));
			Если ЗначениеЗаполнено(ПринтерыПоУмолчанию) Тогда
				// берем отмеченный по умолчанию
				ОбработчикВыбораПринтера(ПринтерыПоУмолчанию[0], Этикетка);
			Иначе
				// выбираем принтер
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Принтеры", ТаблицаПринтеров.ВыгрузитьКолонку("Принтер"));
				СтандартныйМодуль.ПоказатьФормуДиалога(НовыйОписаниеОповещения("ОбработчикВыбораПринтера", , Этикетка), "ОбщаяФорма.ФормаВыборПринтера", ПараметрыФормы);
			КонецЕсли;
		КонецЕсли;	
	Иначе
		ПоказатьДиалогНаКлиенте(, "Не указаны принтеры у оператора. Укажите в настройках оператора");
	КонецЕсли;

КонецПроцедуры

Функция ОбработчикВыбораПринтера(ВыбранныйПринтер, ТабличныйДокумент) Экспорт
	
	// 3.2.4
	Если ВыбранныйПринтер=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВыбранныйПринтер.ТипПринтера = ПредопределенноеЗначение("Перечисление.ТипыПринтеров.ЛокальныйПринтер") Тогда
		вмс_Печать.ДобавитьДокументКПечатиЧерезРегистр(ТабличныйДокумент, ВыбранныйПринтер);
	ИначеЕсли ВыбранныйПринтер.ТипПринтера = ПредопределенноеЗначение("Перечисление.ТипыПринтеров.СерверныйПринтер") Тогда
		вмс_Печать.ВыполнитьПечатьЧерезКомпоненту(ТабличныйДокумент, ВыбранныйПринтер);
	Иначе
		ДобавитьДействиеНаКлиенте("ПечатьНаБеспроводнойПринтер", ТабличныйДокумент);
	КонецЕсли;
	
КонецФункции






#Область ОбъявленияФункций
Функция ОткрытьФормуОбработки(ИмяФормы)
	
	ДобавитьДействиеНаКлиенте("ОткрытьФормуОбработки", Новый Структура("ИмяФормы", ИмяФормы));
	
КонецФункции

Функция УстановитьЗаголовокФормы(Заголовок)
	
	Возврат ДобавитьДействиеНаКлиенте("УстановитьЗаголовок", Заголовок);
	
КонецФункции

Функция ДобавитьЭтапВводаДанных(ОписаниеОбработчика, Группа, Место=Неопределено, Параметр=Неопределено, Имя=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ДобавитьЭтапВводаДанных", Новый Структура("ОписаниеОбработчика, Группа, Место, Параметр, Имя", ОписаниеОбработчика, Группа, Место, Параметр, Имя)));
	
КонецФункции

Функция ПоказатьДиалогНаКлиенте(ОписаниеОповещения=Неопределено, Текст, знач Кнопки=Неопределено, знач Таймаут=Неопределено, КнопкаПоУмолчанию=Неопределено, Заголовок=Неопределено)
	
	Возврат СтандартныйМодуль.ПоказатьДиалогНаКлиенте(ОписаниеОповещения, Текст, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок);
	
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, знач Модуль=Неопределено, ДополнительныеПараметры=Неопределено, ИмяПроцедурыОбработкиОшибки=Неопределено, МодульОбработкиОшибки=Неопределено)
	
	Если Модуль=Неопределено Тогда
		Модуль = ЭтотОбъект;
	КонецЕсли;
	
	Возврат вмс_СерверУправляемыеОбработки.НовыйОписаниеОповещения(ИмяПроцедуры, ПараметрыОбработки, Модуль, ДополнительныеПараметры, ИмяПроцедурыОбработкиОшибки, МодульОбработкиОшибки);
	
КонецФункции

Функция ДобавитьДействиеНаКлиенте(КодДействие, знач ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ДобавитьДействиеНаКлиенте(ПараметрыОбработки, КодДействие, ПараметрыДействия);
	
КонецФункции

Функция ДействиеВыполняетсяПосле(Действие) Экспорт
	
	Возврат вмс_СерверУправляемыеОбработки.ДействиеВыполняетсяПосле(Действие);
	
КонецФункции

Функция УстановитьРезультатДействия(Действие, Результат=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, Результат);
	
КонецФункции

Функция Действие(Код, ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.Действие(Код, ПараметрыДействия, ПараметрыОбработки.Идентификатор, ПараметрыОбработки, ЭтотОбъект);
	
КонецФункции

Функция ЗаполнитьДанныеПолей(СборщикиДанных=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗаполнитьДанныеПолей", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

Функция ВвестиДанные(ВходящиеДанные)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ВвестиДанные", Новый Структура("ВходящиеДанные", ВходящиеДанные)));
	
КонецФункции

Функция ВвестиДанныеПоля(ИмяПоля, ЗначениеПоля)
	
	Возврат СтандартныйМодуль.ВвестиДанныеПоля(ИмяПоля, ЗначениеПоля);
	
КонецФункции

Функция НовыеВходящиеДанные(Данные=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.НовыеВходящиеДанные(Данные);
	
КонецФункции


/////////////////////////////////////////////////////////////////////////
//
//				Поля обработки+
//

//возвращает всю таблицу полей или массив полей по отбору
Функция ПоляОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ПолеОбработки(Отбор)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

//возвращает поля с указанными именами, если поля нет, то создает новое
Функция ПолучитьПоляОбработки(Поля=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьПоляОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция УстановитьСвойстваПолейОбработки(Поля=Неопределено, Свойства=Неопределено, Значение=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьСвойстваПолейОбработки(ПараметрыОбработки, Поля, Свойства, Значение);
	
КонецФункции

Функция ПолучитьЗначениеСвойстваПоляОбработки(Поле, ИмяСвойства)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеСвойстваПоляОбработки(ПараметрыОбработки, Поле, ИмяСвойства);
	
КонецФункции

Функция УстановитьПоляВводаОбработки(Поля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьПоляВводаОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция УстановитьПоляВыводаОбработки(Поля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьПоляВыводаОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция УстановитьЗначениеДанныхПоляОбработки(Поле, Значение) Экспорт
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьЗначениеДанныхПоляОбработки(ПараметрыОбработки, Поле, Значение);
	
КонецФункции

Функция СписокПолейВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВвода(ПараметрыОбработки);
	
КонецФункции

Функция ПоляВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВвода(ПараметрыОбработки);
	
КонецФункции

Функция СписокПолейВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВывода(ПараметрыОбработки);
	
КонецФункции

Функция ПоляВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВывода(ПараметрыОбработки);
	
КонецФункции

Функция СписокПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ТаблицаПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ТаблицаПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

//
//				Поля обработки-
//
/////////////////////////////////////////////////////////////////////////

Функция ПараметрыТаблицы(ИмяТаблицы)
	
	Возврат СтандартныйМодуль.ПараметрыТаблицы(ИмяТаблицы);
	
КонецФункции

Функция ПолучитьЭлементВывода(Имя)
	
	Возврат СтандартныйМодуль.ПолучитьЭлементВывода(Имя);
	
КонецФункции

Функция УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства=Неопределено)
	
	Возврат СтандартныйМодуль.УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства);
	
КонецФункции

Функция УстановитьОбработчикиСобытийПолейОбработки(Поля=Неопределено, События)
	
	Возврат СтандартныйМодуль.УстановитьОбработчикиСобытийПолейОбработки(Поля, События);
	
КонецФункции

Функция УстановитьОбработчикиСобытийЭлементовВывода(Элементы, События) Экспорт
	
	Возврат СтандартныйМодуль.УстановитьОбработчикиСобытийЭлементовВывода(Элементы, События);
	
КонецФункции

Функция УстановитьПоляВыводаТаблицы(ИмяТаблицы, ПоляВывода)
	
	Возврат СтандартныйМодуль.УстановитьПоляВыводаТаблицы(ИмяТаблицы, ПоляВывода);
	
КонецФункции

#КонецОбласти

РК = вмс_РаботаСКоллекциями;
	
#КонецЕсли


