// Адаптация: в расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

Функция ПолучитьФормуЭлемента(знач Элемент) Экспорт
	Пока ТипЗнч(Элемент) <> Тип("ФормаКлиентскогоПриложения") Цикл
		Элемент = Элемент.Родитель;
	КонецЦикла;
	Возврат Элемент;
КонецФункции

Функция ПолучитьНовоеИмяЭлементаФормы(Форма, Префикс="Элемент") Экспорт
	Номер = 0;
	Пока Истина Цикл
		НомерСтрокой = Формат(Номер, "ЧГ=0");
		ИмяЭлемента = Префикс + НомерСтрокой;
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			Возврат ИмяЭлемента;
		КонецЕсли;
		Номер = Номер + 1;
	КонецЦикла; 
КонецФункции

Функция ПолучитьСписокПолейЭлементаФормыДляЗаписи(Элемент) Экспорт
	ТипЭлемента = ТипЗнч(Элемент);
	Если ТипЭлемента = Тип("Структура") Тогда
		ТипЭлемента = Элемент.ТипЭлемента;
	КонецЕсли;
	
	СписокПолей = "";
	Если ТипЭлемента = Тип("КнопкаФормы") Тогда
		СписокПолей = СписокПолей + ", ИмяКоманды";
	КонецЕсли; 
	
	СписокПолей = СтрЗаменить(СписокПолей, " ", "");
	Если ЗначениеЗаполнено(СписокПолей) Тогда
		Если Лев(СписокПолей, 1) = "," Тогда
			СписокПолей = Сред(СписокПолей, 2);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат СписокПолей;
КонецФункции

Функция ПолучитьПоляЭлементаФормы(Элемент) Экспорт
	
	Если ТипЗнч(Элемент) = Тип("Структура") Тогда
		// уже сконвертирован в структуру
		Возврат Элемент;
	КонецЕсли;
	
	СписокПолей = ПолучитьСписокПолейЭлементаФормыДляЗаписи(Элемент);
	
	Поля = Новый Структура(СписокПолей);
	ЗаполнитьЗначенияСвойств(Поля, Элемент, СписокПолей);
	
	Поля.Вставить("Имя", Элемент.Имя);
	Поля.Вставить("ТипЭлемента", ТипЗнч(Элемент));
	
	Возврат Поля;
	
КонецФункции

Функция СкопироватьСвойстваЭлементаФормы(НовыйЭлемент, ЭлементШаблон) Экспорт
	
	СписокПолей = ПолучитьСписокПолейЭлементаФормыДляЗаписи(ЭлементШаблон);
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементШаблон, СписокПолей);
	Возврат НовыйЭлемент;
	
КонецФункции

Функция ПроверитьНаличиеМетодаОбъекта(ИмяМетода, Объект) Экспорт
	
	Попытка
		Выполнить("Объект." + ИмяМетода + "(,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,)");
	Исключение
	    ОписаниеОшибки = ОписаниеОшибки()
	КонецПопытки;
	
	Если Найти(ОписаниеОшибки, "Метод объекта не обнаружен") = 0 Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции

Функция ВыполнитьМетодОбъекта(ИмяМетода, ПараметрыМетода, Объект) Экспорт
	ПараметрыМетодаСтрока = "";
	Если ПараметрыМетода.Количество() > 0 Тогда
		РазделительПараметров = ", ";
		Для НомерПараметра=1 По ПараметрыМетода.Количество() Цикл
			НомерПараметраСтрокой = Формат(НомерПараметра-1, "ЧН=0; ЧГ=0");
			ПараметрыМетодаСтрока = РазделительПараметров + "ПараметрыМетода[" + НомерПараметраСтрокой + "]";
		КонецЦикла; 
		ПараметрыМетодаСтрока = Прав(ПараметрыМетодаСтрока, СтрДлина(ПараметрыМетодаСтрока) - СтрДлина(РазделительПараметров));
	КонецЕсли; 
	Выполнить("Объект." + ИмяМетода + "(" + ПараметрыМетодаСтрока + ")");
КонецФункции

Функция ПроверитьНаличиеСлужебногоСерверногоМетодаФормы(Форма) Экспорт
	
	ТестовыйКод =
	"Параметр1 = ПрограммныйКод;
	|Переменная = Новый ТаблицаЗначений;
	|Результат = ДополнительныеПараметры;";
	
	КонтрольныйРезультат = "777";
	Попытка
		Результат = Форма.СлужебнаяФункцияВызовСервера(ТестовыйКод, КонтрольныйРезультат);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Результат = Ложь;
	КонецПопытки;
	
	Если Результат <> КонтрольныйРезультат Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Результат = Форма.СлужебнаяФункцияВызовСервера("Результат = """ + КонтрольныйРезультат + """");
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Результат = Ложь;
	КонецПопытки;
	
	Если Результат <> КонтрольныйРезультат Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЗагрузитьДанныеФормыОбработкиИзФайлов(ПутьФайлаОбработки, ИмяФормы=Неопределено) Экспорт

	Перем РаботаСКоллекциями, РаботаСXMLКлиентСервер, ОбщегоНазначенияКлиентСервер;
	
	РаботаСКоллекциями = глОбщийМодуль("РаботаСКоллекциями");
	РаботаСXMLКлиентСервер = глОбщийМодуль("РаботаСXMLКлиентСервер");
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	ПутьФайлаОбработкиМассив = РаботаСКоллекциями.СтрокуВМассив(ПутьФайлаОбработки, "\");
	ИмяФайлаОбработки = ПутьФайлаОбработкиМассив[ПутьФайлаОбработкиМассив.ВГраница()];
	ПутьФайлаОбработкиМассив.Удалить(ПутьФайлаОбработкиМассив.ВГраница());
	КаталогОбработки = РаботаСКоллекциями.МассивВСтроку(ПутьФайлаОбработкиМассив, "\") + "\";
	
	Если ИмяФормы = Неопределено Тогда
		ОписаниеОбработки = РаботаСXMLКлиентСервер.ПолучитьСтруктуруТекстаXML(ПутьФайлаОбработки);
		ПутьФормы = РаботаСXMLКлиентСервер.ПолучитьУзелСтруктурыТекстаXML(ОписаниеОбработки, "MetaDataObject.ExternalDataProcessor.Properties.DefaultForm").Значение;
		ПутьФормыМассив = РаботаСКоллекциями.СтрокуВМассив(ПутьФормы, ".");
		ИмяФормы = ПутьФормыМассив[ПутьФормыМассив.ВГраница()];
	КонецЕсли;
	
	ИмяФайлаОбработкиМассив = РаботаСКоллекциями.СтрокуВМассив(ИмяФайлаОбработки, ".");
	ИмяФайлаОбработкиБезРасширения = ИмяФайлаОбработкиМассив[0];
	
	КаталогФормыОбработки = КаталогОбработки + ИмяФайлаОбработкиБезРасширения + "\Forms\" + ИмяФормы + "\Ext\";

	ОписаниеФормы = РаботаСXMLКлиентСервер.ПолучитьСтруктуруТекстаXML(КаталогФормыОбработки + "Form.xml");
	ТекстМодуля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстИзФайла(КаталогФормыОбработки + "Form\Module.bsl");
	УзелФормы = РаботаСXMLКлиентСервер.ПолучитьУзелСтруктурыТекстаXML(ОписаниеФормы, "Form");
	УзелМодуляФормы = РаботаСXMLКлиентСервер.НовыйУзелСтруктурыТекстаXML("Модуль", ТекстМодуля);
	РаботаСXMLКлиентСервер.ВставитьУзелВСтруктуруТекстаXML(УзелФормы, УзелМодуляФормы);

	Возврат ОписаниеФормы;
	
КонецФункции
