
&НаКлиенте
Процедура ВосстановитьОбъект(Команда)
	ПозицияОбъекта = СтрНайти(Запись.Комментарий, "<СериализацияОбъекта>");
	Если ПозицияОбъекта > 0 Тогда
		ТекстОбъекта = Сред(Запись.Комментарий, ПозицияОбъекта);
		ИмяФормыОбъекта = ПолучитьИмяФормыОбъекта(ТекстОбъекта);
		ФормаОбъекта = ПолучитьФорму(ИмяФормыОбъекта);
		ДанныеОбъекта = ПрочитатьДанныеОбъекта(ТекстОбъекта, ФормаОбъекта.Объект);
		КопироватьДанныеФормы(ДанныеОбъекта, ФормаОбъекта.Объект);
		ФормаОбъекта.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяФормыОбъекта(ТекстОбъекта)
	
	Объект = вмс_РаботаСXMLКлиентСервер.ПрочитатьТекстXMLУлучшенная(ТекстОбъекта);
	МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
	ПолноеИмя = МетаданныеОбъекта.ПолноеИмя();
	
	Возврат ПолноеИмя + "." + "ФормаОбъекта";
	
КонецФункции

&НаСервереБезКонтекста
Функция ПрочитатьДанныеОбъекта(ТекстОбъекта, знач ДанныеОбъекта)

	Объект = вмс_РаботаСXMLКлиентСервер.ПрочитатьТекстXMLУлучшенная(ТекстОбъекта);
	
	ЗначениеВДанныеФормы(Объект, ДанныеОбъекта);
	
	Возврат ДанныеОбъекта;
	
КонецФункции
