#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////////////////
//
//						Библиотека функций+
//

#Область БиблиотекаФункций

Функция НовыйРезультатАнализаЗаполненияПолейДанных() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаполненныеПоляМассив", Новый Массив);
	Результат.Вставить("НеЗаполненныеПоляМассив", Новый Массив);
	
	Результат.Вставить("ЗаполненныеПоля", "");
	Результат.Вставить("НеЗаполненныеПоля", "");
	
	Результат.Вставить("ОсновныеПоляЗаполнены", Ложь);
	Результат.Вставить("ВсеПоляЗаполнены", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ОбъединитьРезультатАнализаЗаполненияПолейДанных(ОбщийРезультат, Результат) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	РК.ДобавитьЭлементыКоллекции(ОбщийРезультат.ЗаполненныеПоляМассив, Результат.ЗаполненныеПоляМассив);
	РК.ДобавитьЭлементыКоллекции(ОбщийРезультат.НеЗаполненныеПоляМассив, Результат.НеЗаполненныеПоляМассив);
	ОбщийРезультат.ОсновныеПоляЗаполнены = ОбщийРезультат.ОсновныеПоляЗаполнены И Результат.ОсновныеПоляЗаполнены;
	
КонецФункции

Функция ФинализироватьРезультатАнализаЗаполненияПолейДанных(Результат) Экспорт
	
	Результат.ЗаполненныеПоля = СтрСоединить(Результат.ЗаполненныеПоляМассив, ", ");
	Результат.НеЗаполненныеПоля = СтрСоединить(Результат.НеЗаполненныеПоляМассив, ", ");
	Результат.ВсеПоляЗаполнены = Результат.НеЗаполненныеПоляМассив.Количество()=0;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

//
//						Библиотека функций-
//
////////////////////////////////////////////////////////////////////////////////////////////

	
#КонецЕсли
