

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьСхемуКомпоновкиПоУмолчанию();
	
	ИнициализироватьСхемуКомпоновкиПоПараметру(Параметры.Объект);
	
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	
	ПутьКДанным = "";
	Если Параметры.Свойство("ПутьКДанным", ПутьКДанным) И ЗначениеЗаполнено(ПутьКДанным) Тогда
		Поле = КомпоновщикНастроекКомпоновкиДанных.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ПутьКДанным));
		Если Поле <> Неопределено Тогда
			ИдентификаторКомпоновкиДанных = КомпоновщикНастроекКомпоновкиДанных.Настройки.Отбор.ДоступныеПоляОтбора.ПолучитьИдентификаторПоОбъекту(Поле);
			Элементы.КомпоновщикНастроекКомпоновкиДанныхНастройкиВыборДоступныеПоляВыбора.ТекущаяСтрока = ИдентификаторКомпоновкиДанных;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ИнициализироватьСхемуКомпоновкиПоУмолчанию()
	
	СКД = Новый СхемаКомпоновкиДанных;
	Если АдресСхемыКомпоновкиДанных="" Тогда
		ИсходныйАдресСхемыКомпоновкиДанных = УникальныйИдентификатор;
	Иначе
		ИсходныйАдресСхемыКомпоновкиДанных = АдресСхемыКомпоновкиДанных;
	КонецЕсли;
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД, ИсходныйАдресСхемыКомпоновкиДанных);
	
КонецФункции

&НаСервере
Функция ИнициализироватьСхемуКомпоновкиПоПараметру(Объект)
	
	Если ТипЗнч(Объект)=Тип("Строка") Тогда
		
		Если ЭтоАдресВременногоХранилища(Объект) Тогда
			СКД = ПолучитьИзВременногоХранилища(Объект);
		Иначе
			СКД = Новый СхемаКомпоновкиДанных;
			ИсточникДанных = СКД.ИсточникиДанных.Добавить();
			ИсточникДанных.Имя = "Источник1";
			ИсточникДанных.ТипИсточникаДанных = "Local";
			НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
			НаборДанных.Запрос = "ВЫБРАТЬ * ИЗ " + Объект;
			НаборДанных.ИсточникДанных = ИсточникДанных.Имя;
		КонецЕсли;
		
	КонецЕсли;

	Если СКД <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(СКД, АдресСхемыКомпоновкиДанных);
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура КомпоновщикНастроекКомпоновкиДанныхНастройкиВыборДоступныеПоляВыбораВыбор(Элемент, ИдентификаторКомпоновкиДанных, Поле, СтандартнаяОбработка)
	ВыбранноеПолеДанных = КомпоновщикНастроекКомпоновкиДанных.Настройки.Отбор.ДоступныеПоляОтбора.ПолучитьОбъектПоИдентификатору(ИдентификаторКомпоновкиДанных);
	Закрыть(ВыбранноеПолеДанных);
КонецПроцедуры

