#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьТаблицуКоманд(Обработки) Экспорт

	ТекстШаблонаЗапроса =
	"ВЫБРАТЬ
	|	ПечатныеФормыКоманды.Ссылка КАК Ссылка,
	|	ПечатныеФормыКоманды.Идентификатор КАК Идентификатор,
	|	ПечатныеФормыКоманды.Представление КАК Представление,
	|	ПечатныеФормыКоманды.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник.вмс_ПечатныеФормы.Команды КАК ПечатныеФормыКоманды
	|ГДЕ
	|	ПечатныеФормыКоманды.Ссылка В(&Обработки)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстШаблонаЗапроса;
	
	ИмяСправочника = "Справочник.ДополнительныеОтчетыИОбработки";
	Если Метаданные.НайтиПоПолномуИмени(ИмяСправочника) <> Неопределено Тогда
		ТекстЗапросаСправочника = ТекстШаблонаЗапроса;
		ТекстЗапросаСправочника = СтрЗаменить(ТекстЗапросаСправочника, "Справочник.вмс_ПечатныеФормы", ИмяСправочника);
		Запрос.Текст = Запрос.Текст + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС + ТекстЗапросаСправочника;
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст +
	"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Обработки", Обработки);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаКоманд = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаКоманд;

КонецФункции

Функция ПолучитьСписокКоманд(Обработки) Экспорт
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд(Обработки);
	
	СписокКоманд = Новый СписокЗначений;
	Для Каждого СтрокаКоманды Из ТаблицаКоманд Цикл
		СписокКоманд.Добавить(СтрокаКоманды.Идентификатор, СтрокаКоманды.Представление);
	КонецЦикла;
	
	Возврат СписокКоманд;
	
КонецФункции

#КонецЕсли
