//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

Функция АварийноеЗавершениеРаботы() Экспорт
	С666 = Новый Структура;
	С666.Вставить("AVESATAN", С666);
	КТУЛХУФХТАГН = Новый ХранилищеЗначения(С666);
КонецФункции

Функция ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита,ВыбратьРазрешенные = Ложь)Экспорт

	Если ПустаяСтрока(ИмяРеквизита) Тогда 
		ВызватьИсключение 
			НСтр("ru = 'Неверный второй параметр ИмяРеквизита в функции ОбщегоНазначения.ЗначениеРеквизитаОбъекта: 
			           |- Имя реквизита должно быть заполнено'");
	КонецЕсли;
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];


КонецФункции

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//                       требований к свойствам структуры.
//                       Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//                       псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                       значения (опционально) фактическое имя поля в таблице.
//                       Если ключ задан, а значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//                       к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то все реквизиты вернутся со 
//                                значением Неопределено; если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу 
//                                или любой из реквизитов.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//            - если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//            - если в параметр Ссылка передана пустая ссылка, то возвращается структура, 
//              соответствующая именам реквизитов со значениями Неопределено.
//            - если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//              то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт
	
	// Если передано имя предопределенного. 
	Если ТипЗнч(Ссылка) = Тип("Строка") Тогда 
		
		ПолноеИмяПредопределенногоЭлемента = Ссылка;
		
		// Вычисление ссылки по имени предопределенного.
		// - дополнительно выполняет проверку метаданных предопределенного, выполняется предварительно.
		Попытка
			Ссылка = ПредопределенноеЗначение(ПолноеИмяПредопределенногоЭлемента);
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный первый параметр Ссылка в функции ОбщегоНазначения.ЗначенияРеквизитовОбъекта:
			           |%1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
		
		// Разбор полного имени предопределенного.
		ЧастиПолногоИмени = СтрРазделить(ПолноеИмяПредопределенногоЭлемента, ".");
		ПолноеИмяОбъектаМетаданных = ЧастиПолногоИмени[0] + "." + ЧастиПолногоИмени[1];
		
		// Если предопределенный не создан в ИБ, то требуется выполнить проверку доступа к объекту.
		// В других сценариях проверка доступа выполняется в момент исполнения запроса.
		Если Ссылка = Неопределено Тогда 
			МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
			Если Не ПравоДоступа("Чтение", МетаданныеОбъекта) Тогда 
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Недостаточно прав для работы с таблицей ""%1""'"), ПолноеИмяОбъектаМетаданных);
			КонецЕсли;
		КонецЕсли;
		
	Иначе // Если передана ссылка.
		
		Попытка
			ПолноеИмяОбъектаМетаданных = Ссылка.Метаданные().ПолноеИмя(); 
		Исключение
			ВызватьИсключение 
				НСтр("ru = 'Неверный первый параметр Ссылка в функции ОбщегоНазначения.ЗначенияРеквизитовОбъекта: 
				           |- Значение должно быть ссылкой или именем предопределенного элемента'");
		КонецПопытки;
		
	КонецЕсли;
	
	// Разбор реквизитов, если второй параметр Строка.
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		
		// Удаление пробелов.
		Реквизиты = СтрЗаменить(Реквизиты, " ", "");
		// Преобразование параметра в массив полей.
		Реквизиты = СтрРазделить(Реквизиты, ",");
	КонецЕсли;
	
	// Приведение реквизитов к единому формату.
	СтруктураПолей = Новый Структура;
	Если ТипЗнч(Реквизиты) = Тип("Структура")
		Или ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		СтруктураПолей = Реквизиты;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
		Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		Для Каждого Реквизит Из Реквизиты Цикл
			
			Попытка
				ПсевдонимПоля = СтрЗаменить(Реквизит, ".", "");
				СтруктураПолей.Вставить(ПсевдонимПоля, Реквизит);
			Исключение 
				// Если псевдоним не является ключом.
				
				// Поиск ошибки доступности полей.
				Результат = НайтиОшибкуДоступностиРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных, Реквизиты);
				Если Результат.Ошибка Тогда 
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Неверный второй параметр Реквизиты в функции ОбщегоНазначения.ЗначенияРеквизитовОбъекта: %1'"),
						Результат.ОписаниеОшибки);
				КонецЕсли;
				
				// Не удалось распознать ошибку, проброс первичной ошибки.
				ВызватьИсключение;
			
			КонецПопытки;
		КонецЦикла;
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный тип второго параметра Реквизиты в функции ОбщегоНазначения.ЗначенияРеквизитовОбъекта: %1'"), 
			Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	// Подготовка результата (после выполнения запроса переопределится).
	Результат = Новый Структура;
	
	// Формирование текста запроса к выбираемым полям.
	ТекстЗапросаПолей = "";
	Для каждого КлючИЗначение Из СтруктураПолей Цикл
		
		ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
						КлючИЗначение.Значение,
						КлючИЗначение.Ключ);
		ПсевдонимПоля = КлючИЗначение.Ключ;
		
		ТекстЗапросаПолей = 
			ТекстЗапросаПолей + ?(ПустаяСтрока(ТекстЗапросаПолей), "", ",") + "
			|	" + ИмяПоля + " КАК " + ПсевдонимПоля;
		
		
		// Предварительное добавление поля по псевдониму в возвращаемый результат.
		Результат.Вставить(ПсевдонимПоля);
		
	КонецЦикла;
	
	// Если предопределенного нет в ИБ.
	// - приведение результата к отсутствию объекта в ИБ или передаче пустой ссылки.
	Если Ссылка = Неопределено Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|&ТекстЗапросаПолей
		|ИЗ
		|	&ПолноеИмяОбъектаМетаданных КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка";
	
	Если Не ВыбратьРазрешенные Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаПолей", ТекстЗапросаПолей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	
	// Выполнение запроса.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса;
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		
		// Если реквизиты были переданы строкой, то они уже конвертированы в массив.
		// Если реквизиты - массив, оставляем без изменений.
		// Если реквизиты - структура - конвертируем в массив.
		// В остальных случаях уже было бы выброшено исключение.
		Если Тип("Структура") = ТипЗнч(Реквизиты) Тогда
			Реквизиты = Новый Массив;
			Для каждого КлючИЗначение Из СтруктураПолей Цикл
				ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
							КлючИЗначение.Значение,
							КлючИЗначение.Ключ);
				Реквизиты.Добавить(ИмяПоля);
			КонецЦикла;
		КонецЕсли;
		
		// Поиск ошибки доступности полей.
		Результат = НайтиОшибкуДоступностиРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных, Реквизиты);
		Если Результат.Ошибка Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Неверный второй параметр Реквизиты в функции ОбщегоНазначения.ЗначенияРеквизитовОбъекта: %1'"), 
				Результат.ОписаниеОшибки);
		КонецЕсли;
		
		// Не удалось распознать ошибку, проброс первичной ошибки.
		ВызватьИсключение;
		
	КонецПопытки;
	
	// Заполнение реквизитов.
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Выполняет поиск проверяемых выражений среди реквизитов объекта метаданных.
// 
// Параметры:
//  ПолноеИмяОбъектаМетаданных - Строка - полное имя проверяемого объекта.
//  ПроверяемыеВыражения       - Массив - имена полей или проверяемые выражения объекта метаданных.
// 
// Возвращаемое значение:
//  Структура:
//   * Ошибка         - Булево - найдена ошибка.
//   * ОписаниеОшибки - Строка - описание найденных ошибок.
//
// Пример:
//  
// Реквизиты = Новый Массив;
// Реквизиты.Добавить("Номер");
// Реквизиты.Добавить("Валюта.НаименованиеПолное");
//
// Результат = ОбщегоНазначения.НайтиОшибкуДоступностиРеквизитовОбъекта("Документ._ДемоЗаказПокупателя", Реквизиты);
//
// Если Результат.Ошибка Тогда
//     ВызватьИсключение Результат.ОписаниеОшибки;
// КонецЕсли;
//
Функция НайтиОшибкуДоступностиРеквизитовОбъекта(ПолноеИмяОбъектаМетаданных, ПроверяемыеВыражения)
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	
	Если МетаданныеОбъекта = Неопределено Тогда 
		Возврат Новый Структура("Ошибка, ОписаниеОшибки", Истина, 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка получения метаданных ""%1""'"), ПолноеИмяОбъектаМетаданных));
	КонецЕсли;

	// Разрешение вызова из безопасного режима внешней обработки или расширения.
	// Информация о доступности полей источника схемы при проверке метаданных не является секретной.
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Схема = Новый СхемаЗапроса;
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Оператор = Пакет.Операторы.Получить(0);
	
	Источник = Оператор.Источники.Добавить(ПолноеИмяОбъектаМетаданных, "Таблица");
	ТекстОшибки = "";
	
	Для Каждого ТекущееВыражение Из ПроверяемыеВыражения Цикл
		
		Если Не ПолеИсточникаСхемыЗапросаДоступно(Источник, ТекущееВыражение) Тогда 
			ТекстОшибки = ТекстОшибки + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '- Поле объекта ""%1"" не найдено'"), ТекущееВыражение);
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат Новый Структура("Ошибка, ОписаниеОшибки", Не ПустаяСтрока(ТекстОшибки), ТекстОшибки);
	
КонецФункции

// Используется в НайтиОшибкуДоступностиРеквизитовОбъекта.
// Выполняет проверку доступности поля проверяемого выражения в источнике оператора схемы запроса.
//
Функция ПолеИсточникаСхемыЗапросаДоступно(ИсточникОператора, ПроверяемоеВыражение)
	
	ЧастиИмениПоля = СтрРазделить(ПроверяемоеВыражение, ".");
	ДоступныеПоля = ИсточникОператора.Источник.ДоступныеПоля;
	
	ТекущаяЧастьИмениПоля = 0;
	Пока ТекущаяЧастьИмениПоля < ЧастиИмениПоля.Количество() Цикл 
		
		ТекущееПоле = ДоступныеПоля.Найти(ЧастиИмениПоля.Получить(ТекущаяЧастьИмениПоля)); 
		
		Если ТекущееПоле = Неопределено Тогда 
			Возврат Ложь;
		КонецЕсли;
		
		// Инкрементация следующей части имени поля и соответствующего списка доступности полей.
		ТекущаяЧастьИмениПоля = ТекущаяЧастьИмениПоля + 1;
		ДоступныеПоля = ТекущееПоле.Поля;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьПолноеИмяПоТипу(Тип) Экспорт
	МетаДанныеОбъекта = МетаДанные.НайтиПоТипу(Тип);
	Если МетаДанныеОбъекта <> Неопределено Тогда
		Возврат МетаДанныеОбъекта.ПолноеИмя();
	КонецЕсли;
КонецФункции

Функция СлужебнаяФункцияВызовСервераНаФорме(Форма, ПрограммныйКод, ДополнительныеПараметры=Неопределено) Экспорт
	
	Результат = Неопределено;
	Выполнить(ПрограммныйКод);
	Возврат Результат;
	
КонецФункции

Функция ПрочитатьXMLВТаблицу(Знач XML) Экспорт
	
	Если ТипЗнч(XML) <> Тип("ЧтениеXML") Тогда
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(XML);
	Иначе
		Чтение = XML;
	КонецЕсли;
	
	// Прочитаем первый узел и проверим его.
	Если Не Чтение.Прочитать() Тогда
		ВызватьИсключение НСтр("ru = 'Пустой XML'");
	ИначеЕсли Чтение.Имя <> "Items" Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка в структуре XML'");
	КонецЕсли;
	
	// Получим описание таблицы и создадим ее.
	ИмяТаблицы = Чтение.ПолучитьАтрибут("Description");
	ИменаКолонок = СтрЗаменить(Чтение.ПолучитьАтрибут("Columns"), ",", Символы.ПС);
	Колонок = СтрЧислоСтрок(ИменаКолонок);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	Для Сч = 1 По Колонок Цикл
		ТаблицаЗначений.Колонки.Добавить(СтрПолучитьСтроку(ИменаКолонок, Сч), Новый ОписаниеТипов("Строка"));
	КонецЦикла;
	
	// Заполним значения в таблице.
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "Items" Тогда
			Прервать;
		ИначеЕсли Чтение.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		ИначеЕсли Чтение.Имя <> "Item" Тогда
			ВызватьИсключение НСтр("ru = 'Ошибка в структуре XML'");
		КонецЕсли;
		
		новСтр = ТаблицаЗначений.Добавить();
		Для Сч = 1 По Колонок Цикл
			ИмяКолонки = СтрПолучитьСтроку(ИменаКолонок, Сч);
			новСтр[Сч-1] = Чтение.ПолучитьАтрибут(ИмяКолонки);
		КонецЦикла;
		
	КонецЦикла;
	
	// Заполним результат
	Результат = Новый Структура;
	Результат.Вставить("ИмяТаблицы", ИмяТаблицы);
	Результат.Вставить("Данные", ТаблицаЗначений);
	
	Возврат Результат;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////
//
//				Преобразования Base64+
//   

Функция СправочникНайтиПоРеквизитуТЧ(ИмяСправочника, ИмяТч, ИмяРеквизита, ЗначениеРеквизита) Экспорт  
	ИмяТЧСокращенное = ИмяСправочника + ИмяТч;
	ИмяТЧПолное = "Справочник." + ИмяСправочника + "." + ИмяТЧ; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ " + 
	ИмяТЧСокращенное + "." + ИмяРеквизита + " КАК " + ИмяРеквизита + ", " +
	ИмяТЧСокращенное + "." + "Ссылка"     + " КАК " + "Ссылка" + 
	" ИЗ " + ИмяТЧПолное + " КАК " + ИмяТЧСокращенное +
	" ГДЕ " + ИмяТЧСокращенное + "." + ИмяРеквизита + " = " + ЗначениеРеквизита; 
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции 

Функция НайтиДопРеквизит(РеквизитНаименование, НаборСвойствНаименование) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Наименование = &РеквизитНаименование  
	|	И ДополнительныеРеквизитыИСведения.НаборСвойств.Наименование = &НаборСвойствНаименование";
	Запрос.УстановитьПараметр("РеквизитНаименование", РеквизитНаименование);
	Запрос.УстановитьПараметр("НаборСвойствНаименование", НаборСвойствНаименование);
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Возврат Результат.Ссылка;
	КонецЦикла;
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка();
КонецФункции

Функция ЗакодироватьСтрокуВBase64(Строка) Экспорт

	//ПотокВПамяти = Новый ПотокВПамяти;
	//ЗаписьТекста = Новый ЗаписьТекста(ПотокВПамяти, КодировкаТекста.ANSI);
	//ЗаписьТекста.Записать(Строка);
	//ЗаписьТекста.Закрыть();
	//ДвоичныеДанные = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();
	ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(Строка);
	СтрокаBase64 = ПолучитьBase64СтрокуИзДвоичныхДанных(ДвоичныеДанные);
	
	Возврат СтрокаBase64;
	
КонецФункции

Функция РазкодироватьСтрокуИзBase64(СтрокаBase64) Экспорт
	
	ДвоичныеДанные = Base64Значение(СтрокаBase64);
	
	Строка = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);
	
	Возврат Строка;
	
КонецФункции

//
//				Преобразования Base64-
//
/////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьРеквизитыОбъектов(Объекты, СписокРеквизитов, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если ТипЗнч(Объекты) = Тип("Массив") Тогда
		МассивОбъектов = Объекты;
	Иначе
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объекты);
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ИспользоватьДополнительныеРеквизиты = Не ДополнительныеПараметры.Свойство("ИспользоватьДополнительныеРеквизиты") ИЛИ ДополнительныеПараметры.ИспользоватьДополнительныеРеквизиты = Истина;
	Иначе
		ИспользоватьДополнительныеРеквизиты = Истина;
	КонецЕсли;
	
	Если ТипЗнч(СписокРеквизитов) = Тип("Строка") ИЛИ ТипЗнч(СписокРеквизитов) = Тип("Массив") Тогда
		Если ТипЗнч(СписокРеквизитов) = Тип("Строка") Тогда
			СписокРеквизитовМассив = вмс_РаботаСКоллекциями.СтрокуВМассив(СписокРеквизитов);
		Иначе
			СписокРеквизитовМассив = СписокРеквизитов;
		КонецЕсли;
		
		СписокРеквизитовСтруктура = Новый Структура;
		Для Каждого Поле Из СписокРеквизитовМассив Цикл
			ЧастиПоля = вмс_РаботаСКоллекциями.СтрокуВМассив(Поле, " КАК ");
			Если ЧастиПоля.Количество() = 2 Тогда
				ИмяПоля = ЧастиПоля[0];
				ПсевдонимПоля = ЧастиПоля[1];
			Иначе
				ИмяПоля = ЧастиПоля[0];
				ПсевдонимПоля = СтрЗаменить(ИмяПоля, ".", "");
			КонецЕсли;
			СписокРеквизитовСтруктура.Вставить(ПсевдонимПоля, ИмяПоля);
		КонецЦикла;
	ИначеЕсли ТипЗнч(СписокРеквизитов) = Тип("Структура") Тогда
		СписокРеквизитовСтруктура = СписокРеквизитов;
	Иначе
		// Не ОК
		Возврат Неопределено;
	КонецЕсли;
		
	СписокРеквизитовМассив = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(СписокРеквизитовСтруктура, "Значение");
	
	ТекстШаблона =
	"ВЫБРАТЬ
	|	&ТекстПолей КАК ТекстПолей
	|ИЗ
	|	Справочник.Номенклатура КАК таблицаОбъекта
	|//{ЛЕВЫЕ_СОЕДИНЕНИЯ}
	|ГДЕ
	|	таблицаОбъекта.Ссылка В(&МассивОбъектов)";
	
	Связка = Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС;
	
	ТекстШаблонаСоединенияДополнительногоРеквизита =
	Символы.ПС +
	"ЛЕВОЕ СОЕДИНЕНИЕ ДополнительныеРеквизитыОбъектов КАК ДополнительныеРеквизитыОбъектов1
	|ПО таблицаОбъекта.Ссылка = ДополнительныеРеквизитыОбъектов1.Объект
	|И &ИмяРеквизита = ДополнительныеРеквизитыОбъектов1.ИмяСвойства";
	
	ТекстЗапроса = "";
	
	ДанныеПоТипамОбъектов = Новый Соответствие;
	МассивДанныхПоТипамОбъектов = Новый Массив;
	
	ИспользуютсяДополнительныеРеквизиты = Ложь;
	Для Каждого Объект Из МассивОбъектов Цикл
		
		ТипОбъекта = ТипЗнч(Объект);
		ДанныеПоТипуОбъектов = ДанныеПоТипамОбъектов[ТипОбъекта];
		Если ДанныеПоТипуОбъектов = Неопределено Тогда
			МетаДанныеОбъекта = МетаДанные.НайтиПоТипу(ТипОбъекта);
			ДанныеПоТипуОбъектов = Новый Структура;
			ДанныеПоТипуОбъектов.Вставить("МассивОбъектов", Новый Массив);
			ДанныеПоТипуОбъектов.Вставить("ИмяТаблицыИБ", "");
			ДанныеПоТипуОбъектов.Вставить("ИмяПараметра", "");
			ДанныеПоТипамОбъектов[ТипОбъекта] = ДанныеПоТипуОбъектов;
			
			Если МетаДанныеОбъекта <> Неопределено Тогда
				СписокДоступныхРеквизитовМассив = НайтиДоступныеРеквизитыОбъекта(МетаДанныеОбъекта, СписокРеквизитовМассив);
				СписокРеквизитовСтрока = "";
				ТекстСоединенийДополнительныхРеквизитов = "";
				СвязкаПолей = "," + Символы.ПС + Символы.Таб;
				НомерДопСвойства = 1;
				Для Каждого Поле Из СписокРеквизитовСтруктура Цикл
					ПсевдонимПоля = Поле.Ключ;
					Если СписокДоступныхРеквизитовМассив.Найти(Поле.Значение) = Неопределено Тогда
						Если ИспользоватьДополнительныеРеквизиты Тогда
							НомерДопСвойстваСтрокой = Формат(НомерДопСвойства, "ЧГ=0");
							ТаблицаДополнительногоРеквизита = "ДополнительныеРеквизитыОбъектов" + НомерДопСвойстваСтрокой;
							ИмяПоля = ТаблицаДополнительногоРеквизита +  ".ЗначениеСвойства";
							ТекстСоединенияДополнительногоРеквизита = ТекстШаблонаСоединенияДополнительногоРеквизита;
							ТекстСоединенияДополнительногоРеквизита = СтрЗаменить(ТекстСоединенияДополнительногоРеквизита, "ДополнительныеРеквизитыОбъектов1", ТаблицаДополнительногоРеквизита);
							ТекстСоединенияДополнительногоРеквизита = СтрЗаменить(ТекстСоединенияДополнительногоРеквизита, "&ИмяРеквизита", """" + Поле.Значение + """");
							ТекстСоединенийДополнительныхРеквизитов = ТекстСоединенийДополнительныхРеквизитов + ТекстСоединенияДополнительногоРеквизита;
							НомерДопСвойства = НомерДопСвойства + 1;
							ИспользуютсяДополнительныеРеквизиты = Истина; //возможно используются
						Иначе
							ИмяПоля = "NULL";
						КонецЕсли;
					Иначе
						ИмяПоля = "таблицаОбъекта." + Поле.Значение;
					КонецЕсли;
					
					СписокРеквизитовСтрока = СписокРеквизитовСтрока + СвязкаПолей + ИмяПоля + " КАК " + ПсевдонимПоля;
				КонецЦикла;
				СписокРеквизитовСтрока = Прав(СписокРеквизитовСтрока, СтрДлина(СписокРеквизитовСтрока)-СтрДлина(СвязкаПолей));
				
				ИмяТаблицыИБ = МетаДанныеОбъекта.ПолноеИмя();
				ИмяПараметра = "МассивОбъектов" + СтрЗаменить(ИмяТаблицыИБ, ".", "_");
				ТекстОбъекта = ТекстШаблона;
				ТекстОбъекта = СтрЗаменить(ТекстОбъекта, "&ТекстПолей КАК ТекстПолей", СписокРеквизитовСтрока);
				ТекстОбъекта = СтрЗаменить(ТекстОбъекта, "Справочник.Номенклатура", ИмяТаблицыИБ);
				ТекстОбъекта = СтрЗаменить(ТекстОбъекта, "&МассивОбъектов", "&" + ИмяПараметра);
				ТекстОбъекта = СтрЗаменить(ТекстОбъекта, "//{ЛЕВЫЕ_СОЕДИНЕНИЯ}", ТекстСоединенийДополнительныхРеквизитов);
				ТекстЗапроса = ТекстЗапроса + Связка + ТекстОбъекта;
				ДанныеПоТипуОбъектов.ИмяТаблицыИБ = ИмяТаблицыИБ;
				ДанныеПоТипуОбъектов.ИмяПараметра = ИмяПараметра;
				МассивДанныхПоТипамОбъектов.Добавить(ДанныеПоТипуОбъектов);
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеПоТипуОбъектов.МассивОбъектов.Добавить(Объект);
		
	КонецЦикла;
	
	Если ТекстЗапроса = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса = Прав(ТекстЗапроса, СтрДлина(ТекстЗапроса)-СтрДлина(Связка));
	
	Запрос = Новый Запрос;
	
	Если НЕ ИспользуютсяДополнительныеРеквизиты Тогда
		ИспользоватьДополнительныеРеквизиты = Ложь;
	КонецЕсли;
	
	Если ИспользоватьДополнительныеРеквизиты Тогда
		ЗапросПоДополнительнымРеквизитам = вмс_УправлениеСвойствамиСервер.ПолучитьЗапросПоДополнительнымРеквизитамОбъектов(МассивОбъектов, "ДополнительныеРеквизитыОбъектов");
		ТекстЗапроса = ЗапросПоДополнительнымРеквизитам.Текст + Символы.ПС + ";" + Символы.ПС + Символы.ПС + ТекстЗапроса;
		Для Каждого Параметр Из ЗапросПоДополнительнымРеквизитам.Параметры Цикл
			Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
		КонецЦикла;
	КонецЕсли;

	Для Каждого ДанныеПоТипуОбъектов Из МассивДанныхПоТипамОбъектов Цикл
		Запрос.УстановитьПараметр(ДанныеПоТипуОбъектов.ИмяПараметра, ДанныеПоТипуОбъектов.МассивОбъектов);
	КонецЦикла;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРеквизитов = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаРеквизитов;
	
КонецФункции

Функция ДополнитьТаблицуРеквизитамиОбъектов(Таблица, КолонкиОбъектов, СписокРеквизитов) Экспорт
	
	Если ТипЗнч(КолонкиОбъектов) = Тип("Массив") Тогда
		КолонкиОбъектовМассив = КолонкиОбъектов;
	Иначе
		КолонкиОбъектовМассив = вмс_РаботаСКоллекциями.СтрокуВМассив(КолонкиОбъектов, ",");
	КонецЕсли;
	
	Если ТипЗнч(СписокРеквизитов) = Тип("Массив") Тогда
		СписокРеквизитовМассив = СписокРеквизитов;
	Иначе
		СписокРеквизитовМассив = вмс_РаботаСКоллекциями.СтрокуВМассив(СписокРеквизитов, ",");
	КонецЕсли;
	
	МассивОбъектов = Новый Массив;
	Для Каждого КолонкаОбъектов Из КолонкиОбъектовМассив  Цикл
		ОбъектыКолонки = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(Таблица, КолонкаОбъектов);
		вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(МассивОбъектов, ОбъектыКолонки);
		Если ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
			Для Каждого Реквизит Из СписокРеквизитовМассив Цикл
				ИмяРеквизита = КолонкаОбъектов + Реквизит;
				Таблица.Колонки.Добавить(ИмяРеквизита);
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;
	
	СписокРеквизитовЗапросаМассив = Новый Массив;
	СписокРеквизитовЗапросаМассив.Добавить("Ссылка");
	вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(СписокРеквизитовЗапросаМассив, СписокРеквизитовМассив);
	ТаблицаРеквизитов = ПолучитьРеквизитыОбъектов(МассивОбъектов, СписокРеквизитовЗапросаМассив);
	ТаблицаРеквизитов.Индексы.Добавить("Ссылка");
	
	Отбор = Новый Структура("Ссылка");
	Для Каждого Строка Из Таблица  Цикл
		Для Каждого КолонкаОбъектов Из КолонкиОбъектовМассив Цикл
			Отбор.Ссылка = Строка[КолонкаОбъектов];
			НайденныеРеквизиты = ТаблицаРеквизитов.НайтиСтроки(Отбор);
			Если НайденныеРеквизиты.Количество() > 0 Тогда
				НайденныеРеквизиты = НайденныеРеквизиты[0];
				Для Каждого Реквизит Из СписокРеквизитовМассив Цикл
					ИмяРеквизита = КолонкаОбъектов + Реквизит;
					Строка[ИмяРеквизита] = НайденныеРеквизиты[Реквизит];
				КонецЦикла; 
			Иначе
				Для Каждого Реквизит Из СписокРеквизитовМассив Цикл
					ИмяРеквизита = КолонкаОбъектов + Реквизит;
					Строка[ИмяРеквизита] = Неопределено;
				КонецЦикла; 
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла; 
	
КонецФункции

Функция НайтиДоступныеРеквизитыОбъекта(знач МетаданныеОбъекта, ПроверяемыеВыражения) Экспорт
	
	Если ТипЗнч(МетаданныеОбъекта) = Тип("Строка") Тогда
		ПолноеИмяОбъектаМетаданных = МетаданныеОбъекта;
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	Иначе
		ПолноеИмяОбъектаМетаданных = МетаданныеОбъекта.ПолноеИмя();
	КонецЕсли;
	
	МассивДоступныхРеквизитов = Новый Массив;
	
	Если МетаданныеОбъекта = Неопределено Тогда 
		Возврат МассивДоступныхРеквизитов;
	КонецЕсли;
	
	МассивПроверяемыхВыражений = вмс_РаботаСКоллекциями.ЗначениеВМассив(ПроверяемыеВыражения, , Ложь);
	
	////////////////////////////////////////////////////////////////////////////////////////////
	ТаблицаПроверяемыхВыражений = Новый ТаблицаЗначений;
	ТаблицаПроверяемыхВыражений.Колонки.Добавить("Имя");
	ТаблицаПроверяемыхВыражений.Колонки.Добавить("ЧастьПути");
	ТаблицаПроверяемыхВыражений.Колонки.Добавить("ПутьДоЭтогоУровня");
	ТаблицаПроверяемыхВыражений.Колонки.Добавить("Уровень");

	МаксУровень = 0;
	Для Каждого ТекущееВыражение Из МассивПроверяемыхВыражений Цикл
		
		ЧастиПути = вмс_РаботаСКоллекциями.СтрокуВМассив(ТекущееВыражение, ".");
		ПутьДоЭтогоУровня = "";
		Для Уровень=0 По ЧастиПути.ВГраница() Цикл
			ЧастьПути = ЧастиПути[Уровень];
			ПутьДоЭтогоУровня = ПутьДоЭтогоУровня + ЧастьПути;
			СтрокаПроверяемогоВыражения = ТаблицаПроверяемыхВыражений.Добавить();
			СтрокаПроверяемогоВыражения.Имя = ТекущееВыражение;
			СтрокаПроверяемогоВыражения.ЧастьПути = ЧастьПути;
			СтрокаПроверяемогоВыражения.ПутьДоЭтогоУровня = ПутьДоЭтогоУровня;
			СтрокаПроверяемогоВыражения.Уровень = Уровень;
			МаксУровень = Макс(МаксУровень, Уровень);
			ПутьДоЭтогоУровня = ПутьДоЭтогоУровня + ".";
		КонецЦикла; 
		
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////////////////////
	ТаблицаДоступныхРеквизитов = Новый ТаблицаЗначений;
	ТаблицаДоступныхРеквизитов.Колонки.Добавить("Имя");
	ТаблицаДоступныхРеквизитов.Колонки.Добавить("Реквизит");
	ТаблицаДоступныхРеквизитов.Колонки.Добавить("Путь");
	ТаблицаДоступныхРеквизитов.Колонки.Добавить("Тип");
	
	Источники = Новый ТаблицаЗначений;
	Источники.Колонки.Добавить("Объект");
	Источники.Колонки.Добавить("Путь");
	Источники.Колонки.Добавить("Тип");
	
	ТипыИсточников = Новый Структура;
	ТипыИсточников.Вставить("МетаДанныеОбъекта", 0);
	ТипыИсточников.Вставить("Реквизит", 1);
	ТипыИсточников.Вставить("Тип", 2);
	ТипыИсточников.Вставить("ТабличнаяЧасть", 3);
	
	Источник = Источники.Добавить();
	Источник.Объект = МетаданныеОбъекта;
	Источник.Путь = "";
	Источник.Тип = ТипыИсточников.МетаДанныеОбъекта;
	
	МетаДанныеТипов = Новый Соответствие;
	
	Для Уровень=0 По МаксУровень Цикл
		
		СтрокиПроверяемыхВыражений = ТаблицаПроверяемыхВыражений.НайтиСтроки(Новый Структура("Уровень", Уровень));
		Если СтрокиПроверяемыхВыражений.Количество() = 0 Тогда
			Прервать;
		КонецЕсли; 
		
		/////////////////////////////////////////////////////////////////////
		// получение доступных реквизитов из источников
		
		Для Каждого Источник Из Источники Цикл
			
			Если Источник.Тип = ТипыИсточников.МетаДанныеОбъекта ИЛИ Источник.Тип = ТипыИсточников.ТабличнаяЧасть Тогда
				
				ПутьИсточника = ?(ЗначениеЗаполнено(Источник.Путь), Источник.Путь + ".", "");
				Объект = Источник.Объект;
				ЭтоСсылочныйТип = МетаДанные.Справочники.Содержит(Объект) ИЛИ МетаДанные.ПланыВидовХарактеристик.Содержит(Объект) ИЛИ МетаДанные.Документы.Содержит(Объект);
				Если Источник.Тип = ТипыИсточников.ТабличнаяЧасть ИЛИ ЭтоСсылочныйТип ИЛИ МетаДанные.Перечисления.Содержит(Объект) Тогда
					
					Если ЭтоСсылочныйТип Тогда
						ИмяРеквизита = "ВерсияДанных";
						СтрокаРеквизита = ТаблицаДоступныхРеквизитов.Добавить();
						СтрокаРеквизита.Имя = ИмяРеквизита;
						СтрокаРеквизита.Реквизит = Неопределено;
						СтрокаРеквизита.Путь = ПутьИсточника + ИмяРеквизита;
						СтрокаРеквизита.Тип = ТипыИсточников.Реквизит;
					КонецЕсли;
					
					Для Каждого Реквизит Из Объект.СтандартныеРеквизиты Цикл
						ИмяРеквизита = Реквизит.Имя;
						СтрокаРеквизита = ТаблицаДоступныхРеквизитов.Добавить();
						СтрокаРеквизита.Имя = ИмяРеквизита;
						СтрокаРеквизита.Реквизит = Реквизит;
						СтрокаРеквизита.Путь = ПутьИсточника + ИмяРеквизита;
						СтрокаРеквизита.Тип = ТипыИсточников.Реквизит;
					КонецЦикла; 
					
					Если Источник.Тип = ТипыИсточников.ТабличнаяЧасть ИЛИ ЭтоСсылочныйТип Тогда
						Для Каждого Реквизит Из Объект.Реквизиты Цикл
							СтрокаРеквизита = ТаблицаДоступныхРеквизитов.Добавить();
							СтрокаРеквизита.Имя = Реквизит.Имя;
							СтрокаРеквизита.Реквизит = Реквизит;
							СтрокаРеквизита.Путь = ПутьИсточника + Реквизит.Имя;
							СтрокаРеквизита.Тип = ТипыИсточников.Реквизит;
						КонецЦикла; 
					
						Если ЭтоСсылочныйТип Тогда
							Для Каждого Реквизит Из Объект.ТабличныеЧасти Цикл
								СтрокаРеквизита = ТаблицаДоступныхРеквизитов.Добавить();
								СтрокаРеквизита.Имя = Реквизит.Имя;
								СтрокаРеквизита.Реквизит = Реквизит;
								СтрокаРеквизита.Путь = ПутьИсточника + Реквизит.Имя;
								СтрокаРеквизита.Тип = ТипыИсточников.ТабличнаяЧасть;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли; 
				
			ИначеЕсли Источник.Тип = ТипыИсточников.Реквизит Тогда
				
				ПутьИсточника = Источник.Путь;
				Типы = Источник.Объект.Тип.Типы();
				Для Каждого Тип Из Типы Цикл
					Источник = Источники.Добавить();
					Источник.Объект = Тип;
					Источник.Путь = ПутьИсточника;
					Источник.Тип = ТипыИсточников.Тип;
				КонецЦикла;
				
			ИначеЕсли Источник.Тип = ТипыИсточников.Тип Тогда
				
				ПутьИсточника = Источник.Путь;
				Тип = Источник.Объект;
				МетаДанныеТипаСтруктура = МетаДанныеТипов[Тип];
				Если МетаДанныеТипаСтруктура = Неопределено Тогда
					МетаДанныеТипа = МетаДанные.НайтиПоТипу(Тип);
					МетаДанныеТипаСтруктура = Новый Структура("Данные", МетаДанныеТипа);
					МетаДанныеТипов[Тип] = МетаДанныеТипаСтруктура;
				Иначе
					МетаДанныеТипа = МетаДанныеТипаСтруктура.Данные;
				КонецЕсли; 
				
				Если МетаДанныеТипа <> Неопределено Тогда
					
					Источник = Источники.Добавить();
					Источник.Объект = МетаДанныеТипа;
					Источник.Путь = ПутьИсточника;
					Источник.Тип = ТипыИсточников.МетаДанныеОбъекта;
						
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		/////////////////////////////////////////////////////////////////////
		// проверить выражения
		МассивРеквизитов = Новый Массив;
		Для Каждого СтрокаПроверяемогоВыражения Из СтрокиПроверяемыхВыражений Цикл
			НайденныеРеквизиты = ТаблицаДоступныхРеквизитов.НайтиСтроки(Новый Структура("Путь", СтрокаПроверяемогоВыражения.ПутьДоЭтогоУровня));
			Если НайденныеРеквизиты.Количество() > 0 Тогда
				вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(МассивРеквизитов, НайденныеРеквизиты);
			Иначе
				МассивУдаляемыхСтрок = ТаблицаПроверяемыхВыражений.НайтиСтроки(Новый Структура("Имя", СтрокаПроверяемогоВыражения.Имя));
				вмс_РаботаСКоллекциями.УдалитьЭлементыКоллекции(ТаблицаПроверяемыхВыражений, МассивУдаляемыхСтрок);
			КонецЕсли;
		КонецЦикла;
		
		/////////////////////////////////////////////////////////////////////
		//
		Если Уровень = МаксУровень Тогда
			Прервать;
		КонецЕсли; 
		
		/////////////////////////////////////////////////////////////////////
		// получить вложенные реквизиты
		Источники.Очистить();
		вмс_РаботаСКоллекциями.УдалитьДублиВМассиве(МассивРеквизитов);
		Для Каждого СтрокаРеквизита Из МассивРеквизитов Цикл
			Если СтрокаРеквизита.Реквизит <> Неопределено Тогда
				Источник = Источники.Добавить();
				Источник.Объект = СтрокаРеквизита.Реквизит;
				Источник.Путь = СтрокаРеквизита.Путь;
				Источник.Тип = СтрокаРеквизита.Тип;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаДоступныхРеквизитов.Очистить();
		
	КонецЦикла;
	
	ТаблицаПроверяемыхВыражений.Свернуть("Имя");
	МассивДоступныхРеквизитов = ТаблицаПроверяемыхВыражений.ВыгрузитьКолонку("Имя");
		
	Возврат МассивДоступныхРеквизитов;
	
КонецФункции

Функция ПолучитьДанныеТипаОбъекта(знач ТипОбъекта) Экспорт
	
	Если ТипЗнч(ТипОбъекта) = Тип("Строка") Тогда
		ИмяТипа = ТипОбъекта;
		Попытка
			ТипОбъекта = Тип(ИмяТипа);
		Исключение
			ТипОбъекта = Неопределено;
		КонецПопытки;
	Иначе
		ИмяТипа = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИмяТипа(ТипОбъекта);
	КонецЕсли;
	
	МетаДанныеОбъекта = вмс_ОбщегоНазначенияСервер.ПолучитьМетаданныеОбъекта(ТипОбъекта);
	
	ЭтоТипОбъектаИБ = ИмяТипа <> Неопределено И (Найти(ИмяТипа, "Объект.") > 0 ИЛИ Найти(ИмяТипа, "НаборЗаписей.") > 0);
	ЭтоТипСсылкиОбъектаИБ =  ИмяТипа <> Неопределено И Найти(ИмяТипа, "Ссылка.") > 0;
	ЕстьМетаданныеОбъекта = МетаДанныеОбъекта <> Неопределено;
	
	ЭтоПеречисление = Ложь;
	СоответствиеЗначенийПоИмени = Новый Соответствие;
	
	Если МетаДанныеОбъекта <> Неопределено Тогда
		МенеджерОбъектов = вмс_ОбщегоНазначенияСервер.ПолучитьМенеджерОбъектов(ИмяТипа);
		Если МетаДанные.Перечисления.Содержит(МетаДанныеОбъекта) Тогда
			Для Каждого ЗначениеПеречисления Из МетаДанныеОбъекта.ЗначенияПеречисления Цикл
				СоответствиеЗначенийПоИмени[ВРЕГ(ЗначениеПеречисления.Имя)] = МенеджерОбъектов[ЗначениеПеречисления.Имя];
			КонецЦикла;
			ЭтоПеречисление = Истина;
		КонецЕсли;
	КонецЕсли;

	Данные = Новый Структура;
	Данные.Вставить("Имя", ИмяТипа);
	Данные.Вставить("ЭтоТипОбъектаИБ", ЭтоТипОбъектаИБ);
	Данные.Вставить("ЭтоТипСсылкиОбъектаИБ", ЭтоТипСсылкиОбъектаИБ);
	Данные.Вставить("ЕстьМетаданныеОбъекта", ЕстьМетаданныеОбъекта);
	Данные.Вставить("ЭтоПеречисление", ЭтоПеречисление);
	Данные.Вставить("СоответствиеЗначенийПоИмени", СоответствиеЗначенийПоИмени);
	Данные.Вставить("МенеджерОбъектов", МенеджерОбъектов);
	Данные.Вставить("ТипОбъекта", ТипОбъекта);
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьМенеджерОбъектов(Объект) Экспорт
	
	МенеджерОбъекта = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьМенеджерОбъектов(Объект);
	Если МенеджерОбъекта <> Неопределено Тогда
		Возврат МенеджерОбъекта;
	КонецЕсли;
	
	МенеджерОбъекта = ПолучитьМенеджерОбъектовБазы(Объект);
	Возврат МенеджерОбъекта;
	
КонецФункции

Функция ПолучитьМенеджерОбъектовБазы(Объект) Экспорт
	
	МетаданныеОбъекта = ПолучитьМетаДанныеОбъекта(Объект);
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();

	ЭлементыИмени = вмс_РаботаСКоллекциями.ЗначениеВМассив(ИмяОбъекта, ".", Ложь);
	Если ЭлементыИмени.Количество() <> 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Имя1 = ЭлементыИмени[0];
	Имя2 = ЭлементыИмени[1];
	Если Имя1 = "Справочник" Тогда
		Имя1 = "Справочники";
	ИначеЕсли Имя1 = "Документ" Тогда 
		Имя1 = "Документы";
	ИначеЕсли Имя1 = "ПланВидовХарактеристик" Тогда 
		Имя1 = "ПланыВидовХарактеристик";
	ИначеЕсли Имя1 = "РегистрНакопления" Тогда 
		Имя1 = "РегистрыНакопления";
	ИначеЕсли Имя1 = "РегистрСведений" Тогда 
		Имя1 = "РегистрыСведений";
	ИначеЕсли Имя1 = "Перечисление" Тогда 
		Имя1 = "Перечисления";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Менеджер = Вычислить(Имя1 + "[""" + Имя2 + """]");
	Возврат Менеджер;
	
КонецФункции

Функция ПолучитьМетаданныеОбъекта(знач Объект) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = Тип("Массив") Тогда
		Объект = РК.МассивВСтроку(Объект, ".");
		ТипОбъекта = ТипЗнч(Объект);
	КонецЕсли;
	
	Если ТипОбъекта = Тип("Строка") Тогда
		ИмяОбъекта = Объект;
		ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "Объект.", ".");
		ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "Ссылка.", ".");
		ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "НаборЗаписей.", ".");
		ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "Object.", ".");
		ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "Ref.", ".");
		ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "RecordSet.", ".");
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяОбъекта);
	ИначеЕсли ТипОбъекта = Тип("Тип") Тогда
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(Объект);
	ИначеЕсли ТипОбъекта = Тип("ОбъектМетаданных") Тогда
		МетаданныеОбъекта = Объект;
	Иначе
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипОбъекта);
	КонецЕсли;
	
	Возврат МетаданныеОбъекта;
	
КонецФункции

Функция ПолучитьОбъектИБ(знач ТипОбъекта=Неопределено, пСсылка=Неопределено, пЭтоГруппа=Неопределено) Экспорт
	
	Перем Гуид, Ссылка, ЭтоГруппа, Объект;
	
	Если ТипОбъекта = Неопределено Тогда
		Если пСсылка = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ТипОбъекта = ТипЗнч(пСсылка);
	КонецЕсли;
	
	Если пСсылка <> Неопределено Тогда
		Если ТипЗнч(пСсылка) = Тип("Строка") Тогда
			Гуид = Новый УникальныйИдентификатор(пСсылка);
		ИначеЕсли ТипЗнч(пСсылка) = Тип("УникальныйИдентификатор") Тогда
			Гуид = пСсылка;
		Иначе
			Гуид = пСсылка.УникальныйИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	МетаданныеОбъекта = ПолучитьМетаДанныеОбъекта(ТипОбъекта);
	Если МетаданныеОбъекта <> Неопределено Тогда
		
		Менеджер = ПолучитьМенеджерОбъектовБазы(МетаданныеОбъекта);
		Если Гуид <> Неопределено Тогда
			Ссылка = Менеджер.ПолучитьСсылку(Гуид);
		КонецЕсли;

		Если ТипЗнч(пЭтоГруппа) = Тип("Строка") Тогда
			ЭтоГруппа = XMLЗначение(Тип("Булево"), пЭтоГруппа);
		Иначе
			ЭтоГруппа = пЭтоГруппа = Истина;
		КонецЕсли;
		
		Если Ссылка <> Неопределено И НЕ Ссылка.Пустая() Тогда
			Объект = Ссылка.ПолучитьОбъект();
			Если Объект <> Неопределено Тогда
				// объект существует
				Если Метаданные.Справочники.Содержит(МетаданныеОбъекта) ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеОбъекта) Тогда
					Если Объект.ЭтоГруппа=ЭтоГруппа Тогда
						Возврат Объект;
					КонецЕсли;
				Иначе
					Возврат Объект;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		// создаем новый объект
		Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
			Объект = Менеджер.СоздатьДокумент();
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаданныеОбъекта) ИЛИ Метаданные.РегистрыНакопления.Содержит(МетаДанныеОбъекта) Тогда
			Объект = Менеджер.СоздатьНаборЗаписей();
		Иначе
			Если ЭтоГруппа Тогда
				Объект = Менеджер.СоздатьГруппу();
			Иначе
				Объект = Менеджер.СоздатьЭлемент();
			КонецЕсли;
		КонецЕсли;

		Если Ссылка <> Неопределено Тогда
			Объект.УстановитьСсылкуНового(Ссылка);
		КонецЕсли;
		
	ИначеЕсли Гуид <> Неопределено Тогда
		
		МетаданныеОбъекта = ПолучитьМетаДанныеОбъекта("Справочник.КвазиСсылки");
		Если МетаданныеОбъекта <> Неопределено Тогда
			Менеджер = ПолучитьМенеджерОбъектовБазы(МетаданныеОбъекта);
			Если ТипЗнч(ТипОбъекта) = Тип("Строка") Тогда
				// создаем квази объект
				ИмяТипаОбъекта = ТипОбъекта;
				ИмяТипаОбъекта = СтрЗаменить(ИмяТипаОбъекта, "Ссылка.", ".");
				ИмяТипаОбъекта = СтрЗаменить(ИмяТипаОбъекта, "Объект.", ".");
				Объект = вмс_ОбщегоНазначенияВызовСервера.ПолучитьОбъектКвазиСсылкиИБ(ИмяТипаОбъекта, Гуид);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции

Функция ПолучитьТаблицуИменТиповОбъектов(Объекты) Экспорт

	Перем РК;
	
	РК = вмс_РаботаСКоллекциями;
	
	Кэш = Новый Соответствие;
	
	ТаблицаИмен = РК.НоваяТаблицаЗначений("Объект, ИмяТипа, ЭтоКвазиТип");
	ТипКвазиСсылки = Тип("СправочникСсылка.КвазиСсылки");
	МассивОбъектов = РК.ЗначениеВМассив(Объекты, , Ложь);
	Для Каждого Объект Из МассивОбъектов Цикл
		
		ТипОбъекта = ТипЗнч(Объект);
		Если ТипОбъекта = ТипКвазиСсылки Тогда 
			ЭтоКвазиТип = Истина;
			ИмяТипа = Кэш[Объект];
			Если ИмяТипа = Неопределено Тогда
				ИмяТипа = Объект.ИмяТипа;
				Кэш[Объект] = Истина;
			КонецЕсли;
		Иначе
			ЭтоКвазиТип = Ложь;
			ИмяТипа = Кэш[ТипОбъекта];
			Если ИмяТипа = Неопределено Тогда
				МетаДанныеОбъекта = МетаДанные.НайтиПоТипу(ТипОбъекта);
				Если МетаДанныеОбъекта <> Неопределено Тогда
					ИмяТипа = МетаДанныеОбъекта.ПолноеИмя();
				Иначе
					ИмяТипа = "";
				КонецЕсли;
				Кэш[ТипОбъекта] = ИмяТипа;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаИмени = ТаблицаИмен.Добавить();
		СтрокаИмени.Объект = Объект;
		СтрокаИмени.ИмяТипа = ИмяТипа;
		СтрокаИмени.ЭтоКвазиТип = ЭтоКвазиТип;
		
	КонецЦикла;
	
	Возврат ТаблицаИмен;
	
КонецФункции

Функция ПолучитьТаблицуБлизостиЭлементов(Элементы) Экспорт
	
	Возврат ПолучитьТаблицуБлизостиЭлементов1(Элементы);
	
КонецФункции
	
Функция ПолучитьТаблицуБлизостиЭлементов1(Элементы) Экспорт

	Перем РК;
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаИменТиповОбъектов = ПолучитьТаблицуИменТиповОбъектов(Элементы);
	
	ТаблицаИменТипов = ТаблицаИменТиповОбъектов.Скопировать();
	ТаблицаИменТипов.Свернуть("ИмяТипа");
	ТаблицаИменТипов.Колонки.Добавить("ИмяПараметраЗапроса");
	ТаблицаИменТипов.Колонки.Добавить("МетаданныеОбъекта");
	
	МассивТипов = Новый Массив;
	Для Каждого СтрокаТипа Из ТаблицаИменТипов Цикл
		ИмяТипа = СтрЗаменить(СтрокаТипа.ИмяТипа, ".", "Ссылка.");
		МассивТипов.Добавить(Тип(ИмяТипа));
	КонецЦикла;
	Если МассивТипов.Количество() = 0 Тогда
		МассивТипов.Добавить(Тип("Число"));
	КонецЕсли;
	ТипКолонки = Новый ОписаниеТипов(МассивТипов);

	ИндексСтроки = ТаблицаИменТипов.Количество();
	Пока ИндексСтроки > 0 Цикл
		ИндексСтроки = ИндексСтроки - 1;
		СтрокаТипа = ТаблицаИменТипов[ИндексСтроки];
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(СтрокаТипа.ИмяТипа);
		Если МетаданныеОбъекта = Неопределено
			ИЛИ Не Метаданные.Справочники.Содержит(МетаданныеОбъекта) И Не Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеОбъекта) Тогда
			ТаблицаИменТипов.Удалить(СтрокаТипа);
			Продолжить;
		КонецЕсли;
		СтрокаТипа.МетаданныеОбъекта = МетаданныеОбъекта;
	КонецЦикла;

	ТекстШаблонаЗапросаПоОбъекту =
	"ВЫБРАТЬ
	|	ТаблицаОбъекта.Ссылка КАК Элемент,
	|	ТаблицаОбъекта.Родитель КАК Родитель,
	|	&ИмяТипа КАК ИмяТипа
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК ТаблицаОбъекта
	|ГДЕ
	|	ТаблицаОбъекта.Ссылка В(&МассивОбъектов)";
	
	Запрос = Новый Запрос;
	
	ТекстЗапросаПоОбъектам = "";
	СвязкаТекстовЗапросов = Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС;
	ПрефиксПараметра = "МассивОбъектов";
	НомерЗапроса = 1;
	МассивТипов = Новый Массив;
	Для Каждого СтрокаТипа Из РК.ВыгрузитьЭлементыКоллекцииВМассив(ТаблицаИменТипов) Цикл
		МассивТипов.Добавить(Тип(ИмяТипа));
		МетаданныеОбъекта = СтрокаТипа.МетаданныеОбъекта;
		Если Не МетаданныеОбъекта.Иерархический Тогда
			ТаблицаИменТипов.Удалить(СтрокаТипа);
			Продолжить;
		КонецЕсли;
		
		ИмяТаблицы = СтрокаТипа.ИмяТипа;
		НомерЗапросаСтрокой = Формат(НомерЗапроса, "ЧГ=0");
		ИмяПараметра = ПрефиксПараметра + НомерЗапросаСтрокой;
		ТекстЗапросаПоОбъекту = ТекстШаблонаЗапросаПоОбъекту;
		ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "Справочник.вмс_МестаХранения", ИмяТаблицы);
		ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "&ИмяТипа", """" + ИмяТаблицы + """");
		ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "&" + ПрефиксПараметра, "&" + ИмяПараметра);
		Если ТекстЗапросаПоОбъектам <> "" Тогда
			ТекстЗапросаПоОбъектам = ТекстЗапросаПоОбъектам + СвязкаТекстовЗапросов;
		КонецЕсли;
		ТекстЗапросаПоОбъектам = ТекстЗапросаПоОбъектам + ТекстЗапросаПоОбъекту;

		МассивОбъектов = РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаИменТиповОбъектов.НайтиСтроки(Новый Структура("ИмяТипа", СтрокаТипа.ИмяТипа)), "Объект");
		Запрос.УстановитьПараметр(ИмяПараметра, МассивОбъектов);
		
		СтрокаТипа.ИмяПараметраЗапроса = ИмяПараметра;
		НомерЗапроса = НомерЗапроса + 1;
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапросаПоОбъектам;
	
	ТаблицаБлизости = Новый ТаблицаЗначений;
	ТаблицаБлизости.Колонки.Добавить("Элемент", ТипКолонки);
	ТаблицаБлизости.Колонки.Добавить("Предок", ТипКолонки);
	ТаблицаБлизости.Колонки.Добавить("ИмяТипа", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(200)));
	ТаблицаБлизости.Индексы.Добавить("Предок");
	Для Каждого СтрокаОбъекта Из ТаблицаИменТиповОбъектов Цикл
		СтрокаБлизости = ТаблицаБлизости.Добавить();
		СтрокаБлизости.Элемент = СтрокаОбъекта.Объект;
		СтрокаБлизости.Предок = СтрокаОбъекта.Объект;
		СтрокаБлизости.ИмяТипа = СтрокаОбъекта.ИмяТипа;
	КонецЦикла;
	
	Пока ТаблицаИменТипов.Количество() > 0 Цикл
			
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаЭлементов = РезультатЗапроса.Выгрузить();
		Для Каждого СтрокаЭлемента Из ТаблицаЭлементов Цикл
			НайденныеСтрокиБлизости = ТаблицаБлизости.НайтиСтроки(Новый Структура("Предок", СтрокаЭлемента.Элемент));
			Для Каждого СтрокаБлизости Из НайденныеСтрокиБлизости Цикл
				НоваяСтрокаБлизости = ТаблицаБлизости.Добавить();
				НоваяСтрокаБлизости.Элемент = СтрокаБлизости.Элемент;
				НоваяСтрокаБлизости.Предок = СтрокаЭлемента.Родитель;
				НоваяСтрокаБлизости.ИмяТипа = СтрокаЭлемента.ИмяТипа;
			КонецЦикла;
		КонецЦикла;
		
		ИндексСтроки = ТаблицаИменТипов.Количество();
		Пока ИндексСтроки > 0 Цикл
			ИндексСтроки = ИндексСтроки - 1;
			СтрокаТипа = ТаблицаИменТипов[ИндексСтроки];
			МассивОбъектов = РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаЭлементов.НайтиСтроки(Новый Структура("ИмяТипа", СтрокаТипа.ИмяТипа)), "Родитель");
			Запрос.УстановитьПараметр(СтрокаТипа.ИмяПараметраЗапроса, МассивОбъектов);
			Если МассивОбъектов.Количество() = 0 Тогда
				ТаблицаИменТипов.Удалить(СтрокаТипа);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаБлизости.Свернуть("Элемент, Предок, ИмяТипа");
	Возврат ТаблицаБлизости;

КонецФункции

Функция ПолучитьТаблицуБлизостиЭлементов2(Элементы, МаксимальнаяГлубина=Неопределено) Экспорт
	
	Запрос = ПолучитьЗапросПоТаблицеБлизостиЭлементов(Элементы, МаксимальнаяГлубина);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаБлизостиЭлементов = РезультатЗапроса.Выгрузить();
	ТаблицаБлизостиЭлементов.Сортировать("Элемент, Уровень");
	Возврат ТаблицаБлизостиЭлементов;
	
КонецФункции

Функция ПолучитьЗапросПоТаблицеБлизостиЭлементов(Элементы, знач МаксимальнаяГлубина=Неопределено, ИмяВременнойТаблицы=Неопределено) Экспорт
	
	Перем РК;
	
	РК = вмс_РаботаСКоллекциями;
	
	Если МаксимальнаяГлубина = Неопределено Тогда
		МаксимальнаяГлубина = 20;
	КонецЕсли;
	
	МассивЭлементов = РК.ЗначениеВМассив(Элементы, , Ложь);
	ТаблицаТиповЭлементов = Новый ТаблицаЗначений;
	ТаблицаТиповЭлементов.Колонки.Добавить("Тип");
	ТаблицаТиповЭлементов.Колонки.Добавить("ИмяТипа");
	ТаблицаТиповЭлементов.Колонки.Добавить("Иерархический");
	
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	ТаблицаЭлементов.Колонки.Добавить("Тип");
	ТаблицаЭлементов.Колонки.Добавить("Элемент");
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		ТипЭлемента = ТипЗнч(Элемент);
		Если ТаблицаТиповЭлементов.НайтиСтроки(Новый Структура("Тип", ТипЭлемента)).Количество() = 0 Тогда
			МетаданныеЭлемента = Метаданные.НайтиПоТипу(ТипЭлемента);
			Если МетаданныеЭлемента <> Неопределено Тогда
				СтрокаТипаЭлементов = ТаблицаТиповЭлементов.Добавить();
				СтрокаТипаЭлементов.Тип = ТипЭлемента;
				СтрокаТипаЭлементов.ИмяТипа = МетаданныеЭлемента.ПолноеИмя();
				СтрокаТипаЭлементов.Иерархический = (Метаданные.Справочники.Содержит(МетаданныеЭлемента) ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеЭлемента)) И МетаданныеЭлемента.Иерархический;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаЭлемента = ТаблицаЭлементов.Добавить();
		СтрокаЭлемента.Тип = ТипЭлемента;
		СтрокаЭлемента.Элемент = Элемент;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	ТекстШаблонаЗапросаОсновнойТаблицы =
	"ВЫБРАТЬ
	|	ТаблицаЭлементовИБ.Ссылка КАК Элемент,
	|	ТаблицаЭлементовИБ.Ссылка КАК Предок
	|ПОМЕСТИТЬ ВТБлизостиЭлементов0
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаЭлементовИБ
	|ГДЕ
	|	ТаблицаЭлементовИБ.Ссылка В(&МассивЭлементов)";
	
	ТекстШаблонаЗапросаУровняДляТипаЭлементов =
	"ВЫБРАТЬ
	|	ВТБлизостиЭлементов0.Элемент КАК Элемент,
	|	ТаблицаЭлементовИБСледующегоУровня.Родитель КАК Предок
	|ПОМЕСТИТЬ ВТБлизостиЭлементов1
	|ИЗ
	|	ВТБлизостиЭлементов0 КАК ВТБлизостиЭлементов0
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаЭлементовИБСледующегоУровня
	|		ПО ВТБлизостиЭлементов0.Предок = ТаблицаЭлементовИБСледующегоУровня.Ссылка";
	
	ПустойСписок = ТаблицаТиповЭлементов.Количество() = 0;
	Если ПустойСписок Тогда
		ТекстШаблонаЗапросаТаблицыИтогаДляУровня =
		"ВЫБРАТЬ
		|	NULL КАК Элемент,
		|	NULL КАК Предок,
		|	0 КАК Уровень
		|ПОМЕСТИТЬ ВТИтог
		|ГДЕ
		|	ЛОЖЬ";
	Иначе
		ТекстШаблонаЗапросаТаблицыИтогаДляУровня =
		"ВЫБРАТЬ
		|	ВТБлизостиЭлементов0.Элемент,
		|	ВТБлизостиЭлементов0.Предок,
		|	0 КАК Уровень
		|ПОМЕСТИТЬ ВТИтог
		|ИЗ
		|	ВТБлизостиЭлементов0 КАК ВТБлизостиЭлементов0";
	КонецЕсли;
	
	ТекстЗапросаОсновнойТаблицы = "";
	ТекстШаблонаЗапросаУровняЭлементов = "";
	ТекстЗапросаУровнейЭлементов = "";
	ТекстЗапросаТаблицыИтога = ТекстШаблонаЗапросаТаблицыИтогаДляУровня;
	Если ИмяВременнойТаблицы <> Неопределено Тогда
		ТекстЗапросаТаблицыИтога = СтрЗаменить(ТекстЗапросаТаблицыИтога, "ВТИтог", ИмяВременнойТаблицы);
	Иначе
		ТекстЗапросаТаблицыИтога = СтрЗаменить(ТекстЗапросаТаблицыИтога, Символы.ПС + "ПОМЕСТИТЬ ВТИтог", "");
	КонецЕсли;
	
	Если ПустойСписок Тогда
		Запрос.Текст = ТекстЗапросаТаблицыИтога;
		Возврат Запрос;
	КонецЕсли;
	
	РазделительВременныхТаблиц = Символы.ПС + ";" + Символы.ПС + Символы.ПС;
	
	ПрефиксПараметраЗапроса = "МассивЭлементов";
	НомерТипа = 1;
	Для Каждого СтрокаТипаЭлементов Из ТаблицаТиповЭлементов Цикл
		
		ТекстЗапросаОсновнойТаблицыДляТипаЭлементов = ТекстШаблонаЗапросаОсновнойТаблицы;
		ТекстЗапросаОсновнойТаблицыДляТипаЭлементов = СтрЗаменить(ТекстЗапросаОсновнойТаблицыДляТипаЭлементов, "Справочник.Номенклатура", СтрокаТипаЭлементов.ИмяТипа);
		МассивЭлементовПоТипу = Новый Массив;
		СтрокиЭлементовПоТипу = ТаблицаЭлементов.НайтиСтроки(Новый Структура("Тип", СтрокаТипаЭлементов.Тип));
		Для Каждого СтрокаЭлементовПоТипу Из СтрокиЭлементовПоТипу Цикл
			МассивЭлементовПоТипу.Добавить(СтрокаЭлементовПоТипу.Элемент);
		КонецЦикла;
		ИмяПараметраЗапроса = ПрефиксПараметраЗапроса + Формат(НомерТипа, "ЧГ=0");
		ТекстЗапросаОсновнойТаблицыДляТипаЭлементов = СтрЗаменить(ТекстЗапросаОсновнойТаблицыДляТипаЭлементов, "&" + ПрефиксПараметраЗапроса, "&" + ИмяПараметраЗапроса);
		Если ТекстЗапросаОсновнойТаблицы <> "" Тогда
			ТекстЗапросаОсновнойТаблицыДляТипаЭлементов = СтрЗаменить(ТекстЗапросаОсновнойТаблицыДляТипаЭлементов, Символы.ПС + "ПОМЕСТИТЬ ВТБлизостиЭлементов0", "");
			ТекстЗапросаОсновнойТаблицы = ТекстЗапросаОсновнойТаблицы + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС;
		КонецЕсли;
		Запрос.УстановитьПараметр(ИмяПараметраЗапроса, МассивЭлементовПоТипу);
		ТекстЗапросаОсновнойТаблицы = ТекстЗапросаОсновнойТаблицы + ТекстЗапросаОсновнойТаблицыДляТипаЭлементов;
		
		/////////////////////////////////////////////////////////////////////////////////
		Если СтрокаТипаЭлементов.Иерархический Тогда
			ТекстЗапросаУровняДляТипаЭлементов = ТекстШаблонаЗапросаУровняДляТипаЭлементов;
			ТекстЗапросаУровняДляТипаЭлементов = СтрЗаменить(ТекстЗапросаУровняДляТипаЭлементов, "Справочник.Номенклатура", СтрокаТипаЭлементов.ИмяТипа);
			Если ТекстШаблонаЗапросаУровняЭлементов <> "" Тогда
				ТекстЗапросаУровняДляТипаЭлементов = СтрЗаменить(ТекстЗапросаУровняДляТипаЭлементов, Символы.ПС + "ПОМЕСТИТЬ ВТБлизостиЭлементов1", "");
				ТекстШаблонаЗапросаУровняЭлементов = ТекстШаблонаЗапросаУровняЭлементов + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС;
			КонецЕсли;
			ТекстШаблонаЗапросаУровняЭлементов = ТекстШаблонаЗапросаУровняЭлементов + ТекстЗапросаУровняДляТипаЭлементов;
		КонецЕсли;
		
		НомерТипа = НомерТипа + 1;
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + ТекстЗапросаОсновнойТаблицы;
	Если ТекстШаблонаЗапросаУровняЭлементов <> "" Тогда
		ИмяТаблицыТекущегоУровня = "ВТБлизостиЭлементов0";
		Для НомерУровня=1 По МаксимальнаяГлубина Цикл
			НомерУровняСтрокой = Формат(НомерУровня, "ЧГ=0");
			ТекстЗапросаУровняЭлементов = ТекстШаблонаЗапросаУровняЭлементов;
			ИмяТаблицыПредыдущегоУровня = ИмяТаблицыТекущегоУровня;
			ИмяТаблицыТекущегоУровня = "ВТБлизостиЭлементов" + НомерУровняСтрокой;
			ТекстЗапросаУровняЭлементов = СтрЗаменить(ТекстЗапросаУровняЭлементов, "ВТБлизостиЭлементов1", ИмяТаблицыТекущегоУровня);
			ТекстЗапросаУровняЭлементов = СтрЗаменить(ТекстЗапросаУровняЭлементов, "ВТБлизостиЭлементов0", ИмяТаблицыПредыдущегоУровня);
			Если ТекстЗапросаУровнейЭлементов <> "" Тогда
				ТекстЗапросаУровнейЭлементов = ТекстЗапросаУровнейЭлементов + РазделительВременныхТаблиц;
			КонецЕсли;
			ТекстЗапросаУровнейЭлементов = ТекстЗапросаУровнейЭлементов + ТекстЗапросаУровняЭлементов;
			
			ТекстЗапросаТаблицыИтогаДляУровня = ТекстШаблонаЗапросаТаблицыИтогаДляУровня;
			ТекстЗапросаТаблицыИтогаДляУровня = СтрЗаменить(ТекстЗапросаТаблицыИтогаДляУровня, "0 КАК Уровень", НомерУровняСтрокой + " КАК Уровень");
			ТекстЗапросаТаблицыИтогаДляУровня = СтрЗаменить(ТекстЗапросаТаблицыИтогаДляУровня, Символы.ПС + "ПОМЕСТИТЬ ВТИтог", "");
			ТекстЗапросаТаблицыИтогаДляУровня = СтрЗаменить(ТекстЗапросаТаблицыИтогаДляУровня, "ВТБлизостиЭлементов0", ИмяТаблицыТекущегоУровня);
			ТекстЗапросаТаблицыИтога = ТекстЗапросаТаблицыИтога + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС + ТекстЗапросаТаблицыИтогаДляУровня;
		КонецЦикла;
		
		Запрос.Текст = Запрос.Текст + РазделительВременныхТаблиц + ТекстЗапросаУровнейЭлементов;
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + РазделительВременныхТаблиц + ТекстЗапросаТаблицыИтога;
		
	Возврат Запрос;
		
КонецФункции

Функция ПолучитьТекстЗапросаПустыхСсылокТиповОбъектов(ИменаТиповОбъектов, ИмяВременнойТаблицы=Неопределено) Экспорт

	Перем РК;
	
	РК = вмс_РаботаСКоллекциями;
	
	МассивИменТиповОбъектов = РК.ЗначениеВМассив(ИменаТиповОбъектов, , Ложь);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	"""" КАК ИмяТипа,
	|	НЕОПРЕДЕЛЕНО КАК ПустаяСсылка
	|ПОМЕСТИТЬ ВТ
	|ГДЕ
	|	ЛОЖЬ";
	
	Если ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ", "ПОМЕСТИТЬ " + ИмяВременнойТаблицы);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Символы.ПС + "ПОМЕСТИТЬ ВТ", "");
	КонецЕсли;
	
	СвязкаПодзапросов = Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС;
	Для Каждого ИмяТипа Из МассивИменТиповОбъектов Цикл
		ТекстПодзапроса =
		"ВЫБРАТЬ
		|	""" + ИмяТипа + """ КАК ИмяТипа,
		|	ЗНАЧЕНИЕ(" + ИмяТипа + ".ПустаяСсылка) КАК ПустаяСсылка";
		ТекстЗапроса = ТекстЗапроса + СвязкаПодзапросов + ТекстПодзапроса;
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьВидыТоваров(Товары) Экспорт
	
	Возврат вмс_АдаптацияКонфигураций.ПолучитьВидыТоваров(Товары);
	
КонецФункции

Функция ПолучитьВидТовара(Товар) Экспорт
	
	ТаблицаВидовНоменклатуры = ПолучитьВидыТоваров(Товар);
	
	Если ТаблицаВидовНоменклатуры.Количество() > 0 Тогда
		
		Возврат ТаблицаВидовНоменклатуры[0].ВидТовара;
		
	КонецЕсли;
	
КонецФункции

// ТУ_Кошелев 20.10.23 ++ ОХР
// Вроде работает на УТ, не работает на УНФ
//
Функция ОпределитьЯвляетсяЛиВремяРабочим(ДатаСоВременем) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КалендариРасписаниеРаботы.НомерДня КАК НомерДня
	|ИЗ
	|	Справочник.Календари.РасписаниеРаботы КАК КалендариРасписаниеРаботы
	|ГДЕ
	|	ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), &Дата, СЕКУНДА)) МЕЖДУ КалендариРасписаниеРаботы.ВремяНачала И КалендариРасписаниеРаботы.ВремяОкончания
	|	И ДЕНЬНЕДЕЛИ(&Дата) = КалендариРасписаниеРаботы.НомерДня";
	
	Запрос.УстановитьПараметр("Дата", ДатаСоВременем);
	РезультатЗапроса = Запрос.Выполнить();
		
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции 

// Вроде работает на УТ, не работает на УНФ, возможно из 
Функция ОпределитьЯвляетсяЛиДеньРабочим(ДатаСоВременем) Экспорт
	
	Дата = НачалоДня(ДатаСоВременем); 
	МассивДат = Новый Массив;
	МассивДат.Добавить(Дата);
	РабочиеДаты = КалендарныеГрафики.БлижайшиеРабочиеДаты(КалендарныеГрафики.ОсновнойПроизводственныйКалендарь(), МассивДат);
	Возврат Дата = РабочиеДаты[Дата];
	
КонецФункции
// ТУ_Кошелев 20.10.23 --

// ТУ_Кошелев 12.12.24 - ОХР новая функция для проверки рабочей даты-времени
//Функция для УНФ
//
Функция ДатаВремяРабочее(ДатаСоВременем) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КалендарныеГрафики.ДеньВключенВГрафик КАК ДеньРабочий
	|ИЗ
	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|ГДЕ
	|	КалендарныеГрафики.ДатаГрафика = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), &Дата, СЕКУНДА))
	|		МЕЖДУ Расписание.ВремяНачала И Расписание.ВремяОкончания
	|		И ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), &Дата, СЕКУНДА)) <> ДАТАВРЕМЯ(1, 1, 1)
	|	КАК ВремяРабочее
	|ИЗ
	|	Справочник.ШаблоныЗаполненияГрафиковРабочегоВремени.РасписаниеРаботы КАК Расписание
	|ГДЕ
	|	Расписание.Ссылка.Наименование = ""Рабочий график Ответ Хранения""
	|	И Расписание.НомерДняЦикла = ДЕНЬНЕДЕЛИ(&Дата)
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), &Дата, СЕКУНДА))
	|		МЕЖДУ Перерывы.ВремяНачала И Перерывы.ВремяОкончания)
	|		И ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), &Дата, СЕКУНДА)) <> ДАТАВРЕМЯ(1, 1, 1)
	|	КАК ВремяРабочее
	|ИЗ
	|	Справочник.ШаблоныЗаполненияГрафиковРабочегоВремени.Перерывы КАК Перерывы
	|ГДЕ
	|	Перерывы.Ссылка.Наименование = ""Рабочий график Ответ Хранения""
	|	И Перерывы.НомерДня = ДЕНЬНЕДЕЛИ(&Дата)";
	Запрос.УстановитьПараметр("Дата", ДатаСоВременем);
	
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВремяРабочее = Ложь;
	
	Если РезультатЗапроса[0].Пустой() ИЛИ РезультатЗапроса[1].Пустой() ИЛИ РезультатЗапроса[2].Пустой() Тогда
		Возврат ВремяРабочее;
	Иначе
		ВыборкаДень = РезультатЗапроса[0].Выбрать();
		ВыборкаВремя = РезультатЗапроса[1].Выбрать();
		ВыборкаПерерыв = РезультатЗапроса[2].Выбрать();
		ВыборкаДень.Следующий();
		ВыборкаВремя.Следующий();
		ВыборкаПерерыв.Следующий();
		
		ВремяРабочее = ВыборкаДень.ДеньРабочий И ВыборкаВремя.ВремяРабочее И ВыборкаПерерыв.ВремяРабочее;
		Возврат ВремяРабочее;
	КонецЕсли;
КонецФункции


//
// Параметры:
//    ИдентификаторыЭлементов - идентификаторы элементов задаются в формате "<ИдентификаторРодителя1>\<ИдентификаторРодителя2>\<ИдентификаторЭлемента>"
// Возвращаемое значение:
//    ТаблицаЗначений - таблица элементов с колонками "Идентификатор, Ссылка"
//
Функция НайтиЭлементыИерархическогоСправочника(ИмяСправочника, знач ИдентификаторыЭлементов, ИмяРеквизитаПоиска="Наименование") Экспорт

	ТаблицаЭлементов = НайтиЭлементыИерархическогоСправочникаРасширенный(ИмяСправочника, ИдентификаторыЭлементов, ИмяРеквизитаПоиска);
	
	ТаблицаРезультата = ТаблицаЭлементов.Скопировать(Новый Структура("Найден, Дополнительный", Истина, Ложь), "Идентификатор, Ссылка, ЭтоГруппа");
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция НайтиЭлементыИерархическогоСправочникаРасширенный(ИмяСправочника, знач ИдентификаторыЭлементов, ИмяРеквизитаПоиска) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	МенеджерСправочника = Справочники[ИмяСправочника];
	ПустаяСсылка = МенеджерСправочника.ПустаяСсылка();
	ИмяТипаСсылки = "СправочникСсылка." + ИмяСправочника;

	ИдентификаторыЭлементов = РК.ЗначениеВМассив(ИдентификаторыЭлементов, , Ложь);
	
	ПоискПоИдентификатору = Новый Структура("Идентификатор");

	ТаблицаЭлементов = Новый ТаблицаЗначений;
	ТаблицаЭлементов.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("ЗначениеПоиска", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТаблицаЭлементов.Колонки.Добавить("ИдентификаторРодителя", Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов(ИмяТипаСсылки));
	ТаблицаЭлементов.Колонки.Добавить("ЭтоГруппа", Новый ОписаниеТипов("Булево"));
	ТаблицаЭлементов.Колонки.Добавить("Родитель", Новый ОписаниеТипов(ИмяТипаСсылки));
	ТаблицаЭлементов.Колонки.Добавить("Найден", Новый ОписаниеТипов("Булево"));
	ТаблицаЭлементов.Колонки.Добавить("Дополнительный", Новый ОписаниеТипов("Булево"));
	
	ЭлементыДляОбработки = Новый Массив;
	Для Каждого ИдентификаторЭлемента Из ИдентификаторыЭлементов Цикл
		ПоискПоИдентификатору.Идентификатор = ИдентификаторЭлемента;
		Если ТаблицаЭлементов.НайтиСтроки(ПоискПоИдентификатору).Количество()=0 Тогда
			СтрокаЭлемента = ТаблицаЭлементов.Добавить();
			СтрокаЭлемента.Идентификатор = ИдентификаторЭлемента;
			
			ЭлементыДляОбработки.Добавить(СтрокаЭлемента);
		КонецЕсли;
	КонецЦикла;

	Пока ЭлементыДляОбработки.Количество() > 0 Цикл
		ЭлементыДляОбработкиСледующегоУровня = Новый Массив;
		Для Каждого СтрокаЭлемента Из ЭлементыДляОбработки Цикл
			ПозицияРазделителя = СтрНайти(СтрокаЭлемента.Идентификатор, "\", НаправлениеПоиска.СКонца);
			Если ПозицияРазделителя > 0 Тогда
				ИдентификаторРодителя = Лев(СтрокаЭлемента.Идентификатор, ПозицияРазделителя-1);
				СтрокаЭлемента.ИдентификаторРодителя = ИдентификаторРодителя;
				СтрокаЭлемента.ЗначениеПоиска = Прав(СтрокаЭлемента.Идентификатор, СтрДлина(СтрокаЭлемента.Идентификатор)-ПозицияРазделителя);
				
				ПоискПоИдентификатору.Идентификатор = ИдентификаторРодителя;
				Если ТаблицаЭлементов.НайтиСтроки(ПоискПоИдентификатору).Количество()=0 Тогда
					СтрокаЭлементаРодителя = ТаблицаЭлементов.Добавить();
					СтрокаЭлементаРодителя.Идентификатор = ИдентификаторРодителя;
					СтрокаЭлементаРодителя.Дополнительный = Истина;
					ЭлементыДляОбработкиСледующегоУровня.Добавить(СтрокаЭлементаРодителя);
				КонецЕсли;
			Иначе
				СтрокаЭлемента.ИдентификаторРодителя = "";
				СтрокаЭлемента.ЗначениеПоиска = СтрокаЭлемента.Идентификатор;
				СтрокаЭлемента.Родитель = ПустаяСсылка;
			КонецЕсли;
		КонецЦикла;
		
		ЭлементыДляОбработки = ЭлементыДляОбработкиСледующегоУровня;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПоиска.Идентификатор КАК Идентификатор,
	|	ТаблицаПоиска.ЗначениеПоиска КАК ЗначениеПоиска,
	|	ТаблицаПоиска.Родитель КАК Родитель
	|ПОМЕСТИТЬ ВТ_ТаблицаПоиска
	|ИЗ
	|	&ТаблицаПоиска КАК ТаблицаПоиска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПоиска.Идентификатор КАК Идентификатор,
	|	ТаблицаСправочника.Ссылка КАК Ссылка,
	|	ТаблицаСправочника.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Справочник.вмс_НастройкиПрограммы КАК ТаблицаСправочника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаПоиска КАК ВТ_ТаблицаПоиска
	|		ПО (&ИмяРеквизитаПоиска = ВТ_ТаблицаПоиска.ЗначениеПоиска)
	|			И ТаблицаСправочника.Родитель = ВТ_ТаблицаПоиска.Родитель";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.вмс_НастройкиПрограммы", "Справочник." + ИмяСправочника);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяРеквизитаПоиска", "ТаблицаСправочника." + ИмяРеквизитаПоиска);
	
	ПоискПоИдентификаторуРодителя = Новый Структура("ИдентификаторРодителя");
	ПоискПоИдентификаторуРодителя.ИдентификаторРодителя = "";
	ТаблицаПоиска = ТаблицаЭлементов.Скопировать(ПоискПоИдентификаторуРодителя);
	Запрос.УстановитьПараметр("ТаблицаПоиска", ТаблицаПоиска);

	Пока ТаблицаПоиска.Количество() > 0 Цикл
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		ТаблицаПоиска.Очистить();
		Пока ВыборкаЗапроса.Следующий() Цикл
			ПоискПоИдентификатору.Идентификатор = ВыборкаЗапроса.Идентификатор;
			СтрокаЭлементаРодителя = ТаблицаЭлементов.НайтиСтроки(ПоискПоИдентификатору)[0];
			СтрокаЭлементаРодителя.Ссылка = ВыборкаЗапроса.Ссылка;
			СтрокаЭлементаРодителя.ЭтоГруппа = ВыборкаЗапроса.ЭтоГруппа;
			СтрокаЭлементаРодителя.Найден = Истина;
			
			ПоискПоИдентификаторуРодителя.ИдентификаторРодителя = ВыборкаЗапроса.Идентификатор;
			Для Каждого СтрокаЭлемента Из ТаблицаЭлементов.НайтиСтроки(ПоискПоИдентификаторуРодителя) Цикл
				СтрокаЭлемента.Родитель = ВыборкаЗапроса.Ссылка;
				СтрокаПоиска = ТаблицаПоиска.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПоиска, СтрокаЭлемента);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаЭлементов;
	
КонецФункции

Функция НайтиЭлементыГруппСправочника(ИмяСправочника, знач ТаблицаГрупп, ИмяРеквизитаПоиска) Экспорт

	ТаблицаЭлементов = Новый ТаблицаЗначений;
	ТаблицаЭлементов.Колонки.Добавить("Ссылка");
	ТаблицаЭлементов.Колонки.Добавить("Родитель");
	ТаблицаЭлементов.Колонки.Добавить("ЭтоГруппа");
	ТаблицаЭлементов.Колонки.Добавить("Идентификатор");
	ТаблицаЭлементов.Колонки.Добавить("ИдентификаторРодителя");
	
	Если ТаблицаГрупп.Количество()=0 Тогда
		Возврат ТаблицаЭлементов;
	КонецЕсли;
	
	РК = вмс_РаботаСКоллекциями;
	
	МенеджерСправочника = Справочники[ИмяСправочника];
	ПустаяСсылка = МенеджерСправочника.ПустаяСсылка();
	ИмяТипаСсылки = "СправочникСсылка." + ИмяСправочника;
	
	СсылкиГрупп = РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаГрупп, "Ссылка");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСправочника.Ссылка КАК Ссылка,
	|	ТаблицаСправочника.Родитель КАК Родитель,
	|	ТаблицаСправочника.ЭтоГруппа КАК ЭтоГруппа,
	|	&ИмяРеквизитаПоиска КАК Наименование
	|ИЗ
	|	Справочник.вмс_НастройкиПрограммы КАК ТаблицаСправочника
	|ГДЕ
	|	ТаблицаСправочника.Родитель В(&СсылкиГрупп)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.вмс_НастройкиПрограммы", "Справочник." + ИмяСправочника);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяРеквизитаПоиска", "ТаблицаСправочника." + ИмяРеквизитаПоиска);
	Запрос.УстановитьПараметр("СсылкиГрупп", СсылкиГрупп);
	
	ПоискПоСсылке = Новый Структура("Ссылка");
	Пока СсылкиГрупп.Количество() > 0 Цикл
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		МассивЭлементовУровня = Новый Массив;
		СсылкиГрупп.Очистить();
		Пока ВыборкаЗапроса.Следующий() Цикл
			СтрокаЭлемента = ТаблицаЭлементов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЭлемента, ВыборкаЗапроса);
			
			ПоискПоСсылке.Ссылка = СтрокаЭлемента.Родитель;
			СтрокаГруппыМассив = ТаблицаГрупп.НайтиСтроки(ПоискПоСсылке);
			СтрокаГруппы = СтрокаГруппыМассив[0];
			СтрокаЭлемента.Идентификатор = СтрокаГруппы.Идентификатор + "\" + ВыборкаЗапроса.Наименование;
			СтрокаЭлемента.ИдентификаторРодителя = СтрокаГруппы.Идентификатор;
			Если СтрокаЭлемента.ЭтоГруппа Тогда
				СсылкиГрупп.Добавить(СтрокаЭлемента.Ссылка);
			КонецЕсли;
		КонецЦикла;
		ТаблицаГрупп = ТаблицаЭлементов;
	КонецЦикла;
	
	Возврат ТаблицаЭлементов;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////
//
//						Характеристики номенклатуры+
//

Функция ПроверитьИспользованиеХарактеристикТовараИПолучитьВладельцаДляВыбора(Товар, ВладелецХарактеристики=Неопределено) Экспорт 
	
	// 24.мая.2022 Рефакторинг. Обработка через модуль адаптации 
	ВходящиеПараметры = Новый Структура("Товар,ВладелецХарактеристики",Товар,ВладелецХарактеристики); 
	
	//Возврат Справочники.Номенклатура.ПроверитьИспользованиеХарактеристикИПолучитьВладельцаДляВыбора(Товар, ВладелецХарактеристики); 
	Возврат вмс_АдаптацияКонфигураций.ПолучитьИспользованиеХарактеристикТоваровИПолучитьВладельцаДляВыбора(ВходящиеПараметры.Товар,ВладелецХарактеристики);
	
КонецФункции

Функция ПолучитьИспользованиеХарактеристикТоваровИПолучитьВладельцаДляВыбора(Товары) Экспорт
	
	// 24.мая.2022 Рефакторинг. Обработка через модуль адаптации
	МассивТоваров = вмс_РаботаСКоллекциями.ЗначениеВМассив(Товары);
	
	ТаблицаИспользованияХарактеристик = Новый ТаблицаЗначений;
	ТаблицаИспользованияХарактеристик.Колонки.Добавить("Товар");
	ТаблицаИспользованияХарактеристик.Колонки.Добавить("ИспользованиеХарактеристик");
	ТаблицаИспользованияХарактеристик.Колонки.Добавить("ВладелецХарактеристики");
	
	Для Каждого Товар Из МассивТоваров Цикл
		//ИспользованиеХарактеристик = Справочники.Номенклатура.ПроверитьИспользованиеХарактеристикИПолучитьВладельцаДляВыбора(Товар, ВладелецХарактеристики); 
		ВладелецХарактеристики = Неопределено;
		ВходящиеПараметры = Новый Структура("Товар, ВладелецХарактеристики", Товар, ВладелецХарактеристики);
		
		ИспользованиеХарактеристик = вмс_АдаптацияКонфигураций.ПолучитьИспользованиеХарактеристикТоваровИПолучитьВладельцаДляВыбора(ВходящиеПараметры);
		
		СтрокаИспользованияХарактеристик = ТаблицаИспользованияХарактеристик.Добавить();
		СтрокаИспользованияХарактеристик.Товар = Товар;
		СтрокаИспользованияХарактеристик.ИспользованиеХарактеристик = ИспользованиеХарактеристик;
		СтрокаИспользованияХарактеристик.ВладелецХарактеристики = ВладелецХарактеристики;
	КонецЦикла;
	
	Возврат ТаблицаИспользованияХарактеристик;
	
КонецФункции

//
//						Характеристики номенклатуры-
//
///////////////////////////////////////////////////////////////////////////////////

Функция ВыводитьКолонкиТаблицыПланФактПоРаспоряжению() Экспорт
	
	Возврат Истина;
	
КонецФункции

/////////////////////////////////////////////////////////////////
// { Мета данные объектов

Функция ПолучитьОписаниеМетаданныхОбъекта(Объект) Экспорт
	
	Если Объект = "" ИЛИ Объект = Неопределено Тогда
		МетаданныеОбъекта = Метаданные;
		ЭтоКонфигурация = Истина;
	Иначе
		МетаданныеОбъекта = ПолучитьМетаданныеОбъекта(Объект);
		Если МетаданныеОбъекта = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		ЭтоКонфигурация = Ложь;
	КонецЕсли;
	
	Если ЭтоКонфигурация Тогда
		Описание = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОписанияМетаданныхКонфигурации();
	ИначеЕсли Метаданные.ОбщиеМодули.Содержит(МетаданныеОбъекта) Тогда
		Описание = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОписанияМетаданныхОбщихМодулей();
	Иначе
		Описание = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОписанияМетаданныхОбъектов();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Описание, МетаданныеОбъекта);
	
	Если ЭтоКонфигурация Тогда
		// сама конфигурация
		Описание.Вставить("ПолноеИмя", "");
	Иначе
		Описание.Вставить("ПолноеИмя", МетаданныеОбъекта.ПолноеИмя());
		ПреобразоватьКоллекцииМетаданныхРеквизитовВОписание(Описание);
		ПреобразоватьМетаданныеТабличныхЧастейВОписание(Описание);
	КонецЕсли;
	
	ПочиститьИПреобразоватьСтруктуруОписанияМетаданных(Описание);
	
	Возврат Описание;
	
КонецФункции

Функция ПолучитьОписанияМетаданныхОбъектов(ИменаОбъектов) Экспорт
	
	МассивИменОбъектов = вмс_РаботаСКоллекциями.ЗначениеВМассив(ИменаОбъектов);
	МассивОписанийМетаданныхОбъектов = Новый Массив;
	
	Для Каждого ИмяОбъекта Из МассивИменОбъектов Цикл
		ОписаниеМетаданныхОбъекта = ПолучитьОписаниеМетаданныхОбъекта(ИмяОбъекта);
		Если ОписаниеМетаданныхОбъекта <> Неопределено Тогда
			МассивОписанийМетаданныхОбъектов.Добавить(ОписаниеМетаданныхОбъекта);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивОписанийМетаданныхОбъектов;
	
КонецФункции

Функция ПреобразоватьКоллекцииМетаданныхРеквизитовВОписание(ОписаниеОбъекта)
	
	Перем Коллекция;
	
	ИменаКоллекций = Новый Массив;
	ИменаКоллекций.Добавить("СтандартныеРеквизиты");
	ИменаКоллекций.Добавить("Реквизиты");
	ИменаКоллекций.Добавить("Измерения");
	ИменаКоллекций.Добавить("Ресурсы");
	
	Для Каждого ИмяКоллекции Из ИменаКоллекций Цикл
		ОписаниеОбъекта.Свойство(ИмяКоллекции, Коллекция);
		Если Коллекция <> Неопределено Тогда
			Если ИмяКоллекции = "СтандартныеРеквизиты" Тогда
				ПолноеИмяКоллекции = ОписаниеОбъекта.ПолноеИмя + "." + "СтандартныйРеквизит";
			Иначе
				ПолноеИмяКоллекции = Неопределено;
			КонецЕсли;
			ОписаниеКоллекции = ПолучитьОписаниеКоллекцииРеквизитов(Коллекция, ПолноеИмяКоллекции);
			ОписаниеОбъекта.Вставить(ИмяКоллекции, ОписаниеКоллекции);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьОписаниеКоллекцииРеквизитов(Коллекция, ПолноеИмяКоллекции=Неопределено)
	
	ОписаниеКоллекции = Новый ТаблицаЗначений;
	ЗарегистрированныеПоляОписаний = Новый Соответствие;
	
	ОписанияРеквизитов = Новый Массив;
	Для Каждого Реквизит Из Коллекция Цикл
		ОписаниеРеквизита = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОписанияМетаданныхРеквизита();
		ЗаполнитьЗначенияСвойств(ОписаниеРеквизита, Реквизит);
		Если ОписаниеРеквизита.Свойство("Тип") Тогда
			ОписаниеТипа = Новый Массив;
			Для Каждого Тип Из ОписаниеРеквизита.Тип.Типы() Цикл
				ИмяТипа = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИмяТипа(Тип);
				ОписаниеТипа.Добавить(ИмяТипа);
			КонецЦикла;
			ОписаниеРеквизита.Вставить("Тип", ОписаниеТипа);
		КонецЕсли;
		Если ПолноеИмяКоллекции <> Неопределено Тогда
			ПолноеИмя = ПолноеИмяКоллекции + "." + Реквизит.Имя;
		Иначе
			ПолноеИмя = Реквизит.ПолноеИмя();
		КонецЕсли;
		ОписаниеРеквизита.Вставить("ПолноеИмя", ПолноеИмя);
		ПочиститьИПреобразоватьСтруктуруОписанияМетаданных(ОписаниеРеквизита);
		ОписанияРеквизитов.Добавить(ОписаниеРеквизита);
		
		Для Каждого ПолеОписания Из ОписаниеРеквизита Цикл
			ИмяПоля = ПолеОписания.Ключ;
			Если ЗарегистрированныеПоляОписаний[ИмяПоля] <> Истина Тогда
				ОписаниеКоллекции.Колонки.Добавить(ИмяПоля);
				ЗарегистрированныеПоляОписаний[ИмяПоля] = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из ОписанияРеквизитов Цикл
		СтрокаКоллекции = ОписаниеКоллекции.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКоллекции, ОписаниеРеквизита);
	КонецЦикла;
	
	Возврат ОписаниеКоллекции;
	
КонецФункции

Функция ПреобразоватьМетаданныеТабличныхЧастейВОписание(ОписаниеОбъекта)

	ТабличныеЧасти = Неопределено;
	ОписаниеОбъекта.Свойство("ТабличныеЧасти", ТабличныеЧасти);
	Если ТабличныеЧасти = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОписаниеТабличныхЧастей = Новый Структура;
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		ОписаниеТабличнойЧасти = Новый Структура("Имя, Синоним, СтандартныеРеквизиты, Реквизиты");
		ЗаполнитьЗначенияСвойств(ОписаниеТабличнойЧасти, ТабличнаяЧасть);
		ОписаниеТабличнойЧасти.Вставить("ПолноеИмя", ТабличнаяЧасть.ПолноеИмя());
		ПреобразоватьКоллекцииМетаданныхРеквизитовВОписание(ОписаниеТабличнойЧасти);
		ОписаниеТабличныхЧастей.Вставить(ТабличнаяЧасть.Имя, ОписаниеТабличнойЧасти);
	КонецЦикла;
	
	ОписаниеОбъекта.Вставить("ТабличныеЧасти", ОписаниеТабличныхЧастей);
	Возврат Истина;
	
КонецФункции

Функция ПочиститьИПреобразоватьСтруктуруОписанияМетаданных(Описание)

	НеВалидныеТипы = Новый Массив;
	НеВалидныеТипы.Добавить(Тип("Неопределено"));
	НеВалидныеТипы.Добавить(Тип("КоллекцияОбъектовМетаданных"));
	НеВалидныеТипы.Добавить(Тип("КоллекцияЗначенийСвойстваОбъектаМетаданных"));
	
	НеПреобразовыватьТипы = Новый Массив;
	НеПреобразовыватьТипы.Добавить(Тип("Дата"));
	НеПреобразовыватьТипы.Добавить(Тип("Число"));
	НеПреобразовыватьТипы.Добавить(Тип("Булево"));
	НеПреобразовыватьТипы.Добавить(Тип("Строка"));
	НеПреобразовыватьТипы.Добавить(Тип("Структура"));
	НеПреобразовыватьТипы.Добавить(Тип("Массив"));
	НеПреобразовыватьТипы.Добавить(Тип("ТаблицаЗначений"));

	УдалитьПоля = Новый Массив;
	Для Каждого Поле Из Описание Цикл
		Значение = Поле.Значение;
		ТипЗначения = ТипЗнч(Значение);
		Если НеВалидныеТипы.Найти(ТипЗначения) <> Неопределено Тогда
			УдалитьПоля.Добавить(Поле.Ключ);
			Продолжить;
		КонецЕсли;
		
		Если НеПреобразовыватьТипы.Найти(ТипЗначения) = Неопределено Тогда
			ЗначениеСтрока = Строка(Значение);
			Описание.Вставить(Поле.Ключ, ЗначениеСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ИмяПоля Из УдалитьПоля Цикл
		Описание.Удалить(ИмяПоля);
	КонецЦикла;
	
КонецФункции

// } Мета данные объектов
/////////////////////////////////////////////////////////////////

Функция ПолучитьРезультатПоискаТоваров(СтрокаПоиска, ДополнительныеПараметры=Неопределено) Экспорт
	
	Перем МассивПолейПоиска, ОграничитьВыборку;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ПоляПоиска = Неопределено;
		ДополнительныеПараметры.Свойство("ПоляПоиска", ПоляПоиска);
		Если ПоляПоиска <> Неопределено Тогда
			МассивПолейПоиска = вмс_РаботаСКоллекциями.ЗначениеВМассив(ПоляПоиска, , Ложь);
		КонецЕсли;
		
		ДополнительныеПараметры.Свойство("ОграничитьВыборку", ОграничитьВыборку);
	КонецЕсли;
	
	Если ТипЗнч(МассивПолейПоиска) <> Тип("Массив") ИЛИ МассивПолейПоиска.Количество() = 0 Тогда
		МассивПолейПоиска = Новый Массив; 
		МассивПолейПоиска.Добавить("Наименование");
		МассивПолейПоиска.Добавить("Код");
		МассивПолейПоиска.Добавить("Артикул");
	КонецЕсли;
	
	Если ТипЗнч(ОграничитьВыборку) <> Тип("Число") Тогда
		ОграничитьВыборку = 10;
	КонецЕсли;
	
	МассивСтрокПоиска = вмс_РаботаСКоллекциями.СтрокуВМассив(СтрокаПоиска, " ");
	КоличествоПоисков = МассивСтрокПоиска.Количество();
	
	СвязкаЗапросов = Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС;
	СвязкаПакетов = Символы.ПС + ";" + Символы.ПС + Символы.ПС;
	
	ТаблицаПоиска = Новый ТаблицаЗначений;
	ТаблицаПоиска.Колонки.Добавить("НомерПоиска", Новый ОписаниеТипов("Число"));
	ТаблицаПоиска.Колонки.Добавить("СтрокаПоиска", Новый ОписаниеТипов("Строка"));
	
	Запрос = Новый Запрос;
	Для НомерПоиска=1 По КоличествоПоисков Цикл
		СтрокаПоиска = "%" + МассивСтрокПоиска[НомерПоиска-1] + "%";
		СтрокаТаблицыПоиска = ТаблицаПоиска.Добавить();
		СтрокаТаблицыПоиска.НомерПоиска = НомерПоиска;
		СтрокаТаблицыПоиска.СтрокаПоиска = СтрокаПоиска;
		Запрос.УстановитьПараметр("СтрокаПоиска" + НомерПоиска, СтрокаПоиска);
	КонецЦикла;
	
	ТекстЗапроса = "";
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ТаблицаПоиска.НомерПоиска КАК НомерПоиска,
	|	ТаблицаПоиска.СтрокаПоиска КАК СтрокаПоиска
	|ПОМЕСТИТЬ ТаблицаПоиска
	|ИЗ
	|	&ТаблицаПоиска КАК ТаблицаПоиска" + СвязкаПакетов;
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//							Поиск товаров
	//
	
	ТекстШаблонаПоискПоПолю =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	ТаблицаПоиска.НомерПоиска КАК НомерПоиска,
	|	&НомерПоля КАК НомерПоля
	|ПОМЕСТИТЬ ВТ_Товары1
	|ИЗ
	|	ТаблицаПоиска КАК ТаблицаПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Номенклатура.Наименование ПОДОБНО ТаблицаПоиска.СтрокаПоиска";
	ТекстЗапросаПоТоварам = "";
	НомерПоля = 1;
	Для Каждого ПолеПоиска Из МассивПолейПоиска Цикл
		ТекстПоискПоПолю = ТекстШаблонаПоискПоПолю;
		ТекстПоискПоПолю = СтрЗаменить(ТекстПоискПоПолю, "Номенклатура.Наименование", "Номенклатура." + ПолеПоиска);
		ТекстПоискПоПолю = СтрЗаменить(ТекстПоискПоПолю, "&НомерПоля", НомерПоля);
		Если ТекстЗапросаПоТоварам <> "" Тогда
			ТекстЗапросаПоТоварам = ТекстЗапросаПоТоварам + СвязкаЗапросов;
			ТекстПоискПоПолю = СтрЗаменить(ТекстПоискПоПолю, Символы.ПС + "ПОМЕСТИТЬ ВТ_Товары", "");
		КонецЕсли;
		ТекстЗапросаПоТоварам = ТекстЗапросаПоТоварам + ТекстПоискПоПолю;
		НомерПоля = НомерПоля + 1;
	КонецЦикла;
	
	ТекстЗапросаПоТоварам = ТекстЗапросаПоТоварам + СвязкаПакетов;
	ТекстЗапросаПоТоварам = ТекстЗапросаПоТоварам +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Товары.Товар КАК Товар,
	|	ВТ_Товары.НомерПоля КАК НомерПоля
	|ПОМЕСТИТЬ ВТ_Товары2
	|ИЗ
	|	ВТ_Товары1 КАК ВТ_Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары2.Товар КАК Товар,
	|	ТаблицаПоиска.НомерПоиска КАК НомерПоиска,
	|	ВТ_Товары2.НомерПоля КАК НомерПоля
	|ПОМЕСТИТЬ ВТ_Товары3
	|ИЗ
	|	ТаблицаПоиска КАК ТаблицаПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Товары2 КАК ВТ_Товары2
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары1 КАК ВТ_Товары1
	|		ПО ТаблицаПоиска.НомерПоиска = ВТ_Товары1.НомерПоиска
	|			И (ВТ_Товары2.Товар = ВТ_Товары1.Товар)
	|			И (ВТ_Товары2.НомерПоля = ВТ_Товары1.НомерПоля)
	|ГДЕ
	|	ВТ_Товары1.Товар ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Товар КАК Товар,
	|	ВТ_Товары.НомерПоля КАК НомерПоля
	|ПОМЕСТИТЬ ВТ_Товары4
	|ИЗ
	|	ВТ_Товары1 КАК ВТ_Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Товары.Товар,
	|	ВТ_Товары.НомерПоля
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Товары.НомерПоиска) = &КоличествоПоисков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Товары.Товар КАК Товар
	|ПОМЕСТИТЬ ВТ_Товары5
	|ИЗ
	|	ВТ_Товары4 КАК ВТ_Товары";
	
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаПоТоварам;
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаПоиска", ТаблицаПоиска);
	Запрос.УстановитьПараметр("КоличествоПоисков", КоличествоПоисков);
	Запрос.Выполнить();
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//							Поиск характеристик
	//
	
	ТекстЗапроса = "";
	
	ТаблицаПоискаХарактеристик = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТ_Товары3"].ПолучитьДанные().Выгрузить();
	ТаблицаПоискаХарактеристик.Колонки.НомерПоиска.Имя = "ВариантПоиска";
	вмс_РаботаСКоллекциями.ИзменитьТипКолонкиТаблицыЗначений(ТаблицаПоискаХарактеристик, "ВариантПоиска", Неопределено);
	вмс_РаботаСКоллекциями.СвернутьКоллекциюЗначений(ТаблицаПоискаХарактеристик, "Товар, НомерПоля", "ВариантПоиска", "Строка");
	ТаблицаПоискаХарактеристик.Свернуть("Товар, ВариантПоиска");
	
	ТаблицаВариантовПоискаХарактеристик = ТаблицаПоискаХарактеристик.Скопировать();
	ТаблицаВариантовПоискаХарактеристик.Свернуть("ВариантПоиска");
	
	Для Каждого СтрокаПоискаХарактеристик Из ТаблицаПоискаХарактеристик  Цикл
		СтрокаВариантаПоискаХарактеристик = ТаблицаВариантовПоискаХарактеристик.НайтиСтроки(Новый Структура("ВариантПоиска", СтрокаПоискаХарактеристик.ВариантПоиска))[0];
		НомерВарианта = ТаблицаВариантовПоискаХарактеристик.Индекс(СтрокаВариантаПоискаХарактеристик) + 1;
		СтрокаПоискаХарактеристик.ВариантПоиска = НомерВарианта;
	КонецЦикла;
	вмс_РаботаСКоллекциями.ИзменитьТипКолонкиТаблицыЗначений(ТаблицаПоискаХарактеристик, "ВариантПоиска", Новый ОписаниеТипов("Число"));
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ТаблицаПоискаХарактеристик.Товар КАК Товар,
	|	ТаблицаПоискаХарактеристик.ВариантПоиска КАК ВариантПоиска
	|ПОМЕСТИТЬ ВТ_Товары6
	|ИЗ
	|	&ТаблицаПоискаХарактеристик КАК ТаблицаПоискаХарактеристик";
	Запрос.УстановитьПараметр("ТаблицаПоискаХарактеристик", ТаблицаПоискаХарактеристик);
	
	ТекстШаблонаВариантаПоискаХарактеристик =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Товары.Товар КАК Товар,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
	|ИЗ
	|	ВТ_Товары6 КАК ВТ_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ВТ_Товары.Товар.ВидНоменклатуры = ХарактеристикиНоменклатуры.Владелец
	|				ИЛИ ВТ_Товары.Товар = ХарактеристикиНоменклатуры.Владелец)
	|ГДЕ
	|	ВТ_Товары.ВариантПоиска = &НомерВарианта
	|	И &УсловияПоиска
	|";
	
	ТекстЗапросаПоХарактеристикам = "";
	НомерВарианта = 1;
	Для Каждого СтрокаВариантаПоискаХарактеристик Из ТаблицаВариантовПоискаХарактеристик Цикл
		НомераПоисков = вмс_РаботаСКоллекциями.СтрокуВМассив(СтрокаВариантаПоискаХарактеристик.ВариантПоиска);
		МассивУсловийПоиска = Новый Массив;
		Для Каждого НомерПоиска Из НомераПоисков Цикл
			МассивУсловийПоиска.Добавить("ХарактеристикиНоменклатуры.Наименование ПОДОБНО &СтрокаПоиска" + НомерПоиска);
		КонецЦикла;
		УсловияПоиска = вмс_РаботаСКоллекциями.МассивВСтроку(МассивУсловийПоиска, " И ");
		
		ТекстВариантаПоискаХарактеристик = ТекстШаблонаВариантаПоискаХарактеристик;
		ТекстВариантаПоискаХарактеристик = СтрЗаменить(ТекстВариантаПоискаХарактеристик, "&НомерВарианта", НомерВарианта);
		ТекстВариантаПоискаХарактеристик = СтрЗаменить(ТекстВариантаПоискаХарактеристик, "&УсловияПоиска", УсловияПоиска);
		Если ТекстЗапросаПоХарактеристикам <> "" Тогда
			ТекстЗапросаПоХарактеристикам = ТекстЗапросаПоХарактеристикам + СвязкаЗапросов;
		КонецЕсли;
		ТекстЗапросаПоХарактеристикам = ТекстЗапросаПоХарактеристикам + ТекстВариантаПоискаХарактеристик;
		НомерВарианта = НомерВарианта + 1;
	КонецЦикла;
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//							Общий запрос
	//
	
	ТекстЗапроса = ТекстЗапроса + СвязкаПакетов;
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ВТ_Товары.Товар КАК Товар,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_Товары5 КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ВТ_Товары.Товар.ВидНоменклатуры = ХарактеристикиНоменклатуры.Владелец
	|				ИЛИ ВТ_Товары.Товар = ХарактеристикиНоменклатуры.Владелец)";
	Если ТекстЗапросаПоХарактеристикам <> "" Тогда
		ТекстЗапроса = ТекстЗапроса + СвязкаЗапросов;
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаПоХарактеристикам;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + СвязкаПакетов;
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ ПЕРВЫЕ 10
	|	ВТ.Товар,
	|	ВТ.Характеристика
	|ИЗ
	|	ВТ";
	
	Если ОграничитьВыборку > 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ ПЕРВЫЕ 10", "ВЫБРАТЬ ПЕРВЫЕ " + ОграничитьВыборку);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ ПЕРВЫЕ 10", "ВЫБРАТЬ");
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	//
	//							РЕЗУЛЬТАТ!!!
	//
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ПолучитьДанныеКвазиСсылокИБ(КвазиСсылкиИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КвазиСсылки.Ссылка КАК Ссылка,
	|	КвазиСсылки.ИмяТипа КАК ИмяТипа,
	|	КвазиСсылки.GUID КАК GUID,
	|	КвазиСсылки.Имя КАК Имя
	|ИЗ
	|	Справочник.КвазиСсылки КАК КвазиСсылки
	|ГДЕ
	|	КвазиСсылки.Ссылка В(&КвазиСсылкиИБ)";
	Запрос.УстановитьПараметр("КвазиСсылкиИБ", КвазиСсылкиИБ);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаКвазиСсылокИБ = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаКвазиСсылокИБ;
	
КонецФункции

#Область Алгоритмы

Функция ВыполнитьАлгоритм(АлгоритмСсылка, ВходящиеПараметры = Неопределено, ОшибкаВыполнения = Ложь,
	СообщениеОбОшибке = "") Экспорт
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьАлгоритм(АлгоритмСсылка, ВходящиеПараметры, ОшибкаВыполнения,
		СообщениеОбОшибке)
КонецФункции

Функция ПолучитьСсылкуСправочникАлгоритмы(Алгоритм) Экспорт
	Если ТипЗнч(Алгоритм) = Тип("СправочникСсылка.вмс_Алгоритмы") Тогда
		Возврат Алгоритм;
	ИначеЕсли ТипЗнч(Алгоритм) = Тип("УникальныйИдентификатор") Тогда
		Возврат Справочники.вмс_Алгоритмы.ПолучитьСсылку(Алгоритм);
	ИначеЕсли ТипЗнч(Алгоритм) = Тип("Строка") Тогда
		Если Лев(Алгоритм, 5) = "GUID_" Тогда // БСП внеш. обработка
			СтрокаУИД = Сред(Алгоритм, 6);
			ref = Справочники.вмс_Алгоритмы.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаУИД));
			Возврат ?(ПустаяСтрока(ref.Наименование), Неопределено, ref);
		КонецЕсли;
		НайденПоНаименованию = Справочники.вмс_Алгоритмы.НайтиПоНаименованию(Алгоритм, Истина);
		Если НайденПоНаименованию = Неопределено Тогда
			Попытка
				ЧислоКод = Число(Прав(Алгоритм, 5));
				НайденПоКоду = Справочники.вмс_Алгоритмы.НайтиПоКоду(ЧислоКод);
				Если НайденПоКоду = Неопределено Тогда
					Возврат Неопределено;
				Иначе
					Возврат НайденПоКоду;
				КонецЕсли;
			Исключение
				Возврат Неопределено;
			КонецПопытки;
		Иначе
			Возврат НайденПоНаименованию;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ТоварныеПоля
// ТУ_Самойленко 03.08.23 ++
Функция ИспользуютсяКонтейнеры() Экспорт
	
	Возврат Справочники.вмс_НастройкиПрограммы.НайтиПоРеквизиту("Имя", "ИспользоватьТару").Значение;
	
КонецФункции 
// ТУ_Самойленко 03.08.23 --
#КонецОбласти   

Функция ПолучитьТекущееВремя() Экспорт 
	Возврат УниверсальноеВремя(ТекущаяДатаСеанса()) - '19700101';
КонецФункции 

Функция ПолучитьТекущуюДату() Экспорт
	Возврат ТекущаяДатаСеанса();
КонецФункции

Функция ПолучитьТаблицуРезультатаЗапроса(знач Запрос) Экспорт
	
	КвазиЗапрос = Запрос;
	
	Запрос = Новый Запрос(КвазиЗапрос.Текст);
	Для Каждого Параметр Из КвазиЗапрос.Параметры Цикл
		Запрос.Параметры.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция СоздатьОбъектОбработки(ПутьКДаннымОбработки) Экспорт
	
	Префикс = "Обработка.";
	Если СтрНайти(ПутьКДаннымОбработки, Префикс)=1 Тогда
		ИмяОбработки = Прав(ПутьКДаннымОбработки, СтрДлина(ПутьКДаннымОбработки)-СтрДлина(Префикс));
		ОбъектОперации = Обработки[ИмяОбработки].Создать();
		Возврат ОбъектОперации;
	КонецЕсли;
	
	Префикс = "";
	ИмяОбработки = ВнешниеОбработки.Подключить(ПутьКДаннымОбработки);
	ОбъектОперации = ВнешниеОбработки.Создать(ИмяОбработки);

	Возврат ОбъектОперации;
	
КонецФункции


//3.2.5 ZAD-48:
Функция DecToAny(Знач тЗначение, тОснование) Экспорт
	
	тРезультат = "";
	
	Пока тЗначение > 0 Цикл
		тРезультат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", тЗначение%тОснование + 1, 1) + тРезультат;
		тЗначение = Цел(тЗначение/тОснование) ;
	КонецЦикла;
	
	Возврат тРезультат; 
	
КонецФункции 

//3.2.5 ZAD-48:
Функция ПреобразоватьИзЛюбойВ10(Знач Значение="0",Нотация=36) Экспорт
	
	Если Нотация<=0 Тогда Возврат(0) КонецЕсли;
	Значение=СокрЛП(Значение);
	Если Значение="0" Тогда Возврат(0) КонецЕсли;
	Результат=0;
	Длина=СтрДлина(Значение);
	Для Х=1 По Длина Цикл
		М=1;
		Для У=1 По Длина-Х Цикл М=М*Нотация КонецЦикла;
		Результат=Результат+(Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Сред(Значение,Х,1))-1)*М;
	КонецЦикла;  
	
	Результат =  Окр(Результат);
	Если Результат < 0 Тогда
	
		Результат = - Результат	
	
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

#Область РаботаСУниверсальнымХранилищем
// ТУ_Самойленко 14.09.23 ++
//Функция ЗаписатьДанныеВУХЗ(Хозяин, Данные) Экспорт

//	УХЗСсылка = Справочники.вмс_УниверсальноеХранилищеЗначений.НайтиПоРеквизиту("Хозяин", Хозяин);
//	Если ЗначениеЗаполнено(УХЗСсылка) Тогда
//		УХЗОбъект = УХЗСсылка.ПолучитьОбъект();	
//	Иначе
//		УХЗОбъект = Справочники.вмс_УниверсальноеХранилищеЗначений.СоздатьЭлемент();
//		УХЗОбъект.Заполнить(Неопределено);
//		УХЗОбъект.Хозяин = Хозяин;
//	КонецЕсли;
//	
//	УХЗОбъект.Хранилище = Новый ХранилищеЗначения(Данные);
//	УХЗОбъект.Записать();
//	
//КонецФункции

//Функция ПолучитьДанныеИзУХЗ(Хозяин) Экспорт

//	УХЗСсылка = Справочники.вмс_УниверсальноеХранилищеЗначений.НайтиПоРеквизиту("Хозяин", Хозяин);
//	Если ЗначениеЗаполнено(УХЗСсылка) Тогда
//		УХЗОбъект = УХЗСсылка.ПолучитьОбъект();	
//	Иначе
//		Возврат Неопределено;	
//	КонецЕсли;
//	
//	Возврат УХЗОбъект.Хранилище.Получить();
//	
//КонецФункции
// ТУ_Самойленко 14.09.23 --
#КонецОбласти
