#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНеобработаннуюНоменклатуру();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНеобработаннаяНоменклатура

&НаКлиенте
Процедура НеобработаннаяНоменклатураПриИзменении(Элемент)

	ТекДанные = Элемент.ТекущиеДанные;
	
	ДобавитьНоменклатуруУчСистемы(ТекДанные.НоменклатураПоклажедателя, ТекДанные.НоменклатураУчетнойСистемы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьНеобработаннуюНоменклатуру();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНеобработаннуюНоменклатуру()
	
	НеобработаннаяНоменклатура.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_НоменклатураПоклажедателяСпр.Ссылка КАК Номенклатура,
	|	вмс_НоменклатураПоклажедателя.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.вмс_НоменклатураПоклажедателя КАК вмс_НоменклатураПоклажедателя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_НоменклатураПоклажедателя КАК вмс_НоменклатураПоклажедателяСпр
	|		ПО вмс_НоменклатураПоклажедателя.Номенклатура = вмс_НоменклатураПоклажедателяСпр.Ссылка
	|ГДЕ
	|	вмс_НоменклатураПоклажедателяСпр.НоменклатураУчетнойСистемы = &НоменклатураУчетнойСистемы";
	
	Запрос.УстановитьПараметр("НоменклатураУчетнойСистемы", Справочники.Номенклатура.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивНоменклатуры = новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НеобработаннаяНоменклатура.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьНоменклатуруУчСистемы(НоменклатураПоклажедателя, НоменклатураИС)
	
	НоменклатураОбъект = НоменклатураПоклажедателя.ПолучитьОбъект();
	НоменклатураОбъект.НоменклатураУчетнойСистемы = НоменклатураИС;
	НоменклатураОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти









