//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

Функция СоздатьЭлементыФормы(Форма, ОписаниеФормы) Экспорт
	
	Перем РаботаСXML;
	
	РаботаСXML = глОбщийМодуль("РаботаСXMLКлиентСервер");
	
	ТекстОписанияФормы = РаботаСXML.XMLСтрокаИзЗначенияУлучшенная(ОписаниеФормы);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекстОписанияФормы", ТекстОписанияФормы);
	
	ПрограммныйКод =
	"РаботаСXML = глОбщийМодуль(""РаботаСXMLКлиентСервер"");
	|ОписаниеФормы = РаботаСXML.ПрочитатьТекстXMLУлучшенная(ДополнительныеПараметры.ТекстОписанияФормы);
	|вмс_НастройкиВыполненияЗаданияКладовщикуСервер.СоздатьЭлементыФормы(Форма, ОписаниеФормы);
	|ТекстОписанияФормы = РаботаСXML.XMLСтрокаИзЗначенияУлучшенная(ОписаниеФормы);
	|Результат = ТекстОписанияФормы;";
	
	ТекстОписанияФормыСервер = Форма.СлужебнаяФункцияВызовСервера(ПрограммныйКод, ДополнительныеПараметры);
	
	ОписаниеФормыСервер = РаботаСXML.ПрочитатьТекстXMLУлучшенная(ТекстОписанияФормыСервер);
	
	Для Каждого ЭлементОписанияСервер Из ОписаниеФормыСервер.Элементы Цикл
		ЭлементОписания = ОписаниеФормы.ИдентификаторыЭлементов[ЭлементОписанияСервер.ИдентификаторЭлемента];
		ЭлементОписания.ИмяЭлементаФормы = ЭлементОписанияСервер.ИмяЭлементаФормы;
	КонецЦикла;
	
	Для Каждого РеквизитОписанияСервер Из ОписаниеФормыСервер.Реквизиты Цикл
		РеквизитОписания = ОписаниеФормы.ИдентификаторыРеквизитов[РеквизитОписанияСервер.ИдентификаторРеквизита];
		РеквизитОписания.ПутьКДанным = РеквизитОписанияСервер.ПутьКДанным;
	КонецЦикла;
	
КонецФункции
