
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаПолей.Очистить();
	
	ДоступныеПоля = Неопределено;
	Параметры.Свойство("ДоступныеПоля", ДоступныеПоля);
	Если ТипЗнч(ДоступныеПоля) <> Тип("СписокЗначений") Тогда
		ДоступныеПоля = Новый СписокЗначений;
	КонецЕсли;
	
	СписокВыбора = Элементы.ТаблицаПолейИмя.СписокВыбора;
	СписокВыбора.Очистить();
	Для Каждого ДоступноеПоле Из ДоступныеПоля Цикл
		СписокВыбора.Добавить(ДоступноеПоле.Значение, ДоступноеПоле.Представление);
	КонецЦикла;
	
	ТекущиеПоля = Неопределено;
	Параметры.Свойство("ТекущиеПоля", ТекущиеПоля);
	Если ТипЗнч(ТекущиеПоля) = Тип("Массив") Тогда
		Для Каждого Поле Из ТекущиеПоля Цикл
			Если ДоступныеПоля.НайтиПоЗначению(Поле) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СтрокаПоля = ТаблицаПолей.Добавить();
			СтрокаПоля.Имя = Поле;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	ВыбранныеПоля = Новый Массив;
	Для Каждого СтрокаПоля Из ТаблицаПолей Цикл
		ВыбранныеПоля.Добавить(СтрокаПоля.Имя);
	КонецЦикла;
	
	Закрыть(ВыбранныеПоля);
	
КонецПроцедуры
