//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

Функция ПолучитьСтруктуруНастройкиТоварныхПолей() Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ТоварныеПоля = вмс_ОперацииПоЯчейкамКлиентСерверПовтИсп.ТоварныеПоля();
	ОбязательныеТоварныеПоля = вмс_ОперацииПоЯчейкамКлиентСерверПовтИсп.ОбязательныеТоварныеПоля();
	
	ТаблицаПолей = РК.НоваяКвазиТаблицаЗначений("Использование, Имя, Представление, Порядок"); //для универсальности, может быть передана на клиент
	Порядок = 1;
	Для Каждого ТоварноеПоле Из ТоварныеПоля Цикл
		СтрокаПоля = РК.ДобавитьЭлементКоллекции(ТаблицаПолей);
		СтрокаПоля.Использование = ОбязательныеТоварныеПоля.Найти(ТоварноеПоле) <> Неопределено;
		СтрокаПоля.Имя = ТоварноеПоле;
		СтрокаПоля.Представление = ТоварноеПоле;
		СтрокаПоля.Порядок = Порядок;
		Порядок = Порядок + 1;
	КонецЦикла;
	
	РК.ДобавитьИндексКоллекции(ТаблицаПолей, "Имя");
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("ТаблицаПолей", ТаблицаПолей);
	СтруктураНастройки.Вставить("СКДИсточникаПредставленийПолей", вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьТекстСКДИсточникаПредставленийТоварныхПолей());
	
	Возврат СтруктураНастройки;
	
КонецФункции

Функция ИспользуемыеТоварныеПоля(УдалитьУпаковки = Ложь) Экспорт
	
	// ТУ_Кошелев 14.01.25 - перенес настройку в функцию чтобы не плодить лишние функции в модулях
	// ""Временное"" решение для работоспособности формы при включенных упаковках в товарных полях (их надо удалить из
	// товарныхъ полей в принципе)
	ИспользуемыеТоварныеПоля = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля(УдалитьУпаковки);
	
	Возврат ИспользуемыеТоварныеПоля;
	
КонецФункции

Функция ИспользуемыеТоварныеПоляНастройкиТоварныхПолей(НастройкаТоварныхПолей) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ИспользуемыеТоварныеПоля = Новый Массив;
	Для Каждого СтрокаПоля Из РК.ПолучитьЭлементыКоллекции(НастройкаТоварныхПолей.ТаблицаПолей) Цикл
		Если СтрокаПоля.Использование Тогда
			ИспользуемыеТоварныеПоля.Добавить(СтрокаПоля.Имя);
		КонецЕсли;
	КонецЦикла;
	Возврат ИспользуемыеТоварныеПоля;
	
КонецФункции

Функция ЗагрузитьСохраненнуюНастройкуТоварныхПолей(НастройкаТоварныхПолей, НастройкаТоварныхПолейСохраненная) Экспорт

	Если ТипЗнч(НастройкаТоварныхПолейСохраненная) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если НастройкаТоварныхПолейСохраненная.Свойство("ТаблицаПолей") Тогда
		ЗагрузитьСохраненнуюТаблицуНастройкиТоварныхПолей(НастройкаТоварныхПолей.ТаблицаПолей, НастройкаТоварныхПолейСохраненная.ТаблицаПолей);
	КонецЕсли;
		
	Если НастройкаТоварныхПолейСохраненная.Свойство("СКДИсточникаПредставленийПолей") Тогда
		НастройкаТоварныхПолей.СКДИсточникаПредставленийПолей = НастройкаТоварныхПолейСохраненная.СКДИсточникаПредставленийПолей;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЗагрузитьСохраненнуюТаблицуНастройкиТоварныхПолей(ТаблицаПолей, ТаблицаПолейСохраненная) Экспорт

	РК = вмс_РаботаСКоллекциями;
	
	Для Каждого СтрокаПоля Из РК.ПолучитьЭлементыКоллекции(ТаблицаПолей) Цикл
		СтрокаПоля.Порядок = 0;
	КонецЦикла;
	
	Порядок = 1;
	ПоискПоИмени = Новый Структура("Имя", "");
	Для Каждого СтрокаПоляСохраненная Из РК.ПолучитьЭлементыКоллекции(ТаблицаПолейСохраненная) Цикл
		ПоискПоИмени.Имя = СтрокаПоляСохраненная.Имя;
		СтрокаПоля = РК.НайтиЭлементКоллекции(ТаблицаПолей, ПоискПоИмени);
		Если СтрокаПоля = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаПоля.Порядок = Порядок;
		ЗаполнитьЗначенияСвойств(СтрокаПоля, СтрокаПоляСохраненная);
		Порядок = Порядок + 1;
	КонецЦикла;

	Для Каждого СтрокаПоля Из РК.ПолучитьЭлементыКоллекции(ТаблицаПолей) Цикл
		Если СтрокаПоля.Порядок = 0 Тогда
			СтрокаПоля.Порядок = Порядок;
		КонецЕсли;
	КонецЦикла;
	
	РК.СортироватьКоллекцию(ТаблицаПолей, "Порядок");
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//							Классы операций+
//

Функция ЗарегистрироватьКлассОперации(ИмяОперации) Экспорт

	Перем РК, Классы, РаботаСXML, ОперацииПоЯчейкамВызовСервера;
	
	ОперацииПоЯчейкамВызовСервера = глОбщийМодуль("ОперацииПоЯчейкамВызовСервера");
	ОписаниеОперации = ОперацииПоЯчейкамВызовСервера.ПолучитьОписаниеОперации(ИмяОперации);
	Если ОписаниеОперации=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	Классы = вмс_КлассыОбъектов;
	РаботаСXML = глОбщийМодуль("РаботаСXMLКлиентСервер");
	
	Классы.Инициализировать();
	Класс = Классы.ЗарегистрироватьКласс("ОперацияПоЯчейкам_" + ИмяОперации);
	Классы.НаследоватьКласс("Базовый");
	
	Для Каждого СтрокаПараметра Из РК.ПолучитьЭлементыКоллекции(ОписаниеОперации.ПараметрыОперации) Цикл
		Классы.ДобавитьПоле(СтрокаПараметра.Имя, , СтрокаПараметра.НаФронтенде, СтрокаПараметра.НаБэкенде);
	КонецЦикла;
	
	Для Каждого СтрокаМетода Из РК.ПолучитьЭлементыКоллекции(ОписаниеОперации.МетодыОперации) Цикл
		ОписаниеМетода = РаботаСXML.ПрочитатьТекстXMLУлучшенная(СтрокаМетода.Данные);
		Если ТипЗнч(ОписаниеМетода)<>Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		Классы.ДобавитьМетод(ОписаниеМетода.Имя);
			Если ОписаниеМетода.Свойство("Параметры") Тогда
				Для Каждого ПараметрМетода Из ОписаниеМетода.Параметры Цикл
					Классы.ДобавитьПараметрМетода(ПараметрМетода.Имя);
				КонецЦикла;
			КонецЕсли;
			Классы.УстановитьПараметрыКомпиляцииДирективыМетода(ОписаниеМетода.Директива);
			Классы.УстановитьТекстОбработчикаМетода(ОписаниеМетода.Код);
	КонецЦикла;
	
	Классы.ЗакончитьСозданиеКласса();
	
	Возврат Класс;
	
КонецФункции

Функция НовыйОбъект(ИмяОперации) Экспорт
	
	ИмяКласса = "ОперацияПоЯчейкам_" + ИмяОперации;
	
	Объект = вмс_КлассныеОбъекты.НовыйОбъект(ИмяКласса);
	
	Возврат Объект;
	
КонецФункции

Функция ПолучитьОписаниеМетода(ТекстМетода) Экспорт
	
	ОписанияМетодов = ПолучитьОписанияМетодов(ТекстМетода);
	Если ОписанияМетодов.Количество()<>1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеМетода = ОписанияМетодов[0];
	
	Возврат ОписаниеМетода;
	
КонецФункции

Функция ПолучитьОписанияМетодов(ТекстМодуля) Экспорт

	Перем РК;
	
	РК = вмс_РаботаСКоллекциями;

	ТекстовыйПарсер = вмс_ВыполнениеПрограммногоКода.НовыйТекстовыйПарсер(ТекстМодуля);	
	вмс_ВыполнениеПрограммногоКода.ТекстовыйПарсер_СформироватьКодМодуля(ТекстовыйПарсер);
	
	ОписанияМетодов = Новый Массив;
	Для Каждого СтрокаПодпрограммы Из РК.ПолучитьЭлементыКоллекции(ТекстовыйПарсер.ТаблицаПодпрограмм) Цикл
		ОписаниеМетода = НовоеОписаниеМетода();
		ОписаниеМетода.Имя = СтрокаПодпрограммы.Имя;
		ОписаниеМетода.Тип = СтрокаПодпрограммы.Тип;
		ОписаниеМетода.Директива = СтрокаПодпрограммы.Директива;
		ОписаниеМетода.Код  = СтрокаПодпрограммы.Код;
		
		Для Каждого СтрокаПараметра Из РК.ПолучитьЭлементыКоллекции(СтрокаПодпрограммы.ТаблицаПараметров) Цикл
			Параметр = Новый Структура;
			Параметр.Вставить("Имя", СтрокаПараметра.Имя);
			ОписаниеМетода.Параметры.Добавить(Параметр);
		КонецЦикла;
		
		ОписанияМетодов.Добавить(ОписаниеМетода);
	КонецЦикла;
	
	Возврат ОписанияМетодов;
	
КонецФункции

Функция ПолучитьПолныйКодМетода(ОписаниеМетода) Экспорт
	
	Перем РК;
	
	РК = вмс_РаботаСКоллекциями;

	ТекстовыйПарсер = вмс_ВыполнениеПрограммногоКода.НовыйТекстовыйПарсер();
	Подпрограмма = РК.СкопироватьОбъект(ОписаниеМетода);
	Подпрограмма.Вставить("ТаблицаПараметров", ОписаниеМетода.Параметры);
	ПолныйКодМетода = вмс_ВыполнениеПрограммногоКода.ТекстовыйПарсер_ПолучитьКодПодпрограммы(ТекстовыйПарсер, Подпрограмма);
	
	Возврат ПолныйКодМетода;
	
КонецФункции

Функция НовоеОписаниеМетода() Экспорт
	
	ОписаниеМетода = Новый Структура;
	ОписаниеМетода.Вставить("Имя", "");
	ОписаниеМетода.Вставить("Тип", "Функция");
	ОписаниеМетода.Вставить("Директива", "");
	ОписаниеМетода.Вставить("Параметры", Новый Массив);
	ОписаниеМетода.Вставить("Код", "");
	ОписаниеМетода.Вставить("ПолныйКод", "");
	
	Возврат ОписаниеМетода;
	
КонецФункции

//
//							Классы операций-
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ВходящиеПараметры) Экспорт
	
	#Если Клиент Тогда
		Возврат вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ВходящиеПараметры);
	#Иначе
		Возврат вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ВходящиеПараметры);
	#КонецЕсли
	
КонецФункции