&НаКлиенте
Перем Переменные;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Принтер = Параметры.Принтер;
	Элементы.ГруппаДополнительныеСвойстваСетевогоПринтера.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Переменные = Новый Структура;
	Переменные.Вставить("ДлительнаяОперацияКомандыКомпоненты");
	
	ВыполнитьНаКлиентеПриИзменении();
	НастроитьВидимостьДополнительныхСвойствСетевогоПринтера();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОтменитьВыполнениеКомандыКомпоненты();
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если ТипПринтера=ПредопределенноеЗначение("Перечисление.ТипыПринтеров.ЛокальныйПринтер") Тогда
		МассивТабличныхДокументов = Новый Массив;
		МассивТабличныхДокументов.Добавить(ТестоваяСтраницаДляПечати);
		вмс_Печать.ДобавитьДокументКПечатиНаСервер(МассивТабличныхДокументов, , Принтер);
	ИначеЕсли ТипПринтера=ПредопределенноеЗначение("Перечисление.ТипыПринтеров.СерверныйПринтер") Тогда
		ВыполнитьПечатьЧерезКомпоненту();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьПечатьЧерезКомпоненту()
	
	Если ВыполнитьНаКлиенте Тогда
		ВыполнитьПечатьЧерезКомпонентуНаКлиенте();
	Иначе
		ВыполнитьПечатьЧерезКомпонентуНаСервере();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьПечатьЧерезКомпонентуНаКлиенте()
	
	СформироватьКомандуПечатиЧерезКомпонентуНаКлиенте();
	
	ЗапуститьКомандуКомпонентыПечатиНаКлиенте();
	
КонецФункции

&НаКлиенте
Функция ВыполнитьПечатьЧерезКомпонентуНаСервере()
	
	Если Переменные.ДлительнаяОперацияКомандыКомпоненты=Неопределено Тогда
		СформироватьКомандуПечатиЧерезКомпонентуНаСервере();
	КонецЕсли;
	
	ЗапуститьКомандуКомпонентыПечатиНаСервере(Истина);
	
КонецФункции

&НаКлиенте
Функция ПриНачалеВыполненияКомандыКомпоненты()
	
	КодВозвратаКомпоненты = Неопределено;
	Элементы.ИндикаторВыполнения.Картинка = БиблиотекаКартинок.ОформлениеКругПустой;
	
	Элементы.ФормаПечать.Доступность = Ложь;
	Элементы.ВыполнитьНаКлиенте.Доступность = Ложь;
	Элементы.ВыполнитьКомандуКомпоненты.Картинка = БиблиотекаКартинок.Остановить;
	Элементы.КомандаКомпоненты.ТолькоПросмотр = Истина;
	Элементы.ОбновитьКомандуКомпоненты.Доступность = Ложь;
	
КонецФункции

&НаКлиенте
Функция ПриЗавершенииВыполненияКомандыКомпоненты()

	Элементы.ФормаПечать.Доступность = Истина;
	Элементы.ВыполнитьНаКлиенте.Доступность = Истина;
	Элементы.ВыполнитьКомандуКомпоненты.Картинка = БиблиотекаКартинок.СформироватьОтчет;
	Элементы.КомандаКомпоненты.ТолькоПросмотр = Ложь;
	Элементы.ОбновитьКомандуКомпоненты.Доступность = Истина;
	
	Если КодВозвратаКомпоненты <> Неопределено Тогда
		Если КодВозвратаКомпоненты=0 Тогда
			Элементы.ИндикаторВыполнения.Картинка = БиблиотекаКартинок.ОформлениеЗнакФлажок;
		Иначе
			Элементы.ИндикаторВыполнения.Картинка = БиблиотекаКартинок.ОформлениеЗнакКрест;
		КонецЕсли;
	Иначе
		Элементы.ИндикаторВыполнения.Картинка = БиблиотекаКартинок.ОформлениеКругПустой;
	КонецЕсли;
	
	ДлительнаяОперацияКомандыКомпоненты = Переменные.ДлительнаяОперацияКомандыКомпоненты;
	Если ДлительнаяОперацияКомандыКомпоненты <> Неопределено Тогда
		ФормаОжидания = ДлительнаяОперацияКомандыКомпоненты.ФормаОжидания;
		Если ФормаОжидания <> Неопределено И ФормаОжидания.Открыта() Тогда
			ФормаОжидания.ЗакрытьПрограммно();
		КонецЕсли;

		Переменные.ДлительнаяОперацияКомандыКомпоненты = Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция НачатьВыполнениеКомандыКомпонентыВФоне(ВыводитьОкноОжидания)
	
	ДлительнаяОперацияКомандыКомпоненты = НачатьВыполнениеКомандыКомпонентыВФонеНаСервере();
	ДлительнаяОперацияКомандыКомпоненты.Вставить("ФормаОжидания");
	Переменные.ДлительнаяОперацияКомандыКомпоненты = ДлительнаяОперацияКомандыКомпоненты;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработчикЗавершенияВыполненияКомандыКомпонентыВФоне", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияКомандыКомпоненты, ОповещениеОЗавершении, ПараметрыОжидания);
	
	Если ДлительнаяОперацияКомандыКомпоненты.Статус="Выполняется" И ВыводитьОкноОжидания Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТекстСообщения", "Отправка документа на принтер");
		ОписаниеОповещенияОЗакрытииФормыОжидания = Новый ОписаниеОповещения("ОбработчикЗакрытияФормыОжидания", ЭтотОбъект);
		
		ДлительнаяОперацияКомандыКомпоненты.ФормаОжидания =
					ОткрытьФорму("ОбщаяФорма.вмс_ДлительнаяОперация", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещенияОЗакрытииФормыОжидания);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОбработчикЗакрытияФормыОжидания(Результат, ДополнительныеПараметры) Экспорт
	
	ДлительнаяОперацияКомандыКомпоненты = Переменные.ДлительнаяОперацияКомандыКомпоненты;
	
	Если ДлительнаяОперацияКомандыКомпоненты <> Неопределено И ДлительнаяОперацияКомандыКомпоненты.ФормаОжидания.ОтменитьВыполнение Тогда
		ОтменитьВыполнениеКомандыКомпоненты();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НачатьВыполнениеКомандыКомпонентыВФонеНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ДлительнаяОперацияКомандыКомпоненты = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "вмс_ОбщегоНазначенияВызовСервера.ВыполнитьПрограммныйКод", "Результат = вмс_ОбщегоНазначенияКлиентСервер.ЗапуститьПриложениеУлучшенный(Параметры, , Истина, Истина)", КомандаКомпоненты);
	Возврат ДлительнаяОперацияКомандыКомпоненты;
	
КонецФункции

&НаКлиенте
Функция ОтменитьВыполнениеКомандыКомпоненты()
	
	ДлительнаяОперацияКомандыКомпоненты = Переменные.ДлительнаяОперацияКомандыКомпоненты;
	Если ДлительнаяОперацияКомандыКомпоненты <> Неопределено Тогда
		Если ОтменитьВыполнениеКомандыКомпонентыНаСервере(ДлительнаяОперацияКомандыКомпоненты.ИдентификаторЗадания) Тогда
			ПриЗавершенииВыполненияКомандыКомпоненты();
		Иначе
			ДлительнаяОперацияКомандыКомпоненты.Статус = "Выполнено";
			ОбработчикЗавершенияВыполненияКомандыКомпонентыВФоне(ДлительнаяОперацияКомандыКомпоненты);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтменитьВыполнениеКомандыКомпонентыНаСервере(ИдентификаторЗадания)
	
	ЗавершитьПроцессКомпоненты();
	ПодождатьНемногоФоновоеЗаданиеКомпоненты(ИдентификаторЗадания);
	
	ДлительнаяОперация = ДлительныеОперации.ОперацияВыполнена(ИдентификаторЗадания);
	
	Если ДлительнаяОперация.Статус = "Выполняется" Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
		ДлительнаяОперация.Статус = "Отменено";
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗавершитьПроцессКомпоненты()
	
	ЗапуститьПриложение("taskkill /F /IM gswin32c.exe", , Истина);
	ЗапуститьПриложение("taskkill /F /IM gswin64c.exe", , Истина);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодождатьНемногоФоновоеЗаданиеКомпоненты(ИдентификаторЗадания)
	
	НачалоОжидания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Пока ТекущаяУниверсальнаяДатаВМиллисекундах()-НачалоОжидания <= 2000 Цикл
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
		Если ФоновоеЗадание=Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Попытка
			ФоновоеЗадание.ОжидатьЗавершенияВыполнения(1);
			Прервать;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ОбработчикЗавершенияВыполненияКомандыКомпонентыВФоне(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если Переменные.ДлительнаяОперацияКомандыКомпоненты=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Результат <> Неопределено Тогда
	
		Если Результат.Статус="Выполнено" Тогда
			РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			КодВозвратаКомпоненты = РезультатВыполнения.КодВозврата;
			Если КодВозвратаКомпоненты <> 0 И ЗначениеЗаполнено(РезультатВыполнения.Вывод) Тогда
				ПоказатьТекст(РезультатВыполнения.Вывод, "Ошибка печати");
			КонецЕсли;
		Иначе
			КодВозвратаКомпоненты = -1;
		КонецЕсли;
		
	КонецЕсли;
	
	ПриЗавершенииВыполненияКомандыКомпоненты();
	
КонецФункции

&НаКлиенте
Функция ПоказатьТекст(ТекстОшибки, Заголовок=Неопределено)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстОшибки);
	ТекстовыйДокумент.Показать(Заголовок);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьКомандуКомпоненты(Команда)
	
	Если ВыполнитьНаКлиенте Тогда
		СформироватьКомандуПечатиЧерезКомпонентуНаКлиенте();
	Иначе
		СформироватьКомандуПечатиЧерезКомпонентуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьКомандуПечатиЧерезКомпонентуНаКлиенте()
	
	Возврат СформироватьКомандуПечатиЧерезКомпонентуНаКлиентеНаСервере(ЭтаФорма);
	
КонецФункции

&НаСервере
Функция СформироватьКомандуПечатиЧерезКомпонентуНаСервере()
	
	Возврат СформироватьКомандуПечатиЧерезКомпонентуНаКлиентеНаСервере(ЭтаФорма);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьКомандуПечатиЧерезКомпонентуНаКлиентеНаСервере(Форма)
	
	Форма.КомандаКомпоненты = вмс_ПечатьКлиентСервер.ПолучитьКомандуПечатиСервернойКомпонентыПечати(Форма.ТестоваяСтраницаДляПечати, Форма.Принтер);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьКомандуКомпоненты(Команда)
	Если ВыполнитьНаКлиенте Тогда
		ЗапуститьКомандуКомпонентыПечатиНаКлиенте();
	Иначе
		ЗапуститьКомандуКомпонентыПечатиНаСервере(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ЗапуститьКомандуКомпонентыПечатиНаСервере(ВыводитьОкноОжидания)
	
	ДлительнаяОперацияКомандыКомпоненты = Переменные.ДлительнаяОперацияКомандыКомпоненты;
	
	Если ДлительнаяОперацияКомандыКомпоненты=Неопределено Тогда
		ПриНачалеВыполненияКомандыКомпоненты();
		
	    НачатьВыполнениеКомандыКомпонентыВФоне(ВыводитьОкноОжидания);
	Иначе
		// уже запущено, выполним отмену
		ОтменитьВыполнениеКомандыКомпоненты();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ЗапуститьКомандуКомпонентыПечатиНаКлиенте()
	
	ПриНачалеВыполненияКомандыКомпоненты();
	
	РезультатВыполнения = вмс_ОбщегоНазначенияКлиентСервер.ЗапуститьПриложениеУлучшенный(КомандаКомпоненты, , Истина, Истина);
	КодВозвратаКомпоненты = РезультатВыполнения.КодВозврата;
	Если КодВозвратаКомпоненты <> 0 И ЗначениеЗаполнено(РезультатВыполнения.Вывод) Тогда
		ПоказатьТекст(РезультатВыполнения.Вывод, "Ошибка печати");
	КонецЕсли;
	
	ПриЗавершенииВыполненияКомандыКомпоненты();
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьНаКлиентеПриИзменении(Элемент=Неопределено)
	ПринтерПриИзменении();
	ОбновитьПользователяОС();
КонецПроцедуры

&НаКлиенте
Функция ОбновитьПользователяОС()
	
	Если ВыполнитьНаКлиенте Тогда
		Модуль = вмс_ОбщегоНазначенияКлиентСервер;
	Иначе
		Модуль = вмс_ОбщегоНазначенияВызовСервера;
	КонецЕсли;
	
	ИмяКомпьютера = Модуль.ПолучитьИмяСистемнойПеременной("COMPUTERNAME");
	ПользовательОС = Модуль.ПолучитьИмяПользователяОС();
	
КонецФункции

&НаКлиенте
Процедура ДополнительныеСвойстваСетевогоПринтера(Команда)
	
	Элементы.ГруппаДополнительныеСвойстваСетевогоПринтера.Видимость = НЕ Элементы.ГруппаДополнительныеСвойстваСетевогоПринтера.Видимость;
	
	НастроитьВидимостьДополнительныхСвойствСетевогоПринтера();
	
КонецПроцедуры

&НаКлиенте
Функция НастроитьВидимостьДополнительныхСвойствСетевогоПринтера()
	
	Если Элементы.ГруппаДополнительныеСвойстваСетевогоПринтера.Видимость Тогда
		Элементы.ДополнительныеСвойстваСетевогоПринтера.Заголовок = "Дополнительно <<";
	Иначе
		Элементы.ДополнительныеСвойстваСетевогоПринтера.Заголовок = "Дополнительно >>";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПринтерПриИзменении(Элемент=Неопределено)
	
	Если ВыполнитьНаКлиенте Тогда
		ПринтерПриИзмененииНаКлиентеНаСервере(ЭтаФорма);
	Иначе
		ПринтерПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКомпонентуСетевойПечати(Команда)
	
	Если ВыполнитьНаКлиенте Тогда
		вмс_ПечатьКлиентСервер.УстановитьКомпонентуСетевойПечати();
	Иначе
		вмс_Печать.УстановитьКомпонентуСетевойПечати();
	КонецЕсли;
	
	ПринтерПриИзменении();
	
КонецПроцедуры

&НаСервере
Функция ПринтерПриИзмененииНаСервере()
	
	ПринтерПриИзмененииНаКлиентеНаСервере(ЭтаФорма);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПринтерПриИзмененииНаКлиентеНаСервере(Форма)
	
	Форма.ТипПринтера = вмс_Печать.ПолучитьДанныеПринтера(Форма.Принтер).ТипПринтера;

	Если Форма.ТипПринтера=ПредопределенноеЗначение("Перечисление.ТипыПринтеров.СерверныйПринтер") Тогда
		Если вмс_ПечатьКлиентСервер.КомпонентаСетевойПечатиУстановлена() Тогда
			Форма.Элементы.ГруппаУстановкаКомпонентыСетевойПечати.Видимость = Ложь;
			Форма.ПутьКомпонентыСетевойПечати = вмс_ПечатьКлиентСервер.ПолучитьПутьКФайлуКомпонентуСетевойПечатиПоУмолчанию();
		Иначе
			Форма.Элементы.ГруппаУстановкаКомпонентыСетевойПечати.Видимость = Истина;
			Форма.ПутьКомпонентыСетевойПечати = "";
		КонецЕсли;
		Форма.Элементы.ГруппаСвойстваТиповПринтеров.ТекущаяСтраница = Форма.Элементы.ГруппаСвойстваСетевогоПринтера;
	Иначе
		Форма.Элементы.ГруппаСвойстваТиповПринтеров.ТекущаяСтраница = Форма.Элементы.ГруппаСвойстваЛокальногоПринтера;
	КонецЕсли;
	
КонецФункции
