///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область Адаптация

Функция ПолучитьИмяРегистраВерсииПодсистем() Экспорт
	
	ВариантыРегистра = Новый Массив;
	ВариантыРегистра.Добавить("ВерсииПодсистем");
	ВариантыРегистра.Добавить("вмс_ВерсииПодсистем");
	
	Для Каждого ВариантРегистра Из ВариантыРегистра Цикл
		МетаДанныеРегистра = МетаДанные.РегистрыСведений.Найти(ВариантРегистра);
		Если МетаДанныеРегистра <> Неопределено Тогда
			Возврат МетаДанныеРегистра.Имя;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьПолноеИмяРегистраВерсииПодсистем() Экспорт
	
	ИмяРегистра = ПолучитьИмяРегистраВерсииПодсистем();
	
	Если ИмяРегистра <> Неопределено Тогда
		Возврат "РегистрСведений." + ИмяРегистра;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
