
Функция ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	НастроитьЭлементыФормы(Форма);
	
КонецФункции

Функция НастроитьЭлементыФормы(Форма)

	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("НастройкаПолей_Контекст", Новый ОписаниеТипов("Строка")));
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПолноеИмяЭлемента", Новый ОписаниеТипов("Строка"), "НастройкаПолей_ЭлементыВывода"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТипЭлемента", Новый ОписаниеТипов("Строка"), "НастройкаПолей_ЭлементыВывода"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВидЭлемента", Новый ОписаниеТипов("Строка"), "НастройкаПолей_ЭлементыВывода"));

	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПолноеИмяЭлемента", Новый ОписаниеТипов("Строка"), "НастройкаПолей_ПоляДанных"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТипЭлемента", Новый ОписаниеТипов("Строка"), "НастройкаПолей_ПоляДанных"));
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПолноеИмяЭлемента", Новый ОписаниеТипов("Строка"), "НастройкаПолей_СборщикиДанных"));
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПолноеИмяЭлемента", Новый ОписаниеТипов("Строка"), "НастройкаПолей_СвойстваЭлементов"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КлассЭлемента", Новый ОписаниеТипов("Строка"), "НастройкаПолей_СвойстваЭлементов"));
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Форма.НастройкаПолей_Контекст = ПоместитьВоВременноеХранилище(вмс_НастройкиПолейЗадания1.НовыйКонтекст(), Форма.УникальныйИдентификатор);
	
	УстановитьСвойстваЭлементов(Форма,
								"НастройкаПолей_ЭлементыВыводаИмяЭлемента, НастройкаПолей_ПоляДанныхИмяЭлемента, НастройкаПолей_СборщикиДанныхИмяЭлемента, НастройкаПолей_СвойстваЭлементовИмяСвойства",
								Новый Структура("ТолькоПросмотр", Истина));
	
	УстановитьСвойстваЭлементов(Форма,
								"НастройкаПолей_СвойстваЭлементов",
								Новый Структура("ИзменятьСоставСтрок, ИзменятьПорядокСтрок", Ложь, Ложь));

								
								
	УстановитьСобытияЭлементов(	Форма,
								"ГруппаНастройкаПолей_Страницы",
								"ПриСменеСтраницы",
								"ГруппаНастройкаПолей_Страницы_");

	УстановитьСобытияЭлементов(	Форма,
								"НастройкаПолей_ЭлементыВывода, НастройкаПолей_ПоляДанных, НастройкаПолей_СборщикиДанных",
								"ПриАктивизацииСтроки, ПередНачаломДобавления, ПередУдалением, ПроверкаПеретаскивания, ОкончаниеПеретаскивания, Перетаскивание",
								"НастройкаПолей_Элементы_");
	
	УстановитьСобытияЭлементов(	Форма,
								"НастройкаПолей_СвойстваЭлементов",
								"Выбор, ПриАктивизацииСтроки, ПередНачаломИзменения",
								"НастройкаПолей_СвойстваЭлементов_");
	
	УстановитьСобытияЭлементов(	Форма,
								"НастройкаПолей_СвойстваЭлементовЗначение",
								"ПриИзменении",
								"НастройкаПолей_СвойстваЭлементов_Значение_");

КонецФункции

Функция УстановитьСвойстваЭлементов(Форма, знач Элементы, Свойства)

	РК = вмс_РаботаСКоллекциями;
	
	Элементы = РК.ЗначениеВМассив(Элементы);
	
	Для Каждого ИмяЭлемента Из Элементы Цикл
		
		Элемент = Форма.Элементы.Найти(ИмяЭлемента);
		Если Элемент=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Свойство Из Свойства Цикл
			Элемент[Свойство.Ключ] = Свойство.Значение;
		КонецЦикла;
		
	КонецЦикла;
	
КонецФункции

Функция УстановитьСобытияЭлементов(Форма, знач Элементы, знач События, ПрефиксОбработчиков)
	
	РК = вмс_РаботаСКоллекциями;
	
	Элементы = РК.ЗначениеВМассив(Элементы);
	События = РК.ЗначениеВМассив(События);
	
	Для Каждого ИмяЭлемента Из Элементы Цикл
		
		Элемент = Форма.Элементы.Найти(ИмяЭлемента);
		Если Элемент=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Событие Из События Цикл
			Действие = Элемент.ПолучитьДействие(Событие);
			Если Действие="" Тогда
				Элемент.УстановитьДействие(Событие, ПрефиксОбработчиков + Событие);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;

КонецФункции

Функция СКДРеквизитовЗадания() Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	СКД = Документы.вмс_ЗаданиеКладовщику.ПолучитьМакет("СКДРеквизитов");
		
	ИсключенияРеквизитов = Новый Соответствие;
	ИсключенияРеквизитов["НастройкаПолей"] = Истина;
	ИсключенияРеквизитов["НастройкаСтраниц"] = Истина;
	
	СинонимыРеквизитов = Новый Соответствие;
	СинонимыРеквизитов["Товары.Номенклатура"] = "Товары.Товар";
	СинонимыРеквизитов["Товары.Количество"] = РК.СтрокуВМассив("Товары.Количество, Товары.КоличествоРазмещено, Товары.КоличествоОтобрано");
	
	ДобавленныеПоляЗапроса = Новый Соответствие;
	
	МетаданныеЗадания = Документы.вмс_ЗаданиеКладовщику.ПустаяСсылка().Метаданные();
	
	СКД = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СКД.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "Источник1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "Набор1";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	НаборДанных.ИсточникДанных = ИсточникДанных.Имя;

	Разделитель = "," + Символы.ПС + Символы.Таб;
	ТекстПолейЗапроса = "";
	Для Каждого Реквизит Из МетаданныеЗадания.СтандартныеРеквизиты Цикл
		ПутьРеквизита = Реквизит.Имя;
		Если ИсключенияРеквизитов[ПутьРеквизита]=Истина Тогда
			Продолжить;
		КонецЕсли;
		Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		Поле.Поле = ПутьРеквизита;
		Поле.ПутьКДанным = "Задание." + ПутьРеквизита;
		ТекстПолейЗапроса = ТекстПолейЗапроса + ПутьРеквизита + Разделитель;
	КонецЦикла;

	Для Каждого Реквизит Из МетаданныеЗадания.Реквизиты Цикл
		ПутьРеквизита = Реквизит.Имя;
		Если ИсключенияРеквизитов[ПутьРеквизита]=Истина Тогда
			Продолжить;
		КонецЕсли;
		Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		Поле.Поле = ПутьРеквизита;
		Поле.ПутьКДанным = "Задание." + ПутьРеквизита;
		ТекстПолейЗапроса = ТекстПолейЗапроса + ПутьРеквизита + Разделитель;
	КонецЦикла;
	
	Для Каждого ТабличнаяЧасть Из МетаданныеЗадания.ТабличныеЧасти Цикл
		Если ИсключенияРеквизитов[ТабличнаяЧасть.Имя]=Истина Тогда
			Продолжить;
		КонецЕсли;

		Поле = НаборДанных.Поля.Добавить(Тип("ВложенныйНаборДанныхСхемыКомпоновкиДанных"));
		Поле.Поле = ТабличнаяЧасть.Имя;
		Поле.ПутьКДанным = "Задание." + Поле.Поле;

		ТекстПолейЗапроса = ТекстПолейЗапроса + Поле.Поле + ".(" + Символы.ПС + Символы.Таб + Символы.Таб;
		Разделитель0 = Разделитель;
		Разделитель = Разделитель + Символы.Таб;
		
		Для Каждого Реквизит Из ТабличнаяЧасть.СтандартныеРеквизиты Цикл
			ПутьРеквизита = ТабличнаяЧасть.Имя + "." + Реквизит.Имя;
			Если ИсключенияРеквизитов[ПутьРеквизита]=Истина Тогда
				Продолжить;
			КонецЕсли;
			Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			Поле.Поле = ПутьРеквизита;
			Поле.ПутьКДанным = "Задание." + ПутьРеквизита;
			ТекстПолейЗапроса = ТекстПолейЗапроса + ПутьРеквизита + Разделитель;
		КонецЦикла;

		Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			ПутьРеквизита = ТабличнаяЧасть.Имя + "." + Реквизит.Имя;
			Если ИсключенияРеквизитов[ПутьРеквизита]=Истина Тогда
				Продолжить;
			КонецЕсли;
			
			СинонимыРеквизита = СинонимыРеквизитов[ПутьРеквизита];
			Если СинонимыРеквизита=Неопределено Тогда
				СинонимыРеквизита = Новый Массив;
				СинонимыРеквизита.Добавить(ПутьРеквизита);
			Иначе
				СинонимыРеквизита = РК.ЗначениеВМассив(СинонимыРеквизита);
			КонецЕсли;
			
			Для Каждого СинонимРеквизита Из СинонимыРеквизита Цикл
				Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
				Поле.Поле = ПутьРеквизита;
				Поле.ПутьКДанным = "Задание." + СинонимРеквизита;
				Если ДобавленныеПоляЗапроса[ПутьРеквизита] <> Истина Тогда
					ТекстПолейЗапроса = ТекстПолейЗапроса + ПутьРеквизита + Разделитель;
					ДобавленныеПоляЗапроса[ПутьРеквизита] = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если Прав(ТекстПолейЗапроса, СтрДлина(Разделитель))=Разделитель Тогда
			ТекстПолейЗапроса = Лев(ТекстПолейЗапроса, СтрДлина(ТекстПолейЗапроса)-СтрДлина(Разделитель));
		КонецЕсли;
		Разделитель = Разделитель0;
		ТекстПолейЗапроса = ТекстПолейЗапроса + Символы.ПС + Символы.Таб + ")" + Разделитель;
		
	КонецЦикла;

	Если Прав(ТекстПолейЗапроса, СтрДлина(Разделитель))=Разделитель Тогда
		ТекстПолейЗапроса = Лев(ТекстПолейЗапроса, СтрДлина(ТекстПолейЗапроса)-СтрДлина(Разделитель));
	КонецЕсли;
	
	НаборДанных.Запрос = 	"ВЫБРАТЬ
							|	" + ТекстПолейЗапроса + "
							|ИЗ
							|	" + МетаданныеЗадания.ПолноеИмя();
	
	Возврат СКД;
	
КонецФункции
