#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область API

// Процедура - Выполнить правило конвертации
// Создаёт или изменяет документ согласно правилу конвертации.
// Параметры Источник и Приемник позволяют изменить соотвествующие значение ключа в  структуре правиле конвертации.
// Если они неопределены, то то правило будет выполнятся точь в точь. 
// Для изменения других значений используется параметр струтура "ДополнительныеПараметры", которые должен иметь теже
// ключи, что и Правило конвертации
// Параметры:
//  ПравилоКонвертации	 - 	СправочникСсылка.вмс_ПравилаКонвертацииРеквизитов 
//  ПараметрыВыполнения		-	Структура
//  	Источник			 	-	ДокументСсылка    
//  	Приемник			 	-	ДокументСсылка 
//  	ОперацияПоЯчейкам		-	ДокументСсылка
//  	ОперацияТСД	 - 	ДокументСсылка     
// ДополнительныеПараметрыВыполненияАлгоритма - Данные получаемые из тсд

Функция ВыполнитьПравилоКонвертации(ПравилоКонвертации,  ПараметрыВыполнения = Неопределено, ДополнительныеПараметрыВыполненияАлгоритма = Неопределено) Экспорт
	
	Если ТипЗнч(ПравилоКонвертации) = Тип("СправочникСсылка.вмс_ПравилаКонвертацииРеквизитов") Тогда	
		ПараметрыКонвертации = ПравилоКонвертации.ПолучитьОбъект().ПолучитьПравилоКонвертации();  
		Алгоритмы = ПравилоКонвертации.Алгоритмы.ВыгрузитьКолонку("Алгоритм"); 
	КонецЕсли; 
	
	Если ТипЗнч(ПравилоКонвертации) = Тип("Структура") Тогда	
		ПараметрыКонвертации = ПравилоКонвертации; 
		Алгоритмы = Неопределено;
	КонецЕсли;
	
	Если ПараметрыКонвертации = Неопределено  Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения) Тогда	
		ИзменитьПравилоКонвертации(ПараметрыКонвертации, ПараметрыВыполнения);		
	КонецЕсли;
	
	Возврат ЗаполнитьДокументПриемник(ПараметрыКонвертации, Алгоритмы, ДополнительныеПараметрыВыполненияАлгоритма);
	
КонецФункции

Функция СохранитьПравилоКонвертации(СсылкаИлиСтрока, Знач ДанныеПравилоКонвертации) Экспорт  ;
		
	Если ТипЗнч(СсылкаИлиСтрока) = Тип("Строка") Тогда     
		ПравилоКонвертацииОбъект = Справочники.вмс_ПравилаКонвертацииРеквизитов.СоздатьЭлемент();
		ПравилоКонвертацииОбъект.Заполнить(Неопределено);
		ПравилоКонвертацииОбъект.Наименование = СсылкаИлиСтрока;                                                                  
	ИначеЕсли ТипЗнч(СсылкаИлиСтрока) = Тип("СправочникСсылка.вмс_ПравилаКонвертацииРеквизитов") Тогда	
		ПравилоКонвертацииОбъект = СсылкаИлиСтрока.ПолучитьОбъект(); 	
	КонецЕсли;  	
	
	ПравилоКонвертацииОбъект.ПравилоКонвертации = Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(ДанныеПравилоКонвертации));    
	
	Если ДанныеПравилоКонвертации.ТипИсточника = "Документ.вмс_ОперацияПоЯчейкам" Тогда
		ПравилоКонвертацииОбъект.ИмяИсточникаВКонфигураторе = ""; 
	Иначе
		ПравилоКонвертацииОбъект.ИмяИсточникаВКонфигураторе = ДанныеПравилоКонвертации.ТипИсточника;
	КонецЕсли;	

	ПравилоКонвертацииОбъект.Записать();  	  
	
	Возврат   ПравилоКонвертацииОбъект.Ссылка;   
		
КонецФункции

Функция ЗаполнитьДокументПриемник(ПравилаКонвертации, Алгоритмы = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт	
	
	Попытка
		
		Если ПравилаКонвертации.ПерезаполнитьИсточник  Тогда
			
			ПравилаКонвертации.ИмяТабличнойЧастиПриемник= ПравилаКонвертации.ИмяТабличнойЧастиИсточник;
			ПравилаКонвертации.ТипПриемника = ПравилаКонвертации.ТипИсточника;
			ПравилаКонвертации.Приемник = ПравилаКонвертации.Источник;	
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПравилаКонвертации.Приемник) Тогда
			ДокументПриемник = Документы[СтрЗаменить(ПравилаКонвертации.ТипПриемника,  "Документ.","")].СоздатьДокумент(); 
			ДокументПриемник.Дата = ТекущаяДата(); 
		Иначе	
			ДокументПриемник = ПравилаКонвертации.Приемник.ПолучитьОбъект();
			Если ПравилаКонвертации.ПравилаКонвертацииРеквизитовТабличнойЧасти.Количество() > 0  Тогда	
				Если ПравилаКонвертации.ОчиститьТабличнуюЧастьПриемника Тогда	
					ДокументПриемник[ПравилаКонвертации.ИмяТабличнойЧастиПриемник].Очистить();
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли; 
		
		Если ПравилаКонвертации.ЗаполнитьНаОсновании Тогда
			ДокументПриемник.Заполнить(ПравилаКонвертации.Источник);
		//Иначе
			//ДокументПриемник.Заполнить(Неопределено);
		КонецЕсли;
		
		
		Если ПравилаКонвертации.ПравилаКонвертацииРеквизитовШапки.Количество() > 0 Тогда	
			ЗаполнитьШапкуДокументаПриемникаДаннымиИсточника(ДокументПриемник , ПравилаКонвертации.Источник, ПравилаКонвертации.ПравилаКонвертацииРеквизитовШапки);
		КонецЕсли;   
		
		Если ПравилаКонвертации.ПравилаКонвертацииРеквизитовТабличнойЧасти.Количество() > 0  Тогда
			
			ЗаполнитьТабличнуюЧастьДокументаПриемникаДаннымиИсточника(ДокументПриемник, ПравилаКонвертации.Источник, ПравилаКонвертации); 
			
		КонецЕсли;
		
		Если ПравилаКонвертации.ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД  ИЛИ  ПравилаКонвертации.ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД Тогда
			ЗаполнитьТабличнуюЧастьДокументаПриемникаДаннымиТСД(ДокументПриемник, ПравилаКонвертации.Источник, ПравилаКонвертации);
		КонецЕсли;	
		
		
		Если ТипЗнч(ПравилаКонвертации.Источник) = Тип("ДокументСсылка.вмс_ОперацияПоЯчейкам") И ПравилаКонвертации.ЗаполнитьКодыМаркировки Тогда
		
			//ЗаполнитьКодыМаркировки(ДокументПриемник, ПравилаКонвертации.Источник.КодыМаркировки);
			вмс_ОбработкаМаркировкиСервер.ЗаполнениеШтрихкдовУпаковокВДокументнте(ДокументПриемник, Новый Структура("ДокументТСД", ПравилаКонвертации.Источник));
		
		КонецЕсли;
		
		Если ПравилаКонвертации.УдалитьСтрокиПриемникаСНулевымКоличеством И ЗначениеЗаполнено(ПравилаКонвертации.ИмяТабличнойЧастиПриемник) Тогда
			
			ТаблицаПриемника = ДокументПриемник[ПравилаКонвертации.ИмяТабличнойЧастиПриемник];
						
			Если ДокументПриемник.Метаданные().ТабличныеЧасти[ПравилаКонвертации.ИмяТабличнойЧастиПриемник].Реквизиты.Найти("Количество") <> Неопределено Тогда
				
				Для Итератор = 1 - ТаблицаПриемника.Количество() По 0 Цикл
					
					Если Не ЗначениеЗаполнено( ТаблицаПриемника[-Итератор].Количество)   Тогда
						ТаблицаПриемника.Удалить(-Итератор);
					КонецЕсли;
					
				КонецЦикла;	       
				
			КонецЕсли;
			
		КонецЕсли;  
		
		Если ПравилаКонвертации.ДозаполнитьТабличнуюЧасть Тогда
			
			Попытка
				вмс_АдаптацияКонфигураций.ДозаполнитьДокумент(ДокументПриемник);
			Исключение
				
				// Перехватываем все сообщенное при ошибке и добавляем их в одно исключение.
				ТекстИсключения = "";
				Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Ложь) Цикл
					ТекстИсключения = ТекстИсключения + Символы.ПС + Сообщение.Текст;
				КонецЦикла;
				
				Контекст = СтрШаблон("Источник %1; Приемник %2; Вид операции %3", ПравилаКонвертации.Источник, ДокументПриемник, ПравилаКонвертации.ОперацияТСД);
				вмс_Журналирование.Ошибка("" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()) + Символы.ПС + СокрЛП(ТекстИсключения), Контекст);
				
				//СообщениеОбОшибке =  " Ошибка: " + ОписаниеОшибки() + ";";
				//ЗаписьЖурналаРегистрации("WMS"
				//,УровеньЖурналаРегистрации.Ошибка ,,,"" + ДокументПриемник + " " + СообщениеОбОшибке);	
			КонецПопытки;
			
		КонецЕсли;
		
		ВходящиеПараметры = Новый Структура;
		ВходящиеПараметры.Вставить("Приемник", ДокументПриемник);
		ВходящиеПараметры.Вставить("Источник", ПравилаКонвертации.Источник);
		ВходящиеПараметры.Вставить("ДокументТСД", ПравилаКонвертации.ОперацияПоЯчейкам); 
		ВходящиеПараметры.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
		ВходящиеПараметры.Вставить("ВидОперации", ПравилаКонвертации.ОперацияТСД);
		ВходящиеПараметры.Вставить("ПравилаКонвертации", ПравилаКонвертации);
			
		Если Алгоритмы <> Неопределено Тогда		
			Для каждого СтрокаАлгоритм  Из Алгоритмы Цикл	
				вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьАлгоритм(СтрокаАлгоритм, ВходящиеПараметры);	
			КонецЦикла;
		КонецЕсли;   		
		
	Исключение
		
		// Перехватываем все сообщенное при ошибке и добавляем их в одно исключение.
		ТекстИсключения = "";
		Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Ложь) Цикл
			ТекстИсключения = ТекстИсключения + Символы.ПС + Сообщение.Текст;
		КонецЦикла;
		
		Контекст = СтрШаблон("Источник %1; Приемник %2; Вид операции %3", ПравилаКонвертации.Источник, ДокументПриемник, ПравилаКонвертации.ОперацияТСД);
		вмс_Журналирование.Ошибка("" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()) + Символы.ПС + СокрЛП(ТекстИсключения), Контекст);
		
		//СообщениеОбОшибке =  " Ошибка: " + ОписаниеОшибки() + ";";
		//ЗаписьЖурналаРегистрации("WMS",УровеньЖурналаРегистрации.Ошибка ,,,"" + ДокументПриемник + " " + СообщениеОбОшибке);
		
		Возврат Неопределено;  
		
	КонецПопытки;
	
	ДокументПриемник.Записать();  
	
	Если ПравилаКонвертации.ПроводитьДокумент Тогда
		Попытка
			ДокументПриемник.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			
			// Перехватываем все сообщенное при ошибке и добавляем их в одно исключение.
			ТекстИсключения = "";
			Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Ложь) Цикл
				ТекстИсключения = ТекстИсключения + Символы.ПС + Сообщение.Текст;
			КонецЦикла;
				
			Контекст = СтрШаблон("Источник %1; Приемник %2; Вид операции %3", ПравилаКонвертации.Источник, ДокументПриемник, ПравилаКонвертации.ОперацияТСД);
			вмс_Журналирование.Ошибка("" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()) + Символы.ПС + СокрЛП(ТекстИсключения), Контекст);	
			//СообщениеОбОшибке =  " Ошибка: " + ОписаниеОшибки() + ";";
			//ЗаписьЖурналаРегистрации("WMS" ,УровеньЖурналаРегистрации.Ошибка ,,,"" + ДокументПриемник + " " + СообщениеОбОшибке);
		КонецПопытки;   
	КонецЕсли;
	
	Возврат ДокументПриемник.Ссылка; 

КонецФункции 

Функция ПолучитьПустыеПараметрыВыполненияПравила() Экспорт
	
	ПараметрыВыполнения = Новый Структура;
	
	ПараметрыВыполнения.Вставить("ОперацияТСД", Неопределено);
	ПараметрыВыполнения.Вставить("Источник", Неопределено);
	ПараметрыВыполнения.Вставить("ОперацияПоЯчейкам",Неопределено);
	ПараметрыВыполнения.Вставить("Приемник",Неопределено);
	
	Возврат ПараметрыВыполнения;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедуры

Процедура ИзменитьПравилоКонвертации(ПравилоКонвертации, Параметры) Экспорт
	
	Для каждого НовоеЗначениеПравила  Из Параметры Цикл
		
		СвойствоНайдено = ПравилоКонвертации.Свойство(НовоеЗначениеПравила.Ключ);
		Если СвойствоНайдено Тогда
			ПравилоКонвертации[НовоеЗначениеПравила.Ключ] = НовоеЗначениеПравила.Значение;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуДокументаПриемникаДаннымиИсточника(Приемник, Источник, РеквизитыШапкиДокумента)    
	
	РеквизитыШапкиСПометкой = РеквизитыШапкиДокумента.НайтиСтроки(Новый Структура("Пометка", Истина));
	
	Если РеквизитыШапкиСПометкой.Количество()>0 Тогда
		Для Каждого СтрокаТаблицыРеквизитовШапкиДокумента Из РеквизитыШапкиСПометкой  Цикл
			
			Если СтрокаТаблицыРеквизитовШапкиДокумента.ЗначениеПоУмолчанию <> Неопределено Тогда
				
				Приемник[СтрокаТаблицыРеквизитовШапкиДокумента.ИмяРеквизитаПриемник] = СтрокаТаблицыРеквизитовШапкиДокумента.ЗначениеПоУмолчанию;
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицыРеквизитовШапкиДокумента.Выражение)  Тогда
				
				Выполнить(СтрокаТаблицыРеквизитовШапкиДокумента.Выражение );
				
			ИначеЕсли  СтрокаТаблицыРеквизитовШапкиДокумента.ИмяРеквизитаИсточник <> "" Тогда
				
				Приемник[СтрокаТаблицыРеквизитовШапкиДокумента.ИмяРеквизитаПриемник] = Источник[СтрокаТаблицыРеквизитовШапкиДокумента.ИмяРеквизитаИсточник];
				
			КонецЕсли;  
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьДокументаПриемникаДаннымиИсточника(Приемник, Источник, ПравилаКонвертации)
	
	ТаблицаИсточника = Источник[ПравилаКонвертации.ИмяТабличнойЧастиИсточник].Выгрузить();	
	РеквизитыТабличнойЧастиСПометкой = ПравилаКонвертации.ПравилаКонвертацииРеквизитовТабличнойЧасти.НайтиСтроки(Новый Структура("Пометка", Истина));	
	КолонкиГруппировки = Новый Соответствие;   
	КолонкиСуммирования = Новый Массив;   

	Для каждого СтрокаНастройкиПравилаКонвертации  Из РеквизитыТабличнойЧастиСПометкой Цикл
		Если СтрокаНастройкиПравилаКонвертации.ИмяРеквизитаИсточник <> "" Тогда	
			Если   НЕ СтрокаНастройкиПравилаКонвертации.КолонкаСуммирования Тогда
				КолонкиГруппировки.Вставить(СтрокаНастройкиПравилаКонвертации.ИмяРеквизитаИсточник, СтрокаНастройкиПравилаКонвертации.ИмяРеквизитаПриемник);	
			Иначе             
				КолонкиСуммирования.Добавить(СтрокаНастройкиПравилаКонвертации.ИмяРеквизитаИсточник);
			КонецЕсли;	 
		КонецЕсли;
	КонецЦикла;    
	
	СвернутьТаблицу(КолонкиГруппировки, КолонкиСуммирования , ТаблицаИсточника);	
	
	Если РеквизитыТабличнойЧастиСПометкой.Количество()>0 Тогда
		
		Для каждого ТеущаяСтрокаИсточника Из ТаблицаИсточника Цикл 
			
			НайденнаяСтрока = ПоискСтрокиВТабличнойЧастиПриемника(ТеущаяСтрокаИсточника, Приемник[ПравилаКонвертации.ИмяТабличнойЧастиПриемник], КолонкиГруппировки);
			
			Если НайденнаяСтрока.Количество() = 0 Тогда
				ТеущаяСтрокаПриемника = Приемник[ПравилаКонвертации.ИмяТабличнойЧастиПриемник].Добавить();	 
			Иначе
				ТеущаяСтрокаПриемника = НайденнаяСтрока[0];
			КонецЕсли; 

			Для каждого СтрокаТаблицыРеквизитовТабличнойЧастиДокумента Из РеквизитыТабличнойЧастиСПометкой  Цикл
				
				Если СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.ЗначениеПоУмолчанию <> Неопределено Тогда
					
					ТеущаяСтрокаПриемника[СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.ИмяРеквизитаПриемник] = СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.ЗначениеПоУмолчанию;	
					
				ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.Выражение)  Тогда
					
					Выполнить(СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.Выражение );
					
				ИначеЕсли СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.ИмяРеквизитаИсточник <> "" Тогда        

					ТеущаяСтрокаПриемника[СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.ИмяРеквизитаПриемник] = 
						ТеущаяСтрокаИсточника[СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.ИмяРеквизитаИсточник];
					
				КонецЕсли;   
				
			КонецЦикла;	
			
		КонецЦикла;    
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьДокументаПриемникаДаннымиТСД(Приемник, Источник, ПравилаКонвертации)
	
	КодыМаркировки = Неопределено;
	Если ПравилаКонвертации.ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД  Тогда
		
		ТоварыИзТСД = ТоварыИзТСД(ПравилаКонвертации.Источник, ПравилаКонвертации.ОперацияТСД, Ложь);
		
	Иначе  
		
		Если ПравилаКонвертации.ЗаполнитьКодыМаркировки Тогда  
			
			РезультатЗапроса = ТоварыИзТСД(ПравилаКонвертации.Источник, ПравилаКонвертации.ОперацияТСД, ,ПравилаКонвертации.ЗаполнитьКодыМаркировки);  
			КодыМаркировки = РезультатЗапроса.КодыМаркировки;   
			ТоварыИзТСД = РезультатЗапроса.Товары;  
			
		Иначе 
			
			ТоварыИзТСД = ТоварыИзТСД(ПравилаКонвертации.Источник, ПравилаКонвертации.ОперацияТСД, ,ПравилаКонвертации.ЗаполнитьКодыМаркировки);
			
		КонецЕсли;
			
	КонецЕсли;    
	
	
	РеквизитыТабличнойЧастиСПометкой = ПравилаКонвертации.РеквизитыТабличнойЧастиТСД.НайтиСтроки(Новый Структура("Пометка",Истина));	
	
	КолонкиГруппировки = Новый Соответствие;   
	КолонкиСуммирования = Новый Массив;   

	Для каждого СтрокаНастройкиПравилаКонвертации  Из РеквизитыТабличнойЧастиСПометкой Цикл
		Если   Не СтрокаНастройкиПравилаКонвертации.КолонкаСуммирования Тогда
			КолонкиГруппировки.Вставить(СтрокаНастройкиПравилаКонвертации.ИмяРеквизитаИсточник, СтрокаНастройкиПравилаКонвертации.ИмяРеквизитаПриемник);	
		Иначе             
			КолонкиСуммирования.Добавить(СтрокаНастройкиПравилаКонвертации.ИмяРеквизитаИсточник);
		КонецЕсли;	
	КонецЦикла;    
	
	СвернутьТаблицу(КолонкиГруппировки, КолонкиСуммирования , ТоварыИзТСД);
	
	
	Если РеквизитыТабличнойЧастиСПометкой.Количество()>0 Тогда  
		
		ИспользуетсяСерия = ТоварыИзТСД.Колонки.Найти("Серия") <> Неопределено;
		
		Для каждого ТеущаяСтрокаИсточника Из ТоварыИзТСД  Цикл      
			
			Если ИспользуетсяСерия Тогда  
				ТеущаяСтрокаИсточника.Серия =  ?(ТеущаяСтрокаИсточника.Серия = Неопределено, Справочники.СерииНоменклатуры.ПустаяСсылка(), ТеущаяСтрокаИсточника.Серия);	
			КонецЕсли;
						
			НайденнаяСтрока = ПоискСтрокиВТабличнойЧастиПриемника(ТеущаяСтрокаИсточника, Приемник[ПравилаКонвертации.ИмяТабличнойЧастиПриемник], КолонкиГруппировки);
						
			Если НайденнаяСтрока.Количество() = 0 Тогда
				ТеущаяСтрокаПриемника = Приемник[ПравилаКонвертации.ИмяТабличнойЧастиПриемник].Добавить();  
			Иначе
				ТеущаяСтрокаПриемника = НайденнаяСтрока[0];
			КонецЕсли; 
			
			Для каждого СтрокаТаблицыРеквизитовТабличнойЧастиДокумента Из РеквизитыТабличнойЧастиСПометкой  Цикл  
				
				Если СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.ЗначениеПоУмолчанию <> Неопределено Тогда
					
					ТеущаяСтрокаПриемника[СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.ИмяРеквизитаПриемник] = СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.ЗначениеПоУмолчанию;	
					
				ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.Выражение) Тогда
					
					Выполнить(СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.Выражение );
					
				ИначеЕсли СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.ИмяРеквизитаИсточник <> "" Тогда       
					
					ТеущаяСтрокаПриемника[СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.ИмяРеквизитаПриемник] = ТеущаяСтрокаИсточника[СтрокаТаблицыРеквизитовТабличнойЧастиДокумента.ИмяРеквизитаИсточник];   
					
				КонецЕсли;  
				
			КонецЦикла;	    
			
		КонецЦикла;  
		
	КонецЕсли;   
	
	Если КодыМаркировки <> Неопределено Тогда 
		ЗаполнитьКодыМаркировки(Приемник, КодыМаркировки);
	КонецЕсли;

КонецПроцедуры


Процедура ЗаполнитьКодыМаркировки(Документ, КодыМаркировки)
	
	Если Документ.Метаданные().ТабличныеЧасти.Найти("ШтрихкодыУпаковок") = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("В документеприемнике нет таблицы «ШтрихкодыУпаковок»");
		Возврат;
	КонецЕсли;
	
	ШУ = Справочники.ШтрихкодыУпаковокТоваров;
	
	Для каждого СтрокаМаркировки Из КодыМаркировки Цикл
		
		Штрихкод = СтрокаМаркировки.Маркировка;
		ШтрихкодУпаковки = ШУ.ПолучитьПоЗначениюШтрихкода(Штрихкод);
		
		Если НЕ ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда  
			
			ДанныеНовойУпаковки = ШУ.СтруктураСозданияШтрихкодаУпаковки();
			ДанныеНовойУпаковки.Штрихкод = Штрихкод;
			ДанныеНовойУпаковки.Номенклатура = СтрокаМаркировки.Товар;
			ДанныеНовойУпаковки.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
			ДанныеНовойУпаковки.Серия = СтрокаМаркировки.Серия; 
			ДанныеНовойУпаковки.Количество = 1;
			ШтрихкодУпаковки = ШУ.СоздатьШтрихкодУпаковки(ДанныеНовойУпаковки);  
			
		КонецЕсли;	 
		
		НоваяСтрока = Документ.ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ШтрихкодУпаковки = ШтрихкодУпаковки;
		
	КонецЦикла;     	
	
КонецПроцедуры

Функция ПоискСтрокиВТабличнойЧастиПриемника(СтрокаИсточник, ТаблицаПриемник, СоответсвиеКолонокОтбора)   

	Отбор =  ПолучитьОтборПоСтроке(СтрокаИсточник, СоответсвиеКолонокОтбора);
	
	Возврат  ТаблицаПриемник.НайтиСтроки(Отбор);
		
КонецФункции   

Функция ПолучитьОтборПоСтроке(СтрокаИсточник, СоответсвиеКолонокОтбора)    
	
	Отбор = Новый Структура;
	
	Для каждого  Колонка Из СоответсвиеКолонокОтбора  Цикл	
		Отбор.Вставить(Колонка.Значение, СтрокаИсточник[Колонка.Ключ] );	
	КонецЦикла; 
	
	Возврат Отбор;
	
КонецФункции 

Функция ТоварыИзТСД(ДокументОснование, ВидОперации, ПринятыеТовары = Истина, ЗаполнитьКодыМаркировки = Ложь )
	ВходящийПараметры = Новый Структура;
	ВходящийПараметры.Вставить("ДокументОснование",ДокументОснование);
	ВходящийПараметры.Вставить("ВидОперации",ВидОперации);
	ВходящийПараметры.Вставить("ВключаяДокументыОпераций",Неопределено);
	ВходящийПараметры.Вставить("ПолучитьКодыМаркировки", ЗаполнитьКодыМаркировки);

	Если ПринятыеТовары  Тогда
		РезультатЗапроса = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру(ВходящийПараметры);
	Иначе
		РезультатЗапроса = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуОтобранныхТоваровЧерезСтруктуру(ВходящийПараметры);
	КонецЕсли;
	Возврат РезультатЗапроса;
КонецФункции

Функция ИмяТипаДокумента(Документ)
	Возврат Документ.Метадынные().Имя; 
КонецФункции 

Функция ПолучитьДоступныеПравилаДляРаспоряжения(Распоряжение = Неопределено) Экспорт	
	
	Если ЗначениеЗаполнено(Распоряжение) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	вмс_ПравилаКонвертацииРеквизитов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вмс_ПравилаКонвертацииРеквизитов КАК вмс_ПравилаКонвертацииРеквизитов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вмс_РаспоряженияОпераций КАК вмс_РаспоряженияОпераций
		|		ПО (вмс_ПравилаКонвертацииРеквизитов.ИмяИсточникаВКонфигураторе = вмс_РаспоряженияОпераций.РаспоряжениеКонфигуратор)
		|ГДЕ
		|	вмс_РаспоряженияОпераций.Ссылка В ( &Ссылка)";  
		Запрос.УстановитьПараметр("Ссылка", Распоряжение);
		
	Иначе  
		Запрос = Новый Запрос;
		Запрос.Текст  = "ВЫБРАТЬ
		|	вмс_ПравилаКонвертацииРеквизитов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вмс_ПравилаКонвертацииРеквизитов КАК вмс_ПравилаКонвертацииРеквизитов
		|ГДЕ
		|	вмс_ПравилаКонвертацииРеквизитов.ИмяИсточникаВКонфигураторе = """"";	
	КонецЕсли;
	
	МассивПравил = Новый Массив;
	
	Выбрать = Запрос.Выполнить().Выбрать();
	
	Пока Выбрать.Следующий()  Цикл
		МассивПравил.Добавить(Выбрать.Ссылка);	
	КонецЦикла;
	
	 Возврат МассивПравил;	
КонецФункции

Процедура СвернутьТаблицу (КолонокиГруппировки, КолонкиСуммирования, Таблица)
	
	РК =  вмс_РаботаСКоллекциями;    
			
	МассивКолонокКСворачиванию = РК.ВыгрузитьЗначенияКолонкиКоллекции(КолонокиГруппировки,"Ключ"); 

	РК.УдалитьДублиВМассиве(МассивКолонокКСворачиванию); 
	РК.УдалитьЭлементыКоллекции(МассивКолонокКСворачиванию, КолонкиСуммирования);	
	
	Таблица.Свернуть(РК.МассивВСтроку(МассивКолонокКСворачиванию) , РК.МассивВСтроку(КолонкиСуммирования));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
