Функция ПолучитьПараметрыАвторизации() Экспорт
	
	//Возврат ПараметрыСеанса.вмс_ПараметрыАвторизации.Получить();
	
КонецФункции

Функция УстановитьПараметрыАвторизации(ПараметрыАвторизации) Экспорт
	
	//ПараметрыСеанса.вмс_ПараметрыАвторизации = Новый ХранилищеЗначения(ПараметрыАвторизации);
	
	
КонецФункции

Функция НайтиПользователяПоШтрихкоду(Штрихкод) Экспорт
	
	ДанныеШтрихкода = вмс_ОбработкаШтрихкодовВызовСервера.ОбработатьШтрихкод(Штрихкод)["Оператор"];
	Если ДанныеШтрихкода = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ФизЛицо = ДанныеШтрихкода.Ссылка;
	
	//Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ФизическоеЛицо", ФизЛицо); 
	// Мовчан 20.03.23++
	Пользователь = Справочники.Пользователи.НайтиПоРеквизиту(вмс_АдаптацияКонфигураций.ИмяКолонкиФизЛицо(), ФизЛицо);
	// Мовчан 20.03.23--
	
	Результат = Новый Структура;      
	Результат.Вставить("ФизическоеЛицо", ФизЛицо);
	Результат.Вставить("Наименование", ФизЛицо.Наименование);
	Результат.Вставить("Пользователь", Пользователь);
	Результат.Вставить("Авторизован", Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПолноправныйПользователь(Пользователь = Неопределено) Экспорт
	
	Возврат Пользователи.ЭтоПолноправныйПользователь(Пользователь);	
	
КонецФункции

Функция ПолучитьНастройкиПользователя(знач ПараметрыАвторизации=Неопределено) Экспорт
	
	Если ПараметрыАвторизации = Неопределено Тогда
		ПараметрыАвторизации = ПолучитьПараметрыАвторизации();
	КонецЕсли;
	
	Если ПараметрыАвторизации <> Неопределено Тогда
		Возврат Справочники.вмс_НастройкиОператора.ПолучитьНастройкиФормыОператора(ПараметрыАвторизации.ФизическоеЛицо);
	КонецЕсли;
	
КонецФункции
//
Функция СохранитьВсеНастройкиПользователя(НастройкиПользователя, Знач ПараметрыАвторизации=Неопределено) Экспорт
	
	Если ПараметрыАвторизации = Неопределено Тогда
		ПараметрыАвторизации = ПолучитьПараметрыАвторизации();
	КонецЕсли;
	
	Если ПараметрыАвторизации <> Неопределено Тогда
		Справочники.вмс_НастройкиОператора.УстановитьНастройкиОператораФормы(НастройкиПользователя, ПараметрыАвторизации.ФизическоеЛицо);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНастройкуПользователя(ИмяНастройки, ПараметрыАвторизации=Неопределено) Экспорт
	НастройкиПользователя = ПолучитьНастройкиПользователя(ПараметрыАвторизации);
	Если вмс_РаботаСКоллекциями.ЭтоКвазиТаблицаЗначений(НастройкиПользователя) Тогда
		НайденныеСтроки = вмс_РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(НастройкиПользователя, Новый Структура("Настройка", ИмяНастройки));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат НайденныеСтроки[0].Значение;
		КонецЕсли; 
	КонецЕсли;
КонецФункции

Функция СохранитьНастройкуПользователя(ИмяНастройки, Значение, ПараметрыАвторизации=Неопределено) Экспорт
	
	Если ПараметрыАвторизации = Неопределено Тогда
		ПараметрыАвторизации = ПолучитьПараметрыАвторизации();
	КонецЕсли;
	
	НастройкиПользователя = ПолучитьНастройкиПользователя(ПараметрыАвторизации);
	Если Не вмс_РаботаСКоллекциями.ЭтоКвазиТаблицаЗначений(НастройкиПользователя) Тогда
		НастройкиПользователя = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений("Настройка, Значение");
	КонецЕсли;
	
	Отбор = Новый Структура("Настройка", ИмяНастройки);
	НайденныеСтроки = вмс_РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(НастройкиПользователя, Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтрокаНастройки = НайденныеСтроки[0];
	Иначе
		СтрокаНастройки = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(НастройкиПользователя);
		ЗаполнитьЗначенияСвойств(СтрокаНастройки, Отбор);
	КонецЕсли;
	
	СтрокаНастройки.Значение = Значение;
	
	СохранитьВсеНастройкиПользователя(НастройкиПользователя, ПараметрыАвторизации);
	
КонецФункции

Функция СоздатьПользователяДляОбмена() Экспорт
	//Кулалаев +
	УстановитьПривилегированныйРежим(Истина);
	
	Логин = "вмс_Obmen";
	Пароль = "!password"; 
	ПолноеИмя = "Обмен с системой WMS";
	ПользовательОбмена = Справочники.Пользователи.НайтиПоНаименованию(ПолноеИмя);
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Логин);
	
	Если ПользовательИБ = Неопределено Тогда
		Попытка
			ОписаниеПользователяИБ = НовоеОписаниеПользователяИБ();
			ОписаниеПользователяИБ.Имя = Логин;
			ОписаниеПользователяИБ.ПолноеИмя = НСтр("ru='Обмен с системой WMS'");
			ОписаниеПользователяИБ.АутентификацияСтандартная = Истина;
			ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = Ложь;
			ОписаниеПользователяИБ.Вставить("Действие", "Записать");
			ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", Истина);
			ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль = Истина;
			ОписаниеПользователяИБ.Пароль = Пароль;
			ОписаниеПользователяИБ.Роли = Новый Массив;
			ОписаниеПользователяИБ.Роли.Добавить("ПолныеПрава");
			ОписаниеПользователяИБ.Роли.Добавить("АдминистраторСистемы");
			ОписаниеПользователяИБ.Роли.Добавить("Администрирование");
			
			НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
			НовыйПользователь.Наименование = ОписаниеПользователяИБ.ПолноеИмя;
			НовыйПользователь.Служебный = Истина;
			НовыйПользователь.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
			НовыйПользователь.Заполнить(Неопределено);
			НовыйПользователь.Записать();
			
		Исключение
			
			МетаданныеОбъекта = Метаданные.Справочники.Пользователи;
			ТекстОшибки = НСтр("ru = 'Не удалось создать служебного пользователя по причине:'")
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеОбъекта,, ТекстОшибки);
			ТекстСообщения = НСтр("ru = 'При создании служебного пользователя для обмена с WMS произошла ошибка: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецПопытки
	КонецЕсли;
	// Кулалаев -
	
	// ТУ Самойленко 27.12.22 ++
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Логин);
	Если ПользовательИБ <> Неопределено Тогда
		ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		ПользовательИБ.Записать();		
	КонецЕсли;		
	// ТУ Самойленко 27.12.22 -- 
	
КонецФункции

// Возвращает пустую структуру описания пользователя ИБ.
// Назначение свойств структуры соответствует свойствам объекта ПользовательИнформационнойБазы.
//
// Возвращаемое значение:
//  Структура:
//   * УникальныйИдентификатор   - УникальныйИдентификатор - уникальный идентификатор пользователя информационной базы.
//   * Имя                       - Строка - имя пользователя информационной базы. Например, "Иванов".
//   * ПолноеИмя                 - Строка - полное имя пользователя информационной базы. 
//                                          Например, "Иванов Иван Иванович (менеджер по продажам)"
//   * АутентификацияOpenID      - Булево - разрешена ли пользователю аутентификация по протоколу OpenID.
//
//   * АутентификацияСтандартная - Булево - разрешена ли стандартная аутентификация (по пользователю и паролю).
//   * ПоказыватьВСпискеВыбора   - Булево - показывать ли полное имя пользователя в списке для выбора при запуске.
//   * Пароль                    - Строка
//                               - Неопределено - пароль, используемый при стандартной аутентификации.
//   * СохраняемоеЗначениеПароля - Строка
//                               - Неопределено - хранимые значения пароля (хеш).
//   * ПарольУстановлен          - Булево - установлен ли пароль у пользователя.
//   * ЗапрещеноИзменятьПароль   - Булево - определяет возможность пользователя изменять свой пароль.
//
//   * АутентификацияОС          - Булево - разрешена ли аутентификация средствами операционной системы.
//   * ПользовательОС            - Строка - имя соответствующей учетной записи пользователя операционной системы 
//                                          (не учитывается в учебной версии платформы).
//
//   * ОсновнойИнтерфейс         - Строка
//                               - Неопределено - имя основного интерфейса пользователя информационной базы
//                                         (из коллекции Метаданные.Интерфейсы).
//   * РежимЗапуска              - Строка
//                               - Неопределено - "Авто", "ОбычноеПриложение" или "УправляемоеПриложение".
//   * Язык                      - Строка
//                               - Неопределено - имя языка из коллекции Метаданные.Языки.
//   * Роли                      - Неопределено - роли не указаны.
//                               - Массив - коллекция имен ролей пользователя информационной базы.
//
Функция НовоеОписаниеПользователяИБ() Экспорт 
	
	//Кулалаев +
	
	// Подготовка структур возвращаемых данных.
	Свойства = Новый Структура;
	
	Свойства.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Свойства.Вставить("Имя",                       "");
	Свойства.Вставить("ПолноеИмя",                 "");
	Свойства.Вставить("АутентификацияOpenID",      Ложь);
	Свойства.Вставить("АутентификацияСтандартная", Ложь);
	Свойства.Вставить("ПоказыватьВСпискеВыбора",   Ложь);
	Свойства.Вставить("СтарыйПароль",              Неопределено);
	Свойства.Вставить("Пароль",                    Неопределено);
	Свойства.Вставить("СохраняемоеЗначениеПароля", Неопределено);
	Свойства.Вставить("ПарольУстановлен",          Ложь);
	Свойства.Вставить("ЗапрещеноИзменятьПароль",   Ложь);
	Свойства.Вставить("АутентификацияОС",          Ложь);
	Свойства.Вставить("ПользовательОС",            "");
	
	Свойства.Вставить("ОсновнойИнтерфейс",
	?(Метаданные.ОсновнойИнтерфейс = Неопределено, "", Метаданные.ОсновнойИнтерфейс.Имя));
	
	Свойства.Вставить("РежимЗапуска",              "Авто");
	
	Свойства.Вставить("Язык",
	?(Метаданные.ОсновнойЯзык = Неопределено, "", Метаданные.ОсновнойЯзык.Имя));
	
	Свойства.Вставить("Роли", Неопределено);
	
	Возврат Свойства;
	
	// Кулалаев -
	
КонецФункции
// Климентов++
Функция ПолучитьТаблицуПользователей() Экспорт 
	
	ТаблицаПользователей = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("Оператор, GUID, ХешПароля");
	
	Выборка = Справочники.вмс_НастройкиОператора.Выбрать();
	Пока Выборка.Следующий() Цикл 
		// ТУ_Кукушкин 06.05.25 ++ помеченные на удаление пользователи не должны приходить в список, иначе зачем их пометили 
		Если Выборка.ПометкаУдаления = Истина Тогда
			Продолжить;
		КонецЕсли;
		// ТУ_Кукушкин 06.05.25 --
		нСтрока = ТаблицаПользователей.Добавить();
		нСтрока.Оператор = Выборка.Оператор;
		нСтрока.GUID = Выборка.Оператор.УникальныйИдентификатор();
		нСтрока.ХешПароля = ХешПароля(Выборка.КодДоступа);		
	КонецЦикла; 
	
	Возврат ТаблицаПользователей;
	
КонецФункции
// Климентов--

// ТУ_Кошелев++
Функция ХешПароля(Пароль) Экспорт
	ХешПароля = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешПароля.Добавить(Пароль);
	Возврат ХешПароля.ХешСумма;
КонецФункции
// ТУ_Кошелев--

// ТУ_Самойленко 16.05.23 ++
Функция ПолучитьТаблицуПользователейСПравами() Экспорт
	
	Текст =
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка,
	|	Неопределено КАК GUID
	|ПОМЕСТИТЬ ТаблицаПользователей
	|ИЗ
	|	&СправочникФизическиеЛица КАК ФизическиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаПользователей.Ссылка) КАК Оператор,
	|	ТаблицаПользователей.Ссылка КАК ОператорДляГУИД,
	|	ТаблицаПользователей.GUID КАК GUID,
	|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(вмс_ГруппыРолейОператоровОператоры.Ссылка.РольОператоров), ""Пользователь"") КАК Роль
	|ИЗ
	|	ТаблицаПользователей КАК ТаблицаПользователей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вмс_ГруппыРолейОператоров.Операторы КАК вмс_ГруппыРолейОператоровОператоры
	|		ПО ТаблицаПользователей.Ссылка = вмс_ГруппыРолейОператоровОператоры.Оператор
	|";
	Текст = СтрЗаменить(Текст, "&СправочникФизическиеЛица", "Справочник." + вмс_АдаптацияКонфигураций.ИмяСправочникаФизЛица());
	
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из РезультатЗапроса Цикл
		Строка.GUID = Строка(Строка.ОператорДляГУИД.УникальныйИдентификатор());
	КонецЦикла; 
	РезультатЗапроса.Колонки.Удалить("ОператорДляГУИД");
	Возврат РезультатЗапроса;
	
КонецФункции
// ТУ_Самойленко 16.05.23 --

// ТУ_Мовчан 16.03.23++
Функция ПолучитьРезультатЗапросаПоФизЛицу(Оператор) Экспорт  
	
	// Перенесено из МП
	Текст =
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка,
	|	ФизическиеЛица.Наименование КАК Наименование,
	|	Пользователи.Ссылка КАК Пользователь,
	|	НастройкиОператора.Ссылка КАК НастройкаОператора,
	|	НастройкиОператора.ЯчейкаОтветственногоХранения КАК ЯчейкаОтветственногоХранения,
	|	НастройкиОператора.Разработчик КАК Разработчик,
	|	НастройкиОператора.ЗвуковаяСхема.Имя КАК ИмяЗвуковойСхемы
	|ИЗ
	|	&СправочникФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ФизическиеЛица.Ссылка = Пользователи.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вмс_НастройкиОператора КАК НастройкиОператора
	|		ПО ФизическиеЛица.Ссылка = НастройкиОператора.Оператор
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &Ссылка
	|	И ФизическиеЛица.ПометкаУдаления = ЛОЖЬ";
	
	Текст = СтрЗаменить(Текст, "&СправочникФизическиеЛица", "Справочник." + вмс_АдаптацияКонфигураций.ИмяСправочникаФизЛица());
	Текст = СтрЗаменить(Текст, "Пользователи.ФизическоеЛицо", "Пользователи." + вмс_АдаптацияКонфигураций.ИмяКолонкиФизЛицо());
	
	ЗапросПоФизЛицу = Новый Запрос;
	ЗапросПоФизЛицу.УстановитьПараметр("Ссылка", Оператор);
	ЗапросПоФизЛицу.Текст = Текст;
	
	РезультатЗапроса = ЗапросПоФизЛицу.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	
	ДобавитьДанныеЗвукаВходаОператора(ТаблицаРезультата);
	
	Возврат ТаблицаРезультата;
	
КонецФункции
// ТУ_Мовчан 16.03.23--

// ТУ_Мовчан 20.03.23++
Функция ПолучитьСсылкиНаКартинкиТоваров(ПараметрыЗапроса) Экспорт  
	
	// Перенесено из МП
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	ВЫБОР
	|		КОГДА Номенклатура.ФайлКартинки = ЗНАЧЕНИЕ(Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Номенклатура.ФайлКартинки
	|	КОНЕЦ КАК СсылкаНаКартинку
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&МассивТоваров)";	
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ФайлКартинки", вмс_АдаптацияКонфигураций.ИмяКолонкиФайлКартинки());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"НоменклатураПрисоединенныеФайлы", вмс_АдаптацияКонфигураций.ИмяСправочникаНоменклатураПрисоединенныеФайлы());
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивТоваров", ПараметрыЗапроса.МассивТоваров);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаРезультата;
	
КонецФункции
// ТУ_Мовчан 20.03.23--

// ТУ_Мовчан 07.06.23
Функция ПроверитьПраваНаВМС()  Экспорт
	Возврат РольДоступна("вмс_ОсновнаяРоль_ПолныеПрава") ИЛИ РольДоступна("ПолныеПрава") ИЛИ РольДоступна("вмс_ОсновнаяРоль_ИнтерактивноеНазначение");
КонецФункции 

// ТУ_Мовчан 11.01.24
Функция ЕстьРоль(ИмяРоли) Экспорт
	
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Для Каждого Роль Из Пользователь.Роли Цикл
		Если Роль.Имя = ИмяРоли Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;		
	
КонецФункции

// ТУ_Мовчан 04.07.23
Функция НайтиДругихПользователейВОперации(Операция, Распоряжение, Оператор) Экспорт      
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_АктивныеСеансы.Оператор КАК Оператор
	|ИЗ
	|	РегистрСведений.вмс_АктивныеСеансы КАК вмс_АктивныеСеансы
	|ГДЕ
	|	вмс_АктивныеСеансы.Операция = &Операция
	|	И вмс_АктивныеСеансы.Распоряжение = &Распоряжение
	|	И вмс_АктивныеСеансы.Оператор <> &Оператор"; 
	
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	Запрос.УстановитьПараметр("Оператор", Оператор);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат вмс_РаботаСКоллекциями.ВыгрузитьКоллекциюВМассивСтруктур(Результат);
КонецФункции         

// Климентов РаботаСАктивнымиСеансами  26.06
// ВидВзаимодействия (1 - Авторизация в приложении, 2 - Заход в операцию, 3 - Выход из операции, 4 - Гашение сеанса)
//
Функция ОбработатьЗаписьСеанса(СтруктураСеанса) Экспорт
	Если Не ЗначениеЗаполнено(СтруктураСеанса) Тогда
		Возврат Ложь;
	КонецЕсли;
	ВидВзаимодействия = 0;
	Если СтруктураСеанса.Свойство("ВидВзаимодействия") Тогда
		ВидВзаимодействия = СтруктураСеанса.ВидВзаимодействия;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	Если ВидВзаимодействия = 1 Тогда
		СтруктураСеанса.ВидВзаимодействия = Перечисления.вмс_ВидыВзаимодействияСТерминалом.Авторизован;
		РегистрыСведений.вмс_АктивныеСеансы.СоздатьНовуюЗапись(СтруктураСеанса);
	ИначеЕсли ВидВзаимодействия = 2 Тогда
		СтруктураСеанса.ВидВзаимодействия = Перечисления.вмс_ВидыВзаимодействияСТерминалом.ВОперации; 
		РегистрыСведений.вмс_АктивныеСеансы.ИзменитьСтатусСеансаПоСтруктуре(СтруктураСеанса);
	ИначеЕсли ВидВзаимодействия = 3 Тогда
		СтруктураСеанса.ВидВзаимодействия = Перечисления.вмс_ВидыВзаимодействияСТерминалом.Авторизован;
		РегистрыСведений.вмс_АктивныеСеансы.ИзменитьСтатусСеансаПоСтруктуре(СтруктураСеанса);
	ИначеЕсли ВидВзаимодействия = 4 Тогда
		СтруктураСеанса.ВидВзаимодействия = Перечисления.вмс_ВидыВзаимодействияСТерминалом.Авторизован;
		РегистрыСведений.вмс_АктивныеСеансы.ЗакончитьАктивныйСеансОператора(СтруктураСеанса.Оператор);
	КонецЕсли;
	Возврат Истина;
КонецФункции 

Функция ПроверитьАктивностьОператора(СтруктураДанных) Экспорт
	Если Не ЗначениеЗаполнено(СтруктураДанных) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат РегистрыСведений.вмс_АктивныеСеансы.ПолучитьАктивностьСеансаПоОператору(СтруктураДанных);
КонецФункции
// Климентов РаботаСАктивнымиСеансами  26.06

Функция АвторизоватьсяПоПользователюОС(Логин) Экспорт
	
	ОшибкиАвторизации = Новый Массив;
	
	РезультатАвторизации = Новый Структура;
	РезультатАвторизации.Вставить("ИмяПользователя");
	РезультатАвторизации.Вставить("СсылкаПользователя");
	РезультатАвторизации.Вставить("ФизическоеЛицо");
	РезультатАвторизации.Вставить("Успешно", Ложь);
	РезультатАвторизации.Вставить("ОшибкиАвторизации", ОшибкиАвторизации);
	
	ПользовательИБ = НайтиПользователяИБПоЛогинуОС(Логин);
	Если ПользовательИБ = Неопределено Тогда
		ОшибкиАвторизации.Добавить("Неверный логин!");
		Возврат РезультатАвторизации;
	КонецЕсли;
	
	РезультатАвторизации.ИмяПользователя = ПользовательИБ.Имя;
	
	СсылкаПользователя = НайтиСсылкуПользователяПоПользователюИБ(ПользовательИБ);
	Если СсылкаПользователя = Неопределено Тогда
		ОшибкиАвторизации.Добавить("Пользователь 1С не найден!");
		Возврат РезультатАвторизации;
	КонецЕсли;
	
	РезультатАвторизации.СсылкаПользователя = СсылкаПользователя;
	
	ВариантыРеквизитаФизическоеЛицо = Новый Массив;
	ВариантыРеквизитаФизическоеЛицо.Добавить("ФизическоеЛицо");
	ВариантыРеквизитаФизическоеЛицо.Добавить("ФизЛицо");
	РеквизитыПользователя = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначенияРеквизитовОбъекта(СсылкаПользователя, ВариантыРеквизитаФизическоеЛицо);
	Для Каждого ВариантРеквизитаФизическоеЛицо Из ВариантыРеквизитаФизическоеЛицо Цикл
		ФизическоеЛицо = РеквизитыПользователя[ВариантРеквизитаФизическоеЛицо];
		Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ОшибкиАвторизации.Добавить("Физическое лицо не заполнено!");
		Возврат РезультатАвторизации;
	КонецЕсли;
	
	РезультатАвторизации.ФизическоеЛицо = ФизическоеЛицо;
	РезультатАвторизации.Успешно = Истина;
	Возврат РезультатАвторизации;
	
КонецФункции

Функция НайтиСсылкуПользователяПоПользователюИБ(ПользовательИБ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция НайтиПользователяИБПоЛогинуОС(ЛогинОС) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СписокПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВариантыНаписанияЛогина = Новый Массив;
	ВариантыНаписанияЛогина.Добавить(НРег(ЛогинОС));
	Если Лев(ЛогинОС, 2) <> "\\" Тогда
		ВариантыНаписанияЛогина.Добавить("\\" + НРег(ЛогинОС));
	КонецЕсли;
	
	Для Каждого ПользовательИБ Из СписокПользователейИБ Цикл
		
		Если Не ПользовательИБ.АутентификацияОС Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВариантыНаписанияЛогина.Найти(НРег(ПользовательИБ.ПользовательОС)) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат ПользовательИБ;
		
	КонецЦикла;
	
КонецФункции

Функция ВыгрузитьНастройкиОператора(Оператор) Экспорт

	РК = вмс_РаботаСКоллекциями;

	ТаблицаНастроекОператора = ПолучитьТаблицуНастроекОператоров(Оператор);
	
	Операции = ПолучитьОперацииОператора(Оператор);
	
	Помещения = ПолучитьПомещенияОператора(Оператор);
	
	МассивОбъектов = Новый Массив;
	РК.ДобавитьЭлементыКоллекции(МассивОбъектов, ТаблицаНастроекОператора.ВыгрузитьКолонку("Настройка"));
	РК.ДобавитьЭлементыКоллекции(МассивОбъектов, Операции);
	РК.ДобавитьЭлементыКоллекции(МассивОбъектов, Помещения);
	РК.ДобавитьЭлементыКоллекции(МассивОбъектов, вмс_УправлениеСвойствамиВызовСервера.ПолучитьСсылкиОбъектовДополнительныхРеквизитов());
	
    ТекстXML = вмс_Обмен_с_КИС_Сервер.ВыгрузитьОбъектыПоСсылкамВXML(МассивОбъектов);
	
	Возврат ТекстXML;
	
КонецФункции

Функция ПолучитьНастройкиОператора(Оператор) Экспорт

	ТаблицаНастроекОператоров = ПолучитьТаблицуНастроекОператоров(Оператор);

	НастройкиОператора = ТаблицаНастроекОператоров.ВыгрузитьКолонку("Настройка");

	Возврат НастройкиОператора;
	
КонецФункции

Функция ПолучитьОперацииОператора(Оператор) Экспорт
	
	ТаблицаОпераций = ПолучитьТаблицуОперацийОператора(Оператор);
	
	Операции = ТаблицаОпераций.ВыгрузитьКолонку("Операция");
	
	Возврат Операции;
	
КонецФункции

Функция ПолучитьПомещенияОператора(Оператор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_НастройкиОператораПомещения.Помещение КАК Помещение
	|ИЗ
	|	Справочник.вмс_НастройкиОператора КАК вмс_НастройкиОператора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_НастройкиОператора.Помещения КАК вмс_НастройкиОператораПомещения
	|		ПО вмс_НастройкиОператора.Ссылка = вмс_НастройкиОператораПомещения.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_Помещения КАК вмс_Помещения
	|		ПО (вмс_НастройкиОператораПомещения.Помещение = вмс_Помещения.Ссылка)
	|ГДЕ
	|	вмс_НастройкиОператора.Оператор = &Оператор
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_НастройкиОператораПомещения.Помещение";
	Запрос.УстановитьПараметр("Оператор", Оператор);
	Помещения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Помещение");
	
	Возврат Помещения;
	
КонецФункции

Функция ПолучитьТаблицуНастроекОператоров(Операторы) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_НастройкиОператора.Ссылка КАК Настройка,
	|	вмс_НастройкиОператора.ЗвуковаяСхема КАК ЗвуковаяСхема,
	|	вмс_НастройкиОператора.Оператор КАК Оператор
	|ИЗ
	|	Справочник.вмс_НастройкиОператора КАК вмс_НастройкиОператора
	|ГДЕ
	|	вмс_НастройкиОператора.Оператор В(&Операторы)
	|	И НЕ вмс_НастройкиОператора.ПометкаУдаления";
	Запрос.УстановитьПараметр("Операторы", Операторы);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаНастроекОператоров = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаНастроекОператоров;
	
КонецФункции

Функция ПолучитьТаблицуОперацийОператора(Оператор) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вмс_НастройкиОператораОперации.Операция КАК Операция
	|ИЗ
	|	Справочник.вмс_НастройкиОператора.Операции КАК вмс_НастройкиОператораОперации
	|ГДЕ
	|	вмс_НастройкиОператораОперации.Ссылка.Оператор = &Оператор
	|	И НЕ вмс_НастройкиОператораОперации.Ссылка.ПометкаУдаления
	|	И вмс_НастройкиОператораОперации.Операция <> ЗНАЧЕНИЕ(Справочник.вмс_Операции.ПустаяСсылка)
	|	И НЕ вмс_НастройкиОператораОперации.Операция.ПометкаУдаления";
	Запрос.УстановитьПараметр("Оператор", Оператор);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаОпераций = РезультатЗапроса.Выгрузить();
	ТаблицаОпераций.Колонки.Добавить("МастерОперация");
	
	МастерОперации = ТаблицаОпераций.ВыгрузитьКолонку("Операция");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_Операции.Ссылка КАК Операция,
	|	вмс_Операции.Родитель КАК МастерОперация
	|ИЗ
	|	Справочник.вмс_Операции КАК вмс_Операции
	|ГДЕ
	|	НЕ вмс_Операции.ПометкаУдаления
	|	И вмс_Операции.Родитель В(&МастерОперации)";
	
	Пока МастерОперации.Количество() > 0 Цикл
		Запрос.УстановитьПараметр("МастерОперации", МастерОперации);
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаПодчиненныхОпераций = РезультатЗапроса.Выгрузить();
		РК.ДобавитьЭлементыКоллекции(ТаблицаОпераций, ТаблицаПодчиненныхОпераций);
		МастерОперации = РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаПодчиненныхОпераций, "Операция");
	КонецЦикла;
	
	Возврат ТаблицаОпераций;
	
КонецФункции

// ТУ_Самойленко 01.09.23 ++
Функция ПолучитьКоличествоРаспоряженийОпераций(ПараметрыФункции) Экспорт
	
	Операции = Справочники.вмс_НастройкиОператора.ПолучитьМассивОперацийОператора(ПараметрыФункции.Оператор, Новый Структура("ПоРаспоряжению", Истина));
	
	Возврат ПолучитьСоответствиеКоличестваРаспоряженийОпераций(Операции, ПараметрыФункции);
	
КонецФункции

Функция ПолучитьСоответствиеКоличестваРаспоряженийОпераций(МассивОпераций, ПараметрыФункции)
		
	Результат = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("Операция, КоличествоРаспоряжений");
	
	ПараметрыФункции.Вставить("Операция");
	
	Для Каждого Операция Из МассивОпераций Цикл
		ПараметрыФункции.Операция = Операция;
		КоличествоРаспоряжений = Справочники.вмс_Операции.ПолучитьКоличествоДокументовПоОперации(ПараметрыФункции);
		
		нСтрока = Результат.Добавить();
		нСтрока.Операция = Операция;
		нСтрока.КоличествоРаспоряжений = КоличествоРаспоряжений;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
// ТУ_Самойленко 01.09.23 --

// ТУ_Алфимов 11.11.25 ++

Функция ПроверитьАвторизованЛиПользовательСегодня(Пользователь, ИдентификаторКлиента) Экспорт
	
	ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	
	// Установка значений параметров
	Запрос.УстановитьПараметр("Оператор", Пользователь);
	Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_АктивныеСеансы.Оператор КАК Оператор,
	|	вмс_АктивныеСеансы.УникальныйИдентификаторБазы КАК УникальныйИдентификаторБазы
	|ИЗ
	|	РегистрСведений.вмс_АктивныеСеансы КАК вмс_АктивныеСеансы
	|ГДЕ
	|	вмс_АктивныеСеансы.ДатаВремя МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И вмс_АктивныеСеансы.Оператор = &Оператор";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Если ИдентификаторКлиента = Результат[0].УникальныйИдентификаторБазы Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции


// ТУ_Алфимов 11.11.25 --

Функция ДобавитьДанныеЗвукаВходаОператора(ТаблицаРезультатаЗапросаПоФизЛицу)
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаРезультатаЗапросаПоФизЛицу.Колонки.Добавить("ДанныеЗвукаВхода");
	
	Для Каждого ЭлементРезультатаЗапросаПоФизЛицу Из ТаблицаРезультатаЗапросаПоФизЛицу Цикл
		ИмяЗвуковойСхемы = ЭлементРезультатаЗапросаПоФизЛицу.ИмяЗвуковойСхемы;
		Если НЕ ЗначениеЗаполнено(ИмяЗвуковойСхемы) Тогда
			ЭлементРезультатаЗапросаПоФизЛицу.ДанныеЗвукаВхода = Неопределено;
			Продолжить;
		КонецЕсли;
		
		Звук = вмс_РаботаСоЗвуком.ПолучитьЗвук(, ИмяЗвуковойСхемы + "\Вход");
		Если Звук.Данные <> Неопределено Тогда
			ЭлементРезультатаЗапросаПоФизЛицу.ДанныеЗвукаВхода = Звук.Данные;
		Иначе
			ТекстПриветствия = "Приветствую вас, " + ЭлементРезультатаЗапросаПоФизЛицу.Наименование;
			ЭлементРезультатаЗапросаПоФизЛицу.ДанныеЗвукаВхода = вмс_РаботаСоЗвуком.ПолучитьДвоичныеДанныеРечи(ТекстПриветствия);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

