&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КомпонентаКрасная = Цвет.Красный;
	КомпонентаЗеленая = Цвет.Зеленый;
	КомпонентаСиняя = Цвет.Синий;
	
	ОбновитьЦвет();
	
КонецПроцедуры

&НаКлиенте
Функция ОбновитьЦвет()
	
	Цвет = Новый Цвет(КомпонентаКрасная, КомпонентаЗеленая, КомпонентаСиняя);
	
	Элементы.ПримерЦветаФона.ЦветФона = Цвет;
	Элементы.ПримерЦветаТекста.ЦветТекста = Цвет;
	
КонецФункции

&НаКлиенте
Процедура Готово(Команда)
	
	Закрыть(Цвет);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпонентаЦветаПриИзменении(Элемент)
	ОбновитьЦвет();
КонецПроцедуры
