
Функция ЗаполнитьСКДРеквизитовЗадания(знач АдресСКД) Экспорт
	СКДРеквизитовЗадания = вмс_НастройкиПолейЗаданияСервер1.СКДРеквизитовЗадания();
	ПоместитьВоВременноеХранилище(СКДРеквизитовЗадания, АдресСКД);
КонецФункции

//
// Описание - Возвращает типы, которые могут храниться в базе без необходимости сериализации
//
Функция ТипыЗначенийСвойствЭлементовИБ() Экспорт
	
	Возврат Метаданные.Справочники.вмс_НастройкиПолейЗадания.ТабличныеЧасти.ЭлементыВывода.Реквизиты.Значение.Тип;
	
КонецФункции

Функция СписокТиповСборщиков() Экспорт
	
	СписокТиповСборщиков = Новый СписокЗначений;
	
	Для Каждого Обработка Из Метаданные.Обработки Цикл
		
		Если СтрНайти(Обработка.Имя, "вмс_СерверУправляемыйМодульСборщикДанных")=0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Обработка.Реквизиты.Найти("Интерфейс")=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТипСборщика = СтрЗаменить(Обработка.Имя, "вмс_СерверУправляемыйМодуль", "");
		СписокТиповСборщиков.Добавить(ТипСборщика, Обработка.Синоним);
		
	КонецЦикла;
	
	Возврат СписокТиповСборщиков;
	
КонецФункции

Функция ПолучитьЗначенияЗаполненияСвойствПоляДанныхПоУмолчанию(Имя) Экспорт
	
	ЗначенияЗаполненияСвойствМассив = вмс_СерверУправляемыеОперацииПовтИсп.ТаблицаЗначенийСвойствПолейОперацииПоУмолчанию().НайтиСтроки(Новый Структура("Имя", Имя));
	Если ЗначенияЗаполненияСвойствМассив.Количество()=0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗначенияЗаполненияСвойств = ЗначенияЗаполненияСвойствМассив[0];
	
	ЗначенияЗаполненияСвойствВозврат = вмс_РаботаСКоллекциями.СтрокуТаблицыЗначенийВСтруктуру(ЗначенияЗаполненияСвойств);
	Возврат ЗначенияЗаполненияСвойствВозврат;
	
КонецФункции