
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Ссылка", Ссылка);
	Параметры.Свойство("СсылкаДляКопирования", СсылкаДляКопирования);
	Параметры.Свойство("GTINДляЗаполнения", GTINДляЗаполнения);
	
	ЗаполнитьКонтекстФормы();
	УстановитьЗаголовок();
	УстановитьТипыЭлементов();
	НастроитьВидимостьКоманд();
	НастроитьВидимостьДопКолонокРД();
	УстановитьУсловноеОформление();
	НастроитьЭлементыФормы82();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МодульКлиента();
	
	ЗаполнитьКонтекстИзСервиса();
	ЗаполнитьСпискиВыбора();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ВидыПродукции = Перечисления.КонтурМаркировка_ВидыПродукции;
	
	Если ЗаполнениеИзНацКаталога Тогда
		ПроверяемыеРеквизиты.Очистить();
		ПроверяемыеРеквизиты.Добавить("GTIN");
		Возврат;
	КонецЕсли;
	
	Если ЭтоКег И ВидПродукции = ВидыПродукции.Пиво Тогда
		ПроверяемыеРеквизиты.Добавить("НоминальноеКоличество");
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидПродукцииПриИзменении(Элемент)
	
	ОбновитьПослеИзмененияВидаПродукции();
	
КонецПроцедуры

&НаКлиенте
Процедура GTINПриИзменении(Элемент)
	
	МодульКлиента().НормализоватьGTIN(GTIN);
	
КонецПроцедуры

&НаКлиенте
Процедура КодТНВЭДПриИзменении(Элемент)
	
	КодТНВЭД = СтрЗаменить(КодТНВЭД, " ", "");
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКодаМаркировкиПриИзменении(Элемент)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоКегПриИзменении(Элемент)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НомераСкважинНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Обработчик = МодульКлиента().ОписаниеОбработчикаОповещения("НомераСкважинПослеВыбора", ЭтаФорма, Элемент);
	
	КонтекстФормы = МодульКлиента().Новый_ПараметрыФормыРедактированияСписка();
	
	КонтекстФормы.РазрешитьРедактирование = Истина;
	КонтекстФормы.Заголовок               = НСтр("ru = 'Номера скважин'");
	КонтекстФормы.Список                  = МодульКлиента().РазделитьСтроку(Элемент.ТекстРедактирования, ",");
	
	МодульКлиента().ОткрытьФормуПросмотраСписка(ЭтаФорма, КонтекстФормы, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура НомераСкважинПриИзменении(Элемент)
	
	МодульКлиента().НормализоватьНомераСкважин(НомераСкважин);
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешительнаяДокументацияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	РазрешительныйДокумент = Неопределено;
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		РазрешительныйДокумент = Элемент.ТекущиеДанные.РазрешительныйДокумент;
	КонецЕсли;
	
	ПослеВыбора = МодульКлиента().ОписаниеОбработчикаОповещения("ДобавитьРазрешительныйДокументПослеВыбора", ЭтаФорма);
	МодульКлиента().ОткрытьФормуВыбораРазрешительногоДокумента(РазрешительныйДокумент, ЭтаФорма, ПослеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешительнаяДокументацияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуРазрешительногоДокумента(ТекущиеДанные.РазрешительныйДокумент, ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	ПровестиОпросПользователяИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТоварыВСО(Команда)
	
	Попытка
		ОбщийМодульВСО = МодульКлиента().ОбщийМодуль("ВзаимодействиеКонтурМаркировкаВСОКлиент");
	Исключение
		МодульКлиента().СообщитьПользователюЛок(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ОбщийМодульВСО.ОткрытьФормуСпискаТоваров(Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТоварВСО(Команда)
	
	АналитикаНоменклатуры = Новый Структура("Номенклатура, Характеристика, Упаковка");
	
	ТекущиеДанные = Элементы.СвязиНоменклатуры.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(АналитикаНоменклатуры, ТекущиеДанные);
	КонецЕсли;
	
	Попытка
		ОбщийМодульВСО = МодульКлиента().ОбщийМодуль("ВзаимодействиеКонтурМаркировкаВСОКлиент");
	Исключение
		МодульКлиента().СообщитьПользователюЛок(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ОбщийМодульВСО.ОткрытьФормуТовара(Ссылка, АналитикаНоменклатуры, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеИзНациональногоКаталога(Команда)
	
	Если Не ПроверитьЗаполнениеПолейПриЗаполненииИзНацКаталога() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКонтекстИзСервисаПоGTIN();
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьОсновнымРазрешительнымДокументом(Команда)
	
	ТекущиеДанные = Элементы.РазрешительнаяДокументация.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеОсновной = Не ТекущиеДанные.Основной;
	
	Если ЗначениеОсновной Тогда
		Для Каждого Стр Из РазрешительнаяДокументация.НайтиСтроки(Новый Структура("Основной", Истина)) Цикл
			Если Стр <> ТекущиеДанные Тогда
				Стр.Основной = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекущиеДанные.Основной = ЗначениеОсновной;
	
	Модифицированность = Истина;
	
КонецПроцедуры

// #КонецОбласти

// #Область ПроверкаЗаполнения

&НаКлиенте
Функция ПроверитьЗаполнениеПолей()
	
	ОчиститьСообщения();
	
	Возврат ПроверитьЗаполнениеПолейНаСервере();
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеПолейНаСервере()
	
	ЕстьОшибки = Не ПроверитьЗаполнение();
	
	ПроверитьGTIN(ЕстьОшибки);
	ПроверитьТНВЭД(ЕстьОшибки);
	ПроверитьКИГУ(ЕстьОшибки);
	ПроверитьСоставНабора(ЕстьОшибки);
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеПолейПриЗаполненииИзНацКаталога()
	
	ОчиститьСообщения();
	
	Возврат ПроверитьЗаполнениеПолейПриЗаполненииИзНацКаталогаНаСервере();
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеПолейПриЗаполненииИзНацКаталогаНаСервере()
	
	ЗаполнениеИзНацКаталога = Истина;
	
	ЕстьОшибки = Не ПроверитьЗаполнение();
	
	ЗаполнениеИзНацКаталога = Ложь;
	
	ПроверитьGTIN(ЕстьОшибки);
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура ПроверитьGTIN(ЕстьОшибки)
	
	Если Не ЗначениеЗаполнено(GTIN) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизит = "GTIN";
	
	Если СтрДлина(GTIN) <> 14 Тогда
		ТекстОшибки = НСтр("ru = 'GTIN должен содержать 14 символов'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, Реквизит);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не МодульОбъекта().ВСтрокеТолькоЦифры(GTIN) Тогда
		ТекстОшибки = НСтр("ru = 'GTIN должен содержать только цифры'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, Реквизит);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьТНВЭД(ЕстьОшибки)
	
	Если Не ЗначениеЗаполнено(КодТНВЭД) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизит = "КодТНВЭД";
	
	Если СтрДлина(СокрЛП(КодТНВЭД)) <> 10 Тогда
		ТекстСообщения = НСтр("ru = 'В коде ТН ВЭД должно быть 10 символов'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, Реквизит);
		ЕстьОшибки = Ложь;
	КонецЕсли;
	
	Если Не МодульОбъекта().ВСтрокеТолькоЦифры(КодТНВЭД) Тогда
		ТекстСообщения = НСтр("ru = 'В коде ТН ВЭД должны быть только цифры'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, Реквизит);
		ЕстьОшибки = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКИГУ(ЕстьОшибки)
	
	Если ТипКодаМаркировки <> МодульОбъекта().Перечисление_ТипыКодовМаркировки().ГрупповаяУпаковка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВложенныйТовар) Тогда
		ТекстСообщения = НСтр("ru = 'Для групповой упаковки необходимо указать вложенный товар'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, "ВложенныйТовар");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоличествоВложений) Тогда
		ТекстСообщения = НСтр("ru = 'Для групповой упаковки необходимо указать количество вложений'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, "КоличествоВложений");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоставНабора(ЕстьОшибки)
	
	Если ТипКодаМаркировки <> МодульОбъекта().Перечисление_ТипыКодовМаркировки().Набор Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Стр Из СоставНабора Цикл
		
		Если Не ЗначениеЗаполнено(Стр.ВложенныйТовар) Тогда
			ТекстОшибки = НСтр("ru = 'Не указан товар набора'");
			МодульОбъекта().СообщитьОбОшибкеВСтрокеТабЧасти(
			ТекстОшибки, УникальныйИдентификатор, Элементы.СоставНабора, "ВложенныйТовар", СоставНабора.Индекс(Стр));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.КоличествоВложений) И Не ВидПродукцииДопускаетВариативныеНаборы Тогда
			ТекстОшибки = НСтр("ru = 'Не указано количество товара'");
			МодульОбъекта().СообщитьОбОшибкеВСтрокеТабЧасти(
			ТекстОшибки, УникальныйИдентификатор, Элементы.СоставНабора, "КоличествоВложений", СоставНабора.Индекс(Стр));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОпросыПользователей

&НаКлиенте
Процедура ПровестиОпросПользователяИЗакрыть()
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.Товары);
	
	Если ЗначениеЗаполнено(ОписаниеОпроса)
		И МодульКлиента().ОпросПодходитПоВидуПродукции(ОписаниеОпроса, ВидПродукции) Тогда
		ОписаниеОбработчика = МодульКлиента().ОписаниеОбработчикаОповещения("ПослеОпросаПользователя", ЭтаФорма);
		МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма, ОписаниеОбработчика);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОпросаПользователя(РезультатВыбора, ДопПараметры = Неопределено) Экспорт
	
	Закрыть();
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Записать()
	
	ЗаписатьНаСервере();
	
	Оповестить("КонтурМаркировка_Товар_Изменен", Ссылка);
	
	ОповеститьОбИзменении(Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ТаблицаНоменклатуры = МодульОбъекта().Новый_ТаблицаНоменклатуры();
	Если ЗначениеЗаполнено(СвязиНоменклатуры) Тогда
		Для каждого Стр Из СвязиНоменклатуры Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаНоменклатуры.Добавить(), Стр);
		КонецЦикла;
	Иначе
		ТаблицаНоменклатуры.Добавить();
	КонецЕсли;
	
	НачатьТранзакцию(МодульОбъекта().РежимУправленияБлокировкой());
	Попытка
		Ссылка = МодульОбъекта().Товар_Записать(ОписаниеПоКонтекстуФормы());
		ТаблицаНоменклатуры.ЗаполнитьЗначения(Ссылка, "Товар");
		МодульОбъекта().СвязиНоменклатуры_Записать(ТаблицаНоменклатуры);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение;
	КонецПопытки;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СтрокаЗаголовка = СокрЛП(Ссылка);
	ИначеЕсли ЗначениеЗаполнено(СсылкаДляКопирования) Тогда
		СтрокаЗаголовка = НСтр("ru = 'Копирование'");
	Иначе
		СтрокаЗаголовка = НСтр("ru = 'Создание'");
	КонецЕсли;
	
	Заголовок = МодульОбъекта().ПараметрыВСтроку(НСтр(
	"ru = 'Товар: %1'"), СтрокаЗаголовка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокРазрешенОСУ()
	
	Если МодульОбъекта().ВидПродукцииПоддерживаетПартионныйУчет(ВидПродукции) Тогда
		Элементы.РазрешенОСУ.Заголовок = НСтр("ru = 'Возможен объемно-сортовой или партионный учет'");
	Иначе
		Элементы.РазрешенОСУ.Заголовок = НСтр("ru = 'Возможен объемно-сортовой учет'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеПоКонтекстуФормы()
	
	Результат = МодульОбъекта().Новый_Товар();
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма, , "СоставНабора, УсловияХранения, РазрешительнаяДокументация");
	ЗаполнитьЗначенияСвойств(Результат.ДопРеквизиты, ЭтаФорма);
	
	Если ТипКодаМаркировки = Перечисления.КонтурМаркировка_ТипыКодовМаркировки.Набор Тогда
		Для каждого Стр Из СоставНабора Цикл
			НоваяСтрока = МодульОбъекта().Новый_Товар_СтрокаНабора();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			Результат.СоставНабора.Добавить(НоваяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Стр Из РазрешительнаяДокументация Цикл
		НоваяСтрока = МодульОбъекта().Новый_Товар_СтрокаРазрешительнаяДокументация();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		Результат.РазрешительнаяДокументация.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Для каждого Стр Из УсловияХранения Цикл
		НоваяСтрока = МодульОбъекта().Новый_Товар_СтрокаУсловияХранения();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		Результат.УсловияХранения.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКонтекстФормы(ОписаниеТовара = Неопределено)
	
	Если ОписаниеТовара = Неопределено Тогда
		
		Если ЗначениеЗаполнено(GTINДляЗаполнения) Тогда
			Ссылка = МодульОбъекта().Товар_Найти(GTINДляЗаполнения);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ОписаниеТовара = МодульОбъекта().Товар_Прочитать(Ссылка);
		ИначеЕсли ЗначениеЗаполнено(СсылкаДляКопирования) Тогда
			ОписаниеТовара = МодульОбъекта().Товар_Прочитать(СсылкаДляКопирования);
			ОписаниеТовара.Ссылка = Неопределено;
		Иначе
			ОписаниеТовара = МодульОбъекта().Новый_Товар();
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеТовара, , "СоставНабора, УсловияХранения, РазрешительнаяДокументация");
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеТовара.ДопРеквизиты);
	
	СоставНабора.Очистить();
	Если ОписаниеТовара.ТипКодаМаркировки = Перечисления.КонтурМаркировка_ТипыКодовМаркировки.Набор Тогда
		Для каждого Стр Из ОписаниеТовара.СоставНабора Цикл
			ЗаполнитьЗначенияСвойств(СоставНабора.Добавить(), Стр);
		КонецЦикла;
	КонецЕсли;
	
	РазрешительнаяДокументация.Очистить();
	Для Каждого Стр Из ОписаниеТовара.РазрешительнаяДокументация Цикл
		ЗаполнитьЗначенияСвойств(РазрешительнаяДокументация.Добавить(), Стр);
	КонецЦикла;
	
	УсловияХранения.Очистить();
	Для каждого Стр Из ОписаниеТовара.УсловияХранения Цикл
		НоваяСтрока = УсловияХранения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	СвязиНоменклатуры.Очистить();
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Для каждого Стр Из МодульОбъекта().СвязиНоменклатуры_Прочитать(Ссылка) Цикл
			ЗаполнитьЗначенияСвойств(СвязиНоменклатуры.Добавить(), Стр);
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПеременнаяХарактеристика) Тогда
		ПредставлениеПеременнойХарактеристики = МодульОбъекта().ПредставлениеПеременнойХарактеристики(ПеременнаяХарактеристика);
	КонецЕсли;
	
	ОбновитьПризнакРазрешенОСУ();
	УстановитьЗаголовокРазрешенОСУ();
	ОбновитьПризнакВидПродукцииДопускаетВариативныеНаборы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПослеИзмененияВидаПродукции()
	
	ПодлежитВетеринарномуКонтролю = МодульОбъекта().ВидПродукцииПоддерживаетВСД(ВидПродукции);
	
	ОбновитьПризнакРазрешенОСУ();
	УстановитьЗаголовокРазрешенОСУ();
	ОбновитьПризнакВидПродукцииДопускаетВариативныеНаборы();
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтекстИзСервиса()
	
	Если Не ЗначениеЗаполнено(GTINДляЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	GTIN = GTINДляЗаполнения;
	
	Если Не ПроверитьЗаполнениеПолейПриЗаполненииИзНацКаталога() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКонтекстИзСервисаПоGTIN();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтекстИзСервисаПоGTIN()
	
	ОписаниеТовара = ОписаниеПоКонтекстуФормы();
	
	ЕстьИзменения = МодульКлиента().ЗаполнитьОписаниеТовараДаннымиСервиса(ОписаниеТовара, УникальныйИдентификатор);
	Если Не ЕстьИзменения Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКонтекстФормы(ОписаниеТовара);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыЭлементов()
	
	ТипыОбъектов = МодульОбъекта().ТипыОбъектовИС();
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.СвязиНоменклатурыНоменклатура, ТипыОбъектов.Номенклатура);
	
	Если ЗначениеЗаполнено(ТипыОбъектов.Характеристика) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.СвязиНоменклатурыХарактеристика, ТипыОбъектов.Характеристика);
		УстановитьСвязьХаракетристикиСНоменклатурой(Элементы.СвязиНоменклатурыХарактеристика);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипыОбъектов.Упаковка) Тогда
		МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.СвязиНоменклатурыУпаковка, ТипыОбъектов.Упаковка);
		УстановитьСвязьУпаковкиСНоменклатурой(Элементы.СвязиНоменклатурыУпаковка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	СписокВыбора = Элементы.ВидПродукции.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ВсеВидыПродукции();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
	СписокВыбора = Элементы.ТипСрокаГодности.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ДопустимыеТипыСроковГодности(ВидПродукции);
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
	СписокВыбора = Элементы.ЕдиницаИзмеренияСрокаГодности.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ЕдиницыИзмеренияСрокаГодности();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязьУпаковкиСНоменклатурой(Элемент)
	
	ПутьКДанным = "Элементы.СвязиНоменклатуры.ТекущиеДанные.Номенклатура";
	СвязиПараметров = Новый Массив;
	СвязиПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", ПутьКДанным));
	СвязиПараметров.Добавить(Новый СвязьПараметраВыбора("Номенклатура", ПутьКДанным));
	Элемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметров);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязьХаракетристикиСНоменклатурой(Элемент)
	
	ПутьКДанным = "Элементы.СвязиНоменклатуры.ТекущиеДанные.Номенклатура";
	СвязиПараметров = Новый Массив;
	СвязиПараметров.Добавить(Новый СвязьПараметраВыбора("Номенклатура", ПутьКДанным));
	
	ЕстьОбщиеХарактеристики = МодульОбъекта().Интеграция_ЕстьОбщиеХарактеристики();
	Если Не ЕстьОбщиеХарактеристики Тогда
		СвязиПараметров.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", ПутьКДанным));
	КонецЕсли;
	
	Элемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметров);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	ТипыКодовМаркировки = МодульОбъекта().Перечисление_ТипыКодовМаркировки();
	ВидыПродукции = МодульОбъекта().Перечисление_ВидыПродукции();
	
	ЕстьУпаковки = ЗначениеЗаполнено(Элементы.СвязиНоменклатурыУпаковка.ОграничениеТипа);
	ЕстьХарактеристики = ЗначениеЗаполнено(Элементы.СвязиНоменклатурыХарактеристика.ОграничениеТипа);
	
	ДопускаетсяОтсутствиеРД = ВидПродукцииДопускаетОтсутствиеРазрешительнойДокументации();
	ПоддерживаетсяЛицензияНаНедра = ВидПродукцииПоддерживаетЛицензиюНаНедра();
	
	ЭтоКИГУ = (ТипКодаМаркировки = ТипыКодовМаркировки.ГрупповаяУпаковка);
	ЭтоНабор = (ТипКодаМаркировки = ТипыКодовМаркировки.Набор);
	ЭтоРЭП = (ВидПродукции = ВидыПродукции.Электроника);
	
	Элементы.СвязиНоменклатурыУпаковка.Видимость = ЕстьУпаковки;
	Элементы.СвязиНоменклатурыХарактеристика.Видимость = ЕстьХарактеристики;
	
	Элементы.НомераСкважин.Видимость = ПоддерживаетсяЛицензияНаНедра;
	Элементы.ГруппаЛицензияНаНедра.Видимость = ПоддерживаетсяЛицензияНаНедра;
	Элементы.ОтсутствуютТребованияРД.Видимость = ДопускаетсяОтсутствиеРД;
	
	Элементы.ЭтоКег.Видимость = ЭтоКег;
	Элементы.ГруппаСоставНабора.Видимость = ЭтоНабор;
	Элементы.ГруппаВложенныйТовар.Видимость = ЭтоКИГУ;
	
	Элементы.НоминальноеКоличество.Видимость = ЭтоКег Или ЗначениеЗаполнено(НоминальноеКоличество);
	Элементы.НоминальноеКоличество.ТолькоПросмотр = ЭтоКег;
	
	Элементы.ПеременныйВес.Видимость = МодульОбъекта().ВидПродукцииПоддерживаетПризнакПеременногоКоличестваВКарточкеТовара(ВидПродукции);
	
	Элементы.НеДобываетсяИзПодземныхВод.Видимость = (ВидПродукции = ВидыПродукции.Вода);
	Элементы.ИспользоватьЗаводскойСН.Видимость = МодульОбъекта().ВидПродукцииПоддерживаетЗСН(ВидПродукции);
	Элементы.ТипСрокаГодности.Видимость = МодульОбъекта().ВидПродукцииТребуетУказатьТипСрокаГодности(ВидПродукции);
	Элементы.ОбъемнаяДоляЭтиловогоСпирта.Видимость = МодульОбъекта().ВидПродукцииПоддерживаетСодержаниеСпирта(ВидПродукции);
	Элементы.ПодлежитВетеринарномуКонтролю.Видимость = МодульОбъекта().ВидПродукцииПоддерживаетВСД(ВидПродукции);
	Элементы.ГруппаПлатности.Видимость = ЗначениеЗаполнено(ГруппаПлатности);
	Элементы.ПредставлениеПеременнойХарактеристики.Видимость = ЗначениеЗаполнено(ПеременнаяХарактеристика);
	Элементы.КоличествоМин.Видимость = ЭтоРЭП И ЗначениеЗаполнено(КоличествоМин);
	Элементы.КоличествоМакс.Видимость = ЭтоРЭП И ЗначениеЗаполнено(КоличествоМакс);
	Элементы.СрокХраненияДо40Суток.Видимость = (ВидПродукции = ВидыПродукции.Молоко);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьКоманд()
	
	ЕстьПодсистемаВСО = МодульОбъекта().ЕстьПодсистемаВСО();
	
	Элементы.Гиперссылка_ОткрытьТоварыВСО.Видимость = ЕстьПодсистемаВСО;
	Элементы.Гиперссылка_ОткрытьТоварВСО.Видимость = ЕстьПодсистемаВСО;
	
	Элементы.Кнопка_ОтчетПоВиртуальномуСкладу.Видимость = РазрешенОСУ;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьДопКолонокРД()
	
	ВидыРД = МодульОбъекта().Перечисление_ВидыРазрешительныхДокументов();
	РазрешительныеДокументы = РеквизитФормыВЗначение("РазрешительнаяДокументация").ВыгрузитьКолонку("РазрешительныйДокумент");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурМаркировка_РазрешительныеДокументы КАК Т
	|ГДЕ
	|	Т.Ссылка В(&РазрешительныеДокументы)
	|	И Т.ВидДокумента = &ВидДокументаРегУдостоверениеВетПрепарата");
	Запрос.УстановитьПараметр("РазрешительныеДокументы", РазрешительныеДокументы);
	Запрос.УстановитьПараметр("ВидДокументаРегУдостоверениеВетПрепарата", ВидыРД.РегистрационноеУдостоверениеВетПрепарата);
	
	ЕстьРегУдостоверениеВетПрепарата = Не Запрос.Выполнить().Пустой();
	
	Элементы.РазрешительнаяДокументацияСерия.Видимость = ЕстьРегУдостоверениеВетПрепарата;
	Элементы.РазрешительнаяДокументацияГлобальныйИдентификаторПродукции.Видимость = ЕстьРегУдостоверениеВетПрепарата;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоВиртуальномуСкладу(Команда)
	
	МодульКлиента().ОткрытьФормуОтчетаПоВиртуальномуСкладу(ЭтаФорма, КонтекстОтчетаПоВиртуальномуСкладу());
	
КонецПроцедуры

&НаСервере
Функция КонтекстОтчетаПоВиртуальномуСкладу()
	
	Результат = МодульОбъекта().Новый_ОтчетПоВиртуальномуСкладу_Контекст();
	
	Результат.СписокТоваров.Добавить(Ссылка);
	Результат.ФормаИнициатор = "Форма_Товар";
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НомераСкважинПослеВыбора(Результат, Элемент) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомераСкважин = МодульКлиента().СоединитьСтроку(Результат, ", ");
	
	НомераСкважинПриИзменении(Элемент);
	
КонецПроцедуры

&НаСервере
Функция ВидПродукцииДопускаетОтсутствиеРазрешительнойДокументации()
	
	ВидыПродукции = МодульОбъекта().Перечисление_ВидыПродукции();
	
	ПодходящиеВидыПродукции = Новый Массив;
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Парфюмерия);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Молоко);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Обувь);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.ЛегПром);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.БезалкогольныеНапитки);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Вода);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Фототовары);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Шины);
	ПодходящиеВидыПродукции.Добавить(ВидыПродукции.Игрушки);
	
	Возврат МодульОбъекта().МассивСодержитЗначение(ПодходящиеВидыПродукции, ВидПродукции);
	
КонецФункции

&НаСервере
Функция ВидПродукцииПоддерживаетЛицензиюНаНедра()
	
	Возврат (ВидПродукции = МодульОбъекта().Перечисление_ВидыПродукции().Вода);
	
КонецФункции

&НаКлиенте
Процедура ДобавитьРазрешительныйДокументПослеВыбора(РазрешительныйДокумент, ДопПараметры = Неопределено) Экспорт
	
	Если РазрешительныйДокумент = Неопределено
		Или ЗначениеЗаполнено(РазрешительнаяДокументация.НайтиСтроки(Новый Структура("РазрешительныйДокумент", РазрешительныйДокумент))) Тогда
		Возврат;
	КонецЕсли;
	
	Стр = РазрешительнаяДокументация.Добавить();
	Стр.РазрешительныйДокумент = РазрешительныйДокумент;
	Элементы.РазрешительнаяДокументация.ТекущаяСтрока = Стр;
	
	НастроитьВидимостьДопКолонокРД();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПризнакВидПродукцииДопускаетВариативныеНаборы()
	
	ВидПродукцииДопускаетВариативныеНаборы = МодульОбъекта().ВидПродукцииДопускаетВариативныеНаборы(ВидПродукции);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПризнакРазрешенОСУ()
	
	РазрешенОСУ = МодульОбъекта().ВидПродукцииДопускаетОСУ(ВидПродукции);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УстановитьОформлениеРазрешительныеДокументы();
	УстановитьОформлениеСоставНабораКоличествоВложений();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеРазрешительныеДокументы()
	
	ТаблицаФормы = Элементы.РазрешительнаяДокументация;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным);
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.Имя + ".Основной");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт("", , Истина));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеСоставНабораКоличествоВложений()
	
	ТаблицаФормы = Элементы.СоставНабора;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + "КоличествоВложений");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидПродукцииДопускаетВариативныеНаборы");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаФормы.ПутьКДанным + ".КоличествоВложений");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не проверять>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТусклоСерый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы82()
	
	Если Не МодульОбъекта().ВерсияПлатформыНиже("8.3") Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаСтраницы82 = Элементы.Добавить("ГруппаСтраницы82", Тип("ГруппаФормы"));
	ГруппаСтраницы82.Вид = ВидГруппыФормы.Страницы;
	
	Элементы.Переместить(Элементы.ДокументыСертификацииЛицензии, ГруппаСтраницы82);
	Элементы.Переместить(Элементы.ГруппаВложенныеТовары, ГруппаСтраницы82);
	Элементы.Переместить(Элементы.ГруппаУсловияХраненияИСрокиГодности, ГруппаСтраницы82);
	Элементы.Переместить(Элементы.ГруппаСвязиНоменклатуры, ГруппаСтраницы82);
	
	Элементы.ГруппаРазрешительнаяДокументация.РастягиватьПоГоризонтали = Истина;
	
КонецПроцедуры

// #КонецОбласти
