
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ДанныеОбработки = Параметры.ЗначениеКопирования.ХранилищеОбработки.Получить();
	Иначе
		спрОбъект = РеквизитФормыВЗначение("Объект");
		ДанныеОбработки = спрОбъект.ХранилищеОбработки.Получить();
	КонецЕсли;

	ЗагрузитьЗначениеВХранилищеНаФорме("ДанныеОбработки", ДанныеОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "Файлы внешних обработок (.epf)|*.epf";
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ОбработкаВыбораФайлаОбработки", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаВыбораФайлаОбработки(МассивВыбранныхФайлов, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(МассивВыбранныхФайлов) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПолноеИмяФайла = МассивВыбранныхФайлов[0];
	ДанныеОбработки = Новый ДвоичныеДанные(ПолноеИмяФайла);
	
	Если Не ЗагрузитьОбработку(ДанныеОбработки) Тогда
		ПоказатьПредупреждение(, "Обработка имеет неизвестный формат!", , "Ошибка");
		Возврат Ложь;
	КонецЕсли;
	
	ИмяФайла = "";
	ИмяФайлаБезРасширения = "";
	вмс_РаботаСФайламиКлиентСервер.ПолучитьИмяИПутьФайла(ПолноеИмяФайла, ИмяФайла);
	Объект.РасширениеФайла = вмс_РаботаСФайламиКлиентСервер.ПолучитьРасширениеФайла(ИмяФайла, ИмяФайлаБезРасширения);
	
	ЗагрузитьЗначениеВХранилищеНаФорме("ДанныеОбработки", ДанныеОбработки);
	
	Модифицированность = Истина;
	ОбновитьЭлементыФормы();
	
КонецФункции

&НаСервере
Функция ЗагрузитьОбработку(ДанныеОбработки)
	
	Обработка = вмс_ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ДанныеОбработки);
	Если Обработка = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		СведенияОВнешнейОбработке = Обработка.СведенияОВнешнейОбработке();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Объект.Команды.Очистить();
	Для Каждого Команда Из СведенияОВнешнейОбработке.Команды Цикл
		НоваяКоманда = Объект.Команды.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяКоманда, Команда);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СведенияОВнешнейОбработке.Информация) Тогда
		Объект.Наименование = СведенияОВнешнейОбработке.Информация;
	Иначе
		Объект.Наименование = СведенияОВнешнейОбработке.Наименование;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Сохранить(Команда)
	
	ПолноеИмяФайла = Объект.Наименование;
	Если ЗначениеЗаполнено(Объект.РасширениеФайла) Тогда
		ПолноеИмяФайла = ПолноеИмяФайла + "." + Объект.РасширениеФайла;
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.ПолноеИмяФайла = ПолноеИмяФайла;
	ДиалогВыбораФайла.Фильтр = "Все файлы|*.*";
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ОбработкаЗаписьФайлаОбработки", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаЗаписьФайлаОбработки(МассивВыбранныхФайлов, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(МассивВыбранныхФайлов) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПолноеИмяФайла = МассивВыбранныхФайлов[0];
	
	ДанныеОбработки = ПолучитьЗначениеИзХранилищаНаФорме("ДанныеОбработки");
	ДанныеОбработки.Записать(ПолноеИмяФайла);
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ДанныеОбработки = ПолучитьЗначениеИзХранилищаНаФорме("ДанныеОбработки");
	ТекущийОбъект.ХранилищеОбработки = Новый ХранилищеЗначения(ДанныеОбработки);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

КонецПроцедуры

&НаКлиенте
Функция ОбновитьЭлементыФормы()
	
	ОбработкаЗагружена = ПолучитьЗначениеИзХранилищаНаФорме("ДанныеОбработки") <> Неопределено;
	
	Элементы.Сохранить.Доступность = ОбработкаЗагружена;
	
КонецФункции

//********************************************
//{ Работа с хранилищами

Функция ЗагрузитьЗначениеВХранилищеНаФорме(Имя, Значение)
	
	Перем АдресХранилища;
	
	СписокАдресовХранилищЗначений = ПолучитьСписокАдресовХранилищЗначений();
	
	СписокАдресовХранилищЗначений.Свойство(Имя, АдресХранилища);

	Если АдресХранилища <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(Значение, АдресХранилища);
	Иначе
		АдресХранилища = ПоместитьВоВременноеХранилище(Значение, ЭтаФорма.УникальныйИдентификатор);
		СписокАдресовХранилищЗначений.Вставить(Имя, АдресХранилища);
	КонецЕсли;
	
	Возврат АдресХранилища;
	
КонецФункции

Функция ПолучитьЗначениеИзХранилищаНаФорме(Имя)
	
	АдресХранилища = ПолучитьАдресХранилищаНаФорме(Имя);
	Если ЗначениеЗаполнено(АдресХранилища) Тогда
		Возврат ПолучитьИзВременногоХранилища(АдресХранилища);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьАдресХранилищаНаФорме(Имя)
	
	Перем АдресХранилища;
	
	ПолучитьСписокАдресовХранилищЗначений().Свойство(Имя, АдресХранилища);

	Возврат АдресХранилища;
	
КонецФункции

Функция ПолучитьСписокАдресовХранилищЗначений()
	
	ВсеРеквизитыФормы = ПолучитьРеквизиты();
	Для Каждого РеквизитФормы Из ВсеРеквизитыФормы Цикл
		Если РеквизитФормы.Имя = "СписокАдресовХранилищЗначений" Тогда
			Возврат ЭтаФорма.СписокАдресовХранилищЗначений;
		КонецЕсли;
	КонецЦикла;
	
	НовыеРеквизиты = Новый Массив;
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("СписокАдресовХранилищЗначений", Новый ОписаниеТипов));
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	ЭтаФорма.СписокАдресовХранилищЗначений = Новый Структура;
	Возврат ЭтаФорма.СписокАдресовХранилищЗначений;
	
КонецФункции

Функция УдалитьХранилищаНаФорме()
	
	СписокАдресовХранилищЗначений = ПолучитьСписокАдресовХранилищЗначений();
	
	Для Каждого АдресХранилищаЗначения Из СписокАдресовХранилищЗначений Цикл
		УдалитьИзВременногоХранилища(АдресХранилищаЗначения.Значение);
	КонецЦикла;
	
	СписокАдресовХранилищЗначений.Очистить();
	
КонецФункции

//} Работа с хранилищами
//********************************************
