
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_МаршрутМаркировки_Запись" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти


// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.РежимВыбора Тогда
		ОповеститьОВыборе(ВыбраннаяСтрока);
	Иначе
		МодульКлиента().ОткрытьФормуМаршрутаМаркировки(ВыбраннаяСтрока, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	МодульКлиента().ОткрытьФормуМаршрутаМаркировки(Элемент.ТекущиеДанные.Ссылка, ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти


// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	МодульКлиента().ОткрытьФормуМаршрутаМаркировки(Неопределено, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзШаблона(Команда)
	
	МодульКлиента().ОткрытьФормуМаршрутаМаркировки(Команда.Имя, ЭтаФорма);
	
КонецПроцедуры

// #КонецОбласти


// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборСписка()
	
	ИмяСправочника = ИмяСправочникаМаршрутыМаркировки();
	ДобавитьФиксированныйОтборПоИмениСправочника(Список, ИмяСправочника);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьФиксированныйОтборПоИмениСправочника(ДинамическийСписок, ИмяСправочника)
	
	Если МодульОбъекта().ВерсияПлатформыНиже("8.3.3") Тогда
		ЭлементОтбора = ДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Иначе
		ЭлементОтбора = ДинамическийСписок.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИмяСправочника");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ИмяСправочника;
	
КонецПроцедуры

&НаСервере
Функция ИмяСправочникаМаршрутыМаркировки()
	
	Возврат МодульОбъекта().Перечисление_ИменаДопСправочников().МаршрутыМаркировки;
	
КонецФункции

// #КонецОбласти
