
Функция ОписаниеДополнительногоСвойстваЭлементаНастройки(знач АдресКонтекстаФормы, знач ТипЭлементаНастройки, знач ИмяСвойства) Экспорт

	РК = вмс_РаботаСКоллекциями;

	ТаблицаДополнительныхСвойствЭлементов = ПолучитьСвойствоКонтекстаФормы(АдресКонтекстаФормы, "ТаблицаДополнительныхСвойствЭлементов"); 
	
	ЭлементТаблицыОписаниеДополнительногоСвойстваЭлемента = РК.НайтиЭлементКоллекции(ТаблицаДополнительныхСвойствЭлементов, Новый Структура("ТипЭлементаНастройки, ИмяСвойства", ТипЭлементаНастройки, ИмяСвойства));
	Если ЭлементТаблицыОписаниеДополнительногоСвойстваЭлемента=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ЭлементТаблицыОписаниеДополнительногоСвойстваЭлемента)=Тип("СтрокаТаблицыЗначений") Тогда
		// для возможности передачи на клиент
		ОписаниеДополнительногоСвойстваЭлемента = РК.СтрокуТаблицыЗначенийВСтруктуру(ЭлементТаблицыОписаниеДополнительногоСвойстваЭлемента);
	Иначе
		ОписаниеДополнительногоСвойстваЭлемента = ЭлементТаблицыОписаниеДополнительногоСвойстваЭлемента;
	КонецЕсли;
	
	Возврат ОписаниеДополнительногоСвойстваЭлемента;

КонецФункции

Функция ОписаниеДополнительныхСвойствЭлементаНастройки(знач АдресКонтекстаФормы, знач ТипЭлементаНастройки) Экспорт

	РК = вмс_РаботаСКоллекциями;

	ТаблицаДополнительныхСвойствЭлементов = ПолучитьСвойствоКонтекстаФормы(АдресКонтекстаФормы, "ТаблицаДополнительныхСвойствЭлементов"); 
	
	ЭлементыТаблицыОписаниеДополнительныхСвойствЭлемента = РК.НайтиЭлементыКоллекции(ТаблицаДополнительныхСвойствЭлементов, Новый Структура("ТипЭлементаНастройки", ТипЭлементаНастройки));
	
	ОписаниеДополнительныхСвойствЭлемента = РК.ВыгрузитьКоллекциюВМассивСтруктур(ЭлементыТаблицыОписаниеДополнительныхСвойствЭлемента);
	
	Возврат ОписаниеДополнительныхСвойствЭлемента;

КонецФункции

Функция ПолучитьЗначенияСвойствПоляОперацииПоУмолчанию(знач АдресКонтекстаФормы, знач ИмяПоля) Экспорт
	
	ЗначенияПоУмолчаниюМассив = ПолучитьСвойствоКонтекстаФормы(АдресКонтекстаФормы, "ТаблицаЗначенийСвойствПолейОперацииПоУмолчанию").НайтиСтроки(Новый Структура("Имя", ИмяПоля));
	Если ЗначенияПоУмолчаниюМассив.Количество() > 0 Тогда
		ЗначенияПоУмолчанию = вмс_РаботаСКоллекциями.СтрокуТаблицыЗначенийВСтруктуру(ЗначенияПоУмолчаниюМассив[0]);
	Иначе
		ЗначенияПоУмолчанию = Новый Структура;
	КонецЕсли;
	
	Возврат ЗначенияПоУмолчанию;
	
КонецФункции

Функция СтруктураНастройкиПолейПоУмолчанию() Экспорт
	
	Возврат Справочники.вмс_НастройкиПолейЗадания.СтруктураНастройкиПолейПоУмолчанию();
	
КонецФункции

Функция ПустаяСтруктураНастройкиПолей() Экспорт
	
	Возврат Справочники.вмс_НастройкиПолейЗадания.ПустаяСтруктураНастройкиПолей();
	
КонецФункции

Функция ПолучитьСвойствоКонтекстаФормы(знач АдресКонтекстаФормы, знач ИмяСвойства) Экспорт

	Контекст = ПолучитьИзВременногоХранилища(АдресКонтекстаФормы);
	
	ПутьСвойстваМассив = вмс_РаботаСКоллекциями.ЗначениеВМассив(ИмяСвойства, ".");
	
	ТекущееСвойство = Контекст;
	Для Каждого ЭлементПути Из ПутьСвойстваМассив Цикл
		ТекущееСвойство = ТекущееСвойство[ЭлементПути];
	КонецЦикла;
	
	Возврат ТекущееСвойство;
	
КонецФункции

Функция УстановитьСвойствоКонтекстаФормы(знач АдресКонтекстаФормы, знач ИмяСвойства, знач Значение) Экспорт

	Контекст = ПолучитьИзВременногоХранилища(АдресКонтекстаФормы);
	Контекст.Вставить(ИмяСвойства, Значение);
	
КонецФункции

Функция СКДРеквизитовЗадания(знач АдресКонтекстаФормы) Экспорт
	
	СКДРеквизитовЗадания = ПолучитьСвойствоКонтекстаФормы(АдресКонтекстаФормы, "СКДРеквизитовЗадания");
	
	Возврат ПоместитьВоВременноеХранилище(СКДРеквизитовЗадания);
	
КонецФункции
