#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СозданиеУсловногоОформления();
	
	ДокументыКонфигурации = ПолучитьСписокДокументовКонфигурации();
	вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(Элементы.ТипОбъектаИсточник.СписокВыбора, ДокументыКонфигурации);
	вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(Элементы.ТипОбъектаПриемник.СписокВыбора, ДокументыКонфигурации);
	ТипСправочника = Новый Массив();
	ТипСправочника.Добавить(Тип("СправочникСсылка.вмс_Операции")); 
	ОписаниеОбъекта = Новый ОписаниеТипов(ТипСправочника);
	Элементы.ОперацияТСД.ОграничениеТипа = ОписаниеОбъекта; 
	ЭтотОбъект.ОперацияТСД = ОписаниеОбъекта.ПривестиЗначение(ЭтотОбъект.ОперацияТСД);
	
	ТипДокумента = Новый Массив();
	ТипДокумента.Добавить(Тип("ДокументСсылка.вмс_ОперацияПоЯчейкам"));
	ОписаниеОбъекта = Новый ОписаниеТипов(ТипДокумента);
	Элементы.ОперацияПоЯчейкам.ОграничениеТипа = ОписаниеОбъекта;
	ЭтотОбъект.ОперацияПоЯчейкам = ОписаниеОбъекта.ПривестиЗначение(ЭтотОбъект.ОперацияПоЯчейкам);
	
	Элементы.ОперацияПоЯчейкам.Видимость = Ложь; 
	
	Элементы.ТаблицыРеквизитовСтраница.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Параметры.ПравилоКонвертации) Тогда
		
		Попытка	
			ПолучитьПравилоКонвертации(Параметры.ПравилоКонвертации);	
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ТипИсточник) Тогда	
		ЭтотОбъект.ТипОбъектаИсточник = Параметры.ТипИсточник;
		Элементы.ИмяТабличнойЧастиИсточник.СписокВыбора.ЗагрузитьЗначения(ИменаТаблицДокумента(ТипОбъектаИсточник));
		ИнициализацияОбъекта(Параметры.ТипИсточник, "ОбъектИсточник");
	КонецЕсли;    
	
КонецПроцедуры    

&НаСервере
Процедура СозданиеУсловногоОформления()  
	
	УстановитьУсловноеОформалениеЗначенияПоУмолчанию("РеквизитыТабличнойЧастиДокумента");  
	УстановитьУсловноеОформалениеЗначенияПоУмолчанию("РеквизитыШапкиДокумента");
	УстановитьУсловноеОформалениеЗначенияПоУмолчанию("РеквизитыТабличнойЧастиТСД");

КонецПроцедуры   

&НаСервере
Процедура УстановитьУсловноеОформалениеЗначенияПоУмолчанию(НазваниеТаблицы) 
	
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных( НазваниеТаблицы + "ЗначениеПоУмолчанию");
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
	ОтборУО =ГруппаЭлементовОтбора.Элементы.Добавить(  Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(НазваниеТаблицы +".ЗначениеПоУмолчанию");
	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборУО.ПравоеЗначение = Неопределено;
	ОтборУО.Использование = Истина; 
	
	ОтборУО =ГруппаЭлементовОтбора.Элементы.Добавить(  Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(НазваниеТаблицы +".ЗначениеПоУмолчанию");
	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ОтборУО.Использование = Истина;  
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,204,0)); 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Если ТипОбъектаПриемник <> "" Тогда
		ИнициализацияОбъекта(ТипОбъектаПриемник, "ОбъектПриемник");	
	КонецЕсли;
	
	Если ТипОбъектаИсточник <> "" Тогда
		ИнициализацияОбъекта(ТипОбъектаИсточник, "ОбъектИсточник");	
	КонецЕсли;

	ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника();  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаИсточникОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ЭтотОбъект.ТипОбъектаИсточник = ВыбранноеЗначение;	    
	ИнициализацияОбъекта(ВыбранноеЗначение, "ОбъектИсточник");
КонецПроцедуры  

&НаКлиенте
Процедура ТипОбъектаПриемникОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ЭтотОбъект.ТипОбъектаПриемник = ВыбранноеЗначение;	    
	ИнициализацияОбъекта(ВыбранноеЗначение, "ОбъектПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриемникПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОбъектПриемник) Тогда	
		Элементы.СоздатьДокумент.Заголовок = "Изменить Документ";
	Иначе
		ЗаполнитьШапку = Истина;
		Элементы.СоздатьДокумент.Заголовок = "Создать Документ";
		ОчиститьТабличнуюЧасть = Ложь;
		Элементы.ОчиститьТабличнуюЧасть.ТолькоПросмотр = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаИсточникПриИзменении(Элемент)
	Элементы.ИмяТабличнойЧастиИсточник.СписокВыбора.Очистить();
	Если ТипОбъектаИсточник<>"" Тогда	
		Элементы.ИмяТабличнойЧастиИсточник.СписокВыбора.ЗагрузитьЗначения(ИменаТаблицДокумента(ТипОбъектаИсточник));
	Иначе
		ТипОбъектаИсточник = "";
		ОбъектИсточник = Неопределено;
	КонецЕсли;  
	
	Если ПерезаполнитьИсточник Тогда
		ТипОбъектаПриемник = ТипОбъектаИсточник;	
	КонецЕсли; 
	
	Если ТипОбъектаИсточник = "Документ.вмс_ОперацияПоЯчейкам" Тогда
		
		ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД = Ложь;
		ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД = Ложь;  
		ПерезаполнитьИсточник = Ложь; 
	
	КонецЕсли;
	
	ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриемникПриИзменении(Элемент)
	Элементы.ИмяТабличнойЧастиПриемник.СписокВыбора.Очистить();
	Если ТипОбъектаПриемник<>"" Тогда	
		Элементы.ИмяТабличнойЧастиПриемник.СписокВыбора.ЗагрузитьЗначения(ИменаТаблицДокумента(ТипОбъектаПриемник));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШапкуПриИзменении(Элемент)
	ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника();
КонецПроцедуры  

&НаКлиенте
Процедура ЗагрузитьРеквизитыТабличнуюЧастьИзДокументаИсточникаПриИзменении(Элемент)
	ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРеквизитыТабличнуюЧастьИзТСДПриИзменении(Элемент)
	Если ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД Тогда
		ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД = Ложь; 
	КонецЕсли;
	ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРеквизитыТабличнуюЧастьИзДокументаТСДПриИзменении(Элемент)
	Если ЗагрузитьРеквизитыТабличнуюЧастьИзДокументаТСД Тогда
		ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД = Ложь; 
		ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД = Ложь;
	КонецЕсли;

	ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника() 
	
		
	Элементы.ОперацияТСД.Видимость = ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД Или ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД;

	Элементы.РеквизитыШапкиСтраница.Видимость = РеквизитыШапкиДокумента.Количество() <> 0 ;
	Элементы.РеквизитыТабличнойЧастиСтраница.Видимость = РеквизитыТабличнойЧастиДокумента.Количество() <> 0 ;
	Элементы.РеквизитыТСД.Видимость = РеквизитыТабличнойЧастиТСД.Количество() <> 0 ; 
	
	Элементы.ТаблицыРеквизитовСтраница.Видимость = Элементы.РеквизитыШапкиСтраница.Видимость ИЛИ  Элементы.РеквизитыТабличнойЧастиСтраница.Видимость ИЛИ Элементы.РеквизитыТСД.Видимость;
	
	Элементы.ТипОбъектаПриемник.Видимость = НЕ ПерезаполнитьИсточник;  
	Элементы.ОбъектПриемник.Видимость = НЕ ПерезаполнитьИсточник;	 
	
	Элементы.ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД.Доступность = ТипОбъектаИсточник <> "Документ.вмс_ОперацияПоЯчейкам";
    Элементы.ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД.Доступность = ТипОбъектаИсточник <> "Документ.вмс_ОперацияПоЯчейкам";
	Элементы.ПерезаполнитьИсточник.Доступность = ТипОбъектаИсточник <> "Документ.вмс_ОперацияПоЯчейкам";

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРеквизитыШапкиИзДокументаИсточникаПриИзменении(Элемент)
	ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРеквизитыШапкиИзТСДПриИзменении(Элемент)
	ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДанныеИзТСДПриИзменении(Элемент)
	Если ИспользоватьДанныеИзТСД Тогда
		Элементы.ИспользоватьДанныеИзТСД.Видимость = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСДПриИзменении(Элемент)
	Если ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД Тогда
		ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД = Ложь;
	КонецЕсли;
	ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектИсточникПриИзменении(Элемент)
	
	Если ПерезаполнитьИсточник Тогда
		ОбъектПриемник = ОбъектИсточник;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьИсточникПриИзменении(Элемент)  
	
	Если ПерезаполнитьИсточник Тогда
		ОбъектПриемник = ОбъектИсточник;
		ТипОбъектаПриемник = ТипОбъектаИсточник;
	КонецЕсли;  
	
	ПустойИсточник = Ложь;
	
	ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника();   
	
КонецПроцедуры 


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура РеквизитыТабличнойЧастиДокументаПредставлениеРеквизитаИсточникОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент.ЗакончитьРедактированиеСтроки(Ложь);
	
	СтандартнаяОбработка = Ложь;
	ИмяТаблицы = ЭтаФорма.ТекущийЭлемент.Имя;
	
	СтрокаТаблицы = Элементы[ИмяТаблицы].ТекущиеДанные; 
	СтрокаТаблицы.ИмяРеквизитаИсточник = ВыбранноеЗначение.ИмяРеквизитаИсточник;
	СтрокаТаблицы.ПредставлениеРеквизитаИсточник = ВыбранноеЗначение.ПредставлениеРеквизитаИсточник;
	СтрокаТаблицы.ОписаниеТиповИсточник = ВыбранноеЗначение.ОписаниеТиповИсточник; 
	
	СтрокаТаблицы.Пометка = Истина;   
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыТаблицПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Элемент.СписокВыбора.Очистить(); 
	
	Если ТекущийЭлемент.ТекущиеДанные.ИмяРеквизитаИсточник = "" Тогда
		Возврат;	
	КонецЕсли;
	ИмяТаблицы = ЭтаФорма.ТекущийЭлемент.Имя;
	
	Отбор = Новый Структура();
	Отбор.Вставить("ИмяРеквизитаИсточник", "");  
	РеквизитыПодходящиеПоТипу = ЭтотОбъект[ИмяТаблицы].НайтиСтроки(Отбор);
	
	Для каждого СтрокаТаблицыРеквизитов Из РеквизитыПодходящиеПоТипу Цикл
		СодержитТип = Ложь;	
		Для каждого ЭлементМассива  Из СтрокаТаблицыРеквизитов.ОписаниеТиповПриемник.Типы() Цикл
			
			СодержитТип = ТекущийЭлемент.ТекущиеДанные.ОписаниеТиповИсточник.СодержитТип(ЭлементМассива);
			Прервать;
			
		КонецЦикла;
		Если СодержитТип Тогда
			
			ДанныеРеквизита = Новый Структура();
			ДанныеРеквизита.Вставить("ИмяРеквизитаПриемник",СтрокаТаблицыРеквизитов.ИмяРеквизитаПриемник);
			ДанныеРеквизита.Вставить("ПредставлениеРеквизитаПриемник",СтрокаТаблицыРеквизитов.ПредставлениеРеквизитаПриемник);
			ДанныеРеквизита.Вставить("ОписаниеТиповИсточник",СтрокаТаблицыРеквизитов.ОписаниеТиповПриемник);
			
			Элемент.СписокВыбора.Добавить(ДанныеРеквизита,СтрокаТаблицыРеквизитов.ПредставлениеРеквизитаПриемник);		
			
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыТаблицПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент.ЗакончитьРедактированиеСтроки(Ложь);
	СтандартнаяОбработка = Ложь;
	ИмяТаблицы = ЭтаФорма.ТекущийЭлемент.Имя;
	
	СтрокаТаблицы = Элементы[ИмяТаблицы].ТекущиеДанные;
	СтрокаТаблицы.ИмяРеквизитаПриемник = ВыбранноеЗначение.ИмяРеквизитаПриемник;
	СтрокаТаблицы.ПредставлениеРеквизитаПриемник = ВыбранноеЗначение.ПредставлениеРеквизитаПриемник;
	СтрокаТаблицы.ОписаниеТиповПриемник = ВыбранноеЗначение.ОписаниеТиповИсточник;
	СтрокаТаблицы.Пометка = Истина;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяРеквизитаПриемник",ВыбранноеЗначение.ИмяРеквизитаПриемник);
	Отбор.Вставить("ОписаниеТиповПриемник", ВыбранноеЗначение.ОписаниеТиповИсточник);
	Отбор.Вставить("ПредставлениеРеквизитаПриемник", ВыбранноеЗначение.ПредставлениеРеквизитаПриемник);
	Отбор.Вставить("ИмяРеквизитаИсточник","");
	Отбор.Вставить("ПредставлениеРеквизитаИсточник","");
	Реквизиты = ЭтотОбъект[ИмяТаблицы].НайтиСтроки(Отбор);
	Если Реквизиты.Количество()>0  Тогда
		ЭтотОбъект[ИмяТаблицы].Удалить(Реквизиты[0]);	
	КонецЕсли;   	              
	
	ОбновитьРеквизитыПриемникаВТаблице(ИмяТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРеквизитаИсточникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить(); 
	
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	
	Если ТекущиеДанные.ИмяРеквизитаПриемник = "" Тогда
		Возврат;	
	КонецЕсли;  
	
	ИмяТаблицы = ЭтаФорма.ТекущийЭлемент.Имя;
	
	РеквизитыИсточника = Новый Массив;  
	
	Если Элемент.Родитель.Имя = "РеквизитыТабличнойЧастиТСД" Тогда
		Если ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД ИЛИ  ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД Тогда
			ПолучитьКолонкиТаблицыПринятыхТоваровТСД(РеквизитыИсточника);
		КонецЕсли;		
	ИначеЕсли Элемент.Родитель.Имя = "РеквизитыТабличнойЧастиДокумента" Тогда
		РеквизитыТабличнойЧастиПоСсылке(ОбъектИсточник, ИмяТабличнойЧастиИсточник, РеквизитыИсточника);	
	Иначе
		РеквизитыОбъектаПоСсылке(ОбъектИсточник, РеквизитыИсточника);
	КонецЕсли;
	
	Если ТипЗнч(ТекущийЭлемент) <> Тип("ТаблицаФормы") Тогда
	
		ТекущийЭлемент = Элемент.Родитель;
	
	КонецЕсли;
	
	Для каждого РеквизитИсточника Из РеквизитыИсточника Цикл
		
		СодержитТип = Ложь;

		Для каждого ТипПриемника  Из РеквизитИсточника.Тип.Типы() Цикл
			
			Если  ТипПриемника = Тип("Null")  Тогда	
				Продолжить;	
			КонецЕсли; 
			
			СодержитТип = ТекущиеДанные.ОписаниеТиповПриемник.СодержитТип(ТипПриемника);
			
			Прервать;
			
		КонецЦикла; 
		
		Если СодержитТип Тогда
			
			ДанныеРеквизита = Новый Структура();
			ДанныеРеквизита.Вставить("ИмяРеквизитаИсточник",РеквизитИсточника.Имя);
			ДанныеРеквизита.Вставить("ПредставлениеРеквизитаИсточник",РеквизитИсточника.Представление)  ;
			ДанныеРеквизита.Вставить("ОписаниеТиповИсточник",РеквизитИсточника.Тип);
			Элемент.СписокВыбора.Добавить(ДанныеРеквизита,РеквизитИсточника.Представление);
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРеквизитаИсточникПриИзменении(Элемент)
	ТекущаяСтрокаТаблицы = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	Если ТекущаяСтрокаТаблицы.ПредставлениеРеквизитаПриемник = "" Тогда
		ТекущаяСтрокаТаблицы.ЗначениеПоУмолчанию = Неопределено;
		ТекущаяСтрокаТаблицы.ОписаниеТиповИсточник = Неопределено;
		ТекущаяСтрокаТаблицы.ИмяРеквизитаИсточник = "";
		ТекущаяСтрокаТаблицы.Пометка = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыШапкиДокументаПредставлениеРеквизитаИсточникОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ЭтаФорма.ТекущийЭлемент.ЗакончитьРедактированиеСтроки(Ложь);
	
	СтандартнаяОбработка = Ложь;
	ИмяТаблицы = ЭтаФорма.ТекущийЭлемент.Имя;
	
	СтрокаТаблицы = Элементы[ИмяТаблицы].ТекущиеДанные;
	СтрокаТаблицы.ИмяРеквизитаИсточник = ВыбранноеЗначение.ИмяРеквизитаИсточник;
	СтрокаТаблицы.ПредставлениеРеквизитаИсточник = ВыбранноеЗначение.ПредставлениеРеквизитаИсточник;
	СтрокаТаблицы.ОписаниеТиповИсточник = ВыбранноеЗначение.ОписаниеТиповИсточник;
	
	СтрокаТаблицы.Пометка = Истина;              
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРеквизитаДокумента(Документ, ИмяРеквизита)
	Возврат Документ[ИмяРеквизита];
КонецФункции

&НаСервере
Функция РеквизитыОбъектаПоСсылке(Ссылка, МассивРеквизитов = Неопределено);	
	Возврат РеквизитыОбъекта(Ссылка.Метаданные(), МассивРеквизитов);			
КонецФункции

&НаСервере
Функция РеквизитыТабличнойЧастиПоСсылке(Ссылка, Таблица, МассивРеквизитов = Неопределено);	
	Возврат РеквизитыОбъекта(Ссылка.Метаданные().ТабличныеЧасти[Таблица], МассивРеквизитов);			
КонецФункции


&НаСервере
Процедура ОбновитьРеквизитыПриемникаВТаблице(ИмяТаблицы)
	Если ИмяТаблицы = "РеквизитыШапкиДокумента" Тогда
		ОбъектМетаданных = ПустаяСсылкаДокумента(ТипОбъектаПриемник).Метаданные();
	Иначе	
		ОбъектМетаданных = ПустаяСсылкаДокумента(ТипОбъектаПриемник).Метаданные().ТабличныеЧасти[ИмяТабличнойЧастиПриемник];
	КонецЕсли;
	
	РеквизитыПриемника = РеквизитыОбъекта(ОбъектМетаданных);
	
	Для каждого Элемент Из РеквизитыПриемника Цикл
		Отбор = Новый Структура();
		Отбор.Вставить("ИмяРеквизитаПриемник", Элемент.Имя);
		Отбор.Вставить("ОписаниеТиповПриемник", Элемент.Тип);
		РезультатОтбора = ЭтотОбъект[ИмяТаблицы].НайтиСтроки(Отбор);
		Если РезультатОтбора.Количество() = 0 Тогда
			НоваяСтрока = ЭтотОбъект[ИмяТаблицы].Добавить();
			НоваяСтрока.ОписаниеТиповПриемник = Элемент.Тип;
			НоваяСтрока.ИмяРеквизитаПриемник = Элемент.Имя;
			НоваяСтрока.ПредставлениеРеквизитаПриемник = Элемент.Представление;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПриемникПриИзменении(Элемент)
	ТекущаяСтрокаТаблицы = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	Если ТекущаяСтрокаТаблицы.ПредставлениеРеквизитаПриемник = "" Тогда
		ТекущаяСтрокаТаблицы.ОписаниеТиповПриемник = Неопределено;
		ТекущаяСтрокаТаблицы.ИмяРеквизитаПриемник = "";
		ТекущаяСтрокаТаблицы.Пометка = Ложь;
		ОбновитьРеквизитыПриемникаВТаблице(ЭтаФорма.ТекущийЭлемент.Имя);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПометкаПриИзменении(Элемент)
	ТекущаяСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	
	Если ТекущаяСтрока.ИмяРеквизитаПриемник <> "" Тогда 
	
		Если  ТекущаяСтрока.ИмяРеквизитаИсточник <> "" ИЛИ ТекущаяСтрока.ЗначениеПоУмолчанию <> Неопределено ИЛИ  ЗначениеЗаполнено( ТекущаяСтрока.Выражение) Тогда	
			Возврат 
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущаяСтрока.Пометка = Ложь;
	ОбщегоНазначенияКлиент.СообщитьПользователю("Недостаточно данных для конвертации реквизита");
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыШапкиДокументаПередНачаломИзменения(Элемент, Отказ)
	
	ОписаниеОбъекта = Новый ОписаниеТипов(Элемент.ТекущиеДанные.ОписаниеТиповПриемник);	 
          
	Если Элемент.ТекущийЭлемент.Имя = Элемент.Имя + "ЗначениеПоУмолчанию" Тогда
		Элемент.ПодчиненныеЭлементы[Элемент.Имя + "ЗначениеПоУмолчанию"].ОграничениеТипа = ОписаниеОбъекта; 
		Элемент.ТекущиеДанные.ЗначениеПоУмолчанию = ОписаниеОбъекта.ПривестиЗначение(Элемент.ТекущиеДанные.ЗначениеПоУмолчанию);   		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыШапкиДокументаЗначениеПоУмолчаниюОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)

	ТекущаяСтрока = Элемент.Родитель.ТекущиеДанные;

	Если Не ТипЗнч(ВыбранноеЗначение) = Тип("Тип") И ЗначениеЗаполнено(ТекущаяСтрока.ИмяРеквизитаПриемник)Тогда
		
		ТипОбъекта = Новый Массив;
		ТипОбъекта.Добавить(ТипЗнч(ВыбранноеЗначение));
		ТекущаяСтрока.ОписаниеТиповПриемник = Новый ОписаниеТипов(ТипОбъекта);
		ТекущаяСтрока.Пометка = Истина;  
	Иначе
		ТекущаяСтрока.Пометка = Ложь;  
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура РеквизитыШапкиДокументыаЗначениеПоУмолчаниюПриИзменении(Элемент)	
	ТекущаяСтрока =  ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ЗначениеПоУмолчанию) Тогда
		ТекущаяСтрока.Пометка = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыШапкиДокументаВыражениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные; 
	
	ОО = Новый ОписаниеОповещения("ПозлеЗавершенияВвода",ЭтотОбъект, ТекущиеДанные);
	ПараметрыФормы = Новый Структура;     
	
	Если Элемент.Родитель.Имя = "РеквизитыТабличнойЧастиТСД" Тогда
		ПараметрыФормы.Вставить("Источник", ПолучитьСтруктуруДокумента(ТипОбъектаИсточник, "ТоварТСД"));	
		ПараметрыФормы.Вставить("Приемник", ПолучитьСтруктуруДокумента(ТипОбъектаПриемник, ИмяТабличнойЧастиПриемник));
	КонецЕсли; 
	
	Если Элемент.Родитель.Имя = "РеквизитыТабличнойЧастиДокумента" Тогда
		ПараметрыФормы.Вставить("Источник", ПолучитьСтруктуруДокумента(ТипОбъектаИсточник, ИмяТабличнойЧастиИсточник));
		ПараметрыФормы.Вставить("Приемник", ПолучитьСтруктуруДокумента(ТипОбъектаПриемник, ИмяТабличнойЧастиПриемник));
	КонецЕсли;
	
	Если Элемент.Родитель.Имя = "РеквизитыШапкиДокумента" Тогда
		ПараметрыФормы.Вставить("Источник", ПолучитьСтруктуруДокумента(ТипОбъектаИсточник));	
		ПараметрыФормы.Вставить("Приемник", ПолучитьСтруктуруДокумента(ТипОбъектаПриемник,));
	КонецЕсли;	
	
	ПараметрыФормы.Вставить("СохраненноеВыражение", ТекущиеДанные.Выражение);	
		
	ЭтоПолеШапки = Ложь;
	
	Если Элемент.Родитель.Имя =  "РеквизитыШапкиДокумента" Тогда
	
		ПрефиксПоляИсточника = "Источник."; 
		ПрефиксПоляПриемника= "Приемник."; 
		ЭтоПолеШапки = Истина;

	Иначе                             
		
		ПрефиксПоляИсточника = "ТеущаяСтрокаИсточника."; 
		ПрефиксПоляПриемника= "ТеущаяСтрокаПриемника."; 
		
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ПолеИсточник", ПрефиксПоляИсточника + ТекущиеДанные.ИмяРеквизитаИсточник);
	ПараметрыФормы.Вставить("ПолеПриемник", ПрефиксПоляПриемника+ТекущиеДанные.ИмяРеквизитаПриемник);
	ПараметрыФормы.Вставить("ЭтоПолеШапки", ЭтоПолеШапки);

	ОткрытьФорму("Обработка.вмс_УниверсальныйВводНаОсновании.Форма.ФормаВводаВыражения",ПараметрыФормы,Элемент,,,,ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыШапкиДокументаЗначениеПоУмолчаниюОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элемент.Родитель.ТекущиеДанные; 
	ТекущаяСтрока.ЗначениеПоУмолчанию = Неопределено;   
	
	ПустоеописаниеТипов = Новый ОписаниеТипов();
	
	Элемент.Родитель.ПодчиненныеЭлементы[Элемент.Имя].ОграничениеТипа = ПустоеОписаниеТипов; 
	ТекущаяСтрока.ЗначениеПоУмолчанию = ПустоеОписаниеТипов.ПривестиЗначение(ТекущаяСтрока.ЗначениеПоУмолчанию);   

КонецПроцедуры

#КонецОбласти   

&НаКлиенте
Процедура ПозлеЗавершенияВвода(Результат, ТекущиеДанныеСтроки) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ТекущиеДанныеСтроки.Выражение = Результат;		
		
		Если ЗначениеЗаполнено(ТекущиеДанныеСтроки.ИмяРеквизитаПриемник)  И ЗначениеЗаполнено(ТекущиеДанныеСтроки.Выражение) Тогда
			
			ТекущиеДанныеСтроки.Пометка = Истина;    
			
		Иначе
			
			Если (ЗначениеЗаполнено(ТекущиеДанныеСтроки.ИмяРеквизитаИсточник) И ЗначениеЗаполнено(ТекущиеДанныеСтроки.ИмяРеквизитаПриемник) ) 
				ИЛИ(ЗначениеЗаполнено(ТекущиеДанныеСтроки.ИмяРеквизитаПриемник) И ТекущиеДанныеСтроки.ЗначениеПоУмолчанию <> Неопределено) Тогда
				
				ТекущиеДанныеСтроки.Пометка = Истина
			Иначе
				
				ТекущиеДанныеСтроки.Пометка = Ложь
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьТаблицуРеквизитов(Команда)
		
	ЗаполнитьТаблицыРеквизитовФормы();	
	
	ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	
	
	Если РеквизитыШапкиДокумента.Количество()<> 0 Или РеквизитыТабличнойЧастиДокумента.Количество()<> 0  ИЛИ РеквизитыТабличнойЧастиТСД.Количество() <> 0 Тогда	
		
		СозданныйДокумент = ЗаполнитьДокументПриемник(); 
		
		Если ЗначениеЗаполнено( СозданныйДокумент ) Тогда		
			ОткрытьЗначениеАсинх(СозданныйДокумент);	
		КонецЕсли;  
		
	Иначе 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Загрузите таблицу";
		Сообщение.Сообщить(); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сортировать(Команда)
	ОтсортироватьТаблицыФормы(); 
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьПравилоКонвертации(Команда)
	
	Перем ВыбранноеПравило;
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.вмс_ПравилаКонвертацииРеквизитов"));
	
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	РезультатВыбора = Ждать ВвестиЗначениеАсинх(ВыбранноеПравило, "Выберите правило", ОписаниеТипов);
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		ПолучитьПравилоКонвертации(РезультатВыбора)
	КонецЕсли; 
	
	ОбновитьВидимостьИПросмотрПолейИсточникаИПриемника();
	
КонецПроцедуры

&НаКлиенте
Асинх Функция СохранитьПравилоКонвертации(Команда)
	НовоеПравило = Неопределено;
	
	Если РеквизитыШапкиДокумента.Количество() > 0 Или РеквизитыТабличнойЧастиДокумента.Количество() > 0 Тогда
		НаименованиеПравила = "";
		
		Если Параметры.ПравилоКонвертации <> Неопределено  Тогда
			ИзменитьПравилоКонвертацииЭлементаСправочника();	
		Иначе	
			НаименованиеПравила = Ждать ВвестиСтрокуАсинх(НаименованиеПравила, "Выберите правило");
		КонецЕсли;
		
		
		Если  НаименованиеПравила <> "" Тогда
			НовоеПравило = СохранитьПравилаКонвертацииНаСервере(НаименованиеПравила);
			Если НовоеПравило<> Неопределено Тогда
				Закрыть(НовоеПравило);
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка при создании правила");
			КонецЕсли;	
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Таблицы реквизитов пусты");
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедуры

&НаСервере
Функция РеквизитыОбъекта(ОбъектМетаданных, МассивРеквизитов = Неопределено);
	
	Если  МассивРеквизитов = Неопределено Тогда
		МассивРеквизитов = Новый Массив;	
	КонецЕсли;
	
	Для каждого	РеквизитОбъекта  Из ОбъектМетаданных.Реквизиты Цикл
		
		Реквизит =  Новый Структура;
		Реквизит.Вставить("Имя",РеквизитОбъекта.Имя);
		Реквизит.Вставить("Представление", РеквизитОбъекта.Имя + " (" + РеквизитОбъекта.Тип + ")");
		Реквизит.Вставить("ИмяДокумента", ОбъектМетаданных.Имя);
		Если ТочноеСоответствиеТипов Тогда
			Реквизит.Вставить("Тип",РеквизитОбъекта.Тип);
		Иначе
			Типы = Новый Массив();
			Типы.Добавить("Строка");
			Типы.Добавить("Число");
			Типы.Добавить("Дата");
			РезультатПоиска = Типы.Найти(""+РеквизитОбъекта.Тип);
			Если РезультатПоиска <> Неопределено  Тогда
				ТипРеквизита = Новый Массив();
				ТипРеквизита.Добавить(Тип(Типы[РезультатПоиска]));
				Реквизит.Вставить("Тип",Новый ОписаниеТипов(ТипРеквизита));
			Иначе	
				Реквизит.Вставить("Тип", РеквизитОбъекта.Тип);
			КонецЕсли;
			
		КонецЕсли;
		
		МассивРеквизитов.Добавить(Реквизит);       
		
	КонецЦикла;	 
	
	Возврат МассивРеквизитов;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокДокументовКонфигурации()
	
	Перем Строка;
	
	СписокДокументов = Новый СписокЗначений;
	
	Для каждого Строка Из Метаданные.Документы Цикл
		Если ЗначениеЗаполнено(Строка.ТабличныеЧасти) Тогда
			Для каждого ТабличнаяЧасть Из Строка.ТабличныеЧасти Цикл
				СписокДокументов.Добавить(Строка.ПолноеИмя(), Строка.Синоним);
				Прервать;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокДокументов;
	
КонецФункции

&НаСервере
Процедура ИнициализацияОбъекта(ВыбранноеЗначение, Объект)
	Массив = Новый Массив(); 
	Массив.Добавить(Тип(СтрЗаменить(ВыбранноеЗначение, "Документ", "ДокументСсылка"))); 
	ОписаниеОбъекта = Новый ОписаниеТипов(Массив);
	Элементы[Объект].ОграничениеТипа = ОписаниеОбъекта; 
	ЭтотОбъект[Объект] = ОписаниеОбъекта.ПривестиЗначение(ЭтотОбъект[Объект]); 
КонецПроцедуры 

&НаСервере
Функция ИменаТаблицДокумента(ТипДокумента);
	ИменаТаблиц = Новый Массив();
	Для каждого Таблица Из Документы[СтрЗаменить(ТипДокумента,  "Документ.","")].ПустаяСсылка().Метаданные().ТабличныеЧасти Цикл	
		ИменаТаблиц.Добавить(Таблица.Имя);
	КонецЦикла;
	Возврат ИменаТаблиц;
КонецФункции

&НаСервере
Функция ПустаяСсылкаДокумента(ТипДокумента)
	Возврат Документы[СтрЗаменить(ТипДокумента,  "Документ.","")].ПустаяСсылка()	
КонецФункции

&НаКлиенте
Функция ПоляИсточникаИПриемникаЗаполнены()
	
	РеквизитыФормы = Новый СписокЗначений();
	Для каждого ПолеИсточника Из Элементы.Источник.ПодчиненныеЭлементы Цикл
		Если ПолеИсточника.Видимость=Истина Тогда
			РеквизитыФормы.Добавить(ПолеИсточника.Имя, ПолеИсточника.Заголовок)	
		КонецЕсли;	
	КонецЦикла;
	
	Для каждого ПолеИсточника Из Элементы.Приемник.ПодчиненныеЭлементы Цикл
		Если ПолеИсточника.Видимость=Истина Тогда
			РеквизитыФормы.Добавить(ПолеИсточника.Имя, ПолеИсточника.Заголовок)	
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Реквизит Из РеквизитыФормы Цикл	
		Если Не ЗначениеЗаполнено(ЭтотОбъект[Реквизит.Значение]) И Не  Реквизит.Значение = "ОбъектПриемник" Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Пустое поле: " + Реквизит.Представление;
			Сообщение.Поле = Реквизит.Значение;
			Сообщение.УстановитьДанные(Реквизит.Значение);
			Сообщение.ОбщегоНазначенияКлиент.СообщитьПользователю();
			Возврат Ложь;
		КонецЕсли;  		
	КонецЦикла;
	Возврат Истина;
КонецФункции

&НаСервере
Функция  ЗаполнитьДокументПриемник()	
	ПравилоКонвертации = СоздатьПравилаКонвертации(); 
	Возврат  Справочники.вмс_ПравилаКонвертацииРеквизитов.ВыполнитьПравилоКонвертации(ПравилоКонвертации, 
		Новый Структура("ОперацияТСД, Источник, ОперацияПоЯчейкам, Приемник", ОперацияТСД, ОбъектИсточник, ОперацияПоЯчейкам, ОбъектПриемник), );
		
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруДокумента(ТипДокумента, НаименованиеТаблицы = "")
	
	МетаданныеДокумента = ПустаяСсылкаДокумента(ТипДокумента).Метаданные();	 
	СтруктураДокумента = новый Структура("РеквизитыШапки, КлолнкиТабличнойЧасти, ИмяТабличнойЧасти, ТипДокумента", Новый Массив, Новый Массив, НаименованиеТаблицы, ТипДокумента);   
		
	Для каждого Реквизит Из МетаданныеДокумента.Реквизиты Цикл    
		
		СтруктураРеквизита = Новый Структура("Имя, Тип",Реквизит.Имя, Реквизит.Тип);	
		СтруктураДокумента.РеквизитыШапки.Добавить(СтруктураРеквизита);
		
	КонецЦикла;	 
	
	Если НаименованиеТаблицы <> ""  Тогда
		
		Если  НаименованиеТаблицы <> "ТоварТСД" Тогда
			
			МетаданныеТабличнойЧастиДокумента= МетаданныеДокумента.ТабличныеЧасти.Найти(НаименованиеТаблицы); 
			
			Если МетаданныеТабличнойЧастиДокумента <> Неопределено  Тогда
				
				Для каждого Колонка  Из МетаданныеТабличнойЧастиДокумента.Реквизиты Цикл		
					СтруктураРеквизита = Новый Структура("Имя, Тип",Колонка.Имя, Колонка.Тип);	
					СтруктураДокумента.КлолнкиТабличнойЧасти.Добавить(СтруктураРеквизита);
				КонецЦикла;	  
				
			КонецЕсли; 
			
		Иначе 
			
			ПустаяТаблицаПринятыхТоваров = ПустаяТаблицаПринятыхТоваровТСД();
			
			Для каждого Колонка Из ПустаяТаблицаПринятыхТоваров.Колонки Цикл			
				СтруктураРеквизита = Новый Структура("Имя, Тип",Колонка.Имя, Колонка.ТипЗначения);
				СтруктураДокумента.КлолнкиТабличнойЧасти.Добавить(СтруктураРеквизита);
			КонецЦикла;  
			
		КонецЕсли;  
		
	КонецЕсли;
	
	Возврат СтруктураДокумента;
	
КонецФункции 


#Область ЗаполнениеТаблицы

&НаСервере
Процедура ЗаполнитьТаблицыРеквизитовФормы()
	
	РеквизитыШапкиДокумента.Очистить();  
	РеквизитыТабличнойЧастиДокумента.Очистить();
	РеквизитыТабличнойЧастиТСД.Очистить();
	
	Если  ЗначениеЗаполнено(ТипОбъектаИсточник)  Тогда
		ОбъектМетаданныхШапкиИсточник = ПустаяСсылкаДокумента(ТипОбъектаИсточник).Метаданные();		
		ЗаполнитьТаблицуРеквизитамиИсточника(ОбъектМетаданныхШапкиИсточник, РеквизитыШапкиДокумента);
		//ЗаполнитьТаблицуЗначениямиИсточника(ОбъектИсточник);
	КонецЕсли;	
	
	
	Если  ЗначениеЗаполнено(ТипОбъектаПриемник)   Тогда
		ОбъектМетаданныхШапкиПриемник = ПустаяСсылкаДокумента(ТипОбъектаПриемник).Метаданные();
		ЗаполнитьТаблицуРеквизитамиПриемник(ОбъектМетаданныхШапкиПриемник, РеквизитыШапкиДокумента);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяТабличнойЧастиИсточник)  Тогда
		ОбъектМетаданныхТабличнойЧастиИсточник = ПустаяСсылкаДокумента(ТипОбъектаИсточник).Метаданные().ТабличныеЧасти[ИмяТабличнойЧастиИсточник];
		ЗаполнитьТаблицуРеквизитамиИсточника(ОбъектМетаданныхТабличнойЧастиИсточник, РеквизитыТабличнойЧастиДокумента);
	КонецЕсли; 
	
	Если ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД ИЛИ ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД Тогда
		ЗаполнитьТаблицуРеквизитамиПринятыхИОтобранныхТоваров(РеквизитыТабличнойЧастиТСД);
	КонецЕсли;
	
	Если РеквизитыТабличнойЧастиДокумента.Количество() > 0 И ЗначениеЗаполнено(ИмяТабличнойЧастиПриемник)  Тогда
		ОбъектМетаданныхТабличнойЧастиПриемник = ПустаяСсылкаДокумента(ТипОбъектаПриемник).Метаданные().ТабличныеЧасти[ИмяТабличнойЧастиПриемник];
		ЗаполнитьТаблицуРеквизитамиПриемник(ОбъектМетаданныхТабличнойЧастиПриемник, РеквизитыТабличнойЧастиДокумента);	
	КонецЕсли;     
	
	Если РеквизитыТабличнойЧастиТСД.Количество() > 0 И ЗначениеЗаполнено(ИмяТабличнойЧастиПриемник)  Тогда
		ОбъектМетаданныхТабличнойЧастиПриемник = ПустаяСсылкаДокумента(ТипОбъектаПриемник).Метаданные().ТабличныеЧасти[ИмяТабличнойЧастиПриемник];
		ЗаполнитьТаблицуРеквизитамиПриемник(ОбъектМетаданныхТабличнойЧастиПриемник, РеквизитыТабличнойЧастиТСД);	
	КонецЕсли;

	
	ОтсортироватьТаблицыФормы();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитамиИсточника(ОбъектМетаданных, Таблица)
	РеквизитыДокумента = РеквизитыОбъекта(ОбъектМетаданных);
	
	Для каждого Реквизит Из РеквизитыДокумента Цикл	
		СтрокаТаблицы = Таблица.Добавить();
		СтрокаТаблицы.ПредставлениеРеквизитаИсточник = Реквизит.Представление;
		СтрокаТаблицы.ИмяРеквизитаИсточник = Реквизит.Имя;
		СтрокаТаблицы.ОписаниеТиповИсточник = Реквизит.Тип;  
		
		Если Реквизит.Имя = "Комментарий" Тогда
			СтрокаТаблицы.Выражение = "Приемник.Комментарий =  ""Заполнено с ТСД на основании """""" + Строка(Источник) + """"""""" ;
		КонецЕсли;
		
	КонецЦикла;	 
	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитамиПринятыхИОтобранныхТоваров(Таблица) 
	
	ПустаяТаблицаПринятыхТоваров = ПустаяТаблицаПринятыхТоваровТСД();
	
	Для каждого Колонка Из ПустаяТаблицаПринятыхТоваров.Колонки Цикл	
		СтрокаТаблицы = Таблица.Добавить();
		СтрокаТаблицы.ПредставлениеРеквизитаИсточник = Колонка.Заголовок + " (" + Колонка.ТипЗначения + ")" ;
		СтрокаТаблицы.ИмяРеквизитаИсточник = Колонка.Имя;
		СтрокаТаблицы.ОписаниеТиповИсточник = Колонка.ТипЗначения;	
	КонецЦикла;  
	
КонецПроцедуры      

&НаСервере
Функция ПустаяТаблицаПринятыхТоваровТСД() 
	Отбор = Новый Структура("ДокументОснование, ВидОперации", Неопределено, Неопределено);  
	Возврат вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру(Отбор);
КонецФункции    

&НаСервере
Процедура ПолучитьКолонкиТаблицыПринятыхТоваровТСД( МассивРеквизитов) 
	
	ПустаяТаблицаПринятыхТоваров = ПустаяТаблицаПринятыхТоваровТСД();
	
	Если  МассивРеквизитов = Неопределено Тогда	
		МассивРеквизитов = Новый Массив;	
	КонецЕсли;
	
	
	Для каждого Колонка Из ПустаяТаблицаПринятыхТоваров.Колонки Цикл	    
		
		Реквизит =  Новый Структура;
		Реквизит.Вставить("Имя",Колонка.Имя); 
		Реквизит.Вставить("ИмяДокумента", "ТаблицаТоваровТСД");
		Реквизит.Вставить("Представление", СтрШаблон("%1 (%2)", Колонка.Имя,  Колонка.ТипЗначения));
				
		Если ТочноеСоответствиеТипов Тогда
			
			Реквизит.Вставить("Тип",Колонка.ТипЗначения);
			
		Иначе
			
			Типы = Новый Массив();
			Типы.Добавить("Строка");
			Типы.Добавить("Число");
			Типы.Добавить("Дата");
			РезультатПоиска = Типы.Найти(""+Колонка.ТипЗначения);
			Если РезультатПоиска <> Неопределено  Тогда
				ТипРеквизита = Новый Массив();
				ТипРеквизита.Добавить(Тип(Типы[РезультатПоиска]));
				Реквизит.Вставить("Тип",Новый ОписаниеТипов(ТипРеквизита));
			Иначе	
				Реквизит.Вставить("Тип", Колонка.ТипЗначения);
			КонецЕсли; 
			
		КонецЕсли;  
		
		МассивРеквизитов.Добавить(Реквизит);  

	КонецЦикла; 	  
	
КонецПроцедуры 


&НаСервере
Процедура ЗаполнитьТаблицуЗначениямиИсточника(ДокументСсылка)
	
	ОбъектДокумента = ДокументСсылка.ПолучитьОбъект();
	Отбор = Новый Структура();
	Отбор.Вставить("ИмяИсточника",ДокументСсылка.Метаданные().Имя);
	РеквизитыДокумента = РеквизитыШапкиДокумента.НайтиСтроки(Отбор);
	
	ЗначениеРеквизитов = Новый Структура();
	Для каждого	СтрокаТаблицы  Из РеквизитыДокумента  Цикл
		ЗначениеРеквизита = ОбъектДокумента[СтрокаТаблицы.ИмяРеквизитаИсточник];
		ЗначениеРеквизитов.Вставить(СтрокаТаблицы.ИмяРеквизитаИсточник, ЗначениеРеквизита);
		СтрокаТаблицы.ЗначениеПоУмолчанию = ЗначениеРеквизита;	
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитамиПриемник(ОбъектМетаданных, Таблица)
	
	РеквизитыПриемника = Новый Массив();
	РеквизитыПриемника = РеквизитыОбъекта(ОбъектМетаданных);
	
	РеквизитыБезИсточника = Новый Массив();
	
	Для каждого СтрокаИсточник Из Таблица Цикл
		Итератор = 0;	
		Пока РеквизитыПриемника.Количество() <> Итератор Цикл	
			Если РеквизитыПриемника[Итератор].Имя = СтрокаИсточник.ИмяРеквизитаИсточник  Тогда			
				СодержитТип = Ложь;		
				Для каждого ТипПриемника Из РеквизитыПриемника[Итератор].Тип.Типы() Цикл		
					СодержитТип = СтрокаИсточник.ОписаниеТиповИсточник.СодержитТип(ТипПриемника);
					Если СодержитТип Тогда	
						СтрокаИсточник.ПредставлениеРеквизитаПриемник = РеквизитыПриемника[Итератор].Представление;
						СтрокаИсточник.ИмяРеквизитаПриемник = РеквизитыПриемника[Итератор].Имя;
						СтрокаИсточник.ОписаниеТиповПриемник = РеквизитыПриемника[Итератор].Тип;
						СтрокаИсточник.Пометка = Истина; 
						РеквизитыПриемника.Удалить(Итератор);
						Прервать;
					КонецЕсли;
					Если Не СодержитТип Тогда
						Итератор = Итератор + 1;
						Прервать;	
					КонецЕсли;
				КонецЦикла;
			Иначе
				Итератор = Итератор + 1;	
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	
	
	Для каждого ЭлементМассива Из РеквизитыПриемника Цикл	
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.ПредставлениеРеквизитаПриемник = ЭлементМассива.Представление;
		НоваяСтрока.ИмяРеквизитаПриемник = ЭлементМассива.Имя;
		НоваяСтрока.ОписаниеТиповПриемник = ЭлементМассива.Тип;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитовТабличнойЧастиДаннымиИзТСД()
	РеквизитыТабличнойЧастиДокумента.Очистить();
	ВходящийПараметры = Новый Структура;
	ВходящийПараметры.Вставить("ДокументОснование",ОбъектИсточник);
	ВходящийПараметры.Вставить("ВидОперации",ОперацияТСД);
	ВходящийПараметры.Вставить("ВключаяДокументыОпераций",Неопределено);
	РезультатЗапроса = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуПринятыхТоваровЧерезСтруктуру(ВходящийПараметры);
	
	Если РезультатЗапроса.Количество()=0 Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Операция не найдена");
		Возврат;
		
	КонецЕсли;
	
	Если ТоварыОперацииПоЯчейкам.Выгрузить().Колонки.Количество() = 0 Тогда
		
		НовыеРеквизиты = Новый Массив();
		Для каждого КолонкаРезультатаЗапроса Из РезультатЗапроса.Колонки Цикл	
			НовыеРеквизиты.Добавить(
			Новый РеквизитФормы(
			КолонкаРезультатаЗапроса.Имя,
			КолонкаРезультатаЗапроса.ТипЗначения,
			"ТоварыОперацииПоЯчейкам"
			)
			);	
		КонецЦикла;
		
		ИзменитьРеквизиты(НовыеРеквизиты); 
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(РезультатЗапроса, "ТоварыОперацииПоЯчейкам");
	
	Для каждого СтрокаРезультатаЗапроса Из РезультатЗапроса.Колонки  Цикл
		НоваяСтрока = РеквизитыТабличнойЧастиДокумента.Добавить();	
		НоваяСтрока.ИмяРеквизитаИсточник = СтрокаРезультатаЗапроса.Имя;
		НоваяСтрока.ОписаниеТиповИсточник = СтрокаРезультатаЗапроса.ТипЗначения;
		НоваяСтрока.ПредставлениеРеквизитаИсточник = СтрокаРезультатаЗапроса.Имя + " (" + СтрокаРезультатаЗапроса.ТипЗначения + ")"; 	
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ОтсортироватьТаблицыФормы()	
	РеквизитыШапкиДокумента.Сортировать("Пометка УБЫВ, ИмяРеквизитаИсточник УБЫВ");
	РеквизитыТабличнойЧастиДокумента.Сортировать("Пометка УБЫВ, ИмяРеквизитаИсточник УБЫВ");
КонецПроцедуры

#КонецОбласти

#Область РаботаСПравиломКонвертации

&НаСервере
Функция СохранитьПравилаКонвертацииНаСервере(НаименованиеПравила)
	ПравилаКонвертации = СоздатьПравилаКонвертации(); 
	Возврат Справочники.вмс_ПравилаКонвертацииРеквизитов.ЗаписатьПравилоКонвертации(НаименованиеПравила, ПравилаКонвертации);
КонецФункции 

&НаСервере
Функция СоздатьПравилаКонвертации() 
	ПравилаКонвертации = Новый Структура;  

	ПравилаКонвертации.Вставить("ПравилаКонвертацииРеквизитовШапки", РеквизитФормыВЗначение("РеквизитыШапкиДокумента"));
	ПравилаКонвертации.Вставить("ПравилаКонвертацииРеквизитовТабличнойЧасти", РеквизитФормыВЗначение("РеквизитыТабличнойЧастиДокумента"));
	ПравилаКонвертации.Вставить("РеквизитыТабличнойЧастиТСД", РеквизитФормыВЗначение("РеквизитыТабличнойЧастиТСД"));
	ПравилаКонвертации.Вставить("ТипПриемника",ТипОбъектаПриемник);  
	ПравилаКонвертации.Вставить("ТипИсточника",ТипОбъектаИсточник);

	ПравилаКонвертации.Вставить("ИмяТабличнойЧастиИсточник",ИмяТабличнойЧастиИсточник);
	ПравилаКонвертации.Вставить("ИмяТабличнойЧастиПриемник",ИмяТабличнойЧастиПриемник);
	
	ПравилаКонвертации.Вставить("ПерезаполнитьИсточник", ПерезаполнитьИсточник);
	ПравилаКонвертации.Вставить("ОчиститьТабличнуюЧастьПриемника",ОчиститьТабличнуюЧасть); 
	ПравилаКонвертации.Вставить("ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД", ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД); 
	//ПравилаКонвертации.Вставить("ЗагрузитьРеквизитыТабличнойЧастиИзДокументаИсточника", ЗагрузитьРеквизитыТабличнойЧастиИзДокументаИсточника);   
	//ПравилаКонвертации.Вставить("ЗагрузитьРеквизитыТабличнуюЧастьИзДокументаТСД", ЗагрузитьРеквизитыТабличнуюЧастьИзДокументаТСД);
	ПравилаКонвертации.Вставить("ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД", ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД); 	
	//ПравилаКонвертации.Вставить("ЗагрузитьРеквизитыШапкиИзДокументаИсточника", ЗагрузитьРеквизитыШапкиИзДокументаИсточника); 
	//ПравилаКонвертации.Вставить("ЗагрузитьРеквизитыШапкиИзТСД", ЗагрузитьРеквизитыШапкиИзТСД); 
	
	ПравилаКонвертации.Вставить("СопоставлениеТоваровТСДПоУмолчанию", Ложь);
	ПравилаКонвертации.Вставить("ЗаполнитьНаОсновании", ЗаполнитьНаОсновании);
	ПравилаКонвертации.Вставить("ДозаполнитьДокумент", Истина);
	ПравилаКонвертации.Вставить("ЗаполнитьКодыМаркировки", ЗаполнитьКодыМаркировки);
	ПравилаКонвертации.Вставить("СопоставлениеТоваровТСДПоСерии", Ложь);
	ПравилаКонвертации.Вставить("УдалитьСтрокиПриемникаСНулевымКоличеством", УдалитьСтрокиПриемникаСНулевымКоличеством);
	ПравилаКонвертации.Вставить("ПроводитьДокумент", ПроводитьДокумент);
	
	ПравилаКонвертации.Вставить("ОперацияТСД", ОперацияТСД);
	ПравилаКонвертации.Вставить("Источник",ОбъектИсточник);
	ПравилаКонвертации.Вставить("ОперацияПоЯчейкам",ОперацияПоЯчейкам);
	ПравилаКонвертации.Вставить("Приемник",ОбъектПриемник);

	ПравилаКонвертации.Вставить("ДозаполнитьТабличнуюЧасть",ДозаполнитьТабличнуюЧасть);
	
	Возврат ПравилаКонвертации;
КонецФункции

&НаСервере
Процедура ПолучитьПравилоКонвертации(ВыбранноеПравилоКонвертации);
	
	ПравилоКонвертации = ВыбранноеПравилоКонвертации.Ссылка.ПолучитьОбъект().ПолучитьПравилоКонвертации();
	
	Если ЗначениеЗаполнено(ПравилоКонвертации) Тогда
		
		РеквизитыШапкиДокумента.Очистить();
		РеквизитыШапкиДокумента.Загрузить(ПравилоКонвертации.ПравилаКонвертацииРеквизитовШапки);
		Если РеквизитыШапкиДокумента.Количество() > 0 Тогда
			ЗаполнитьШапку = Истина;
			ТипОбъектаИсточник = ПравилоКонвертации.ТипИсточника;
			Элементы.ИмяТабличнойЧастиИсточник.СписокВыбора.ЗагрузитьЗначения(ИменаТаблицДокумента(ТипОбъектаИсточник));
			ИнициализацияОбъекта(ТипОбъектаИсточник, "ОбъектИсточник");
			Элементы.ТаблицыРеквизитовСтраница.Видимость = Истина;
			Элементы.РеквизитыШапкиСтраница.Видимость = Истина;	
		КонецЕсли;
		
		ТипОбъектаПриемник = ПолучитьПараметрКонвертации(ПравилоКонвертации, "ТипПриемника");
		Элементы.ИмяТабличнойЧастиПриемник.СписокВыбора.ЗагрузитьЗначения(ИменаТаблицДокумента(ТипОбъектаПриемник));
		
		ИмяТабличнойЧастиИсточник = ПолучитьПараметрКонвертации(ПравилоКонвертации, "ИмяТабличнойЧастиИсточник"); 
		ИмяТабличнойЧастиПриемник = ПолучитьПараметрКонвертации(ПравилоКонвертации, "ИмяТабличнойЧастиПриемник");
		ОперацияТСД = ПолучитьПараметрКонвертации(ПравилоКонвертации, "ОперацияТСД");
		ОчиститьТабличнуюЧасть = ПолучитьПараметрКонвертации(ПравилоКонвертации, "ОчиститьТабличнуюЧастьПриемника");
		ПерезаполнитьИсточник = ПолучитьПараметрКонвертации(ПравилоКонвертации, "ПерезаполнитьИсточник");
		ОбъектИсточник = ПолучитьПараметрКонвертации(ПравилоКонвертации, "Источник");
		ОперацияПоЯчейкам = ПолучитьПараметрКонвертации(ПравилоКонвертации, "ОперацияПоЯчейкам");
		ОбъектПриемник = ПолучитьПараметрКонвертации(ПравилоКонвертации, "Приемник");
		СопоставлениеТоваровТСДПоУмолчанию = ПолучитьПараметрКонвертации(ПравилоКонвертации, "СопоставлениеТоваровТСДПоУмолчанию");
		ЗаполнитьНаОсновании = ПолучитьПараметрКонвертации(ПравилоКонвертации, "ЗаполнитьНаОсновании");
		ДозаполнитьДокумент = ПолучитьПараметрКонвертации(ПравилоКонвертации, "ЗаполнитьНаОсновании");
		ЗаполнитьКодыМаркировки = ПолучитьПараметрКонвертации(ПравилоКонвертации, "ЗаполнитьКодыМаркировки");
		УдалитьСтрокиПриемникаСНулевымКоличеством = ПолучитьПараметрКонвертации(ПравилоКонвертации, "УдалитьСтрокиПриемникаСНулевымКоличеством");
		ПроводитьДокумент = ПолучитьПараметрКонвертации(ПравилоКонвертации, "ПроводитьДокумент");
        ДозаполнитьТабличнуюЧасть = ПолучитьПараметрКонвертации(ПравилоКонвертации, "ДозаполнитьТабличнуюЧасть");
		
		РеквизитыТабличнойЧастиДокумента.Очистить();	
		РеквизитыТабличнойЧастиДокумента.Загрузить(ПравилоКонвертации.ПравилаКонвертацииРеквизитовТабличнойЧасти); 
		
		
		
		Если РеквизитыТабличнойЧастиДокумента.Количество() > 0  Тогда
			ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД = ПравилоКонвертации.ЗагрузитьРеквизитыТабличнуюЧастьПринятыхТоваровИзТСД;
			ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД = ПравилоКонвертации.ЗагрузитьРеквизитыТабличнуюЧастьОтобранныхТоваровИзТСД;
		КонецЕсли;    
		
		РеквизитыТабличнойЧастиТСД.Очистить();
		РеквизитыТабличнойЧастиТСД.Загрузить(ПравилоКонвертации.РеквизитыТабличнойЧастиТСД);		
		
	КонецЕсли;    
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьПараметрКонвертации(ПравилоКонертации, НаименованиеПараметра)
	
	Если ПравилоКонертации.Свойство(НаименованиеПараметра) Тогда
		Возврат ПравилоКонертации[НаименованиеПараметра];	
	КонецЕсли; 
	
КонецФункции


&НаСервере
Функция  ИзменитьПравилоКонвертацииЭлементаСправочника()     
	
	НовоеПравило = СоздатьПравилаКонвертации();
	ПравилоКонвертацииСсылка = Справочники.вмс_ПравилаКонвертацииРеквизитов.СохранитьПравилоКонвертации(Параметры.ПравилоКонвертации.Ссылка, НовоеПравило);	
	Возврат  ПравилоКонвертацииСсылка;       
	
КонецФункции

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ТекущаяСтраница = Элементы.РекизитыСтраницы.ТекущаяСтраница; 
	
	ТекущаяТаблица = Неопределено; 
	Если ТекущаяСтраница = Элементы.РеквизитыШапкиСтраница Тогда
		
		Для Каждого СтрокаТаблицы Из РеквизитыШапкиДокумента Цикл           
			СтрокаТаблицы.Пометка = Ложь;	
		КонецЦикла;     
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.РеквизитыТабличнойЧастиСтраница Тогда
		ТекущаяТаблица = РеквизитыТабличнойЧастиДокумента;
	ИначеЕсли ТекущаяСтраница = Элементы.РеквизитыТСД Тогда  
		ТекущаяТаблица = РеквизитыТабличнойЧастиТСД;
	КонецЕсли;    
	
	Для Каждого СтрокаТаблицы Из ТекущаяТаблица Цикл
		СтрокаТаблицы.Пометка = Ложь;
		СтрокаТаблицы.КолонкаСуммирования = Ложь;
	КонецЦикла;  
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти