&НаКлиенте
Перем МножественныйВыбор;

&НаКлиенте
Перем УказыватьПорядокЭлементов;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭлементыДляВыбора = вмс_РаботаСФормамиКлиент.ПолучитьПараметрФормыНаКлиенте(ЭтаФорма, "ЭлементыДляВыбора");
	
	МножественныйВыбор = вмс_РаботаСФормамиКлиент.ПолучитьПараметрФормыНаКлиенте(ЭтаФорма, "МножественныйВыбор")=Истина;
	УказыватьПорядокЭлементов = вмс_РаботаСФормамиКлиент.ПолучитьПараметрФормыНаКлиенте(ЭтаФорма, "УказыватьПорядокЭлементов");
	Если УказыватьПорядокЭлементов=Неопределено Тогда
		УказыватьПорядокЭлементов = МножественныйВыбор;
	ИначеЕсли УказыватьПорядокЭлементов <> Истина Тогда
		УказыватьПорядокЭлементов = Ложь;
	КонецЕсли;

	Элементы.ТаблицаЭлементовПометка.Видимость = МножественныйВыбор И НЕ УказыватьПорядокЭлементов;
	
	Элементы.ГруппаУправлениеЭлементами.Видимость = МножественныйВыбор И УказыватьПорядокЭлементов;
	Элементы.ТаблицаВыбранныхЭлементов.Видимость = МножественныйВыбор И УказыватьПорядокЭлементов;
	
	ВыбранныеЭлементы = вмс_РаботаСФормамиКлиент.ПолучитьПараметрФормыНаКлиенте(ЭтаФорма, "ВыбранныеЭлементы");
	Если ВыбранныеЭлементы <> Неопределено Тогда
		ВыбранныеЭлементы = вмс_РаботаСКоллекциями.ЗначениеВМассив(ВыбранныеЭлементы);
	Иначе
		ВыбранныеЭлементы = Новый Массив;
	КонецЕсли;
	
	ЗагрузитьЭлементы(ЭлементыДляВыбора, ВыбранныеЭлементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	вмс_РаботаСФормамиКлиент.ПриЗакрытии(ЭтаФорма, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЭлементовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	РК = вмс_РаботаСКоллекциями;
	
	Контекст = Контекст();
	ДополнительныеСвойстваЭлементов = Контекст.ДополнительныеСвойстваЭлементов;
	
	Если МножественныйВыбор Тогда
		ЭлементНаФорме = ТаблицаЭлементов.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если УказыватьПорядокЭлементов Тогда
			ВыбранныйЭлементНаФорме = ТаблицаВыбранныхЭлементов.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(ВыбранныйЭлементНаФорме, ЭлементНаФорме);
			ВыбранныйЭлементНаФорме.Пометка = Истина;
			ДополнительныеСвойстваЭлементов["ВыбранныеЭлементы"][ВыбранныйЭлементНаФорме.ПолучитьИдентификатор()] = ДополнительныеСвойстваЭлементов["Элементы"][ЭлементНаФорме.ПолучитьИдентификатор()];
			ДополнительныеСвойстваЭлементов["Элементы"].Удалить(ЭлементНаФорме.ПолучитьИдентификатор());
			РК.УдалитьЭлементыКоллекции(ТаблицаЭлементов, ЭлементНаФорме);
		Иначе
			ЭлементНаФорме.Пометка = НЕ ЭлементНаФорме.Пометка;
		КонецЕсли;
	Иначе
		ВыбранныйЭлемент = ПолучитьВыбранныйЭлемент(ВыбраннаяСтрока);
		Закрыть(ВыбранныйЭлемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбранныхЭлементовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбранныхЭлементовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбранныхЭлементовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	РК = вмс_РаботаСКоллекциями;
	
	Контекст = Контекст();
	ДополнительныеСвойстваЭлементов = Контекст.ДополнительныеСвойстваЭлементов;

	ВыбранныйЭлементНаФорме = ТаблицаВыбранныхЭлементов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ЭлементНаФорме = ТаблицаЭлементов.ПолучитьЭлементы().Добавить();
	ЗаполнитьЗначенияСвойств(ЭлементНаФорме, ВыбранныйЭлементНаФорме);
	ДополнительныеСвойстваЭлементов["Элементы"][ЭлементНаФорме.ПолучитьИдентификатор()] = ДополнительныеСвойстваЭлементов["ВыбранныеЭлементы"][ВыбранныйЭлементНаФорме.ПолучитьИдентификатор()];
	ДополнительныеСвойстваЭлементов["ВыбранныеЭлементы"].Удалить(ВыбранныйЭлементНаФорме.ПолучитьИдентификатор());
	РК.УдалитьЭлементыКоллекции(ТаблицаВыбранныхЭлементов, ВыбранныйЭлементНаФорме);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбранныхЭлементовПередУдалением(Элемент, Отказ)
	
	РК = вмс_РаботаСКоллекциями;
	
	Отказ = Истина;
	Для Каждого СтрокаДляУдаления Из РК.СкопироватьОбъект(Элемент.ВыделенныеСтроки) Цикл
		ТаблицаВыбранныхЭлементовВыбор(Элемент, СтрокаДляУдаления, Неопределено, Ложь);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если МножественныйВыбор Тогда
		ВыбранныеЭлементы = ПолучитьВыбранныеЭлементы();
	Иначе
		ВыбранныеЭлементы = ПолучитьВыбранныйЭлемент(Элементы.ТаблицаЭлементов.ТекущаяСтрока);
	КонецЕсли;
	Закрыть(ВыбранныеЭлементы);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВыбранныеЭлементы()
	
	Контекст = Контекст();
	ДополнительныеСвойстваЭлементов = Контекст.ДополнительныеСвойстваЭлементов;
	
	ВыбранныеЭлементы = Новый Массив;
	
	Если УказыватьПорядокЭлементов Тогда
		РабочаяТаблица = ТаблицаВыбранныхЭлементов;
		ДополнительныеСвойстваЭлементовТаблицы = ДополнительныеСвойстваЭлементов["ВыбранныеЭлементы"];
	Иначе
		РабочаяТаблица = ТаблицаЭлементов;
		ДополнительныеСвойстваЭлементовТаблицы = ДополнительныеСвойстваЭлементов["Элементы"];
	КонецЕсли;

	Для Каждого ЭлементНаФорме Из вмс_РаботаСКоллекциями.ПолучитьПодчиненныеЭлементыКоллекции(РабочаяТаблица) Цикл
		
		Если ЭлементНаФорме.Пометка Тогда
			ДополнительныеСвойстваЭлемента = ДополнительныеСвойстваЭлементовТаблицы[ЭлементНаФорме.ПолучитьИдентификатор()];
			ВыбранныйЭлемент = ДополнительныеСвойстваЭлемента.Элемент;
			ВыбранныеЭлементы.Добавить(ВыбранныйЭлемент);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВыбранныеЭлементы;
	
КонецФункции

&НаКлиенте
Функция ПолучитьВыбранныйЭлемент(Строка)
	Если Строка=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Контекст = Контекст();
	ДополнительныеСвойстваЭлементов = Контекст.ДополнительныеСвойстваЭлементов;
	ДополнительныеСвойстваЭлемента = ДополнительныеСвойстваЭлементов[Строка];
	ВыбранныйЭлемент = ДополнительныеСвойстваЭлемента.Элемент;
	Возврат ВыбранныйЭлемент;
КонецФункции

&НаКлиенте
Функция ЗагрузитьЭлементы(ЭлементыДляВыбора, ВыбранныеЭлементы)
	
	РК = вмс_РаботаСКоллекциями;
	
	НастройкиКолонок = ПолучитьНастройкиКолонок(ЭлементыДляВыбора);
	
	Контекст = Контекст();
	ДополнительныеСвойстваЭлементов = Контекст.ДополнительныеСвойстваЭлементов;
	
	ТаблицаЭлементов.ПолучитьЭлементы().Очистить();

	ДополнительныеСвойстваЭлементовТаблицы = ДополнительныеСвойстваЭлементов["Элементы"];
	ДополнительныеСвойстваЭлементовТаблицы.Очистить();
	ТекущийЭлементНаФорме = Неопределено;
	Для Каждого ЭлементДляВыбора Из РК.ПолучитьЭлементыКоллекции(ЭлементыДляВыбора) Цикл
		Если УказыватьПорядокЭлементов Тогда
			Если ВыбранныеЭлементы.Найти(ЭлементДляВыбора) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ЭлементНаФорме = ТаблицаЭлементов.ПолучитьЭлементы().Добавить();
		Для Каждого КолонкаДляЗагрузки Из НастройкиКолонок.КолонкиДляЗагрузки Цикл
			ЭлементНаФорме[КолонкаДляЗагрузки.Ключ] = ЭлементДляВыбора[КолонкаДляЗагрузки.Значение];
		КонецЦикла;
		
		Если ВыбранныеЭлементы.Найти(ЭлементДляВыбора) <> Неопределено Тогда
			ЭлементНаФорме.Пометка = Истина;
			Если ТекущийЭлементНаФорме=Неопределено Тогда
				ТекущийЭлементНаФорме = ЭлементНаФорме;
			КонецЕсли;
		КонецЕсли;
				
		ДополнительныеСвойстваЭлемента = Новый Структура;
		ДополнительныеСвойстваЭлемента.Вставить("Элемент", ЭлементДляВыбора);
		ДополнительныеСвойстваЭлементовТаблицы[ЭлементНаФорме.ПолучитьИдентификатор()] = ДополнительныеСвойстваЭлемента;
	КонецЦикла;
	
	Если УказыватьПорядокЭлементов Тогда
		ДополнительныеСвойстваЭлементовТаблицы = ДополнительныеСвойстваЭлементов["ВыбранныеЭлементы"];
		ДополнительныеСвойстваЭлементовТаблицы.Очистить();
		Для Каждого ВыбранныйЭлемент Из ВыбранныеЭлементы Цикл
			ВыбранныйЭлементНаФорме = ТаблицаВыбранныхЭлементов.ПолучитьЭлементы().Добавить();
			Для Каждого КолонкаДляЗагрузки Из НастройкиКолонок.КолонкиДляЗагрузки Цикл
				ВыбранныйЭлементНаФорме[КолонкаДляЗагрузки.Ключ] = ВыбранныйЭлемент[КолонкаДляЗагрузки.Значение];
			КонецЦикла;
			
			ВыбранныйЭлементНаФорме.Пометка = Истина;

			ДополнительныеСвойстваЭлемента = Новый Структура;
			ДополнительныеСвойстваЭлемента.Вставить("Элемент", ВыбранныйЭлемент);
			ДополнительныеСвойстваЭлементовТаблицы[ВыбранныйЭлементНаФорме.ПолучитьИдентификатор()] = ДополнительныеСвойстваЭлемента;
		КонецЦикла;
	КонецЕсли;
	
	Если ТекущийЭлементНаФорме <> Неопределено Тогда
		Элементы.ТаблицаЭлементов.ТекущаяСтрока = ТекущийЭлементНаФорме.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьНастройкиКолонок(ЭлементыДляЗагрузки)
	
	НастройкиКолонок = Новый Структура;
	
	Если НЕ ОпределитьКолонкуТаблицыДляЗагрузки(НастройкиКолонок, "Наименование", "Наименование, ИмяЭлемента, Имя", ЭлементыДляЗагрузки) Тогда
		ВызватьИсключение "Не указана колонка ""Наименование""";
	КонецЕсли;
	ОпределитьКолонкуТаблицыДляЗагрузки(НастройкиКолонок, "Картинка", "Картинка, КартинкаЭлемента", ЭлементыДляЗагрузки);
	ОпределитьКолонкуТаблицыДляЗагрузки(НастройкиКолонок, "Родитель", "Родитель", ЭлементыДляЗагрузки);
	
	КолонкиДляЗагрузки = Новый Соответствие;
	КолонкиДляЗагрузки.Вставить("Наименование", НастройкиКолонок.Наименование);
	Если НастройкиКолонок.Картинка <> Неопределено Тогда
		КолонкиДляЗагрузки.Вставить("Картинка", НастройкиКолонок.Картинка);
	КонецЕсли;
	
	НастройкиКолонок.Вставить("КолонкиДляЗагрузки", КолонкиДляЗагрузки);
	
	Возврат НастройкиКолонок;
	
КонецФункции

&НаКлиенте
Функция ОпределитьКолонкуТаблицыДляЗагрузки(НастройкиКолонок, ИмяНастройкиКолонки, ВариантыКолонки, ЭлементыДляЗагрузки)

	НастройкиКолонок.Вставить(ИмяНастройкиКолонки);
	
	КолонкиТаблицыДляЗагрузки = вмс_РаботаСКоллекциями.ПолучитьКолонкиКоллекции(ЭлементыДляЗагрузки);
	
	НастройкиКолонок[ИмяНастройкиКолонки] = вмс_РаботаСФормамиКлиент.ПолучитьПараметрФормыНаКлиенте(ЭтаФорма, "Колонка" + ИмяНастройкиКолонки);
	
	Если ЗначениеЗаполнено(НастройкиКолонок[ИмяНастройкиКолонки]) Тогда
		Возврат Истина;
	КонецЕсли;
	
	НастройкиКолонок[ИмяНастройкиКолонки] = Неопределено;

	Для Каждого ВариантКолонки Из вмс_РаботаСКоллекциями.ЗначениеВМассив(ВариантыКолонки) Цикл
		Если КолонкиТаблицыДляЗагрузки.Найти(ВариантКолонки) <> Неопределено Тогда
			НастройкиКолонок[ИмяНастройкиКолонки] = ВариантКолонки;
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция Контекст()
	
	ПеременныеФормы = вмс_РаботаСФормамиКлиент.ПолучитьКлиентскиеПеременные(ЭтаФорма);
	Контекст = ПеременныеФормы["Контекст"];
	
	Если Контекст=Неопределено Тогда
		Контекст = Новый Структура;
		
		ДополнительныеСвойстваЭлементовИзмерение1 = Новый Соответствие;
		ДополнительныеСвойстваЭлементовИзмерение1["Элементы"] = Новый Соответствие;
		ДополнительныеСвойстваЭлементовИзмерение1["ВыбранныеЭлементы"] = Новый Соответствие;
		
		Контекст.Вставить("ДополнительныеСвойстваЭлементов", ДополнительныеСвойстваЭлементовИзмерение1);

		ПеременныеФормы["Контекст"] = Контекст;
	КонецЕсли;
	
	Возврат Контекст;
	
КонецФункции
