// { Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
// } Адаптация

Функция ЗагрузитьОписаниеИзНативногоТекстаXML(ТекстXML) Экспорт

	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	СведенияОТипахЭлементовФормы = ПолучитьСведенияОТипахЭлементовФормыНативногоXML();
	ТаблицаТиповЭлементов = СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов;
	ТаблицаСвойствЭлементов = СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов;
	
	СведенияОТипах = Новый Соответствие;
	СведенияОТипах["string"] = "Строка";
	СведенияОТипах["decimal"] = "Число";
	СведенияОТипах["dateTime"] = "Дата";
	СведенияОТипах["boolean"] = "Булево";
	СведенияОТипах["ValueTable"] = "ТаблицаЗначений";
	СведенияОТипах["ValueListType"] = "СписокЗначений";
	СведенияОТипах["FormattedString"] = "ФорматированнаяСтрока";
	
	ПараметрыЗагрузкиНативногоXML = Новый Структура;
	ПараметрыЗагрузкиНативногоXML.Вставить("СведенияОТипах", СведенияОТипах);
	ПараметрыЗагрузкиНативногоXML.Вставить("СведенияОТипахЭлементовФормы", СведенияОТипахЭлементовФормы);
	
	ОписаниеФормы = НовоеОписаниеФормы();
	ЗаполнитьСвойстваОписанияЭлементаПоУмолчанию(ОписаниеФормы, СведенияОТипахЭлементовФормы);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстXML);
	Если Не (ЧтениеXML.Прочитать() И ЧтениеXML.Имя="Form") Тогда
		Возврат ОписаниеФормы;
	КонецЕсли;
	
	ОписаниеЭлемента = ОписаниеФормы;
	ОписаниеРодителя = Неопределено;
	
	СтекЭлементов = Новый Массив;
	
	ЧтениеНовогоЭлемента = Ложь;

	ОтборТипаЭлемента = Новый Структура("ИмяТипаXML");
	ОтборСвойстваЭлемента = Новый Структура("ТипЭлемента, ВидЭлемента, ИмяСвойстваXML");
	
	ЧтениеXML.Прочитать();
	Пока Истина Цикл
		
		ТипУзла = ЧтениеXML.ТипУзла;
		Если ТипУзла=ТипУзлаXML.Ничего Тогда
			Прервать;
		КонецЕсли;
		
		ИмяУзла = ЧтениеXML.Имя;
		Если ЧтениеНовогоЭлемента Тогда
			
			Если ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
				
				// новый подчиненный элемент
				ОтборТипаЭлемента.ИмяТипаXML = ИмяУзла;
				ОписаниеТипаЭлемента = РК.НайтиЭлементКоллекции(ТаблицаТиповЭлементов, ОтборТипаЭлемента);
				Если ОписаниеТипаЭлемента = Неопределено Тогда
					ЧтениеXML.Пропустить();
					ЧтениеXML.Прочитать();
					Продолжить;
				КонецЕсли;

				ОписаниеЭлемента = НовоеОписаниеЭлемента();
				ОписаниеЭлемента.ИмяЭлемента = ЧтениеXML.ЗначениеАтрибута("name");
				ОписаниеЭлемента.ТипЭлемента = ОписаниеТипаЭлемента.ТипЭлемента;
				ОписаниеЭлемента.ВидЭлемента = ОписаниеТипаЭлемента.ВидЭлемента;
				ЗаполнитьСвойстваОписанияЭлементаПоУмолчанию(ОписаниеЭлемента, СведенияОТипахЭлементовФормы);
				ЗаполнитьЗначенияСвойств(ОписаниеЭлемента.Свойства, ОписаниеТипаЭлемента.ЗначенияСвойствЭлементаПоУмолчанию);
				
				ОписаниеРодителя.ПодчиненныеЭлементы.Добавить(ОписаниеЭлемента);
				
			Иначе
				
				// Подчиненные элементы закончились, вернемся к чтению свойств родительского элемента
				ОписаниеЭлемента = ОписаниеРодителя;

				ОписаниеРодителя = СтекЭлементов[СтекЭлементов.ВГраница()];
				СтекЭлементов.Удалить(СтекЭлементов.ВГраница());
				
			КонецЕсли;

			ЧтениеНовогоЭлемента = Ложь;
			ЧтениеXML.Прочитать();
			
		ИначеЕсли ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			
			// чтение свойств элемента
			Если ИмяУзла="ChildItems" Тогда
				
				СтекЭлементов.Добавить(ОписаниеРодителя);
				ОписаниеРодителя = ОписаниеЭлемента;
				
				ЧтениеНовогоЭлемента = Истина;
				ЧтениеXML.Прочитать();
				
			ИначеЕсли ИмяУзла="AutoCommandBar" Тогда
				
				// Свойство содержит вложенный элемент
				// перейдем к его чтению
				СтекЭлементов.Добавить(ОписаниеРодителя);
				ОписаниеРодителя = ОписаниеЭлемента;
				
				ЧтениеНовогоЭлемента = Истина;
				
			ИначеЕсли ИмяУзла="Attributes" Тогда
				
				ЗагрузитьРеквизитыНативногоXML(ЧтениеXML, ОписаниеЭлемента, ПараметрыЗагрузкиНативногоXML);
				
			ИначеЕсли ИмяУзла="Commands" Тогда
				
				ЗагрузитьКомандыНативногоXML(ЧтениеXML, ОписаниеЭлемента, ПараметрыЗагрузкиНативногоXML);
				
			ИначеЕсли ИмяУзла="Events" Тогда
				
				ЗагрузитьСобытияНативногоXML(ЧтениеXML, ОписаниеЭлемента, ПараметрыЗагрузкиНативногоXML);
				
			Иначе
				
				ОтборСвойстваЭлемента.ТипЭлемента = ОписаниеЭлемента.ТипЭлемента;
				ОтборСвойстваЭлемента.ВидЭлемента = ОписаниеЭлемента.ВидЭлемента;
				ОтборСвойстваЭлемента.ИмяСвойстваXML = ИмяУзла;
				ОписаниеСвойстваЭлемента = РК.НайтиЭлементКоллекции(ТаблицаСвойствЭлементов, ОтборСвойстваЭлемента);
				Если ОписаниеСвойстваЭлемента=Неопределено Тогда
					ЧтениеXML.Пропустить();
					ЧтениеXML.Прочитать();
					Продолжить;
				КонецЕсли;
				
				ЗначениеСвойства = ПрочитатьЗначениеСвойстваЭлементаФормыНативногоXML(ЧтениеXML, ОписаниеСвойстваЭлемента, ПараметрыЗагрузкиНативногоXML);
				
				Если ОписаниеСвойстваЭлемента.ИмяСвойства="Вид" Тогда
					// уточнение вида элемента
					ОписаниеТипаЭлемента = РК.НайтиЭлементКоллекции(ТаблицаТиповЭлементов, Новый Структура("ЗначениеСвойстваВидЭлемента", ЗначениеСвойства));
					ОписаниеЭлемента.ВидЭлемента = ОписаниеТипаЭлемента.ВидЭлемента;
					ЗаполнитьСвойстваОписанияЭлементаПоУмолчанию(ОписаниеЭлемента, СведенияОТипахЭлементовФормы);
					ЗаполнитьЗначенияСвойств(ОписаниеЭлемента.Свойства, ОписаниеТипаЭлемента.ЗначенияСвойствЭлементаПоУмолчанию);
				КонецЕсли;
				
				ОписаниеЭлемента.Свойства[ОписаниеСвойстваЭлемента.ИмяСвойства] = ЗначениеСвойства;
				
			КонецЕсли;
			
		Иначе
			
			Если ИмяУзла="AutoCommandBar" Тогда
				// Прочитали вложенный элемент в списке свойств родительского элемента
				// возвращаемся к чтению следующих свойств родительского элемента
				ОписаниеРодителя.Вставить("КоманднаяПанель", ОписаниеЭлемента);
				
				ОписаниеЭлемента = ОписаниеРодителя;
				ОписаниеРодителя = СтекЭлементов[СтекЭлементов.ВГраница()];
				СтекЭлементов.Удалить(СтекЭлементов.ВГраница());
			Иначе
				// свойства элемента закончились, ожидаем чтение следующего элемента
				ЧтениеНовогоЭлемента = Истина;
			КонецЕсли;
			
			ЧтениеXML.Прочитать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьДополнительныеСвойстваОписанияФормы(ОписаниеФормы);
	
	Для Каждого ОписаниеЭлемента Из ОписаниеФормы.Элементы Цикл
		
		Если ОписаниеЭлемента.ТипЭлемента="КнопкаФормы" Тогда
			
			МассивЧастейИмениКоманды = РК.СтрокуВМассив(ОписаниеЭлемента.Свойства.ИмяКоманды, ".");
			ОписаниеЭлемента.Свойства.ИмяКоманды = МассивЧастейИмениКоманды[МассивЧастейИмениКоманды.ВГраница()];
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОписаниеФормы;
	
КонецФункции

Функция ПрочитатьЗначениеСвойстваЭлементаФормыНативногоXML(ЧтениеXML, ОписаниеСвойстваЭлемента, ПараметрыЗагрузкиНативногоXML)
	
	Значение = ПрочитатьЗначениеСвойстваНативногоXML(ЧтениеXML, ОписаниеСвойстваЭлемента.Тип, ПараметрыЗагрузкиНативногоXML);
	Возврат Значение;
	
КонецФункции

Функция ПрочитатьЗначениеСвойстваНативногоXML(ЧтениеXML, Тип, ПараметрыЗагрузкиНативногоXML)
	
	Перем РК, ОбщегоНазначенияКлиентСервер;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	Если Тип="Строка" Тогда
		ЧтениеXML.Прочитать();
		Если ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
			// обычная строка
			Значение = ЧтениеXML.Значение;
			ЧтениеXML.Прочитать();
			ЧтениеXML.Прочитать();
			Возврат Значение;
		ИначеЕсли ЧтениеXML.ТипУзла=ТипУзлаXML.КонецЭлемента Тогда
			// пустая строка
			Значение = "";
			ЧтениеXML.Прочитать();
			Возврат Значение;
		Иначе
			// мультиязычная строка
			Уровень = 1;
			ЧастиСтроки = Новый Массив;
			Пока Истина Цикл
				Если ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
					Уровень = Уровень + 1;
					Имя = ЧтениеXML.Имя;
					Если Имя="v8:item" Тогда
						ЧастьСтроки = Новый Структура("Язык, Содердимое", "", "");
					ИначеЕсли Имя="v8:lang" Тогда
						Имя = "Язык";
					ИначеЕсли Имя="v8:content" Тогда
						Имя = "Содержимое";
					Иначе
						Имя = Неопределено;
					КонецЕсли;
				ИначеЕсли ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
					Если Имя<>Неопределено Тогда
						ЧастьСтроки.Вставить(Имя, ЧтениеXML.Значение);
					КонецЕсли;
				Иначе
					Уровень = Уровень - 1;
					Если Уровень=0 Тогда
						Прервать;
					ИначеЕсли Уровень=1 Тогда
						ЧастиСтроки.Добавить(ЧастьСтроки);
					КонецЕсли;
				КонецЕсли;
				ЧтениеXML.Прочитать();
			КонецЦикла;
			ЧтениеXML.Прочитать();
			
			МультиЯзычнаяСтрока = "";
			Для Каждого ЧастьСтроки Из ЧастиСтроки Цикл
				Если МультиЯзычнаяСтрока<>"" Тогда
					МультиЯзычнаяСтрока = МультиЯзычнаяСтрока + "; ";
				КонецЕсли;
				МультиЯзычнаяСтрока = МультиЯзычнаяСтрока + ЧастьСтроки.Язык + " = '" + ЧастьСтроки.Содержимое + "'";
			КонецЦикла;
			Значение = НСтр(МультиЯзычнаяСтрока);
			Возврат Значение;
		КонецЕсли;
		
	ИначеЕсли Тип="Цвет" Тогда
		
		ЧтениеXML.Прочитать();
		ТекстЦвета = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
		ЧтениеXML.Прочитать();
		
		ЧастиЦвета = РК.СтрокуВМассив(ТекстЦвета, ":");
		Если ЧастиЦвета.Количество() = 1 Тогда
			// абсолютный цвет
			ТипДанныхXML = СериализаторXDTO.XMLТип(Тип(Тип));
			ТипОбъектаXDTO = ФабрикаXDTO.Тип(ТипДанныхXML);
			ЦветXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO, ТекстЦвета);
			Значение = ЦветXDTO.Значение;
		Иначе
			ИмяКоллекцииЦветов = ЧастиЦвета[0];
			ИмяЦвета = ЧастиЦвета[1];
			
			Если ИмяКоллекцииЦветов = "style" Тогда
				Значение = ОбщегоНазначенияКлиентСервер.ЦветСтиля(ИмяЦвета);
			Иначе
				Значение = WebЦвета[ИмяЦвета];
			КонецЕсли;
		КонецЕсли;
		
		Возврат Значение;
		
	ИначеЕсли Тип="ОписаниеТипов" Тогда
		
		МассивИменТипов = Новый Массив;
		
		Пока Истина Цикл
			
			ЧтениеXML.Прочитать();
			Если ЧтениеXML.ТипУзла<>ТипУзлаXML.НачалоЭлемента Тогда
				Если ЧтениеXML.ТипУзла=ТипУзлаXML.КонецЭлемента Тогда
					ЧтениеXML.Прочитать();
				КонецЕсли;
				Прервать;
			КонецЕсли;
			
			Если ЧтениеXML.Имя="v8:Type" Тогда
				ЧтениеXML.Прочитать();
				ИмяТипаXML = ЧтениеXML.Значение;
				ЧтениеXML.Прочитать();
				
				ИмяТипа = ПолучитьИмяТипаИзНативногоXML(ИмяТипаXML, ПараметрыЗагрузкиНативногоXML);
				МассивИменТипов.Добавить(ИмяТипа);
			Иначе
				ЧтениеXML.Пропустить();
			КонецЕсли;
			
		КонецЦикла;
		
		Значение = ОбщегоНазначенияКлиентСервер.НовоеКвазиОписаниеТипов(МассивИменТипов);
		Возврат Значение;
		
	ИначеЕсли Тип="Картинка" Тогда
		
		ЧтениеXML.Прочитать();
		Пока Истина Цикл
			
			Если ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
				Если ЧтениеXML.Имя="xr:Ref" Тогда
					ЧтениеXML.Прочитать();
					ИмяКартинки = ЧтениеXML.Значение;
					ЧтениеXML.Прочитать();
					ЧтениеXML.Прочитать();
					
					ПозицияВТексте = СтрНайти(ИмяКартинки, ".");
					Если ПозицияВТексте>0 Тогда
						ИмяКартинки = Сред(ИмяКартинки, ПозицияВТексте+1);
					КонецЕсли;
					
					Попытка
						Значение = БиблиотекаКартинок[ИмяКартинки];
					Исключение
					КонецПопытки;
				Иначе
					ЧтениеXML.Пропустить();
					ЧтениеXML.Прочитать();
					Продолжить;
				КонецЕсли;
			Иначе
				Если ЧтениеXML.ТипУзла=ТипУзлаXML.КонецЭлемента Тогда
					ЧтениеXML.Прочитать();
				КонецЕсли;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Значение;
		
	Иначе
		
		Если Тип="ОтображениеКнопки" Тогда
			Значение = ПрочитатьЗначениеТипаОтображениеКнопкиXML(ЧтениеXML);
			Возврат Значение;
		КонецЕсли;
		
		НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
		ТипДанныхXML = НовыйСериализаторXDTO.XMLТип(Тип(Тип));
		Если ТипДанныхXML<>Неопределено Тогда
			ТипОбъектаXDTO = ФабрикаXDTO.Тип(ТипДанныхXML);
			ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
			Значение = НовыйСериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);

			Возврат Значение;
		КонецЕсли;
		
		ЧтениеXML.Прочитать();
		Если ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
			ТекстXML = ЧтениеXML.Значение;
			ЧтениеXML.Прочитать();
		Иначе
			ТекстXML = "";
		КонецЕсли;
		ЧтениеXML.Прочитать();
		
		ДанныеТипа = ОбщегоНазначенияКлиентСервер.ПолучитьДанныеТипаОбъекта(Тип);
		Если ДанныеТипа.ЭтоПеречисление Тогда
			Значение = ДанныеТипа.МенеджерОбъектов[ТекстXML];
		Иначе
			Значение = XMLЗначение(Тип(Тип), ТекстXML);
		КонецЕсли;
		
		Возврат Значение;
		
	КонецЕсли;
	
КонецФункции

Функция ПрочитатьЗначениеТипаОтображениеКнопкиXML(ЧтениеXML)

	ЧтениеXML.Прочитать();
	Если ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
		ТекстXML = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
	Иначе
		ТекстXML = "";
	КонецЕсли;
	ЧтениеXML.Прочитать();
	
	Если ТекстXML="TextPicture" Тогда
		ИмяЗначения = "КартинкаИТекст";
	Иначе
		ИмяЗначения = ТекстXML;
	КонецЕсли;
	
	Значение = ОтображениеКнопки[ИмяЗначения];
	
	Возврат Значение;
	
КонецФункции

Функция ЗагрузитьРеквизитыНативногоXML(ЧтениеXML, ОписаниеФормы, ПараметрыЗагрузкиНативногоXML)
	
	Перем РК, ОбщегоНазначенияКлиентСервер;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	ЧтениеНовогоРеквизита = Истина;
	СтекРеквизитов = Новый Массив;
	
	ОписаниеРодителяРеквизита = ОписаниеФормы;
	
	ЧтениеXML.Прочитать();
	Пока Истина Цикл
		
		Если ЧтениеНовогоРеквизита Тогда
			
			Если ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда

				ОписаниеРеквизита = НовоеОписаниеРеквизита();
				ОписаниеРодителяРеквизита.ПодчиненныеРеквизиты.Добавить(ОписаниеРеквизита);
				Если ЧтениеXML.Имя="AdditionalColumns" Тогда
					ОписаниеРеквизита.Статический = Истина;
					ПутьРеквизита = ЧтениеXML.ЗначениеАтрибута("table");
					ПутьРеквизитаМассив = РК.СтрокуВМассив(ПутьРеквизита, ".");
					ОписаниеРеквизита.ИмяРеквизита = ПутьРеквизитаМассив[ПутьРеквизитаМассив.ВГраница()];
					ОписаниеРеквизита.ТипРеквизита = ОбщегоНазначенияКлиентСервер.НовоеКвазиОписаниеТипов("ТабличнаяЧасть");
					
					СтекРеквизитов.Добавить(ОписаниеРодителяРеквизита);
					ОписаниеРодителяРеквизита = ОписаниеРеквизита;
					
					ЧтениеXML.Прочитать();
					Продолжить;
				КонецЕсли;
				
				ОписаниеРеквизита.ИмяРеквизита = ЧтениеXML.ЗначениеАтрибута("name");
				ЧтениеXML.Прочитать();
				
			ИначеЕсли ЧтениеXML.ТипУзла=ТипУзлаXML.КонецЭлемента Тогда
				
				// реквизиты закончились
				Если СтекРеквизитов.Количество() > 0 Тогда
					// вернемся к родительскому реквизиту
					ОписаниеРеквизита = ОписаниеРодителяРеквизита;
					ОписаниеРодителяРеквизита = СтекРеквизитов[СтекРеквизитов.ВГраница()];
					СтекРеквизитов.Удалить(СтекРеквизитов.ВГраница());
				Иначе
					// реквизиты закончились на верхнем уровне, то есть совсем
					ЧтениеXML.Прочитать();
					Возврат Истина;
				КонецЕсли;
			
				Если ЧтениеXML.Имя="AdditionalColumns" Тогда
					// "AdditionalColumns" - это отдельный реквизит
					// сначала достали его из стека, а потом достанем родительский реквизит
					ЧтениеXML.Прочитать();
					Продолжить;
				КонецЕсли;
				
				ЧтениеXML.Прочитать();
				
			Иначе
				
				// что-то пошло не так
				Возврат Ложь;
				
			КонецЕсли;

			ЧтениеНовогоРеквизита = Ложь;
			
		ИначеЕсли ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			
			// чтение свойств реквизита
			Если ЧтениеXML.Имя="Title" Тогда
				Тип = "Строка";
				ИмяСвойства = "Заголовок";
			ИначеЕсли ЧтениеXML.Имя="Type" Тогда
				Тип = "ОписаниеТипов";
				ИмяСвойства = "ТипРеквизита";
			ИначеЕсли ЧтениеXML.Имя="Columns" Тогда
				// чтение вложенных реквизитов
				ЧтениеНовогоРеквизита = Истина;
				СтекРеквизитов.Добавить(ОписаниеРодителяРеквизита);
				ОписаниеРодителяРеквизита = ОписаниеРеквизита;
				ЧтениеXML.Прочитать();
				Продолжить;
			Иначе
				ЧтениеXML.Пропустить();
				ЧтениеXML.Прочитать();
				Продолжить;
			КонецЕсли;
				
			ЗначениеСвойства = ПрочитатьЗначениеСвойстваНативногоXML(ЧтениеXML, Тип, ПараметрыЗагрузкиНативногоXML);
			ОписаниеРеквизита[ИмяСвойства] = ЗначениеСвойства;
			
		ИначеЕсли ЧтениеXML.ТипУзла=ТипУзлаXML.КонецЭлемента Тогда
			
			// свойства реквизита закончились, чтение следующего реквизита
			ЧтениеНовогоРеквизита = Истина;
			ЧтениеXML.Прочитать();

		Иначе
			
			// что-то пошло не так
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьИмяТипаИзНативногоXML(ИмяТипаXML, ПараметрыЗагрузкиНативногоXML)
	
	ПозицияВТексте = СтрНайти(ИмяТипаXML, ":");
	
	Если ПозицияВТексте>0 Тогда
		// да и без префикса понятно, что за тип
		ИмяТипаXML = Сред(ИмяТипаXML, ПозицияВТексте+1);
	КонецЕсли;
	
	ИмяТипа = ПараметрыЗагрузкиНативногоXML.СведенияОТипах[ИмяТипаXML];
	Если ИмяТипа=Неопределено Тогда
		ИмяТипа = ИмяТипаXML;
	КонецЕсли;
	
	Возврат ИмяТипа;
	
КонецФункции

Функция ЗагрузитьКомандыНативногоXML(ЧтениеXML, ОписаниеФормы, ПараметрыЗагрузкиНативногоXML)
	
	ЧтениеXML.Прочитать();
	
	Пока Истина Цикл
		
		Если ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			// новая команда
			ОписаниеКоманды = НовоеОписаниеКоманды();
			ОписаниеКоманды.Имя = ЧтениеXML.ЗначениеАтрибута("name");
			ОписаниеФормы.Команды.Добавить(ОписаниеКоманды);
			
			// свойства команды
			ЧтениеXML.Прочитать();
			Пока Истина Цикл
				
				Если ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
					// начало свойства
					ИмяСвойстваXML = ЧтениеXML.Имя;
					Если ИмяСвойстваXML="Title" Тогда
						Тип = "Строка";
						ИмяСвойства = "Заголовок";
					ИначеЕсли ИмяСвойстваXML="Action" Тогда
						Тип = "Строка";
						ИмяСвойства = "Действие";
					ИначеЕсли ИмяСвойстваXML="Representation" Тогда
						Тип = "ОтображениеКнопки";
						ИмяСвойства = "Отображение";
					ИначеЕсли ИмяСвойстваXML="Picture" Тогда
						Тип = "Картинка";
						ИмяСвойства = "Картинка";
					Иначе
						ЧтениеXML.Пропустить();
						ЧтениеXML.Прочитать();
						Продолжить;
					КонецЕсли;
					
					ЗначениеСвойства = ПрочитатьЗначениеСвойстваНативногоXML(ЧтениеXML, Тип, ПараметрыЗагрузкиНативногоXML);
					ОписаниеКоманды[ИмяСвойства] = ЗначениеСвойства;
				ИначеЕсли ЧтениеXML.ТипУзла=ТипУзлаXML.КонецЭлемента Тогда
					// конец списка свойств
					ЧтениеXML.Прочитать();
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ЧтениеXML.ТипУзла=ТипУзлаXML.КонецЭлемента Тогда
			
			ЧтениеXML.Прочитать();
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ЗагрузитьСобытияНативногоXML(ЧтениеXML, ОписаниеЭлемента, ПараметрыЗагрузкиНативногоXML)
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ТаблицаСобытийЭлементов = ПараметрыЗагрузкиНативногоXML.СведенияОТипахЭлементовФормы.ТаблицаСобытийЭлементов;
	ОтборСобытия = Новый Структура;
	ОтборСобытия.Вставить("ТипЭлемента", ОписаниеЭлемента.ТипЭлемента);
	ОтборСобытия.Вставить("ВидЭлемента", ОписаниеЭлемента.ВидЭлемента);
	ОтборСобытия.Вставить("ИмяСобытияXML");
	
	ЧтениеXML.Прочитать();
	
	Пока Истина Цикл
		
		Если ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			
			ИмяСобытияXML = ЧтениеXML.ЗначениеАтрибута("name");
			ИмяОбработчика = ПрочитатьЗначениеСвойстваНативногоXML(ЧтениеXML, "Строка", ПараметрыЗагрузкиНативногоXML);
			
			ОтборСобытия.ИмяСобытияXML = ИмяСобытияXML;
			ОписаниеСобытия = РК.НайтиЭлементКоллекции(ТаблицаСобытийЭлементов, ОтборСобытия);
			
			Если ОписаниеСобытия<>Неопределено Тогда
				ИмяСобытия = ОписаниеСобытия.ИмяСобытия;
				ОписаниеЭлемента.События.Вставить(ИмяСобытия, ИмяОбработчика);
			КонецЕсли;
			
		ИначеЕсли ЧтениеXML.ТипУзла=ТипУзлаXML.КонецЭлемента Тогда
			
			ЧтениеXML.Прочитать();
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьСведенияОТипахЭлементовФормыНативногоXML()
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	СведенияОТипахЭлементовФормы = ПолучитьСведенияОТипахЭлементовФормы();
	
	ТаблицаТиповЭлементов = СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов;
	РК.ДобавитьКолонкуКоллекции(ТаблицаТиповЭлементов, "ИмяТипаXML");
	РК.ДобавитьИндексКоллекции(ТаблицаТиповЭлементов, "ИмяТипаXML");
	
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "InputField",			"ПолеФормы",		"ПолеВвода");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "CheckBoxField",		"ПолеФормы",		"ПолеФлажка");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "LabelField",			"ПолеФормы",		"ПолеНадписи");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "PictureField",			"ПолеФормы",		"ПолеКартинки");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "LabelDecoration",		"ДекорацияФормы",	"Надпись");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "PictureDecoration",	"ДекорацияФормы",	"Картинка");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "UsualGroup",			"ГруппаФормы",		"ОбычнаяГруппа");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Pages",				"ГруппаФормы",		"Страницы");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Page",					"ГруппаФормы",		"Страница");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "ColumnGroup",			"ГруппаФормы",		"ГруппаКолонок");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "ButtonGroup",			"ГруппаФормы",		"ГруппаКнопок");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Popup",				"ГруппаФормы",		"Подменю");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Button",				"КнопкаФормы",		"");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Table",				"ТаблицаФормы",		"");
	ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "AutoCommandBar",		"ГруппаФормы",		"КоманднаяПанель");
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ТаблицаСвойствЭлементов = СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов;
	РК.ДобавитьКолонкуКоллекции(ТаблицаСвойствЭлементов, "ИмяСвойстваXML");
	РК.ДобавитьИндексКоллекции(ТаблицаСвойствЭлементов, "ТипЭлемента, ВидЭлемента, ИмяСвойстваXML");
	
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Type", "Вид");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Title", "Заголовок");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "TitleLocation", "ПоложениеЗаголовка");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "ShowTitle", "ОтображатьЗаголовок");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "TitleTextColor", "ЦветТекстаЗаголовка");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Visible", "Видимость");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "TitleFont", "ШрифтЗаголовка");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "TextColor", "ЦветТекста");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Font", "Шрифт");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "BackColor", "ЦветФона");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Group", "Группировка");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "United", "Объединенная");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "PagesRepresentation", "ОтображениеСтраниц");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "DataPath", "ПутьКДанным");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "AutoMaxWidth", "АвтоМаксимальнаяШирина");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "AutoMaxHeight", "АвтоМаксимальнаяВысота");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "MaxWidth", "МаксимальнаяШирина");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "MaxHeight", "МаксимальнаяВысота");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Width", "Ширина");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Height", "Высота");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "HorizontalStretch", "РастягиватьПоГоризонтали");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "VerticalStretch", "РастягиватьПоВертикали");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "CommandName", "ИмяКоманды");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Representation", "Отображение");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Picture", "Картинка");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "HorizontalAlign", "ГоризонтальноеПоложение");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "VerticalAlign", "ВертикальноеПоложение");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "GroupHorizontalAlign", "ГоризонтальноеПоложениеВГруппе");
	ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "GroupVerticalAlign", "ВертикальноеПоложениеВГруппе");
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ТаблицаСобытийЭлементов = СведенияОТипахЭлементовФормы.ТаблицаСобытийЭлементов;
	РК.ДобавитьКолонкуКоллекции(ТаблицаСобытийЭлементов, "ИмяСобытияXML");
	РК.ДобавитьИндексКоллекции(ТаблицаСобытийЭлементов, "ТипЭлемента, ВидЭлемента, ИмяСобытияXML");
	
	ЗарегистрироватьСобытиеНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "OnCreateAtServer", "ПриСозданииНаСервере");
	ЗарегистрироватьСобытиеНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "OnOpen", "ПриОткрытии");
	ЗарегистрироватьСобытиеНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "BeforeClose", "ПередЗакрытием");
	ЗарегистрироватьСобытиеНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "OnClose", "ПриЗакрытии");
	ЗарегистрироватьСобытиеНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "OnChange", "ПриИзменении");
	ЗарегистрироватьСобытиеНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "URLProcessing", "ОбработкаНавигационнойСсылки");
	ЗарегистрироватьСобытиеНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "NotificationProcessing", "ОбработкаОповещения");
	ЗарегистрироватьСобытиеНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "OnCurrentPageChange", "ПриСменеСтраницы");
	
	// ТУ_Васильев 20.05.25 ++
	ЗарегистрироватьСобытиеНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, "Selection", "Выбор");
	// ТУ_Васильев 20.05.25 --
	
	Возврат СведенияОТипахЭлементовФормы;
	
КонецФункции

Функция ЗарегистрироватьТипНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, ИмяТипаXML, ТипЭлемента, ВидЭлемента)
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	СтрокаТипаЭлементаФормы = ПолучитьСведенияОТипеЭлементаФормы(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента);
	Если СтрокаТипаЭлементаФормы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаТиповЭлементов = СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов;
	СтрокаНативногоТипаЭлементаФормы = РК.ДобавитьЭлементКоллекции(ТаблицаТиповЭлементов);
	ЗаполнитьЗначенияСвойств(СтрокаНативногоТипаЭлементаФормы, СтрокаТипаЭлементаФормы);
	СтрокаНативногоТипаЭлементаФормы.ИмяТипаXML = ИмяТипаXML;
	РК.ИндексироватьКоллекцию(ТаблицаТиповЭлементов, СтрокаНативногоТипаЭлементаФормы);
	
	Возврат СтрокаНативногоТипаЭлементаФормы;
	
КонецФункции

Функция ЗарегистрироватьИмяСвойстваНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, ИмяСвойстваXML, ИмяСвойства, ТипЭлемента=Неопределено)

	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ТаблицаСвойствЭлементов = СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов;
	ОтборСвойствЭлементов = Новый Структура("ИмяСвойства", ИмяСвойства);
	Если ТипЭлемента<>Неопределено Тогда
		ОтборСвойствЭлементов.Вставить("ТипЭлемента", ТипЭлемента);
	КонецЕсли;
	
	СтрокиСвойств = РК.НайтиЭлементыКоллекции(ТаблицаСвойствЭлементов, ОтборСвойствЭлементов);
	Для Каждого СтрокаСвойства Из СтрокиСвойств Цикл
		СтрокаСвойства.ИмяСвойстваXML = ИмяСвойстваXML;
	КонецЦикла;
	РК.ИндексироватьКоллекцию(ТаблицаСвойствЭлементов, СтрокиСвойств);
	
	Возврат СтрокиСвойств;
	
КонецФункции

Функция ЗарегистрироватьСобытиеНативногоЭлементаФормы(СведенияОТипахЭлементовФормы, ИмяСобытияXML, ИмяСобытия)

	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ОтборСобытий = Новый Структура;
	ОтборСобытий.Вставить("ИмяСобытия", ИмяСобытия);
	
	НайденныеСобытия = РК.НайтиЭлементыКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСобытийЭлементов, ОтборСобытий);
	Для Каждого Событие Из НайденныеСобытия Цикл
		Событие.ИмяСобытияXML = ИмяСобытияXML;
	КонецЦикла;
	РК.ИндексироватьКоллекцию(СведенияОТипахЭлементовФормы.ТаблицаСобытийЭлементов, НайденныеСобытия);
	
КонецФункции

Функция НовоеОписаниеФормы() Экспорт
	
	ОписаниеФормы = НовоеОписаниеЭлемента();
	ОписаниеФормы.ИмяЭлемента = "Форма";
	ОписаниеФормы.ТипЭлемента = "ФормаКлиентскогоПриложения";
	ОписаниеФормы.Вставить("ПодчиненныеРеквизиты", Новый Массив);
	ОписаниеФормы.Вставить("Команды", Новый Массив);
	ОписаниеФормы.Вставить("ТекстМодуля", "");
	ОписаниеФормы.Вставить("Реквизиты", Новый Массив);
	
	Возврат ОписаниеФормы;
	
КонецФункции

// тут заполняются свойства элементов и реквизитов на основе главных свойств
Функция ЗаполнитьДополнительныеСвойстваОписанияФормы(ОписаниеФормы) Экспорт
	
	ОписаниеФормы.Родитель = Неопределено;
	
	ОбходЭлементов = Новый Массив;
	ОбходЭлементов.Добавить(ОписаниеФормы);
	Для Каждого ОписаниеЭлемента Из ОбходЭлементов Цикл
		
		ОписаниеРодителя = ОписаниеЭлемента.Родитель;
		Пока ОписаниеРодителя<>Неопределено Цикл
			ОписаниеРодителя.Элементы.Добавить(ОписаниеЭлемента);
			ОписаниеРодителя = ОписаниеРодителя.Родитель;
		КонецЦикла;
		
		ОписаниеЭлемента.Элементы.Очистить();
		
		Для Каждого ОписаниеПодчиненногоЭлемента Из ОписаниеЭлемента.ПодчиненныеЭлементы Цикл
			ОписаниеПодчиненногоЭлемента.Родитель = ОписаниеЭлемента;
			ОбходЭлементов.Добавить(ОписаниеПодчиненногоЭлемента);
		КонецЦикла;
		
	КонецЦикла;
	
	ОбходРеквизитов = Новый Массив;
	ОписаниеФормы.Реквизиты.Очистить();
	Для Каждого ОписаниеРеквизита Из ОписаниеФормы.ПодчиненныеРеквизиты Цикл
		ОписаниеРеквизита.Путь = "";
		ОписаниеРеквизита.ПолноеИмяРеквизита = ОписаниеРеквизита.ИмяРеквизита;
		ОписаниеРеквизита.Родитель = ОписаниеФормы;
		ОбходРеквизитов.Добавить(ОписаниеРеквизита);
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из ОбходРеквизитов Цикл
		ОписаниеРодителя = ОписаниеРеквизита.Родитель;
		Пока ОписаниеРодителя<>Неопределено Цикл
			ОписаниеРодителя.Реквизиты.Добавить(ОписаниеРеквизита);
			ОписаниеРодителя = ОписаниеРодителя.Родитель;
		КонецЦикла;
		
		ОписаниеРеквизита.Реквизиты.Очистить();
		Для Каждого ОписаниеПодчиненногоРеквизита Из ОписаниеРеквизита.ПодчиненныеРеквизиты Цикл
			ОписаниеПодчиненногоРеквизита.Родитель = ОписаниеРеквизита;
			ОписаниеПодчиненногоРеквизита.Путь = ОписаниеРеквизита.ПолноеИмяРеквизита;
			ОписаниеПодчиненногоРеквизита.ПолноеИмяРеквизита = ОписаниеПодчиненногоРеквизита.Путь + "." + ОписаниеПодчиненногоРеквизита.ИмяРеквизита;
			ОбходРеквизитов.Добавить(ОписаниеПодчиненногоРеквизита);
		КонецЦикла;
	КонецЦикла;
	
КонецФункции

Функция НовоеОписаниеРеквизита() Экспорт
	
	ОписаниеРеквизита = Новый Структура;
	ОписаниеРеквизита.Вставить("ИмяРеквизита", "");
	ОписаниеРеквизита.Вставить("ТипРеквизита");
	ОписаниеРеквизита.Вставить("Заголовок", "");
	ОписаниеРеквизита.Вставить("Путь", "");
	ОписаниеРеквизита.Вставить("ПолноеИмяРеквизита", "");
	ОписаниеРеквизита.Вставить("Родитель");
	ОписаниеРеквизита.Вставить("ПодчиненныеРеквизиты", Новый Массив);
	ОписаниеРеквизита.Вставить("Реквизиты", Новый Массив);
	ОписаниеРеквизита.Вставить("Статический", Ложь);
	
	Возврат ОписаниеРеквизита;
	
КонецФункции

Функция НовоеОписаниеКоманды() Экспорт
	
	ОписаниеКоманды = Новый Структура;
	ОписаниеКоманды.Вставить("Имя", "");
	ОписаниеКоманды.Вставить("Заголовок", "");
	ОписаниеКоманды.Вставить("Действие", "");
	ОписаниеКоманды.Вставить("Картинка", Новый Картинка);
	ОписаниеКоманды.Вставить("Отображение", ОтображениеКнопки.Авто);
	
	Возврат ОписаниеКоманды;
	
КонецФункции

Функция НовоеОписаниеЭлемента() Экспорт
	
	ОписаниеЭлемента = Новый Структура;
	ОписаниеЭлемента.Вставить("ИмяЭлемента", "");
	ОписаниеЭлемента.Вставить("ТипЭлемента", "");
	ОписаниеЭлемента.Вставить("ВидЭлемента", "");
	ОписаниеЭлемента.Вставить("Свойства", Новый Структура);
	ОписаниеЭлемента.Вставить("События", Новый Структура);
	ОписаниеЭлемента.Вставить("Реквизит");
	
	ОписаниеЭлемента.Вставить("Родитель");
	ОписаниеЭлемента.Вставить("ПодчиненныеЭлементы", Новый Массив);
	ОписаниеЭлемента.Вставить("Элементы", Новый Массив);

	Возврат ОписаниеЭлемента;
	
КонецФункции

Функция ЗаполнитьСвойстваОписанияЭлементаПоУмолчанию(ОписаниеЭлемента, СведенияОТипахЭлементовФормы) Экспорт
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	СвойстваЭлемента = РК.НайтиЭлементыКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов, Новый Структура("ТипЭлемента, ВидЭлемента", ОписаниеЭлемента.ТипЭлемента, ОписаниеЭлемента.ВидЭлемента));
	ОписаниеЭлемента.Свойства.Очистить();
	Для Каждого СвойствоЭлемента Из СвойстваЭлемента Цикл
		ОписаниеЭлемента.Свойства.Вставить(СвойствоЭлемента.ИмяСвойства, СвойствоЭлемента.ЗначениеПоУмолчанию);
	КонецЦикла;
	
КонецФункции

Функция ЗарегистрироватьТипЭлементаГруппаФормы(СведенияОТипахЭлементовФормы)
	
	КартинкаГруппы = БиблиотекаКартинок.вмс_Папка;

	
	// ------------------------------
	ЗарегистрироватьТипЭлементаФормы(СведенияОТипахЭлементовФормы, "ГруппаФормы", "Группа", КартинкаГруппы, Ложь);

	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Имя", "Имя", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Вид", "Вид", "ВидГруппыФормы", ВидГруппыФормы.ОбычнаяГруппа);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Заголовок", "Заголовок", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Видимость", "Видимость", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "РастягиватьПоГоризонтали", "Растягивать по горизонтали", "Булево", Неопределено, ПолучитьСписокЗначенийБулевоПлюсНеопределено());
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "РастягиватьПоВертикали", "Растягивать по вертикали", "Булево", Неопределено, ПолучитьСписокЗначенийБулевоПлюсНеопределено());
	
	
	// ------------------------------
	ПодчиненныеТипыЭлементовОбычнойГруппы =
	"ГруппаФормы, ОбычнаяГруппа, Страницы
	|ПолеФормы, ПолеВвода, ПолеФлажка, ПолеНадписи, ПолеКартинки
	|ДекорацияФормы, Надпись, Картинка
	|КнопкаФормы, ОбычнаяКнопка, Гиперссылка
	|ТаблицаФормы";
	
	ПодчиненныеТипыЭлементовКоманднойПанели =
	"ГруппаФормы, ГруппаКнопок, Подменю
	|КнопкаФормы, КнопкаКоманднойПанели";
	
	// ------------------------------
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "ОбычнаяГруппа", "Группа - обычная", КартинкаГруппы, Истина);
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "ОбычнаяГруппа", "Группа - обычная без отображения", КартинкаГруппы, Истина, Новый Структура("Отображение, ОтображатьЗаголовок", ОтображениеОбычнойГруппы.Нет, Ложь));
	
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, ПодчиненныеТипыЭлементовОбычнойГруппы);

	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Группировка", "Группировка", "ГруппировкаПодчиненныхЭлементовФормы", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Отображение", "Отображение", "ОтображениеОбычнойГруппы", ОтображениеОбычнойГруппы.ОбычноеВыделение);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ОтображатьЗаголовок", "Отображать заголовок", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Объединенная", "Объединенная", "Булево", Истина);

	
	// ------------------------------
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "Страницы", "Группа - страницы", КартинкаГруппы, Истина);
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, "ГруппаФормы, Страница");

	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ОтображениеСтраниц", "Отображение страниц", "ОтображениеСтраницФормы", ОтображениеСтраницФормы.ЗакладкиСверху);
	
	ЗарегистрироватьСобытиеЭлементаФормы(СведенияОТипахЭлементовФормы, "ПриСменеСтраницы");
	
	// ------------------------------
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "Страница", "Группа - страница", КартинкаГруппы, Истина, Новый Структура("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная));
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, ПодчиненныеТипыЭлементовОбычнойГруппы);
	
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Группировка", "Группировка", "ГруппировкаПодчиненныхЭлементовФормы", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ОтображатьЗаголовок", "Отображать заголовок", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Картинка", "Картинка", "Картинка", Новый Картинка);
	
	
	//ГруппаКолонок
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "ГруппаКолонок", "Группа колонок", КартинкаГруппы, Истина);
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, "ГруппаФормы, ГруппаКолонок");
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, "ПолеФормы, ПолеВвода, ПолеФлажка, ПолеНадписи, ПолеКартинки");
	
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Группировка", "Группировка", "ГруппировкаКолонок", ГруппировкаКолонок.Горизонтальная);
	
	//КоманднаяПанель
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "КоманднаяПанель", "Группа - командная панель", КартинкаГруппы, Истина);
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, ПодчиненныеТипыЭлементовКоманднойПанели);
	
	//ГруппаКнопок
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "ГруппаКнопок", "Группа кнопок", КартинкаГруппы, Истина);
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, ПодчиненныеТипыЭлементовКоманднойПанели);
	
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Отображение", "Отображение", "ОтображениеГруппыКнопок", ОтображениеГруппыКнопок.Авто);
	
	//Подменю
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "Подменю", "Подменю", КартинкаГруппы, Истина);
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, ПодчиненныеТипыЭлементовКоманднойПанели);

	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Отображение", "Отображение", "ОтображениеКнопки", ОтображениеКнопки.Авто);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Картинка", "Картинка", "Картинка", Новый Картинка);
	
КонецФункции

Функция ЗарегистрироватьТипЭлементаДекорацияФормы(СведенияОТипахЭлементовФормы)
	
	Перем ОбщегоНазначенияКлиентСервер;
	
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	ЗарегистрироватьТипЭлементаФормы(СведенияОТипахЭлементовФормы, "ДекорацияФормы", "Декорация", БиблиотекаКартинок.вмс_ОформлениеКругЖелтый);

	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Имя", "Имя", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Вид", "Вид", "ВидДекорацииФормы", ВидДекорацииФормы.Надпись);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Заголовок", "Заголовок", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Видимость", "Видимость", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Шрифт", "Шрифт", "Шрифт", Новый Шрифт);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Ширина", "Ширина", "Число", 0);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Высота", "Высота", "Число", 0);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ГоризонтальноеПоложениеВГруппе", "Горизонтальное положение в группе", "ГоризонтальноеПоложениеЭлемента", ГоризонтальноеПоложениеЭлемента.Авто);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ВертикальноеПоложениеВГруппе", "Вертикальное положение в группе", "ВертикальноеПоложениеЭлемента", ВертикальноеПоложениеЭлемента.Авто);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ГоризонтальноеПоложение", "Горизонтальное положение", "ГоризонтальноеПоложениеЭлемента", ГоризонтальноеПоложениеЭлемента.Авто);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ВертикальноеПоложение", "Вертикальное положение", "ВертикальноеПоложениеЭлемента", ВертикальноеПоложениеЭлемента.Авто);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "АвтоМаксимальнаяШирина", "Авто максимальная ширина", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "АвтоМаксимальнаяВысота", "Авто максимальная высота", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "МаксимальнаяШирина", "Максимальная ширина", "Число", 0);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "МаксимальнаяВысота", "Максимальная высота", "Число", 0);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "РастягиватьПоГоризонтали", "Растягивать по горизонтали", "Булево", Неопределено, ПолучитьСписокЗначенийБулевоПлюсНеопределено());
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "РастягиватьПоВертикали", "Растягивать по вертикали", "Булево", Неопределено, ПолучитьСписокЗначенийБулевоПлюсНеопределено());
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Картинка", "Картинка", "Картинка", Новый Картинка);
	
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "Надпись", "Декорация - надпись", БиблиотекаКартинок.вмс_ОформлениеКругЖелтый, Ложь);
	
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "Картинка", "Декорация - картинка", БиблиотекаКартинок.вмс_ОформлениеКругЖелтый, Ложь);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "РазмерКартинки", "Размер картинки", "РазмерКартинки", РазмерКартинки.АвтоРазмер);
	
КонецФункции

Функция ЗарегистрироватьТипЭлементаПолеФормы(СведенияОТипахЭлементовФормы)
	
	Картинка = БиблиотекаКартинок.вмс_ПолеФормы;
	
	ЗарегистрироватьТипЭлементаФормы(СведенияОТипахЭлементовФормы, "ПолеФормы", "Поле", Картинка);

	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Имя", "Имя", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Зависимый", , "Булево", Ложь, , Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Вид", "Вид", "ВидПоляФормы", ВидПоляФормы.ПолеВвода);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ЦветФона", "Цвет фона", "Цвет", Новый Цвет);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ПутьКДанным", "Путь к данным", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ПоложениеЗаголовка", "Положение заголовка", "ПоложениеЗаголовкаЭлементаФормы", ПоложениеЗаголовкаЭлементаФормы.Авто);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Заголовок", "Заголовок", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Видимость", "Видимость", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Ширина", "Ширина", "Число", 0);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Высота", "Высота", "Число", 0);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ГоризонтальноеПоложениеВГруппе", "Горизонтальное положение в группе", "ГоризонтальноеПоложениеЭлемента", ГоризонтальноеПоложениеЭлемента.Авто);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ВертикальноеПоложениеВГруппе", "Вертикальное положение в группе", "ВертикальноеПоложениеЭлемента", ВертикальноеПоложениеЭлемента.Авто);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ГоризонтальноеПоложение", "Горизонтальное положение", "ГоризонтальноеПоложениеЭлемента", ГоризонтальноеПоложениеЭлемента.Авто);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ВертикальноеПоложение", "Вертикальное положение", "ВертикальноеПоложениеЭлемента", ВертикальноеПоложениеЭлемента.Авто);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "АвтоМаксимальнаяШирина", "Авто максимальная ширина", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "АвтоМаксимальнаяВысота", "Авто максимальная высота", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "МаксимальнаяШирина", "Максимальная ширина", "Число", 0);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "МаксимальнаяВысота", "Максимальная высота", "Число", 0);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "РастягиватьПоГоризонтали", "Растягивать по горизонтали", "Булево", Неопределено, ПолучитьСписокЗначенийБулевоПлюсНеопределено());
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "РастягиватьПоВертикали", "Растягивать по вертикали", "Булево", Неопределено, ПолучитьСписокЗначенийБулевоПлюсНеопределено());
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ШрифтЗаголовка", "Шрифт заголовка", "Шрифт", Новый Шрифт);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ЦветТекстаЗаголовка", "Цвет текста заголовка", "Цвет", Новый Цвет);
	
	ЗарегистрироватьСобытиеЭлементаФормы(СведенияОТипахЭлементовФормы, "ПриИзменении");
	
	// -----------------------
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "ПолеВвода", "Поле ввода", Картинка, Ложь);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Шрифт", "Шрифт", "Шрифт", Новый Шрифт);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ЦветТекста", "Цвет текста", "Цвет", Новый Цвет);
	
	
	// -----------------------
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "ПолеНадписи", "Поле надписи", Картинка, Ложь);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Шрифт", "Шрифт", "Шрифт", Новый Шрифт);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ЦветТекста", "Цвет текста", "Цвет", Новый Цвет);

	ЗарегистрироватьСобытиеЭлементаФормы(СведенияОТипахЭлементовФормы, "ОбработкаНавигационнойСсылки");
	
	// -----------------------
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "ПолеФлажка", "Поле флажка", Картинка, Ложь);
	
	
	// -----------------------
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "ПолеКартинки", "Поле картинки", Картинка, Ложь);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "РазмерКартинки", "Размер картинки", "РазмерКартинки", РазмерКартинки.АвтоРазмер);
	
КонецФункции

Функция ЗарегистрироватьТипЭлементаКнопкаФормы(СведенияОТипахЭлементовФормы)
	
	Картинка = БиблиотекаКартинок.вмс_КнопкаФормы;
	
	ЗарегистрироватьТипЭлементаФормы(СведенияОТипахЭлементовФормы, "КнопкаФормы", "Кнопка", Картинка);
                                                                         
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Имя", "Имя", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Вид", "Вид", "ВидКнопкиФормы", ВидКнопкиФормы.ОбычнаяКнопка);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Заголовок", "Заголовок", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Видимость", "Видимость", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Отображение", "Отображение", "ОтображениеКнопки", ОтображениеКнопки.Авто);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ИмяКоманды", "Имя команды", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Ширина", "Ширина", "Число", 0);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Высота", "Высота", "Число", 0);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "АвтоМаксимальнаяШирина", "Авто максимальная ширина", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "АвтоМаксимальнаяВысота", "Авто максимальная высота", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "МаксимальнаяШирина", "Максимальная ширина", "Число", 0);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "МаксимальнаяВысота", "Максимальная высота", "Число", 0);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "РастягиватьПоГоризонтали", "Растягивать по горизонтали", "Булево", Неопределено, ПолучитьСписокЗначенийБулевоПлюсНеопределено());
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "РастягиватьПоВертикали", "Растягивать по вертикали", "Булево", Неопределено, ПолучитьСписокЗначенийБулевоПлюсНеопределено());
	
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "ОбычнаяКнопка", "Кнопка - обычная", Картинка, Ложь);
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "Гиперссылка", "Кнопка - Гиперссылка", Картинка, Ложь);
	ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "КнопкаКоманднойПанели", "Кнопка командной панели", Картинка, Ложь);
	
КонецФункции

Функция ЗарегистрироватьТипТаблицаФормы(СведенияОТипахЭлементовФормы)

	ЗарегистрироватьТипЭлементаФормы(СведенияОТипахЭлементовФормы, "ТаблицаФормы", "Таблица", БиблиотекаКартинок.вмс_Таблица);

	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Имя", "Имя", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Отображение", "Отображение", "ОтображениеТаблицы", ОтображениеТаблицы.Список);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Заголовок", "Заголовок", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Видимость", "Видимость", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "ПутьКДанным", "Путь к данным", "Строка", "");
	
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, "ГруппаФормы, ГруппаКолонок, КоманднаяПанель");
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, "ПолеФормы, ПолеВвода, ПолеФлажка, ПолеНадписи, ПолеКартинки");
	
	// ТУ_Васильев 20.05.25 ++
		ЗарегистрироватьСобытиеЭлементаФормы(СведенияОТипахЭлементовФормы, "Выбор");
	// ТУ_Васильев 20.05.25 --

КонецФункции


Функция ЗарегистрироватьТипЭлементаФормы(СведенияОТипахЭлементовФормы, ИмяТипа, ПредставлениеТипаЭлемента, Картинка, ДоступенДляВыбора=Истина)

	СведенияОТипахЭлементовФормы.ТекущийТипЭлемента = ИмяТипа;
	
	СтрокаТипаЭлемента = ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, "", ПредставлениеТипаЭлемента, Картинка, ДоступенДляВыбора);
	
	Возврат СтрокаТипаЭлемента;
	
КонецФункции

Функция ЗарегистрироватьВидЭлементаФормы(СведенияОТипахЭлементовФормы, ВидЭлемента, ПредставлениеВидаЭлемента, Картинка, ДоступенДляВыбора=Истина, ЗначенияСвойствЭлементаПоУмолчанию=Неопределено)

	РК = глОбщийМодуль("РаботаСКоллекциями");

	ТаблицаТиповЭлементов = СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов;
	ТипЭлемента = СведенияОТипахЭлементовФормы.ТекущийТипЭлемента;
	
	СтрокаТипаЭлемента = РК.ДобавитьЭлементКоллекции(ТаблицаТиповЭлементов);
	СтрокаТипаЭлемента.ТипЭлемента = ТипЭлемента;
	СтрокаТипаЭлемента.ВидЭлемента = ВидЭлемента;
	СтрокаТипаЭлемента.Представление = ПредставлениеВидаЭлемента;
	СтрокаТипаЭлемента.Картинка = Картинка;
	СтрокаТипаЭлемента.ДоступенДляВыбора = ДоступенДляВыбора;
	СтрокаТипаЭлемента.ЗначенияСвойствЭлементаПоУмолчанию = Новый Структура;
	
	Если ТипЗнч(ЗначенияСвойствЭлементаПоУмолчанию)=Тип("Структура") Тогда
		Для Каждого ЗначениеСвойства Из ЗначенияСвойствЭлементаПоУмолчанию Цикл
			СтрокаТипаЭлемента.ЗначенияСвойствЭлементаПоУмолчанию.Вставить(ЗначениеСвойства.Ключ, ЗначениеСвойства.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если ВидЭлемента <> "" Тогда
		// скопировать общие свойства
		ОбщиеСвойства = ПолучитьСвойстваЭлементаФормы(СведенияОТипахЭлементовФормы, ТипЭлемента, "");
		Для Каждого ОбщееСвойство Из ОбщиеСвойства Цикл
			Если РК.НайтиЭлементКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов, Новый Структура("ТипЭлемента, ВидЭлемента, ИмяСвойства", ТипЭлемента, ВидЭлемента, ОбщееСвойство.ИмяСвойства))<>Неопределено Тогда
				Продолжить;
			КонецЕсли;			
			СтрокаСвойства = РК.ДобавитьЭлементКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов);
			ЗаполнитьЗначенияСвойств(СтрокаСвойства, ОбщееСвойство);
			СтрокаСвойства.ВидЭлемента = ВидЭлемента;
			РК.ИндексироватьКоллекцию(СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов, СтрокаСвойства);
		КонецЦикла;

		// заполнить значение вида элемента
		СвойствоВидЭлемента = ПолучитьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента, "Вид");
		Если СвойствоВидЭлемента <> Неопределено Тогда
			ПеречислениеВидовЭлемента = Вычислить(СвойствоВидЭлемента.Тип);
			СтрокаТипаЭлемента.ЗначениеСвойстваВидЭлемента = ПеречислениеВидовЭлемента[ВидЭлемента];
			СтрокаТипаЭлемента.ПредставлениеЗначенияСвойстваВидЭлемента = Строка(СтрокаТипаЭлемента.ЗначениеСвойстваВидЭлемента);
			СвойствоВидЭлемента.ЗначениеПоУмолчанию = ПеречислениеВидовЭлемента[ВидЭлемента];
		Иначе
			СтрокаТипаЭлемента.ПредставлениеЗначенияСвойстваВидЭлемента = "";
		КонецЕсли;

		// скопировать общие события
		ОбщиеСобытия = ПолучитьСобытияЭлементаФормы(СведенияОТипахЭлементовФормы, ТипЭлемента, "");
		Для Каждого ОбщееСобытие Из ОбщиеСобытия Цикл
			Если РК.НайтиЭлементКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСобытийЭлементов, Новый Структура("ТипЭлемента, ВидЭлемента, ИмяСобытия", ТипЭлемента, ВидЭлемента, ОбщееСобытие.ИмяСобытия))<>Неопределено Тогда
				Продолжить;
			КонецЕсли;			
			СтрокаСобытия = РК.ДобавитьЭлементКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСобытийЭлементов);
			ЗаполнитьЗначенияСвойств(СтрокаСобытия, ОбщееСобытие);
			СтрокаСобытия.ВидЭлемента = ВидЭлемента;
			РК.ИндексироватьКоллекцию(СведенияОТипахЭлементовФормы.ТаблицаСобытийЭлементов, СтрокаСобытия);
		КонецЦикла;
	КонецЕсли;

	РК.ИндексироватьКоллекцию(ТаблицаТиповЭлементов, СтрокаТипаЭлемента);
	
	СведенияОТипахЭлементовФормы.ТекущийВидЭлемента = ВидЭлемента;
	
	Если СтрокаТипаЭлемента.ЗначениеСвойстваВидЭлемента <> Неопределено Тогда
		СведенияОТипахЭлементовФормы.ВидыЭлементовПоЗначениям[СтрокаТипаЭлемента.ЗначениеСвойстваВидЭлемента] = Новый Структура("ТипЭлемента, ВидЭлемента", ТипЭлемента, ВидЭлемента);
	КонецЕсли;
	
	Возврат СтрокаТипаЭлемента;
	
КонецФункции

Функция ПолучитьСведенияОТипеЭлементаФормы(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента) Экспорт

	РК = глОбщийМодуль("РаботаСКоллекциями");

	Возврат РК.НайтиЭлементКоллекции(СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов, Новый Структура("ТипЭлемента, ВидЭлемента", ТипЭлемента, ВидЭлемента));
	
КонецФункции

Функция ПолучитьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента="", ИмяСвойства) Экспорт

	РК = глОбщийМодуль("РаботаСКоллекциями");

	СвойствоЭлемента = РК.НайтиЭлементКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов, Новый Структура("ТипЭлемента, ВидЭлемента, ИмяСвойства", ТипЭлемента, ВидЭлемента, ИмяСвойства));
	
	Возврат СвойствоЭлемента;
	
КонецФункции

Функция ПолучитьСвойстваЭлементаФормы(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента="") Экспорт
	
	РК = глОбщийМодуль("РаботаСКоллекциями");

	МассивСвойств = РК.НайтиЭлементыКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов, Новый Структура("ТипЭлемента, ВидЭлемента", ТипЭлемента, ВидЭлемента));
	
	Возврат МассивСвойств;
	
КонецФункции

Функция ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, ИмяСвойства, знач ПредставлениеСвойства=Неопределено, знач Тип=Неопределено, ЗначениеПоУмолчанию=Неопределено, знач СписокВыбора=Неопределено, СистемноеСвойство=Ложь) Экспорт

	Перем РК, ОбщегоНазначенияКлиентСервер;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	Если СписокВыбора=Неопределено Тогда
		ДанныеТипаОбъекта = ОбщегоНазначенияКлиентСервер.ПолучитьДанныеТипаОбъекта(Тип);
		Если ДанныеТипаОбъекта.ЭтоПеречисление И ДанныеТипаОбъекта.МенеджерОбъектов<>Неопределено Тогда
			СписокВыбора = Новый СписокЗначений;
			Для Каждого ЭлементПеречисления Из ДанныеТипаОбъекта.МенеджерОбъектов Цикл
				СписокВыбора.Добавить(ЭлементПеречисления, Строка(ЭлементПеречисления));
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаСвойства = РК.ДобавитьЭлементКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов);
	СтрокаСвойства.ТипЭлемента = СведенияОТипахЭлементовФормы.ТекущийТипЭлемента;
	СтрокаСвойства.ВидЭлемента = СведенияОТипахЭлементовФормы.ТекущийВидЭлемента;
	СтрокаСвойства.ИмяСвойства = ИмяСвойства;
	СтрокаСвойства.ПредставлениеСвойства = ПредставлениеСвойства;
	СтрокаСвойства.Тип = Тип;
	СтрокаСвойства.ЗначениеПоУмолчанию = ЗначениеПоУмолчанию;
	СтрокаСвойства.СписокВыбора = СписокВыбора;
	СтрокаСвойства.НесколькоЗначений = Ложь;
	СтрокаСвойства.СистемноеСвойство = СистемноеСвойство;
	СтрокаСвойства.СлабаяСсылка = Ложь;
	РК.ИндексироватьКоллекцию(СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов, СтрокаСвойства);
	
	Возврат СтрокаСвойства;
	
КонецФункции

Функция УдалитьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, ИмяСвойства) Экспорт

	РК = глОбщийМодуль("РаботаСКоллекциями");

	Свойство = РК.НайтиЭлементыКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов, Новый Структура("ТипЭлемента, ВидЭлемента, ИмяСвойства", СведенияОТипахЭлементовФормы.ТекущийТипЭлемента, СведенияОТипахЭлементовФормы.ТекущийВидЭлемента, ИмяСвойства));
	РК.УдалитьЭлементыКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов, Свойство);
	
КонецФункции

Функция ПолучитьСобытияЭлементаФормы(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента="") Экспорт

	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	СтрокиСобытий = РК.НайтиЭлементыКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСобытийЭлементов, Новый Структура("ТипЭлемента, ВидЭлемента", ТипЭлемента, ВидЭлемента));
	
	Возврат СтрокиСобытий;

КонецФункции

Функция ЗарегистрироватьСобытиеЭлементаФормы(СведенияОТипахЭлементовФормы, ИмяСобытия)
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	СтрокаСобытияЭлемента = РК.ДобавитьЭлементКоллекции(СведенияОТипахЭлементовФормы.ТаблицаСобытийЭлементов);
	СтрокаСобытияЭлемента.ТипЭлемента = СведенияОТипахЭлементовФормы.ТекущийТипЭлемента;
	СтрокаСобытияЭлемента.ВидЭлемента = СведенияОТипахЭлементовФормы.ТекущийВидЭлемента;
	СтрокаСобытияЭлемента.ИмяСобытия = ИмяСобытия;
	РК.ИндексироватьКоллекцию(СведенияОТипахЭлементовФормы.ТаблицаСобытийЭлементов, СтрокаСобытияЭлемента);
	
	Возврат СтрокаСобытияЭлемента;
	
КонецФункции

Функция ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, ПодчиненныеТипыЭлементов) Экспорт
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	МассивПодчиненныхТиповЭлементов = РК.СтрокуВМассив(ПодчиненныеТипыЭлементов, Символы.ПС);
	
	ДанныеЭлемента = Новый Структура("ТипЭлемента, ВидЭлемента, ТипПодчиненногоЭлемента, ВидПодчиненногоЭлемента");
	ДанныеЭлемента.ТипЭлемента = СведенияОТипахЭлементовФормы.ТекущийТипЭлемента;
	ДанныеЭлемента.ВидЭлемента = СведенияОТипахЭлементовФормы.ТекущийВидЭлемента;
	
	Для Каждого ПодчиненныйТипЭлемента Из МассивПодчиненныхТиповЭлементов Цикл
		
		МассивСвойствПодчиненногоТипаЭлемента = РК.СтрокуВМассив(ПодчиненныйТипЭлемента, ",");
		ДанныеЭлемента.ТипПодчиненногоЭлемента = МассивСвойствПодчиненногоТипаЭлемента[0];
		Если МассивСвойствПодчиненногоТипаЭлемента.Количество() < 2 Тогда
			// вид элемента не указан, добавим пустой вид
			МассивСвойствПодчиненногоТипаЭлемента.Добавить("");
		КонецЕсли;
		
		Для НомерСвойства=1 По МассивСвойствПодчиненногоТипаЭлемента.ВГраница() Цикл
			ДанныеЭлемента.ВидПодчиненногоЭлемента = МассивСвойствПодчиненногоТипаЭлемента[НомерСвойства];
			РК.ДобавитьЭлементКоллекции(СведенияОТипахЭлементовФормы.ТаблицаДопустимостиИерархииЭлементов, ДанныеЭлемента);
		КонецЦикла
		
	КонецЦикла;
	
КонецФункции

Функция СкопироватьТипЭлементаФормы(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента, НовыйТипЭлемента, НовыйВидЭлемента) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицыТипаЭлемента = Новый Массив;
	ТаблицыТипаЭлемента.Добавить(СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов);
	ТаблицыТипаЭлемента.Добавить(СведенияОТипахЭлементовФормы.ТаблицаСвойствЭлементов);
	ТаблицыТипаЭлемента.Добавить(СведенияОТипахЭлементовФормы.ТаблицаСобытийЭлементов);
	ТаблицыТипаЭлемента.Добавить(СведенияОТипахЭлементовФормы.ТаблицаДопустимостиИерархииЭлементов);
	
	Отбор = Новый Структура("ТипЭлемента, ВидЭлемента", ТипЭлемента, ВидЭлемента);
	Для Каждого ТаблицаТипаЭлемента Из ТаблицыТипаЭлемента Цикл
		Для Каждого СвойствоТипаЭлемента Из РК.НайтиЭлементыКоллекции(ТаблицаТипаЭлемента, Отбор) Цикл
			СвойствоНовогоТипаЭлемента = РК.ДобавитьЭлементКоллекции(ТаблицаТипаЭлемента);
			ЗаполнитьЗначенияСвойств(СвойствоНовогоТипаЭлемента, СвойствоТипаЭлемента);
			СвойствоНовогоТипаЭлемента.ТипЭлемента = НовыйТипЭлемента;
			СвойствоНовогоТипаЭлемента.ВидЭлемента = НовыйВидЭлемента;
			РК.ИндексироватьКоллекцию(ТаблицаТипаЭлемента, СвойствоНовогоТипаЭлемента);
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаТипаЭлемента = СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов;
	СведенияОТипеЭлемента = ПолучитьСведенияОТипеЭлементаФормы(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента);
	СведенияОНовомТипеЭлемента = ПолучитьСведенияОТипеЭлементаФормы(СведенияОТипахЭлементовФормы, НовыйТипЭлемента, НовыйВидЭлемента);
	РК.СдвинутьЭлементКоллекции(ТаблицаТипаЭлемента, СведенияОНовомТипеЭлемента, РК.НомерЭлементаКоллекции(ТаблицаТипаЭлемента, СведенияОТипеЭлемента)+1);
	СведенияОНовомТипеЭлемента.Представление = НовыйТипЭлемента;
	Если ЗначениеЗаполнено(НовыйВидЭлемента) Тогда
		СведенияОНовомТипеЭлемента.Представление = СведенияОНовомТипеЭлемента.Представление + " - " + НовыйВидЭлемента;
	КонецЕсли;
	
	Для Каждого СвойствоЭлементаФормы Из ПолучитьСвойстваЭлементаФормы(СведенияОТипахЭлементовФормы, НовыйТипЭлемента, НовыйВидЭлемента) Цикл
		СвойствоЭлементаФормы.СписокВыбора = РК.СкопироватьОбъект(СвойствоЭлементаФормы.СписокВыбора);
	КонецЦикла;
	
	ТаблицаТипаЭлемента = СведенияОТипахЭлементовФормы.ТаблицаДопустимостиИерархииЭлементов;
	Отбор = Новый Структура("ТипПодчиненногоЭлемента, ВидПодчиненногоЭлемента", ТипЭлемента, ВидЭлемента);
	Для Каждого СвойствоТипаЭлемента Из РК.НайтиЭлементыКоллекции(ТаблицаТипаЭлемента, Отбор) Цикл
		СвойствоНовогоТипаЭлемента = РК.ДобавитьЭлементКоллекции(ТаблицаТипаЭлемента);
		ЗаполнитьЗначенияСвойств(СвойствоНовогоТипаЭлемента, СвойствоТипаЭлемента);
		СвойствоНовогоТипаЭлемента.ТипПодчиненногоЭлемента = НовыйТипЭлемента;
		СвойствоНовогоТипаЭлемента.ВидПодчиненногоЭлемента = НовыйВидЭлемента;
		РК.ИндексироватьКоллекцию(ТаблицаТипаЭлемента, СвойствоНовогоТипаЭлемента);
	КонецЦикла;
	
	СведенияОТипахЭлементовФормы.ТекущийТипЭлемента = НовыйТипЭлемента;
	СведенияОТипахЭлементовФормы.ТекущийВидЭлемента = НовыйВидЭлемента;
	
КонецФункции

Функция ПолучитьСписокВыбораДоступныхВидовЭлемента(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента, РодительскиеЭлементы=Неопределено) Экспорт

	ДоступныеВидыЭлемента = ПолучитьДоступныеВидыЭлемента(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента, РодительскиеЭлементы);
	
	СписокВыбора = Новый СписокЗначений;
	Для Каждого ДоступныйВидЭлемента Из ДоступныеВидыЭлемента Цикл
		СписокВыбора.Добавить(ДоступныйВидЭлемента, ДоступныйВидЭлемента.ПредставлениеЗначенияСвойстваВидЭлемента);
	КонецЦикла;
	
	Возврат СписокВыбора;

КонецФункции

Функция ПолучитьДоступныеВидыЭлемента(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента, РодительскиеЭлементы=Неопределено) Экспорт

	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	СтрокаОбщегоТипаЭлемента = РК.НайтиЭлементКоллекции(СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов, Новый Структура("ТипЭлемента, ВидЭлемента", ТипЭлемента, ""));
	Если СтрокаОбщегоТипаЭлемента<>Неопределено И Не СтрокаОбщегоТипаЭлемента.ДоступенДляВыбора И ВидЭлемента<>"" Тогда
		
		// Общий тип недоступен для выбора
		// при создании элемента сразу укзывается его вид и далее не меняется
		// ограничим список выбора только текущим видом элемента
		ДоступныеВидыЭлемента = РК.НайтиЭлементыКоллекции(СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов, Новый Структура("ТипЭлемента, ВидЭлемента", ТипЭлемента, ВидЭлемента))
		
	Иначе
	
		ДоступныеВидыЭлемента = ПолучитьДоступныеТипыИВидыЭлементов(СведенияОТипахЭлементовФормы, ТипЭлемента, РодительскиеЭлементы);
		
		Для Каждого ДоступныйВидЭлемента Из ДоступныеВидыЭлемента Цикл
			
			Если ДоступныйВидЭлемента.ВидЭлемента="" Тогда
				
				НайденныеВидыЭлементов = РК.НайтиЭлементыКоллекции(СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов, Новый Структура("ТипЭлемента", ДоступныйВидЭлемента.ТипЭлемента));
				
				Для Каждого НайденныйВидЭлемента Из НайденныеВидыЭлементов Цикл
					Если НайденныйВидЭлемента.ВидЭлемента="" Тогда
						Продолжить;
					КонецЕсли;
					
					Если РодительскиеЭлементы<>Неопределено Тогда
						Если Не ПроверитьВозможностьПодчиненияЭлементов(СведенияОТипахЭлементовФормы, РодительскиеЭлементы, НайденныйВидЭлемента) Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
						
					ДоступныеВидыЭлемента.Добавить(НайденныйВидЭлемента);
				КонецЦикла;

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	ЗарегистрированныеВидыЭлементов = Новый Соответствие;
	
	НомерВидаЭлемента = ДоступныеВидыЭлемента.Количество();
	Пока НомерВидаЭлемента>0 Цикл
		НомерВидаЭлемента = НомерВидаЭлемента - 1;
		
		ДоступныйВидЭлемента = ДоступныеВидыЭлемента[НомерВидаЭлемента];

		Если ДоступныйВидЭлемента.ВидЭлемента="" Тогда
			ДоступныеВидыЭлемента.Удалить(НомерВидаЭлемента);
			Продолжить;
		КонецЕсли;
		
		Если ЗарегистрированныеВидыЭлементов[ДоступныйВидЭлемента.ВидЭлемента]=Истина Тогда
			// Могут повторяться как квази виды (одинаковые виды, но с разными начальными значениями свойств)
			// для выбора значения свойства "вид" повторы не нужны
			ДоступныеВидыЭлемента.Удалить(НомерВидаЭлемента);
			Продолжить;
		КонецЕсли;
		
		ЗарегистрированныеВидыЭлементов[ДоступныйВидЭлемента.ВидЭлемента] = Истина;
	КонецЦикла;
	
	Возврат ДоступныеВидыЭлемента;

КонецФункции

Функция ПолучитьСписокВыбораДоступныхТиповИВидовЭлементов(СведенияОТипахЭлементовФормы, ТипЭлемента=Неопределено, РодительскиеЭлементы=Неопределено) Экспорт
	
	ДоступныеТипыИВидыЭлементов = ПолучитьДоступныеТипыИВидыЭлементов(СведенияОТипахЭлементовФормы, ТипЭлемента, РодительскиеЭлементы);
	
	СписокВыбора = Новый СписокЗначений;
	Для Каждого ДоступныйТипИВидЭлемента Из ДоступныеТипыИВидыЭлементов Цикл
		СписокВыбора.Добавить(ДоступныйТипИВидЭлемента, ДоступныйТипИВидЭлемента.Представление);
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

Функция ПолучитьДоступныеТипыИВидыЭлементов(СведенияОТипахЭлементовФормы, ТипЭлемента=Неопределено, РодительскиеЭлементы=Неопределено) Экспорт
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	Если ЗначениеЗаполнено(ТипЭлемента) Тогда
		СтрокиТиповИВидовЭлементов = РК.НайтиЭлементыКоллекции(СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов, Новый Структура("ТипЭлемента", ТипЭлемента));
	Иначе
		СтрокиТиповИВидовЭлементов = РК.ПолучитьЭлементыКоллекции(СведенияОТипахЭлементовФормы.ТаблицаТиповЭлементов);
	КонецЕсли;
	
	ДоступныеТипыИВидыЭлементов = Новый Массив;
	Для Каждого СтрокаТипаИВидаЭлемента Из СтрокиТиповИВидовЭлементов Цикл
		
		Если Не СтрокаТипаИВидаЭлемента.ДоступенДляВыбора Тогда
			Продолжить;
		КонецЕсли;
		
		Если РодительскиеЭлементы<>Неопределено Тогда
			
			Если РодительскиеЭлементы<>Неопределено Тогда
				Если Не ПроверитьВозможностьПодчиненияЭлементов(СведенияОТипахЭлементовФормы, РодительскиеЭлементы, СтрокаТипаИВидаЭлемента) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		ДоступныеТипыИВидыЭлементов.Добавить(СтрокаТипаИВидаЭлемента);
		
	КонецЦикла;
	
	Возврат ДоступныеТипыИВидыЭлементов;
	
КонецФункции

Функция ПроверитьВозможностьПодчиненияЭлементов(СведенияОТипахЭлементовФормы, Элементы, ПодчиненныеЭлементы) Экспорт
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	МассивЭлементов = РК.ЗначениеВМассив(Элементы, , Ложь);
	МассивПодчиненныхЭлементов = РК.ЗначениеВМассив(ПодчиненныеЭлементы, , Ложь);
	
	Результат = Ложь;
	Для Каждого Элемент Из МассивЭлементов Цикл
		
		Если Элемент=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = Истина;

		Для Каждого ПодчиненныйЭлемент Из МассивПодчиненныхЭлементов Цикл
			Если Не ПроверитьВозможностьПодчиненияЭлемента(СведенияОТипахЭлементовФормы, Элемент.ТипЭлемента, Элемент.ВидЭлемента, ПодчиненныйЭлемент.ТипЭлемента, ПодчиненныйЭлемент.ВидЭлемента) Тогда
				Результат = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если Результат Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьВозможностьПодчиненияЭлемента(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента, ТипПодчиненногоЭлемента, ВидПодчиненногоЭлемента) Экспорт
	
	Возврат ПолучитьТипыПодчиненныхЭлементов(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента, ТипПодчиненногоЭлемента, ВидПодчиненногоЭлемента).Количество()>0;
	
КонецФункции

Функция ПолучитьТипыПодчиненныхЭлементов(СведенияОТипахЭлементовФормы, ТипЭлемента, ВидЭлемента, ТипПодчиненногоЭлемента=Неопределено, ВидПодчиненногоЭлемента=Неопределено) Экспорт

    РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ТаблицаДопустимостиИерархииЭлементов = СведенияОТипахЭлементовФормы.ТаблицаДопустимостиИерархииЭлементов;
	
	Отбор = Новый Структура("ТипЭлемента, ВидЭлемента", ТипЭлемента, ВидЭлемента);
	Если ЗначениеЗаполнено(ТипПодчиненногоЭлемента) Тогда
		Отбор.Вставить("ТипПодчиненногоЭлемента", ТипПодчиненногоЭлемента);
		
		Если ЗначениеЗаполнено(ВидПодчиненногоЭлемента) Тогда
			Отбор.Вставить("ВидПодчиненногоЭлемента", ВидПодчиненногоЭлемента);
		КонецЕсли;
	КонецЕсли;
	
	ТипыПодчиненныхЭлементов = РК.НайтиЭлементыКоллекции(ТаблицаДопустимостиИерархииЭлементов, Отбор);
	
	Возврат ТипыПодчиненныхЭлементов;
	
КонецФункции

Функция ПолучитьСписокЗначенийБулевоПлюсНеопределено()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(Неопределено, "Авто");
	СписокВыбора.Добавить(Ложь, "Нет");
	СписокВыбора.Добавить(Истина, "Да");
	
	Возврат СписокВыбора;
	
КонецФункции

Функция ПолучитьТекстРеквизитовМодуляКласса(ОписаниеФормы) Экспорт

	НативныеПоляМассив = Новый Массив;
	НативныеПоляМассив.Добавить("Элементы");
	
	Для Каждого РеквизитФормы Из ОписаниеФормы.ПодчиненныеРеквизиты Цикл
		НативныеПоляМассив.Добавить(РеквизитФормы.ИмяРеквизита);
	КонецЦикла;

	Если НативныеПоляМассив.Количество() > 0 Тогда
		ТекстРеквизитов = "&НаКлиентеНаСервере" + Символы.ПС + "Перем ";
		Разделитель = ", ";
		Для Каждого НативноеПоле Из НативныеПоляМассив Цикл
			ТекстРеквизитов = ТекстРеквизитов + НативноеПоле + " НАТИВНЫЙ" + Разделитель;
		КонецЦикла;
		
		ТекстРеквизитов = Лев(ТекстРеквизитов, СтрДлина(ТекстРеквизитов)-СтрДлина(Разделитель));
		ТекстРеквизитов = ТекстРеквизитов + ";" + Символы.ПС + Символы.ПС;
	Иначе
		ТекстРеквизитов = "";
	КонецЕсли;
	
	Возврат ТекстРеквизитов;
	
КонецФункции

Функция ПолучитьТекстНативныхМетодовМодуляКласса(ОписаниеФормы) Экспорт
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");

	НативныеМетоды =
	"
	|Открыть
	|Открыта
	|Закрыть
	|ИзменитьРеквизиты
	|ВводДоступен
	|";
	
	НативныеМетодыМассив = РК.СтрокуВМассив(НативныеМетоды, Символы.ПС);
	
	ТекстМетодов = "";
	Для Каждого ИмяМетода Из НативныеМетодыМассив Цикл
		ТекстМетодов = ТекстМетодов + "&НаКлиентеНаСервере" + Символы.ПС;
		ТекстМетодов = ТекстМетодов + "Функция " + ИмяМетода + "() НАТИВНАЯ КонецФункции" + Символы.ПС;
	КонецЦикла;
	
	ТекстМетодов = ТекстМетодов + Символы.ПС;

    Возврат ТекстМетодов;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция ПолучитьСведенияОТипахЭлементовФормы() Экспорт
	
	РК = глОбщийМодуль("РаботаСКоллекциями");

	ТаблицаТиповЭлементов = РК.НоваяКоллекцияЗначений("ТипЭлемента, ВидЭлемента, Представление, Картинка, ДоступенДляВыбора, ЗначенияСвойствЭлементаПоУмолчанию, ЗначениеСвойстваВидЭлемента, ПредставлениеЗначенияСвойстваВидЭлемента");
	РК.ДобавитьИндексКоллекции(ТаблицаТиповЭлементов, "ТипЭлемента, ВидЭлемента");
	РК.ДобавитьИндексКоллекции(ТаблицаТиповЭлементов, "ЗначениеСвойстваВидЭлемента");

	ТаблицаСвойствЭлементов = РК.НоваяКоллекцияЗначений("ТипЭлемента, ВидЭлемента, ИмяСвойства, ПредставлениеСвойства, Тип, ЗначениеПоУмолчанию, СписокВыбора, НесколькоЗначений, СистемноеСвойство, СлабаяСсылка, ОбработчикУстановкиЗначения");
	РК.ДобавитьИндексКоллекции(ТаблицаСвойствЭлементов, "ТипЭлемента, ВидЭлемента, ИмяСвойства");
	
	ТаблицаСобытийЭлементов = РК.НоваяКоллекцияЗначений("ТипЭлемента, ВидЭлемента, ИмяСобытия");
	РК.ДобавитьИндексКоллекции(ТаблицаСобытийЭлементов, "ТипЭлемента, ВидЭлемента, ИмяСобытия");
	
	ТаблицаДопустимостиИерархииЭлементов = РК.НоваяКоллекцияЗначений("ТипЭлемента, ВидЭлемента, ТипПодчиненногоЭлемента, ВидПодчиненногоЭлемента");
	РК.ДобавитьИндексКоллекции(ТаблицаДопустимостиИерархииЭлементов, "ТипЭлемента, ВидЭлемента, ТипПодчиненногоЭлемента, ВидПодчиненногоЭлемента");
	
	СведенияОТипахЭлементовФормы = Новый Структура;
	СведенияОТипахЭлементовФормы.Вставить("ТаблицаТиповЭлементов", ТаблицаТиповЭлементов);
	СведенияОТипахЭлементовФормы.Вставить("ТекущийТипЭлемента");
	СведенияОТипахЭлементовФормы.Вставить("ТекущийВидЭлемента");
	СведенияОТипахЭлементовФормы.Вставить("ТаблицаСвойствЭлементов", ТаблицаСвойствЭлементов);
	СведенияОТипахЭлементовФормы.Вставить("ТаблицаСобытийЭлементов", ТаблицаСобытийЭлементов);
	СведенияОТипахЭлементовФормы.Вставить("ТаблицаДопустимостиИерархииЭлементов", ТаблицаДопустимостиИерархииЭлементов);
	СведенияОТипахЭлементовФормы.Вставить("ВидыЭлементовПоЗначениям", Новый Соответствие); // Имена типа и вида элемента по значению свойства "Вид" элемента
	
	ЗарегистрироватьТипФорма(СведенияОТипахЭлементовФормы);
	ЗарегистрироватьТипЭлементаГруппаФормы(СведенияОТипахЭлементовФормы);
	ЗарегистрироватьТипЭлементаДекорацияФормы(СведенияОТипахЭлементовФормы);
	ЗарегистрироватьТипЭлементаПолеФормы(СведенияОТипахЭлементовФормы);
	ЗарегистрироватьТипЭлементаКнопкаФормы(СведенияОТипахЭлементовФормы);
	ЗарегистрироватьТипТаблицаФормы(СведенияОТипахЭлементовФормы);

	Возврат СведенияОТипахЭлементовФормы;
	
КонецФункции

Функция ЗарегистрироватьТипФорма(СведенияОТипахЭлементовФормы)

	ЗарегистрироватьТипЭлементаФормы(СведенияОТипахЭлементовФормы, "ФормаКлиентскогоПриложения", "Форма", БиблиотекаКартинок.Форма, Ложь);

	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, "ГруппаФормы, ОбычнаяГруппа, Страницы, КоманднаяПанель");
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, "ПолеФормы, ПолеВвода, ПолеФлажка, ПолеНадписи, ПолеКартинки");
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, "ДекорацияФормы, Надпись, Картинка");
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, "КнопкаФормы, ОбычнаяКнопка, Гиперссылка");
	ЗарегистрироватьПодчиненныеТипыЭлементов(СведенияОТипахЭлементовФормы, "ТаблицаФормы");
	
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "АвтоЗаголовок", "Авто заголовок", "Булево", Истина);
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "Заголовок", "Заголовок", "Строка", "");
	ЗарегистрироватьСвойствоЭлементаФормы(СведенияОТипахЭлементовФормы, "РежимОткрытияОкна", "Режим открытия окна", "РежимОткрытияОкнаФормы", РежимОткрытияОкнаФормы.Независимый);
	
	ЗарегистрироватьСобытиеЭлементаФормы(СведенияОТипахЭлементовФормы, "ПриСозданииНаСервере");
	ЗарегистрироватьСобытиеЭлементаФормы(СведенияОТипахЭлементовФормы, "ПриОткрытии");
	ЗарегистрироватьСобытиеЭлементаФормы(СведенияОТипахЭлементовФормы, "ПередЗакрытием");
	ЗарегистрироватьСобытиеЭлементаФормы(СведенияОТипахЭлементовФормы, "ПриЗакрытии");
	ЗарегистрироватьСобытиеЭлементаФормы(СведенияОТипахЭлементовФормы, "ОбработкаОповещения");
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция ПолучитьИмяКлассаМодуляФормы(НаименованиеФормы) Экспорт
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	ИмяКласса = "Форма" + НаименованиеФормы;
	ИмяКласса = РК.ПолучитьИмяПрограммнойПеременнойИзСтроки(ИмяКласса);
	Возврат ИмяКласса;
	
КонецФункции

Функция ПолучитьТекстМодуляКласса(ИмяКласса, ОписаниеФормы) Экспорт
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	
	ДПС = Символы.ПС + Символы.ПС;
	
	ТекстРеквизитов = ПолучитьТекстРеквизитовМодуляКласса(ОписаниеФормы);
	ТекстНативныхМетодов = ПолучитьТекстНативныхМетодовМодуляКласса(ОписаниеФормы);
	
	ТекстМодуля = "";
	ТекстМодуля = ТекстМодуля + "ИспользоватьНативныеМетоды" + Символы.ПС;
	ТекстМодуля = ТекстМодуля + "ИдентификаторыУказателейТекущегоОбъекта ЭтотОбъект, ЭтаФорма" + Символы.ПС;
	ТекстМодуля = ТекстМодуля + "ДирективаКомпиляцииПоУмолчанию НаСервере" + ДПС;
	ТекстМодуля = ТекстМодуля + ТекстРеквизитов + ТекстНативныхМетодов + ОписаниеФормы.ТекстМодуля;
	ТекстМодуля = СокрЛП(ТекстМодуля);
	
	ТекстМодуляКласса = "";
	ТекстМодуляКласса = ТекстМодуляКласса + "#Включить ""БазовыйКласс""" + Символы.ПС;
	ТекстМодуляКласса = ТекстМодуляКласса + "#Включить ""КласснаяСтруктура""" + ДПС;
	ТекстМодуляКласса = ТекстМодуляКласса + "Класс " + ИмяКласса + ДПС;
	ТекстМодуляКласса = ТекстМодуляКласса + РК.ДобавитьОтступСтрок(ТекстМодуля);
	ТекстМодуляКласса = ТекстМодуляКласса + ДПС + "КонецКласса";
	Возврат ТекстМодуляКласса;
	
КонецФункции
