
// Пока новые функции будут здесь для тестирования, потом можно будет все перенести в вмс_ОперацииПоЯчейкамСервер и
// снести этот модуль

// ТУ_Кошелев 23.08.24 - онлайн операции по ячейкам и прочие функции для новых форм

Функция ПолучитьОперациюСеанса(ИдентификаторОперации, ВернутьОбъект = Истина) Экспорт 
	Если ВернутьОбъект Тогда
		Возврат Документы.вмс_ОперацияПоЯчейкам.ПолучитьСсылку(ИдентификаторОперации).ПолучитьОбъект();
	Иначе
		Возврат Документы.вмс_ОперацияПоЯчейкам.ПолучитьСсылку(ИдентификаторОперации);
	КонецЕсли;
КонецФункции

Функция СоздатьНовуюОперацию(ПараметрыОперации) Экспорт
	Результат = Новый Структура("Успех, ИдентификаторОперации, Сообщение", Ложь, Неопределено, "");
	
	ВидОперации = ПараметрыОперации.ВидОперации;
	Ответственный = ПараметрыОперации.Ответственный;
	ДокументОснование = ПараметрыОперации.ДокументОснование;
	ИдентификаторОперации = ПараметрыОперации.ИдентификаторОперации;
	
	РаспоряжениеНеЗавершено = вмс_ОперацииПоЯчейкамВызовСервера.УстановитьСтатусСПроверкой(ДокументОснование, ВидОперации, Ответственный);
	
	Если РаспоряжениеНеЗавершено Тогда
		НоваяОперацияПоЯчейкам = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
		НоваяОперацияПоЯчейкам.Заполнить(Неопределено);
		
		НоваяОперацияПоЯчейкам.ДокументОснование   = ДокументОснование;
		НоваяОперацияПоЯчейкам.ВидОперации		   = ВидОперации;
		НоваяОперацияПоЯчейкам.Ответственный	   = Ответственный;
		НоваяОперацияПоЯчейкам.Дата				   = ТекущаяДата();
		НоваяОперацияПоЯчейкам.ВремяНачалаОперации = ТекущаяДата();
		
		НоваяОперацияПоЯчейкам.Записать(РежимЗаписиДокумента.Проведение);
		
		Результат.ИдентификаторОперации = НоваяОперацияПоЯчейкам.Ссылка.УникальныйИдентификатор();
		Результат.Успех = Истина;
	Иначе
		Результат.Сообещние = "Операция по распоряжению уже завершена";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции        

Функция ОбновитьОперациюОтбор(ИдентификаторОперации, КоличествоОтбора, Действие, ДанныеПолей, ДопНастройки) Экспорт
	Результат = Новый Структура("Успех, Сообщение, КоличествоФакт, КоличествоОстаток, КоличествоПланОбщее", Ложь, "", 0, 0, 0);
	
	СерииИзПлана			   = ДопНастройки.СерииИзПлана;
	ОтобратьКонтейнерПолностью = ДопНастройки.ОтобратьКонтейнерПолностью;
	
	ПустаяЯчейка = Справочники.вмс_МестаХранения.ПустаяСсылка();
	ПустойКонтейнер = Справочники.вмс_Контейнеры.ПустаяСсылка();
	
	Операция = ПолучитьОперациюСеанса(ИдентификаторОперации, Истина);
	ДокументОснование = Операция.ДокументОснование;
	ВидОперации = Операция.ВидОперации;
	
	ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля(Истина);
	
	ОтборИзКонтейнера = ДанныеПолей.Свойство("КонтейнерОтправитель") И ДанныеПолей.КонтейнерОтправитель <> ПустойКонтейнер;
	ОтборВКонтейнер = ДопНастройки.ОтборВКонтейнер;
	
	Если НЕ ДанныеПолей.Свойство("КонтейнерОтправитель") Тогда
		ДанныеПолей.Вставить("КонтейнерОтправитель", ПустойКонтейнер);
	КонецЕсли;
	
	Если НЕ ДанныеПолей.Свойство("КонтейнерПриемник") Тогда
		ДанныеПолей.Вставить("КонтейнерПриемник", ПустойКонтейнер);
	КонецЕсли;
	
	Если НЕ ОтобратьКонтейнерПолностью Тогда
		// Поиск строки отбора и установка количества к отбору (на случай если вид операции "=")
		НайденныеСтроки = Операция.Товары.НайтиСтроки(ДанныеПолей);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаОперации = Операция.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОперации, ДанныеПолей);
		Иначе
			СтрокаОперации = НайденныеСтроки[0];         
		КонецЕсли;
		
		Если Действие = "+" Тогда
			КоличествоОтбора = КоличествоОтбора;
		ИначеЕсли Действие = "=" Тогда
			КоличествоОтбора = КоличествоОтбора - СтрокаОперации.Количество;
		Иначе
			Результат.Сообщение = Результат.Сообщение + "Неизвестный тип действия: " + Действие + Символы.ПС;
			Возврат Результат;
		КонецЕсли;
		//
	КонецЕсли;
	
	ПроверкаОстатков = МожноПровестиОтбор(ДокументОснование, ВидОперации, ТоварныеПоляМассив, ОтборИзКонтейнера, ОтборВКонтейнер, ОтобратьКонтейнерПолностью,
	СерииИзПлана, ДанныеПолей, КоличествоОтбора);
	
	Если Не ПроверкаОстатков.Успех Тогда
		Возврат ПроверкаОстатков; //При неудаче, в мобилке не обновляются данные, требуемые поля: Сообщение и Успех, которые тут есть, можно возвращать напрямую
	КонецЕсли;
	
	Если ОтобратьКонтейнерПолностью Тогда
		//
		Для Каждого СтрокаКонтейнера Из ПроверкаОстатков.СоставКонтейнера Цикл
			ЗаполнитьЗначенияСвойств(ДанныеПолей, СтрокаКонтейнера);
			ДанныеПолей.КонтейнерОтправитель = СтрокаКонтейнера.Контейнер;
			
			НайденныеСтроки = Операция.Товары.НайтиСтроки(ДанныеПолей);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаОперации = Операция.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаОперации, ДанныеПолей);
				СтрокаОперации.Количество = СтрокаКонтейнера.КоличествоОстаток;
			Иначе
				СтрокаОперации = НайденныеСтроки[0];
				СтрокаОперации.Количество = СтрокаОперации.Количество + СтрокаКонтейнера.КоличествоОстаток;
			КонецЕсли;
		КонецЦикла;
		
		Результат.Сообщение = "Содержимое контейнера " + Строка(ДанныеПолей.КонтейнерОтправитель) + " отобрано полностью.";
		//
	Иначе
		//
		СтрокаОперации.Количество = СтрокаОперации.Количество + КоличествоОтбора;
		
		Результат.КоличествоФакт = СтрокаОперации.Количество;
		Результат.КоличествоОстаток = ПроверкаОстатков.КоличествоОстаток - КоличествоОтбора;
		Результат.КоличествоПланОбщее = ПроверкаОстатков.КоличествоПланОбщее - КоличествоОтбора;
		
		Если СтрокаОперации.Количество < 0 Тогда
			Результат.Сообщение = Результат.Сообщение + "При выполнении запрошенной операции не хватает остатка: " + Строка(СтрокаОперации.Количество) + Символы.ПС +
			"Обратитесь к разработчику." + Символы.ПС;
			Возврат Результат;
		ИначеЕсли СтрокаОперации.Количество = 0 Тогда
			Операция.Товары.Удалить(СтрокаОперации);
		КонецЕсли;
		//
	КонецЕсли;
	
	Операция.ВремяОкончанияОперации = ТекущаяДата();
	Операция.Записать(РежимЗаписиДокумента.Проведение);
	
	Результат.Успех = Истина;
	Возврат Результат;
КонецФункции

Функция МожноПровестиОтбор(ДокументОснование, ВидОперации, ТоварныеПоляМассив, ОтборИзКонтейнера, ОтборВКонтейнер, ОтобратьКонтейнерПолностью,
	СерииИзПлана, ДанныеПолей, Количество)
	Результат = Новый Структура("Успех, Сообщение, КоличествоОстаток, КоличествоПланОбщее, СоставКонтейнера", Ложь, "", 0, 0, Неопределено);
	
	// Предполагается что результат запроса совместим с товарными полями (иначе он бы не работал изначально)
	// !!!ВНИМАНИЕ!!!: не все параметры и фичи которые учтены в СКД/функции получения плана реализованы тут, возможно надо
	// будет добавить по мере необходимости Желательно сделать регистр исполнения плана, чтобы было легче искать остаки
	// плана, и не надо было делать вот это, что в коде далее, каждый раз Тогда можно будет обойтись двумя финальными
	// запросами, что существенно упростит отладку и доработку, и всегда будет соответствие расчетного плана фактическому
	
	ПервоеУсловие = Истина;
	ВыборОстатки = "";
	ВыборПланФакт = "";
	ГруппаПланФакт = "";
	ФильтрПланФактСумм = "";
	ФильтрОстатки = "";
	Для Каждого ИмяПоля Из ТоварныеПоляМассив Цикл
		ВыборОстатки = ВыборОстатки + Символы.Таб + "вмс_ОперацияПоЯчейкамОстатки." + ИмяПоля + " КАК " + ИмяПоля + "," + Символы.ПС;
		
		Если ПервоеУсловие Тогда
			ФильтрОстатки = ФильтрОстатки + Символы.Таб + Символы.Таб +		   ИмяПоля + " = &" + ИмяПоля + Символы.ПС;
		Иначе
			ФильтрОстатки = ФильтрОстатки + Символы.Таб + Символы.Таб + "И " + ИмяПоля + " = &" + ИмяПоля + Символы.ПС;
		КонецЕсли;
		
		Если ИмяПоля <> "Серия" ИЛИ СерииИзПлана Тогда
			ВыборПланФакт  = ВыборПланФакт +  Символы.Таб + "&t." + ИмяПоля + " КАК " + ИмяПоля + "," + Символы.ПС;
			ГруппаПланФакт = ГруппаПланФакт + Символы.Таб +			ИмяПоля +					  "," + Символы.ПС;
			Если ПервоеУсловие Тогда
				ФильтрПланФактСумм = ФильтрПланФактСумм + Символы.Таб +   "ПланФактСумм." + ИмяПоля + " = &" + ИмяПоля + Символы.ПС;
			Иначе
				ФильтрПланФактСумм = ФильтрПланФактСумм + Символы.Таб + "И ПланФактСумм." + ИмяПоля + " = &" + ИмяПоля + Символы.ПС;
			КонецЕсли;
		КонецЕсли;
		
		Если ПервоеУсловие Тогда
			ПервоеУсловие = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтборИзКонтейнера Тогда
		ВыборОстатки = ВыборОстатки + Символы.Таб + "вмс_ОперацияПоЯчейкамОстатки.Контейнер КАК Контейнер," + Символы.ПС;
		ФильтрОстатки = ФильтрОстатки + Символы.Таб + Символы.Таб + "И Контейнер = &КонтейнерОтправитель" + Символы.ПС;
	КонецЕсли;
	
	Если ОтобратьКонтейнерПолностью Тогда
		ФильтрОстатки = Символы.Таб + Символы.Таб + "Контейнер = &КонтейнерОтправитель" + Символы.ПС;
		ФильтрПланФактСумм = Символы.Таб + "ИСТИНА" + Символы.ПС;
	Иначе
		ФильтрОстатки = ФильтрОстатки + Символы.Таб + Символы.Таб + "И Ячейка = &Ячейка" + Символы.ПС;
	КонецЕсли;
	
	ГруппаПланФакт = Лев(ГруппаПланФакт, СтрДлина(ГруппаПланФакт) - 2);
	
	РаспоряжениеОбъект = Справочники.вмс_РаспоряженияОпераций.НайтиТипРаспоряженияДляДокумента(ДокументОснование, ВидОперации).ПолучитьОбъект();
	РаспоряжениеОбъект.Прочитать();
	
	// ТУ_КС:
	// Более корректное получение текста запроса
	// Обнаруженная проблема старого алгоритма: не учтено, что первый пакет может содержать несколько запросов через "ОБЪЕДИНИТЬ",
	// в таком случае отбор наложится только на последний запрос
	Запрос = ПолучитьЗапросПланаИзСКД(РаспоряжениеОбъект.ХранилищеСКДТовары.Получить(), ДокументОснование);
	
	ИсходныйЗапросПлана = Запрос.Текст;
	
	Граница1План = СтрНайти(ИсходныйЗапросПлана, "ИЗ", НаправлениеПоиска.СКонца,, 1);
	
	НовыйЗапросПлана = 
	Сред(ИсходныйЗапросПлана, 1, Граница1План - 1) +
	"ПОМЕСТИТЬ ТаблицаПлан" + "
	|" +
	Сред(ИсходныйЗапросПлана, Граница1План) + "
	|;";
	
	//ИсходныйЗапросПлана = РаспоряжениеОбъект.ХранилищеСКДТовары.Получить().НаборыДанных.НаборДанных1.Запрос;
	//Граница1План = СтрНайти(ИсходныйЗапросПлана, ";",,,1);
	//Граница2План = СтрНайти(ИсходныйЗапросПлана, "ИЗ", НаправлениеПоиска.СКонца,, 1);
	//
	//НовыйЗапросПлана = 
	//Сред(ИсходныйЗапросПлана, 1, Граница1План - 1) + "
	//|ГДЕ
	//|	ТаблицаТоваров.Ссылка = &ДокументОснование
	//|	И ТаблицаТоваров.Ссылка.Проведен
	//|" + 
	//Сред(ИсходныйЗапросПлана, Граница1План, Граница2План - Граница1План) + "
	//|ПОМЕСТИТЬ
	//|	ТаблицаПлан
	//|" +
	//Сред(ИсходныйЗапросПлана, Граница2План) + "
	//|;";
	
	ИсходныйЗапросФакта = ПолучитьФактОтбора(Неопределено, ТоварныеПоляМассив, ОтборИзКонтейнера, ОтборВКонтейнер, Истина);
	
	Граница1Факт = СтрНайти(ИсходныйЗапросФакта, "ИЗ", НаправлениеПоиска.СКонца,, 1);
	
	НовыйЗапросФакта = 
	Сред(ИсходныйЗапросФакта, 1, Граница1Факт-1) + "
	|ПОМЕСТИТЬ
	|	ТаблицаФакт
	|" +
	Сред(ИсходныйЗапросФакта, Граница1Факт) + "
	|;";
	
	НовыйЗапросФинал = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(ВыборПланФакт, "&t", "ТаблицаПлан") +
	"	ТаблицаПлан.Количество КАК Количество
	|ПОМЕСТИТЬ ПланФакт
	|ИЗ
	|	ТаблицаПлан КАК ТаблицаПлан
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|" + СтрЗаменить(ВыборПланФакт, "&t", "ТаблицаФакт") +
	"	-ТаблицаФакт.Количество
	|ИЗ
	|	ТаблицаФакт КАК ТаблицаФакт
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(ВыборПланФакт, "&t", "ПланФакт") +
	"	СУММА(ПланФакт.Количество) КАК Количество
	|ПОМЕСТИТЬ ПланФактСумм
	|ИЗ
	|	ПланФакт КАК ПланФакт
	
	|СГРУППИРОВАТЬ ПО
	|" + ГруппаПланФакт + "
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(ВыборПланФакт, "&t", "ПланФактСумм") +
	"	ПланФактСумм.Количество КАК КоличествоПланОбщее
	|ИЗ
	|	ПланФактСумм КАК ПланФактСумм
	|ГДЕ
	|" + ФильтрПланФактСумм + "
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + ВыборОстатки + 
	"	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки( ,
	|" + ФильтрОстатки + ") КАК вмс_ОперацияПоЯчейкамОстатки";
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	
	Для Каждого СтрокаДанных Из ДанныеПолей Цикл
		Ключ = СтрокаДанных.Ключ;
		Запрос.УстановитьПараметр(Ключ, СтрокаДанных.Значение);
	КонецЦикла;
	
	Запрос.Текст = 
	НовыйЗапросПлана + Символы.ПС +
	НовыйЗапросФакта + Символы.ПС +
	НовыйЗапросФинал;
	
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	РезультатПлан    = РезультатЗапроса[РезультатЗапроса.ВГраница()-1];
	РезультатОстатки = РезультатЗапроса[РезультатЗапроса.ВГраница()];
	
	Результат.Успех = Истина;
	
	Если ОтобратьКонтейнерПолностью Тогда
		ТаблицаПлан = РезультатПлан.Выгрузить();
		ТаблицаКонтейнер = РезультатОстатки.Выгрузить();
		ТаблицаКонтейнерРезультат = вмс_РаботаСКоллекциями.СкопироватьТаблицуЗначений(ТаблицаКонтейнер);
		
		Результат.СоставКонтейнера = ТаблицаКонтейнерРезультат;
		
		// Правка проверки плана с включенными сериями
		СтруктураПоиска = Новый Структура;
		ТоварныеПоляСтрока = "";
		Для Каждого ИмяПоля Из ТоварныеПоляМассив Цикл
			Если ИмяПоля <> "Серия" ИЛИ СерииИзПлана Тогда
				СтруктураПоиска.Вставить(ИмяПоля);
				ТоварныеПоляСтрока = ТоварныеПоляСтрока + ИмяПоля + ", ";
			КонецЕсли;
		КонецЦикла;
		ТоварныеПоляСтрока = Лев(ТоварныеПоляСтрока, СтрДлина(ТоварныеПоляСтрока) - 2);
		
		ТаблицаКонтейнер.Свернуть(ТоварныеПоляСтрока, "КоличествоОстаток");
		
		Для Каждого СтрокаКонтейнер Из ТаблицаКонтейнер Цикл
			Для Каждого Элемент Из СтруктураПоиска Цикл
				ИмяПоля = Элемент.Ключ;
				СтруктураПоиска[ИмяПоля] = СтрокаКонтейнер[ИмяПоля];
			КонецЦикла;
			
			НайденныеСтроки = ТаблицаПлан.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() = 0 ИЛИ НайденныеСтроки[0].КоличествоПланОбщее < СтрокаКонтейнер.КоличествоОстаток Тогда
				ПредставлениеТовара = "";
				Для Каждого Элемент Из СтруктураПоиска Цикл
					ПредставлениеТовара = ПредставлениеТовара + Строка(СтрокаКонтейнер[Элемент.Ключ]) + " | ";
				КонецЦикла;
				ПредставлениеТовара = Лев(ПредставлениеТовара, СтрДлина(ПредставлениеТовара) - 3);
				
				КоличествоПлан = ?(НайденныеСтроки.Количество() = 0, 0, НайденныеСтроки[0].КоличествоПланОбщее);
				Результат.Успех = Ложь;
				Результат.Сообщение = Результат.Сообщение + "При отборе контейнера будет превышен план по товару: " + ПредставлениеТовара + Символы.ПС +
				"Остаток по плану:        " + КоличествоПлан + Символы.ПС +
				"Количество в контейнере: " + СтрокаКонтейнер.КоличествоОстаток + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если РезультатПлан.Пустой() Тогда
			Результат.Сообщение = Результат.Сообщение + "Не найдены остатки в плане. ";
			Результат.Успех = Ложь;
		КонецЕсли;
		
		ВыборкаПлан = РезультатПлан.Выбрать();
		Пока ВыборкаПлан.Следующий() Цикл 
			Результат.КоличествоПланОбщее = ВыборкаПлан.КоличествоПланОбщее;
			
			Если ВыборкаПлан.КоличествоПланОбщее - Количество < 0 Тогда
				Результат.Сообщение = Результат.Сообщение + "Превышено общее количество к отбору по плану. ";
				Результат.Успех = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если Количество > 0 И РезультатОстатки.Пустой() Тогда
			Результат.Сообщение = Результат.Сообщение + "Не найдены остатки на складе. ";
			Результат.Успех = Ложь;
		КонецЕсли;
		
		ВыборкаОстатки = РезультатОстатки.Выбрать();
		Пока ВыборкаОстатки.Следующий() Цикл
			Результат.КоличествоОстаток = ВыборкаОстатки.КоличествоОстаток;
			
			Если ВыборкаОстатки.КоличествоОстаток - Количество < 0 Тогда
				Результат.Сообщение = Результат.Сообщение + "Не хватает остатков в ячейке для отбора. ";
				Результат.Успех = Ложь;
			Иначе                                             
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ОтборПолучитьТаблицы(ПараметрыОперации, ДопНастройки = Неопределено, ТолькоПерваяСтрока = Ложь, ИмяТаблицы = "Маршрут") Экспорт
	Результат = Новый Структура("Успех, ВсеСобрано, Сообщение, Таблица", Ложь, Ложь, "", Неопределено);
	
	ВидОперации = ПараметрыОперации.ВидОперации;
	Ответственный = ПараметрыОперации.Ответственный;
	ДокументОснование = ПараметрыОперации.ДокументОснование;
	ИдентификаторОперации = ПараметрыОперации.ИдентификаторОперации;
	ВыбранноеПомещение = ПараметрыОперации.ВыбранноеПомещение;
	
	ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля(Истина);
	
	ОтборИзКонтейнера = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ИспользоватьТару");
	ОтборВКонтейнер = ДопНастройки.ОтборВКонтейнер;
	ВыборПомещения = ДопНастройки.ВыборПомещения;
	СерииИзПлана = ДопНастройки.СерииИзПлана И ТоварныеПоляМассив.Найти("Серия") <> Неопределено;
	
	Если ТипЗнч(ОтборИзКонтейнера) <> Тип("Булево") Тогда
		Результат.Сообщение = "Не удалось получить настройку использования контейнеров";
		Возврат Результат;
	КонецЕсли;	
	
	// Оптимизировать функции если потребуется
	ПараметрыФункции = Новый Структура("ПараметрДокументы, ВидОперации", ДокументОснование, ВидОперации);
	ТаблицаПлан = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуТоваровПоДокументам(ПараметрыФункции);  
	
	ПараметрыФункции = Новый Структура("ДокументОснование, ВидОперации", ДокументОснование, ВидОперации); 
	ТаблицаФакт = ПолучитьФактОтбора(ПараметрыФункции, ТоварныеПоляМассив, ОтборИзКонтейнера, ОтборВКонтейнер, Ложь);
	
	Если ИмяТаблицы = "Маршрут" ИЛИ ИмяТаблицы = "Помещения" Тогда
		РезультатПодсказки = ПолучитьМаршрутОтбора(ДокументОснование, Ответственный, ИдентификаторОперации, ТаблицаПлан, ТаблицаФакт, ТоварныеПоляМассив,
		ОтборИзКонтейнера, ОтборВКонтейнер, СерииИзПлана, ВыборПомещения, ВыбранноеПомещение);
		// Дописать отдельную логику под помещения, с выдачей результатов по каким все отобрано	
	ИначеЕсли ИмяТаблицы = "ПланФакт" Тогда
		РезультатПодсказки = ПолучитьТаблицуПланФакт(ТаблицаПлан, ТаблицаФакт, ТоварныеПоляМассив, СерииИзПлана);
	КонецЕсли;
	
	Результат.ВсеСобрано = РезультатПодсказки.ВсеСобрано; 
	Таблица 			 = РезультатПодсказки.ТаблицаПодсказки;
	
	Если Таблица.Количество() = 0 Тогда
		Результат.Сообщение = "Не найдены строки для формирования маршрута отбора";
		Возврат Результат;
	КонецЕсли;
	
	Если ИмяТаблицы = "Помещения" Тогда
		Результат.Таблица = Таблица.ВыгрузитьКолонку("Помещение");
	ИначеЕсли ТолькоПерваяСтрока Тогда
		СтрокаТаблицы = Новый Структура();
		Для Каждого Колонка Из Таблица.Колонки Цикл
			СтрокаТаблицы.Вставить(Колонка.Имя);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Таблица[0]);
		Результат.Таблица = СтрокаТаблицы;
	Иначе
		Результат.Таблица = Таблица;
	КонецЕсли;
	
	Результат.Успех = Истина;
	
	Возврат Результат;
КонецФункции

// Сделать адаптацию конфигураций (справочник серий)
Функция ПолучитьФактОтбора(ПараметрыОперации, ТоварныеПоляМассив, ОтборИзКонтейнера, ОтборВКонтейнер, ВозвратЗапроса = Ложь)
	Выбор1 = "";
	Выбор2 = "";
	Для Каждого ИмяПоля Из ТоварныеПоляМассив Цикл
		Если ИмяПоля = "Серия" Тогда
			Выбор1 = Выбор1 + "
			|	ВЫБОР
			|	КОГДА вмс_ОперацияПоЯчейкамТовары.Серия = Неопределено
			|	  ИЛИ вмс_ОперацияПоЯчейкамТовары.Серия ЕСТЬ NULL
			|	ТОГДА ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
			|	ИНАЧЕ вмс_ОперацияПоЯчейкамТовары.Серия
			|	КОНЕЦ КАК " + ИмяПоля + "," + Символы.ПС;
		Иначе
			Выбор1 = Выбор1 + Символы.Таб + "вмс_ОперацияПоЯчейкамТовары." + ИмяПоля + " КАК " + ИмяПоля + "," + Символы.ПС;                             
		КонецЕсли;
		Выбор2 = Выбор2 + Символы.Таб + "СтрокиОперации." + ИмяПоля + " КАК " + ИмяПоля + "," + Символы.ПС;
	КонецЦикла;
	
	Если ОтборИзКонтейнера Тогда
		Выбор1 = Выбор1 + Символы.Таб + "вмс_ОперацияПоЯчейкамТовары.КонтейнерОтправитель КАК КонтейнерОтправитель," + Символы.ПС;
	КонецЕсли;
	
	Если ОтборВКонтейнер Тогда
		Выбор1 = Выбор1 + Символы.Таб + "вмс_ОперацияПоЯчейкамТовары.КонтейнерПриемник КАК КонтейнерПриемник," + Символы.ПС;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкам.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Операции
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам КАК вмс_ОперацияПоЯчейкам
	|ГДЕ
	|	вмс_ОперацияПоЯчейкам.ДокументОснование = &ДокументОснование
	|	И вмс_ОперацияПоЯчейкам.ВидОперации = &ВидОперации
	|	И вмс_ОперацияПоЯчейкам.Проведен
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Операции.Ссылка КАК Ссылка,
	|" + Выбор1 + 
	"	вмс_ОперацияПоЯчейкамТовары.Ячейка КАК Ячейка,
	// При необходимости отображать ячейку-приемник, заменить поле
	|	вмс_ОперацияПоЯчейкамТовары.Количество КАК Количество
	|ИЗ
	|	Операции КАК Операции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вмс_ОперацияПоЯчейкам.Товары КАК вмс_ОперацияПоЯчейкамТовары
	|		ПО Операции.Ссылка = вмс_ОперацияПоЯчейкамТовары.Ссылка
	|		И вмс_ОперацияПоЯчейкамТовары.Ячейка <> ЗНАЧЕНИЕ(Справочник.вмс_МестаХранения.ПустаяСсылка)";
	
	Если ВозвратЗапроса Тогда
		Возврат Запрос.Текст;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументОснование", ПараметрыОперации.ДокументОснование);
	Запрос.УстановитьПараметр("ВидОперации", ПараметрыОперации.ВидОперации);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции

Функция ПолучитьМаршрутОтбора(ДокументОснование, Ответственный, ИдентификаторОперации, ТаблицаПлан, ТаблицаФакт,
	ТоварныеПоляМассив, ОтборИзКонтейнера, ОтборВКонтейнер, СерииИзПлана, ВыборПомещения, ВыбранноеПомещение)
	Результат = Новый Структура("ВсеСобрано, ТаблицаПодсказки, Сообщение", Ложь, Неопределено, "");
	
	ОперацияПоЯчейкам = ПолучитьОперациюСеанса(ИдентификаторОперации, Ложь);
	
	ИспользоватьПомещения = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ИспользоватьПомещения");
	
	Если ИспользоватьПомещения И ВыбранноеПомещение = Неопределено Тогда
		СписокПомещений = Справочники.вмс_НастройкиОператора.ПолучитьДоступныеПомещенияОператора(Ответственный);
		СписокПомещений.Добавить(Справочники.вмс_Помещения.ПустаяСсылка());
	ИначеЕсли ВыбранноеПомещение <> Неопределено Тогда
		СписокПомещений = Новый Массив;
		СписокПомещений.Добавить(ВыбранноеПомещение);
		СписокПомещений.Добавить(Справочники.вмс_Помещения.ПустаяСсылка());
	Иначе
		СписокПомещений = Новый Массив;
	КонецЕсли;
	
	ИндексСерии = ТоварныеПоляМассив.Найти("Серия");
	ИспользоватьСерии = ИндексСерии <> Неопределено;
	// Нужно для однозначного порядка полей в одном из объединений запросов, в одном из которых может не быть серий
	Если ИспользоватьСерии Тогда
		ТоварныеПоляМассив.Удалить(ИндексСерии);
		ТоварныеПоляМассив.Добавить("Серия");
	КонецЕсли;
	
	ПервыйЭлемент = Истина;
	СтрокаВыбор = "";
	СтрокаГруппы = "";
	СтрокаФильтр = "";
	СтрокаСоединение = "";
	СтрокаСоединениеФакт = "";
	СтрокаВыборСумм = "";
	СтрокаГруппыСумм = "";
	Для Каждого ИмяПоля Из ТоварныеПоляМассив Цикл
		СтрокаВыбор = СтрокаВыбор   + Символы.Таб + "&t." + ИмяПоля + " КАК " + ИмяПоля + "," + Символы.ПС;
		СтрокаГруппы = СтрокаГруппы + Символы.Таб + "&t." + ИмяПоля + "," + Символы.ПС;
		
		Если СерииИзПлана ИЛИ ИмяПоля <> "Серия" Тогда //Только когда СерииИзПлана, добавлять серию в поля фильтра и соединения
			Если ПервыйЭлемент Тогда
				ПервыйЭлемент = Ложь;
				СтрокаФильтр	 = СтрокаФильтр		+ Символы.Таб + Символы.Таб;
				СтрокаСоединение = СтрокаСоединение + Символы.Таб + Символы.Таб;
			Иначе
				СтрокаФильтр	 = СтрокаФильтр		+ Символы.Таб + Символы.Таб + "И "; 
				СтрокаСоединение = СтрокаСоединение + Символы.Таб + Символы.Таб + "И "; 
			КонецЕсли;
			СтрокаФильтр	 = СтрокаФильтр + ИмяПоля + " В(ВЫБРАТЬ Финал." + ИмяПоля + " ИЗ Финал КАК Финал)" + Символы.ПС;
			СтрокаСоединение = СтрокаСоединение + "&t1." +  ИмяПоля + " = &t2." + ИмяПоля + Символы.ПС;
			СтрокаВыборСумм  = СтрокаВыборСумм  + Символы.Таб + "&t." + ИмяПоля + " КАК " + ИмяПоля + "," + Символы.ПС;
			СтрокаГруппыСумм = СтрокаГруппыСумм + Символы.Таб + "&t." + ИмяПоля + "," + Символы.ПС;
		КонецЕсли;                                                                                               
	КонецЦикла;
	СтрокаГруппы = Лев(СтрокаГруппы, СтрДлина(СтрокаГруппы) - 2);
	СтрокаГруппыСумм = Лев(СтрокаГруппыСумм, СтрДлина(СтрокаГруппыСумм) - 2);
	СтрокаСоединениеФакт = СтрокаСоединение + Символы.Таб + Символы.Таб + "И &t1.Ячейка = &t2.Ячейка" + Символы.ПС;
	
	ЗаменаНеопределеноСерии =
	"	ВЫБОР КОГДА ОстаткиПланаПлюсФакт.ЭтоФакт ТОГДА ОстаткиПланаПлюсФакт.Серия
	|		КОГДА вмс_ОперацияПоЯчейкамОстатки.Серия = Неопределено
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ вмс_ОперацияПоЯчейкамОстатки.Серия
	|	КОНЕЦ";
	
	НеВключаемыеТипыЯчеек = Новый Массив;
	НеВключаемыеТипыЯчеек.Добавить(Перечисления.вмс_ТипыЯчеек.ЗонаОтгрузки);
	НеВключаемыеТипыЯчеек.Добавить(Перечисления.вмс_ТипыЯчеек.ЗонаОтбора);
	НеВключаемыеТипыЯчеек.Добавить(Перечисления.вмс_ТипыЯчеек.ЗонаКонтроля);
	НеВключаемыеТипыЯчеек.Добавить(Перечисления.вмс_ТипыЯчеек.Оператор);
	
	НеДоступныеТипыЯчеек = Новый Массив;
	НеДоступныеТипыЯчеек.Добавить(Перечисления.вмс_ТипыЯчеек.ЗонаПриемки);
	НеДоступныеТипыЯчеек.Добавить(Перечисления.вмс_ТипыЯчеек.Карантин);
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыбор, "&t", "План") +
	"	План.Количество КАК Количество
	|ПОМЕСТИТЬ План
	|ИЗ &План КАК План
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыбор, "&t", "Факт") +
	?(ОтборИзКонтейнера, " 	Факт.КонтейнерОтправитель КАК КонтейнерОтправитель," + Символы.ПС, "") + 
	?(ОтборВКонтейнер, " 	Факт.КонтейнерПриемник КАК КонтейнерПриемник," + Символы.ПС, "") + "
	|	Факт.Ячейка КАК Ячейка,
	|	Факт.Количество КАК Количество,
	|	Факт.Ссылка = &СсылкаОперации КАК РедактированиеДоступно 
	// Если нужно разрешить редактирование всех операций пользователя, то нужно доработать запрос для получения операций по пользователю,
	// а также передать ссылку на пользователя в эту функцию и в ОтборПолучитьТаблицы, сейчас не передается (10.09.24)
	|ПОМЕСТИТЬ ФактБезГруппы
	|ИЗ &Факт КАК Факт
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыбор, "&t", "ФактБезГруппы") +
	?(ОтборИзКонтейнера, " 	ФактБезГруппы.КонтейнерОтправитель КАК КонтейнерОтправитель," + Символы.ПС, "") + 
	?(ОтборВКонтейнер, " 	ФактБезГруппы.КонтейнерПриемник КАК КонтейнерПриемник," + Символы.ПС, "") + "
	|	ФактБезГруппы.Ячейка КАК Ячейка,
	|	СУММА(ФактБезГруппы.Количество) КАК Количество,
	|	ФактБезГруппы.РедактированиеДоступно КАК РедактированиеДоступно 
	|ПОМЕСТИТЬ Факт
	|ИЗ ФактБезГруппы КАК ФактБезГруппы
	|СГРУППИРОВАТЬ ПО
	|" + СтрЗаменить(СтрокаГруппы, "&t", "ФактБезГруппы") + ",
	|" + ?(ОтборИзКонтейнера, "	ФактБезГруппы.КонтейнерОтправитель,", "") + "
	|" + ?(ОтборВКонтейнер, "	ФактБезГруппы.КонтейнерПриемник,", "") + "
	|	ФактБезГруппы.РедактированиеДоступно,
	|	ФактБезГруппы.Ячейка
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыборСумм, "&t", "План") +
	"	План.Количество КАК Количество
	|ПОМЕСТИТЬ Сумм
	|ИЗ План КАК План
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыборСумм, "&t", "Факт") +
	"	-Факт.Количество КАК Количество
	|ИЗ Факт КАК Факт
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыборСумм, "&t", "Сумм") +
	"	СУММА(Сумм.Количество) КАК Количество
	|ПОМЕСТИТЬ Финал
	|ИЗ Сумм КАК Сумм
	|СГРУППИРОВАТЬ ПО
	|	" + СтрЗаменить(СтрокаГруппыСумм, "&t", "Сумм") + 
	";
	
	// Этот запрос проверяет, что все отобрано по плану
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыборСумм, "&t", "Финал") +
	?(ИспользоватьСерии И НЕ СерииИзПлана, "	Неопределено КАК Серия,", "") + //В этом случае в Факте будут серии, а в план их нужно добавить отдельно
	?(ОтборИзКонтейнера, "	Неопределено					 КАК КонтейнерОтправитель," + Символы.ПС, "") + 
	?(ОтборВКонтейнер, "	Неопределено					 КАК КонтейнерПриемник," + Символы.ПС, "") + "
	|	Неопределено										 КАК Ячейка,
	|	Финал.Количество									 КАК Количество,
	|	Неопределено										 КАК РедактированиеДоступно,
	|	ЛОЖЬ												 КАК ЭтоФакт
	|ПОМЕСТИТЬ ОстаткиПлана
	|ИЗ Финал КАК Финал
	|ГДЕ
	|	Финал.Количество > 0
	|;
	
	//ПЛАН И ФАКТ, ПЛЮС ДАННЫЕ ИЗ ОСТАТКОВ НА СКЛАДЕ
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрЗаменить(СтрокаВыбор, "&t", "ОстаткиПлана"), "ОстаткиПлана.Серия", ЗаменаНеопределеноСерии) +
	?(ОтборИзКонтейнера, "	ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.Контейнер, ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка))	КАК КонтейнерОтправитель," + Символы.ПС, "") + 
	?(ОтборВКонтейнер, "	ЗНАЧЕНИЕ(Справочник.вмс_Контейнеры.ПустаяСсылка)													КАК КонтейнерПриемник," + Символы.ПС, "") + "
	|	ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.Ячейка, ЗНАЧЕНИЕ(Справочник.вмс_МестаХранения.ПустаяСсылка))						КАК Ячейка,
	|	ЛОЖЬ																													КАК РедактированиеДоступно,
	|	ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток, 0)																КАК КоличествоОстаток,
	|	ОстаткиПлана.Количество																									КАК Количество,
	|	ЛОЖЬ																													КАК ЭтоФакт
	|ПОМЕСТИТЬ ПланФактОстакиСклада
	|ИЗ 
	|	ОстаткиПлана КАК ОстаткиПлана
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(,
	|" + СтрокаФильтр + "
	|		) КАК вмс_ОперацияПоЯчейкамОстатки                              
	|	ПО
	|" + СтрЗаменить(СтрЗаменить(СтрокаСоединение, "&t1", "вмс_ОперацияПоЯчейкамОстатки"), "&t2", "ОстаткиПлана") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыбор, "&t", "Факт") +
	?(ОтборИзКонтейнера, " 	Факт.КонтейнерОтправитель	КАК КонтейнерОтправитель," + Символы.ПС, "") +
	?(ОтборВКонтейнер, "	Факт.КонтейнерПриемник		КАК КонтейнерПриемник," + Символы.ПС, "") + "
	|	Факт.Ячейка										КАК Ячейка,
	|	Факт.РедактированиеДоступно						КАК РедактированиеДоступно,
	|	Факт.Количество									КАК КоличествоОстаток,
	|	Факт.Количество									КАК Количество,
	|	ИСТИНА											КАК ЭтоФакт
	|ИЗ
	|	Факт КАК Факт
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыбор, "&t", "ПланФактОстакиСклада") +
	?(ОтборИзКонтейнера, "	ПланФактОстакиСклада.КонтейнерОтправитель							КАК КонтейнерОтправитель," + Символы.ПС, "") + 
	?(ОтборВКонтейнер, "	ПланФактОстакиСклада.КонтейнерПриемник								КАК КонтейнерПриемник," + Символы.ПС, "") + "
	|	ПланФактОстакиСклада.Ячейка																КАК Ячейка,
	|	ЕСТЬNULL(вмс_МестаХранения.Помещение, ЗНАЧЕНИЕ(Справочник.вмс_Помещения.ПустаяСсылка))	КАК Помещение,
	|	ЕСТЬNULL(вмс_МестаХранения.Приоритет, 0)												КАК Приоритет,
	|	ЕСТЬNULL(вмс_МестаХранения.Наименование, """")											КАК Наименование,
	//|	ЕСТЬNULL(вмс_МестаХранения.СортировкаРяд, 0)											КАК СортировкаРяд, 
	//|	ЕСТЬNULL(вмс_МестаХранения.СортировкаНомер, 0)											КАК СортировкаНомер,
	//|	ЕСТЬNULL(вмс_МестаХранения.СортировкаЭтаж, 0)											КАК СортировкаЭтаж,
	|	(НЕ вмс_МестаХранения.Ссылка ЕСТЬ NULL
	|		И НЕ вмс_МестаХранения.ПометкаУдаления
	|		И НЕ вмс_МестаХранения.ТипЯчейки В(&НеВключаемыеТипыЯчеек))							КАК ЕстьНаСкладе,
	|	ВЫБОР КОГДА ПланФактОстакиСклада.ЭтоФакт ТОГДА ПланФактОстакиСклада.РедактированиеДоступно
	|		ИНАЧЕ (НЕ вмс_МестаХранения.Ссылка ЕСТЬ NULL
	|			И НЕ вмс_МестаХранения.ТипЯчейки В(&НеДоступныеТипыЯчеек)
	|			И (НЕ &ИспользоватьПомещения ИЛИ вмс_МестаХранения.Помещение В (&СписокПомещений)))
	|	КОНЕЦ																					КАК РедактированиеДоступно,
	|	ПланФактОстакиСклада.ЭтоФакт															КАК ЭтоФакт,
	|	ПланФактОстакиСклада.КоличествоОстаток													КАК КоличествоОстаток,
	|	ПланФактОстакиСклада.Количество															КАК КоличествоПланОбщее,
	|	ПланФактОстакиСклада.Количество															КАК КоличествоПлан,
	|	ПланФактОстакиСклада.Количество															КАК КоличествоФакт
	|ПОМЕСТИТЬ ПодсказкаВсеДанные
	|ИЗ 
	|	ПланФактОстакиСклада КАК ПланФактОстакиСклада
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ПО
	|	ПланФактОстакиСклада.Ячейка = вмс_МестаХранения.Ссылка
	|;
	
	//ОСТАТКИ ПЛАНА, КОТОРЫЕ МОЖНО ОТОБРАТЬ
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыбор, "&t", "ПодсказкаВсеДанные") +
	?(ОтборИзКонтейнера, "	ПодсказкаВсеДанные.КонтейнерОтправитель								КАК КонтейнерОтправитель," + Символы.ПС, "") + 
	?(ОтборВКонтейнер, "	ПодсказкаВсеДанные.КонтейнерПриемник								КАК КонтейнерПриемник," + Символы.ПС, "") + "
	|	ПодсказкаВсеДанные.Ячейка																КАК Ячейка,
	|	ПодсказкаВсеДанные.Помещение															КАК Помещение,
	|	ПодсказкаВсеДанные.Приоритет															КАК Приоритет,
	|	ПодсказкаВсеДанные.Наименование															КАК Наименование,
	//|	ПодсказкаВсеДанные.СортировкаРяд														КАК СортировкаРяд, 
	//|	ПодсказкаВсеДанные.СортировкаНомер														КАК СортировкаНомер,
	//|	ПодсказкаВсеДанные.СортировкаЭтаж														КАК СортировкаЭтаж,
	|	ПодсказкаВсеДанные.РедактированиеДоступно												КАК РедактированиеДоступно,
	|	ЛОЖЬ																					КАК ОтобраноРанее,
	|	ПодсказкаВсеДанные.КоличествоОстаток													КАК КоличествоОстаток,
	|	ПодсказкаВсеДанные.КоличествоПланОбщее													КАК КоличествоПланОбщее,
	|	0																						КАК КоличествоПлан,
	|	0																						КАК КоличествоФакт
	|ПОМЕСТИТЬ ПодсказкаБезАртикула
	|ИЗ 
	|	ПодсказкаВсеДанные КАК ПодсказкаВсеДанные
	|ГДЕ
	|	НЕ ПодсказкаВсеДанные.ЭтоФакт И ПодсказкаВсеДанные.ЕстьНаСкладе
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	
	//ОСТАТКИ ПЛАНА, КОТОРЫЕ НЕЛЬЗЯ ОТОБРАТЬ
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыбор, "&t", "ПодсказкаВсеДанные") +
	?(ОтборИзКонтейнера, "	ПодсказкаВсеДанные.КонтейнерОтправитель								КАК КонтейнерОтправитель," + Символы.ПС, "") + 
	?(ОтборВКонтейнер, "	ПодсказкаВсеДанные.КонтейнерПриемник								КАК КонтейнерПриемник," + Символы.ПС, "") + "
	|	ЗНАЧЕНИЕ(Справочник.вмс_МестаХранения.ПустаяСсылка)										КАК Ячейка,
	|	ЗНАЧЕНИЕ(Справочник.вмс_Помещения.ПустаяСсылка)											КАК Помещение,
	|	0																						КАК Приоритет,
	|	""""																					КАК Наименование,
	//|	0																						КАК СортировкаРяд, 
	//|	0																						КАК СортировкаНомер,
	//|	0																						КАК СортировкаЭтаж,
	|	ЛОЖЬ																					КАК РедактированиеДоступно,
	|	ЛОЖЬ																					КАК ОтобраноРанее,
	|	0																						КАК КоличествоОстаток,
	|	ПодсказкаВсеДанные.КоличествоПланОбщее													КАК КоличествоПланОбщее,
	|	ПодсказкаВсеДанные.КоличествоПланОбщее													КАК КоличествоПлан,
	|	0																						КАК КоличествоФакт
	|ИЗ 
	|	ПодсказкаВсеДанные КАК ПодсказкаВсеДанные
	|ГДЕ
	|	НЕ ПодсказкаВсеДанные.ЭтоФакт И НЕ ПодсказкаВсеДанные.ЕстьНаСкладе
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	
	//СТРОКИ, ОТОБРАННЫЕ РАНЕЕ
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыбор, "&t", "ПодсказкаВсеДанные") +
	?(ОтборИзКонтейнера, "	ПодсказкаВсеДанные.КонтейнерОтправитель								КАК КонтейнерОтправитель," + Символы.ПС, "") + 
	?(ОтборВКонтейнер, "	ПодсказкаВсеДанные.КонтейнерПриемник								КАК КонтейнерПриемник," + Символы.ПС, "") + "
	|	ПодсказкаВсеДанные.Ячейка																КАК Ячейка,
	|	МАКСИМУМ(ПодсказкаВсеДанные.Помещение)													КАК Помещение,
	|	МАКСИМУМ(ПодсказкаВсеДанные.Приоритет)													КАК Приоритет,
	|	МАКСИМУМ(ПодсказкаВсеДанные.Наименование)												КАК Наименование,
	//|	МАКСИМУМ(ПодсказкаВсеДанные.СортировкаРяд)												КАК СортировкаРяд, 
	//|	МАКСИМУМ(ПодсказкаВсеДанные.СортировкаНомер)											КАК СортировкаНомер,
	//|	МАКСИМУМ(ПодсказкаВсеДанные.СортировкаЭтаж)												КАК СортировкаЭтаж,
	|	ПодсказкаВсеДанные.РедактированиеДоступно												КАК РедактированиеДоступно,
	|	ИСТИНА																					КАК ОтобраноРанее,
	|	МАКСИМУМ(ПодсказкаВсеДанные.КоличествоОстаток)											КАК КоличествоОстаток,
	|	0																						КАК КоличествоПланОбщее,
	|	МАКСИМУМ(ПодсказкаВсеДанные.КоличествоПлан)												КАК КоличествоПлан,
	|	МАКСИМУМ(ПодсказкаВсеДанные.КоличествоФакт)												КАК КоличествоФакт
	|ИЗ 
	|	ПодсказкаВсеДанные КАК ПодсказкаВсеДанные
	|ГДЕ
	|	ПодсказкаВсеДанные.ЭтоФакт
	|СГРУППИРОВАТЬ ПО
	|	" + СтрЗаменить(СтрокаГруппы, "&t", "ПодсказкаВсеДанные") + ",
	|" + ?(ОтборИзКонтейнера, "	ПодсказкаВсеДанные.КонтейнерОтправитель," + Символы.ПС, "") + 
	?(ОтборВКонтейнер, "	ПодсказкаВсеДанные.КонтейнерПриемник," + Символы.ПС, "") + "
	|	ПодсказкаВсеДанные.Ячейка,
	|	ПодсказкаВсеДанные.Помещение,
	|	ПодсказкаВсеДанные.РедактированиеДоступно
	|;
	
	// Тут только приклеивается артикул
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыбор, "&t", "ПодсказкаБезАртикула") +
	?(ОтборИзКонтейнера, "	ПодсказкаБезАртикула.КонтейнерОтправитель	КАК КонтейнерОтправитель," + Символы.ПС, "") + 
	?(ОтборВКонтейнер, "	ПодсказкаБезАртикула.КонтейнерПриемник		КАК КонтейнерПриемник," + Символы.ПС, "") + "
	|	Номенклатура.Артикул						КАК Артикул,
	|	ПодсказкаБезАртикула.Ячейка					КАК Ячейка,
	|	ПодсказкаБезАртикула.Помещение				КАК Помещение,
	|	ПодсказкаБезАртикула.Приоритет				КАК Приоритет,
	|	ПодсказкаБезАртикула.Наименование			КАК Наименование,
	//|	ПодсказкаБезАртикула.СортировкаРяд			КАК СортировкаРяд, 
	//|	ПодсказкаБезАртикула.СортировкаНомер		КАК СортировкаНомер,
	//|	ПодсказкаБезАртикула.СортировкаЭтаж			КАК СортировкаЭтаж,
	|	ПодсказкаБезАртикула.ОтобраноРанее			КАК ОтобраноРанее,
	|	ПодсказкаБезАртикула.РедактированиеДоступно	КАК РедактированиеДоступно,
	|	ПодсказкаБезАртикула.КоличествоОстаток		КАК КоличествоОстаток,
	|	ПодсказкаБезАртикула.КоличествоПланОбщее	КАК КоличествоПланОбщее,
	|	ПодсказкаБезАртикула.КоличествоПлан			КАК КоличествоПлан,
	|	ПодсказкаБезАртикула.КоличествоФакт			КАК КоличествоФакт,
	|	ЛОЖЬ										КАК ВРамкахПлана
	|ИЗ
	|	ПодсказкаБезАртикула КАК ПодсказкаБезАртикула
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (ПодсказкаБезАртикула.Товар = Номенклатура.Ссылка)
	|ГДЕ
	|	НЕ &ИспользоватьПомещения ИЛИ ПодсказкаБезАртикула.Помещение В (&СписокПомещений)
	|УПОРЯДОЧИТЬ ПО
	|	Товар,
	|	РедактированиеДоступно УБЫВ,
	|	ОтобраноРанее,
	|	Приоритет,
	|	Наименование";
	//|	СортировкаРяд,
	//|	СортировкаНомер,
	//|	СортировкаЭтаж";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("План", ТаблицаПлан);
	Запрос.УстановитьПараметр("Факт", ТаблицаФакт);
	Запрос.УстановитьПараметр("НеВключаемыеТипыЯчеек", НеВключаемыеТипыЯчеек);
	Запрос.УстановитьПараметр("НеДоступныеТипыЯчеек", НеДоступныеТипыЯчеек);
	Запрос.УстановитьПараметр("СсылкаОперации", ОперацияПоЯчейкам);
	Запрос.УстановитьПараметр("ИспользоватьПомещения", ИспользоватьПомещения);
	Запрос.УстановитьПараметр("СписокПомещений", СписокПомещений);	
	
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ЗапросПлана = РезультатЗапроса[РезультатЗапроса.ВГраница() - 4];
	Результат.ВсеСобрано = ЗапросПлана.Пустой();
	
	ОстаткиПлана = ЗапросПлана.Выгрузить();
	ТаблицаПланФакт = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить();
	
	ТоварПоПлану = Неопределено;
	
	Для Каждого СтрокаОстатков Из ТаблицаПланФакт Цикл
		КоличествоПланОбщее = 0; //Правка бага (ранее инициализировалось Неопределено, что вызывало исключение при заполнении подсказки при отсутствии остатков по плану)
		
		Если ТоварПоПлану <> СтрокаОстатков.Товар Тогда
			ТоварПоПлану = СтрокаОстатков.Товар;
			
			СтрокаПлана = ОстаткиПлана.Найти(ТоварПоПлану, "Товар");
			Если СтрокаПлана = Неопределено Тогда
				ОстатокПлана = 0;
			Иначе
				КоличествоПланОбщее = СтрокаПлана.Количество;
				ОстатокПлана = СтрокаПлана.Количество;
			КонецЕсли;
		КонецЕсли;
		
		ОтбираемоеКоличество = Мин(ОстатокПлана, СтрокаОстатков.КоличествоОстаток);
		
		СтрокаОстатков.КоличествоПланОбщее = КоличествоПланОбщее;
		Если СтрокаОстатков.КоличествоПлан = 0 Тогда
			СтрокаОстатков.КоличествоПлан = ОтбираемоеКоличество;
		КонецЕсли;
		
		ОстатокПлана = ОстатокПлана - ОтбираемоеКоличество;
		
		Если ОтбираемоеКоличество > 0 Тогда
			СтрокаОстатков.ВРамкахПлана = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПланФакт.Сортировать("РедактированиеДоступно УБЫВ, ВРамкахПлана УБЫВ, ОтобраноРанее, Помещение, Приоритет, Наименование");
	
	Результат.ТаблицаПодсказки = ТаблицаПланФакт;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьТаблицуПланФакт(ТаблицаПлан, ТаблицаФакт, ТоварныеПоляМассив, СерииИзПлана)
	// Начало дублирует функцию ПолучитьМаршрутОтбора, думаю не стоит объединять, и так формируется сложный запрос, пока
	// без регистра. Поэтому разделение еще и логики на две функции еще больше усложнит доработку.
	Результат = Новый Структура("ВсеСобрано, ТаблицаПодсказки");
	
	ПервыйЭлемент = Истина;
	СтрокаВыбор = "";
	СтрокаГруппы = "";
	СтрокаФильтр = "";
	СтрокаСоединение = "";
	СтрокаВыборСумм = "";
	СтрокаГруппыСумм = "";
	Для Каждого ИмяПоля Из ТоварныеПоляМассив Цикл
		СтрокаВыбор  = СтрокаВыбор  + Символы.Таб + "&t." + ИмяПоля + " КАК " + ИмяПоля + "," + Символы.ПС;
		СтрокаГруппы = СтрокаГруппы + Символы.Таб + "&t." + ИмяПоля + "," + Символы.ПС;
		
		Если СерииИзПлана ИЛИ ИмяПоля <> "Серия" Тогда //Только когда СерииИзПлана, добавлять серию в поля фильтра и соединения
			Если ПервыйЭлемент Тогда
				ПервыйЭлемент = Ложь;
				СтрокаФильтр     = СтрокаФильтр     + Символы.Таб + Символы.Таб;
				СтрокаСоединение = СтрокаСоединение + Символы.Таб + Символы.Таб;
			Иначе
				СтрокаФильтр     = СтрокаФильтр     + Символы.Таб + Символы.Таб + "И "; 
				СтрокаСоединение = СтрокаСоединение + Символы.Таб + Символы.Таб + "И "; 
			КонецЕсли;
			СтрокаФильтр = СтрокаФильтр + ИмяПоля + " В(ВЫБРАТЬ Финал." + ИмяПоля + " ИЗ Финал КАК Финал)" + Символы.ПС;
			СтрокаСоединение = СтрокаСоединение + "&t1." + ИмяПоля + " = &t2." + ИмяПоля + Символы.ПС;
			СтрокаВыборСумм  = СтрокаВыборСумм  + Символы.Таб + "&t." + ИмяПоля + " КАК " + ИмяПоля + "," + Символы.ПС;
			СтрокаГруппыСумм = СтрокаГруппыСумм + Символы.Таб + "&t." + ИмяПоля + "," + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	СтрокаГруппы = Лев(СтрокаГруппы, СтрДлина(СтрокаГруппы) - 2);
	СтрокаГруппыСумм = Лев(СтрокаГруппыСумм, СтрДлина(СтрокаГруппыСумм) - 2);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыборСумм, "&t", "План") +
	"	План.Количество КАК Количество
	|ПОМЕСТИТЬ План
	|ИЗ &План КАК План
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыборСумм, "&t", "Факт") + "
	|	Факт.Количество КАК Количество 
	|ПОМЕСТИТЬ Факт
	|ИЗ &Факт КАК Факт 
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыборСумм, "&t", "План") +
	"	СУММА(План.Количество) КАК Количество
	|ПОМЕСТИТЬ ПланГрупп
	|ИЗ План КАК План
	|СГРУППИРОВАТЬ ПО
	|	" + СтрЗаменить(СтрокаГруппыСумм, "&t", "План") + 
	";
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыборСумм, "&t", "Факт") + "
	|	СУММА(Факт.Количество) КАК Количество 
	|ПОМЕСТИТЬ ФактГрупп
	|ИЗ Факт КАК Факт
	|СГРУППИРОВАТЬ ПО
	|	" + СтрЗаменить(СтрокаГруппыСумм, "&t", "Факт") + 
	";
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыборСумм, "&t", "ПланГрупп") +
	"	ПланГрупп.Количество КАК КоличествоПлан,
	|	ФактГрупп.Количество КАК КоличествоФакт,
	|	ВЫБОР КОГДА ПланГрупп.Количество > ФактГрупп.Количество ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК НеCобрано
	|ПОМЕСТИТЬ ПланФакт
	|ИЗ ПланГрупп КАК ПланГрупп
	
	|ЛЕВОЕ СОЕДИНЕНИЕ ФактГрупп КАК ФактГрупп
	|		ПО
	|" + СтрЗаменить(СтрЗаменить(СтрокаСоединение, "&t1", "ПланГрупп"), "&t2", "ФактГрупп") + "	
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыборСумм, "&t", "ПланФакт") +
	"	Номенклатура.Артикул КАК Артикул,
	|	ПланФакт.КоличествоПлан КАК КоличествоПлан,
	|	ПланФакт.КоличествоФакт КАК КоличествоФакт
	|ИЗ ПланФакт КАК ПланФакт
	
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (ПланФакт.Товар = Номенклатура.Ссылка)
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПланФакт.НеCобрано) = 0 КАК ВсеСобрано
	|ИЗ ПланФакт КАК ПланФакт
	|;";
	Запрос.УстановитьПараметр("План", ТаблицаПлан);
	Запрос.УстановитьПараметр("Факт", ТаблицаФакт);           
	
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Результат.ВсеСобрано = РезультатЗапроса[РезультатЗапроса.ВГраница()].Пустой();
	Результат.ТаблицаПодсказки = РезультатЗапроса[РезультатЗапроса.ВГраница() - 1].Выгрузить();
	
	Возврат Результат;
КонецФункции

Функция ПолучитьОстаток(СобранныеДанные) Экспорт
	Запрос = Новый Запрос;
	Фильтры = "";
	ПервоеУсловие = Истина;
	
	Для Каждого Элемент Из СобранныеДанные Цикл
		Ключ = Элемент.Ключ;
		Значение = Элемент.Значение;
		
		Если ПервоеУсловие Тогда
			ПервоеУсловие = Ложь;
		Иначе
			Фильтры = Фильтры + "И ";
		КонецЕсли;
		
		Фильтры = Фильтры + Ключ + " = &" + Ключ;		
		Фильтры = Фильтры + Символы.ПС + Символы.Таб + Символы.Таб;
		
		Запрос.УстановитьПараметр(Ключ, Значение);
	КонецЦикла;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(,
	|		" + Фильтры + ") КАК вмс_ОперацияПоЯчейкамОстатки";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Результат = Выборка.КоличествоОстаток;
	
	Возврат Результат;
КонецФункции	

// Нужна в основном для получения факта отбора при изменении контейнера при сборке в контейнер, т.к. обычными средствами
// данные не обновляются в этом случае
Функция ПолучитьФактПоСтроке(ИдентификаторОперации, СобранныеДанные) Экспорт
	Если ИдентификаторОперации = Неопределено Тогда
		Возврат 0;
	Иначе
		ОперацияПоЯчейкам = ПолучитьОперациюСеанса(ИдентификаторОперации, Ложь);
		НайденныеСтроки = ОперацияПоЯчейкам.Товары.НайтиСтроки(СобранныеДанные);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Возврат 0;
		Иначе
			Возврат НайденныеСтроки[0].Количество;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ЕстьБлокировкаЯчейки(Ячейка, Источник, БлокировкаТекст) Экспорт
	ВидыБлокировок = Новый Массив;
	ВидыБлокировок.Добавить(Перечисления.вмс_ВидыБлокировокЯчеек.Полная);
	ВидыБлокировок.Добавить(Перечисления.вмс_ВидыБлокировокЯчеек[БлокировкаТекст]);
	//БлокировкаТекст = Размещение или Отбор
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	вмс_ЗаблокированныеЯчейки.ВидБлокировки КАК ВидБлокировки
	|ИЗ
	|	РегистрСведений.вмс_ЗаблокированныеЯчейки КАК вмс_ЗаблокированныеЯчейки
	|ГДЕ
	|	вмс_ЗаблокированныеЯчейки.Ячейка = &Ячейка
	|	И вмс_ЗаблокированныеЯчейки.Источник <> &Источник
	|	И вмс_ЗаблокированныеЯчейки.ВидБлокировки В(&ВидыБлокировок)";
	Запрос.УстановитьПараметр("Ячейка", Ячейка); 
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("ВидыБлокировок", ВидыБлокировок);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
КонецФункции

Функция ОтменитьОперациюПоЯчейкам(ИдентификаторОперации) Экспорт
	Результат = Новый Структура("Успех, Сообщение", Ложь, "");
	
	Если ИдентификаторОперации = Неопределено Тогда
		Результат.Сообщение = "Не найдена операция по ячейкам, которую можно отменить, по полученному идентификатору";
		Результат.Успех = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	ОперацияОбъект = ПолучитьОперациюСеанса(ИдентификаторОперации, Истина);
	ОперацияОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
	Результат.Успех = Истина;
	
	Возврат Результат;
КонецФункции

Функция ОтменитьОтборВКонтейнер(ИдентификаторОперации, Контейнер) Экспорт
	Результат = Новый Структура("Успех, Сообщение", Ложь, "");
	
	Если ИдентификаторОперации = Неопределено Тогда
		Результат.Сообщение = "По текущему сеансу нет операции по ячейкам, которую можно отменить.";
		Возврат Результат;
	КонецЕсли;
	
	Операция = ПолучитьОперациюСеанса(ИдентификаторОперации, Истина);
	
	ТоварыТЧ = Операция.Товары;
	НайденныеСтроки = ТоварыТЧ.НайтиСтроки(Новый Структура("КонтейнерПриемник", Контейнер));
	
	Результат.Сообщение = "Отмена сборки в контейнер по текущему сеансу. Очищено: " + НайденныеСтроки.Количество() + " строк.";
	Результат.Успех = Истина;
	
	Для Каждого Строка Из НайденныеСтроки Цикл
		ТоварыТЧ.Удалить(Строка);
	КонецЦикла;
	
	Операция.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Результат;
КонецФункции

Функция ПолучитьЯчейкуОтгрузкиДокумента(Документ) Экспорт
	ЯчейкаОтгрузкиДокумента = Ложь;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.вмс_ЗаданиеКладовщику") Тогда
		ЯчейкаОтгрузкиДокумента = Документ.ЗонаПолучатель;
		Если ЯчейкаОтгрузкиДокумента = Справочники.вмс_МестаХранения.ПустаяСсылка() Тогда
			ЯчейкаОтгрузкиДокумента = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЯчейкаОтгрузкиДокумента;
КонецФункции

//////////////////////////////////////////////////////////////////////////////////
//
//				ТУ_КС+
//		Немного тут тоже потрусь )) Возможность указать ячейку для отгрузки
//

Функция ЗавершитьОперациюПоДокументу(ПараметрыОперации, ЗонаОтгрузки) Экспорт
	ВидОперации = ПараметрыОперации.ВидОперации;
	Ответственный = ПараметрыОперации.Ответственный;
	ДокументОснование = ПараметрыОперации.ДокументОснование;
	
	ПараметрыОперации = Новый Структура("ДокументОснование, ВидОперации", ДокументОснование, ВидОперации);
	ПеренестиОтобранныеТоварыВЗонуОтгрузки(ПараметрыОперации, Ответственный, ЗонаОтгрузки);
	вмс_ОперацииПоЯчейкамВызовСервера.ЗавершитьОперациюПоДокументу(ДокументОснование, ВидОперации, Ответственный);
	
КонецФункции

// Перенос из ячейки ответственного хранения в зону отгрузки
Функция ПеренестиОтобранныеТоварыВЗонуОтгрузки(ПараметрыОперации, Ответственный, ЗонаОтгрузки)
	
	РК = вмс_РаботаСКоллекциями;
	
	ТоварныеПоля = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля(Истина);
	ТоварыФакт = ПолучитьФактОтбора(ПараметрыОперации, ТоварныеПоля, Ложь, Ложь, Ложь);
	ТаблицаОперации = ТоварыФакт.Скопировать();
	ТаблицаОперации.Свернуть("Ссылка");
	
	Для Каждого СтрокаОперации Из ТаблицаОперации Цикл
		ДокументОперации = СтрокаОперации.Ссылка.ПолучитьОбъект();
		
		Для Каждого СтрокаДокумента Из ДокументОперации.Товары Цикл
			Если ЗначениеЗаполнено(СтрокаДокумента.ЯчейкаПриемник) Тогда
				СтрокаДокумента.ЯчейкаПриемник = ЗонаОтгрузки;
			КонецЕсли;
		КонецЦикла;
		
		ДокументОперации.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
	
	Функция ПеренестиОтобранныеТоварыВЗонуОтгрузки1(ПараметрыОперации, Ответственный, ЗонаОтгрузки)
		
		РК = вмс_РаботаСКоллекциями;
		
		ТоварныеПоля = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля(Истина);
		ТекстЗапроса = ПолучитьФактОтбора(Неопределено, ТоварныеПоля, Ложь, Ложь, Истина);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "вмс_ОперацияПоЯчейкамТовары.Ячейка", "вмс_ОперацияПоЯчейкамТовары.ЯчейкаПриемник");
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ДокументОснование", ПараметрыОперации.ДокументОснование);
		Запрос.УстановитьПараметр("ВидОперации", ПараметрыОперации.ВидОперации);
		ТоварыФакт = Запрос.Выполнить().Выгрузить();
		
		// удалить строки, которые уже на зоне отгрузки
		РК.УдалитьЭлементыКоллекции(ТоварыФакт, ТоварыФакт.НайтиСтроки(Новый Структура("Ячейка", ЗонаОтгрузки)));
		Если ТоварыФакт.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ПустаяЯчейка = ПредопределенноеЗначение("Справочник.вмс_МестаХранения.ПустаяСсылка");
		
		ДокументПеренос = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
		ДокументПеренос.Дата = ТекущаяДата();
		ДокументПеренос.Заполнить(Неопределено);
		ДокументПеренос.Комментарий = "#Перенос в зону отгрузки#";
		ЗаполнитьЗначенияСвойств(ДокументПеренос, ПараметрыОперации);
		ДокументПеренос.Ответственный = Ответственный;
		
		Для Каждого СтрокаФакт Из ТоварыФакт Цикл
			СтрокаДокумента = ДокументПеренос.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаФакт);
			
			СтрокаДокумента = ДокументПеренос.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаФакт);
			СтрокаДокумента.Ячейка = ПустаяЯчейка;
			СтрокаДокумента.ЯчейкаПриемник = ЗонаОтгрузки;
		КонецЦикла;
		
		ДокументПеренос.Записать(РежимЗаписиДокумента.Проведение);
		
		Возврат Истина;
		
	КонецФункции

Функция ПолучитьЗапросПланаИзСКД(СхемаКомпоновкиДанных, ДокументОснование)
	
	НастройкиКомпоновки = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки;	
	Для Каждого Поле Из СхемаКомпоновкиДанных.НаборыДанных[0].Поля Цикл
		Если НЕ ТипЗнч(Поле)=Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Поле.Роль.Обязательное = Истина;
	КонецЦикла;
	РаботаССКД.ДобавитьОтбор(НастройкиКомпоновки.Отбор.Элементы, "Ссылка", ДокументОснование, ВидСравненияКомпоновкиДанных.Равно); 
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки);
	
	Запрос = Новый Запрос(Макет.НаборыДанных[0].Запрос);
	Для Каждого ЗначениеПараметра Из Макет.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(ЗначениеПараметра.Имя, ЗначениеПараметра.Значение);
	КонецЦикла;
	
	Возврат Запрос;

КонецФункции

//
//				ТУ_КС-
//
//////////////////////////////////////////////////////////////////////////////////

