#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоляСтруктурыНастроек = "ИспользоватьПодпитку
							|ГуидРегламентногоЗаданияПодпитки";
	
	ИмяЭтойФормы = Метаданные.Справочники.вмс_НастройкиПрограммы.Формы.ФормаНастройкиПодпитки.Имя;
	
	оОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.вмс_НастройкиПрограммы"));
	СтруктураНастроек = оОбъект.ХранилищеНастройки.Получить();
	
	Если НЕ СтруктураНастроек = Неопределено тогда
		ОтобразитьСохраненныеЗначенияНаФорме(СтруктураНастроек);
	КонецЕсли;
	
	НастроитьВидимостьОсновныхЭлементовФормы();
	
КонецПроцедуры  

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СтруктураНастроек = ЗаполнитьНастройкиПоДаннымФормы();       
	СменитьНастройкуИспользованияПодпитки(НастройкаВключитьПодпитку);	
	ПоместитьСтруктуруНастроекВХранилищеЗначений(СтруктураНастроек);  
	
	Закрыть();
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьГуидРегламентногоЗаданияПодпитки()
	
	//пробуем найти по гуиду, так и должно находить
	МенеджерНастроек = Справочники.вмс_НастройкиПрограммы; 
	ГуидРегламентногоЗаданияСтрокой = СокрЛП(МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("Подпитка_ГуидРегламентногоЗадания"));   
	
	Если СтрДлина(ГуидРегламентногоЗаданияСтрокой) > 0 Тогда
		ГуидРегламентногоЗадания = Новый УникальныйИдентификатор(ГуидРегламентногоЗаданияСтрокой); 	
		Возврат ГуидРегламентногоЗадания;
	КонецЕсли;
	
	//если каким то образом гуида нет, пробуем по ключу, но по ключу не надежно и это уже не правильно
	Отбор = Новый Структура("Ключ", "ПодпиткаЯчеекОтбораВмс");	  
	НайденноеРегламентноеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	Если НайденноеРегламентноеЗадания.Количество() > 0 Тогда
		РегламентноеЗадание = НайденноеРегламентноеЗадания[0]; 
		Возврат РегламентноеЗадание.УникальныйИдентификатор;
	КонецЕсли;  
	
	МетаданныеЗадания = Метаданные.РегламентныеЗадания.вмс_ВыполнятьПодпиткуЯчеекОтбора;
	РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеЗадания);  
	РегламентноеЗадание.Наименование = "Подпитка ячеек отбора (вмс)";
	РегламентноеЗадание.Ключ = "ПодпиткаЯчеекОтбораВмс"; 
	РегламентноеЗадание.Использование = Ложь;  
	РегламентноеЗадание.Записать(); 
	
	ГуидРегламентногоЗаданияПодпитки = Строка(РегламентноеЗадание.УникальныйИдентификатор);
	МенеджерНастроек.ЗаписатьНастройкуПрограммы("Подпитка_ГуидРегламентногоЗадания", ГуидРегламентногоЗаданияПодпитки); 
	
	Возврат РегламентноеЗадание.УникальныйИдентификатор;        
	
КонецФункции

&НаКлиенте
Процедура ОткрытьРегламентноеЗадание(Команда) 
	
	Гуид = ПолучитьГуидРегламентногоЗаданияПодпитки(); 
	ПараметрыФормы = Новый Структура("Идентификатор, Действие",Гуид, "Изменить"); 
	ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание", ПараметрыФормы); 
	
КонецПроцедуры     

&НаКлиенте
Процедура НастройкаВключитьПодпиткуПриИзменении(Элемент)  
	
	Если НастройкаВключитьПодпитку = Ложь Тогда
		РегламентноеЗаданиеВключено = ПроверитьИспользованиеРегламеногоЗаданияПодпитки();     
		Если РегламентноеЗаданиеВключено Тогда   
			НастройкаВключитьПодпитку = Истина;
			ОО = Новый ОписаниеОповещения("ПодтверждениеОтключенияПодпитки", ЭтотОбъект);	
			ПоказатьВопрос(ОО, "Регламентное задание формирования подпиток будет отключено. Продолжить?", РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	НастроитьВидимостьОсновныхЭлементовФормы();
	
КонецПроцедуры
#КонецОбласти 

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ОтобразитьСохраненныеЗначенияНаФорме(СтруктураНастроек)
	
	НастройкаВключитьПодпитку = СтруктураНастроек.ИспользоватьПодпитку;
	ГуидРегламентногоЗаданияПодпитки = СтруктураНастроек.ГуидРегламентногоЗаданияПодпитки;	
КонецПроцедуры  

&НаКлиенте
Функция ЗаполнитьНастройкиПоДаннымФормы()
	
	СтруктураНастроек = НовыеНастройкиПодпитки();	
	СтруктураНастроек.ИспользоватьПодпитку 				= НастройкаВключитьПодпитку;   
	СтруктураНастроек.ГуидРегламентногоЗаданияПодпитки 	= ГуидРегламентногоЗаданияПодпитки;
	
	Возврат СтруктураНастроек;
	
КонецФункции   

&НаКлиенте
Функция НовыеНастройкиПодпитки()
	
	СтруктураНастроек = новый Структура;	
	СтруктураНастроек.Вставить("ИспользоватьПодпитку");	  
	СтруктураНастроек.Вставить("ГуидРегламентногоЗаданияПодпитки");
		
	Возврат СтруктураНастроек;
	
КонецФункции  

&НаСервере
Процедура ПоместитьСтруктуруНастроекВХранилищеЗначений(СтруктураНастроек)
	
	оОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.вмс_НастройкиПрограммы"));
	ХранилищеЗнач = Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных(9));
	
	оОбъект.ХранилищеНастройки = ХранилищеЗнач;
	оОбъект.Записать();
	
КонецПроцедуры    

&НаСервере
Процедура НастроитьВидимостьОсновныхЭлементовФормы()  
	
	Если НЕ НастройкаВключитьПодпитку Тогда
		Элементы.ГруппаИнформацияИРасписание.Видимость = Ложь;
	Иначе
		Элементы.ГруппаИнформацияИРасписание.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьИспользованиеРегламеногоЗаданияПодпитки() 
		
	МенеджерНастроек = Справочники.вмс_НастройкиПрограммы; 
	ГуидРегламентногоЗаданияСтрокой = СокрЛП(МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("Подпитка_ГуидРегламентногоЗадания")); 
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ГуидРегламентногоЗаданияСтрокой));
	Возврат РегламентноеЗадание.Использование;
			
КонецФункции 

&НаКлиенте
Процедура ПодтверждениеОтключенияПодпитки(Результат, ДополнительныеПараметры = Неопределено) Экспорт    
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОтключитьИспользованиеРегламентногоЗадания();
		НастроитьВидимостьОсновныхЭлементовФормы();	 
		НастройкаВключитьПодпитку = Ложь;  
		СменитьНастройкуИспользованияПодпитки(НастройкаВключитьПодпитку);
	КонецЕсли;
	
КонецПроцедуры      

&НаСервере
Процедура СменитьНастройкуИспользованияПодпитки(ИспользоватьПодпитку)    
	
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("ИспользоватьПодпитку", ИспользоватьПодпитку);
		
КонецПроцедуры


&НаСервере
Процедура ОтключитьИспользованиеРегламентногоЗадания()    
	 
	МенеджерНастроек = Справочники.вмс_НастройкиПрограммы; 
	ГуидРегламентногоЗаданияСтрокой = СокрЛП(МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("Подпитка_ГуидРегламентногоЗадания")); 
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ГуидРегламентногоЗаданияСтрокой)); 
	РегламентноеЗадание.Использование = Ложь;
	РегламентноеЗадание.Записать();
	
КонецПроцедуры


#КонецОбласти

