#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если Справочники.вмс_КарточкаПоклажедателя.НайтиПоНаименованию(Контрагент.Наименование) = Справочники.вмс_КарточкаПоклажедателя.ПустаяСсылка() Тогда
		НоваяГруппа = Справочники.вмс_КарточкаПоклажедателя.СоздатьГруппу();
		НоваяГруппа.Наименование = Контрагент.Наименование;
		НоваяГруппа.Записать();
	КонецЕсли;
	
КонецПроцедуры
Процедура ПередЗаписью(Отказ)
	
	Наименование = СокрЛП(Наименование);
	ПервичныйПароль = СокрЛП(ПервичныйПароль);
	Почта = СокрЛП(Почта);
	Телефон = СокрЛП(Телефон);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	вмс_Поклажедатели.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик,
	|	вмс_Поклажедатели.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_Поклажедатели КАК вмс_Поклажедатели
	|ГДЕ
	|	вмс_Поклажедатели.Контрагент = &Контрагент
	|	И вмс_Поклажедатели.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);   
	
	Если ЭтоНовый() Тогда 
		ПараметрСсылка = ПолучитьСсылкуНового();
	Иначе
		ПараметрСсылка = Ссылка;		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрСсылка);	
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		Если Выборка.ИспользованиеХарактеристик <> ИспользованиеХарактеристик Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Поклажедатель не создан. Ранее при создании поклажедателя контрагента %1 использование характерик было в значении %2", Контрагент, Выборка.ИспользованиеХарактеристик);
			Сообщение.Сообщить();  
			
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Иначе

#КонецЕсли