// ТУ_Уварова 03.09.2026 ++ 3.2.6
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		
		НовыйНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
		НовыйНоменклатура.Наименование = Наименование;
		НовыйНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуга");
			
		НовыйНоменклатура.Записать();
		
		Номенклатура = НовыйНоменклатура.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

// ТУ_Уварова 03.09.2026 -- 3.2.6



