#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		Если ПометкаУдаления Тогда    
			Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
			Характеристика = вмс_АдаптацияКонфигураций.ПустаяХарактеристика();
			Упаковка = вмс_АдаптацияКонфигураций.ПустаяУпаковка();
		Иначе
			Если Номенклатура <> Справочники.Номенклатура.ПустаяСсылка() Тогда
				НеЗаписыватьКарточку = Ложь;
				
				Если Упаковка = вмс_АдаптацияКонфигураций.ПустаяУпаковка() Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Не указано сопоставление с упаковкой учетной системы";
					Сообщение.Сообщить();   
					
					НеЗаписыватьКарточку = Истина;
				КонецЕсли; 
				
				Если вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПроверкаИспользованияХарактеристикПоКонтрагенту(Контрагент) Тогда
					Если НЕ БезХарактеристики Тогда
						Если Характеристика = вмс_АдаптацияКонфигураций.ПустаяХарактеристика() Тогда
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Не указано сопоставление с характеристикой учетной системы";
							Сообщение.Сообщить();     
							
							НеЗаписыватьКарточку = Истина;
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	вмс_КарточкаПоклажедателя.Наименование КАК Наименование,
				|	вмс_КарточкаПоклажедателя.ХарактеристикаПоклажедателя КАК ХарактеристикаПоклажедателя
				|ИЗ
				|	Справочник.вмс_КарточкаПоклажедателя КАК вмс_КарточкаПоклажедателя
				|ГДЕ
				|	вмс_КарточкаПоклажедателя.Номенклатура = &НоменклатураУчетнойСистемы
				|	И вмс_КарточкаПоклажедателя.Характеристика = &ХарактеристикаУчетнойСистемы
				|	И вмс_КарточкаПоклажедателя.Ссылка <> &Ссылка";  
				
				Запрос.УстановитьПараметр("НоменклатураУчетнойСистемы",Номенклатура);      
				Запрос.УстановитьПараметр("ХарактеристикаУчетнойСистемы",Характеристика);
				Запрос.УстановитьПараметр("Ссылка",Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить(); 
				
				Если НЕ РезультатЗапроса.Пустой() Тогда    
					НеЗаписыватьКарточку = Истина;
					
					Выборка = РезультатЗапроса.Выбрать(); 
					
					Если Выборка.Количество() = 1 Тогда
						Выборка.Следующий(); 
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Найдена номенклатура уч. системы с таким же сопоставлением: %1 %2", Выборка.Наименование, Выборка.ХарактеристикаПоклажедателя);
						Сообщение.Сообщить();		
					ИначеЕсли Выборка.Количество() > 1 Тогда 
						Выборка.Следующий(); 
						
						СписокНоменклатур = "";
						СписокНоменклатур = СписокНоменклатур + " " + Выборка.Наименование + " " + Выборка.ХарактеристикаПоклажедателя; 
						
						Пока Выборка.Следующий() Цикл
							СписокНоменклатур = СписокНоменклатур + ", " + Выборка.Наименование + " " + Выборка.ХарактеристикаПоклажедателя;		
						КонецЦикла;
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Найдена номенклатура уч. системы с таким же сопоставлением: %1", СписокНоменклатур);
						Сообщение.Сообщить();	
					КонецЕсли;
				КонецЕсли;
				
				Если НеЗаписыватьКарточку Тогда
					Отказ = Истина;		
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

#Иначе

#КонецЕсли