
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сервис = Параметры.Сервис;
	ТипОперации = Параметры.ТипОперации;
	Организация = Параметры.Организация;
	
	Если Не ЗначениеЗаполнено(Сервис) Тогда
		Сервис = МодульОбъекта().СервисПодпискиПоТипуОперации(ТипОперации);
	КонецЕсли;
	
	МодульОбъекта().Метрика_ОграничениеТарифа(Организация, Сервис, ТипОперации);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодробнееНажатие(Элемент)
	
	МодульКлиента().ОткрытьИнформациюОТарифах();
	
КонецПроцедуры

// #КонецОбласти
