#Область ИерархияКонтейнеров  

Процедура ЗаписатьИерархиюКонтейнера(Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контейнеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_Контейнеры КАК Контейнеры
	|ГДЕ
	|	Контейнеры.Ссылка В ИЕРАРХИИ(&Ссылка)
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДеревоИерархии = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЭлементТекущегоСправочника = ДеревоИерархии.Строки.Найти(Ссылка,"Ссылка",Истина);
	
	Если ЭлементТекущегоСправочника <> Неопределено Тогда
		
		ВыполнитьЗаписьВРегистрПоКонтейнеру(ЭлементТекущегоСправочника);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьЗаписьПоПодчиненнымПартнерам(СтрокиДерева,ТекущийЭлементОбработки)
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если СтрокаДерева.Ссылка <> ТекущийЭлементОбработки Тогда
			ВыполнитьЗаписьВРегистрПоКонтейнеру(СтрокаДерева);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьЗаписьВРегистрПоКонтейнеру(СтрокаДерева);
	
	НаборЗаписей = РегистрыСведений.вмс_ИерархияКонтейнеров.СоздатьНаборЗаписей();
	НаборЗаписей.Заполнить(Неопределено);
	НаборЗаписей.Отбор.Контейнер.Установить(СтрокаДерева.Ссылка);
	
	РодительСтрокиДерева = СтрокаДерева;
	Пока РодительСтрокиДерева <> Неопределено Цикл
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Контейнер  = СтрокаДерева.Ссылка;
		ЗаписьНабора.Родитель = РодительСтрокиДерева.Ссылка;
		ЗаписьНабора.Уровень  = РодительСтрокиДерева.Уровень();
		РодительСтрокиДерева  = РодительСтрокиДерева.Родитель;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	ВыполнитьЗаписьПоПодчиненнымПартнерам(СтрокаДерева.Строки, СтрокаДерева.Ссылка);
	
КонецПроцедуры

// Функция - Получить верхний уровень контейнеров
//
// Функция вернет самый верхний уровень для каждого переданного контейнера.
//
// Параметры:
//  Контейнеры	 -Массив, СправочникСсылка.вмс_Контейнеры 	 -Контейнер либо массив контейнеров для обработки 
// 
// Возвращаемое значение:
//   -ТаблицаЗначений 		-Таблица верхних уровней 
//
Функция ПолучитьВерхнийУровеньКонтейнеров(Контейнеры) 
	
	МассивКонтейнеров = ПреобразоватьВходящийПараметрКонтейнер(Контейнеры); 
	
	Если МассивКонтейнеров = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	лТекст = "
	|ВЫБРАТЬ
	|	вмс_ИерархияКонтейнеров.Контейнер КАК Контейнер,
	|	вмс_ИерархияКонтейнеров.Родитель КАК Родитель
	|ИЗ
	|	РегистрСведений.вмс_ИерархияКонтейнеров КАК вмс_ИерархияКонтейнеров
	|ГДЕ
	|	вмс_ИерархияКонтейнеров.Контейнер В (&Контейнеры)
	|	И вмс_ИерархияКонтейнеров.Уровень = 0
	|";
	
	лЗапрос = Новый Запрос(лТекст);
	лЗапрос.УстановитьПараметр("Контейнеры", МассивКонтейнеров);
	Результат = лЗапрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИерархиюКонтейнеров(Контейнеры) 
	
	МассивКонтейнеров = ПреобразоватьВходящийПараметрКонтейнер(Контейнеры); 
	
	Если МассивКонтейнеров = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	лТекст = "
	|ВЫБРАТЬ
	|	вмс_ИерархияКонтейнеров.Контейнер КАК Контейнер,
	|	вмс_ИерархияКонтейнеров.Родитель КАК Родитель,
	|  	вмс_ИерархияКонтейнеров.Уровень КАК Уровень
	|ИЗ
	|	РегистрСведений.вмс_ИерархияКонтейнеров КАК вмс_ИерархияКонтейнеров
	|ГДЕ
	|	вмс_ИерархияКонтейнеров.Родитель В (&МассивКонтейнеров)
	|";
	
	лЗапрос = Новый Запрос(лТекст);
	лЗапрос.УстановитьПараметр("Контейнер", МассивКонтейнеров);
	Результат = лЗапрос.Выполнить().Выгрузить();	
	Возврат Результат;
	
КонецФункции  

Функция ПреобразоватьВходящийПараметрКонтейнер(Контейнеры)
	
	Если ТипЗнч(Контейнеры) = Тип("СправочникСсылка.вмс_Контейнеры") Тогда
		МассивКонтейнеров = вмс_РаботаСКоллекциями.ЗначениеВМассив(Контейнеры);
	ИначеЕсли ТипЗнч(Контейнеры) = Тип("Массив") Тогда
		МассивКонтейнеров = Контейнеры;
	Иначе
		ЗаписьЖурналаРегистрации("AS:WMS", УровеньЖурналаРегистрации.Ошибка,
									,,СтрШаблон("Недопустимый тип объекта %1. Тип: %2", Контейнеры, ТипЗнч(Контейнеры)));
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат МассивКонтейнеров;
		
КонецФункции



#КонецОбласти
