//******************************************************************
//{ Адаптация

Функция глПолучитьОбщиеМодули(ИменаМодулей)
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ПолучитьОбщиеМодули(ИменаМодулей);
	
КонецФункции

Функция глОбщийМодуль(ИмяМодуля)

	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
	
КонецФункции

Функция ЗдесьОстановиПоБратски()
	
	ТочкаОстановы = 1;
	
	Возврат ТочкаОстановы;
	
КонецФункции

//} Адаптация
//******************************************************************

Функция НовыйПроцессорУправленияОстатками() Экспорт
	
	Перем РК, ОЯКС, ОНВС;
	
	ОбщиеМодули = глПолучитьОбщиеМодули(	"РаботаСКоллекциями,
	|ОперацииПоЯчейкамКлиентСервер,
	|ОбщегоНазначенияВызовСервера,
	|ОбщегоНазначенияКлиентСервер,
	|ИндексированиеКоллекций,
	|УправлениеОстаткамиНовыйВызовСервера,
	|УправлениеОстаткамиНовыйСервер,
	|АдаптацияКонфигураций,
	|ПартионныйУчетВызовСервера");
	
	ОбщиеМодули.Вставить("ОбщегоНазначения", ОбщиеМодули.ОбщегоНазначенияКлиентСервер);
	ОбщиеМодули.Вставить("ОперацииПоЯчейкам", ОбщиеМодули.ОперацииПоЯчейкамКлиентСервер);
	
	РК = ОбщиеМодули.РаботаСКоллекциями;
	ОЯКС = ОбщиеМодули.ОперацииПоЯчейкам;
	ОНВС = ОбщиеМодули.ОбщегоНазначенияВызовСервера;
	
	ТоварныеПоляМассив = ОЯКС.ИспользуемыеТоварныеПоля();
	
	ТоварныеПоля = РК.МассивВСтроку(ТоварныеПоляМассив);   
	
	ПоляТаблицыИнструкций = "НомерСтрокиДокумента, ЯчейкаОтправитель, ЯчейкаТранзит, ЯчейкаПриемник, КонтейнерОтправитель, КонтейнерПриемник, Контейнер, " + ТоварныеПоля + ", Количество,НаследоватьЯчейкуПоКонтейнеру, ПриравнятьКоличество, ПересчетВКонтейнере, ПересчетКонтейнераРодителя, ДополнительныеДанные";
	ТаблицаИнструкций = РК.НоваяКоллекцияЗначений(ПоляТаблицыИнструкций);
	ТаблицаИнструкцийРазложенная = РК.НоваяКоллекцияЗначений(ПоляТаблицыИнструкций);
	
	ТоварныеПоляРегистра = ТоварныеПоля;
	Если ТоварныеПоляМассив.Найти("Серия")=Неопределено Тогда
		// обязательно добавим, для заполнения по умолчанию
		ТоварныеПоляРегистра = ТоварныеПоляРегистра + ", Серия";
	КонецЕсли;       
	// ТУ_Прошин_10.11.25+
	Если ТоварныеПоляМассив.Найти("Качество")=Неопределено Тогда
		// обязательно добавим, для заполнения по умолчанию
		ТоварныеПоляРегистра = ТоварныеПоляРегистра + ", Качество";
	КонецЕсли;
	Если ТоварныеПоляМассив.Найти("Упаковка")=Неопределено Тогда
		// обязательно добавим, для заполнения по умолчанию
		ТоварныеПоляРегистра = ТоварныеПоляРегистра + ", Упаковка";
	КонецЕсли; 
	// ТУ_Прошин_10.11.25-
	
	// ТУ_Прошин_13.01.26 
	// Удален склад из ТаблицаДвиженийРегистраОстатковТоваровВЯчейках 
	ТаблицаДвиженийРегистраОстатковТоваровВЯчейках = РК.НоваяКоллекцияЗначений("НомерСтрокиДокумента, Период, Регистратор, ВидДвижения, Ячейка, Контейнер, " + ТоварныеПоляРегистра + ", Количество");
	ТаблицаДвиженийРегистраОстатковТоваровВКонтейнерах = РК.НоваяКоллекцияЗначений("НомерСтрокиДокумента, Период, Регистратор, ВидДвижения, Контейнер, " + ТоварныеПоляРегистра + ", Количество");
	ТаблицаДвиженийРегистраМестоположенияКонтейнеров = РК.НоваяКоллекцияЗначений("Период, Регистратор, Контейнер, КонтейнерРодитель, КонтейнерОстатковВЯчейках, Ячейка");
	РК.ДобавитьИндексКоллекции(ТаблицаДвиженийРегистраМестоположенияКонтейнеров, "Контейнер");
	
	ДвиженияРегистров = Новый Структура;
	ДвиженияРегистров.Вставить("ОстаткиТоваровВЯчейках", ТаблицаДвиженийРегистраОстатковТоваровВЯчейках);
	ДвиженияРегистров.Вставить("ОстаткиТоваровВКонтейнерах", ТаблицаДвиженийРегистраОстатковТоваровВКонтейнерах);
	ДвиженияРегистров.Вставить("МестоположенияКонтейнеров", ТаблицаДвиженийРегистраМестоположенияКонтейнеров);
	
	ПустойТовар = ОНВС.ПолучитьПустуюСсылкуНаТовар(); 
	#Если Сервер Тогда
		ПустаяЯчейка = Справочники.вмс_МестаХранения.ПустаяСсылка();
		ПустойКонтейнер = Справочники.вмс_Контейнеры.ПустаяСсылка(); 
		ПустаяХарактеристика = вмс_АдаптацияКонфигураций.ПустаяХарактеристика();
		ПустаяСерия = Справочники.вмс_СерииНоменклатуры.ПустаяСсылка();
		КачествоНовый = Перечисления.вмс_КачествоТовара.Новый;
		ВидКонтейнераПаллет = Перечисления.вмс_ВидыКонтейнеров.Паллета;
		ВидКонтейнераКороб = Перечисления.вмс_ВидыКонтейнеров.Короб;
	#Иначе
		ПустаяЯчейка = ПредопределенноеЗначение("Справочник.вмс_МестаХранения.ПустаяСсылка");
		ПустойКонтейнер = ПредопределенноеЗначение("Справочник.вмс_Контейнеры.ПустаяСсылка");     
		ПустаяХарактеристика = вмс_АдаптацияКонфигураций.ПустаяХарактеристика();
		ПустаяСерия = ПредопределенноеЗначение("Справочник.вмс_СерииНоменклатуры.ПустаяСсылка");
		КачествоНовый = ПредопределенноеЗначение("Перечисление.вмс_КачествоТовара.Новый");
		ВидКонтейнераПаллет = ПредопределенноеЗначение("Перечисление.вмс_ВидыКонтейнеров.Паллета");
		ВидКонтейнераКороб = ПредопределенноеЗначение("Перечисление.вмс_ВидыКонтейнеров.Короб");
	#КонецЕсли
	ЯчейкаДляНеразмещенныхКонтейнеров = ОбщиеМодули.ПартионныйУчетВызовСервера.ЯчейкаДляНеразмещенныхКонтейнеров();
	
	Процессор = Новый Структура;
	Процессор.Вставить("ОбщиеМодули", ОбщиеМодули);
	
	Процессор.Вставить("ТоварныеПоляМассив", ТоварныеПоляМассив);
	Процессор.Вставить("ТоварныеПоля", ТоварныеПоля);
	Процессор.Вставить("ТаблицаИнструкций", ТаблицаИнструкций);
	Процессор.Вставить("ТаблицаИнструкцийРазложенная", ТаблицаИнструкцийРазложенная);
	
	Процессор.Вставить("ПустойТовар", ПустойТовар);
	Процессор.Вставить("ПустаяЯчейка", ПустаяЯчейка); 
	Процессор.Вставить("ЯчейкаДляНеразмещенныхКонтейнеров", ЯчейкаДляНеразмещенныхКонтейнеров);
	Процессор.Вставить("ПустаяХарактеристика", ПустаяХарактеристика);
	Процессор.Вставить("ПустойКонтейнер", ПустойКонтейнер);
	Процессор.Вставить("ПустаяСерия", ПустаяСерия);
	Процессор.Вставить("ВидКонтейнераПаллет", ВидКонтейнераПаллет);
	Процессор.Вставить("ВидКонтейнераКороб", ВидКонтейнераКороб);
	Процессор.Вставить("КачествоНовый", КачествоНовый);
	Процессор.Вставить("Данные", Новый Структура);
	Процессор.Вставить("ДвиженияРегистров", ДвиженияРегистров);
	Процессор.Вставить("Ошибки", РК.НоваяКоллекцияЗначений("НомерСтроки, Текст"));
	Процессор.Вставить("Отказ", Ложь);
	Процессор.Вставить("ДокументОперации");
	Процессор.Вставить("Дата", '00010101');
	Процессор.Вставить("ПересчитываемыеКонтейнеры", Новый Массив);
	
	ПоляОстатковТоваровВЯчейках = ТоварныеПоля + ", Ячейка, Контейнер";
	ДобавитьИндекс(Процессор, "ОстаткиТоваровВЯчейках", ПоляОстатковТоваровВЯчейках, "Количество");      
	ПоляКомбинацииСпустымиЗначениями = "Товар, Ячейка, Контейнер";
	Если ТоварныеПоляМассив.Найти("Серия") <> Неопределено Тогда  
		ПоляКомбинацииСпустымиЗначениями = "Товар, Серия, Ячейка, Контейнер";
	КонецЕсли;
	
	ДобавитьВИндексКомбинацииСПустымиЗначениямиПолей(Процессор, "ОстаткиТоваровВЯчейках", ПоляКомбинацииСпустымиЗначениями, Новый Структура("Товар, Ячейка, Характеристика, Серия", ПустойТовар, ПустаяЯчейка, ПустаяХарактеристика, ПустаяСерия));
	Индекс = ДобавитьИндекс(Процессор, "ЗапросОстатковТоваровВЯчейках", ПоляОстатковТоваровВЯчейках, "Количество");
	Индекс.ДополнительныеДанные.Вставить("ЗначенияНенайденныхДанных", Новый Структура("Количество", 0));
	Индекс = ДобавитьИндекс(Процессор, "ЗапросОстатковКонтейнеровВЯчейках", ПоляОстатковТоваровВЯчейках, "Количество");
	Индекс.ДополнительныеДанные.Вставить("ЗначенияНенайденныхДанных", Новый Структура("Количество", 0));
	
	ПоляОстатковТоваровВКонтейнерах = "Контейнер, " + ТоварныеПоля;
	ДобавитьИндекс(Процессор, "ОстаткиТоваровВКонтейнерах", ПоляОстатковТоваровВКонтейнерах, "Количество");
	Индекс = ДобавитьИндекс(Процессор, "ЗапросОстатковТоваровВКонтейнерах", ПоляОстатковТоваровВКонтейнерах, "Количество");
	Индекс.ДополнительныеДанные.Вставить("ЗначенияНенайденныхДанных", Новый Структура("Количество", 0));
	
	ДобавитьИндекс(Процессор, "МестоположенияКонтейнеров", "Контейнер", "КонтейнерРодитель, КонтейнерОстатковВЯчейках, Ячейка");
	Индекс = ДобавитьИндекс(Процессор, "ЗапросМестоположенийКонтейнеров", "Контейнер", "КонтейнерРодитель, КонтейнерОстатковВЯчейках, Ячейка");
	Индекс.ДополнительныеДанные.Вставить("ЗначенияНенайденныхДанных", Новый Структура("КонтейнерРодитель, КонтейнерОстатковВЯчейках, Ячейка", ПустойКонтейнер, ПустойКонтейнер, ЯчейкаДляНеразмещенныхКонтейнеров));
	
	Возврат Процессор;
	
КонецФункции

Функция ЗагрузитьТаблицуИнструкций(Процессор, ОперацияПоЯчейкам) Экспорт
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	ОНВС = Процессор.ОбщиеМодули.ОбщегоНазначенияВызовСервера;
	
	ТаблицаОперации = ПолучитьТаблицуОперации(Процессор, ОперацияПоЯчейкам);
	
	РК.ДобавитьЭлементыКоллекции(Процессор.ТаблицаИнструкций, ТаблицаОперации);
	
	Если ТипЗнч(ОперацияПоЯчейкам)=Тип("ДокументСсылка.вмс_ОперацияПоЯчейкам") Тогда
		Процессор.ДокументОперации = ОперацияПоЯчейкам;
		Процессор.Дата = ОНВС.ПолучитьЗначениеРеквизитаОбъекта(Процессор.ДокументОперации, "Дата")
	Иначе
		Процессор.ДокументОперации = ОперацияПоЯчейкам.Ссылка;
		Процессор.Дата = ОперацияПоЯчейкам.Дата;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуОперации(Процессор, ОперацияПоЯчейкам)
	
	Перем ОН;
	
	Если ТипЗнч(ОперацияПоЯчейкам)=Тип("ДокументСсылка.вмс_ОперацияПоЯчейкам") Тогда
		ОН = Процессор.ОбщиеМодули.ОбщегоНазначения;
		Запрос = ОН.НовыйЗапрос(
		"ВЫБРАТЬ
		|	ТаблицаДокумента.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	ТаблицаДокумента.Товар КАК Товар,
		|	ТаблицаДокумента.Характеристика КАК Характеристика,
		|	ТаблицаДокумента.Ячейка КАК ЯчейкаОтправитель,
		|	ТаблицаДокумента.ЯчейкаТранзит КАК ЯчейкаТранзит,
		|	ТаблицаДокумента.ЯчейкаПриемник КАК ЯчейкаПриемник,
		|	ТаблицаДокумента.Контейнер КАК Контейнер,
		|	ТаблицаДокумента.КонтейнерОтправитель КАК КонтейнерОтправитель,
		|	ТаблицаДокумента.КонтейнерПриемник КАК КонтейнерПриемник,
		|	ТаблицаДокумента.Количество КАК Количество,
		|	ТаблицаДокумента.ПересчетКонтейнераРодителя КАК ПересчетКонтейнераРодителя,
		|	ТаблицаДокумента.ПриравнятьКоличество КАК ПриравнятьКоличество
		|ИЗ
		|	Документ.вмс_ОперацияПоЯчейкам.Товары КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &ОперацияПоЯчейкам
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		Запрос.Параметры.Вставить("ОперацияПоЯчейкам", ОперацияПоЯчейкам);
		ТаблицаОперации = ОН.ПолучитьТаблицуРезультатаЗапроса(Запрос);
	Иначе
		ТаблицаОперации = ОперацияПоЯчейкам.Товары.Выгрузить();
		ТаблицаОперации.Колонки.Ячейка.Имя = "ЯчейкаОтправитель";
	КонецЕсли;
	
	Возврат ТаблицаОперации;
	
КонецФункции

Функция ЗаполнитьПустыеЗначенияТаблицыИнструкций(Процессор, ТаблицаИнструкций)
	
	Перем РК;
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	Для Каждого СтрокаИнструкции Из РК.ПолучитьЭлементыКоллекции(ТаблицаИнструкций) Цикл
		
		Если СтрокаИнструкции.ЯчейкаОтправитель=Неопределено Тогда
			СтрокаИнструкции.ЯчейкаОтправитель = Процессор.ПустаяЯчейка;
		КонецЕсли;
		
		Если СтрокаИнструкции.ЯчейкаПриемник=Неопределено Тогда
			СтрокаИнструкции.ЯчейкаПриемник = Процессор.ПустаяЯчейка;
		КонецЕсли;
		
		Если СтрокаИнструкции.КонтейнерОтправитель=Неопределено Тогда
			СтрокаИнструкции.КонтейнерОтправитель = Процессор.ПустойКонтейнер;
		КонецЕсли;

		Если СтрокаИнструкции.КонтейнерПриемник=Неопределено Тогда
			СтрокаИнструкции.КонтейнерПриемник = Процессор.ПустойКонтейнер;
		КонецЕсли;
		
		Если СтрокаИнструкции.Контейнер=Неопределено Тогда
			СтрокаИнструкции.Контейнер = Процессор.ПустойКонтейнер;
		КонецЕсли;

		Если СтрокаИнструкции.Товар=Неопределено Тогда
			СтрокаИнструкции.Товар = Процессор.ПустойТовар;
		КонецЕсли;
		
		Если СтрокаИнструкции.ПриравнятьКоличество=Неопределено Тогда
			СтрокаИнструкции.ПриравнятьКоличество = Ложь;
		КонецЕсли;
		
		Если СтрокаИнструкции.ДополнительныеДанные=Неопределено Тогда
			ДвиженияРегистров = Новый Структура;
			Для Каждого ДвижениеРегистра Из Процессор.ДвиженияРегистров Цикл
				ДвиженияРегистров.Вставить(ДвижениеРегистра.Ключ, Новый Массив);
			КонецЦикла;
			
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("Скомпилирована", Ложь);
			ДополнительныеДанные.Вставить("ДвиженияРегистров", ДвиженияРегистров);
			СтрокаИнструкции.ДополнительныеДанные = ДополнительныеДанные;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция СформироватьДвиженияПоРегистрам(Процессор) Экспорт
	
	НачатьФормированиеДвижений(Процессор);
	
	ВыполнитьКомпиляциюПервогоУровня(Процессор);
	Если Процессор.Отказ Тогда

		ПоказатьОшибкиПроведения(Процессор);
		Возврат Ложь;
		
	КонецЕсли;
	
	ВыполнитьКомпиляциюВторогоУровня(Процессор);	

	ЗагрузитьОстатки(Процессор);
	
	ВыполнитьКомпиляциюТретьегоУровня(Процессор);
	
	ЗакончитьФормированиеДвижений(Процессор);
	
	Если Процессор.Отказ Тогда
		
		ПоказатьОшибкиПроведения(Процессор);
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЛицензияКонтейнерыДоступна(Процессор)
	
	Возврат Процессор.ОбщиеМодули.УправлениеОстаткамиНовыйВызовСервера.ЛицензияКонтейнерыДоступна();
	
КонецФункции

Функция НачатьФормированиеДвижений(Процессор)

	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	Процессор.Отказ = Ложь;
	РК.ОчиститьЭлементыКоллекции(Процессор.Ошибки);
	
	ЗаполнитьПустыеЗначенияТаблицыИнструкций(Процессор, Процессор.ТаблицаИнструкций);
	РК.ОчиститьЭлементыКоллекции(Процессор.ТаблицаИнструкцийРазложенная);
	
КонецФункции

// Разложение инструкций на расход и приход
Функция ВыполнитьКомпиляциюПервогоУровня_Измененная(Процессор)
	
	Перем РК;
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;

	ТоварныеПоля = Процессор.ТоварныеПоля;
	
	ПустойТовар = Процессор.ПустойТовар;
	ПустаяЯчейка = Процессор.ПустаяЯчейка;
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	
	ЛицензияКонтейнерыНедоступна = НЕ ЛицензияКонтейнерыДоступна(Процессор);

	Для Каждого СтрокаИнструкции Из РК.ПолучитьЭлементыКоллекции(Процессор.ТаблицаИнструкций) Цикл
		
		Если ЛицензияКонтейнерыНедоступна Тогда
			
			Если СтрокаИнструкции.Контейнер <> ПустойКонтейнер
				ИЛИ СтрокаИнструкции.КонтейнерОтправитель <> ПустойКонтейнер
				ИЛИ СтрокаИнструкции.КонтейнерПриемник <> ПустойКонтейнер Тогда
				
				ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, "операции с контейнерами недоступны");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаИнструкции.Товар=ПустойТовар И СтрокаИнструкции.Контейнер=ПустойКонтейнер Тогда
			ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, "Не заполнено поле ""товар""");
		КонецЕсли;
		
		СтрокаИнструкцииРасход = Неопределено;  
		
		Если СтрокаИнструкции.ЯчейкаОтправитель <> ПустаяЯчейка
			ИЛИ СтрокаИнструкции.КонтейнерОтправитель <> ПустойКонтейнер
			ИЛИ (СтрокаИнструкции.Контейнер <> ПустойКонтейнер И СтрокаИнструкции.Количество < 0) Тогда 
			
			СтрокаИнструкцииРасход = РК.ДобавитьЭлементКоллекции(Процессор.ТаблицаИнструкцийРазложенная, СтрокаИнструкции);
			СтрокаИнструкцииРасход.ЯчейкаПриемник = ПустаяЯчейка;
			СтрокаИнструкцииРасход.КонтейнерПриемник = ПустойКонтейнер;
			//ттт
			СтрокаИнструкцииРасход.Товар = Процессор.ПустойТовар;
			СтрокаИнструкцииРасход.Характеристика = Процессор.ПустаяХарактеристика; 
			СтрокаИнструкцииРасход.Серия = Процессор.ПустаяСерия;
			СтрокаИнструкцииРасход.ПриравнятьКоличество = Ложь;
		КонецЕсли;
		
		// Кулалаев. Транзит
		ЕстьПриход = СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка;
		ЕстьПриход = ЕстьПриход ИЛИ СтрокаИнструкции.КонтейнерПриемник <> ПустойКонтейнер;
		ЕстьПриход = ЕстьПриход ИЛИ СтрокаИнструкции.ЯчейкаТранзит <> ПустаяЯчейка;
		
		Если ЕстьПриход Тогда
			Если СтрокаИнструкцииРасход=Неопределено И СтрокаИнструкции.Товар=ПустойТовар И СтрокаИнструкции.Контейнер <> ПустойКонтейнер Тогда
				// Приемка целого котейнера
				// автоматичеки спишем контейнер с текущего места 
				СтрокаИнструкцииРасход = РК.ДобавитьЭлементКоллекции(Процессор.ТаблицаИнструкцийРазложенная, СтрокаИнструкции);
				СтрокаИнструкцииРасход.ЯчейкаПриемник = ПустаяЯчейка;
				СтрокаИнструкцииРасход.КонтейнерПриемник = ПустойКонтейнер;
				СтрокаИнструкцииРасход.ПриравнятьКоличество = Ложь; 
				СтрокаИнструкцииРасход.Количество = -1;
			КонецЕсли; 

			СтрокаИнструкцииПриход = РК.ДобавитьЭлементКоллекции(Процессор.ТаблицаИнструкцийРазложенная, СтрокаИнструкции);
			СтрокаИнструкцииПриход.ЯчейкаОтправитель = ПустаяЯчейка;
			СтрокаИнструкцииПриход.КонтейнерОтправитель = ПустойКонтейнер;
			
			//Если заполнен контейнер - работаем целиком с ним. Проверка на содержимое лежит на задании кладовщику
			Если ЗначениеЗаполнено(СтрокаИнструкцииПриход.Контейнер) Тогда
				СтрокаИнструкцииПриход.Товар = Процессор.ПустойТовар;
				СтрокаИнструкцииПриход.Характеристика = Процессор.ПустаяХарактеристика; 
				СтрокаИнструкцииПриход.Серия = Процессор.ПустаяСерия;
				СтрокаИнструкцииПриход.Количество = 1;
			КонецЕсли;
			
			Если СтрокаИнструкцииПриход.ПриравнятьКоличество Тогда
				СтрокаИнструкцииОбнулить = СтрокаИнструкцииПриход;
				СтрокаИнструкцииОбнулить.Количество = 0; //всегда к нулю
				
				СтрокаИнструкцииПриход = РК.ДобавитьЭлементКоллекции(Процессор.ТаблицаИнструкцийРазложенная, СтрокаИнструкцииОбнулить);
				СтрокаИнструкцииПриход.ПриравнятьКоличество = Ложь;
				СтрокаИнструкцииПриход.Количество = СтрокаИнструкции.Количество;
			КонецЕсли; 
			
		КонецЕсли;  
		
	КонецЦикла;

	Для Каждого СтрокаИнструкции Из РК.ПолучитьЭлементыКоллекции(Процессор.ТаблицаИнструкцийРазложенная) Цикл
		СтрокаИнструкции.ДополнительныеДанные = Неопределено;
	КонецЦикла;
	
	ЗаполнитьПустыеЗначенияТаблицыИнструкций(Процессор, Процессор.ТаблицаИнструкцийРазложенная); 
	
	ПоляТаблицыИнструкций = "НомерСтрокиДокумента, ЯчейкаОтправитель, ЯчейкаТранзит, ЯчейкаПриемник, КонтейнерОтправитель, КонтейнерПриемник, Контейнер, " + Процессор.ТоварныеПоля + ", ПриравнятьКоличество, ПересчетВКонтейнере, ДополнительныеДанные";
	РК.СвернутьТаблицуЗначений(Процессор.ТаблицаИнструкцийРазложенная, ПоляТаблицыИнструкций, "Количество");
	
КонецФункции

// Разложение инструкций на расход и приход
Функция ВыполнитьКомпиляциюПервогоУровня(Процессор)
	
	Перем РК;
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;

	ТоварныеПоля = Процессор.ТоварныеПоля;
	
	ПустойТовар = Процессор.ПустойТовар;
	ПустаяЯчейка = Процессор.ПустаяЯчейка;
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	
	ЛицензияКонтейнерыНедоступна = НЕ ЛицензияКонтейнерыДоступна(Процессор);

	Для Каждого СтрокаИнструкции Из РК.ПолучитьЭлементыКоллекции(Процессор.ТаблицаИнструкций) Цикл
		
		Если ЛицензияКонтейнерыНедоступна Тогда
			
			Если СтрокаИнструкции.Контейнер <> ПустойКонтейнер
				ИЛИ СтрокаИнструкции.КонтейнерОтправитель <> ПустойКонтейнер
				ИЛИ СтрокаИнструкции.КонтейнерПриемник <> ПустойКонтейнер Тогда
				
				ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, "операции с контейнерами недоступны");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаИнструкции.Товар=ПустойТовар И СтрокаИнструкции.Контейнер=ПустойКонтейнер Тогда
			ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, "Не заполнено поле ""товар""");
		КонецЕсли;
		
		СтрокаИнструкцииРасход = Неопределено;
		Если СтрокаИнструкции.ЯчейкаОтправитель <> ПустаяЯчейка
			ИЛИ СтрокаИнструкции.КонтейнерОтправитель <> ПустойКонтейнер
			ИЛИ (СтрокаИнструкции.Контейнер <> ПустойКонтейнер И СтрокаИнструкции.Количество < 0) Тогда
			СтрокаИнструкцииРасход = РК.ДобавитьЭлементКоллекции(Процессор.ТаблицаИнструкцийРазложенная, СтрокаИнструкции);
			СтрокаИнструкцииРасход.ЯчейкаПриемник = ПустаяЯчейка;
			СтрокаИнструкцииРасход.КонтейнерПриемник = ПустойКонтейнер;
			СтрокаИнструкцииРасход.ПриравнятьКоличество = Ложь; 
			
			МастерКонтейнер = ТекущийКонтейнерИзРегистра(Процессор, СтрокаИнструкцииРасход.Контейнер);
			
		КонецЕсли;
		
		// Кулалаев. Транзит
		ЕстьПриход = СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка;
		ЕстьПриход = ЕстьПриход ИЛИ СтрокаИнструкции.КонтейнерПриемник <> ПустойКонтейнер;
		ЕстьПриход = ЕстьПриход ИЛИ СтрокаИнструкции.ЯчейкаТранзит <> ПустаяЯчейка;
		
		Если ЕстьПриход Тогда
			Если СтрокаИнструкцииРасход=Неопределено И СтрокаИнструкции.Товар=ПустойТовар И СтрокаИнструкции.Контейнер <> ПустойКонтейнер Тогда
				// Приемка целого котейнера
				// автоматичеки спишем контейнер с текущего места 
				СтрокаИнструкцииРасход = РК.ДобавитьЭлементКоллекции(Процессор.ТаблицаИнструкцийРазложенная, СтрокаИнструкции);
				СтрокаИнструкцииРасход.ЯчейкаПриемник = ПустаяЯчейка;
				СтрокаИнструкцииРасход.КонтейнерПриемник = ПустойКонтейнер;
				СтрокаИнструкцииРасход.ПриравнятьКоличество = Ложь;
				СтрокаИнструкцииРасход.Количество = -1;
			КонецЕсли;

			СтрокаИнструкцииПриход = РК.ДобавитьЭлементКоллекции(Процессор.ТаблицаИнструкцийРазложенная, СтрокаИнструкции);
			СтрокаИнструкцииПриход.ЯчейкаОтправитель = ПустаяЯчейка;
			СтрокаИнструкцииПриход.КонтейнерОтправитель = ПустойКонтейнер;  
			// ТУ_Прошин_05.06.26+    
			// Для сценария когда происходит перекладывание короба из паллета в паллет, но нет явного списания товара с ячеек
			// если Контейнер-Приемник новый и не хранится на ячейки - будем наследовать ячейку Контейнера  
			// но наследование не обязательно, только в том случае если у контейнер приемника нет своей ячейки!
			Если СтрокаИнструкции.КонтейнерПриемник <> ПустойКонтейнер И СтрокаИнструкции.Контейнер <> ПустойКонтейнер И НЕ ЗначениеЗаполнено(СтрокаИнструкции.ЯчейкаОтправитель) Тогда
				СтрокаИнструкцииПриход.НаследоватьЯчейкуПоКонтейнеру = Истина;	
			КонецЕсли;
			// ТУ_Прошин_05.06.26-
			
			Если СтрокаИнструкцииПриход.ПриравнятьКоличество Тогда
				СтрокаИнструкцииОбнулить = СтрокаИнструкцииПриход;
				СтрокаИнструкцииОбнулить.Количество = 0; //всегда к нулю
				
				СтрокаИнструкцииПриход = РК.ДобавитьЭлементКоллекции(Процессор.ТаблицаИнструкцийРазложенная, СтрокаИнструкцииОбнулить);
				СтрокаИнструкцииПриход.ПриравнятьКоличество = Ложь;
				СтрокаИнструкцииПриход.Количество = СтрокаИнструкции.Количество;
			КонецЕсли;
		КонецЕсли;  
		
		Если СтрокаИнструкции.Контейнер <> ПустойКонтейнер И СтрокаИнструкции.Товар <> ПустойТовар Тогда
			Процессор.ПересчитываемыеКонтейнеры.Добавить(СтрокаИнструкции);	
		КонецЕсли;
		
	КонецЦикла;

	Для Каждого СтрокаИнструкции Из РК.ПолучитьЭлементыКоллекции(Процессор.ТаблицаИнструкцийРазложенная) Цикл
		СтрокаИнструкции.ДополнительныеДанные = Неопределено;
	КонецЦикла;
	
	ЗаполнитьПустыеЗначенияТаблицыИнструкций(Процессор, Процессор.ТаблицаИнструкцийРазложенная);
	
КонецФункции

// Формирование статических движений, независящих от данных
// формирование запросов данных, необходимых для формирования динамических движений
//
Функция ВыполнитьКомпиляциюВторогоУровня(Процессор)
	
	Перем РК;
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;

	ТоварныеПоля = Процессор.ТоварныеПоля;
	
	ПустойТовар = Процессор.ПустойТовар;
	ПустаяЯчейка = Процессор.ПустаяЯчейка;
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	
	ДвиженияРегистров = Процессор.ДвиженияРегистров;
	
	
	Для Каждого СтрокаИнструкции Из РК.ПолучитьЭлементыКоллекции(Процессор.ТаблицаИнструкцийРазложенная) Цикл
		
		ТипОперации = ОпределитьТипОперации(СтрокаИнструкции, ПустойТовар, ПустойКонтейнер, ПустаяЯчейка);
		
		Если ТипОперации.ЦелыйКонтейнер Тогда
			
			Контейнер = СтрокаИнструкции.Контейнер;	
			МастерКонтейнер = ТекущийКонтейнерИзРегистра(Процессор, Контейнер);
						
			Если ЗначениеЗаполнено(МастерКонтейнер) Тогда
				ВерхнеуровневыйКонтейнер = МастерКонтейнер;
			Иначе
				ВерхнеуровневыйКонтейнер = Контейнер;
			КонецЕсли;
			
			Если СтрокаИнструкции.Количество < 0 ИЛИ СтрокаИнструкции.ЯчейкаОтправитель <> ПустаяЯчейка Тогда
				// будут списаны все остатки контейнера в ячейке (или ячейках)
				ДобавитьЗапросОстатковКонтейнеровВЯчейках(Процессор, СтрокаИнструкции, ВерхнеуровневыйКонтейнер, СтрокаИнструкции.ЯчейкаОтправитель);
			ИначеЕсли СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка Тогда
				// будет размещаться состав контейнера в ячейку
				ДобавитьЗапросОстатковТоваровВКонтейнерах(Процессор, СтрокаИнструкции, ВерхнеуровневыйКонтейнер);
			КонецЕсли;
			
			ДобавитьЗапросОстатковТоваровВКонтейнерах(Процессор, СтрокаИнструкции, ВерхнеуровневыйКонтейнер);
			ДобавитьЗапросМестоположенияКонтейнера(Процессор, Контейнер);
			ДобавитьЗапросМестоположенияКонтейнера(Процессор, МастерКонтейнер);

		КонецЕсли; 
		
		Если ТипОперации.Обнуление Тогда
			
			Если СтрокаИнструкции.КонтейнерПриемник <> ПустойКонтейнер Тогда
				// обнуление количества в контейнере
				ДобавитьЗапросОстатковКонтейнеровВЯчейках(Процессор, СтрокаИнструкции, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.ЯчейкаПриемник);
				ДобавитьЗапросОстатковТоваровВКонтейнерах(Процессор, СтрокаИнструкции, СтрокаИнструкции.КонтейнерПриемник);
				ДобавитьЗапросМестоположенияКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);
			Иначе
				// обнуление количества
				ДобавитьЗапросОстатковТоваровВЯчейках(Процессор, СтрокаИнструкции, СтрокаИнструкции.ЯчейкаПриемник);
			КонецЕсли;
			
		КонецЕсли;
			
		Если ТипОперации.ИзвлечениеИзКонтейнера ИЛИ ТипОперации.ИзвлечениеКонтейнераИзКонтейнера Тогда
			
			КонтейнерОтправитель = СтрокаИнструкции.КонтейнерОтправитель;
			МастерКонтейнер = ТекущийКонтейнерИзРегистра(Процессор, КонтейнерОтправитель);
			
			// Извлечение из контейнера
			// потребуются остатки на ячейках и в контейнере
			ДобавитьЗапросОстатковКонтейнеровВЯчейках(Процессор, СтрокаИнструкции, КонтейнерОтправитель, СтрокаИнструкции.ЯчейкаОтправитель);
			ДобавитьЗапросОстатковТоваровВКонтейнерах(Процессор, СтрокаИнструкции, КонтейнерОтправитель);
			ДобавитьЗапросМестоположенияКонтейнера(Процессор, КонтейнерОтправитель);
			
			// при извлечении контейнера из контейнера надо получать остатки родителя
			Если ЗначениеЗаполнено(МастерКонтейнер) Тогда
				ДобавитьЗапросОстатковКонтейнеровВЯчейках(Процессор, СтрокаИнструкции, МастерКонтейнер, СтрокаИнструкции.ЯчейкаОтправитель);
				ДобавитьЗапросОстатковТоваровВКонтейнерах(Процессор, СтрокаИнструкции, МастерКонтейнер);
				ДобавитьЗапросМестоположенияКонтейнера(Процессор, МастерКонтейнер);
			КонецЕсли;
			
		КонецЕсли;
			
		Если ТипОперации.ПомещениеВКонтейнер Тогда
			
			КонтейнерПриемник = СтрокаИнструкции.КонтейнерПриемник;
			МастерКонтейнер = ТекущийКонтейнерИзРегистра(Процессор, КонтейнерПриемник);
			
			// помещение в контейнер
			ДобавитьЗапросМестоположенияКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);
			ДобавитьЗапросОстатковТоваровВКонтейнерах(Процессор, СтрокаИнструкции, СтрокаИнструкции.КонтейнерПриемник);
			
			Если ЗначениеЗаполнено(МастерКонтейнер) Тогда
				ДобавитьЗапросМестоположенияКонтейнера(Процессор, МастерКонтейнер);
				ДобавитьЗапросОстатковТоваровВКонтейнерах(Процессор, СтрокаИнструкции, МастерКонтейнер);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипОперации.КонтейнерВКонтейнер Тогда
			
			КонтейнерПриемник = СтрокаИнструкции.КонтейнерПриемник;
			МастерКонтейнер = ТекущийКонтейнерИзРегистра(Процессор, КонтейнерПриемник);
			
			// помещение в контейнер
			ДобавитьЗапросМестоположенияКонтейнера(Процессор, КонтейнерПриемник);
			ДобавитьЗапросОстатковТоваровВКонтейнерах(Процессор, СтрокаИнструкции, КонтейнерПриемник); 
					
			Если ЗначениеЗаполнено(МастерКонтейнер) Тогда
				ДобавитьЗапросМестоположенияКонтейнера(Процессор, МастерКонтейнер);
				ДобавитьЗапросОстатковТоваровВКонтейнерах(Процессор, СтрокаИнструкции, МастерКонтейнер);
			КонецЕсли;
			
			Контейнер = СтрокаИнструкции.Контейнер;
			МастерКонтейнер = ТекущийКонтейнерИзРегистра(Процессор, Контейнер);
			
			// помещение в контейнер
			ДобавитьЗапросМестоположенияКонтейнера(Процессор, Контейнер);
			ДобавитьЗапросОстатковТоваровВКонтейнерах(Процессор, СтрокаИнструкции, Контейнер);
			
			Если ЗначениеЗаполнено(МастерКонтейнер) Тогда
				ДобавитьЗапросМестоположенияКонтейнера(Процессор, МастерКонтейнер);
				ДобавитьЗапросОстатковТоваровВКонтейнерах(Процессор, СтрокаИнструкции, МастерКонтейнер);
			КонецЕсли;
			
		КонецЕсли;
			
		Если ТипОперации.ПростоеДвижение Тогда
			
			СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);

			Если СтрокаИнструкции.ЯчейкаОтправитель <> ПустаяЯчейка Тогда
				СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
				СтрокаДвиженияРегистра.Ячейка = СтрокаИнструкции.ЯчейкаОтправитель;

				ЭлементДанныхЗапроса = НовыйЭлементДанных(Процессор, "ЗапросОстатковТоваровВЯчейках", СтрокаИнструкции);
				ЭлементДанныхЗапроса.Ячейка = СтрокаИнструкции.ЯчейкаОтправитель;
				ВставитьЭлементДанныхВИндекс(Процессор, "ЗапросОстатковТоваровВЯчейках", ЭлементДанныхЗапроса);
			Иначе
				// если определена ячейка в неё, иначе в транзит
				СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
				Если ЗначениеЗаполнено(СтрокаИнструкции.ЯчейкаПриемник) Тогда
					СтрокаДвиженияРегистра.Ячейка = СтрокаИнструкции.ЯчейкаПриемник;
				Иначе
					СтрокаДвиженияРегистра.Ячейка = СтрокаИнструкции.ЯЧейкаТранзит; //Кулалаев. Транзит
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаИнструкции.Контейнер <> ПустойКонтейнер И СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка Тогда
				ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, ПустойКонтейнер, СтрокаИнструкции.Контейнер, СтрокаИнструкции.ЯчейкаПриемник);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ДобавитьЗапросОстатковТоваровВЯчейках(Процессор, СтрокаИнструкции, Ячейка)

	ЭлементДанныхЗапроса = НовыйЭлементДанных(Процессор, "ЗапросОстатковТоваровВЯчейках", СтрокаИнструкции);
	ЭлементДанныхЗапроса.Ячейка = Ячейка;
	ВставитьЭлементДанныхВИндекс(Процессор, "ЗапросОстатковТоваровВЯчейках", ЭлементДанныхЗапроса);
	
	Возврат ЭлементДанныхЗапроса;

КонецФункции

Функция ДобавитьЗапросОстатковКонтейнеровВЯчейках(Процессор, СтрокаИнструкции, Контейнер, Ячейка)

	ЭлементДанныхЗапроса = НовыйЭлементДанных(Процессор, "ЗапросОстатковКонтейнеровВЯчейках", СтрокаИнструкции);
	ЭлементДанныхЗапроса.Контейнер = Контейнер;
	ЭлементДанныхЗапроса.Ячейка = Ячейка;
	ВставитьЭлементДанныхВИндекс(Процессор, "ЗапросОстатковКонтейнеровВЯчейках", ЭлементДанныхЗапроса);
	
	Возврат ЭлементДанныхЗапроса;

КонецФункции

Функция ДобавитьЗапросОстатковТоваровВКонтейнерах(Процессор, СтрокаИнструкции, Контейнер)

	ЭлементДанныхЗапроса = НовыйЭлементДанных(Процессор, "ЗапросОстатковТоваровВКонтейнерах", СтрокаИнструкции);
	ЭлементДанныхЗапроса.Контейнер = Контейнер;
	ВставитьЭлементДанныхВИндекс(Процессор, "ЗапросОстатковТоваровВКонтейнерах", ЭлементДанныхЗапроса);
	
	Возврат ЭлементДанныхЗапроса;
	
КонецФункции

Функция ДобавитьЗапросМестоположенияКонтейнера(Процессор, Контейнер)
	
	ЭлементДанныхЗапроса = НовыйЭлементДанных(Процессор, "ЗапросМестоположенийКонтейнеров");
	ЭлементДанныхЗапроса.Контейнер = Контейнер;
	ЭлементДанныхЗапроса.КонтейнерОстатковВЯчейках = Контейнер;
	ВставитьЭлементДанныхВИндекс(Процессор, "ЗапросМестоположенийКонтейнеров", ЭлементДанныхЗапроса);
	
	Возврат ЭлементДанныхЗапроса;
	
КонецФункции

// 3.2.4 - Компиляция 3 уровня, новая +
// Формирование динамических движений, применение движений к данным (изменение данных), выполнение проверок (остатков и др.)
Функция ВыполнитьКомпиляциюТретьегоУровня_Стар(Процессор)
	
	Перем РК;
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ДвиженияРегистров = Процессор.ДвиженияРегистров;
	ОстаткиТоваровВЯчейках = Процессор.Данные.ОстаткиТоваровВЯчейках;
	ПустойТовар = Процессор.ПустойТовар;
	ПустаяЯчейка = Процессор.ПустаяЯчейка;
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	Для Каждого СтрокаИнструкции Из РК.ПолучитьЭлементыКоллекции(Процессор.ТаблицаИнструкцийРазложенная) Цикл
		
		Если НЕ СтрокаИнструкции.ДополнительныеДанные.Скомпилирована Тогда
			
			Если СтрокаИнструкции.Товар=ПустойТовар И СтрокаИнструкции.Контейнер <> ПустойКонтейнер Тогда
				
				
				// расход целого контейнера
				Если СтрокаИнструкции.Количество < 0 ИЛИ СтрокаИнструкции.ЯчейкаОтправитель <> ПустаяЯчейка Тогда
					// списание контейнера с мест хранения (может быть указано явно или опущено)
					КлючиДанных = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
					КлючиДанных.Ячейка = СтрокаИнструкции.ЯчейкаОтправитель;
					ОстаткиКонтейнераВЯчейках = НайтиИндекс(Процессор, "ОстаткиТоваровВЯчейках", КлючиДанных);
						
					Для Каждого Остаток Из ПолучитьДанныеИндекса(ОстаткиКонтейнераВЯчейках) Цикл
						Если Остаток.Количество=0 Тогда
							Продолжить;
						КонецЕсли;
						СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Остаток);
						СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
					КонецЦикла;
					
				// приход целого контейнера
				ИначеЕсли СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка Тогда
					// размещение состава контейнера в ячейку
					ОстаткиТоваровВКонтейнере = ПолучитьОстаткиТоваровВКонтейнере(Процессор, СтрокаИнструкции.Контейнер);
					Для Каждого Остаток Из ОстаткиТоваровВКонтейнере Цикл
						Если Остаток.Количество=0 Тогда
							Продолжить;
						КонецЕсли;
						СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Остаток);
						СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
						СтрокаДвиженияРегистра.Ячейка = СтрокаИнструкции.ЯчейкаПриемник;
					КонецЦикла;
					
					//
					ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, ПустойКонтейнер, СтрокаИнструкции.Контейнер, СтрокаИнструкции.ЯчейкаПриемник);
				КонецЕсли;
				
			
			ИначеЕсли СтрокаИнструкции.КонтейнерОтправитель <> ПустойКонтейнер Тогда
				
				// списание из состава контейнера
				Аналитика = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции);
				Аналитика.Контейнер = СтрокаИнструкции.КонтейнерОтправитель;
				
				ИндексОстатков = НайтиИндекс(Процессор, "ОстаткиТоваровВКонтейнерах", Аналитика);
				КоличествоСписатьИзКонтейнера = СтрокаИнструкции.Количество;
				Если ИндексОстатков <> Неопределено Тогда
					
					Для Каждого Остаток Из ИндексОстатков.Данные Цикл
						Если КоличествоСписатьИзКонтейнера <= 0 Тогда
							Прервать;
						КонецЕсли;
						
						КоличествоСписатьОстаток = Мин(Остаток.Количество, КоличествоСписатьИзКонтейнера);
						Если КоличествоСписатьОстаток <= 0 Тогда
							Продолжить;
						КонецЕсли;
						
						СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
						СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
						СтрокаДвиженияРегистра.Количество = КоличествоСписатьОстаток;

						КоличествоСписатьИзКонтейнера = КоличествоСписатьИзКонтейнера - КоличествоСписатьОстаток;
					КонецЦикла;
					
				КонецЕсли;
				
				Если КоличествоСписатьИзКонтейнера > 0 Тогда
					ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, "Недостаточно остатка в контейнере");
				КонецЕсли;

				// списание с ячеек
				МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерОтправитель);

				Аналитика = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
				Аналитика.Ячейка = СтрокаИнструкции.ЯчейкаОтправитель;
				Аналитика.Контейнер = МестоположениеКонтейнера.КонтейнерОстатковВЯчейках;

				ИндексОстатков = НайтиИндекс(Процессор, "ОстаткиТоваровВЯчейках", Аналитика);
				КоличествоСписатьИзЯчеек = СтрокаИнструкции.Количество;
				Для Каждого Остаток Из ПолучитьДанныеИндекса(ИндексОстатков) Цикл
					Если КоличествоСписатьИзЯчеек <= 0 Тогда
						Прервать;
					КонецЕсли;
					
					КоличествоСписатьОстаток = Мин(Остаток.Количество, КоличествоСписатьИзЯчеек);
					Если КоличествоСписатьОстаток <= 0 Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Остаток);
					СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
					СтрокаДвиженияРегистра.Количество = КоличествоСписатьОстаток;
					
					КоличествоСписатьИзЯчеек = КоличествоСписатьИзЯчеек - КоличествоСписатьОстаток;
				КонецЦикла;
				
				Если КоличествоСписатьИзКонтейнера=0 И КоличествоСписатьИзЯчеек > 0 Тогда
					ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, "Недостаточно остатка в ячейках контейнера");
				КонецЕсли;
				
			ИначеЕсли СтрокаИнструкции.КонтейнерПриемник <> ПустойКонтейнер Тогда
				
				Если СтрокаИнструкции.ПриравнятьКоличество Тогда
					
					// Обнуление остатка по контейнеру
					// списание из состава контейнера
					Аналитика = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции);
					Аналитика.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
					
					ИндексОстатков = НайтиИндекс(Процессор, "ОстаткиТоваровВКонтейнерах", Аналитика);
					Если ИндексОстатков <> Неопределено Тогда
						Для Каждого Остаток Из ИндексОстатков.Данные Цикл
							Если Остаток.Количество=0 Тогда
								Продолжить;
							КонецЕсли;
							
							СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
							СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
						КонецЦикла;
					КонецЕсли;
					
					// списание с ячеек
					МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);

					Аналитика = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
					Аналитика.Ячейка = СтрокаИнструкции.ЯчейкаПриемник;
					Аналитика.Контейнер = МестоположениеКонтейнера.КонтейнерОстатковВЯчейках;

					ИндексОстатков = НайтиИндекс(Процессор, "ОстаткиТоваровВЯчейках", Аналитика);
					Для Каждого Остаток Из ПолучитьДанныеИндекса(ИндексОстатков) Цикл
						Если Остаток.Количество=0 Тогда
							Продолжить;
						КонецЕсли;
						
						СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Остаток);
						СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
					КонецЦикла;
					
				Иначе
					// наполнение контейнера
					СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции);
					СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
					СтрокаДвиженияРегистра.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
					
					//Кулалаев. Транзит
					ЕстьПриход = СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка ИЛИ СтрокаИнструкции.ЯчейкаТранзит <> ПустаяЯчейка;
					
					// отражение состава контейнера на ячейке
					Если ЕстьПриход Тогда
						// также установим местоположение контейнера в ячейке
						//Кулалаев. Транзит
						Если СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка Тогда
							МестоположениеКонтейнера = ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.КонтейнерПриемник, ПустойКонтейнер, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.ЯчейкаПриемник);
						Иначе
							МестоположениеКонтейнера = ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.КонтейнерПриемник, ПустойКонтейнер, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.ЯчейкаТранзит);
						КонецЕсли;
					Иначе
						МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);
					КонецЕсли;
					
					СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
					СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
					СтрокаДвиженияРегистра.Контейнер = МестоположениеКонтейнера.КонтейнерОстатковВЯчейках;
					СтрокаДвиженияРегистра.Ячейка = МестоположениеКонтейнера.Ячейка;
				КонецЕсли;
				
			ИначеЕсли СтрокаИнструкции.ПриравнятьКоличество Тогда
				Аналитика = Новый Структура(ОстаткиТоваровВЯчейках.ДополнительныеДанные.ПоляИндексирования);
				ЗаполнитьЗначенияСвойств(Аналитика, СтрокаИнструкции);
				Аналитика.Ячейка = СтрокаИнструкции.ЯчейкаПриемник;
				
				Количество = ПолучитьОстатокТовара(Процессор, Аналитика);
				Если Количество <> 0 Тогда
					СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Аналитика);
					СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
					СтрокаДвиженияРегистра.Количество = Количество;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаИнструкции.ДополнительныеДанные.Скомпилирована = Истина;
			
		КонецЕсли;
		
		ПрименитьДвиженияРегистровКДанным(Процессор, СтрокаИнструкции.ДополнительныеДанные.ДвиженияРегистров);
		
	КонецЦикла;
	
КонецФункции

Функция ВыполнитьКомпиляциюТретьегоУровня(Процессор)
	
	Перем РК, ТипОперации, ОперацияВыполнена;
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	ДвиженияРегистров = Процессор.ДвиженияРегистров;
	ПустойТовар = Процессор.ПустойТовар;
	ПустаяЯчейка = Процессор.ПустаяЯчейка;
	ПустойКонтейнер = Процессор.ПустойКонтейнер; 
	ПересчитываемыеКонтейнеры = Новый Массив;
	
	Для Каждого СтрокаИнструкции Из РК.ПолучитьЭлементыКоллекции(Процессор.ТаблицаИнструкцийРазложенная) Цикл
		
		Если НЕ СтрокаИнструкции.ДополнительныеДанные.Скомпилирована Тогда
			
			ТипОперации = ОпределитьТипОперации(СтрокаИнструкции, ПустойТовар, ПустойКонтейнер, ПустаяЯчейка);
			ОперацияВыполнена = Ложь;
			
			Если ТипОперации.ЦелыйКонтейнер Тогда
				ОперацияВыполнена = ОбработатьОперациюЦелыйКонтейнер(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка); 
			ИначеЕсли ТипОперации.КонтейнерВКонтейнер Тогда
				ОперацияВыполнена = ОбработатьОперациюКонтейнерВКонтейнер(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
			ИначеЕсли ТипОперации.ИзвлечениеКонтейнераИзКонтейнера Тогда
				ОперацияВыполнена = ОбработатьОперациюИзвлечениеКонтейнераИзКонтейнера(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
			ИначеЕсли ТипОперации.ИзвлечениеИзКонтейнера Тогда
				ОперацияВыполнена = ОбработатьОперациюИзвлечениеИзКонтейнера(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
			ИначеЕсли ТипОперации.ПомещениеВКонтейнер Тогда
				ОперацияВыполнена = ОбработатьОперациюПомещениеВКонтейнер(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
			ИначеЕсли ТипОперации.Обнуление Тогда
				ОперацияВыполнена = ОбработатьОперациюОбнуление(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
			ИначеЕсли ТипОперации.ПростоеДвижение Тогда
				ОперацияВыполнена = ОбработатьОперациюПростоеДвижение(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
			Иначе
				ОперацияВыполнена = Истина;
			КонецЕсли;  
			
			Если ОперацияВыполнена Тогда
				СтрокаИнструкции.ДополнительныеДанные.Скомпилирована = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		ПрименитьДвиженияРегистровКДанным(Процессор, СтрокаИнструкции.ДополнительныеДанные.ДвиженияРегистров);
		
	КонецЦикла;  
	
	ПроверитьПересчитываемыеКонтейнерыПоСоставу(Процессор);
	
	Возврат Истина;
КонецФункции

Функция ОпределитьТипОперации(СтрокаИнструкции, ПустойТовар, ПустойКонтейнер, ПустаяЯчейка)
	
	ТипОперации = Новый Структура;
	ТипОперации.Вставить("ЦелыйКонтейнер", Ложь);
	ТипОперации.Вставить("ИзвлечениеИзКонтейнера", Ложь);
	ТипОперации.Вставить("ПомещениеВКонтейнер", Ложь);
	ТипОперации.Вставить("КонтейнерВКонтейнер", Ложь);
	ТипОперации.Вставить("ИзвлечениеКонтейнераИзКонтейнера", Ложь);
	ТипОперации.Вставить("Обнуление", Ложь);
	ТипОперации.Вставить("ПростоеДвижение", Ложь);
	ТипОперации.Вставить("СлияниеКонтейнеров", Ложь); 
	ТипОперации.Вставить("ПересчетВКонтейнере", Ложь);
	//ТУ_Прошин_26.05.26
	//Изменил первое условие если, не обязательно чтобы товар был пустым, могут быть операции с пересчетом контейнера
	Если СтрокаИнструкции.Контейнер <> ПустойКонтейнер Тогда 
		Если СтрокаИнструкции.КонтейнерПриемник <> ПустойКонтейнер Тогда
			ТипОперации.КонтейнерВКонтейнер = Истина;
			Если СтрокаИнструкции.Контейнер.ТипТары.ВидКонтейнера = СтрокаИнструкции.КонтейнерПриемник.ТипТары.ВидКонтейнера Тогда
				ТипОперации.СлияниеКонтейнеров = Истина;
			Иначе
				ТипОперации.СлияниеКонтейнеров = Ложь;
			КонецЕсли;
		ИначеЕсли СтрокаИнструкции.КонтейнерОтправитель <> ПустойКонтейнер И СтрокаИнструкции.ЯчейкаОтправитель = ПустаяЯчейка И СтрокаИнструкции.ЯчейкаПриемник = ПустаяЯчейка Тогда   
			// только для тех случаев, когда контейнер извлекается без ячеек 
			ТипОперации.ИзвлечениеКонтейнераИзКонтейнера = Истина;
		Иначе
			ТипОперации.ЦелыйКонтейнер = Истина;
		КонецЕсли;	
	ИначеЕсли СтрокаИнструкции.КонтейнерОтправитель <> ПустойКонтейнер И СтрокаИнструкции.КонтейнерПриемник <> ПустойКонтейнер Тогда
		ТипОперации.ИзвлечениеИзКонтейнера = Истина;	
	ИначеЕсли СтрокаИнструкции.КонтейнерОтправитель <> ПустойКонтейнер Тогда
		ТипОперации.ИзвлечениеИзКонтейнера = Истина;	
	ИначеЕсли СтрокаИнструкции.КонтейнерПриемник <> ПустойКонтейнер Тогда	
		Если СтрокаИнструкции.ПриравнятьКоличество Тогда
			ТипОперации.Обнуление = Истина;
		Иначе
			ТипОперации.ПомещениеВКонтейнер = Истина;
		КонецЕсли;
	ИначеЕсли СтрокаИнструкции.ПриравнятьКоличество Тогда
		ТипОперации.Обнуление = Истина;	
	Иначе
		ТипОперации.ПростоеДвижение = Истина;
	КонецЕсли;
	
	Возврат ТипОперации;
КонецФункции

Функция ОбработатьОперациюЦелыйКонтейнер(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка)
		
	Если СтрокаИнструкции.Количество < 0 ИЛИ СтрокаИнструкции.ЯчейкаОтправитель <> ПустаяЯчейка Тогда
		ВыполнитьСписаниеКонтейнераСМест(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
	ИначеЕсли СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка Тогда
		ВыполнитьРазмещениеКонтейнераВЯчейку(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ОбработатьПересчетВКонтейнере(Процессор, СтрокаИнструкции)
	
	а=0;
	Возврат Истина;
	

КонецФункции // ОбработатьПересчетВКонтейнере()

Функция ОбработатьОперациюКонтейнерВКонтейнер(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка)
	
	Перем МестоположениеКонтейнераПриемника, ОстаткиВнутреннегоКонтейнера;
	
	// Проверяем, нужно ли выполнять слияние или вложение
	Если СтрокаИнструкции.Контейнер.ТипТары.ВидКонтейнера = 
		СтрокаИнструкции.КонтейнерПриемник.ТипТары.ВидКонтейнера Тогда
		// Слияние контейнеров одного типа
		Возврат ВыполнитьСлияниеКонтейнеров(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
	КонецЕсли;
	
	Если НЕ ПроверитьВозможностьВложенияКонтейнеров(Процессор, СтрокаИнструкции.Контейнер,
		СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПроверитьЦикличностьВложения(Процессор, СтрокаИнструкции.Контейнер,
		СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПроверитьОстаткиВКонтейнере(Процессор, СтрокаИнструкции.Контейнер, СтрокаИнструкции.КонтейнерПриемник, ПустойКонтейнер) Тогда
		Возврат Ложь;
	КонецЕсли;    
	
	// ТУ_Прошин_25.05.26+     
	Если ЗначениеЗаполнено(СтрокаИнструкции.ЯчейкаПриемник) Тогда
		Если НЕ ПроверитьЯчейкуПриемникНаМестоположениеКонтейнерПриемника(Процессор, СтрокаИнструкции, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.ЯчейкаПриемник) Тогда
			Возврат Ложь;
		КонецЕсли;     
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаИнструкции.Товар) Тогда
		//Если с пересчетом то нужно проверить что контейнер-приемник соответствует мастер контейнеру вложенного контейнера (нельзя чтобы один короб лежал на двух паллетах)    
		Если НЕ ПредполагаемыйМастерКонтейнерСоответствуетТекущему(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, СтрокаИнструкции.КонтейнерПриемник, ПустойКонтейнер) Тогда    
			Возврат Ложь;
		КонецЕсли;

		СтрокаИнструкции.ПересчетВКонтейнере = Истина;
	КонецЕсли;	
	// ТУ_Прошин_25.05.26-  
	
	КлючиДанных = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
	КлючиДанных.Контейнер = СтрокаИнструкции.КонтейнерПриемник;	
		
	ОстаткиКонтейнераВЯчейках = НайтиИндекс(Процессор, "ОстаткиТоваровВЯчейках", КлючиДанных);
	
	// Уникальный сценарий перекладывания коробов на новый паллет (в операции по ячейкам только "Контейнер" и "Контейнер-приемник"
	МестоположениеКороба = Неопределено;
	
	// Кулалаев: Предположительно не нужная строка, т.к при работе с целым контейнером он всегда пробует списаться.
	//ВыполнитьСписаниеКонтейнераСМест(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка); 
	
	// Регистрируем размещение контейнера в контейнере независимо от наличия остатков товаров  
	// ТУ_Прошин_26.06.26+ 
	// Добавил проверку "ПроверитьОстаткиВКонтейнере" на тот случай если контейнер с пересчетом чтобы не набивалось не нужное количество в РН
	Если НЕ КонтейнерУжеВложенВКонтейнер(Процессор, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.Контейнер) Тогда
		Если ЗначениеЗаполнено(СтрокаИнструкции.Товар) Тогда
			КопияСтрокиИнструкции = вмс_РаботаСКоллекциями.СкопироватьОбъект(СтрокаИнструкции);  
			КопияСтрокиИнструкции.Серия = Процессор.ПустаяСерия;
			КопияСтрокиИнструкции.Характеристика = Процессор.ПустаяХарактеристика;  
			СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", КопияСтрокиИнструкции);
		Иначе   
			СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции); 
		КонецЕсли;	
		//СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции);    
		
		// ТУ_Прошин_26.05.26-
		СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
		СтрокаДвиженияРегистра.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
		СтрокаДвиженияРегистра.Товар = СтрокаИнструкции.Контейнер;
		СтрокаДвиженияРегистра.Количество = 1;
	КонецЕсли;
	ЕстьПриход = СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка ИЛИ СтрокаИнструкции.ЯчейкаТранзит <> ПустаяЯчейка;
	Если ЕстьПриход Тогда  
		
		Мастер_КонтейнерПриемник = МастерКонтейнер(Процессор, СтрокаИнструкции.КонтейнерПриемник);
		
		Если СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка Тогда
			МестоположениеКонтейнера = ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.ЯчейкаПриемник);
			
			// при помещении в контейнер и явном указании ячейки - мастер контейнер наследует ячейку.
			Если ЗначениеЗаполнено(СтрокаИнструкции.КонтейнерПриемник) Тогда
				МестоположениеКонтейнера = ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.КонтейнерПриемник, Мастер_КонтейнерПриемник, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.ЯчейкаПриемник);
			КонецЕсли;
			
		Иначе
			МестоположениеКонтейнера = ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.ЯчейкаТранзит);
			
			// при помещении в контейнер и явном указании ячейки - мастер контейнер наследует ячейку.
			Если ЗначениеЗаполнено(СтрокаИнструкции.КонтейнерПриемник) Тогда
				МестоположениеКонтейнера = ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.КонтейнерПриемник, Мастер_КонтейнерПриемник, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.ЯчейкаТранзит);
			КонецЕсли; 
			
		КонецЕсли;
	Иначе  
		МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);     
		Если МестоположениеКонтейнера = Неопределено ИЛИ НЕ ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка) Тогда    
			// ТУ_Прошин_05.06.26+        
			Если СтрокаИнструкции.НаследоватьЯчейкуПоКонтейнеру <> Неопределено И СтрокаИнструкции.НаследоватьЯчейкуПоКонтейнеру Тогда
				// если у контейнера который "вкладывается" в паллет есть местоположение - паллет его наследует 
				МестоположениеКороба = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.Контейнер);   
				Если МестоположениеКороба = Неопределено ИЛИ НЕ ЗначениеЗаполнено(МестоположениеКороба.Ячейка) Тогда   
					ЯчейкаПриемникКонтейнера = ПустаяЯчейка;
				Иначе
					ЯчейкаПриемникКонтейнера = МестоположениеКороба.Ячейка;    
					ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.КонтейнерПриемник, ПустойКонтейнер, СтрокаИнструкции.КонтейнерПриемник, ЯчейкаПриемникКонтейнера);
				КонецЕсли;
			Иначе    
				ЯчейкаПриемникКонтейнера = ПустаяЯчейка;	
			КонецЕсли;
			// ТУ_Прошин_05.06.26-
			//ЯчейкаПриемникКонтейнера = ПустаяЯчейка;
		Иначе           
			ЯчейкаПриемникКонтейнера = МестоположениеКонтейнера.Ячейка;
		КонецЕсли;
		
		// Здесь в добавлении движения регистра указывалась явно пустая ячейка хотя по логикездесь должна быть ячейка контейнера приемника 
		ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.КонтейнерПриемник, ЯчейкаПриемникКонтейнера);
		//МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);
	КонецЕсли;
	
	
	// Обрабатываем остатки товаров внутри контейнера          
	// ТУ_Прошин_26.05.26+  
	// если происходит процесс целого контейнера, но с пересчетом товара
	РК = вмс_РаботаСКоллекциями;
	Если ЗначениеЗаполнено(СтрокаИнструкции.Товар) Тогда  
		ОстаткиВнутреннегоКонтейнера = ПолучитьОстаткиТоваровВКонтейнере(Процессор, СтрокаИнструкции.Контейнер);
		Отбор = Новый Структура(Процессор.ТоварныеПоля);
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаИнструкции);
		СтрокаОстатков = РК.НайтиЭлементКоллекции(ОстаткиВнутреннегоКонтейнера, Отбор);
		Если ЗначениеЗаполнено(СтрокаОстатков) Тогда
			Если СтрокаОстатков.Количество >= СтрокаИнструкции.Количество И МестоположениеКонтейнера <> Неопределено И ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка) Тогда  
				СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
				ЗаполнитьЗначенияСвойств(СтрокаДвиженияРегистра, СтрокаОстатков);
				СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
				СтрокаДвиженияРегистра.Контейнер = МестоположениеКонтейнера.КонтейнерОстатковВЯчейках;
				СтрокаДвиженияРегистра.Ячейка = МестоположениеКонтейнера.Ячейка;	
				СтрокаДвиженияРегистра.Количество = СтрокаИнструкции.Количество;     
			КонецЕсли;		
		КонецЕсли;
		
		Возврат Истина;			
	КонецЕсли;
	
	//ТУ_Прошин_26.05.26-
	
	ОстаткиВнутреннегоКонтейнера = ПолучитьОстаткиТоваровВКонтейнере(Процессор, СтрокаИнструкции.Контейнер);
	Для Каждого Остаток Из ОстаткиВнутреннегоКонтейнера Цикл
		Если Остаток.Количество > 0 И МестоположениеКонтейнера <> Неопределено И ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка) Тогда
			СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
			ЗаполнитьЗначенияСвойств(СтрокаДвиженияРегистра, Остаток);
			СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
			СтрокаДвиженияРегистра.Контейнер = МестоположениеКонтейнера.КонтейнерОстатковВЯчейках;
			СтрокаДвиженияРегистра.Ячейка = МестоположениеКонтейнера.Ячейка;   
		ИначеЕсли  Остаток.Количество > 0 И СтрокаИнструкции.НаследоватьЯчейкуПоКонтейнеру <> Неопределено И СтрокаИнструкции.НаследоватьЯчейкуПоКонтейнеру И МестоположениеКороба <> Неопределено И ЗначениеЗаполнено(МестоположениеКороба.Ячейка) Тогда
			// ТУ_Прошин_05.06.26+
			// этот сценарий нужен в том случае, если происходит перекладывание коробов с одной паллеты на другую (новую)
			// нужно наследовать ячейку хранения короба, а условие "НЕ ЗначениеЗаполнено(СтрокаИнструкции.ЯчейкаОтправитель)" демонстрирует что это именно перекладываение без списывания с ячеек
			// например может быть аналогичный сценарий но когда не нужно оставлять остатки если паллета это отгрузочное место и мы сейчас полностью спишем остатки с ячеек после того как положем на паллет
			СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
			ЗаполнитьЗначенияСвойств(СтрокаДвиженияРегистра, Остаток);
			СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
			СтрокаДвиженияРегистра.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
			СтрокаДвиженияРегистра.Ячейка = МестоположениеКороба.Ячейка;  
			// ТУ_Прошин_05.06.26-
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции  

Функция КонтейнерУжеВложенВКонтейнер(Процессор, ВнешнийКонтейнер, ВнутреннийКонтейнер)
	//ТУ_Прошин_26.05.26+
	ОстаткиВнешнегоКонтейнера = ПолучитьОстаткиТоваровВКонтейнере(Процессор, ВнешнийКонтейнер);
	РК = вмс_РаботаСКоллекциями;
	
	Если ОстаткиВнешнегоКонтейнера.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;  
	
	Отбор = Новый Структура("Товар", ВнутреннийКонтейнер);
	СтрокаКонтейнера = РК.НайтиЭлементКоллекции(ОстаткиВнешнегоКонтейнера, Отбор);
	Если НЕ ЗначениеЗаполнено(СтрокаКонтейнера) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

	//ТУ_Прошин_26.05.26-
КонецФункции

Функция ОбработатьОперациюИзвлечениеКонтейнераИзКонтейнера(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка)
	
	Если ЗначениеЗаполнено(СтрокаИнструкции.КонтейнерОтправитель) Тогда
		МастерКонтейнер = СтрокаИнструкции.КонтейнерОтправитель;
	Иначе       
		МастерКонтейнер = МастерКонтейнер(Процессор, СтрокаИнструкции.Контейнер);
	КонецЕсли;
	
	Если НЕ ПроверитьОстаткиВКонтейнере(Процессор, МастерКонтейнер, СтрокаИнструкции.Контейнер, ПустойКонтейнер) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// ОстаткиТоваровВКонтейнерах
	СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, СтрокаИнструкции);
	СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;    
	СтрокаДвиженияРегистра.Характеристика = Процессор.ПустаяХарактеристика;
	СтрокаДвиженияРегистра.Серия = Процессор.ПустаяСерия;
	СтрокаДвиженияРегистра.Контейнер = МастерКонтейнер;
	СтрокаДвиженияРегистра.Товар = СтрокаИнструкции.Контейнер;
	СтрокаДвиженияРегистра.Количество = 1;
	
	// Местоположение
	МестоположениеКонтейнераОтправителя = ПолучитьМестоположениеКонтейнера(Процессор, МастерКонтейнер);
	Если ЗначениеЗаполнено(МестоположениеКонтейнераОтправителя.Ячейка) Тогда
		ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, ПустойКонтейнер, ПустойКонтейнер, МестоположениеКонтейнераОтправителя.Ячейка); 
	Иначе
		ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, ПустойКонтейнер, ПустойКонтейнер, ПустаяЯчейка);	
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ПроверитьОстаткиВКонтейнере(Процессор, ВнешнийКонтейнер, ВнутреннийКонтейнер, ПустойКонтейнер)
	
	Перем ОстаткиКонтейнера, ОбщийОбъем, ОстаткиВнешнегоКонтейнера, ОбщийОбъемВнешнего;
	
	ОстаткиКонтейнера = ПолучитьОстаткиТоваровВКонтейнере(Процессор, ВнутреннийКонтейнер);
	ОбщийОбъем = 0;
	
	Для Каждого Остаток Из ОстаткиКонтейнера Цикл
		ОбщийОбъем = ОбщийОбъем + Остаток.Количество;
	КонецЦикла;
	
	Если ОбщийОбъем <= 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ВнешнийКонтейнер = ПустойКонтейнер Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОстаткиВнешнегоКонтейнера = ПолучитьОстаткиТоваровВКонтейнере(Процессор, ВнешнийКонтейнер);
	ОбщийОбъемВнешнего = 0;
	
	Для Каждого Остаток Из ОстаткиВнешнегоКонтейнера Цикл
		ОбщийОбъемВнешнего = ОбщийОбъемВнешнего + Остаток.Количество;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

Функция ВыполнитьСписаниеКонтейнераСМест(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка)
	
	РК = вмс_РаботаСКоллекциями;
	КонтейнерСписанияЯчейки = СтрокаИнструкции.Контейнер;   
		
	//ТУ_Прошин_29.05.26+
	// Входе тестирования пришел к выводу что если операция по заданию - значит нужно брать мастер контейнер из регистра, если без задания, то самый актуальный
	//МастерКонтейнер = МастерКонтейнер(Процессор, КонтейнерСписанияЯчейки);   
	Если ЗначениеЗаполнено(Процессор.ДокументОперации.ЗаданиеКладовщику) Тогда
		МастерКонтейнер = ТекущийКонтейнерИзРегистра(Процессор, КонтейнерСписанияЯчейки); 
	Иначе  
		МастерКонтейнер = МастерКонтейнер(Процессор, КонтейнерСписанияЯчейки);  
	КонецЕсли;
	//ТУ_Прошин_29.05.26-
	
	Если ЗначениеЗаполнено(МастерКонтейнер) Тогда
		КонтейнерОстатокЯчейки = МастерКонтейнер;
	Иначе
		КонтейнерОстатокЯчейки = КонтейнерСписанияЯчейки;
	КонецЕсли;
	
	Если СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка Тогда
		Возврат Истина;
	КонецЕсли; 
	
	// Определяем ячейку для списания
	Если СтрокаИнструкции.ЯчейкаОтправитель <> ПустаяЯчейка Тогда
		// Строгий режим: ячейка указана явно
		ЯчейкаСписания = СтрокаИнструкции.ЯчейкаОтправитель;
		
		// Проверяем, что контейнер действительно находится в указанной ячейке
		МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, КонтейнерОстатокЯчейки);
		Если МестоположениеКонтейнера <> Неопределено И МестоположениеКонтейнера.Ячейка <> ЯчейкаСписания Тогда 
			
			// ТУ_Прошин_26.05.26+    
			// Добавил условие если Значение заполнено товар для того, что у нас может быть ситуация когда происходит действие с целым контейнером но с пересчетом
			// в таком случае проверяю есть ли остатки товара в разрезе контейнера на ячейке отправителе явно 
			
			//Если ЗначениеЗаполнено(СтрокаИнструкции.Товар) Тогда   
			//	Если НЕ ПроверитьОстаткиТоваровВКонтейнереНаЯчейке(Процессор, СтрокаИнструкции, СтрокаИнструкции.ЯчейкаОтправитель, СтрокаИнструкции.Контейнер) Тогда   
			//		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, 
			//		"Контейнер находится в другой ячейке (" + Строка(МестоположениеКонтейнера.Ячейка) + "), а не в указанной (" + Строка(ЯчейкаСписания) + ")");
			//		Возврат Ложь; 
			//	КонецЕсли;	
			//Иначе			
			//	//ТУ_Прошин_26.05.26-
			//	ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, 
			//	"Контейнер находится в другой ячейке (" + Строка(МестоположениеКонтейнера.Ячейка) + "), а не в указанной (" + Строка(ЯчейкаСписания) + ")");
			//	Возврат Ложь;   
			//КонецЕсли;  
				//ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, 
				//"Контейнер находится в другой ячейке (" + Строка(МестоположениеКонтейнера.Ячейка) + "), а не в указанной (" + Строка(ЯчейкаСписания) + ")");
				//Возврат Ложь; 
		КонецЕсли;
	Иначе
		// Автоматический режим: находим текущую ячейку контейнера. Если её нет - не списываем с остатков
		МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, КонтейнерОстатокЯчейки);
		Если МестоположениеКонтейнера = Неопределено ИЛИ НЕ ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка) Тогда
			
			Возврат Истина;
			
			// Пока отключено, не актуальная проверка 
			//ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, 
			//"Контейнер не размещен на ячейке. Укажите ячейку или разместите контейнер.");
			//Возврат Ложь;
		Иначе                                  
			// нашли контейнер в другом месте, при этом ячейка явно не указана. Берем текущее положение    
			// ТУ_Прошин_26.05.26+    
			// По текущим остаткам нужно списывать, иначе ломается если контейнер с пересчетом списывается
			ЯчейкаСписания = МестоположениеКонтейнера.Ячейка;        
			//ЯчейкаСписания = ПолучитьЯчейкуКонтейнераПоОстаткамТоваровВЯчейке(Процессор, СтрокаИнструкции, КонтейнерОстатокЯчейки);       
			//Если Не ЗначениеЗаполнено(ЯчейкаСписания) Тогда
			//	ЯчейкаСписания = МестоположениеКонтейнера.Ячейка; 
			//КонецЕсли;
			//// ТУ_Прошин_26.05.26-
		КонецЕсли;
		
	КонецЕсли; 
	
	КлючиДанных = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
	ЗаполнитьЗначенияСвойств(КлючиДанных, СтрокаИнструкции);
	КлючиДанных.Ячейка = ЯчейкаСписания;
	КлючиДанных.Контейнер = КонтейнерОстатокЯчейки;
	
	ОстаткиКонтейнераВЯчейках = НайтиИндекс(Процессор, "ОстаткиТоваровВЯчейках", КлючиДанных);
	ОстаткиВерхнийУровень = ОстаткиКонтейнераВЯчейках;
	
	Если ОстаткиВерхнийУровень <> Неопределено Тогда
		
		//если по инструкции контейнер - не мастер контейнер, нужно определить контейнер инструкциии и списать количество внутри вложенного контейнера
		Если ЗначениеЗаполнено(МастерКонтейнер) Тогда
			ОстаткиНижнийУровень = ПолучитьОстаткиТоваровВКонтейнере(Процессор, СтрокаИнструкции.Контейнер);  
			// ТУ_Прошин_02.06.26+
			// если контейнер снимается с места с пересчетом товара то нужно расходовать конкретную строку а не весь остаток контейнера  
			// Ввел "ОстаткиНижнийУровеньПоИнструкции"
			Если ЗначениеЗаполнено(СтрокаИнструкции.Товар) Тогда 
				ОтборСтрокиКонтейнера = Новый Структура(Процессор.ТоварныеПоля); 
				ЗаполнитьЗначенияСвойств(ОтборСтрокиКонтейнера, СтрокаИнструкции);
				ОстаткиНижнийУровеньПоИнструкции = РК.НайтиЭлементыКоллекции(ОстаткиНижнийУровень, ОтборСтрокиКонтейнера);
				
			Иначе
				ОстаткиНижнийУровеньПоИнструкции = РК.СкопироватьМассив(ОстаткиНижнийУровень);	
			КонецЕсли;
			
			// ТУ_Прошин_02.06.26-
			Для каждого ОстатокНижнийУровень Из ОстаткиНижнийУровеньПоИнструкции Цикл
				Отбор = Новый Структура(Процессор.ТоварныеПоля);
				ЗаполнитьЗначенияСвойств(Отбор, ОстатокНижнийУровень); 
				ЕстьВМастере = РК.НайтиЭлементКоллекции(ОстаткиВерхнийУровень, Отбор) <> Неопределено; 
				Если ЕстьВМастере Тогда
					
					СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, ОстатокНижнийУровень);
					СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход; 
					СтрокаДвиженияРегистра.Количество = ОстатокНижнийУровень.Количество;
					СтрокаДвиженияРегистра.Контейнер = МастерКонтейнер; 
					СтрокаДвиженияРегистра.Ячейка = ЯчейкаСписания;
					
					// Если с пересчетом - количество берем не по остатку, а из факта (из "СтрокаИнструкции");
					Если ЗначениеЗаполнено(СтрокаИнструкции.Товар) Тогда
						СтрокаДвиженияРегистра.Количество = СтрокаИнструкции.Количество;
					КонецЕсли;   
					
				Иначе
					ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, "Недостаточно остатка товара в выбранной ячейке");
					Продолжить;
				КонецЕсли;
				
			КонецЦикла;
		Иначе         
			// ТУ_Прошин_29.05.26+
			// Если Заполнено поле "Товар", то списание контейнера происходит с пересчетом, а значит нужно списывать не сразу весь контейнер а построчно по данным факта   
			ОстаткиТовараВКонтейнере = ПолучитьДанныеИндекса(ОстаткиКонтейнераВЯчейках);
			Если ЗначениеЗаполнено(СтрокаИнструкции.Товар) Тогда      
				Отбор = Новый Структура(Процессор.ТоварныеПоля);
				ЗаполнитьЗначенияСвойств(Отбор, СтрокаИнструкции);
				СтрокаОстаткаВКонтейнере = РК.НайтиЭлементКоллекции(ОстаткиТовараВКонтейнере, Отбор);
				Если ЗначениеЗаполнено(СтрокаОстаткаВКонтейнере) Тогда 
					Если СтрокаОстаткаВКонтейнере.Количество >= СтрокаИнструкции.Количество Тогда  
						СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, СтрокаОстаткаВКонтейнере);
						СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход; 
						СтрокаДвиженияРегистра.Количество = СтрокаИнструкции.Количество;	
					Иначе   	
						ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, СтрШаблон("Недостаточно остатка товара %1 в выбранной ячейке", СтрокаИнструкции.Товар));
					КонецЕсли;	
				Иначе 
					ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, "Недостаточно остатка товара в выбранной ячейке");
				КонецЕсли;
			Иначе	 
				// ТУ_Прошин_29.05.26-
				Для Каждого Остаток Из ОстаткиТовараВКонтейнере Цикл   
					Если Остаток.Количество > 0 Тогда
						СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Остаток);
						СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
	Иначе
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, "Недостаточно остатка товара в выбранной ячейке");
	КонецЕсли;	
	
	// если у контейнера есть мастер контейнер - нужно его достать 
	Если ЗначениеЗаполнено(МастерКонтейнер) Тогда 
		// ТУ_Прошин_01.06.26+
		// Нужно достать, но только в том случае, если это не пересчет контейнера с видом "Паллета" , поэтому добавил доп проверку Если
		Если НЕ СтрокаИнструкции.ПересчетКонтейнераРодителя Тогда
			
			Аналитика = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВКонтейнерах", Новый Структура("Контейнер, Товар", МастерКонтейнер, СтрокаИнструкции.Контейнер));
			Аналитика.Серия = Процессор.ПустаяСерия;
			Аналитика.Характеристика = Процессор.ПустаяХарактеристика;
			
			ИндексОстатков = НайтиИндекс(Процессор, "ОстаткиТоваровВКонтейнерах", Аналитика);
			Если ИндексОстатков <> Неопределено Тогда   
				ДанныеОстатка =  ИндексОстатков.Данные[0];
				Если ДанныеОстатка.Количество > 0 Тогда 
					ИнструкцияМастерКонтейнеру = вмс_РаботаСКоллекциями.СкопироватьОбъект(СтрокаИнструкции);
					ИнструкцияМастерКонтейнеру.КонтейнерОтправитель = МастерКонтейнер(Процессор, СтрокаИнструкции.Контейнер);
					ИнструкцияМастерКонтейнеру.Контейнер = СтрокаИнструкции.Контейнер;
					ОбработатьОперациюИзвлечениеКонтейнераИзКонтейнера(Процессор, ИнструкцияМастерКонтейнеру, ПустойКонтейнер, ПустаяЯчейка);  
				КонецЕсли;
			КонецЕсли;
						
			//ИнструкцияМастерКонтейнеру = вмс_РаботаСКоллекциями.СкопироватьОбъект(СтрокаИнструкции);
			//ИнструкцияМастерКонтейнеру.КонтейнерОтправитель = МастерКонтейнер(Процессор, СтрокаИнструкции.Контейнер);
			//ИнструкцияМастерКонтейнеру.Контейнер = СтрокаИнструкции.Контейнер;
			//ОбработатьОперациюИзвлечениеКонтейнераИзКонтейнера(Процессор, ИнструкцияМастерКонтейнеру, ПустойКонтейнер, ПустаяЯчейка);  
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ВыполнитьРазмещениеКонтейнераВЯчейку(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка)
	
	Перем ОстаткиТоваровВКонтейнере, Остаток;
	//ТУ_Прошин_26.05.26+
	//МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.Контейнер);
	//Если МестоположениеКонтейнера <> Неопределено И (МестоположениеКонтейнера.Ячейка <> СтрокаИнструкции.ЯчейкаПриемник ИЛИ МестоположениеКонтейнер Тогда 
	//	ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, 
	//	"Контейнер размещается в другой ячейке (" + Строка(МестоположениеКонтейнера.Ячейка) + "), а не в указанной (" + Строка(СтрокаИнструкции.ЯчейкаПриемник ) + ")");
	//	Возврат Ложь; 
	//КонецЕсли;
		
		//ТУ_Прошин_26.05.26-
	//ТУ_Прошин_29.05.26+	
	
	Если ЗначениеЗаполнено(СтрокаИнструкции.Товар) Тогда 
		// Если с пересчетом то нужно проверить что ячейка приемник соответствует месту хранения на которое началось размещение
		Если НЕ ПроверитьЯчейкуПриемникНаМестоположениеКонтейнера(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, СтрокаИнструкции.ЯчейкаПриемник) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Если с пересчетом то нужно проверить что контейнер приемник соответствует мастер контейнеру вложенного контейнера (нелья чтобы один короб лежал на двух паллетах)    
		Если НЕ ПредполагаемыйМастерКонтейнерСоответствуетТекущему(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, СтрокаИнструкции.КонтейнерПриемник, ПустойКонтейнер) Тогда    
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаИнструкции.ПересчетВКонтейнере = Истина;
		
	КонецЕсли;	
	//ТУ_Прошин_29.05.26-
		
	ОстаткиТоваровВКонтейнере = ПолучитьОстаткиТоваровВКонтейнере(Процессор, СтрокаИнструкции.Контейнер); 
	//ТУ_Прошин_26.05.26+  
	ТоварКРазмещению = вмс_РаботаСКоллекциями.СкопироватьМассив(ОстаткиТоваровВКонтейнере);
	Если ЗначениеЗаполнено(СтрокаИнструкции.Товар) Тогда  
		Отбор = Новый Структура(Процессор.ТоварныеПоля);
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаИнструкции);
		ТоварКРазмещению = вмс_РаботаСКоллекциями.НайтиЭлементыКоллекции(ОстаткиТоваровВКонтейнере, Отбор);	
	КонецЕсли;
	//Для Каждого Остаток Из ОстаткиТоваровВКонтейнере Цикл 
	//ТУ_Прошин_26.05.26-
	Для Каждого Остаток Из ТоварКРазмещению Цикл
		
		// Проверяем построчно. Если в строке перемещается мастер контейнер - отдельно обрабатываем все его вложения.
		Если ТипЗнч(Остаток.Товар) = Тип("СправочникСсылка.вмс_Контейнеры") Тогда
			
			Контейнер = Остаток.Товар;
			ВложеннаяСтрокаИнструкции = вмс_РаботаСКоллекциями.СкопироватьОбъект(СтрокаИнструкции);
			
			ОстаткиТоваровВложенные = ПолучитьОстаткиТоваровВКонтейнере(Процессор, Контейнер);
			
			Для Каждого Остаток Из ОстаткиТоваровВложенные Цикл
				
				Если Остаток.Количество > 0 Тогда
					СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", ВложеннаяСтрокаИнструкции, Остаток);
					СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
					СтрокаДвиженияРегистра.Ячейка = СтрокаИнструкции.ЯчейкаПриемник;
					СтрокаДвиженияРегистра.Контейнер = СтрокаИнструкции.Контейнер; // При размещении вложенных, перемещаем мастерконтейнер         
					
					//ТУ_Прошин_27.05.26+
					//в случае расхода конкретного товара - расходуем явно указанное в строке количество. Иначе будет списано все количество (актуально для целого)
					Если ЗначениеЗаполнено(СтрокаИнструкции.Товар) Тогда
						СтрокаДвиженияРегистра.Количество = СтрокаИнструкции.Количество;
					КонецЕсли;
					//ТУ_Прошин_27.05.26-
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			
			Если Остаток.Количество > 0 Тогда
				СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Остаток);
				СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
				СтрокаДвиженияРегистра.Ячейка = СтрокаИнструкции.ЯчейкаПриемник;  
				// ТУ_Прошин_27.05.26+
				// в случае расхода конкретного товара - расходуем явно указанное в строке количество. Иначе будет списано все количество (актуально для целого)
				Если ЗначениеЗаполнено(СтрокаИнструкции.Товар) Тогда
					СтрокаДвиженияРегистра.Количество = СтрокаИнструкции.Количество;  
					// ТУ_Прошин_01.06.26+
					// Если размещается "Короб" у которого есть мастер контейнер нужно размещать именно мастер контейнер (возможна ситуация при пересчете паллета)    
					МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.Контейнер);
					Если ЗначениеЗаполнено(МестоположениеКонтейнера.КонтейнерРодитель) Тогда
						СтрокаДвиженияРегистра.Контейнер = МестоположениеКонтейнера.КонтейнерРодитель;		
					КонецЕсли;	
					// ТУ_Прошин_01.06.26-
					
				КонецЕсли;
				// ТУ_Прошин_27.05.26-
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	// ТУ_Прошин_01.06.26
	// Добавил проверку "Если", нужно обработать отдельно ситуацию, если у нас идет пересчет целого паллета, в таком случае менять местоположение родителя нужно родителю и вложенному контейнеру 
	МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.Контейнер);
	Если ЗначениеЗаполнено(СтрокаИнструкции.Товар) И ЗначениеЗаполнено(МестоположениеКонтейнера.КонтейнерРодитель) Тогда 
		ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, МестоположениеКонтейнера.КонтейнерРодитель, МестоположениеКонтейнера.КонтейнерРодитель, СтрокаИнструкции.ЯчейкаПриемник);	
		ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, МестоположениеКонтейнера.КонтейнерРодитель, ПустойКонтейнер, МестоположениеКонтейнера.КонтейнерРодитель, СтрокаИнструкции.ЯчейкаПриемник);
	Иначе   
		ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, ПустойКонтейнер, СтрокаИнструкции.Контейнер, СтрокаИнструкции.ЯчейкаПриемник);
		// ТУ_Прошин_04.06.26+
		Если СтрокаИнструкции.Контейнер.ТипТары.ВидКонтейнера = Процессор.ВидКонтейнераПаллет Тогда
			ВложенныеКонтейнеры = ПолучитьОстаткиТоваровВКонтейнере(Процессор, СтрокаИнструкции.Контейнер);  
			Для Каждого СтрокаКонтейнера Из ВложенныеКонтейнеры Цикл 
				Короб = СтрокаКонтейнера.Товар;
				Если ТипЗнч(Короб) = Тип("СправочникСсылка.вмс_Контейнеры") Тогда
					ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, Короб, СтрокаИнструкции.Контейнер, СтрокаИнструкции.Контейнер, СтрокаИнструкции.ЯчейкаПриемник);	
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;   
		// ТУ_Прошин_04.06.26-
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОбработатьОперациюИзвлечениеИзКонтейнера(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка)
	
	Перем Аналитика, ИндексОстатков, КоличествоСписатьИзКонтейнера, КоличествоСписатьОстаток, МестоположениеКонтейнера, КоличествоСписатьИзЯчеек, Остаток;
	
	// обработаем списание остатка из контейнера         
	РК = вмс_РаботаСКоллекциями;
	Аналитика = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции);
	Аналитика.Контейнер = СтрокаИнструкции.КонтейнерОтправитель;
	ИндексОстатков = НайтиИндекс(Процессор, "ОстаткиТоваровВКонтейнерах", Аналитика);
	КоличествоСписатьИзКонтейнера = СтрокаИнструкции.Количество;
	Если ИндексОстатков <> Неопределено Тогда
		Для Каждого Остаток Из ИндексОстатков.Данные Цикл
			Если КоличествоСписатьИзКонтейнера <= 0 Тогда
				Прервать;
			КонецЕсли;
			КоличествоСписатьОстаток = Мин(Остаток.Количество, КоличествоСписатьИзКонтейнера);
			Если КоличествоСписатьОстаток <= 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
			СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
			СтрокаДвиженияРегистра.Количество = КоличествоСписатьОстаток;
			КоличествоСписатьИзКонтейнера = КоличествоСписатьИзКонтейнера - КоличествоСписатьОстаток;
		КонецЦикла;
	КонецЕсли;
	Если КоличествоСписатьИзКонтейнера > 0 Тогда
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, "Недостаточно остатка в контейнере");
	КонецЕсли;
	
	МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерОтправитель);   
	
	Если ЗначениеЗаполнено(МестоположениеКонтейнера.КонтейнерРодитель) Тогда
		//ТУ_прошин_27.05.26+	        
		//Извлекать контейнер с родителя только в том случае, если на контейнере не осталось остатка, пустой контейнер на родителе не храним   
		//Добавил флаг СписастьКонтейнерСРодителя и по нему списываю если пустой
 		СписатьКонтейнерСРодителя = Ложь;
		ОстатокНаКонтейнере = ПолучитьОстаткиТоваровВКонтейнере(Процессор, МестоположениеКонтейнера.Контейнер);  
		ОстатокНаКонтейнереБольше0 = Новый Массив;
		Для Каждого Строка Из ОстатокНаКонтейнере Цикл
			Если Строка.Количество > 0 Тогда
				ОстатокНаКонтейнереБольше0.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		
		Если ОстатокНаКонтейнереБольше0.Количество() = 0 Тогда   
			СписатьКонтейнерСРодителя = Истина;
		КонецЕсли;
		Если ОстатокНаКонтейнереБольше0.Количество() = 1 Тогда
			Отбор = Новый Структура(Процессор.ТоварныеПоля);
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаИнструкции);
			СтрокаОстатка = РК.НайтиЭлементКоллекции(ОстатокНаКонтейнереБольше0, Отбор);
			Если ЗначениеЗаполнено(СтрокаОстатка) Тогда
				ОстатокПослеСписания = СтрокаОстатка.Количество - КоличествоСписатьОстаток;
				Если ОстатокПослеСписания = 0 Тогда
					СписатьКонтейнерСРодителя = Истина;   
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		//ТУ_прошин_27.05.26-     
		
		Если СписатьКонтейнерСРодителя Тогда
			СтрокаИнструкции2 = вмс_РаботаСКоллекциями.СкопироватьОбъект(СтрокаИнструкции);
			СтрокаИнструкции2.Контейнер = МестоположениеКонтейнера.Контейнер;
			СтрокаИнструкции2.КонтейнерОтправитель = МестоположениеКонтейнера.КонтейнерРодитель;
			СтрокаИнструкции2.Характеристика = Процессор.ПустаяХарактеристика;
			СтрокаИнструкции2.Серия = Процессор.ПустаяСерия;
			
			ОбработатьОперациюИзвлечениеКонтейнераИзКонтейнера(Процессор, СтрокаИнструкции2, ПустойКонтейнер, ПустаяЯчейка);
		КонецЕсли;
	КонецЕсли;
	
	// обработаем списание из ячеек
	// определить контейнер на ячейках (мастер или обычный)
	КонтейнерСписанияЯчейки = МестоположениеКонтейнера.КонтейнерОстатковВЯчейках;
	МастерКонтейнер = МастерКонтейнер(Процессор, КонтейнерСписанияЯчейки);
	
	Если ЗначениеЗаполнено(МастерКонтейнер) Тогда
		ВерхнеуровневыйКонтейнер = МастерКонтейнер;
	Иначе
		ВерхнеуровневыйКонтейнер = КонтейнерСписанияЯчейки;
	КонецЕсли;
	
	// найти остатки в этом контейнере и создать движения
	Аналитика = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
	Аналитика.Ячейка = СтрокаИнструкции.ЯчейкаОтправитель;
	Аналитика.Контейнер = ВерхнеуровневыйКонтейнер;
	ИндексОстатков = НайтиИндекс(Процессор, "ОстаткиТоваровВЯчейках", Аналитика);
	КоличествоСписатьИзЯчеек = СтрокаИнструкции.Количество;
	Для Каждого Остаток Из ПолучитьДанныеИндекса(ИндексОстатков) Цикл
		Если КоличествоСписатьИзЯчеек <= 0 Тогда
			Прервать;
		КонецЕсли;
		КоличествоСписатьОстаток = Мин(Остаток.Количество, КоличествоСписатьИзЯчеек);
		Если КоличествоСписатьОстаток <= 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Остаток);
		СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
		СтрокаДвиженияРегистра.Количество = КоличествоСписатьОстаток;
		КоличествоСписатьИзЯчеек = КоличествоСписатьИзЯчеек - КоличествоСписатьОстаток;
	КонецЦикла;
	
	Если КоличествоСписатьИзКонтейнера=0 И КоличествоСписатьИзЯчеек > 0 Тогда
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции, "Недостаточно остатка в ячейках контейнера");
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОбработатьОперациюПомещениеВКонтейнер(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка)
	
	Перем СтрокаДвиженияРегистра, МестоположениеКонтейнера, ЕстьПриход;
	
	//ТУ_Прошин_29.05.26+
	//Необходимо проверять, что если есть Ячейка приемник то кладется контейнер на ячейку где находится контейнер
	Если НЕ ПроверитьЯчейкуПриемникНаМестоположениеКонтейнерПриемника(Процессор,СтрокаИнструкции, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.ЯчейкаПриемник) Тогда
		Возврат Ложь;
	КонецЕсли;
	//ТУ_Прошин_29.05.26-
	
	КонтейнерПриемник = СтрокаИнструкции.КонтейнерПриемник;  
	МастерКонтейнер = МастерКонтейнер(Процессор, СтрокаИнструкции.КонтейнерПриемник);
	
	// поместим товар в контейнер явно
	СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции);
	СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
	СтрокаДвиженияРегистра.Контейнер = КонтейнерПриемник;
	ЕстьПриход = СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка ИЛИ СтрокаИнструкции.ЯчейкаТранзит <> ПустаяЯчейка;
	
	Если ЗначениеЗаполнено(МастерКонтейнер) Тогда
		ВерхнеуровневыйКонтейнер = МастерКонтейнер;
	Иначе
		ВерхнеуровневыйКонтейнер = КонтейнерПриемник;
	КонецЕсли;
	
	
	Если ЕстьПриход Тогда
		Если СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка Тогда
			МестоположениеКонтейнера = ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, ВерхнеуровневыйКонтейнер, ПустойКонтейнер, ВерхнеуровневыйКонтейнер, СтрокаИнструкции.ЯчейкаПриемник);
		Иначе
			МестоположениеКонтейнера = ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, ВерхнеуровневыйКонтейнер, ПустойКонтейнер, ВерхнеуровневыйКонтейнер, СтрокаИнструкции.ЯчейкаТранзит);
		КонецЕсли;
		
	Иначе
		МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, ВерхнеуровневыйКонтейнер);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МестоположениеКонтейнера) И ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка) Тогда
		СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
		СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
		СтрокаДвиженияРегистра.Контейнер = МестоположениеКонтейнера.КонтейнерОстатковВЯчейках;
		СтрокаДвиженияРегистра.Ячейка = МестоположениеКонтейнера.Ячейка;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОбработатьОперациюОбнуление(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка)
	
	Перем Аналитика, ИндексОстатков, Остаток, МестоположениеКонтейнера;
	Если СтрокаИнструкции.КонтейнерПриемник <> ПустойКонтейнер Тогда
		Аналитика = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции);
		Аналитика.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
		ИндексОстатков = НайтиИндекс(Процессор, "ОстаткиТоваровВКонтейнерах", Аналитика);
		Если ИндексОстатков <> Неопределено Тогда
			Для Каждого Остаток Из ИндексОстатков.Данные Цикл
				Если Остаток.Количество=0 Тогда
					Продолжить;
				КонецЕсли;
				СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
				СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
			КонецЦикла;
		КонецЕсли;
		МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);
		Аналитика = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
		Аналитика.Ячейка = СтрокаИнструкции.ЯчейкаПриемник;
		Аналитика.Контейнер = МестоположениеКонтейнера.КонтейнерОстатковВЯчейках;
		ИндексОстатков = НайтиИндекс(Процессор, "ОстаткиТоваровВЯчейках", Аналитика);
		Для Каждого Остаток Из ПолучитьДанныеИндекса(ИндексОстатков) Цикл
			Если Остаток.Количество=0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Остаток);
			СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЦикла;
	Иначе
		Аналитика = Новый Структура(Процессор.Данные.ОстаткиТоваровВЯчейках.ДополнительныеДанные.ПоляИндексирования);
		ЗаполнитьЗначенияСвойств(Аналитика, СтрокаИнструкции);
		Аналитика.Ячейка = СтрокаИнструкции.ЯчейкаПриемник;
		Количество = ПолучитьОстатокТовара(Процессор, Аналитика);
		Если Количество <> 0 Тогда
			СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Аналитика);
			СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
			СтрокаДвиженияРегистра.Количество = Количество;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

Функция ОбработатьОперациюПростоеДвижение(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка)
	
	Перем СтрокаДвиженияРегистра, ЭлементДанныхЗапроса;
	СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции);
	Если СтрокаИнструкции.ЯчейкаОтправитель <> ПустаяЯчейка Тогда
		СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
		СтрокаДвиженияРегистра.Ячейка = СтрокаИнструкции.ЯчейкаОтправитель;
		ЭлементДанныхЗапроса = НовыйЭлементДанных(Процессор, "ЗапросОстатковТоваровВЯчейках", СтрокаИнструкции);
		ЭлементДанныхЗапроса.Ячейка = СтрокаИнструкции.ЯчейкаОтправитель;
		ВставитьЭлементДанныхВИндекс(Процессор, "ЗапросОстатковТоваровВЯчейках", ЭлементДанныхЗапроса);
	Иначе
		СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
		Если ЗначениеЗаполнено(СтрокаИнструкции.ЯчейкаПриемник) Тогда
			СтрокаДвиженияРегистра.Ячейка = СтрокаИнструкции.ЯчейкаПриемник;
		Иначе
			СтрокаДвиженияРегистра.Ячейка = СтрокаИнструкции.ЯЧейкаТранзит;
		КонецЕсли;
	КонецЕсли;
	Если СтрокаИнструкции.Контейнер <> ПустойКонтейнер И СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка Тогда
		ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, СтрокаИнструкции.Контейнер, ПустойКонтейнер, СтрокаИнструкции.Контейнер, СтрокаИнструкции.ЯчейкаПриемник);
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьСлияниеКонтейнеров(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка)
	//Перем ОстаткиВнутреннегоКонтейнера, Остаток, ОстаткиПриемника;
	//Перем КлючиДанных, ИндексОстатков, ОстатокПриемника, КоличествоОбъединить;
	//Перем МестоположениеКонтейнера;
	  
	// ТУ_Прошин_03.06.26+
	// На данный момент пришли к выводу что разрешать выполнять слияние контейнеров можно только в случаях когда контейнер не перемещается с ячейки на ячейку и когда нет пересчета  
	// Слияние можно выполнять только если ячейки не заполнены либо заполнены одной и той же ячейкой
	Если НЕ СлияниеКонтейнеровДоступно(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка) Тогда
		Возврат Ложь;
	КонецЕсли;
	// ТУ_Прошин_03.06.26-
	
	// ТУ_Прошин_05.06.26
	//Разделил сценарии на слияние коробов и слияние паллет
	Если СтрокаИнструкции.Контейнер.ТипТары.ВидКонтейнера = Процессор.ВидКонтейнераКороб Тогда     
		ВыполнитьСлияниеКонтейнеровВидаКороб(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
	ИначеЕсли СтрокаИнструкции.Контейнер.ТипТары.ВидКонтейнера = Процессор.ВидКонтейнераПаллет Тогда  
		ВыполнитьСлияниеКонтейнеровВидаПаллет(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
	Иначе
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
		"Неизвестный вид контейнера, слияние невозможно!");
		Возврат Ложь;		
	КонецЕсли;   
	
	Возврат Истина;
	
	//// Получаем товары из контейнера-источника
	//
	//ОстаткиВнутреннегоКонтейнера = ПолучитьОстаткиТоваровВКонтейнере(Процессор, СтрокаИнструкции.Контейнер);
	//
	//// Определяем местоположение контейнера-приемника
	//Если СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка Тогда 
	//	//ТУ_Прошин_25.05.26+
	//	//МестоположениеКонтейнера = Новый Структура;    
	//	МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);
	//	//ТУ_Прошин_25.05.26-
	//	МестоположениеКонтейнера.Ячейка = СтрокаИнструкции.ЯчейкаПриемник;
	//	МестоположениеКонтейнера.КонтейнерОстатковВЯчейках = СтрокаИнструкции.КонтейнерПриемник;
	//Иначе
	//	МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);
	//КонецЕсли;
	
	//// Обрабатываем каждый товар из источника
	//Для Каждого Остаток Из ОстаткиВнутреннегоКонтейнера Цикл
	//	Если Остаток.Количество <= 0 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	// Формируем ключи для поиска аналогичного товара в приемнике
	//	КлючиДанных = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции);
	//	КлючиДанных.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
	//	КлючиДанных.Товар = Остаток.Товар;
	//	Если Остаток.Свойство("Характеристика") И ЗначениеЗаполнено(Остаток.Характеристика) Тогда
	//		КлючиДанных.Характеристика = Остаток.Характеристика;
	//	КонецЕсли;
	//	Если Остаток.Свойство("Серия") И ЗначениеЗаполнено(Остаток.Серия) Тогда
	//		КлючиДанных.Серия = Остаток.Серия;
	//	КонецЕсли;
	//	ИндексОстатков = НайтиИндекс(Процессор, "ОстаткиТоваровВКонтейнерах", КлючиДанных);
	// 	Если ИндексОстатков <> Неопределено Тогда
	//		// Товар уже есть в приемнике - объединяем количество
	//		ОстаткиПриемника = ПолучитьДанныеИндекса(ИндексОстатков);
	//		Для Каждого ОстатокПриемника Из ОстаткиПриемника Цикл
	//			КоличествоОбъединить = Мин(Остаток.Количество, ОстатокПриемника.Количество);
	//			// Приходуем объединенное количество
	//			СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
	//			СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
	//			СтрокаДвиженияРегистра.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
	//			СтрокаДвиженияРегистра.Количество = Остаток.Количество;
	//			Прервать;
	//		КонецЦикла;
	//	Иначе
	//		// Товара нет в приемнике - просто приходуем
	//		СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
	//		СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		СтрокаДвиженияРегистра.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
	//		СтрокаДвиженияРегистра.Количество = Остаток.Количество;
	//	КонецЕсли;
	//	// Приходуем товар в ячейку (если есть местоположение) todo. если у приемника есть местоположение 
	//	Если МестоположениеКонтейнера <> Неопределено И ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка) Тогда
	//		СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Остаток);
	//		ЗаполнитьЗначенияСвойств(СтрокаДвиженияРегистра, Остаток);
	//		СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		СтрокаДвиженияРегистра.Контейнер = МестоположениеКонтейнера.КонтейнерОстатковВЯчейках;
	//		СтрокаДвиженияРегистра.Ячейка = МестоположениеКонтейнера.Ячейка;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//// Списываем контейнер-источник с ячейки (он теперь пустой)
	////ВыполнитьСписаниеКонтейнераСМест(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
	//// Списываем товары из контейнера-источника (регистр ОстаткиТоваровВКонтейнерах)
	//Для Каждого Остаток Из ОстаткиВнутреннегоКонтейнера Цикл
	//	Если Остаток.Количество <= 0 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
	//	СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
	//КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьВозможностьВложенияКонтейнеров(Процессор, ВнутреннийКонтейнер, ВнешнийКонтейнер, СтрокаИнструкции)
	
	ВидВнутреннегоКонтейнера = ВнутреннийКонтейнер.ТипТары.ВидКонтейнера;
	ВидВнешнегоКонтейнера = ВнешнийКонтейнер.ТипТары.ВидКонтейнера;
	Паллет = Процессор.ВидКонтейнераПаллет;
	
	Если ВидВнутреннегоКонтейнера = Паллет Тогда
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
			"Паллет нельзя помещать в другие контейнеры (запрещено: паллет в коробку)");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьЦикличностьВложения(Процессор, ПроверяемыйКонтейнер, РодительскийКонтейнер, СтрокаИнструкции)
	
	ТекущийКонтейнер = РодительскийКонтейнер;
	ПустойКонтейнер = Процессор.ПустойКонтейнер;
	Пока ЗначениеЗаполнено(ТекущийКонтейнер) И ТекущийКонтейнер <> ПустойКонтейнер Цикл
		Если ТекущийКонтейнер = ПроверяемыйКонтейнер Тогда
			ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
				"Обнаружена циклическая вложенность контейнеров");
			Возврат Ложь;
		КонецЕсли;
		Местоположение = ПолучитьМестоположениеКонтейнера(Процессор, ТекущийКонтейнер);
		ТекущийКонтейнер = Местоположение.КонтейнерРодитель;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

Функция ПроверитьПересчитываемыеКонтейнерыПоСоставу(Процессор)
	
	РК = вмс_РаботаСКоллекциями;
	
	ПересчитываемыеКонтейнеры = Процессор.ПересчитываемыеКонтейнеры;
	ПересчитанныеКонтейнеры = Новый Массив;
	ТоварныеПоля = Процессор.ТоварныеПоля;
		
	
	// 1. Сначала соберем пересчитанные контейнеры
	Для Каждого Строка Из ПересчитываемыеКонтейнеры Цикл 
		
		Если ПересчитанныеКонтейнеры.Найти(Строка.Контейнер) = Неопределено Тогда
			ПересчитанныеКонтейнеры.Добавить(Строка.Контейнер);	
		КонецЕсли;		 
		
	КонецЦикла;
	
	Для каждого Контейнер Из ПересчитанныеКонтейнеры Цикл
		
		ОстаткиТовара = ПолучитьОстаткиТоваровВКонтейнере(Процессор, Контейнер); 	
		СтрокиКонтейнера = РК.НайтиЭлементыКоллекции(Процессор.ПересчитываемыеКонтейнеры, Новый Структура("Контейнер", Контейнер));   
		Если СтрокиКонтейнера.Количество() > 0 Тогда  
			//Возникла ситуация, если кладовщик ошибся при пересчете контейнера и отсканировал ячейку приемник некорректно (товар с одного контейнера начал кидать на разные ячейки)
			//то ошибки высвечиваются на тсд фонтаном и неинформативно, пытаюсь таким образом исправить
			КолонкиКоллекции = РК.ПолучитьКолонкиКоллекции(СтрокиКонтейнера);  
			РК.УдалитьЭлементыКоллекции(КолонкиКоллекции, "НомерСтрокиДокумента, ДополнительныеДанные, ЯчейкаПриемник, КонтейнерПриемник, Количество");   
			РК.СвернутьКоллекциюЗначений(СтрокиКонтейнера, КолонкиКоллекции, "Количество");
		КонецЕсли;
		
		МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, Контейнер);	
		Для Каждого СтрокаКонтейнера Из СтрокиКонтейнера Цикл
			
			Отбор = Новый Структура(ТоварныеПоля);    
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаКонтейнера);
			СтрокаОстатка = РК.НайтиЭлементКоллекции(ОстаткиТовара, Отбор);
			Если ЗначениеЗаполнено(СтрокаОстатка) И ЗначениеЗаполнено(СтрокаКонтейнера.ЯчейкаОтправитель) Тогда   
				ЗонаКарантина = вмс_СкладыВызовСервера.ПолучитьЗонуСклада(СтрокаКонтейнера.ЯчейкаОтправитель.Владелец, ПредопределенноеЗначение("Перечисление.вмс_ТипыЯчеек.Карантин"));
				Разница = СтрокаОстатка.Количество - СтрокаКонтейнера.Количество; 
				Если Разница > 0 Тогда     
					// Списываем товар с контейнера, которого нет на контейнера в момент пересчета+
					СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаКонтейнера);
					СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
					// ТУ_Прошин_29.05.26+
					// Здесь будто нужно использовать родитель контейнера, который был до операции
					//МастерКонтейнер = МастерКонтейнер(Процессор, СтрокаКонтейнера.Контейнер); 
					МастерКонтейнер = ТекущийКонтейнерИзРегистра(Процессор, СтрокаКонтейнера.Контейнер);
					// ТУ_Прошин_29.05.26-
					Если ЗначениеЗаполнено(МастерКонтейнер) Тогда   
						СтрокаДвиженияРегистра.Контейнер = МастерКонтейнер;
					Иначе	
						СтрокаДвиженияРегистра.Контейнер = СтрокаКонтейнера.Контейнер;    
					КонецЕсли;
					СтрокаДвиженияРегистра.Ячейка = СтрокаКонтейнера.ЯчейкаОтправитель;
					СтрокаДвиженияРегистра.Количество = Разница;
					
					СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаКонтейнера);
					СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
					СтрокаДвиженияРегистра.Контейнер = СтрокаКонтейнера.Контейнер;
					СтрокаДвиженияРегистра.Количество = Разница;     
					// Списываем товар с контейнера, которого нет на контейнера в момент пересчета-
					
					//Приходуем товар которого нет в моменте на контейнере в ячейку аномалий (карантина)+     
					СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаКонтейнера);
					СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход; 
					СтрокаДвиженияРегистра.Ячейка = ЗонаКарантина;
					СтрокаДвиженияРегистра.Количество = Разница; 
					СтрокаДВиженияРегистра.Контейнер = Процессор.ПустойКонтейнер;
					// Приходуем товар которого нет в моменте на контейнере в ячейку аномалий (карантина)-
					
					ПрименитьДвиженияРегистровКДанным(Процессор, СтрокаКонтейнера.ДополнительныеДанные.ДвиженияРегистров); 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла; 
	
		
	
КонецФункции // ПроверитьПересчитываемыеКонтейнерыПоСоставу()

Функция ТекущийКонтейнерИзРегистра(Процессор, Контейнер) 
	
	ОН = Процессор.ОбщиеМодули.ОбщегоНазначения;
	    
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	вмс_МестоположенияКонтейнеровСрезПоследних.Контейнер КАК Контейнер,
		|	вмс_МестоположенияКонтейнеровСрезПоследних.КонтейнерРодитель КАК КонтейнерРодитель
		|ИЗ
		|	РегистрСведений.вмс_МестоположенияКонтейнеров.СрезПоследних(
		|			,
		|			Контейнер = &Контейнер
		|				И &УсловиеИсключенияДокумента) КАК вмс_МестоположенияКонтейнеровСрезПоследних
		|";

		
	ТекущаяОперация = Процессор.ДокументОперации;
		
	ПараметрыЗапроса = Новый Структура("Контейнер", Контейнер);
	Если ЗначениеЗаполнено(ТекущаяОперация.ЗаданиеКладовщику) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеИсключенияДокумента", "Регистратор.ЗаданиеКладовщику <> &ЗаданиеКладовщикуОперации");
		ПараметрыЗапроса.Вставить("ЗаданиеКладовщикуОперации", ТекущаяОперация.ЗаданиеКладовщику);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеИсключенияДокумента", "Регистратор <> &ТекущаяОперация");
		ПараметрыЗапроса.Вставить("ТекущаяОперация", ТекущаяОперация);	
	КонецЕсли;
	
    Запрос = ОН.НовыйЗапрос(ТекстЗапроса);
	Запрос.Параметры = ПараметрыЗапроса; 
	ТаблицаРодителейКонтейнера = ОН.ПолучитьТаблицуРезультатаЗапроса(Запрос);

	Если ТаблицаРодителейКонтейнера.Количество() = 0 Тогда
		Возврат Процессор.ПустойКонтейнер;
	КонецЕсли;
	
	ИсходныйРодитель = ТаблицаРодителейКонтейнера[0].КонтейнерРодитель; 
	
	Возврат ИсходныйРодитель;	
	
    
КонецФункции  

Функция ТекущаяЯчейкаИзРегистра(Процессор, Контейнер) 
	
	ОН = Процессор.ОбщиеМодули.ОбщегоНазначения;
	    
		ТекстЗапроса = "ВЫБРАТЬ
		               |	вмс_МестоположенияКонтейнеровСрезПоследних.Контейнер КАК Контейнер,
		               |	вмс_МестоположенияКонтейнеровСрезПоследних.Ячейка КАК Ячейка
		               |ИЗ
		               |	РегистрСведений.вмс_МестоположенияКонтейнеров.СрезПоследних(
		               |			,
		               |			Контейнер = &Контейнер
		               |				И &УсловиеИсключенияДокумента) КАК вмс_МестоположенияКонтейнеровСрезПоследних";

		
	ТекущаяОперация = Процессор.ДокументОперации;
		
	ПараметрыЗапроса = Новый Структура("Контейнер", Контейнер);
	Если ЗначениеЗаполнено(ТекущаяОперация.ЗаданиеКладовщику) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеИсключенияДокумента", "Регистратор.ЗаданиеКладовщику <> &ЗаданиеКладовщикуОперации");
		ПараметрыЗапроса.Вставить("ЗаданиеКладовщикуОперации", ТекущаяОперация.ЗаданиеКладовщику);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеИсключенияДокумента", "Регистратор <> &ТекущаяОперация");
		ПараметрыЗапроса.Вставить("ТекущаяОперация", ТекущаяОперация);	
	КонецЕсли;
	
    Запрос = ОН.НовыйЗапрос(ТекстЗапроса);
	Запрос.Параметры = ПараметрыЗапроса; 
	ТаблицаЯчеекКонтейнера = ОН.ПолучитьТаблицуРезультатаЗапроса(Запрос);

	Если ТаблицаЯчеекКонтейнера.Количество() = 0 Тогда
		Возврат Процессор.ПустаяЯчейка;
	КонецЕсли;
	
	ИсходнаяЯчейка = ТаблицаЯчеекКонтейнера[0].Ячейка; 
	
	Возврат ИсходнаяЯчейка;	
	
КонецФункции

Функция ВыполнитьСлияниеКонтейнеровВидаКороб(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка) 
	Перем ОстаткиВнутреннегоКонтейнера, Остаток, ОстаткиПриемника;
	Перем КлючиДанных, ИндексОстатков, ОстатокПриемника, КоличествоОбъединить;
	Перем МестоположениеКонтейнера;
	
	// Пока так, проблема возникает если выполняют слияние короба который на палллета и кладут в пустой, по сути это какая то дичь, но у нас ломается потому как по 
	// местоположению короба источника он уже не на паллете в этот момент и мы не можем приемнику назначить родителя, поэтому лучше пока такой сценарий просто обрезать     
	// ++
	ОстаткиКонтейнерПриемника =  ПолучитьОстаткиТоваровВКонтейнере(Процессор, СтрокаИнструкции.КонтейнерПриемник);   
	Если ОстаткиКонтейнерПриемника.Количество() = 0 Тогда
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
		СтрШаблон("Контейнер приемник при слиянии коробов не может быть пустым! Слияние невозможно!",));       
		Возврат Ложь;
		
	КонецЕсли;
	// --
	
	ОстаткиВнутреннегоКонтейнера = ПолучитьОстаткиТоваровВКонтейнере(Процессор, СтрокаИнструкции.Контейнер);
	
	// Определяем местоположение контейнера-приемника
	Если СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка Тогда 
		//ТУ_Прошин_25.05.26+
		//МестоположениеКонтейнера = Новый Структура;    
		МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);
		//ТУ_Прошин_25.05.26-
		МестоположениеКонтейнера.Ячейка = СтрокаИнструкции.ЯчейкаПриемник;
		МестоположениеКонтейнера.КонтейнерОстатковВЯчейках = СтрокаИнструкции.КонтейнерПриемник;
	Иначе
		МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);
	КонецЕсли;
	
	// Обрабатываем каждый товар из источника
	Для Каждого Остаток Из ОстаткиВнутреннегоКонтейнера Цикл
		Если Остаток.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		// Формируем ключи для поиска аналогичного товара в приемнике
		КлючиДанных = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции);
		КлючиДанных.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
		КлючиДанных.Товар = Остаток.Товар;
		Если Остаток.Свойство("Характеристика") И ЗначениеЗаполнено(Остаток.Характеристика) Тогда
			КлючиДанных.Характеристика = Остаток.Характеристика;
		КонецЕсли;
		Если Остаток.Свойство("Серия") И ЗначениеЗаполнено(Остаток.Серия) Тогда
			КлючиДанных.Серия = Остаток.Серия;
		КонецЕсли;
		ИндексОстатков = НайтиИндекс(Процессор, "ОстаткиТоваровВКонтейнерах", КлючиДанных);
 		Если ИндексОстатков <> Неопределено Тогда
			// Товар уже есть в приемнике - объединяем количество
			ОстаткиПриемника = ПолучитьДанныеИндекса(ИндексОстатков);
			Для Каждого ОстатокПриемника Из ОстаткиПриемника Цикл
				КоличествоОбъединить = Мин(Остаток.Количество, ОстатокПриемника.Количество);
				// Приходуем объединенное количество
				СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
				СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
				СтрокаДвиженияРегистра.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
				СтрокаДвиженияРегистра.Количество = Остаток.Количество;
				Прервать;
			КонецЦикла;
		Иначе
			// Товара нет в приемнике - просто приходуем
			СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
			СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
			СтрокаДвиженияРегистра.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
			СтрокаДвиженияРегистра.Количество = Остаток.Количество;
		КонецЕсли;
		// Приходуем товар в ячейку (если есть местоположение) todo. если у приемника есть местоположение    
		МестоположениеКонтейнераИсточника = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.Контейнер);
		Если МестоположениеКонтейнера <> Неопределено И (ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка) ИЛИ ЗначениеЗаполнено(МестоположениеКонтейнераИсточника.Ячейка)) Тогда
			СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Остаток);
			ЗаполнитьЗначенияСвойств(СтрокаДвиженияРегистра, Остаток);
			СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
			СтрокаДвиженияРегистра.Контейнер = МестоположениеКонтейнера.КонтейнерОстатковВЯчейках;  
			// Логика в том, что если контейнер приемник есть на остатках в ячейке - то приходуем на нее, а если нет то приходуем где лежал исходный контейнер
			// нужно, например, в сценарии если для слияния создали новый контейнер
			ЯчейкаПрихода = ?(ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка), МестоположениеКонтейнера.Ячейка, МестоположениеКонтейнераИсточника.Ячейка);	
			СтрокаДвиженияРегистра.Ячейка = ЯчейкаПрихода;   
			
			Если НЕ ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка) Тогда
				// Если для слияния создали новый короб - нужно определить его местоположение положив на ячейку и закрепив родителя по источнику      
				КопияСтрокиИнструкции = вмс_РаботаСКоллекциями.СкопироватьОбъект(СтрокаИнструкции);  
				КопияСтрокиИнструкции.Контейнер = СтрокаИнструкции.КонтейнерПриемник; 
				
				ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, КопияСтрокиИнструкции, СтрокаИнструкции.КонтейнерПриемник, МестоположениеКонтейнераИсточника.КонтейнерРодитель, МестоположениеКонтейнераИсточника.КонтейнерРодитель, ЯчейкаПрихода);		
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	// Списываем контейнер-источник с ячейки (он теперь пустой)
	//ВыполнитьСписаниеКонтейнераСМест(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
	// Списываем товары из контейнера-источника (регистр ОстаткиТоваровВКонтейнерах)
	Для Каждого Остаток Из ОстаткиВнутреннегоКонтейнера Цикл
		Если Остаток.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
		СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

Функция ВыполнитьСлияниеКонтейнеровВидаПаллет(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка)
	Перем ОстаткиВнутреннегоКонтейнера, Остаток, ОстаткиПриемника;
	Перем КлючиДанных, ИндексОстатков, ОстатокПриемника, КоличествоОбъединить;
	Перем МестоположениеКонтейнера;
	РК = вмс_РаботаСКоллекциями;
	// Получаем товары из контейнера-источника
	
	ОстаткиВнутреннегоКонтейнера = ПолучитьОстаткиТоваровВКонтейнере(Процессор, СтрокаИнструкции.Контейнер);
	
	// Определяем местоположение контейнера-приемника
	Если СтрокаИнструкции.ЯчейкаПриемник <> ПустаяЯчейка Тогда 
		//ТУ_Прошин_25.05.26+
		//МестоположениеКонтейнера = Новый Структура;    
		МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);
		//ТУ_Прошин_25.05.26-
		МестоположениеКонтейнера.Ячейка = СтрокаИнструкции.ЯчейкаПриемник;
		МестоположениеКонтейнера.КонтейнерОстатковВЯчейках = СтрокаИнструкции.КонтейнерПриемник;
	Иначе
		МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.КонтейнерПриемник);
	КонецЕсли;
		
	// Обрабатываем каждый товар из источника
 	Для Каждого Остаток Из ОстаткиВнутреннегоКонтейнера Цикл
		Если Остаток.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		// Формируем ключи для поиска аналогичного товара в приемнике
		КлючиДанных = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции);
		КлючиДанных.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
		КлючиДанных.Товар = Остаток.Товар;
		Если Остаток.Свойство("Характеристика") И ЗначениеЗаполнено(Остаток.Характеристика) Тогда
			КлючиДанных.Характеристика = Остаток.Характеристика;
		КонецЕсли;
		Если Остаток.Свойство("Серия") И ЗначениеЗаполнено(Остаток.Серия) Тогда
			КлючиДанных.Серия = Остаток.Серия;
		КонецЕсли;
		ИндексОстатков = НайтиИндекс(Процессор, "ОстаткиТоваровВКонтейнерах", КлючиДанных);
 		Если ИндексОстатков <> Неопределено Тогда
			// Товар уже есть в приемнике - объединяем количество
			ОстаткиПриемника = ПолучитьДанныеИндекса(ИндексОстатков);
			Для Каждого ОстатокПриемника Из ОстаткиПриемника Цикл
				КоличествоОбъединить = Мин(Остаток.Количество, ОстатокПриемника.Количество);
				// Приходуем объединенное количество
				СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
				СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
				СтрокаДвиженияРегистра.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
				СтрокаДвиженияРегистра.Количество = Остаток.Количество;
				Прервать;
			КонецЦикла;
		Иначе
			// Товара нет в приемнике - просто приходуем
			СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
			СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
			СтрокаДвиженияРегистра.Контейнер = СтрокаИнструкции.КонтейнерПриемник;
			СтрокаДвиженияРегистра.Количество = Остаток.Количество;
		КонецЕсли;
		// Приходуем товар в ячейку (если есть местоположение) todo. если у приемника есть местоположение   
		МестоположениеКонтейнераИсточника = ПолучитьМестоположениеКонтейнера(Процессор, СтрокаИнструкции.Контейнер);
		Если МестоположениеКонтейнера <> Неопределено И (ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка) ИЛИ ЗначениеЗаполнено(МестоположениеКонтейнераИсточника.Ячейка)) Тогда   
			Если ТипЗнч(Остаток.Товар) = Тип("СправочникСсылка.вмс_Контейнеры") Тогда         
				ОстатокКороба = ПолучитьОстаткиТоваровВКонтейнере(Процессор, Остаток.Товар);
				Для Каждого СтрокаОстаткаКороба Из ОстатокКороба Цикл
					СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Остаток); 
					ЗаполнитьЗначенияСвойств(СтрокаДвиженияРегистра, СтрокаОстаткаКороба);
					СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
					СтрокаДвиженияРегистра.Контейнер = МестоположениеКонтейнера.КонтейнерОстатковВЯчейках; 
					// Логика в том, что если контейнер приемник есть на остатках в ячейке - то приходуем на нее, а если нет то приходуем где лежал исходный контейнер
					// нужно, например, в сценарии если для слияния создали новый контейнер
					ЯчейкаПрихода = ?(ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка), МестоположениеКонтейнера.Ячейка, МестоположениеКонтейнераИсточника.Ячейка);
					СтрокаДвиженияРегистра.Ячейка = ЯчейкаПрихода;   
					
					// Меняем местоположение коробов      
					КопияСтрокиИнструкции = вмс_РаботаСКоллекциями.СкопироватьОбъект(СтрокаИнструкции);  
					КопияСтрокиИнструкции.Контейнер = Остаток.Товар; 
					
					ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, КопияСтрокиИнструкции, Остаток.Товар, СтрокаИнструкции.КонтейнерПриемник, СтрокаИнструкции.КонтейнерПриемник, ЯчейкаПрихода);	
					Если НЕ ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка) Тогда
						КопияСтрокиИнструкции2 = вмс_РаботаСКоллекциями.СкопироватьОбъект(СтрокаИнструкции);  
						КопияСтрокиИнструкции2.Контейнер = СтрокаИнструкции.КонтейнерПриемник; 
						
						ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, КопияСтрокиИнструкции2, СтрокаИнструкции.КонтейнерПриемник, ПустойКонтейнер, СтрокаИнструкции.КонтейнерПриемник, ЯчейкаПрихода);		
					КонецЕсли;	
				КонецЦикла;
				
			Иначе
				СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВЯчейках", СтрокаИнструкции, Остаток);
				ЗаполнитьЗначенияСвойств(СтрокаДвиженияРегистра, Остаток);
				СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
				СтрокаДвиженияРегистра.Контейнер = МестоположениеКонтейнера.КонтейнерОстатковВЯчейках;    
				// Логика в том, что если контейнер приемник есть на остатках в ячейке - то приходуем на нее, а если нет то приходуем где лежал исходный контейнер
				// нужно, например, в сценарии если для слияния создали новый контейнер
				ЯчейкаПрихода = ?(ЗначениеЗаполнено(МестоположениеКонтейнера.Ячейка), МестоположениеКонтейнера.Ячейка, МестоположениеКонтейнераИсточника.Ячейка);
				СтрокаДвиженияРегистра.Ячейка = ЯчейкаПрихода;
				//СтрокаДвиженияРегистра.Ячейка = МестоположениеКонтейнера.Ячейка;   
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Списываем контейнер-источник с ячейки (он теперь пустой)
	//ВыполнитьСписаниеКонтейнераСМест(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка);
	// Списываем товары из контейнера-источника (регистр ОстаткиТоваровВКонтейнерах)
	Для Каждого Остаток Из ОстаткиВнутреннегоКонтейнера Цикл
		Если Остаток.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДвиженияРегистра = ДобавитьДвижениеРегистра(Процессор, "ОстаткиТоваровВКонтейнерах", СтрокаИнструкции, Остаток);
		СтрокаДвиженияРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЦикла;

	Возврат Истина;
КонецФункции

Функция МастерКонтейнер(Процессор, Контейнер)
	
	МестоположениеКонтейнераОтправителя = ПолучитьМестоположениеКонтейнера(Процессор, Контейнер);
	Возврат МестоположениеКонтейнераОтправителя.КонтейнерРодитель;

КонецФункции

// 3.2.4 - Компиляция 3 уровня, новая -

Функция ПроверитьЯчейкуПриемникНаМестоположениеКонтейнерПриемника(Процессор, СтрокаИнструкции, КонтейнерПриемник, ЯчейкаПриемник)
	//ТУ_Прошин_26.05.26+	
	МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, КонтейнерПриемник);
	Ячейка = МестоположениеКонтейнера.Ячейка;
	Если Ячейка <> Неопределено И Ячейка <> Процессор.ПустаяЯчейка И Ячейка <> Процессор.ЯчейкаДляНеразмещенныхКонтейнеров И ЯчейкаПриемник <> Ячейка Тогда
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
		СтрШаблон("Контейнер приемник находится на ячейке %1, разместить на ячейку %2 невозможно!", Строка(МестоположениеКонтейнера.Ячейка), Строка(ЯчейкаПриемник)));       
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина  
	//ТУ_Прошин_26.05.26-
КонецФункции  

Функция ПроверитьЯчейкуПриемникНаМестоположениеКонтейнера(Процессор, СтрокаИнструкции, Контейнер, ЯчейкаПриемник)
	//ТУ_Прошин_29.05.26+	
	МестоположениеКонтейнера = ПолучитьМестоположениеКонтейнера(Процессор, Контейнер);  
	ЯчейкаДоОперацииПоЯчейкам = ТекущаяЯчейкаИзРегистра(Процессор, Контейнер);  
	Ячейка = МестоположениеКонтейнера.Ячейка;
	Если Ячейка <> Неопределено И Ячейка <> Процессор.ПустаяЯчейка И Ячейка <> Процессор.ЯчейкаДляНеразмещенныхКонтейнеров И (Ячейка <> ЯчейкаПриемник И ЯчейкаДоОперацииПоЯчейкам <> Ячейка) Тогда
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
		СтрШаблон("Контейнер находится на ячейке %1, разместить на ячейку %2 невозможно!", Строка(МестоположениеКонтейнера.Ячейка), Строка(ЯчейкаПриемник)));       
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина  
	//ТУ_Прошин_29.05.26-
КонецФункции 

Функция ПредполагаемыйМастерКонтейнерСоответствуетТекущему(Процессор, СтрокаИнструкции, Контейнер, ПотенциальныйМастерКонтейнер, ПустойКонтейнер)    
	
	ПаллетаПересчета = ПолучитьПаллетуПересчетаКонтейнера(Процессор, Контейнер);

	Если ПаллетаПересчета <> Неопределено И ПаллетаПересчета <> ПотенциальныйМастерКонтейнер Тогда   
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
		СтрШаблон("Контейнер %1 находится на контейнере %2, разместить на контейнер %3 невозможно!", Строка(Контейнер), Строка(ПаллетаПересчета), Строка(ПотенциальныйМастерКонтейнер)));
		Возврат Ложь; 
	ИначеЕсли СтрокаИнструкции.ПересчетКонтейнераРодителя И ПотенциальныйМастерКонтейнер <> ПустойКонтейнер Тогда
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
		СтрШаблон("Нельзя перемещать контейнер на другой контейнер во время пересчета мастер контейнера! ",));
		Возврат Ложь;		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьПаллетуПересчетаКонтейнера(Процессор, Контейнер)

	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	СтрокаИнструкцииПересчета = РК.НайтиЭлементКоллекции(Процессор.ТаблицаИнструкцийРазложенная, Новый Структура("Контейнер, ПересчетВКонтейнере", Контейнер, Истина));
	
	Если СтрокаИнструкцииПересчета <> Неопределено Тогда
		Возврат СтрокаИнструкцииПересчета.КонтейнерПриемник;
	КонецЕсли;
	
КонецФункции

Функция ЗакончитьФормированиеДвижений(Процессор)
	
	УпорядочитьДвиженияРегистров(Процессор);
	
	ЗаполнитьПоляДвиженийРегистровПоУмолчанию(Процессор);
	
КонецФункции

Функция УпорядочитьДвиженияРегистров(Процессор)

	Перем РК;
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;

	Для Каждого ДвиженияРегистра Из Процессор.ДвиженияРегистров Цикл
		ИмяРегистра = ДвиженияРегистра.Ключ;
		ТаблицаДвижений = ДвиженияРегистра.Значение;
		МассивЭлементов = Новый Массив;
		Для Каждого СтрокаИнструкции Из РК.ПолучитьЭлементыКоллекции(Процессор.ТаблицаИнструкцийРазложенная) Цикл
			
			Для Каждого СтрокаДвижения Из СтрокаИнструкции.ДополнительныеДанные.ДвиженияРегистров[ИмяРегистра] Цикл
				МассивЭлементов.Добавить(СтрокаДвижения);
			КонецЦикла;
			
		КонецЦикла;
        РК.УдалитьДублиВМассиве(МассивЭлементов, Истина);
		РК.УпорядочитьЭлементыКоллекцииЗначенийПоМассиву(ТаблицаДвижений, МассивЭлементов);
	КонецЦикла;
	
	
КонецФункции

Функция ЗаполнитьПоляДвиженийРегистровПоУмолчанию(Процессор)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	ОН = Процессор.ОбщиеМодули.ОбщегоНазначения;
	
	Регистратор = Процессор.ДокументОперации;
	Если ЗначениеЗаполнено(Процессор.Дата) Тогда
		Период = Процессор.Дата;
	Иначе
		Период = ТекущаяДата();
	КонецЕсли;
	
	СерияПоУмолчанию = Процессор.ПустаяСерия;
	КачествоНовый = Процессор.КачествоНовый;
	
	МассивЯчеек = Новый Массив;
	Для Каждого СтрокаДвижения Из РК.ПолучитьЭлементыКоллекции(Процессор.ДвиженияРегистров.ОстаткиТоваровВЯчейках) Цикл
		МассивЯчеек.Добавить(СтрокаДвижения.Ячейка);
	КонецЦикла;
		
	Запрос = ОН.НовыйЗапрос("ВЫБРАТЬ МестаХранения.Ссылка КАК Ячейка, МестаХранения.Владелец КАК Склад ИЗ Справочник.вмс_МестаХранения КАК МестаХранения ГДЕ МестаХранения.Ссылка В (&МассивЯчеек)");
	Запрос.Параметры.Вставить("МассивЯчеек", МассивЯчеек);
	ТаблицаЯчеек = ОН.ПолучитьТаблицуРезультатаЗапроса(Запрос);

	Для Каждого СтрокаДвижения Из РК.ПолучитьЭлементыКоллекции(Процессор.ДвиженияРегистров.ОстаткиТоваровВЯчейках) Цикл
		
		СтрокаДвижения.Регистратор = Регистратор;
		СтрокаДвижения.Период = Период;
		
		// ТУ_Прошин_13.01.26+ 
		// Измерение склад упразнено
		//СтрокаЯчейки = РК.НайтиЭлементКоллекции(ТаблицаЯчеек, Новый Структура("Ячейка", СтрокаДвижения.Ячейка));
		//Если СтрокаЯчейки <> Неопределено Тогда
		//	СтрокаДвижения.Склад = СтрокаЯчейки.Склад;
		//КонецЕсли; 
		// ТУ_Прошин_13.01.26-
		
		Если СтрокаДвижения.Серия=Неопределено Тогда
			СтрокаДвижения.Серия = СерияПоУмолчанию;
		КонецЕсли; 
		
		// ТУ_Прошин_10.11.25+
		Если СтрокаДвижения.Качество = Неопределено Тогда
			СтрокаДвижения.Качество = КачествоНовый;	
		КонецЕсли;	
		// ТУ_Прошин_10.11.25-
		
	КонецЦикла;
	
	Для Каждого СтрокаДвижения Из РК.ПолучитьЭлементыКоллекции(Процессор.ДвиженияРегистров.ОстаткиТоваровВКонтейнерах) Цикл
		
		СтрокаДвижения.Регистратор = Регистратор;
		СтрокаДвижения.Период = Период;   
		
		// ТУ_Прошин_10.11.25+
		Если СтрокаДвижения.Качество = Неопределено Тогда
			СтрокаДвижения.Качество = КачествоНовый;	
		КонецЕсли;	
		// ТУ_Прошин_10.11.25-
		
	КонецЦикла;
	
	Для Каждого СтрокаДвижения Из РК.ПолучитьЭлементыКоллекции(Процессор.ДвиженияРегистров.МестоположенияКонтейнеров) Цикл
		
		СтрокаДвижения.Регистратор = Регистратор;
		СтрокаДвижения.Период = Период;
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьОстатокТовара(Процессор, Аналитика)

	Индекс = НайтиИндекс(Процессор, "ОстаткиТоваровВЯчейках", Аналитика);
	
	Если Индекс <> Неопределено Тогда
		Данные = Индекс.Данные;
		Если Данные.Количество() > 0 Тогда
			Возврат Данные[0].Количество;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьМестоположениеКонтейнера(Процессор, Контейнер)
	
	Местоположение = Новый Структура();
	Местоположение.Вставить("Контейнер", Контейнер);
	Местоположение.Вставить("КонтейнерОстатковВЯчейках", Процессор.ПустойКонтейнер);
	Местоположение.Вставить("КонтейнерРодитель", Процессор.ПустойКонтейнер);
	Местоположение.Вставить("Ячейка", Процессор.ПустаяЯчейка);

	Индекс = НайтиИндекс(Процессор, "МестоположенияКонтейнеров", Новый Структура("Контейнер", Контейнер));
	Если Индекс <> Неопределено Тогда
		Данные = Индекс.Данные;
		Если Данные.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Местоположение, Данные[0]);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Местоположение;
	
КонецФункции

Функция ДобавитьДвижениеРегистра(Процессор, ИмяРегистра, СтрокаИнструкции, Знач ДанныеЗаполнения=Неопределено)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	Если ДанныеЗаполнения=Неопределено Тогда
		ДанныеЗаполнения = СтрокаИнструкции;
	КонецЕсли;
	
	СтрокаДвиженияРегистра = РК.ДобавитьЭлементКоллекции(Процессор.ДвиженияРегистров[ИмяРегистра], ДанныеЗаполнения);
	СтрокаДвиженияРегистра.НомерСтрокиДокумента = СтрокаИнструкции.НомерСтрокиДокумента;
	СтрокаИнструкции.ДополнительныеДанные.ДвиженияРегистров[ИмяРегистра].Добавить(СтрокаДвиженияРегистра);
	СтрокаИнструкции.ДополнительныеДанные.Скомпилирована = Истина;
	
	Возврат СтрокаДвиженияРегистра;
	
КонецФункции

Функция ДобавитьДвижениеРегистраМестоположенияКонтейнеров(Процессор, СтрокаИнструкции, Контейнер, КонтейнерРодитель, КонтейнерОстатковВЯчейках, Ячейка)
	
	Перем РК;
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ТаблицаДвиженийРегистраМестоположенияКонтейнеров = Процессор.ДвиженияРегистров.МестоположенияКонтейнеров;
	ПоляОтбораЭлемента = Новый Структура("Контейнер", Контейнер);
	МестоположениеКонтейнера = РК.НайтиЭлементКоллекции(ТаблицаДвиженийРегистраМестоположенияКонтейнеров, ПоляОтбораЭлемента);
	Если МестоположениеКонтейнера=Неопределено Тогда
		МестоположениеКонтейнера = РК.ДобавитьЭлементКоллекции(ТаблицаДвиженийРегистраМестоположенияКонтейнеров, ПоляОтбораЭлемента);
	КонецЕсли;
	
	МестоположениеКонтейнера.КонтейнерРодитель = КонтейнерРодитель;
	МестоположениеКонтейнера.КонтейнерОстатковВЯчейках = КонтейнерОстатковВЯчейках;
	МестоположениеКонтейнера.Ячейка = Ячейка;
	
	СтрокаИнструкции.ДополнительныеДанные.ДвиженияРегистров.МестоположенияКонтейнеров.Добавить(МестоположениеКонтейнера);
	СтрокаИнструкции.ДополнительныеДанные.Скомпилирована = Истина;
	
	Возврат МестоположениеКонтейнера;
	
КонецФункции

Функция ПолучитьОстаткиТоваровВКонтейнере(Процессор, Контейнер)
	
	ИК = Процессор.ОбщиеМодули.ИндексированиеКоллекций;
	
	ОстаткиТоваровВКонтейнерах = Процессор.Данные.ОстаткиТоваровВКонтейнерах;
	
	Вектор = Новый Массив;
	Вектор.Добавить(Контейнер);
	ИндексОстаткиТоваровВКонтейнере = ИК.НайтиИндекс(ОстаткиТоваровВКонтейнерах, Вектор);
	Если ИндексОстаткиТоваровВКонтейнере <> Неопределено Тогда
		ОстаткиТоваровВКонтейнере = ИК.ПолучитьДанныеИндекса(ИндексОстаткиТоваровВКонтейнере);
	Иначе
		ОстаткиТоваровВКонтейнере = Новый Массив;
	КонецЕсли;
	
	Возврат ОстаткиТоваровВКонтейнере;
	
КонецФункции    

Функция ПроверитьОстаткиТоваровВКонтейнереНаЯчейке(Процессор, СтрокаИнструкции, ЯчейкаСписания, Контейнер) 
	//ТУ_Прошин_26.05.26+
	ИК = Процессор.ОбщиеМодули.ИндексированиеКоллекций;
	РК = вмс_работаСКоллекциями;
	
	ОстаткиТоваровВКонтейнерах = Процессор.Данные.ОстаткиТоваровВЯчейках;   
	Вектор = Новый Массив;    
	
	Для Каждого ТоварноеПоле Из Процессор.ТоварныеПоляМассив Цикл
		Вектор.Добавить(СтрокаИнструкции[ТоварноеПоле]);	
	КонецЦикла;  
	
	ИндексОстаткиТоваровВЯчейке = ИК.НайтиИндекс(ОстаткиТоваровВКонтейнерах, Вектор);
	Если ИндексОстаткиТоваровВЯчейке = Неопределено Тогда       
		Возврат Ложь;
	КонецЕсли;
	
	ОстаткиТоваровВЯчейке = ИК.ПолучитьДанныеИндекса(ИндексОстаткиТоваровВЯчейке);
	РК.УдалитьДублиВМассиве(ОстаткиТоваровВЯчейке);
	Если ОстаткиТоваровВЯчейке.Количество() = 0 Тогда     
		Возврат Ложь;	
	КонецЕсли;
	
	Для Каждого Строка Из ОстаткиТоваровВЯчейке Цикл
		Если Строка.Ячейка = ЯчейкаСписания И Строка.Контейнер = Контейнер Тогда
			Возврат Истина;		
		КонецЕсли;		
	КонецЦикла;
		
	Возврат Ложь;

	//ТУ_Прошин_26.05.26-
КонецФункции 

Функция ПолучитьЯчейкуКонтейнераПоОстаткамТоваровВЯчейке(Процессор, СтрокаИнструкции, Контейнер)
	ИК = Процессор.ОбщиеМодули.ИндексированиеКоллекций;
	РК = вмс_работаСКоллекциями;
	
	ОстаткиТоваровВКонтейнерах = Процессор.Данные.ОстаткиТоваровВЯчейках;   
	Вектор = Новый Массив;    
	
	Для Каждого ТоварноеПоле Из Процессор.ТоварныеПоляМассив Цикл
		Вектор.Добавить(СтрокаИнструкции[ТоварноеПоле]);	
	КонецЦикла;  
	
	ИндексОстаткиТоваровВЯчейке = ИК.НайтиИндекс(ОстаткиТоваровВКонтейнерах, Вектор);
	Если ИндексОстаткиТоваровВЯчейке = Неопределено Тогда       
		Возврат Неопределено;
	КонецЕсли;
	
	ОстаткиТоваровВЯчейке = ИК.ПолучитьДанныеИндекса(ИндексОстаткиТоваровВЯчейке);
	РК.УдалитьДублиВМассиве(ОстаткиТоваровВЯчейке);
	Если ОстаткиТоваровВЯчейке.Количество() = 0 Тогда     
		Возврат Неопределено;	
	КонецЕсли;
	
	Отбор = Новый Структура("Контейнер", Контейнер);
	СтрокаОстатка = РК.НайтиЭлементКоллекции(ОстаткиТоваровВЯчейке, Отбор);  
	Если ЗначениеЗаполнено(СтрокаОстатка) Тогда
		Возврат СтрокаОстатка.Ячейка
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция ПрименитьДвиженияРегистровКДанным(Процессор, ДвиженияРегистров)
	
	ПрименитьДвиженияРегистраОстаткиТоваровВЯчейках(Процессор, ДвиженияРегистров);
	
	ПрименитьДвиженияРегистраОстаткиТоваровВКонтейнерах(Процессор, ДвиженияРегистров);
	
	ПрименитьДвиженияРегистраМестоположенияКонтейнеров(Процессор, ДвиженияРегистров);
	
КонецФункции

Функция ПрименитьДвиженияРегистраОстаткиТоваровВЯчейках(Процессор, ДвиженияРегистров)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	Для Каждого СтрокаДвижения Из ДвиженияРегистров.ОстаткиТоваровВЯчейках Цикл
		ЭтоПриход = СтрокаДвижения.ВидДвижения=ВидДвиженияНакопления.Приход;
		КоличествоОборот = ?(ЭтоПриход, СтрокаДвижения.Количество, -СтрокаДвижения.Количество);
		Индекс = НайтиИндекс(Процессор, "ОстаткиТоваровВЯчейках", СтрокаДвижения);
		Если Индекс=Неопределено Тогда
			КоличествоОстаток = 0;
			ЭлементДанныхОстатков = НовыйЭлементДанных(Процессор, "ОстаткиТоваровВЯчейках", СтрокаДвижения);
			ЭлементДанныхОстатков.Количество = КоличествоОборот;
			
			ДанныеДляЗагрузки = Новый Массив;
			ДанныеДляЗагрузки.Добавить(ЭлементДанныхОстатков);
			ВставитьДанныеВИндекс(Процессор, "ОстаткиТоваровВЯчейках", ДанныеДляЗагрузки);
		Иначе
			ЭлементДанныхОстатков = Индекс.Данные[0];
			КоличествоОстаток = ЭлементДанныхОстатков.Количество;
			ЭлементДанныхОстатков.Количество = ЭлементДанныхОстатков.Количество + КоличествоОборот;
		КонецЕсли;
		
		Если НЕ ЭтоПриход И СтрокаДвижения.Количество > 0 И КоличествоОстаток < СтрокаДвижения.Количество Тогда
			ДобавитьОшибкуПроведения(Процессор, СтрокаДвижения, "недостаточно остатка - доступный остаток: " + КоличествоОстаток);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ПрименитьДвиженияРегистраОстаткиТоваровВКонтейнерах(Процессор, ДвиженияРегистров)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	ИмяРегистра = "ОстаткиТоваровВКонтейнерах";
	
	ДанныеДляЗагрузки = Новый Массив;
	Для Каждого СтрокаДвижения Из ДвиженияРегистров[ИмяРегистра] Цикл
		ЭтоПриход = СтрокаДвижения.ВидДвижения=ВидДвиженияНакопления.Приход;
		КоличествоОборот = ?(ЭтоПриход, СтрокаДвижения.Количество, -СтрокаДвижения.Количество);
		Индекс = НайтиИндекс(Процессор, ИмяРегистра, СтрокаДвижения);
		Если Индекс=Неопределено Тогда
			КоличествоОстаток = 0;
			ЭлементДанныхОстатков = НовыйЭлементДанных(Процессор, ИмяРегистра, СтрокаДвижения);
			ЭлементДанныхОстатков.Количество = КоличествоОборот;
			ДанныеДляЗагрузки.Добавить(ЭлементДанныхОстатков);
		Иначе
			ЭлементДанныхОстатков = Индекс.Данные[0];
			КоличествоОстаток = ЭлементДанныхОстатков.Количество;
			ЭлементДанныхОстатков.Количество = ЭлементДанныхОстатков.Количество + КоличествоОборот;
		КонецЕсли;
		
		Если НЕ ЭтоПриход И СтрокаДвижения.Количество > 0 И КоличествоОстаток < СтрокаДвижения.Количество Тогда
			ДобавитьОшибкуПроведения(Процессор, СтрокаДвижения, "недостаточно остатка в контейнере");
		КонецЕсли;
		
	КонецЦикла;
	
	ВставитьДанныеВИндекс(Процессор, ИмяРегистра, ДанныеДляЗагрузки);
	
КонецФункции

Функция ПрименитьДвиженияРегистраМестоположенияКонтейнеров(Процессор, ДвиженияРегистров)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	ИмяРегистра = "МестоположенияКонтейнеров";
	
	ДанныеДляЗагрузки = Новый Массив;
	Для Каждого СтрокаДвижения Из ДвиженияРегистров[ИмяРегистра] Цикл
		
		Индекс = НайтиИндекс(Процессор, ИмяРегистра, СтрокаДвижения);
		Если Индекс=Неопределено Тогда
			ЭлементДанныхОстатков = НовыйЭлементДанных(Процессор, ИмяРегистра, СтрокаДвижения);
			ДанныеДляЗагрузки.Добавить(ЭлементДанныхОстатков);
		Иначе
			ЭлементДанныхОстатков = Индекс.Данные[0];
			ЗаполнитьЗначенияСвойств(ЭлементДанныхОстатков, СтрокаДвижения);
		КонецЕсли;
		
	КонецЦикла;
	
	ВставитьДанныеВИндекс(Процессор, ИмяРегистра, ДанныеДляЗагрузки);
	
КонецФункции

Функция ДобавитьОшибкуПроведения(Процессор, СтрокаДвижения, ТекстОшибки)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	Процессор.Отказ = Истина;
	
	ЭлементОшибки = РК.ДобавитьЭлементКоллекции(Процессор.Ошибки); 
	ЭлементОшибки.НомерСтроки = СтрокаДвижения.НомерСтрокиДокумента;
	ЭлементОшибки.Текст = ТекстОшибки;
	
КонецФункции

Функция ПоказатьОшибкиПроведения(Процессор)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ТекстОшибки = "";
	
	#Если НЕ Клиент Тогда
		Для Каждого ЭлементОшибки Из РК.ПолучитьЭлементыКоллекции(Процессор.Ошибки) Цикл
			ТекстОшибкиСтроки = "Номер строки " + ЭлементОшибки.НомерСтроки + ": " + ЭлементОшибки.Текст;
			ТекстОшибки = ТекстОшибки + ТекстОшибкиСтроки +  Символы.ПС;
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибкиСтроки);
		КонецЦикла;
	#КонецЕсли
	
	Если ТипЗнч(Процессор.ДокументОперации)=Тип("ДокументСсылка.вмс_ОперацияПоЯчейкам") Тогда
		ОперацияПоЯчейкамОбъект = Процессор.ДокументОперации.ПолучитьОбъект();
	Иначе
		ОперацияПоЯчейкамОбъект = Процессор.ДокументОперации;
	КонецЕсли;
	
	ТекстОшибки = "Ошибка при проведении документа " + ОперацияПоЯчейкамОбъект + Символы.ПС + ТекстОшибки;
	ТекстОшибки = СокрЛП(ТекстОшибки);
	
	#Если НЕ Клиент Тогда
		Контекст = "";
		Контекст = Контекст + "Дата: " + ТекущаяДата() + Символы.ПС;
		Контекст = Контекст + ОперацияПоЯчейкамОбъект + Символы.ПС;
		Контекст = Контекст + ОперацияПоЯчейкамОбъект.ЗаданиеКладовщику;
		ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС + вмс_Журналирование.СериализоватьКонтекст(ОперацияПоЯчейкамОбъект);
		
		ПараметрыФоновогоЗадания = Новый Массив;
		ПараметрыФоновогоЗадания.Добавить(ТекстОшибки);
		ПараметрыФоновогоЗадания.Добавить(Контекст);
		ФоновыеЗадания.Выполнить("вмс_Журналирование.Ошибка", ПараметрыФоновогоЗадания);
	#КонецЕсли
	
КонецФункции

Функция ЗагрузитьОстатки(Процессор)
	
	Перем РК, ИК;
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	ИК = Процессор.ОбщиеМодули.ИндексированиеКоллекций;
	
	ТаблицаЗапросаОстатковТоваровВЯчейках = ПолучитьТаблицуДанных(Процессор, "ЗапросОстатковТоваровВЯчейках");
	ТаблицаЗапросаОстатковКонтейнеровВЯчейках = ПолучитьТаблицуДанных(Процессор, "ЗапросОстатковКонтейнеровВЯчейках");
	ТаблицаЗапросаОстатковТоваровВКонтейнерах = ПолучитьТаблицуДанных(Процессор, "ЗапросОстатковТоваровВКонтейнерах");
	ТаблицаЗапросаМестоположенийКонтейнеров = ПолучитьТаблицуДанных(Процессор, "ЗапросМестоположенийКонтейнеров");
	Если РК.ПолучитьЭлементыКоллекции(ТаблицаЗапросаОстатковТоваровВЯчейках).Количество()=0
		И РК.ПолучитьЭлементыКоллекции(ТаблицаЗапросаОстатковКонтейнеровВЯчейках).Количество()=0
		И РК.ПолучитьЭлементыКоллекции(ТаблицаЗапросаОстатковТоваровВКонтейнерах).Количество()=0
		И РК.ПолучитьЭлементыКоллекции(ТаблицаЗапросаМестоположенийКонтейнеров).Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Структура;
	Запрос.Вставить("ТаблицаЗапросаОстатковТоваровВЯчейках", ТаблицаЗапросаОстатковТоваровВЯчейках);
	Запрос.Вставить("ТаблицаЗапросаОстатковКонтейнеровВЯчейках", ТаблицаЗапросаОстатковКонтейнеровВЯчейках);
	Запрос.Вставить("ТаблицаЗапросаОстатковТоваровВКонтейнерах", ТаблицаЗапросаОстатковТоваровВКонтейнерах);
	Запрос.Вставить("ТаблицаЗапросаМестоположенийКонтейнеров", ТаблицаЗапросаМестоположенийКонтейнеров);
	Результат = ПолучитьДанныеИзБД(Процессор, Запрос);
	
	// остатки в ячейках
	ЗагрузитьДанныеВИндекс(Процессор, "ОстаткиТоваровВЯчейках", Результат.ТаблицаОстатковТоваровВЯчейках);
	// Добавим в кэш нулевые остатки, чтобы понимать, что по этим данным уже делался запрос
	ДанныеПоЗапросамОстатковВЯчейках = ИК.ПолучитьДанныеИндекса(Процессор.Данные.ЗапросОстатковТоваровВЯчейках);
	ВставитьДанныеВИндекс(Процессор, "ОстаткиТоваровВЯчейках", ДанныеПоЗапросамОстатковВЯчейках, "ТолькоНовые");
	
	// остатки в контейнерах
	Если Результат.ТаблицаОстатковТоваровВКонтейнерах <> Неопределено Тогда
		ЗагрузитьДанныеВИндекс(Процессор, "ОстаткиТоваровВКонтейнерах", Результат.ТаблицаОстатковТоваровВКонтейнерах);
	КонецЕсли;
	
	// Местоположения контейнеров
	Если Результат.ТаблицаМестоположенийКонтейнеров <> Неопределено Тогда
		ЗагрузитьДанныеВИндекс(Процессор, "МестоположенияКонтейнеров", Результат.ТаблицаМестоположенийКонтейнеров);
		ДанныеПоМестоположенияКонтейнеров = ИК.ПолучитьДанныеИндекса(Процессор.Данные.ЗапросМестоположенийКонтейнеров);
		ВставитьДанныеВИндекс(Процессор, "МестоположенияКонтейнеров", ДанныеПоМестоположенияКонтейнеров, "ТолькоНовые");
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеИзБД(Процессор, Запрос)
	
	ОН = Процессор.ОбщиеМодули.ОбщегоНазначения;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДокументОперации", Процессор.ДокументОперации);
	ДополнительныеПараметры.Вставить("Дата", Процессор.Дата);
	
	Если ОН.ЭтоБэкенд() Тогда
		#Если Клиент И НЕ ТолстыйКлиентОбычноеПриложение И НЕ ТолстыйКлиентУправляемоеПриложение Тогда
			УО = Процессор.ОбщиеМодули.УправлениеОстаткамиНовыйВызовСервера;
		#Иначе
			УО = Процессор.ОбщиеМодули.УправлениеОстаткамиНовыйСервер;
		#КонецЕсли
		
		Результат = УО.ПолучитьДанныеИзБД(Запрос, ДополнительныеПараметры);
	Иначе
		
		ОКИС = Вычислить("ОбращенияКИСКлиентСервер");
		Результат = ОКИС.ВыполнитьМетодОсновнойБД("вмс_УправлениеОстаткамиНовыйСервер");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуДанных(Процессор, ИмяТаблицы) Экспорт

	Перем РК, ИК;
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	ИК = Процессор.ОбщиеМодули.ИндексированиеКоллекций;
	
	Индекс = Процессор.Данные[ИмяТаблицы];

	ДанныеОстатков = ИК.ПолучитьДанныеИндекса(Индекс);
	РК.УдалитьДублиВМассиве(ДанныеОстатков);
	
	ТаблицаДанных = РК.НоваяКоллекцияЗначений(Индекс.ДополнительныеДанные.ВсеПоля);
	РК.ДобавитьЭлементыКоллекции(ТаблицаДанных, ДанныеОстатков);
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция СлияниеКонтейнеровДоступно(Процессор, СтрокаИнструкции, ПустойКонтейнер, ПустаяЯчейка)    
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	ОтборСтрокиИнструкции = Новый Структура("НомерСтрокиДокумента", СтрокаИнструкции.НомерСтрокиДокумента);
	ЗаполнитьЗначенияСвойств(ОтборСтрокиИнструкции, СтрокаИнструкции);
	СтрокаИнструкциДокумента = РК.НайтиЭлементКоллекции(Процессор.ТаблицаИнструкций, ОтборСтрокиИнструкции);	
	
	Если ЗначениеЗаполнено(СтрокаИнструкциДокумента.ЯчейкаОтправитель) И НЕ ЗначениеЗаполнено(СтрокаИнструкциДокумента.ЯчейкаПриемник) Тогда
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
		СтрШаблон("Выполнять слияние контейнеров при этом списывать контейнер с ячейки запрещено!",));
		Возврат Ложь; 	
	КонецЕсли;    
	
	Если НЕ ЗначениеЗаполнено(СтрокаИнструкциДокумента.ЯчейкаОтправитель) И ЗначениеЗаполнено(СтрокаИнструкциДокумента.ЯчейкаПриемник) Тогда
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
		СтрШаблон("Выполнять слияние контейнеров при этом приходовать контейнер на ячейку запрещено!",));
		Возврат Ложь; 	
	КонецЕсли;  
	
	Если СтрокаИнструкциДокумента.ЯчейкаОтправитель <> СтрокаИнструкциДокумента.ЯчейкаПриемник Тогда
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
		СтрШаблон("Выполнять слияние контейнеров, которые находятся на разных ячейках запрещено!",));
		Возврат Ложь; 	
	КонецЕсли;

	Если ЗначениеЗаполнено(СтрокаИнструкциДокумента.Товар) Тогда 
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
		СтрШаблон("Выполнять слияние контейнеров, во время пересчета товара запрещено!",));
		Возврат Ложь;
	КонецЕсли;  
	
	Если СтрокаИнструкциДокумента.Контейнер = СтрокаИнструкциДокумента.КонтейнерПриемник Тогда  
		ДобавитьОшибкуПроведения(Процессор, СтрокаИнструкции,
		СтрШаблон("Заполнение полей некорректно! Контейнер и Контейнер-приемник один и тот же контейнер!",));
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
КонецФункции

///////////////////////////////////////////////////////////////////////////////
//
//				Индексирование+
//

Функция ДобавитьИндекс(Процессор, ИмяИндекса, знач ПоляИндексирования, знач ПоляИтогов)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	ИК = Процессор.ОбщиеМодули.ИндексированиеКоллекций;
	
	ПоляИндексированияМассив = РК.ЗначениеВМассив(ПоляИндексирования, , Ложь);
	ПоляИндексирования = РК.МассивВСтроку(ПоляИндексированияМассив);
	
	ПоляИтоговМассив = РК.ЗначениеВМассив(ПоляИтогов, , Ложь);
	ПоляИтогов = РК.МассивВСтроку(ПоляИтоговМассив);
	
	ВсеПоляМассив = РК.СложениеМассивов(ПоляИндексированияМассив, ПоляИтоговМассив);
	ВсеПоля = РК.МассивВСтроку(ВсеПоляМассив);
	
	Индекс = ИК.НовыйИндекс();
	Индекс.ДополнительныеДанные.Вставить("ПоляИндексирования", ПоляИндексирования);
	Индекс.ДополнительныеДанные.Вставить("ПоляИндексированияМассив", ПоляИндексированияМассив);
	Индекс.ДополнительныеДанные.Вставить("ПоляИтоговМассив", ПоляИтоговМассив);
	Индекс.ДополнительныеДанные.Вставить("ПоляИтогов", ПоляИтогов);
	Индекс.ДополнительныеДанные.Вставить("ВсеПоляМассив", ВсеПоляМассив);
	Индекс.ДополнительныеДанные.Вставить("ВсеПоля", ВсеПоля);
	
	Процессор.Данные.Вставить(ИмяИндекса, Индекс);
	
	Возврат Индекс;
	
КонецФункции

Функция ДобавитьВИндексКомбинацииСПустымиЗначениямиПолей(Процессор, ИмяИндекса, ПоляКомбинацииСПустымиЗначениям, ПустыеЗначенияПолей)

	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	
	Индекс = Процессор.Данные[ИмяИндекса];
	ПоляИндексированияМассив = Индекс.ДополнительныеДанные.ПоляИндексированияМассив;
	
	ПоляКомбинацииСПустымиЗначениямМассив = РК.ЗначениеВМассив(ПоляКомбинацииСПустымиЗначениям);
	КоличествоПолейКомбинацииСПустымиЗначениями = ПоляКомбинацииСПустымиЗначениямМассив.Количество();
	НомераРазрядов = Новый Соответствие;
	Для НомерРазряда=0 По КоличествоПолейКомбинацииСПустымиЗначениями-1 Цикл
		Поле = ПоляКомбинацииСПустымиЗначениямМассив[НомерРазряда];
		НомераРазрядов[Поле] = НомерРазряда;
	КонецЦикла;
	
	Если ПоляИндексированияМассив.Количество() > ПоляКомбинацииСПустымиЗначениямМассив.Количество() Тогда
		// для оставшихся полей индексирования также нужно сделать комбинацию с пустыми значениями,
		// но это комбинация будет общей для всех таких полей
		ПоляОбщейКомбинации = РК.ВычитаниеМассивов(ПоляИндексированияМассив, ПоляКомбинацииСПустымиЗначениямМассив);
		Для Каждого Поле Из ПоляОбщейКомбинации Цикл
			НомераРазрядов[Поле] = НомерРазряда;
		КонецЦикла;

		КоличествоПолейКомбинацииСПустымиЗначениями = КоличествоПолейКомбинацииСПустымиЗначениями + 1;
	КонецЕсли;
	
	КоличествоКомбинаций = pow(2, КоличествоПолейКомбинацииСПустымиЗначениями) - 1; // "-1" так, как комбинация со всеми пустыми полями не имеет смысла
	
	СоответствиеЗначенийПустыхПолей = Новый Соответствие;
	Если ТипЗнч(ПустыеЗначенияПолей)=Тип("Структура") Тогда
		Для Каждого ПустоеЗначениеПоля Из ПустыеЗначенияПолей Цикл
			СоответствиеЗначенийПустыхПолей[ПустоеЗначениеПоля.Ключ] = ПустоеЗначениеПоля.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Индекс.ДополнительныеДанные.Вставить("СоответствиеЗначенийПустыхПолей", СоответствиеЗначенийПустыхПолей);
	
	Комбинации = Новый Массив;
	
	Для НомерКомбинации=0 По КоличествоКомбинаций-1 Цикл

		КомбинацияПустыхПолей = РК.РазложитьЧислоНаРазряды(НомерКомбинации, 2, КоличествоПолейКомбинацииСПустымиЗначениями);
		
		Комбинация = Новый Массив;
		Для Каждого Поле Из ПоляИндексированияМассив Цикл
			РазрядКомбинации = НомераРазрядов[Поле];
			Комбинация.Добавить(КомбинацияПустыхПолей[РазрядКомбинации]);
		КонецЦикла;
		
		Комбинации.Добавить(Комбинация);
		
	КонецЦикла;
	
	Индекс.ДополнительныеДанные.Вставить("КомбинацииСПустымиЗначениямиПолей", Комбинации);

КонецФункции

Функция НовыйЭлементДанных(Процессор, ИмяИндекса, ДанныеДляЗаполнения=Неопределено)
	
	Индекс = Процессор.Данные[ИмяИндекса];
	
	ЭлементДанных = Новый Структура(Индекс.ДополнительныеДанные.ВсеПоля);
	
	Если ДанныеДляЗаполнения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭлементДанных, ДанныеДляЗаполнения);
	КонецЕсли;
	
	ЗначенияНенайденныхДанных = Неопределено;
	Индекс.ДополнительныеДанные.Свойство("ЗначенияНенайденныхДанных", ЗначенияНенайденныхДанных);
	Если ЗначенияНенайденныхДанных <> Неопределено Тогда
		// Если данные по запросу не будут найдены, то подставятся ЗначенияНенайденныхДанных
		ЗаполнитьЗначенияСвойств(ЭлементДанных, ЗначенияНенайденныхДанных);
	КонецЕсли;
	
	Возврат ЭлементДанных;
	
КонецФункции

Функция ЗагрузитьДанныеВИндекс(Процессор, ИмяИндекса, Данные)
	
	РК = Процессор.ОбщиеМодули.РаботаСКоллекциями;
	ИК = Процессор.ОбщиеМодули.ИндексированиеКоллекций;

	Индекс = Процессор.Данные[ИмяИндекса];
	ПоляЭлемента = Индекс.ДополнительныеДанные.ВсеПоля;
	
	ДанныеДляЗагрузки = Новый Массив;
	Для Каждого ЭлементДанных Из РК.ПолучитьЭлементыКоллекции(Данные) Цикл
		ЭлементДанныхДляЗагрузки = Новый Структура(ПоляЭлемента);
		ЗаполнитьЗначенияСвойств(ЭлементДанныхДляЗагрузки, ЭлементДанных);
		ДанныеДляЗагрузки.Добавить(ЭлементДанныхДляЗагрузки);
	КонецЦикла;
	
	ВставитьДанныеВИндекс(Процессор, ИмяИндекса, ДанныеДляЗагрузки, "Замещать");
	
КонецФункции

Функция ВставитьЭлементДанныхВИндекс(Процессор, ИмяИндекса, ЭлементДанных, РежимВставки="Замещать")
	
	Данные = Новый Массив;
	Данные.Добавить(ЭлементДанных);
	ВставитьДанныеВИндекс(Процессор, ИмяИндекса, Данные, РежимВставки);
	
КонецФункции

Функция ВставитьДанныеВИндекс(Процессор, ИмяИндекса, знач Данные, РежимВставки="Замещать")
	
	ИК = Процессор.ОбщиеМодули.ИндексированиеКоллекций;
	
	Индекс = Процессор.Данные[ИмяИндекса];
	ПоляИндексированияМассив = Индекс.ДополнительныеДанные.ПоляИндексированияМассив;

	Если Индекс.ДополнительныеДанные.Свойство("КомбинацииСПустымиЗначениямиПолей") Тогда
		КомбинацииСПустымиЗначениямиПолей = Индекс.ДополнительныеДанные.КомбинацииСПустымиЗначениямиПолей;
		СоответствиеЗначенийПустыхПолей = Индекс.ДополнительныеДанные.СоответствиеЗначенийПустыхПолей;
		НомерПоследнегоПоляИндексирования = ПоляИндексированияМассив.Количество()-1;

		ЗначенияПустыхПолейМассив = Новый Массив;
		Для Каждого Поле Из ПоляИндексированияМассив Цикл
			ЗначенияПустыхПолейМассив.Добавить(СоответствиеЗначенийПустыхПолей[Поле]);
		КонецЦикла;
		
		ВекторизированныеДанныеДляЗагрузки = Новый Массив;
		Для Каждого ЭлементДанныхДляЗагрузки Из Данные Цикл
			ДанныеЭлементаМассив = Новый Массив;
			Для Каждого Поле Из ПоляИндексированияМассив Цикл
				ДанныеЭлементаМассив.Добавить(ЭлементДанныхДляЗагрузки[Поле]);
			КонецЦикла;
			
			Для Каждого Комбинация Из КомбинацииСПустымиЗначениямиПолей Цикл
				Вектор = Новый Массив;
				ДополнительныеКлючиВектора = Новый Массив;
				Для НомерПоля=0 По НомерПоследнегоПоляИндексирования Цикл
					Если Комбинация[НомерПоля]=1 Тогда
						ЗначениеПоля = ЗначенияПустыхПолейМассив[НомерПоля];
						Если ЗначениеПоля <> ДанныеЭлементаМассив[НомерПоля] Тогда
							ДополнительныеКлючиВектора.Добавить(ДанныеЭлементаМассив[НомерПоля]);
						КонецЕсли;
					Иначе
						ЗначениеПоля = ДанныеЭлементаМассив[НомерПоля];
					КонецЕсли;
					Вектор.Добавить(ЗначениеПоля);
				КонецЦикла;
				
				Для Каждого Ключ Из ДополнительныеКлючиВектора Цикл
					Вектор.Добавить(Ключ);
				КонецЦикла;
				
				ЭлементВекторизированныхДанныхДляЗагрузки = Новый Структура("Вектор, ЭлементДанных", Вектор, ЭлементДанныхДляЗагрузки);
				ВекторизированныеДанныеДляЗагрузки.Добавить(ЭлементВекторизированныхДанныхДляЗагрузки);
			КонецЦикла;
		КонецЦикла;

		ИК.ВставитьДанныеВИндекс(Индекс, ВекторизированныеДанныеДляЗагрузки, РежимВставки);
	Иначе
		ВекторизированныеДанныеДляЗагрузки = ИК.ВекторизироватьТаблицу(Данные, ПоляИндексированияМассив);
		ИК.ВставитьДанныеВИндекс(Индекс, ВекторизированныеДанныеДляЗагрузки, РежимВставки);
	КонецЕсли;
	
КонецФункции

Функция НайтиИндекс(Процессор, ИмяИндекса, КлючиДанных)
	
	ИК = Процессор.ОбщиеМодули.ИндексированиеКоллекций;
	
	НачальныйИндекс = Процессор.Данные[ИмяИндекса];
	
	Вектор = ИК.НовыйВектор(КлючиДанных, НачальныйИндекс.ДополнительныеДанные.ПоляИндексированияМассив);
	
	Индекс = ИК.НайтиИндекс(НачальныйИндекс, Вектор);

	Возврат Индекс;

КонецФункции

Функция ПолучитьДанныеИндексаБезИтогов(Индекс)

	Если НЕ Индекс.ДополнительныеДанные.Свойство("ПоляИндексированияМассив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КоличествоПолейИндексирования = Индекс.ДополнительныеДанные.ПоляИндексированияМассив.Количество();
	
	Возврат ПолучитьДанныеИндекса(Индекс, КоличествоПолейИндексирования);
	
КонецФункции

Функция ПолучитьДанныеИндекса(знач Индекс, МаксГлубина=-1)
	
	Данные = Новый Массив;
	
	Если Индекс=Неопределено Тогда
		Возврат Данные;
	КонецЕсли;
	
	ОбходИндексов = Новый Массив;
	ОбходИндексов.Добавить(Индекс);
	
	Уровень = 0;
	Пока ОбходИндексов.Количество() > 0 Цикл
		
		ОбходИндексовСледующийУровень = Новый Массив;
		
		Для Каждого Индекс Из ОбходИндексов Цикл
			
			Для Каждого ЭлементДанных Из Индекс.Данные Цикл
				Данные.Добавить(ЭлементДанных);
			КонецЦикла;
			
			Если Индекс.ИндексДляНеопределено <> Неопределено Тогда
				ОбходИндексовСледующийУровень.Добавить(Индекс.ИндексДляНеопределено);
			КонецЕсли;
			
			Для Каждого ЭлементВложенногоИндекса Из Индекс.ИндексыПоКлючу Цикл
				ОбходИндексовСледующийУровень.Добавить(ЭлементВложенногоИндекса.Значение);
			КонецЦикла;
			
		КонецЦикла;
		
		ОбходИндексов = ОбходИндексовСледующийУровень;
		
		Если Уровень=МаксГлубина Тогда
			Прервать;
		КонецЕсли;
		
		Уровень = Уровень + 1;
		
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

//
//				Индексирование-
//
///////////////////////////////////////////////////////////////////////////////
