
Функция ШифтСоответствиеСимволов() Экспорт
	Строка1 = "1234567890qwertyuiopasdfghjklzxcvbnm";
	Строка2 = "!@#$%^&*()QWERTYUIOPASDFGHJKLZXCVBNM";
	Массив1 = вмс_РаботаСКоллекциями.СтрокуВМассивПосимвольно(Строка1);
	Массив2 = вмс_РаботаСКоллекциями.СтрокуВМассивПосимвольно(Строка2);
	Соответствие = Новый Соответствие;
	Для Индекс=0 По Массив1.ВГраница() Цикл
		Соответствие[Массив1[Индекс]] = Массив2[Индекс];
	КонецЦикла;
	Возврат Соответствие;
КонецФункции

Функция ШифтСоответствиеСимволовОбратное() Экспорт
	Соответствие = ШифтСоответствиеСимволов();
	СоответствиеОбратное = Новый Соответствие;
	Для Каждого Элемент Из Соответствие Цикл
		СоответствиеОбратное[Элемент.Значение] = Элемент.Ключ;
	КонецЦикла;
	Возврат СоответствиеОбратное;
КонецФункции

Функция МнжожественнаяФормаСлова(Слово) Экспорт
	
	Словарь = Новый Соответствие;
	Словарь["Документ"] = "Документы";
	Словарь["РегистрСведений"] = "РегистрыСведений";
	
	МножественнаяФорма = Словарь[Слово];
	Если МножественнаяФорма = Неопределено Тогда
		МножественнаяФорма = Слово;
	КонецЕсли;
	
	Возврат МножественнаяФорма;
	
КонецФункции

Функция ПолучитьСтруктуруОписанияМетаданныхОбъектов() Экспорт
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОписанияМетаданныхОбъектов();
	
КонецФункции

Функция ПолучитьПустуюСтруктуруОписанияМетаданныхОбъектов() Экспорт
	
	Возврат Новый ФиксированнаяСтруктура( вмс_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОписанияМетаданныхОбъектов() );
	
КонецФункции

Функция ПолучитьЦифрыДесятичнойСистемы() Экспорт
	
	Цифры = Новый Массив;
	
	Цифры.Добавить("0");
	Цифры.Добавить("1");
	Цифры.Добавить("2");
	Цифры.Добавить("3");
	Цифры.Добавить("4");
	Цифры.Добавить("5");
	Цифры.Добавить("6");
	Цифры.Добавить("7");
	Цифры.Добавить("8");
	Цифры.Добавить("9");
	
	Возврат Цифры;
	
КонецФункции

Функция ПолучитьЦифрыШестнадцатиричнойСистемы() Экспорт
	
	Цифры = вмс_РаботаСКоллекциями.СкопироватьОбъект(ПолучитьЦифрыДесятичнойСистемы());
	
	Цифры.Добавить("A");
	Цифры.Добавить("B");
	Цифры.Добавить("C");
	Цифры.Добавить("D");
	Цифры.Добавить("E");
	Цифры.Добавить("F");
	
	Возврат Цифры;
	
КонецФункции

Функция ОбщийМодуль(ИмяМодуля) Экспорт
	
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
	
КонецФункции

Функция ЭтоБэкенд() Экспорт
	
	Возврат вмс_ОбщегоНазначенияВызовСервера.ЭтоБэкенд();
	
КонецФункции

Функция СоответствиеВсехМодулей() Экспорт
	
	Соответствие = Новый Соответствие;
	
	СписокИменОбщихМодулей = вмс_ОбщегоНазначенияВызовСервера.ПолучитьСписокИменОбщихМодулей(вмс_ОбщегоНазначенияКлиентСервер.ЭтоКлиент());
	
	Для каждого ИмяМодуля Из СписокИменОбщихМодулей Цикл
		Попытка
			Модуль = Вычислить(ИмяМодуля);
		Исключение
			Продолжить;
		КонецПопытки;
		Соответствие.Вставить(Модуль, ИмяМодуля);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьПараметрыПриложения(Номер=0) Экспорт
	
	Перем ПараметрыПриложения;
	
#Если Клиент И НЕ ТолстыйКлиентОбычноеПриложение И НЕ ТолстыйКлиентУправляемоеПриложение Тогда
		
		Возврат Неопределено;
		
#Иначе
		
		НомерКэшированияПараметровПриложения = ПараметрыСеанса.вмс_НомерКэшированияПараметровПриложения;

		Если Номер > НомерКэшированияПараметровПриложения Тогда
			
			// перекэшируем параметры с прошлого номера, чтобы пожили еще чутка
			ПараметрыПриложения = вмс_ОбщегоНазначенияКлиентСерверПовтИсп.ПолучитьПараметрыПриложения(Номер-1);
			
		Иначе
			
			Сериализация = Ложь;
			
			// попробуем восстановить из кэша временного хранилища
			ПараметрыПриложения = ПолучитьИзВременногоХранилища(ПараметрыСеанса.вмс_АдресХранилищаПараметровПриложения);
			
			Если ПараметрыПриложения <> Неопределено Тогда
				ДанныеДляОтладки = ПараметрыПриложения["ДанныеДляОтладки"];
				Сериализация = ДанныеДляОтладки.Ссылка1 <> ДанныеДляОтладки.Ссылка2;
				Если Сериализация Тогда
					// Кэш временного хранилища очистился
					// и параметры были восстановлены из сериализуемых данных
					// данные могут быть кривыми поэтому не используем их.
					// Такое может происходить если сеанс переехал на другой рабочий процесс на сервере
					ПараметрыПриложения = Неопределено;
				ИначеЕсли вмс_ОбщегоНазначенияКлиентСервер.ЭтоДержательМестаДляПараметровПриложения(ПараметрыПриложения) Тогда
					// Это всего лишь держатель места
					// не дождались, значит, когда параметры приложения займут свое законное место в кэше временного хранилища.
					// кэш модуля, с которого параметры должны были пересесть в хранилище, слетел раньше
					ПараметрыПриложения = Неопределено;
				Иначе
					// спасли из кэша временного хранилища
					ДанныеДляОтладки.ЧутьНеПотерялиКэш = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если ПараметрыПриложения=Неопределено Тогда
				ПараметрыПриложения = вмс_ОбщегоНазначенияКлиентСервер.НовыеПараметрыПриложения();
				Если Сериализация Тогда
					ДанныеДляОтладки = ПараметрыПриложения["ДанныеДляОтладки"];
					ДанныеДляОтладки.ПотерялиКэш = Истина;
					ДанныеДляОтладки.ПричинаПотериКэша = "Сериализация";
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;

		ДанныеДляОтладки = ПараметрыПриложения["ДанныеДляОтладки"];
		ДанныеДляОтладки.ДатаКэширования = ТекущаяДата();
		
		// подкрепим кэшем хранилища
		ПоместитьВоВременноеХранилище(ПараметрыПриложения, ПараметрыСеанса.вмс_АдресХранилищаПараметровПриложения);
		
		Возврат ПараметрыПриложения;
		
#КонецЕсли
	
КонецФункции
