
Функция Синхронизация(Данные)
	СтрокаСообщения = Данные.Получить();
	ОтветКлиентуСтрока = ЗарегистрироватьВыгрузку(СтрокаСообщения);
	ОтветКлиенту = Новый ХранилищеЗначения(ОтветКлиентуСтрока, Новый СжатиеДанных(9));
	Возврат ОтветКлиенту;
КонецФункции

Функция ЗарегистрироватьВыгрузку(СтрокаСообщения)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаСообщения);
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
	Отправитель = ЧтениеСообщения.Отправитель;
	ПланыОбмена.УдалитьРегистрациюИзменений(Отправитель, Отправитель.НомерПринятого);
	Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
		Данные = ПрочитатьXML(ЧтениеXML);
		Если Данные <> Неопределено Тогда
			Данные.ОбменДанными.Отправитель = ЧтениеСообщения.Отправитель;
			Данные.ОбменДанными.Загрузка = Истина;
			Данные.Записать();
		КонецЕсли; 
	КонецЦикла;
	ЧтениеСообщения.ЗакончитьЧтение();
	ЧтениеXML.Закрыть();
	
	
	//////////////////////////////////////////////////////////////////////////////
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Отправитель);
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Отправитель, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
		ОбъектОбмена = ВыборкаИзменений.Получить();
		ЗаписатьXML(ЗаписьXML, ОбъектОбмена);
	КонецЦикла;
	ЗаписьСообщения.ЗакончитьЗапись();
	Возврат ЗаписьXML.Закрыть();
	
	
КонецФункции

Функция ВыполнитьМетод(ОписаниеМетодаХранилище)
	
	ОписаниеМетода = ОписаниеМетодаХранилище.Получить();
	
	Результат = вмс_ОбщегоНазначенияВызовСервера.ВыполнитьМетод(ОписаниеМетода);
	
	РезультатХранилище = Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
	
	Возврат РезультатХранилище;
	
КонецФункции

