
Функция СоздатьФорматыСтрок(ТабличныйДокумент) Экспорт
	
	МассивОбластейФорматовСтрок = ПолучитьОбластиФорматовСтрок(ТабличныйДокумент);
	
	Для Каждого ОбластьФорматаСтрок Из МассивОбластейФорматовСтрок Цикл
		
		Если Не ЕстьФорматСтроки(ОбластьФорматаСтрок.Верх, ТабличныйДокумент) Тогда
			ОбластьФорматаСтрок.СоздатьФорматСтрок();
		КонецЕсли;
		
		МассивОбластейКолонок = ПолучитьОбластиКолонок(ОбластьФорматаСтрок, ТабличныйДокумент);
		
		Для Каждого ОбластьКолонки Из МассивОбластейКолонок Цикл
			ОбластьКолонки.ШиринаКолонки = ОбластьКолонки.ШиринаКолонки;
		КонецЦикла;

	КонецЦикла;
	
КонецФункции

Функция ЕстьФорматСтроки(НомерСтроки, ТабличныйДокумент) Экспорт
	
	ОбластьКолонки1 = ТабличныйДокумент.Область(НомерСтроки, 1, НомерСтроки, 1);
	
	ОбластьКолонки2 = ТабличныйДокумент.Область(ТабличныйДокумент.ВысотаТаблицы+1, 1, ТабличныйДокумент.ВысотаТаблицы+1, 1);
	
	Если ОбластьКолонки1.ШиринаКолонки <> ОбластьКолонки2.ШиринаКолонки Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИсходнаяШирина = ОбластьКолонки1.ШиринаКолонки;
	ОбластьКолонки1.ШиринаКолонки = ОбластьКолонки1.ШиринаКолонки + 1;
	ЕстьФорматСтроки = ОбластьКолонки1.ШиринаКолонки <> ОбластьКолонки2.ШиринаКолонки;
	ОбластьКолонки1.ШиринаКолонки = ИсходнаяШирина;
	
	Возврат ЕстьФорматСтроки;
	
КонецФункции

Функция СкопироватьШириныКолонокОбласти(ОбластьКолонок, ТабличныйДокументИсточник, ТабличныйДокументПриемник) Экспорт
	
	ОбластиКолонок = ПолучитьОбластиКолонок(ОбластьКолонок, ТабличныйДокументИсточник);
	
	Для Каждого ОбластьКолонки Из ОбластиКолонок Цикл
		
		ОбластьКолонкиПриемник = ТабличныйДокументПриемник.Область(1, ОбластьКолонки.Лево, 1, ОбластьКолонки.Лево);
		
		ОбластьКолонкиПриемник.ШиринаКолонки = ОбластьКолонки.ШиринаКолонки;
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьШирочайшуюОбластьФорматаСтрок(ТабличныйДокумент) Экспорт

	МассивОбластейФорматовСтрок = ПолучитьОбластиФорматовСтрок(ТабличныйДокумент);
	
	ШирочайшаяШирина = Неопределено;
	ШирочайшаяОбласть = Неопределено;
	
	Для Каждого ОбластьФорматаСтрок Из МассивОбластейФорматовСтрок Цикл
		
		ШиринаОбласти = ПолучитьШиринуОбласти(ОбластьФорматаСтрок, ТабличныйДокумент);
		
		Если ШирочайшаяШирина = Неопределено ИЛИ ШирочайшаяШирина < ШиринаОбласти Тогда
			ШирочайшаяШирина = ШиринаОбласти;
			ШирочайшаяОбласть = ОбластьФорматаСтрок;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ШирочайшаяОбласть;
	
КонецФункции

Функция ПолучитьШиринуОбласти(Область, ТабличныйДокумент) Экспорт
	
	МассивОбластейКолонок = ПолучитьОбластиКолонок(Область, ТабличныйДокумент);
	
	Ширина = 0;
	Для Каждого ОбластьКолонки Из МассивОбластейКолонок Цикл
		Ширина = Ширина + ОбластьКолонки.ШиринаКолонки;
	КонецЦикла;
	
	Возврат Ширина;
	
КонецФункции

Функция ПолучитьОбластиКолонок(Область, ТабличныйДокумент) Экспорт

	Если Область.Лево = 0 Тогда
		Лево = 1;
		Право = ТабличныйДокумент.ПолучитьОбласть(Область.Имя).ШиринаТаблицы;
	Иначе
		Лево = Область.Лево;
		Право = Область.Право;
	КонецЕсли;
	
	Если Область.Верх = 0 Тогда
		Верх = 1;
		Низ = ТабличныйДокумент.ВысотаТаблицы;
	Иначе
		Верх = Область.Верх;
		Низ = Область.Низ;
	КонецЕсли;
	
	МассивОбластейКолонок = Новый Массив;
	Для НомерКолонки=Лево По Право Цикл
		
		ОбластьКолонки = ТабличныйДокумент.Область(Верх, НомерКолонки, Низ, НомерКолонки);
		
		МассивОбластейКолонок.Добавить(ОбластьКолонки);
		
	КонецЦикла;
	
	Возврат МассивОбластейКолонок;
	
КонецФункции

Функция ПолучитьОбластиФорматовСтрок(ТабличныйДокумент) Экспорт

	МассивОбластей = Новый Массив;
	
	НачалоФорматаСтрок = 1;
	Пока Истина Цикл
		
		КонецФорматаСтрок = НайтиКонецФорматаСтрок(ТабличныйДокумент, НачалоФорматаСтрок);
		
		Если КонецФорматаСтрок = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ИмяОбласти = "R" + Формат(НачалоФорматаСтрок, "ЧГ=0") + ":R" + Формат(КонецФорматаСтрок, "ЧГ=0");
		ОбластьФорматаСтрок = ТабличныйДокумент.Область(ИмяОбласти);
		МассивОбластей.Добавить(ОбластьФорматаСтрок);
		
		НачалоФорматаСтрок = КонецФорматаСтрок + 1;
		
	КонецЦикла;
	
	Возврат МассивОбластей;

КонецФункции

Функция НайтиКонецФорматаСтрок(ТабличныйДокумент, Начало, знач Высота=Неопределено) Экспорт
	
	Если Высота = Неопределено Тогда
		Высота = ТабличныйДокумент.ВысотаТаблицы;
	КонецЕсли;
	
	Если Начало > Высота Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекущаяСтрока = Начало;
	Конец = ТекущаяСтрока;
	ОбластьНачальнойСтроки = ТабличныйДокумент.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1);
	ИсходнаяШирина = ОбластьНачальнойСтроки.ШиринаКолонки;
	
	Пока ТекущаяСтрока < Высота Цикл
		
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		ОбластьТекущейСтроки = ТабличныйДокумент.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1);
		
		Если ОбластьНачальнойСтроки.ШиринаКолонки <> ОбластьТекущейСтроки.ШиринаКолонки Тогда
			Прервать;
		КонецЕсли;
		
		ОбластьНачальнойСтроки.ШиринаКолонки = ОбластьНачальнойСтроки.ШиринаКолонки + 1;
		
		Если ОбластьНачальнойСтроки.ШиринаКолонки <> ОбластьТекущейСтроки.ШиринаКолонки Тогда
			ОбластьНачальнойСтроки.ШиринаКолонки = ИсходнаяШирина;
			Прервать;
		КонецЕсли;
		ОбластьНачальнойСтроки.ШиринаКолонки = ИсходнаяШирина;
		
		Конец = ТекущаяСтрока;
		
	КонецЦикла;
	
	Возврат Конец;
	
КонецФункции

// ТУ_Макеев 27.03.26 ++
Функция ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод) Экспорт
	МассивСсылокПоШтрихкодуТабличногоДокумента = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод);
	Возврат МассивСсылокПоШтрихкодуТабличногоДокумента;
КонецФункции
// ТУ_Макеев 27.03.26 --