Функция УстановитьЗаголовокФормы(Форма,Заголовок = "")  Экспорт
	
	Форма.АвтоЗаголовок = Ложь;
	Форма.Заголовок = Заголовок;
	
КонецФункции

Функция ПолучитьОписаниеЭлементовФормы(Форма) Экспорт
	
	ОписаниеСписок = Новый Соответствие;
	
	Для Каждого Элемент Из Форма.Элементы Цикл
		
		ОписаниеЭлемента = ОписаниеСписок[Элемент.Имя];
		Если ОписаниеЭлемента = Неопределено Тогда
			ОписаниеЭлемента = вмс_РаботаСФормамиКлиентСервер.ПолучитьПоляЭлементаФормы(Элемент);
			ОписаниеСписок[ОписаниеЭлемента.Имя] = ОписаниеЭлемента;
		КонецЕсли; 
		
		Если ОписаниеЭлемента.ТипЭлемента = Тип("ГруппаФормы") Тогда
			ПодчиненныеЭлементыОписание = Новый Массив;
			Для Каждого ПодчиненныйЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
				ОписаниеПодчиненногоЭлемента = ОписаниеСписок[ПодчиненныйЭлемент.Имя];
				Если ОписаниеПодчиненногоЭлемента = Неопределено Тогда
					ОписаниеПодчиненногоЭлемента = вмс_РаботаСФормамиКлиентСервер.ПолучитьПоляЭлементаФормы(ПодчиненныйЭлемент);
					ОписаниеСписок[ОписаниеПодчиненногоЭлемента.Имя] = ОписаниеПодчиненногоЭлемента;
				КонецЕсли;
				ПодчиненныеЭлементыОписание.Добавить(ОписаниеПодчиненногоЭлемента);
			КонецЦикла;
			ОписаниеЭлемента.Вставить("ПодчиненныеЭлементы", ПодчиненныеЭлементыОписание);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОписаниеСписок;
	
КонецФункции

Функция ЗаполнитьПодменюСканирование(Форма) Экспорт
	
	ИмяПодменюСканирование = "ПодменюСканирование";
	ПодменюСканирование = Форма.Элементы.Найти(ИмяПодменюСканирование);
	Если ПодменюСканирование = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ФормаШаблонов = ПолучитьФорму("Обработка.вмс_МодульИнтеграции.Форма.ФормаШаблонов");
	ОписаниеЭлементовФормы = ПолучитьОписаниеЭлементовФормы(ФормаШаблонов);
	
	ДанныеДляЗаполненияПодменюСканирование = Новый Структура;
	ДанныеДляЗаполненияПодменюСканирование.Вставить("ИмяПодменюСканирование", ИмяПодменюСканирование);
	ДанныеДляЗаполненияПодменюСканирование.Вставить("ОписаниеЭлементовФормы", ОписаниеЭлементовФормы);
	
	Возврат ДанныеДляЗаполненияПодменюСканирование;
	
КонецФункции

Функция ПриОткрытии(Форма, Отказ) Экспорт
	ДанныеПриОткрытииНаСервере = Новый Структура;
	ДанныеПриОткрытииНаСервере.Вставить("ДанныеДляЗаполненияПодменюСканирование", ЗаполнитьПодменюСканирование(Форма));
	Возврат ДанныеПриОткрытииНаСервере;
КонецФункции

Функция ПередЗакрытием(Форма, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Экспорт
	Если Не Отказ Тогда
		вмс_ОбработкаШтрихкодовКлиент.ОтключитьСистемуШтрихкодирования(Форма);
		вмс_ПараметрыПриложения["КлиентскиеПеременные"].Удалить(Форма);
	КонецЕсли;
КонецФункции

Функция ПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
	АвтоОбновлениеДокумента_ПослеЗаписи(Форма, ПараметрыЗаписи);
	
КонецФункции

Функция ПриЗакрытии(Форма, ЗавершениеРаботы) Экспорт

	вмс_ПараметрыПриложения["КлиентскиеПеременные"].Удалить(Форма);
	вмс_МодульПриложения.УдалитьОбработчикиОжиданияФормы(Форма);

КонецФункции
	
	Функция ОткрытьФормуВводаШтрихкодаЧерезСредстваМультимедиа(Результат, Контекст) Экспорт
		
		#Если МобильныйКлиент Тогда
			Если НЕ СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
				ВызватьИсключение НСтр("ru='Сканирование штрихкодов не поддерживается';en='Barcode scanning is not supported'");
				Возврат Неопределено;
			КонецЕсли;
			ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтотОбъект,Контекст);
			ОбработчикЗакрытия = Новый ОписаниеОповещения("ОбработкаЗакрытияИнтерфейса", ЭтотОбъект,Контекст);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(НСтр("ru='Наведите камеру на штрихкод';en='Aim the camera at an barcode'"), ОбработчикСканирования, ОбработчикЗакрытия, ТипШтрихКода.Все);
			Возврат Неопределено;	
		#конецесли
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сканирование через камеру поддерживается только на мобильных ус-вах.";
		Сообщение.Сообщить();
		
	КонецФункции

Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	
	пТовар = "";
	
	Если Результат Тогда
		#Если МобильныйКлиент  Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#конецесли
		ДополнительныеПараметры.Форма.ОповеститьОВыборе(Штрихкод);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗакрытияИнтерфейса(ДополнительныеПараметры) Экспорт
	
	//Если ЗначениеЗаполнено(пТовар) Тогда
	//	можем встроить код открытия формы ввода количества
	//КонецЕсли;	

КонецПроцедуры

Процедура ОткрытьФормуВводаШтрихкодаЧерезПолеВвода(Результат, Контекст) Экспорт
	ОткрытьФорму("Обработка.вмс_МодульИнтеграции.Форма.ФормаВводаШтрихкодаЧерезПолеВвода", , Контекст.Форма);
КонецПроцедуры

#Область Масштаб

Функция ИзменитьМасштабФормы(Форма,НовыйМасштаб) Экспорт
	
	ТипТаблица = Тип("ТаблицаФормы");
	ТипГруппа = Тип("ГруппаФормы");
	
	КоллекцияЭлементовФормы = Форма.Элементы;
	
	Для Каждого ТекущийЭлемент Из КоллекцияЭлементовФормы Цикл
		
		Если ТипЗнч(ТекущийЭлемент) = ТипТаблица Тогда
			// Элементы колонок таблицы наследуют масштаб таблицы + свой масштаб
			// Я вот так решил избежать двойного увеличения
		ИначеЕсли ТипЗнч(ТекущийЭлемент) = ТипГруппа Тогда
			Если ТекущийЭлемент.Вид = ВидГруппыФормы.КоманднаяПанель Тогда
				// Тут есть свои особенности у "Обычного приложения"
			Иначе
				ИзменитьШрифт(ТекущийЭлемент.ШрифтЗаголовка,НовыйМасштаб);
			КонецЕсли;
		Иначе
			Попытка
				ИзменитьШрифт(ТекущийЭлемент.Шрифт,НовыйМасштаб);
			Исключение
			КонецПопытки;    
			Попытка
				ИзменитьШрифт(ТекущийЭлемент.ШрифтЗаголовка,НовыйМасштаб);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Процедура ИзменитьШрифт(ИсходныйШрифт, Масштаб) Экспорт
	
	Если ИсходныйШрифт.Размер = -1 Тогда
		НовыйМасштаб = (Масштаб/ИсходныйШрифт.Масштаб)*100;
		Если НовыйМасштаб <> 100 Тогда
			// Чтобы избежать повторного увеличения при неоднократном вызове масштабирования
			ИсходныйШрифт = Новый Шрифт(ИсходныйШрифт,,,,,,,НовыйМасштаб);
		КонецЕсли;
	Иначе
		ИсходныйШрифт = Новый Шрифт(ИсходныйШрифт,,ИсходныйШрифт.Размер,,,,,Масштаб);
	КонецЕсли; 
	
КонецПроцедуры

Функция НастроитьМасштабированиеФормы(Форма) Экспорт
	
	пМасштаб = 100;
	
	ПараметрыАвторизации = вмс_РаботаСПользователямиКлиент.ПолучитьПараметрыАвторизации();
	НастройкиФорм = вмс_РаботаСПользователямиСервер.ПолучитьНастройкиПользователя(ПараметрыАвторизации);
	Если вмс_РаботаСКоллекциями.ЭтоКвазиТаблицаЗначений(НастройкиФорм) Тогда
		НайденныеСтроки = вмс_РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(НастройкиФорм, Новый Структура("Настройка", "Масштаб"));
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Строка = НайденныеСтроки[0];
			Попытка
				пМасштаб = Строка.Значение;
				Если пМасштаб < 60 Тогда
					пМасштаб = 60;
				КонецЕсли;
				ИзменитьМасштабФормы(Форма,пМасштаб);
			Исключение
				пМасштаб = 100;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Форма.пМасштаб = пМасштаб;
	Исключение
	КонецПопытки
	
	
КонецФункции
	
#КонецОбласти

Функция ПолучитьКлиентскиеПеременные(Форма) Экспорт
	Возврат ПолучитьКлиентскиеПеременныеОбъекта(Форма);
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////////////////
//
//						Клавиатурная панель через горячие клавиши+
//

Функция НоваяКлавиатурнаяПанель(Форма, знач ГруппаРазмещения=Неопределено) Экспорт
	
	Если НЕ вмс_РаботаСФормамиКлиентСервер.ПроверитьНаличиеСлужебногоСерверногоМетодаФормы(Форма) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяГруппыРазмещения = Неопределено;
	Если ТипЗнч(ГруппаРазмещения) = Тип("Строка") Тогда
		ГруппаРазмещения = Форма.Элементы.Найти(ГруппаРазмещения);
	КонецЕсли; 
	
	Если ТипЗнч(ГруппаРазмещения) = Тип("ГруппаФормы") Тогда
		ИмяГруппыРазмещения = ГруппаРазмещения.Имя;
	КонецЕсли;
	
	Слушатели = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений("Имя, ОповещениеВвода, ОповещениеОжидания");
	
	КлавиатурнаяПанель = Новый Структура;
	КлавиатурнаяПанель.Вставить("Кнопки", Новый Соответствие);
	КлавиатурнаяПанель.Вставить("СимволыКнопок", Новый Соответствие);
	КлавиатурнаяПанель.Вставить("ИмяГруппыРазмещения", ИмяГруппыРазмещения);
	КлавиатурнаяПанель.Вставить("ИмяПанели", Неопределено);
	КлавиатурнаяПанель.Вставить("Форма", Форма);
	КлавиатурнаяПанель.Вставить("Слушатели", Слушатели);
	КлавиатурнаяПанель.Вставить("Скрывать", Истина);
	КлавиатурнаяПанель.Вставить("СобственнаяГруппаРазмещения", Ложь);
	
	Возврат КлавиатурнаяПанель;
	
КонецФункции

Функция КлавиатурнаяПанель_ПолучитьСтруктуруДляПередачиНаСервер(КлавиатурнаяПанель) Экспорт
	
	КлавиатурнаяПанельСервер = вмс_РаботаСКоллекциями.СкопироватьСтруктуру(КлавиатурнаяПанель);
	
	ОчисткаПолей = Новый Структура("Форма, Слушатели");
	ЗаполнитьЗначенияСвойств(КлавиатурнаяПанельСервер, ОчисткаПолей);
	
	// Перед отправкой на сервер очистить символы так, как некоторые нельзя передавать на сервер
	Для Каждого ЭлементКнопки Из КлавиатурнаяПанельСервер.Кнопки Цикл
		ЭлементКнопки.Значение.СимволКнопки = "";
	КонецЦикла;
	
	Возврат КлавиатурнаяПанельСервер;
	
КонецФункции

Функция ДобавитьКнопкиИКомандыКлавиатурнойПанели(КлавиатурнаяПанель, НовыеКнопки) Экспорт
	
	Форма = КлавиатурнаяПанель.Форма;
	
	КлавиатурнаяПанельСервер = КлавиатурнаяПанель_ПолучитьСтруктуруДляПередачиНаСервер(КлавиатурнаяПанель);
	
	ПрограммныйКод =
	"КлавиатурнаяПанель = ДополнительныеПараметры[0];
	|МассивКнопок = ДополнительныеПараметры[1];
	|вмс_РаботаСФормамиСервер.КлавиатурнаяПанель_ДобавитьКнопкиИКоманды(Форма, КлавиатурнаяПанель, МассивКнопок);
	|Результат = КлавиатурнаяПанель;";
	
	ДополнительныеПараметры = Новый Массив;
	ДополнительныеПараметры.Добавить(КлавиатурнаяПанельСервер);
	ДополнительныеПараметры.Добавить(вмс_РаботаСКоллекциями.ЗакодироватьСтрокуВМассивКодов(НовыеКнопки));
	
	КлавиатурнаяПанельСервер = Форма.СлужебнаяФункцияВызовСервера(ПрограммныйКод, ДополнительныеПараметры);
	
	ЗаполнитьЗначенияСвойств(КлавиатурнаяПанель, КлавиатурнаяПанельСервер, "ИмяПанели, Кнопки");
	
	// Восстановление кнопок
	// также восстановим ссылки в списке СимволыКнопок так,
	// как после передачи на сервер ссылки начинают указывать на копии данных кнопок, а не на оригинальные данные
	КлавиатурнаяПанель.СимволыКнопок.Очистить();
	Для Каждого ЭлементКнопки Из КлавиатурнаяПанель.Кнопки Цикл
		ДанныеКнопки = ЭлементКнопки.Значение;
		ДанныеКнопки.СимволКнопки = Символ(ДанныеКнопки.КодСимволаКнопки);
		КлавиатурнаяПанель.СимволыКнопок[ДанныеКнопки.КодСимволаКнопки] = ДанныеКнопки;
	КонецЦикла; 
	
	вмс_ПодключаемыеКомандыКлиент.ВывестиКоманды(Форма);
	
	ТаблицаКоманд = вмс_ПодключаемыеКомандыКлиент.ПолучитьТаблицуОписанияКомандФормы(Форма);
	
	ОписаниеКоманды = Новый Структура;
	ОписаниеКоманды.Вставить("ИмяВФорме");
	ОписаниеКоманды.Вставить("Обработчик", "вмс_РаботаСФормамиКлиент.КлавиатурнаяПанель_ОбработатьКоманду");
	ОписаниеКоманды.Вставить("ДополнительныеПараметры", Новый Структура("КлавиатурнаяПанель", КлавиатурнаяПанель));
	
	Для Каждого ЭлементКнопки Из КлавиатурнаяПанель.Кнопки Цикл
		ДанныеКнопки = ЭлементКнопки.Значение;
		ИмяКоманды = ДанныеКнопки.ИмяКоманды;
		Если вмс_РаботаСКоллекциями.НайтиСтрокуКвазиТаблицыЗначений(ТаблицаКоманд, "ИмяВФорме", ИмяКоманды) = Неопределено Тогда
			ОписаниеКоманды.ИмяВФорме = ИмяКоманды;
			вмс_ПодключаемыеКомандыКлиентСервер.ДобавитьОписаниеКоманды(Форма, ОписаниеКоманды);
		КонецЕсли;
	КонецЦикла; 
	
КонецФункции

Функция ПолучитьСимволКлавиатурнойПанели(КлавиатурнаяПанель, Команда) Экспорт
	
	ДанныеКоманды = КлавиатурнаяПанель.Кнопки[Команда.Имя];
	Если ДанныеКоманды <> Неопределено Тогда
		Возврат ДанныеКоманды.СимволКнопки;
	КонецЕсли; 
	
КонецФункции

Функция КлавиатурнаяПанель_ДобавитьСлушателя(КлавиатурнаяПанель, Имя, ОповещениеВвода, ОповещениеОжидания=Неопределено) Экспорт
	
	Слушатель = вмс_РаботаСКоллекциями.НайтиСтрокуКвазиТаблицыЗначений(КлавиатурнаяПанель.Слушатели, "Имя", Имя);
	Если Слушатель = Неопределено Тогда
		Слушатель = вмс_РаботаСКоллекциями.ДобавитьСтрокуКвазиТаблицыЗначений(КлавиатурнаяПанель.Слушатели);
		Слушатель.Имя = Имя;
	КонецЕсли;
	
	Слушатель.ОповещениеВвода = ОповещениеВвода;
	Слушатель.ОповещениеОжидания = ОповещениеОжидания;
	
	Возврат Слушатель;
	
КонецФункции

Функция КлавиатурнаяПанель_УдалитьСлушателя(КлавиатурнаяПанель, Имя) Экспорт
	
	Слушатель = вмс_РаботаСКоллекциями.НайтиСтрокуКвазиТаблицыЗначений(КлавиатурнаяПанель.Слушатели, "Имя", Имя);
	Если Слушатель <> Неопределено Тогда
		вмс_РаботаСКоллекциями.УдалитьСтрокиКвазиТаблицыЗначений(КлавиатурнаяПанель.Слушатели, Слушатель);
	КонецЕсли;
	
КонецФункции

Функция КлавиатурнаяПанель_ОбработатьКоманду(ПараметрФормы, Контекст) Экспорт
	
	ИмяКоманды = Контекст.ОписаниеКоманды.ИмяВФорме;
	КлавиатурнаяПанель = Контекст.ОписаниеКоманды.ДополнительныеПараметры.КлавиатурнаяПанель;
	Если КлавиатурнаяПанель.Скрывать Тогда
		ПанельКлавиатуры = КлавиатурнаяПанель.Форма.Элементы.Найти(КлавиатурнаяПанель.ИмяПанели);
		ПанельКлавиатуры.ТекущаяСтраница = ПанельКлавиатуры.ПодчиненныеЭлементы[0]; //переключить на пустую страницу
		
		Если ТипЗнч(ПанельКлавиатуры.Родитель) = Тип("ГруппаФормы") И ПанельКлавиатуры.Родитель.Вид = ВидГруппыФормы.Страница Тогда
			СтраницаПанели = ПанельКлавиатуры.Родитель;
			ПанельРодитель = СтраницаПанели.Родитель;
			Если ПанельРодитель.ТекущаяСтраница = СтраницаПанели Тогда
				// перелистнуть страницу в родительской панели
				ИндексСтраницы = ПанельРодитель.ПодчиненныеЭлементы.Индекс(СтраницаПанели);
				Если ИндексСтраницы > 0 Тогда
					ПанельРодитель.ТекущаяСтраница = ПанельРодитель.ПодчиненныеЭлементы[ИндексСтраницы-1];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеКнопки = КлавиатурнаяПанель.Кнопки[ИмяКоманды];
	Если ДанныеКнопки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	БуфферВвода = ДанныеКнопки.СимволКнопки;
	
	КлавиатурнаяПанель_ОповеститьСлушателей(КлавиатурнаяПанель, БуфферВвода);
	
	Возврат Истина;
	
КонецФункции

Функция КлавиатурнаяПанель_ОповеститьСлушателей(КлавиатурнаяПанель, БуфферВвода) Экспорт
	
	Для Каждого Слушатель Из КлавиатурнаяПанель.Слушатели.Строки Цикл
		
		Если БуфферВвода <> Неопределено И БуфферВвода <> "" Тогда
			БуфферВводаМассив = вмс_РаботаСКоллекциями.СтрокуВМассивПосимвольно(БуфферВвода);
			БуфферВвода = "";
			Для Каждого СимволКнопки Из БуфферВводаМассив Цикл
				ВыполнитьОбработкуОповещения(Слушатель.ОповещениеВвода, СимволКнопки);
				БуфферВвода = БуфферВвода + СимволКнопки;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция КлавиатурнаяПанель_Поломать(КлавиатурнаяПанель) Экспорт
	
	Форма = КлавиатурнаяПанель.Форма;
	Если Форма = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаКоманд = вмс_ПодключаемыеКомандыКлиент.ПолучитьТаблицуОписанияКомандФормы(Форма);
	Если ТаблицаКоманд <> Неопределено Тогда
		Для Каждого ЭлементДанныеКнопки Из КлавиатурнаяПанель.Кнопки Цикл
			ДанныеКнопки = ЭлементДанныеКнопки.Значение;
			ИмяКоманды = ДанныеКнопки.ИмяКоманды;
			СтрокаКоманды = вмс_РаботаСКоллекциями.НайтиСтрокуКвазиТаблицыЗначений(ТаблицаКоманд, "ИмяВФорме", ИмяКоманды);
			Если СтрокаКоманды <> Неопределено Тогда
				вмс_РаботаСКоллекциями.УдалитьСтрокиКвазиТаблицыЗначений(ТаблицаКоманд, СтрокаКоманды);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПрограммныйКод =
	"КлавиатурнаяПанель = ДополнительныеПараметры;
	|вмс_РаботаСФормамиСервер.КлавиатурнаяПанель_Поломать(Форма, КлавиатурнаяПанель);";
	
	КлавиатурнаяПанельСервер = КлавиатурнаяПанель_ПолучитьСтруктуруДляПередачиНаСервер(КлавиатурнаяПанель);
	Форма.СлужебнаяФункцияВызовСервера(ПрограммныйКод, КлавиатурнаяПанельСервер);
	
	КлавиатурнаяПанель.Кнопки.Очистить();
	КлавиатурнаяПанель.СимволыКнопок.Очистить();
	
	Возврат Истина;
	
КонецФункции

//
//						Клавиатурная панель через горячие клавиши-
//
/////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ОткрытьФормуУлучшенная(ИмяФормы, Параметры=Неопределено, Владелец=Неопределено, Уникальность=Неопределено, Окно=Неопределено, НавигационнаяСсылка=Неопределено, ОписаниеОповещенияОЗакрытии=Неопределено, РежимОткрытияОкна=Неопределено) Экспорт
	
	Форма = ПолучитьФормуУлучшенная(ИмяФормы, Параметры, Владелец, Уникальность, Окно, НавигационнаяСсылка, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкна);	
	Форма.Открыть();
	Возврат Форма;
	
КонецФункции

Функция ПолучитьФормуУлучшенная(ИмяФормы, Параметры=Неопределено, Владелец=Неопределено, Уникальность=Неопределено, Окно=Неопределено, НавигационнаяСсылка=Неопределено, ОписаниеОповещенияОЗакрытии=Неопределено, РежимОткрытияОкна=Неопределено) Экспорт

	Форма = ПолучитьФорму(ИмяФормы, , Владелец, Уникальность, Окно);
	Форма.ОписаниеОповещенияОЗакрытии = ОписаниеОповещенияОЗакрытии;
	Форма.НавигационнаяСсылка = НавигационнаяСсылка;
	Если РежимОткрытияОкна <> Неопределено Тогда
		Форма.РежимОткрытияОкна = РежимОткрытияОкна;
	КонецЕсли;
	УстановитьПараметрыФормыНаКлиенте(Форма, Параметры);
	Возврат Форма;
	
КонецФункции

Функция УстановитьПараметрФормыНаКлиенте(Форма, ИмяПараметра, ЗначениеПараметра) Экспорт
	
	Возврат УстановитьПараметрыФормыНаКлиенте(Форма, Новый Структура(ИмяПараметра, ЗначениеПараметра));
	
КонецФункции

Функция УстановитьПараметрыФормыНаКлиенте(Форма, ПараметрыДляУстановки) Экспорт
	
	Если ТипЗнч(ПараметрыДляУстановки) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыФормы = ПолучитьПараметрыФормыНаКлиенте(Форма);
	
	Для Каждого ПараметрДляУстановки Из ПараметрыДляУстановки Цикл
		ПараметрыФормы.Вставить(ПараметрДляУстановки.Ключ, ПараметрДляУстановки.Значение);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьПараметрФормыНаКлиенте(Форма, ИмяПараметра) Экспорт
	
	Перем ЗначениеПараметра;
	
	ПолучитьПараметрыФормыНаКлиенте(Форма).Свойство(ИмяПараметра, ЗначениеПараметра);
	
	Возврат ЗначениеПараметра;
	
КонецФункции

Функция ПолучитьПараметрыФормыНаКлиенте(Форма) Экспорт
	
	ПеременныеФормы = ПолучитьКлиентскиеПеременные(Форма);
	ПараметрыФормы = ПеременныеФормы["ПараметрыФормы"];
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ПеременныеФормы["ПараметрыФормы"] = ПараметрыФормы;
	КонецЕсли;
	
	Возврат ПараметрыФормы;
	
КонецФункции

Функция ОткрытьФормуИзМакета(Макет, Параметры=Неопределено, ВладелецФормы=Неопределено, Уникальность=Неопределено, Окно=Неопределено, НавигационнаяСсылка=Неопределено, ОписаниеОповещенияОЗакрытии=Неопределено) Экспорт
	
	Форма = ПолучитьФормуИзМакета(Макет, Параметры, ВладелецФормы, Уникальность, Окно, НавигационнаяСсылка, ОписаниеОповещенияОЗакрытии);
	Форма.Открыть();
	
	Возврат Форма;
	
КонецФункции

Функция ПолучитьФормуИзМакета(Макет, Параметры=Неопределено, ВладелецФормы=Неопределено, Уникальность=Неопределено, Окно=Неопределено, НавигационнаяСсылка=Неопределено, ОписаниеОповещенияОЗакрытии=Неопределено) Экспорт
	
	ДанныеМакета = ПолучитьДанныеМакета(Макет);
	
	вмс_ВыполнениеПрограммногоКода.ПроцессорКода_ДобавитьПрограммныйМодуль(ДанныеМакета.МодульКлассаФормы);
	
	ИмяКласса = ДанныеМакета.ИмяКлассаФормы;
	КлассноеРасширение = вмс_КлассныеОбъекты.НовыйОбъект(ВРЕГ(ИмяКласса));
	
	Форма = ПолучитьФормуУлучшенная("ОбщаяФорма.вмс_ФормаШаблон", Параметры, ВладелецФормы, Уникальность, Окно, НавигационнаяСсылка, ОписаниеОповещенияОЗакрытии);
	Форма.Переменные.КлассноеРасширение = КлассноеРасширение;
	КлассноеРасширение.НативныйОбъект = Форма;
	Форма.ЗагрузитьИзОписанияФормы(ДанныеМакета.Данные);
	
	Возврат Форма;
	
КонецФункции

Функция ПолучитьДанныеМакета(Макет) Экспорт
	
	Если ТипЗнч(Макет)=Тип("Структура") Тогда
		
		ДанныеМакета = Макет;
		
	Иначе
		
		ДанныеМакета = вмс_РаботаСФормамиВызовСервера.ПолучитьДанныеМакета(Макет);
		
	КонецЕсли;
	
	Возврат ДанныеМакета;
	
КонецФункции

Функция ОткрытьДиалогВыбораКартинки(ОписаниеОповещенияОЗакрытии=Неопределено, ВладелецФормы=Неопределено, ТекущаяКартинка=Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущаяКартинка", ТекущаяКартинка);
	
	ДиалогВыбораКартинки = ОткрытьФормуУлучшенная("ОбщаяФорма.ФормаВыбораКартинки", ПараметрыФормы, ВладелецФормы, , , , ОписаниеОповещенияОЗакрытии);
	
	Возврат ДиалогВыбораКартинки;
	
КонецФункции

#Область АвтоОбновлениеДокумента

Функция АвтоОбновлениеДокумента_ПослеЗаписи(Форма, ПараметрыЗаписи)
	
	АвтоОбновлениеДокумента = АвтоОбновлениеДокумента(Форма);
	Если НЕ АвтоОбновлениеДокумента.Включено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	АвтоОбновлениеДокумента.Ссылка = Форма.Объект.Ссылка;
	АвтоОбновлениеДокумента.ВерсияДанных = вмс_ОбщегоНазначенияВызовСервера.ВерсияДанных(АвтообновлениеДокумента.Ссылка);
	
КонецФункции

Функция ВключитьАвтоОбновлениеДокумента(Форма, знач ОбработчикОбновленияДокумента=Неопределено) Экспорт
	
	АвтообновлениеДокумента = АвтообновлениеДокумента(Форма);
	АвтообновлениеДокумента.Включено = Истина;
	АвтообновлениеДокумента.Ссылка = Форма.Объект.Ссылка;
	АвтоОбновлениеДокумента.ВерсияДанных = вмс_ОбщегоНазначенияВызовСервера.ВерсияДанных(АвтообновлениеДокумента.Ссылка);
	
	Если ТипЗнч(ОбработчикОбновленияДокумента)=Тип("Строка") Тогда
		ОбработчикОбновленияДокумента = Новый ОписаниеОповещения(ОбработчикОбновленияДокумента, Форма);
	КонецЕсли;
	АвтоОбновлениеДокумента.ОбработчикОбновленияДокумента = ОбработчикОбновленияДокумента;
	
	ОО = Новый ОписаниеОповещения("ОбработчикОжиданияОбновлениеДокумента", вмс_РаботаСФормамиКлиент);
	вмс_МодульПриложения.ДобавитьОбработчикОжидания(ОО, 1, Ложь, Форма, "АвтоОбновлениеДокумента");
	
КонецФункции

Функция ОбработчикОжиданияОбновлениеДокумента(ОбработчикОжидания, ДополнительныеПараметры) Экспорт
	
	Форма = ОбработчикОжидания.Форма;
	АвтообновлениеДокумента = АвтообновлениеДокумента(Форма);
	
	Если АвтообновлениеДокумента.ЗавершениеРаботы Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если АвтообновлениеДокумента.ДокументУдален Тогда
		// выдать сообщение когда пользователь посмотрит на окно и завершить работу
		Если Форма.ВводДоступен() Тогда
			СообщитьОбУдаленииДокумента(Форма);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Если АвтоОбновлениеДокумента.ВерсияДанных <> "" Тогда
		ТекущаяВерсияДанных = вмс_ОбщегоНазначенияВызовСервера.ВерсияДанных(АвтообновлениеДокумента.Ссылка);
		
		Если ТекущаяВерсияДанных <> АвтообновлениеДокумента.ВерсияДанных Тогда
			АвтообновлениеДокумента.ВерсияДанных = ТекущаяВерсияДанных;
			Если АвтообновлениеДокумента.ВерсияДанных="" Тогда
				АвтообновлениеДокумента.ДокументУдален = Истина;
				Если Форма.ВводДоступен() Тогда
					СообщитьОбУдаленииДокумента(Форма);
				КонецЕсли;
				Форма.ТолькоПросмотр = Истина;
			Иначе
				Форма.Прочитать();
			КонецЕсли;
		ИначеЕсли АвтообновлениеДокумента.ОбработчикОбновленияДокумента <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(АвтообновлениеДокумента.ОбработчикОбновленияДокумента, ОбработчикОжидания);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция СообщитьОбУдаленииДокумента(Форма)
	АвтообновлениеДокумента = АвтообновлениеДокумента(Форма);
	АвтообновлениеДокумента.ЗавершениеРаботы = Истина;
	ПоказатьПредупреждение(Новый ОписаниеОповещения("ОбработчикЗакрытьФорму", вмс_РаботаСФормамиКлиент, Форма), "Документ был удален");
КонецФункции

Функция ОбработчикЗакрытьФорму(Форма) Экспорт
	АвтообновлениеДокумента = АвтообновлениеДокумента(Форма);
	ОповеститьОбИзменении(АвтообновлениеДокумента.Ссылка);
	Форма.Закрыть();
КонецФункции

Функция АвтообновлениеДокументаВключено(Форма)
	
	Возврат АвтообновлениеДокумента(Форма).Включено;
	
КонецФункции
	
Функция АвтообновлениеДокумента(Форма)

	Переменные = ПолучитьКлиентскиеПеременные(Форма);
	
	АвтообновлениеДокумента = Переменные["АвтообновлениеДокумента"];
	Если АвтообновлениеДокумента=Неопределено Тогда
		АвтообновлениеДокумента = Новый Структура;
		АвтообновлениеДокумента.Вставить("Включено", Ложь);
		АвтообновлениеДокумента.Вставить("Ссылка", Неопределено);
		АвтообновлениеДокумента.Вставить("ВерсияДанных", "");
		АвтообновлениеДокумента.Вставить("ДокументУдален", Ложь);
		АвтообновлениеДокумента.Вставить("ЗавершениеРаботы", Ложь);
		АвтообновлениеДокумента.Вставить("ОбработчикОбновленияДокумента");
		Переменные["АвтообновлениеДокумента"] = АвтообновлениеДокумента;
	КонецЕсли;
	
	Возврат АвтообновлениеДокумента;
	
КонецФункции

#КонецОбласти