#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		
		ОбменДанными.Получатели.Очистить(); //не регистрировать новые партии
		
		ИндексРазделителя = СтрДлина(Наименование) - 4;
		
		ДанныеШтрихкода1 = Лев(Наименование,ИндексРазделителя);
		ДанныеШтрихкода2 = Сред(Наименование,ИндексРазделителя + 1);
		
		Если НЕ ЗначениеЗаполнено(ДатаПартии) Тогда
			ДатаПартии = ТекущаяДата();
		КонецЕсли; 
		
		Попытка
			// ТУ_Августинович ++  02.02.2026
			// - Сделано для того чтобы корректно записывалось распоряжение.
			//	 Без этого оно просто затирается (Неопределено).
			
			//Распоряжение = Распоряжение.Контрагент;
			Распоряжение = Распоряжение;
			
			// ТУ_Августинович -- 02.02.2026
		Исключение
		КонецПопытки;
		
		Если Не ЗначениеЗаполнено(Наименование) Тогда
			Наименование = Справочники.вмс_Контейнеры.ПолучитьНовыйНомерТары(ТипТары);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Штрихкод) Тогда
			Штрихкод = Справочники.вмс_Контейнеры.ПолучитьНовыйНомерТары(ТипТары); 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	РегистрыСведений.вмс_ИерархияКонтейнеров.ЗаписатьИерархиюКонтейнера(Ссылка);
КонецПроцедуры

#Иначе

#КонецЕсли