Функция ПриКомпоновкеРезультата(ТабличныйДокумент, КомпоновщикНастроек) Экспорт
	УстановитьСтандартныйМакетОформления(КомпоновщикНастроек);		
КонецФункции

Функция УстановитьСтандартныйМакетОформления(КомпоновщикНастроек)
	
	МакетОформления = "ОформлениеОтчетовБежевый";  	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления")); 
	
	Если ЗначениеПараметра <> Неопределено Тогда
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение      = МакетОформления;
	КонецЕсли;
	
КонецФункции
