//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

Функция ПолучитьДвоичныеДанныеРечи(ТекстРечи) Экспорт
	
	ИмяФайла = ПолучитьИмяВременногоФайла("wav");
	Если ЗаписатьРечьВФайл(ТекстРечи, ИмяФайла) Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
	Иначе
		ДвоичныеДанные = Неопределено;
	КонецЕсли;
	УдалитьФайлы(ИмяФайла);
	
	Возврат ДвоичныеДанные;
	
КонецФункции

Функция ЗаписатьРечьВФайл(ТекстРечи, ИмяФайла) Экспорт
	
	// Значения перечисления SpeechStreamFileMode
	SSFMOpenForRead = 0;
	SSFMOpenReadWrite = 1;
	SSFMCreate = 2;
	SSFMCreateForWrite = 3;
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("SAPI.SpVoice");

	Результат = Ложь;
	Попытка
		spVoice = Новый("COMОбъект", ПараметрыКонструктора);
	Исключение
		Возврат Результат;
	КонецПопытки;
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("SAPI.SpFileStream");
	spfStream = Новый("COMОбъект", ПараметрыКонструктора);
	
	spfStream.open(ИмяФайла, SSFMCreateForWrite, Ложь);
	spVoice.AudioOutputStream = spfStream;
	Попытка
		spVoice.Speak(ТекстРечи);
		Результат = Истина;
	Исключение
	КонецПопытки;
	
	spfStream.close();	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗвук(знач ПодсистемаЗвука=Неопределено, знач Звук) Экспорт
	
	Если ПодсистемаЗвука=Неопределено Тогда
		ПодсистемаЗвука = НоваяПодсистемаЗвука();
	КонецЕсли;
	
	Если ТипЗнч(Звук)=Тип("ДвоичныеДанные") Тогда
		Звук = Новый Структура("Данные", Звук);
	КонецЕсли;
	
	Если ТипЗнч(Звук)=Тип("Структура") Тогда
		Если Звук.Свойство("Данные") Тогда
			Если НЕ Звук.Свойство("ИмяЗвука") Тогда
				// Без имени звука нельзя закэшировать
				// вернем данные звука без кэширования
				Возврат ПодготовитьДанныеЗвука(ПодсистемаЗвука, Звук);
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Звуки = ЗакэшироватьЗвуки(ПодсистемаЗвука, Звук);
	Если Звуки.Количество()=0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Звук = Звуки[0];
	Если Звук.ЭтоГруппа Тогда
		Звук = ВыбратьЗвук(ПодсистемаЗвука, Звук);
	КонецЕсли;
	
	Возврат Звук;
	
КонецФункции

Функция ВыбратьЗвук(ПодсистемаЗвука, ГруппаЗвуков) Экспорт
	
	РК = ПодсистемаЗвука.ОбщиеМодули.РаботаСКоллекциями;
	КэшЗвуков = ПодсистемаЗвука.КэшЗвуков;
	
	Звук = ГруппаЗвуков;
	ПоискПоРодителю = Новый Структура("ИмяРодителя");
	ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел;
	Пока Звук.ЭтоГруппа Цикл
		ПоискПоРодителю.ИмяРодителя = Звук.ИмяЗвука;
		Звуки = РК.НайтиЭлементыКоллекции(КэшЗвуков, ПоискПоРодителю);
		Если Звуки.Количество()=0 Тогда
			Возврат Неопределено;
		КонецЕсли;

		Если Звуки.Количество()=1 Тогда
			Звук = Звуки[0];
			Продолжить;
		КонецЕсли;
		
		ОбщаяЧастота = 0;
		Для Каждого Звук Из Звуки Цикл
			ОбщаяЧастота = ОбщаяЧастота + Звук.ЧастотаИспользования;
		КонецЦикла;
		
		СелекторЧастоты = ГенераторСлучайныхЧисел.СлучайноеЧисло(1, ОбщаяЧастота);
		
		Частота = 0;
		Для Каждого Звук Из Звуки Цикл
			Частота = Частота + Звук.ЧастотаИспользования;
			Если СелекторЧастоты <= Частота Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Звук;
	
КонецФункции

Функция ЗакэшироватьЗвуки(ПодсистемаЗвука, Звуки) Экспорт
	
	КэшЗвуков = ЗарегистрироватьЗвуки(ПодсистемаЗвука, Звуки);
	
	РезультатАнализаДанныхЗвуков = ПроанализироватьДанныеЗвуков(ПодсистемаЗвука, КэшЗвуков);
	
	Если РезультатАнализаДанныхЗвуков.Загрузить.Количество() > 0 Тогда
		ОбновитьДанныеЗвуковУдаленно(ПодсистемаЗвука, РезультатАнализаДанныхЗвуков);
	КонецЕсли;
	
	Если РезультатАнализаДанныхЗвуков.Обновить.Количество() > 0 Тогда
		ОбновитьДанныеЗвуковЛокально(ПодсистемаЗвука, РезультатАнализаДанныхЗвуков.Обновить);
	КонецЕсли;
	
	Возврат КэшЗвуков;
	
КонецФункции

Функция ЗарегистрироватьЗвуки(ПодсистемаЗвука, Звуки)

	Перем ИмяЗвука, Данные;
	
	РК = ПодсистемаЗвука.ОбщиеМодули.РаботаСКоллекциями;
	Звуки = РК.ЗначениеВМассив(Звуки, , Ложь);
	
	КэшЗвуков = ПодсистемаЗвука.КэшЗвуков;
	
	ЗарегистрированныеЗвуки = Новый Массив;
	
	ПоискЗвука = Новый Структура("ИмяЗвука");
	Для Каждого Звук Из Звуки Цикл
		Если ТипЗнч(Звук)=Тип("Строка") Тогда
			ИмяЗвука = Звук;
			Данные = Неопределено;
			УстановитьДанные = Ложь;
		ИначеЕсли ТипЗнч(Звук)=Тип("Структура") Тогда
			Если НЕ Звук.Свойство("ИмяЗвука", ИмяЗвука) Тогда
				Продолжить;
			КонецЕсли;

			УстановитьДанные = Звук.Свойство("Данные", Данные);
		Иначе
			Продолжить;
		КонецЕсли;
		
		ПоискЗвука.ИмяЗвука = ИмяЗвука;
		КэшЗвука = РК.НайтиЭлементКоллекции(КэшЗвуков, ПоискЗвука);
		Если КэшЗвука=Неопределено Тогда
			ПозицияСлэша = СтрНайти(ИмяЗвука, "\", НаправлениеПоиска.СКонца);
			Если ПозицияСлэша > 0 Тогда
				ИмяРодителя = Лев(ИмяЗвука, ПозицияСлэша-1);
			Иначе
				ИмяРодителя = "";
			КонецЕсли;
			ДанныеЗвука = Новый Структура("ИмяЗвука, ИмяРодителя", ИмяЗвука, ИмяРодителя);
			КэшЗвука = РК.ДобавитьЭлементКоллекции(КэшЗвуков, ДанныеЗвука);
			КэшЗвука.ЧастотаИспользования = 1;
			КэшЗвука.Загружать = Истина;
			КэшЗвука.ЭтоГруппа = Ложь;
		КонецЕсли;
		
		Если УстановитьДанные Тогда
			// Данные устанавливаются напрямую
			// не загружать из справочника
			КэшЗвука.Данные = Данные;
			КэшЗвука.Загружать = Ложь;
			ПодготовитьДанныеЗвука(ПодсистемаЗвука, КэшЗвука, КэшЗвука);
		КонецЕсли;
		
		ЗарегистрированныеЗвуки.Добавить(КэшЗвука);
	КонецЦикла;
	
	Возврат ЗарегистрированныеЗвуки;
	
КонецФункции

Функция ПроанализироватьДанныеЗвуков(ПодсистемаЗвука, знач КэшЗвуков)

	РК = ПодсистемаЗвука.ОбщиеМодули.РаботаСКоллекциями;
	
	ИменаЗвуков = Новый Массив;
	Для Каждого КэшЗвука Из КэшЗвуков Цикл
		Если КэшЗвука.Загружать Тогда
			ИменаЗвуков.Добавить(КэшЗвука.ИмяЗвука);
		КонецЕсли;
	КонецЦикла;
	
	КэшЗвуковЗагрузить = Новый Массив;
	КэшЗвуковОбновить = Новый Массив;
	
	Если ИменаЗвуков.Количество() > 0 Тогда
		ТаблицаЭлементовЗвуков = вмс_РаботаСоЗвукомВызовСервера.НайтиЭлементыЗвуков(ИменаЗвуков);
		
		ДополнительныеЗвуки = Новый Массив;
		Для Каждого Звук Из РК.ПолучитьЭлементыКоллекции(ТаблицаЭлементовЗвуков) Цикл
			Если Звук.Дополнительный Тогда
				ДополнительныеЗвуки.Добавить(Звук.ИмяЗвука);
			КонецЕсли;
		КонецЦикла;
		
		Если ДополнительныеЗвуки.Количество() > 0 Тогда
			КэшДополнительныхЗвуков = ЗарегистрироватьЗвуки(ПодсистемаЗвука, ДополнительныеЗвуки);
			КэшЗвуков = РК.СложениеМассивов(КэшЗвуков, КэшДополнительныхЗвуков);
		КонецЕсли;
		
		ПоискПоИмени = Новый Структура("ИмяЗвука");
		Для Каждого КэшЗвука Из КэшЗвуков Цикл
			
			ПоискПоИмени.ИмяЗвука = КэшЗвука.ИмяЗвука;
			Звук = РК.НайтиЭлементКоллекции(ТаблицаЭлементовЗвуков, ПоискПоИмени);
			
			Если Звук <> Неопределено Тогда
				
				Если КэшЗвука.Ссылка <> Звук.Ссылка ИЛИ КэшЗвука.ВерсияДанных <> Звук.ВерсияДанных Тогда
					КэшЗвука.НоваяСсылка = Звук.Ссылка;
					КэшЗвука.НоваяВерсияДанных = Звук.ВерсияДанных;
					КэшЗвука.ЭтоГруппа = Звук.ЭтоГруппа;
					КэшЗвуковОбновить.Добавить(КэшЗвука);
				КонецЕсли;
				
			ИначеЕсли КэшЗвука.Ссылка=Неопределено ИЛИ ЗначениеЗаполнено(КэшЗвука.Ссылка) Тогда
				
				КэшЗвуковЗагрузить.Добавить(КэшЗвука);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	РезультатАнализа = Новый Структура("Загрузить, Обновить", КэшЗвуковЗагрузить, КэшЗвуковОбновить);
	
	Возврат РезультатАнализа;
	
КонецФункции

Функция ОбновитьДанныеЗвуковУдаленно(ПодсистемаЗвука, РезультатАнализаДанныхЗвуков)
	
	КэшЗвуковЗагрузить = РезультатАнализаДанныхЗвуков.Загрузить;
	ИменаЗвуков = Новый Массив;
	Для Каждого КэшЗвука Из КэшЗвуковЗагрузить Цикл
		ИменаЗвуков.Добавить(КэшЗвука.ИмяЗвука);
	КонецЦикла;
	
	ЗагрузитьДанныеЗвуковИзУчетнойБазы(ПодсистемаЗвука, ИменаЗвуков);
	
	РезультатАнализаДанныхЗагруженныхЗвуков = ПроанализироватьДанныеЗвуков(ПодсистемаЗвука, КэшЗвуковЗагрузить);
	
	Для Каждого КэшЗвука Из РезультатАнализаДанныхЗагруженныхЗвуков.Обновить Цикл
		РезультатАнализаДанныхЗвуков.Обновить.Добавить(КэшЗвука);
		#Если Клиент Тогда
			ОповеститьОбИзменении(КэшЗвука.НоваяСсылка);
		#КонецЕсли
	КонецЦикла;
	
	Для Каждого КэшЗвука Из РезультатАнализаДанныхЗагруженныхЗвуков.Загрузить Цикл
		// звук не был найден при первой попытке, больше не пытаемся его загрузить
		КэшЗвука.Ссылка = ПодсистемаЗвука.ПустаяСсылкаЗвука;
		КэшЗвука.ВерсияДанных = Неопределено;
		ПодготовитьДанныеЗвука(ПодсистемаЗвука, Неопределено, КэшЗвука);
	КонецЦикла;
	
КонецФункции

Функция ЗагрузитьДанныеЗвуковИзУчетнойБазы(ПодсистемаЗвука, ИменаЗвуков)
	
	Перем ОбращенияКИСКлиентСервер;
	
	Если ПодсистемаЗвука.ОбщиеМодули.ОбщегоНазначенияВызовСервера.ЭтоБэкенд() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбращенияКИСКлиентСервер = ПодсистемаЗвука.ОбщиеМодули.ОбращенияКИСКлиентСервер;
	
	ОМ = ОбращенияКИСКлиентСервер.ПолучитьОписаниеМетода("вмс_РаботаСоЗвукомВызовСервера.ПолучитьВыгрузкуXMLЗвуков", Истина, ИменаЗвуков);
	ОМ.ПостОбработка = "ОбращенияКИСВызовСервера.ПостОбработкаМетодаОсновнойБД_ЗагрузитьОбъектыИзОсновнойБазыПоЗапросу";
	Результат = ОбращенияКИСКлиентСервер.ВыполнитьМетодОсновнойБД(ОМ);
	
	Возврат Истина;
	
КонецФункции

Функция ОбновитьДанныеЗвуковЛокально(ПодсистемаЗвука, КэшЗвуков)
	
	РК = ПодсистемаЗвука.ОбщиеМодули.РаботаСКоллекциями;

	СсылкиЗвуков = Новый Массив;
	
	Для Каждого КэшЗвука Из КэшЗвуков Цикл
		СсылкиЗвуков.Добавить(КэшЗвука.НоваяСсылка);
	КонецЦикла;

	ДанныеЗвуков = вмс_РаботаСоЗвукомВызовСервера.ПолучитьДанныеЗвуков(СсылкиЗвуков);
	
	ПоискПоСсылке = Новый Структура("Ссылка");
	Для Каждого КэшЗвука Из КэшЗвуков Цикл
		ПоискПоСсылке.Ссылка = КэшЗвука.НоваяСсылка;
		ДанныеЗвука = РК.НайтиЭлементКоллекции(ДанныеЗвуков, ПоискПоСсылке);
		
		Если ДанныеЗвука <> Неопределено Тогда
			КэшЗвука.ЧастотаИспользования = ДанныеЗвука.ЧастотаИспользования;
		КонецЕсли;
		
		ПодготовитьДанныеЗвука(ПодсистемаЗвука, ДанныеЗвука, КэшЗвука);

		КэшЗвука.Ссылка = КэшЗвука.НоваяСсылка;
		КэшЗвука.ВерсияДанных = КэшЗвука.НоваяВерсияДанных;
	КонецЦикла;
	
КонецФункции

Функция ПодготовитьДанныеЗвука(ПодсистемаЗвука, ДанныеЗвука, КэшЗвука=Неопределено)

	Если КэшЗвука=Неопределено Тогда
		КэшЗвука = Новый Структура;
		КэшЗвука.Вставить("Данные");
		Если ПодсистемаЗвука.АндроидОС Тогда
			КэшЗвука.Вставить("ДанныеМультимедиа");
		Иначе
			КэшЗвука.Вставить("spmStream");
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗвука)=Тип("Структура") И ДанныеЗвука.Свойство("Данные") И ДанныеЗвука.Данные <> Неопределено Тогда
		КэшЗвука.Данные = ДанныеЗвука.Данные;
		Если ПодсистемаЗвука.АндроидОС Тогда
			КэшЗвука.ДанныеМультимедиа = Новый ДанныеМультимедиа(ДанныеЗвука.Данные, "", "");
		Иначе
			Если ПодсистемаЗвука.spVoice <> Неопределено Тогда
				КэшЗвука.spmStream = SAPIПотокВПамятиИзДвоичныхДанных(ДанныеЗвука.Данные);
			КонецЕсли;
		КонецЕсли;
	Иначе
		КэшЗвука.Данные = Неопределено;
		Если ПодсистемаЗвука.АндроидОС Тогда
			КэшЗвука.ДанныеМультимедиа = Неопределено;
		Иначе
			КэшЗвука.spmStream = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КэшЗвука;
			
КонецФункции

Функция SAPIПотокВПамятиИзДвоичныхДанных(ДвоичныеДанные)

	ИмяФайла = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные.Записать(ИмяФайла);
	КоличествоБайт = ДвоичныеДанные.Размер();
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("VT_UI1");
	ПараметрыКонструктора.Добавить(КоличествоБайт);
	ДанныеCOM = Новый("COMSafeArray", ПараметрыКонструктора);
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("SAPI.SpFileStream");
	spfStream = Новый("COMОбъект", ПараметрыКонструктора);
	spfStream.Open(ИмяФайла);
	БайтПрочитано = spfStream.Read(ДанныеCOM, КоличествоБайт);
	spfStream.Close();
	
	УдалитьФайлы(ИмяФайла);
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("SAPI.SpMemoryStream");
	spmStream = Новый("COMОбъект", ПараметрыКонструктора);
	Попытка
		spmStream.Format.Type = spfStream.Format.Type;
	Исключение
	КонецПопытки;
	spmStream.SetData(ДанныеCOM);

	Возврат spmStream;
		
КонецФункции

Функция НоваяПодсистемаЗвука() Экспорт
	
	КолонкиКэшаЗвуков = "ИмяЗвука, Данные, Загружать, Ссылка, ВерсияДанных, ИмяРодителя, ЧастотаИспользования, ЭтоГруппа, НоваяСсылка, НоваяВерсияДанных";
	
	ОбщиеМодули = Новый Структура("РаботаСКоллекциями, ОбщегоНазначенияКлиентСервер, ОбщегоНазначенияВызовСервера, ОбращенияКИСКлиентСервер");
	Для Каждого ОбщийМодуль Из ОбщиеМодули Цикл
		ОбщиеМодули[ОбщийМодуль.Ключ] = глОбщийМодуль(ОбщийМодуль.Ключ);
	КонецЦикла;
	
	РК = ОбщиеМодули.РаботаСКоллекциями;
	
	ПодсистемаЗвука = Новый Структура;
	ПодсистемаЗвука.Вставить("ОбщиеМодули", ОбщиеМодули);
	ПодсистемаЗвука.Вставить("АндроидОС", Ложь);
	ПодсистемаЗвука.Вставить("ПустаяСсылкаЗвука", ПредопределенноеЗначение("Справочник.вмс_Звуки.ПустаяСсылка"));
	ПодсистемаЗвука.Вставить("ЗвукВоспроизводится", Ложь);
	ПодсистемаЗвука.Вставить("ОчередьВоспроизведения", Новый Массив);
	#Если МобильноеПриложениеКлиент Тогда
		ПодсистемаЗвука.АндроидОС = Истина;
		КолонкиКэшаЗвуков = КолонкиКэшаЗвуков + ", ДанныеМультимедиа";
	#Иначе
		КолонкиКэшаЗвуков = КолонкиКэшаЗвуков + ", spmStream";
	#КонецЕсли
	
	КэшЗвуков = РК.НоваяКоллекцияЗначений(КолонкиКэшаЗвуков);
	РК.ДобавитьИндексКоллекции(КэшЗвуков, "ИмяЗвука");
	РК.ДобавитьИндексКоллекции(КэшЗвуков, "ИмяРодителя");
	ПодсистемаЗвука.Вставить("КэшЗвуков", КэшЗвуков);
	
	Если НЕ ПодсистемаЗвука.АндроидОС Тогда
		ИнициализироватьДрайверЗвука(ПодсистемаЗвука);
	КонецЕсли;
	
	Возврат ПодсистемаЗвука;
	
КонецФункции
	
Функция ИнициализироватьДрайверЗвука(ПодсистемаЗвука)
	
	spVoice = Неопределено;
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("SAPI.SpVoice");
	Попытка
		spVoice = Новый("COMОбъект", ПараметрыКонструктора);
	Исключение
	КонецПопытки;
		
	ПодсистемаЗвука.Вставить("spVoice", spVoice);
	
КонецФункции
