Функция НайтиЭлементыЗвуков(знач Звуки) Экспорт
	
	Возврат ПодготовитьРезультатДляОтправкиНаКлиент(вмс_РаботаСоЗвукомСервер.НайтиЭлементыЗвуков(Звуки));
	
КонецФункции
	
Функция ПолучитьВерсииДанныхЗвуков(знач СсылкиЗвуков) Экспорт
	
	Возврат ПодготовитьРезультатДляОтправкиНаКлиент(вмс_РаботаСоЗвукомСервер.ПолучитьВерсииДанныхЗвуков(СсылкиЗвуков));
	
КонецФункции

Функция ПолучитьДанныеЗвуков(знач СсылкиЗвуков) Экспорт
	
	Возврат ПодготовитьРезультатДляОтправкиНаКлиент(вмс_РаботаСоЗвукомСервер.ПолучитьДанныеЗвуков(СсылкиЗвуков));
	
КонецФункции

Функция ПолучитьВыгрузкуXMLЗвуков(знач Звуки) Экспорт

	ТаблицаЗвуков = вмс_РаботаСоЗвукомСервер.НайтиЭлементыЗвуков(Звуки);
	СсылкиЗвуков = ТаблицаЗвуков.ВыгрузитьКолонку("Ссылка");
	ВыгрузкаXML = Вычислить("вмс_Обмен_с_КИС_Сервер").ВыгрузитьОбъектыПоСсылкамВXML(СсылкиЗвуков);
	
	Возврат ВыгрузкаXML;
	
КонецФункции

Функция ПодготовитьРезультатДляОтправкиНаКлиент(ТаблицаРезультата)

	КвазиТаблицаРезультата = вмс_РаботаСКоллекциями.ВыгрузитьКоллекциюВМассивСтруктур(ТаблицаРезультата);
	
	Возврат КвазиТаблицаРезультата;

КонецФункции
