Функция ПолучитьТаблицуОписанияКомандФормы(Форма) Экспорт
	
	КлиентскиеПеременныеФормы = ПолучитьКлиентскиеПеременныеОбъекта(Форма);
	ПараметрыКлиента = КлиентскиеПеременныеФормы["ПараметрыПодключаемыхКоманд"];
	Если ТипЗнч(ПараметрыКлиента) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаКоманд = Неопределено;
	ПараметрыКлиента.Свойство("ТаблицаКоманд", ТаблицаКоманд);
	Если Не вмс_РаботаСКоллекциями.ЭтоКвазиТаблицаЗначений(ТаблицаКоманд) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТаблицаКоманд;
	
КонецФункции

// Обработчик команды формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, из которой выполняется команда.
//   Команда - КомандаФормы - выполняемая команда.
//   Источник - ТаблицаФормы, ДанныеФормыСтруктура, ЛюбаяСсылка, Массив - объект или список формы с полем "Ссылка",
//                                                                   Ссылка или массив ссылок.
//
Процедура ВыполнитьКоманду(Форма, Команда, Источник) Экспорт
	ИмяКоманды = Команда.Имя;
	ТаблицаКоманд = ПолучитьКлиентскиеПеременныеОбъекта(Форма)["ПараметрыПодключаемыхКоманд"].ТаблицаКоманд;
	ОписаниеКоманды = вмс_ПодключаемыеКомандыКлиентСервер.ОписаниеКоманды(ИмяКоманды, ТаблицаКоманд);
	
	Контекст = вмс_ПодключаемыеКомандыКлиентСервер.ШаблонПараметровВыполненияКоманды();
	//Контекст.ОписаниеКоманды = Новый Структура(ОписаниеКоманды);
	Контекст.ОписаниеКоманды = ОписаниеКоманды;
	Контекст.Форма           = Форма;
	Контекст.Источник        = Источник;
	Контекст.ЭтоФормаОбъекта = ТипЗнч(Источник) = Тип("ДанныеФормыСтруктура");
	
	Контекст.Вставить("ТребуетсяЗапись", Контекст.ЭтоФормаОбъекта И ОписаниеКоманды.РежимЗаписи <> "НеЗаписывать");
	Контекст.Вставить("ТребуетсяПроведение", ОписаниеКоманды.РежимЗаписи = "Проводить");
	Контекст.Вставить("ТребуетсяРаботаСФайлами", ОписаниеКоманды.ТребуетсяРаботаСФайлами);
	
	ПродолжитьВыполнениеКоманды(Контекст);
КонецПроцедуры

// Возвращает ссылку на общий модуль или модуль менеджера по имени.
//
// См. ОбщегоНазначения.ОбщийМодуль
//
// Параметры:
//  Имя - Строка - имя общего модуля.
//
// Возвращаемое значение:
//  ОбщийМодуль, МодульМенеджераОбъекта - общий модуль.
//
// Пример:
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОбновлениеКонфигурации") Тогда
//		МодульОбновлениеКонфигурации = ОбщегоНазначения.ОбщийМодуль("ОбновлениеКонфигурации");
//		МодульОбновлениеКонфигурации.<Имя метода>();
//	КонецЕсли;
//
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолнотекстовыйПоиск") Тогда
//		МодульПолнотекстовыйПоискСервер = ОбщегоНазначения.ОбщийМодуль("ПолнотекстовыйПоискСервер");
//		МодульПолнотекстовыйПоискСервер.<Имя метода>();
//	КонецЕсли;
//
Функция ОбщийМодуль(Имя) Экспорт
	
	Модуль = Вычислить(Имя);
	
#Если Не ВебКлиент Тогда
	
	// В веб-клиенте не проверяется
	// т.к. при обращении к модулям с вызовом сервера типа такого модуля в веб-клиенте не существует.
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Общий модуль ""%1"" не найден.'"), 
			Имя);
	КонецЕсли;
	
#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции

// Формирует параметры формы подключенного объекта в контексте выполняемой команды.
Функция ПараметрыФормы(Контекст, ПараметрКоманды)
	Результат = Контекст.ОписаниеКоманды.ПараметрыФормы;
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Результат = Новый Структура;
	КонецЕсли;
	Контекст.ОписаниеКоманды.Удалить("ПараметрыФормы");
	Результат.Вставить("ОписаниеКоманды", Контекст.ОписаниеКоманды);
	Если ПустаяСтрока(Контекст.ОписаниеКоманды.ИмяПараметраФормы) Тогда
		Результат.Вставить("ПараметрКоманды", ПараметрКоманды);
	Иначе
		МассивИмен = СтрРазделить(Контекст.ОписаниеКоманды.ИмяПараметраФормы, ".", Ложь);
		Узел = Результат;
		ВГраница = МассивИмен.ВГраница();
		Для Индекс = 0 По ВГраница-1 Цикл
			Имя = СокрЛП(МассивИмен[Индекс]);
			Если Не Узел.Свойство(Имя) Или ТипЗнч(Узел[Имя]) <> Тип("Структура") Тогда
				Узел.Вставить(Имя, Новый Структура);
			КонецЕсли;
			Узел = Узел[Имя];
		КонецЦикла;
		Узел.Вставить(МассивИмен[ВГраница], ПараметрКоманды);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ПродолжитьВыполнениеКоманды(Контекст)
	Источник = Контекст.Источник;
	ОписаниеКоманды = Контекст.ОписаниеКоманды;
	ПараметрКоманды = Неопределено;
	
	Если ЗначениеЗаполнено(ОписаниеКоманды.Обработчик) Тогда
		МассивПодстрок = СтрРазделить(ОписаниеКоманды.Обработчик, ".");
		Если МассивПодстрок.Количество() = 1 Тогда
			ПараметрыФормы = ПараметрыФормы(Контекст, ПараметрКоманды);
			КлиентскийМодуль = ПолучитьФорму(ОписаниеКоманды.ИмяФормы, ПараметрыФормы, Контекст.Форма, Истина);
			ИмяПроцедуры = ОписаниеКоманды.Обработчик;
		Иначе
			КлиентскийМодуль = ОбщийМодуль(МассивПодстрок[0]);
			ИмяПроцедуры = МассивПодстрок[1];
		КонецЕсли;
		Обработчик = Новый ОписаниеОповещения(ИмяПроцедуры, КлиентскийМодуль, Контекст);
		ВыполнитьОбработкуОповещения(Обработчик, ПараметрКоманды);
	КонецЕсли;
КонецПроцедуры

Функция ВывестиКоманды(Форма, ОписанияКоманд=Неопределено) Экспорт
	
	Если Не вмс_РаботаСФормамиКлиентСервер.ПроверитьНаличиеСлужебногоСерверногоМетодаФормы(Форма) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыРазмещения = Новый Структура;
	ПараметрыРазмещения.Вставить("ЕстьУсловияВидимости", Ложь);
	
	// Создание и начальное заполнение реквизита формы "ПараметрыПодключаемыхКоманд", если его еще нет.
	КлиентскиеПеременныеФормы = ПолучитьКлиентскиеПеременныеОбъекта(Форма);
	ПараметрыКлиента = КлиентскиеПеременныеФормы["ПараметрыПодключаемыхКоманд"];
	Если ТипЗнч(ПараметрыКлиента) <> Тип("Структура") Тогда
		ПараметрыКлиента = Новый Структура;
		ПараметрыКлиента.Вставить("ЕстьУсловияВидимости", ПараметрыРазмещения.ЕстьУсловияВидимости);
		ПараметрыКлиента.Вставить("ПодменюСУсловиямиВидимости", Новый Массив);
		ПараметрыКлиента.Вставить("КорневыеПодменюИКоманды", Новый Массив);
		ПараметрыКлиента.Вставить("ДоступностьКоманд", Истина);
		ПараметрыКлиента.Вставить("ТаблицаКоманд");
		КлиентскиеПеременныеФормы["ПараметрыПодключаемыхКоманд"] = ПараметрыКлиента;
	Иначе
		ПараметрыКлиента.ЕстьУсловияВидимости = ПараметрыКлиента.ЕстьУсловияВидимости Или ПараметрыРазмещения.ЕстьУсловияВидимости;
	КонецЕсли;
	
	Если ПараметрыКлиента.ТаблицаКоманд = Неопределено Тогда
		ТаблицаКоманд = вмс_ПодключаемыеКомандыКлиентСервер.ТаблицаКоманд();
		вмс_РаботаСКоллекциями.ДобавитьИндексыКвазиТаблицыЗначений(ТаблицаКоманд, "ИмяВФорме");
		ТаблицаКоманд.ДопускатьНарушениеСсылочнойЦелостности = Истина;
		ПараметрыКлиента.ТаблицаКоманд = ТаблицаКоманд;
	Иначе
		ТаблицаКоманд = ПараметрыКлиента.ТаблицаКоманд;
	КонецЕсли;
	
	Если ОписанияКоманд <> Неопределено Тогда
		ОписанияКомандСервер = Новый Массив;
		ПоляСерверногоОписания = "Вид, ИмяВФорме, Подменю, Картинка, Представление";
		ОписанияКомандМассив = вмс_РаботаСКоллекциями.ПолучитьЭлементыКоллекции(ОписанияКоманд);
		Для Каждого ОписаниеКоманды Из ОписанияКомандМассив Цикл
			НоваяСтрокаКоманды = вмс_ПодключаемыеКомандыКлиентСервер.ДобавитьОписаниеКоманды(Форма, ОписаниеКоманды, ТаблицаКоманд);
			ОписаниеКомандыСервер = Новый Структура(ПоляСерверногоОписания);
			ЗаполнитьЗначенияСвойств(ОписаниеКомандыСервер, НоваяСтрокаКоманды);
			ОписанияКомандСервер.Добавить(ОписаниеКомандыСервер);
		КонецЦикла;
		
		Если ОписанияКомандСервер.Количество() > 0 Тогда
			Форма.СлужебнаяФункцияВызовСервера("вмс_ПодключаемыеКоманды.ВывестиКоманды(Форма, ДополнительныеПараметры)", ОписанияКомандСервер);
			Для Каждого ОписаниеКоманды Из ОписанияКомандМассив Цикл
				НоваяКнопка = Форма.Элементы.Найти(ОписаниеКоманды.ИмяВФорме);
				Если ОписаниеКоманды.ПоложениеКнопкиВКоманднойПанели <> Неопределено Тогда
					НоваяКнопка.ПоложениеВКоманднойПанели = ОписаниеКоманды.ПоложениеКнопкиВКоманднойПанели;
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
