#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступныеСклады.ЗагрузитьЗначения(вмс_СкладыВызовСервера.СкладыХраненияWMS());
	
	Если ЗначениеЗаполнено(ДоступныеСклады) Тогда
		Склад = ДоступныеСклады.Получить(0).Значение;
	КонецЕсли;
	
	Период.ДатаНачала  = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(Период.ДатаНачала);
	СкладПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	СкладПриИзмененииНаСервере();
	Элементы.НоменклатураККонтролю.Обновить(); 
КонецПроцедуры          

&НаСервере
Процедура СкладПриИзмененииНаСервере()
	ЗаполнитьЗонуОтгрузки();
	ЗаполнитьРаспоряженияНаОтгрузку();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьРаспоряженияНаОтгрузку();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОбновитьТаблицуЗаданиеКладовщику(ТекущаяСтраница.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПланируемыйОтбор

&НаКлиенте
Процедура ПланируемыйОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Распоряжение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачиНаОтбор

&НаКлиенте
Процедура ЗадачиНаОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Задание);
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиНаОтборПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ВыделенныеСтроки = Элементы.ЗадачиНаОтбор.ВыделенныеСтроки;
	ВыделенныеЗадания = Новый Массив;
	
	Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ЗадачиНаОтбор.ДанныеСтроки(ВыделеннаяСтрока); 
		ВыделенныеЗадания.Добавить(ДанныеСтроки.Задание);
	КонецЦикла;
	
	вмс_ОперацииПоЯчейкамВызовСервера.УстановитьПометкуУдаленияОбъектов(ВыделенныеЗадания);
	ЗаполнитьРаспоряженияНаОтгрузку();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачиНаКонтроль

&НаКлиенте
Процедура ЗадачиНаКонтрольВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Задание);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьПланируемуюРеализацию(Команда)
	ЗаполнитьРаспоряженияНаОтгрузку();
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьНоменклатуруККонтролю(Команда)
	ЗаполнитьНоменклатуруККонтролю();
	ОбновитьТаблицуЗаданиеКладовщику(, Истина) 
КонецПроцедуры   

&НаКлиенте
Процедура СоздатьЗадание(Команда)
	
	Перем ВыделенныеСтроки;
	
	Если ПроверитьЗаполнение() Тогда 
		
		ВыделенныеСтроки = Элементы.ПланируемыйОтбор.ВыделенныеСтроки;
		ДанныеВыделенныхСтрок = Новый Массив;
		КоличествоСозданныхЗаданий = 0;
		
		// Сборка выделенных строк в отдельную коллекцию для обработки 
		// Если обрабатывать сразу - ломается метод "ДанныеСтроки" (возвращает неопределено)
		Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл 
			ДанныеВыделенныхСтрок.Добавить(Элементы.ПланируемыйОтбор.ДанныеСтроки(ВыделеннаяСтрока));
		КонецЦикла;
		
		Если ДанныеВыделенныхСтрок.Количество() = 0 Тогда	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не выбрано ни одной строки для создания заданий!";
			Сообщение.Сообщить(); 
			Возврат;
		КонецЕсли;
		// Сборка выделенных строк в отдельную коллекцию для обработки
		
		Для Каждого ДанныеСтроки Из ДанныеВыделенныхСтрок Цикл
			
			ПараметрыОтбора = вмс_ОтборВызовСервера.НовыеПараметрыОтбора();
			ДанныеРаспоряжения = РеквизитыРаспоряжения(ДанныеСтроки.Распоряжение);
			
			Для каждого КлючЗначение Из ДанныеРаспоряжения Цикл
				ПараметрыОтбора.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЦикла;
			
			ПараметрыОтбора.Распоряжение= ДанныеСтроки.Распоряжение;
			ПараметрыОтбора.Склад = Склад;
			ПараметрыОтбора.ЗонаПолучатель = ЗонаОтгрузки;
			ПараметрыОтбора.Операция = вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьСсылкуНаВидОперацииПоЯчейкам("Отбор");
			ПараметрыОтбора.Процесс = "Отбор";
			
			Результат = СоздатьЗаданиеНаСервере(ПараметрыОтбора);
			
			Если Результат Тогда
				
				КоличествоСозданныхЗаданий = КоличествоСозданныхЗаданий + 1;
				
				ЗаполнитьРаспоряженияНаОтгрузку();
				//ЗаполнитьНоменклатуруКРаспоряжению(); 
				//ОбновитьТаблицуЗаданиеКладовщику(,Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Сообщение = Новый СообщениеПользователю; 
		Сообщение.Текст = СтрШаблон("Создано %1 заданий.", КоличествоСозданныхЗаданий);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьЗаданиеНаСервере(ПараметрыОтбора)
	
	ПулНоменклатуры = ПолучитьПулНоменклатуры(ПараметрыОтбора.Распоряжение);
	Результат = Документы.вмс_ЗаданиеКладовщику.СпланироватьОтбор(ПулНоменклатуры, ПараметрыОтбора);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СпланироватьКонтроль(Команда)  
	
	Результат = СпланироватьКонтрольСервер();    
	
	Если Результат Тогда
		
		Сообщение = Новый СообщениеПользователю; 
		Сообщение.Текст = "Задание кладовщику успешно создано!";
		Сообщение.Сообщить();    
		ЗаполнитьНоменклатуруККонтролю(); 
		ОбновитьТаблицуЗаданиеКладовщику(,Истина);  
		
	Иначе   
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "По текущим товарам на зоне приемки уже созданы задания кладовщику!";
		Сообщение.Сообщить(); 
		
	КонецЕсли;
	
	
КонецПроцедуры 

&НаСервере
Функция СпланироватьКонтрольСервер()
	Если ПроверитьЗаполнение() Тогда 
		
		ПараметрыКонтроля = вмс_ОтборСервер.НовыеПараметрыКонтроля();
		ПараметрыКонтроля.Склад = Склад;
		ПараметрыКонтроля.ЗонаОтгрузки = ЗонаОтгрузки;
		ПараметрыКонтроля.ЗонаКонтроля = вмс_ОтборСервер.ПолучитьЗонуКонтроля(Склад);
		ПараметрыКонтроля.Автор = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя());
		//ПараметрыРазмещения.ТипыЯчеек = вмс_РазмещениеСервер.ТипыЯчеекДляРазмещения();
		ПараметрыКонтроля.Операция = вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьСсылкуНаВидОперацииПоЯчейкам("Контроль");   
		ПараметрыКонтроля.Процесс = "Контроль";
		
		ПулНоменклатуры = НоменклатураККонтролю.Выгрузить();
		Результат = Документы.вмс_ЗаданиеКладовщику.СпланироватьКонтроль(ПулНоменклатуры, ПараметрыКонтроля);  
		
		Возврат Результат;
		
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьЗонуОтгрузки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	вмс_МестаХранения.Ссылка КАК ЗонаОтгрузки
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.Владелец = &Склад
	|	И вмс_МестаХранения.ПометкаУдаления = ЛОЖЬ
	|	И вмс_МестаХранения.ТипЯчейки = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаОтгрузки)";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка); 
	
	ЗаполнитьНоменклатуруККонтролю();
	
КонецФункции       

&НаСервере
Процедура ЗаполнитьЗаданияКладовщику(Операция, ТаблицаПоОперации, Склад) 
	
	ТаблицаПоОперации.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_ЗаданиеКладовщику.Ссылка КАК Задание,
	|	вмс_ЗаданиеКладовщику.Номер КАК Номер,
	|	вмс_ЗаданиеКладовщику.Дата КАК Дата,
	|	вмс_ЗаданиеКладовщику.Распоряжение КАК Распоряжение,
	|	вмс_ЗаданиеКладовщику.Состояние КАК Состояние
	|ИЗ
	|	Документ.вмс_ЗаданиеКладовщику КАК вмс_ЗаданиеКладовщику
	|ГДЕ
	|	вмс_ЗаданиеКладовщику.Операция = &Операция
	|	И вмс_ЗаданиеКладовщику.Склад = &Склад
	|	И вмс_ЗаданиеКладовщику.Проведен"
	;
	
	Запрос.УстановитьПараметр("Операция", Операция); 
	Запрос.УстановитьПараметр("Склад", Склад); 
	
	ТаблицаПоОперации.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаспоряженияНаОтгрузку()
	ВидОперации = вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьСсылкуНаВидОперацииПоЯчейкам("Отбор"); 	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		ПланируемыйОтбор.Очистить();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыКОтгрузкеОбороты.Склад КАК Склад,
	|	ТоварыКОтгрузкеОбороты.Получатель КАК Получатель,
	|	ТоварыКОтгрузкеОбороты.ДокументОтгрузки КАК Распоряжение,
	|	ТоварыКОтгрузкеОбороты.КОформлениюОборот КАК КОформлениюОборот,
	|	ТоварыКОтгрузкеОбороты.КОтгрузкеОборот КАК КОтгрузкеОборот,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеОбороты.Получатель) = ТИП(Справочник.Партнеры)
	|			ТОГДА ""Клиент""
	|		КОГДА ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеОбороты.Получатель) = ТИП(Справочник.Склады)
	|			ТОГДА ""Склад""
	|	КОНЕЦ КАК СкладКлиент,
	|	ТоварыКОтгрузкеОбороты.ДокументОтгрузки.Дата КАК Дата,
	|	ТоварыКОтгрузкеОбороты.ДокументОтгрузки.Номер КАК Номер,
	|	ЕСТЬNULL(вмс_СтатусыДокументовСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.вмс_СтатусыДокументов.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Обороты(, &КонецПериода, , Склад = &Склад) КАК ТоварыКОтгрузкеОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_СтатусыДокументов.СрезПоследних КАК вмс_СтатусыДокументовСрезПоследних
	|		ПО ТоварыКОтгрузкеОбороты.ДокументОтгрузки = вмс_СтатусыДокументовСрезПоследних.Документ
	|ГДЕ
	|	(вмс_СтатусыДокументовСрезПоследних.Статус ЕСТЬ NULL
	|			ИЛИ вмс_СтатусыДокументовСрезПоследних.Статус = &СтатусОтбирается)";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);	
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СтатусОтбирается", Справочники.вмс_СтатусыДокументов.НайтиПоНаименованию("Отбирается", Истина));
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	ПланируемыйОтбор.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ЗаполнитьЗаданияКладовщику(ВидОперации, ЗадачиНаОтбор, Склад); 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПулНоменклатуры(Распоряжение)
	
	ПулНоменклатуры = Распоряжение.Товары.Выгрузить();
	Возврат ПулНоменклатуры;
	
КонецФункции // ПолучитьПулНоменклатуры()

&НаСервере
Функция РеквизитыРаспоряжения(Распоряжение)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Распоряжение, "Автор, Организация, Комментарий");
	
КонецФункции

&НаСервере
Функция ЗаполнитьНоменклатуруККонтролю()
	//тд: добавить в количество планируемого расхода (размещается) и дельту между план. расходом и остатком (к размещению)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстаткиИОбороты.Товар КАК Номенклатура,
	|	вмс_ОперацияПоЯчейкамОстаткиИОбороты.Контейнер КАК Контейнер,
	|	вмс_ОперацияПоЯчейкамОстаткиИОбороты.Характеристика КАК Характеристика,
	|	вмс_ОперацияПоЯчейкамОстаткиИОбороты.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОстаткиИОбороты.Ячейка.Владелец КАК Склад,
	|	вмс_ОперацияПоЯчейкамОстаткиИОбороты.Партия КАК Партия,
	|	вмс_ОперацияПоЯчейкамОстаткиИОбороты.Серия КАК Серия,
	|	вмс_ОперацияПоЯчейкамОстаткиИОбороты.КоличествоКонечныйОстаток КАК Количество,
	|	ЕСТЬNULL(ТоварРазмещается.ПланируемыйРасходПриход, 0) КАК Размещается,
	|	вмс_ОперацияПоЯчейкамОстаткиИОбороты.КоличествоКонечныйОстаток - ЕСТЬNULL(ТоварРазмещается.ПланируемыйРасходПриход, 0) КАК Разница
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.ОстаткиИОбороты(, , , , Ячейка = &ЗонаОтгрузки) КАК вмс_ОперацияПоЯчейкамОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.ОстаткиИОбороты(, , , , Ячейка = &ЗонаОтгрузки) КАК ТоварРазмещается
	|		ПО вмс_ОперацияПоЯчейкамОстаткиИОбороты.Товар = ТоварРазмещается.Товар
	|			И вмс_ОперацияПоЯчейкамОстаткиИОбороты.Контейнер = ТоварРазмещается.Контейнер
	|			И вмс_ОперацияПоЯчейкамОстаткиИОбороты.Характеристика = ТоварРазмещается.Характеристика
	|			И вмс_ОперацияПоЯчейкамОстаткиИОбороты.Партия = ТоварРазмещается.Партия
	|			И вмс_ОперацияПоЯчейкамОстаткиИОбороты.Серия = ТоварРазмещается.Серия";
//	|			И вмс_ОперацияПоЯчейкамОстаткиИОбороты.Склад = ТоварРазмещается.Склад"; 
	
	Запрос.УстановитьПараметр("ЗонаОтгрузки", ЗонаОтгрузки);
	
	НоменклатураККонтролю.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаСервере
Функция ОбновитьТаблицуЗаданиеКладовщику(ИмяСтраницы = Неопределено, КонтролируемТовар = Ложь) 
	
	Если ЗначениеЗаполнено(Склад) Тогда
		Если ИмяСтраницы = "СтраницаПланированияКонтроля" ИЛИ КонтролируемТовар Тогда	
			Операция = вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьСсылкуНаВидОперацииПоЯчейкам("Контроль");
			ЗаполнитьНоменклатуруККонтролю();
			ЗаполнитьЗаданияКладовщику(Операция, ЗадачиНаКонтроль, Склад);
		ИначеЕсли ИмяСтраницы = "СтраницаПланированияОтбора" Тогда 
			Операция = вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьСсылкуНаВидОперацииПоЯчейкам("Отбор");	
			ЗаполнитьЗаданияКладовщику(Операция, ЗадачиНаОтбор, Склад);
		КонецЕсли;  
	КонецЕсли;	
	
КонецФункции

#КонецОбласти























