#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПервичноРегистрТриграммов() Экспорт  
	
	СписокНоменклатуры = ПолучитьСписокНоменклатуры();
	
	Для Каждого Номенклатура Из СписокНоменклатуры Цикл
		вмс_РаботаСТриграммамиВызовСервера.ОбработатьЗаписьНоменклатуры(Номенклатура);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПервичноРегистрТриграммовФоновымЗаданием() Экспорт
	
	ФоновыеЗадания.Выполнить("вмс_РаботаСТриграммамиВызовСервера.ЗаполнитьПервичноРегистрТриграммов"); 
	
КонецПроцедуры 

Процедура ОбработатьЗаписьНоменклатуры(Источник, Отказ = Ложь) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	РК = вмс_РаботаСКоллекциями;
	КонкатенацияНоменклатуры = ВыполнитьКонкатенациюНоменклатуры(Источник.Ссылка);	
	МассивТриграммов = ПолучитьМассивТриграммов(КонкатенацияНоменклатуры);  
	
	Если МассивТриграммов.Количество() > 0 Тогда
		
		НаборЗаписей = РегистрыСведений.вмс_НоменклатураТриграммы.СоздатьНаборЗаписей();
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.Номенклатура.Установить(Источник.Ссылка);
		
		Для каждого Триграмм Из МассивТриграммов Цикл  
			
			НоваяЗапись = НаборЗаписей.Добавить();   
			НоваяЗапись.Номенклатура = Источник.Ссылка;
			НоваяЗапись.Триграмм = Триграмм;
			НоваяЗапись.Конкатенация = КонкатенацияНоменклатуры;
			
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина); 
		
	КонецЕсли;
	
КонецПроцедуры   

Функция ПолучитьМассивТриграммов(СтрокаНоменклатуры) Экспорт   
	
	РК = вмс_РаботаСКоллекциями;
	
	МассивТриграммов = Новый Массив;
	Счетчик = 1; 
	КоличествоСимволовТриграмма = 3; 
	ДлинаКонкатенации = СтрДлина(СтрокаНоменклатуры);   
	
	Если ДлинаКонкатенации > 3 Тогда 
		Пока Счетчик < ДлинаКонкатенации Цикл
			
			ТекущаяПозицияТриграмма = Счетчик + (КоличествоСимволовТриграмма - 1);  
			Если ТекущаяПозицияТриграмма > ДлинаКонкатенации Тогда
				Прервать;
			КонецЕсли;
			
			Триграмм = Сред(СтрокаНоменклатуры, Счетчик, КоличествоСимволовТриграмма); 
			МассивТриграммов.Добавить(Триграмм);
			
			Счетчик = Счетчик + 1; 
			
		КонецЦикла;  
	Иначе   
		МассивТриграммов.Добавить(СтрокаНоменклатуры);
	КонецЕсли;   
	РК.УдалитьДублиВМассиве(МассивТриграммов);  
	
	Возврат МассивТриграммов;  
	
КонецФункции  

Функция ПолучитьТаблицуСовпаденийТриграммов(МассивТриграммов) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_НоменклатураТриграммы.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_НоменклатураТриграммы.Триграмм) КАК КоличествоТриграммов
	|ИЗ
	|	РегистрСведений.вмс_НоменклатураТриграммы КАК вмс_НоменклатураТриграммы
	|ГДЕ
	|	вмс_НоменклатураТриграммы.Триграмм В(&МассивТриграммов)
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_НоменклатураТриграммы.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоТриграммов УБЫВ,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("МассивТриграммов", МассивТриграммов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаСовпаденийТриграммов = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаСовпаденийТриграммов;	
	
КонецФункции  

Функция ПолучитьТаблицуСовпаденийТриграммовПоТаблицеНоменклатуры(МассивТриграммов, ТаблицаТоваров) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ТаблицаТоваров
	|ИЗ
	|	&Товары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_НоменклатураТриграммы.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_НоменклатураТриграммы.Триграмм) КАК КоличествоТриграммов,
	|	ВТ_ТаблицаТоваров.Характеристика КАК Характеристика
	|ИЗ
	|	ВТ_ТаблицаТоваров КАК ВТ_ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_НоменклатураТриграммы КАК вмс_НоменклатураТриграммы
	|		ПО ВТ_ТаблицаТоваров.Номенклатура = вмс_НоменклатураТриграммы.Номенклатура
	|ГДЕ
	|	вмс_НоменклатураТриграммы.Триграмм В(&МассивТриграммов)
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_НоменклатураТриграммы.Номенклатура,
	|	ВТ_ТаблицаТоваров.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоТриграммов УБЫВ,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("МассивТриграммов", МассивТриграммов); 
	Запрос.УстановитьПараметр("Товары", ТаблицаТоваров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаСовпаденийТриграммов = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаСовпаденийТриграммов;	
	
КонецФункции

Функция ОбработатьСтроку(Знач ИсходнаяСтрока) Экспорт
	
	Результат = СокрЛП(ИсходнаяСтрока);
	
	Результат = СтрЗаменить(Результат, "Ё", "е");
	Результат = СтрЗаменить(Результат, "ё", "е");
	
	Результат = СтрЗаменить(Результат, " ", "");
	
	Результат = НРег(Результат);
	
	МассивРазделителей = ПолучитьМассивРазделителей();
	
	Для Каждого Разделитель Из МассивРазделителей Цикл
		Результат = СтрЗаменить(Результат, Разделитель, "");
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьСписокНоменклатуры() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяТипНоменклатурыТовар = вмс_АдаптацияКонфигураций.ПолучитьИмяТипаНоменклатурыТовар(); 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ТипНоменклатуры = &ТипНоменклатурыТовар"; 
	//в БП и АА нет ТипаНоменклатуры в привычном понимании, в УАТ скорее всего тоже
	Если ИмяТипНоменклатурыТовар = Неопределено Тогда  
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Номенклатура.ТипНоменклатуры = &ТипНоменклатурыТовар", "");
	Иначе		
		Запрос.УстановитьПараметр("ТипНоменклатурыТовар", Перечисления.ТипыНоменклатуры[ИмяТипНоменклатурыТовар]);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаНоменклатуры = РезультатЗапроса.Выгрузить();
	МассивНоменклатуры = ТаблицаНоменклатуры.ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивНоменклатуры; 
	
КонецФункции

#КонецОбласти

Функция ВыполнитьКонкатенациюНоменклатуры(Номенклатура) 
	
	// Создаем запрос для получения данных
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий(); 
	
	КодОбработанный = ОбработатьСтроку(СокрЛП(Выборка.Код));
	АртикулОбработанный = ОбработатьСтроку(СокрЛП(Выборка.Артикул));
	НаименованиеОбработанное = ОбработатьСтроку(СокрЛП(Выборка.Наименование));
	
	Результат = КодОбработанный + АртикулОбработанный + НаименованиеОбработанное;
	
	Возврат Результат;
	
КонецФункции  

Функция ПолучитьМассивРазделителей() 
	
	МассивРазделителей = Новый Массив;
	МассивРазделителей.Добавить(",");
	МассивРазделителей.Добавить(".");
	МассивРазделителей.Добавить("-");
	МассивРазделителей.Добавить("/");
	МассивРазделителей.Добавить("\");
	МассивРазделителей.Добавить("(");
	МассивРазделителей.Добавить(")");
	МассивРазделителей.Добавить("_");
	МассивРазделителей.Добавить("+");
	МассивРазделителей.Добавить("=");
	МассивРазделителей.Добавить(";");
	МассивРазделителей.Добавить(":");
	МассивРазделителей.Добавить("\"); 
	МассивРазделителей.Добавить("""");
	МассивРазделителей.Добавить("'");
	
	Возврат МассивРазделителей; 
	
КонецФункции

