
&НаКлиенте
Процедура КомандаНайтиОбъект(Команда)
	КомандаНайтиОбъектНаСервере();
	//Если Не ЗначениеЗаполнено(НайденныйОбъект) Тогда
	//	ПоказатьПредупреждение(, "Объект не найден!");
	//Иначе
	//	РезультатПоиска = 	
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаНайтиОбъектНаСервере()
	СправочникОбъект = РеквизитФормыВЗначение("Объект"); 	
	МассивСтрокПоиска = вмс_РаботаСКоллекциями.ЗначениеВМассив(СтрокаПоиска);	
	НайденныеОбъекты = СправочникОбъект.НайтиОбъекты(МассивСтрокПоиска);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(НайденныеОбъекты);       
	Построитель.Вывести(ТабличныйДокумент);
	РезультатПоиска = ТабличныйДокумент;	
	//Возврат ТабличныйДокумент;
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокОбъектов()
	Если Объект.ПолучаемыеОбъекты.Количество() = 0 Тогда
		Объект.ПолучаемыеОбъекты.Добавить();
	КонецЕсли;

	ЭтаФорма.НесколькоОбъектов = Объект.ПолучаемыеОбъекты.Количество() > 1;
	Элементы.НесколькоОбъектов.Доступность = Объект.ПолучаемыеОбъекты.Количество() = 1;   
	
	Элементы.ГруппаОбъекты.ТекущаяСтраница = ?(Объект.ПолучатьПоляЧерезЗапрос, Элементы.ГруппаОбъектыСтраницаПоляЧерезЗапрос, 
												?(ЭтаФорма.НесколькоОбъектов, Элементы.ГруппаОбъектыСтраницаНесколькоОбъектов, Элементы.ГруппаОбъектыСтраницаОдинОбъект));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьСписокОбъектов();
КонецПроцедуры

&НаКлиенте
Процедура НесколькоОбъектовПриИзменении(Элемент)
	Элементы.ГруппаОбъекты.ТекущаяСтраница = ?(ЭтаФорма.НесколькоОбъектов, Элементы.ГруппаОбъектыСтраницаНесколькоОбъектов, Элементы.ГруппаОбъектыСтраницаОдинОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолучаемыеОбъектыПередУдалением(Элемент, Отказ)
	Если Объект.ПолучаемыеОбъекты.Количество() = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучаемыеОбъектыПослеУдаления(Элемент)
	Если Объект.ПолучаемыеОбъекты.Количество() = 1 Тогда
		ЭтаФорма.НесколькоОбъектов = Ложь;
		Элементы.НесколькоОбъектов.Доступность = Истина;
		НесколькоОбъектовПриИзменении(Элементы.НесколькоОбъектов);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучаемыеОбъектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока Тогда
		ЭтаФорма.НесколькоОбъектов = Объект.ПолучаемыеОбъекты.Количество() > 1;
		Элементы.НесколькоОбъектов.Доступность = Объект.ПолучаемыеОбъекты.Количество() = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучатьПоляЧерезЗапросПриИзменении(Элемент)
	Элементы.ГруппаОбъекты.ТекущаяСтраница = ?(Объект.ПолучатьПоляЧерезЗапрос, Элементы.ГруппаОбъектыСтраницаПоляЧерезЗапрос, 
												?(ЭтаФорма.НесколькоОбъектов, Элементы.ГруппаОбъектыСтраницаНесколькоОбъектов, Элементы.ГруппаОбъектыСтраницаОдинОбъект));
КонецПроцедуры

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница=Элементы.СтраницаОбработчики Тогда
		
		ЗаполнитьТекстыОбработчиковПоУмолчанию();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьТекстыОбработчиковПоУмолчанию()
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбработчикПередПоискомОбъектов) Тогда
		
		Объект.ОбработчикПередПоискомОбъектов =
		"Для Каждого СтрокаПоискаОбъектов Из ТаблицаПоискаОбъектов Цикл
		|
		| 	СтрокаПоискаОбъектов.СтрокаПоиска = СтрокаПоискаОбъектов.Штрихкод;
		|
		|КонецЦикла;";
		
	КонецЕсли;
	
КонецФункции
