
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) 
	
	АдаптироватьТекстЗапросаПодКонфигурацию();
	
КонецПроцедуры  

Процедура АдаптироватьТекстЗапросаПодКонфигурацию() 
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;
	
	Если вмс_АдаптацияКонфигураций.ЭтоУТ() ИЛИ вмс_АдаптацияКонфигураций.ЭтоЕРП() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНоменклатура", "ОборотыТоваров.Номенклатура");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеХарактеристика", "ОборотыТоваров.Характеристика");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСклад", "ОборотыТоваров.Склад");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНачальныйОстаток", "ОборотыТоваров.ВНаличииНачальныйОстаток");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриход", "ОборотыТоваров.ВНаличииПриход");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеРасход", "ОборотыТоваров.ВНаличииРасход");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеКонечныйОстаток", "ОборотыТоваров.ВНаличииКонечныйОстаток");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.вмс_ОперацияПоЯчейкам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ШаблоннаяТаблица",
		"РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ОборотыТоваров");
	КонецЕсли;
	
	Если вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНоменклатура", "ОборотыТоваров.Номенклатура");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеХарактеристика", "ОборотыТоваров.Характеристика");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСклад", "ОборотыТоваров.СтруктурнаяЕдиница");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНачальныйОстаток", "ОборотыТоваров.КоличествоНачальныйОстаток");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриход", "ОборотыТоваров.КоличествоПриход");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеРасход", "ОборотыТоваров.КоличествоРасход");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеКонечныйОстаток", "ОборотыТоваров.КоличествоКонечныйОстаток");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.вмс_ОперацияПоЯчейкам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ШаблоннаяТаблица",
		"РегистрНакопления.ЗапасыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ОборотыТоваров");	
	КонецЕсли; 
	
	СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = ТекстЗапроса;
	
КонецПроцедуры

Процедура Служебная_ТекстЗапросаДляОтладки()
	
	//// Текст запроса адаптируется под конфигурацию в модуле объекта при компоновке результата
	//// Текст для отладки доступен в модуле

	//ВЫБРАТЬ
	//	&ПолеНоменклатура КАК Товар,
	//	&ПолеХарактеристика КАК Характеристика,
	//	&ПолеСклад КАК Склад,
	//	&ПолеНачальныйОстаток КАК НачальныйОстаток,
	//	&ПолеПриход КАК Приход,
	//	&ПолеРасход КАК Расход,
	//	&ПолеКонечныйОстаток КАК КонечныйОстаток,
	//	0 КАК НачальныйОстатокАХ,
	//	0 КАК ПриходАХ,
	//	0 КАК РасходАХ,
	//	0 КАК КонечныйОстатокАХ,
	//	NULL КАК Ячейка
	//ПОМЕСТИТЬ ВТ
	//ИЗ
	//	РегистрНакопления.вмс_ОперацияПоЯчейкам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ШаблоннаяТаблица

	//ОБЪЕДИНИТЬ ВСЕ

	//ВЫБРАТЬ
	//	вмс_ОперацияПоЯчейкамОстаткиИОбороты.Товар,
	//	вмс_ОперацияПоЯчейкамОстаткиИОбороты.Характеристика,
	//	вмс_ОперацияПоЯчейкамОстаткиИОбороты.Склад,
	//	0,
	//	0,
	//	0,
	//	0,
	//	вмс_ОперацияПоЯчейкамОстаткиИОбороты.КоличествоНачальныйОстаток,
	//	вмс_ОперацияПоЯчейкамОстаткиИОбороты.КоличествоПриход,
	//	вмс_ОперацияПоЯчейкамОстаткиИОбороты.КоличествоРасход,
	//	вмс_ОперацияПоЯчейкамОстаткиИОбороты.КоличествоКонечныйОстаток,
	//	вмс_ОперацияПоЯчейкамОстаткиИОбороты.Ячейка
	//ИЗ
	//	РегистрНакопления.вмс_ОперацияПоЯчейкам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК вмс_ОперацияПоЯчейкамОстаткиИОбороты
	//{ГДЕ
	//	вмс_ОперацияПоЯчейкамОстаткиИОбороты.КоличествоНачальныйОстаток}
	//;

	//////////////////////////////////////////////////////////////////////////////////
	//ВЫБРАТЬ
	//	ВТ.Товар КАК Товар,
	//	ВТ.Характеристика КАК Характеристика,
	//	ВТ.Склад КАК Склад,
	//	СУММА(ВТ.НачальныйОстаток) КАК НачальныйОстаток,
	//	СУММА(ВТ.Приход) КАК Приход,
	//	СУММА(ВТ.Расход) КАК Расход,
	//	СУММА(ВТ.НачальныйОстатокАХ) КАК НачальныйОстатокАХ,
	//	СУММА(ВТ.ПриходАХ) КАК ПриходАХ,
	//	СУММА(ВТ.РасходАХ) КАК РасходАХ,
	//	СУММА(ВТ.КонечныйОстатокАХ) КАК КонечныйОстатокАХ,
	//	СУММА(ВТ.КонечныйОстаток) КАК КонечныйОстаток,
	//	ВТ.Ячейка КАК Ячейка
	//ИЗ
	//	ВТ КАК ВТ

	//СГРУППИРОВАТЬ ПО
	//	ВТ.Товар,
	//	ВТ.Характеристика,
	//	ВТ.Склад,
	//	ВТ.Ячейка
		
КонецПроцедуры

