//{ Адаптация
//
//			В расширении нельзя сделать глобальный модуль поэтому функцию размещаем здесь
//

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

//
//
//
//} Адаптация

Функция XMLЗначениеУлучшенная(знач Тип, знач СтрокаXML) Экспорт
	
	ДанныеТипаОбъекта = глОбщийМодуль("ОбщегоНазначенияКлиентСервер").ПолучитьДанныеТипаОбъекта(Тип);
	
	Если ДанныеТипаОбъекта.ЭтоТипСсылкиОбъектаИБ Тогда
		
		Значение = глОбщийМодуль("ОбщегоНазначенияВызовСервера").ПолучитьСсылкуОбъектаИБ(ДанныеТипаОбъекта.Имя, СтрокаXML);
		Возврат Значение;
		
	ИначеЕсли Тип = "ОписаниеТипов" ИЛИ Тип = "TypeDescription" ИЛИ Тип = Тип("ОписаниеТипов") Тогда
		
		Значение = ОписаниеТиповИзXMLСтроки(СтрокаXML);
		Возврат Значение;
		
	Иначе
		
		Если ТипЗнч(Тип) = Тип("Строка") Тогда
			Попытка
				Тип = Тип(Тип);
			Исключение
				Тип = Неопределено;
			КонецПопытки;
		КонецЕсли;
		
		Если Тип <> Неопределено Тогда
			Попытка
				Значение = XMLЗначение(Тип, СтрокаXML);
				Возврат Значение;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	//ну пусть будет просто строка
	Значение = СтрокаXML;
	
	Возврат Значение;
	
КонецФункции

//{ Описание типов
Функция ОписаниеТиповИзXMLСтроки(СтрокаXML) Экспорт
	
	Возврат ОписаниеТиповИзСтруктурыОписания(ПолучитьСтруктуруОписанияТиповИзXMLСтроки(СтрокаXML));
	
КонецФункции

Функция ОписаниеТиповИзСтруктурыОписания(СтруктураОписанияТипов)

	Если СтруктураОписанияТипов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДоступныеИменаТипов = Новый Массив;
	Для Каждого ИмяТипа Из СтруктураОписанияТипов.ИменаТипов Цикл
		ПозицияСимвола = СтрНайти(ИмяТипа, ":");
		Если ПозицияСимвола > 0 Тогда
			ИмяТипа = Прав(ИмяТипа, СтрДлина(ИмяТипа)-ПозицияСимвола);
		КонецЕсли;
		
		Если ИмяТипа="decimal" Тогда
			ИмяТипа = "Число";
		ИначеЕсли ИмяТипа="dateTime" Тогда
			ИмяТипа = "Дата";
		КонецЕсли;
		
		Если ИмяТипа="ТаблицаЗначений" Тогда
			// сам тип недоступен на клиенте, но описание типов, содержащее тип "ТаблицаЗначений" можно создать
		Иначе
			Попытка
				Тип = Тип(ИмяТипа);
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЕсли;
		
		ДоступныеИменаТипов.Добавить(ИмяТипа);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтруктураОписанияТипов.КвалификаторыДаты) Тогда
		ИмяЧастейДаты = СтруктураОписанияТипов.КвалификаторыДаты;
		ИмяЧастейДаты = СтрЗаменить(ИмяЧастейДаты, "xs:", "");
		КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты[ИмяЧастейДаты]);
	КонецЕсли;
	
	ДоступныеИменаТиповСтрока = СтрСоединить(ДоступныеИменаТипов, ", ");
	ОписаниеТипов = Новый ОписаниеТипов(ДоступныеИменаТиповСтрока, , , КвалификаторыДаты);
	Возврат ОписаниеТипов;
	
КонецФункции

Функция ПолучитьСтруктуруОписанияТиповИзXMLСтроки(СтрокаXML)

	Если СтрНайти(СтрокаXML, "<")=0 Тогда
		//список типов строкой
		СтруктураОписанияТипов = Новый Структура;
		СтруктураОписанияТипов.Вставить("ИменаТипов", СтрРазделить(СтрокаXML, ","));
		СтруктураОписанияТипов.Вставить("КвалификаторыДаты");
		Возврат СтруктураОписанияТипов;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	ЧтениеXML.Прочитать();
	Если ЧтениеXML.Имя <> "TypeDescription" Тогда
		Возврат Неопределено;
	КонецЕсли;
	ЧтениеXML.Прочитать();
	СтруктураОписанияТипов = ПрочитатьСвойстваОписанияТиповИзXML(ЧтениеXML);

	Возврат СтруктураОписанияТипов;
	
КонецФункции

Функция ПрочитатьСвойстваОписанияТиповИзXML(ЧтениеXML)

	ИменаТипов = Новый Массив;
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		
		Если ЧтениеXML.Имя = "Type" Тогда
			
			ЧтениеXML.Прочитать(); // прочитать значение элемента
			ИменаТипов.Добавить(ЧтениеXML.Значение);
			ЧтениеXML.Прочитать(); // прочитать конец элемента
			
		ИначеЕсли ЧтениеXML.Имя = "DateQualifiers" Тогда
			
			ЧтениеXML.Прочитать();
			
			Если ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя="DateFractions" Тогда
				ЧтениеXML.Прочитать();
				Если ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
					КвалификаторыДаты = ЧтениеXML.Значение;
					ЧтениеXML.Прочитать(); // </DateFractions>
				Иначе
					КвалификаторыДаты = "";
					Если ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Тогда
						ЧтениеXML.Пропустить(); // </DateFractions>
					КонецЕсли;
				КонецЕсли;
				ЧтениеXML.Прочитать(); // </DateQualifiers>
			ИначеЕсли ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Тогда
				ЧтениеXML.Пропустить();  // </DateQualifiers>
			КонецЕсли;
			
		Иначе
			
			ЧтениеXML.Пропустить();
			
		КонецЕсли;

		ЧтениеXML.Прочитать(); // прочитать следующий элемент
	КонецЦикла;
	
	СтруктураОписанияТипов = Новый Структура;
	СтруктураОписанияТипов.Вставить("ИменаТипов", ИменаТипов);
	СтруктураОписанияТипов.Вставить("КвалификаторыДаты", КвалификаторыДаты);
	
	Возврат СтруктураОписанияТипов;
	
КонецФункции
//} Описание типов

Функция ПрочитатьТекстТекущегоУзлаXML(ЧтениеXML, Отступ=Истина, Нативный=Истина) Экспорт

	Если Нативный Тогда
		//возможно работает быстрее
		Текст = ПрочитатьТекстТекущегоУзлаXMLНативный(ЧтениеXML, Отступ);
	Иначе
		Текст = ПрочитатьТекстТекущегоУзлаXMLКустарный(ЧтениеXML, Отступ);
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

//перемещает указатель чтения за конец текущего элемента, также как и функция "ПрочитатьТекстТекущегоУзлаXML"
Функция ПрочитатьТекстТекущегоУзлаXMLВнутри(ЧтениеXML, Отступ=Истина, Нативный=Истина) Экспорт
	
	ЧтениеXML.Прочитать(); //первый узел/текст внутри текущего узла
	Текст = ПрочитатьТекстТекущегоУзлаXML(ЧтениеXML, Отступ, Нативный);
	ЧтениеXML.Прочитать(); //пройти конец текущего узла
	
	Возврат Текст;
	
КонецФункции

Функция ПрочитатьТекстТекущегоУзлаXMLНативный(ЧтениеXML, Отступ=Истина) Экспорт
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Текст = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
		Возврат Текст;
	КонецЕсли;
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		Текст = "";
		Возврат Текст;
	КонецЕсли;
	
	Уровень = 1;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.Отступ = Отступ;
	ЗаписьXML.УстановитьСтроку();
	Пока Истина Цикл
		
		ЗаписьXML.ЗаписатьТекущий(ЧтениеXML);
		
		Если Не ЧтениеXML.Прочитать() Тогда
			Прервать;
		КонецЕсли;
		
		Если Уровень = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Уровень = Уровень + 1;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Уровень = Уровень - 1;
		КонецЕсли;
		
	КонецЦикла;

	Текст = ЗаписьXML.Закрыть();
	
	Возврат Текст;
	
КонецФункции

Функция ПрочитатьТекстТекущегоУзлаXMLКустарный(ЧтениеXML, ДобавлятьОтступ=Истина) Экспорт

	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Текст = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
		Возврат Текст;
	КонецЕсли;
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		Текст = "";
		Возврат Текст;
	КонецЕсли;
	
	Уровень = 1;
	Отступ = "";
	Текст = "";
	
	Если ДобавлятьОтступ Тогда
		СимволОтступа = Символы.Таб;
		СимволПереноса = Символы.ПС;
	Иначе
		СимволОтступа = "";
		СимволПереноса = "";
	КонецЕсли;

	ДлинаСимволаОтступа = СтрДлина(СимволОтступа);
	
	ПредыдущийТипУзла = Неопределено;
	СтекУзлов = Новый Массив;
	Пока Истина Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ПредыдущийТипУзла <> Неопределено Тогда
				Текст = Текст + СимволПереноса;
			КонецЕсли;
			
			Имя = ЧтениеXML.Имя;
			Атрибуты = "";
			НомерПоследнегоАтрибута = ЧтениеXML.КоличествоАтрибутов()-1;
			Для НомерАтрибута=0 По НомерПоследнегоАтрибута Цикл
				Атрибуты = Атрибуты + " " + ЧтениеXML.ИмяАтрибута(НомерАтрибута) + "="""+ ЧтениеXML.ПолучитьАтрибут(НомерАтрибута) + """";
			КонецЦикла;
			Текст = Текст + Отступ;
			Текст = Текст + "<" + Имя + Атрибуты + ">";
			СтекУзлов.Добавить(Имя);
			Отступ = Отступ + СимволОтступа;
			Уровень = Уровень + 1;
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			
			Текст = Текст + ЧтениеXML.Значение;
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			Уровень = Уровень - 1;
			Отступ = Лев(Отступ, СтрДлина(Отступ)-ДлинаСимволаОтступа);
			Имя = СтекУзлов[СтекУзлов.ВГраница()];
			СтекУзлов.Удалить(СтекУзлов.ВГраница());
			Если ПредыдущийТипУзла = ЧтениеXML.ТипУзла Тогда
				Текст = Текст + СимволПереноса + Отступ;
			КонецЕсли;

			Текст = Текст + "</" + Имя + ">";
			
		КонецЕсли;
		
		ПредыдущийТипУзла = ЧтениеXML.ТипУзла;
		
		Если Не ЧтениеXML.Прочитать() Тогда
			Прервать;
		КонецЕсли;
		
		Если Уровень = 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции

Функция ПрочитатьСодержимоеТекущегоУзлаXML(ЧтениеXML, Отступ=Истина) Экспорт

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.Отступ = Отступ;
	ЗаписьXML.УстановитьСтроку();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Содержимое");
	
	Уровень = 0;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла=ТипУзлаXML.КонецЭлемента Тогда
			Если Уровень=0 Тогда
				Прервать;
			Иначе
				Уровень = Уровень - 1;
			КонецЕсли;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			Уровень = Уровень + 1;
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьТекущий(ЧтениеXML);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Текст = ЗаписьXML.Закрыть();
	Если Текст="<Содержимое/>" Тогда
		Текст = "";
	Иначе
		Текст = Сред(Текст, СтрДлина("<Содержимое>")+1, СтрДлина(Текст)-СтрДлина("<Содержимое>")-СтрДлина("</Содержимое>"));
		Текст = СокрЛП(Текст);
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция СериализироватьВXMLНаСервере(Значение) Экспорт
	
	//тСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	//
	//тЗаписьXML = Новый ЗаписьXML;
	//тЗаписьXML.УстановитьСтроку();	
	//тСериализаторXDTO.ЗаписатьXML(тЗаписьXML,Значение, НазначениеТипаXML.Явное);
	//Строка = тЗаписьXML.Закрыть();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, НазначениеТипаXML.Явное);
	Строка = ЗаписьXML.Закрыть();
	
	Возврат Строка
	
КонецФункции

Функция ДесериализоватьИзXMLНаСервере(Значение) Экспорт  
	
	Если ЗначениеЗаполнено(Значение) Тогда 
		
		тСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO); 		
		тЧтениеXML = Новый ЧтениеXML;
		тЧтениеXML.УстановитьСтроку(Значение);	
		тСсылка = тСериализаторXDTO.ПрочитатьXML(тЧтениеXML); 	
		Возврат тСсылка;
		
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////
Функция XMLСтрокаИзЗначенияУлучшенная(Значение, Отступ=Истина) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.Отступ = Отступ;
	ЗаписьXML.УстановитьСтроку();
	ЗаписатьXMLУлучшенная(ЗаписьXML, Значение);
	Текст = ЗаписьXML.Закрыть();
	Возврат Текст;
	
КонецФункции

Функция ЗаписатьXMLУлучшенная(ЗаписьXML, Значение) Экспорт
	
	ПараметрыЗаписиXML = ПолучитьПараметрыЗаписиXML(ЗаписьXML);
	
	ПодготовитьОбъектыИЗначенияСвойствОбъектовДляЗаписи(ПараметрыЗаписиXML, Значение);
	
	ЗаписатьСодержимое(ПараметрыЗаписиXML);
	
КонецФункции

Функция ЗаписатьСодержимое(ПараметрыЗаписиXML) Экспорт
	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;
	ЗаписьXML.ЗаписатьНачалоЭлемента("СериализацияОбъекта");
	ЗаписатьШапку(ПараметрыЗаписиXML);
	ЗаписатьОбъекты(ПараметрыЗаписиXML);
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецФункции

Функция ЗаписатьШапку(ПараметрыЗаписиXML) Экспорт
	
	Если ПараметрыЗаписиXML.КодироватьСтроковыеЗначения Тогда
		ЗаписатьКодировкуЗначений("СтроковыеЗначения", ПараметрыЗаписиXML.КодировкаСтроковыхЗначений, ПараметрыЗаписиXML);
	КонецЕсли;
	
	Если ПараметрыЗаписиXML.КодироватьИменаТипов Тогда
		ЗаписатьКодировкуЗначений("Типы", ПараметрыЗаписиXML.КодировкаИменТипов, ПараметрыЗаписиXML);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПараметрыЗаписиXML(ЗаписьXML, Упрощенная=Ложь) Экспорт
	
	Перем ОбщегоНазначенияКлиентСервер, ОбщегоНазначенияВызовСервера, РаботаСКоллекциями;
	
	СписокОбъектов = Новый Массив;
	СписокОбъектовСоответствие = Новый Соответствие;
	
	ТипСтруктура = Тип("Структура");
	ТипСоответствие = Тип("Соответствие");
	ТипМассив = Тип("Массив");
	
	Типы = Новый Соответствие;
	Типы["Структура"] = ТипСтруктура;
	Типы["Соответствие"] = ТипСоответствие;
	Типы["Массив"] = ТипМассив;
	Типы["Строка"] = Тип("Строка");
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Типы["УдалениеОбъекта"] = Тип("УдалениеОбъекта");
		Типы["ТаблицаЗначений"] = Тип("ТаблицаЗначений");
	#КонецЕсли
	Типы["ФормаКлиентскогоПриложения"] = Тип("ФормаКлиентскогоПриложения");
	Типы["ПолеФормы"] = Тип("ПолеФормы");
	Типы["КнопкаФормы"] = Тип("КнопкаФормы");
	Типы["ТаблицаФормы"] = Тип("ТаблицаФормы");
	Типы["ГруппаФормы"] = Тип("ГруппаФормы");
	Типы["ОписаниеТипов"] = Тип("ОписаниеТипов");
	Типы["Цвет"] = Тип("Цвет");
	Типы["Шрифт"] = Тип("Шрифт");
	
	ТипУдалениеОбъекта = Типы["УдалениеОбъекта"];
	ТипТаблицаЗначений = Типы["ТаблицаЗначений"];

	НомерОбъекта = 1;
	
	ПоляТаблицыСвойств = "Имя, Значение, ИмяТипаЗначения, ИмяТипаЗначенияЗакодированное, ВложенныйОбъект, ЗначениеXML, СтрокаXML";
	Оптимизация_СвойствоДляЗаписи = Новый Структура(ПоляТаблицыСвойств);
	Оптимизация_ТаблицаСвойствДляЗаписи = Новый Массив;
	Оптимизация_ТаблицаСвойствДляЗаписи.Добавить(Оптимизация_СвойствоДляЗаписи);
	
	ТаблицаСвойствОбъектов = Новый Массив;
	ТаблицаСвойствПоОбъектам = Новый Соответствие;
	
	ЗначенияОбъектов = Новый Соответствие;
	ДанныеОбъектов = Новый Соответствие;
	
	ОбщиеМодули = ПолучитьОбщиеМодули();
	ОбщегоНазначенияКлиентСервер = ОбщиеМодули.ОбщегоНазначенияКлиентСервер;
	ОбщегоНазначенияВызовСервера = ОбщиеМодули.ОбщегоНазначенияВызовСервера;
	РаботаСКоллекциями = ОбщиеМодули.РаботаСКоллекциями;

	СимволыКодировкиЗначений = РаботаСКоллекциями.СтрокуВМассивПосимвольно("ABCDEFGHIJKLMNOPQRSTUVWXYZ");
	
	РаботаНаКлиенте = ОбщегоНазначенияКлиентСервер.ЭтоКлиент();
	
	ДанныеТиповОбъектов = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПриложения()["ДанныеТиповОбъектов"];
	
	ПараметрыЗаписиXML = Новый Структура;
	ПараметрыЗаписиXML.Вставить("ЗаписьXML", ЗаписьXML);
	ПараметрыЗаписиXML.Вставить("СписокОбъектов", СписокОбъектов);
	ПараметрыЗаписиXML.Вставить("СписокОбъектовСоответствие", СписокОбъектовСоответствие);
	ПараметрыЗаписиXML.Вставить("СсылочнаяМодельДанных", Истина);
	ПараметрыЗаписиXML.Вставить("НомерОбъекта", НомерОбъекта);
	ПараметрыЗаписиXML.Вставить("Типы", Типы);
	ПараметрыЗаписиXML.Вставить("ПримитивныеТипы", ПримитивныеТипы());
	ПараметрыЗаписиXML.Вставить("ТипыСериализуемыеОднойСтрокой", ТипыСериализуемыеОднойСтрокой());
	ПараметрыЗаписиXML.Вставить("ЗначенияОбъектов", ЗначенияОбъектов);
	ПараметрыЗаписиXML.Вставить("ДанныеОбъектов", ДанныеОбъектов);
	ПараметрыЗаписиXML.Вставить("ПоляТаблицыСвойств", ПоляТаблицыСвойств);
	ПараметрыЗаписиXML.Вставить("Оптимизация_ТаблицаСвойствДляЗаписи", Оптимизация_ТаблицаСвойствДляЗаписи);
	ПараметрыЗаписиXML.Вставить("ТаблицаСвойствОбъектов", ТаблицаСвойствОбъектов);
	ПараметрыЗаписиXML.Вставить("ТаблицаСвойствПоОбъектам", ТаблицаСвойствПоОбъектам);
	ПараметрыЗаписиXML.Вставить("ОбщиеМодули", ОбщиеМодули); //для совместимости мобильной и основной конфигураций
	ПараметрыЗаписиXML.Вставить("СимволыКодировкиЗначений", СимволыКодировкиЗначений);
	ПараметрыЗаписиXML.Вставить("РаботаНаКлиенте", РаботаНаКлиенте);
	ПараметрыЗаписиXML.Вставить("ДанныеТиповОбъектов", ДанныеТиповОбъектов);
	ПараметрыЗаписиXML.Вставить("КодироватьСтроковыеЗначения", Истина);
	ПараметрыЗаписиXML.Вставить("КодироватьИменаТипов", Истина);
	ПараметрыЗаписиXML.Вставить("КодировкаСтроковыхЗначений", Новый Соответствие);
	ПараметрыЗаписиXML.Вставить("КодировкаИменТипов", Новый Соответствие);
	ПараметрыЗаписиXML.Вставить("КолонкиТаблицЗначенийВыгружатьСписком", Ложь);
	
	Если Упрощенная Тогда
		ПараметрыЗаписиXML.СсылочнаяМодельДанных = Ложь;
		ПараметрыЗаписиXML.КодироватьСтроковыеЗначения = Ложь;
		ПараметрыЗаписиXML.КодироватьИменаТипов = Ложь;
		ПараметрыЗаписиXML.КолонкиТаблицЗначенийВыгружатьСписком = Истина;
	КонецЕсли;
	
	Возврат ПараметрыЗаписиXML;
	
КонецФункции

Функция ПримитивныеТипы()
	
	ПримитивныеТипы = Новый Соответствие;
	ПримитивныеТипы[Тип("Неопределено")] = Истина;
	ПримитивныеТипы[Тип("Строка")] = Истина;
	ПримитивныеТипы[Тип("Число")] = Истина;
	ПримитивныеТипы[Тип("Булево")] = Истина;
	ПримитивныеТипы[Тип("Дата")] = Истина;
	ПримитивныеТипы[Тип("Null")] = Истина;
	
	Возврат ПримитивныеТипы;
	
КонецФункции

Функция ТипыСериализуемыеОднойСтрокой()
	
	ТипыСериализуемыеОднойСтрокой = ПримитивныеТипы();
	ТипыСериализуемыеОднойСтрокой[Тип("ХранилищеЗначения")] = Истина;
	
	Возврат ТипыСериализуемыеОднойСтрокой;
	
КонецФункции

Функция ДанныеТипаОбъекта(ТипОбъекта, ПараметрыЗаписиXML)
	
	ДанныеТиповОбъектов = ПараметрыЗаписиXML.ДанныеТиповОбъектов;
	ДанныеТипаОбъекта = ДанныеТиповОбъектов[ТипОбъекта];
	Если ДанныеТипаОбъекта=Неопределено Тогда
		ДанныеТипаОбъекта = ПараметрыЗаписиXML.ОбщиеМодули.ОбщегоНазначенияКлиентСервер.ПолучитьДанныеТипаОбъекта(ТипОбъекта);
		ДанныеТиповОбъектов[ТипОбъекта] = ДанныеТипаОбъекта;
	КонецЕсли;
	
	Возврат ДанныеТипаОбъекта;
	
КонецФункции



Функция ПодготовитьОбъектыИЗначенияСвойствОбъектовДляЗаписи(ПараметрыЗаписиXML, знач Значение) Экспорт

	Перем ОбщегоНазначенияКлиентСервер, ОбщегоНазначенияВызовСервера, РаботаСКоллекциями;
	Перем Объект;
	
	ОбщегоНазначенияКлиентСервер = ПараметрыЗаписиXML.ОбщиеМодули.ОбщегоНазначенияКлиентСервер;
	ОбщегоНазначенияВызовСервера = ПараметрыЗаписиXML.ОбщиеМодули.ОбщегоНазначенияВызовСервера;
	РаботаСКоллекциями = ПараметрыЗаписиXML.ОбщиеМодули.РаботаСКоллекциями;
	
	СписокОбъектов = ПараметрыЗаписиXML.СписокОбъектов;
	СписокОбъектовСоответствие = ПараметрыЗаписиXML.СписокОбъектовСоответствие;
	СсылочнаяМодельДанных = ПараметрыЗаписиXML.СсылочнаяМодельДанных;
	ЗначенияОбъектов = ПараметрыЗаписиXML.ЗначенияОбъектов;
	ДанныеОбъектов = ПараметрыЗаписиXML.ДанныеОбъектов;
	ТаблицаСвойствОбъектов = ПараметрыЗаписиXML.ТаблицаСвойствОбъектов;
	ТаблицаСвойствПоОбъектам = ПараметрыЗаписиXML.ТаблицаСвойствПоОбъектам;
	Типы = ПараметрыЗаписиXML.Типы;
	ПримитивныеТипы = ПараметрыЗаписиXML.ПримитивныеТипы;
	ПоляТаблицыСвойств = ПараметрыЗаписиXML.ПоляТаблицыСвойств;
	ДанныеТиповОбъектов = ПараметрыЗаписиXML.ДанныеТиповОбъектов;
	
	ТипСоответствие = Типы["Соответствие"];
	ТипСтруктура = Типы["Структура"];
	ТипМассив = Типы["Массив"];
	ТипТаблицаЗначений = Типы["ТаблицаЗначений"];
	ТипСтрока = Типы["Строка"];
	ТипКвазиСсылкаИБ = Тип("СправочникСсылка.КвазиСсылки");
	МассивКвазиСсылок = Новый Массив;
	
	СписокОбъектов.Очистить();
	СписокОбъектов.Добавить(Значение);
	СписокОбъектовСоответствие.Очистить();
	СписокОбъектовСоответствие[Значение] = СписокОбъектов.Количество();
	
	ОбходОбъектов = РаботаСКоллекциями.СкопироватьМассив(СписокОбъектов);
	ОбработанныеОбъекты = Новый Соответствие;
	
	Для Каждого Объект Из ОбходОбъектов Цикл

		ТипОбъекта = ТипЗнч(Объект);

		////////////////////////////////////////////////
		Если ОбработанныеОбъекты[Объект] = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		ОбработанныеОбъекты[Объект] = Истина;
		
		////////////////////////////////////////////////
		ДанныеТипаОбъекта = ДанныеТиповОбъектов[ТипОбъекта];
		Если ДанныеТипаОбъекта=Неопределено Тогда
			ДанныеТипаОбъекта = ОбщегоНазначенияКлиентСервер.ПолучитьДанныеТипаОбъекта(ТипОбъекта);
			ДанныеТиповОбъектов[ТипОбъекта] = ДанныеТипаОбъекта;
		КонецЕсли;
		ЭтоТипОбъектаИБ = ДанныеТипаОбъекта.ЭтоТипОбъектаИБ;
		ЭтоТипСсылкиОбъектаИБ = ДанныеТипаОбъекта.ЭтоТипСсылкиОбъектаИБ;
		
		////////////////////////////////////////////////
		Если СсылочнаяМодельДанных Тогда
			ЭтоОбъектныйТип = ПримитивныеТипы[ТипОбъекта] <> Истина;
			
			Если ЭтоОбъектныйТип Тогда
				Если ТипОбъекта=ТипКвазиСсылкаИБ И Объект.Пустая() Тогда
					// пустая квази ссылка не указывает ни на одну реальную ссылку
					// и эквивалентно значению "Неопределено"
					ЭтоОбъектныйТип = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если ЭтоОбъектныйТип Тогда
				Если СписокОбъектовСоответствие[Объект] = Неопределено Тогда
					//это объектный тип, добавляем в очередь для выгрузки
					СписокОбъектов.Добавить(Объект);
					СписокОбъектовСоответствие[Объект] = СписокОбъектов.Количество();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		////////////////////////////////////////////////
		ЗначенияОбъекта = Новый Массив;
		ТаблицаСвойствОбъекта = Новый Массив;
		ДанныеОбъекта = Неопределено;
		Если ТипОбъекта = ТипТаблицаЗначений ИЛИ РаботаСКоллекциями.ЭтоКвазиТаблицаЗначений(Объект) Тогда
			СтрокиОбъекта = РаботаСКоллекциями.ПолучитьЭлементыКоллекции(Объект);
			КолонкиОбъекта = РаботаСКоллекциями.ПолучитьКолонкиКоллекции(Объект);
			Для Каждого СтрокаОбъекта Из СтрокиОбъекта Цикл
				Для Каждого ИмяКолонкиОбъекта Из КолонкиОбъекта Цикл
					ЗначениеОбъекта = СтрокаОбъекта[ИмяКолонкиОбъекта];
					ЗначенияОбъекта.Добавить(ЗначениеОбъекта);
				КонецЦикла;
			КонецЦикла;
		ИначеЕсли ТипОбъекта = ТипСтруктура Тогда
			Для Каждого ПолеОбъекта Из Объект Цикл
				ЗначенияОбъекта.Добавить(ПолеОбъекта.Значение);
			КонецЦикла;
		ИначеЕсли ТипОбъекта = ТипСоответствие Тогда
			Для Каждого ПолеОбъекта Из Объект Цикл
				ЗначенияОбъекта.Добавить(ПолеОбъекта.Ключ);
				ЗначенияОбъекта.Добавить(ПолеОбъекта.Значение);
			КонецЦикла;
		ИначеЕсли ТипОбъекта = ТипМассив Тогда
			ЗначенияОбъекта = Объект;
		ИначеЕсли ЭтоТипОбъектаИБ Тогда
			ПодготовитьЗначенияОбъектаИБДляЗаписи(Объект, ТаблицаСвойствОбъекта, ДанныеОбъекта, ПараметрыЗаписиXML);
		ИначеЕсли ТипОбъекта = ТипКвазиСсылкаИБ Тогда
			МассивКвазиСсылок.Добавить(Объект);
		КонецЕсли;
		
		ЗначенияОбъектов[Объект] = ЗначенияОбъекта;
		ДанныеОбъектов[Объект] = ДанныеОбъекта;
		
		ТаблицаСвойствПоОбъектам[Объект] = ТаблицаСвойствОбъекта;
		
		Для Каждого ЗначениеОбъекта Из ЗначенияОбъекта Цикл
			
			СвойствоОбъекта = Новый Структура(ПоляТаблицыСвойств);
			СвойствоОбъекта.Значение = ЗначениеОбъекта;
			ТаблицаСвойствОбъекта.Добавить(СвойствоОбъекта);
			
		КонецЦикла;
		
		Для Каждого СвойствоОбъекта Из ТаблицаСвойствОбъекта Цикл
			
			ТаблицаСвойствОбъектов.Добавить(СвойствоОбъекта);
			
			//добавим значение в обход, а там разберемся
			//сделано для универсальности, чтобы объекты и их подчиненные значения обрабатывались одним алгоритмом
			ОбходОбъектов.Добавить(СвойствоОбъекта.Значение);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПодготовитьДанныеКвазиСсылокИБДляЗаписи(МассивКвазиСсылок, ПараметрыЗаписиXML);
	
	ПреобразоватьЗначенияСвойствВСтрокиXML(ТаблицаСвойствОбъектов, ПараметрыЗаписиXML);
	
	ЗакодироватьСвойства(ТаблицаСвойствОбъектов, ПараметрыЗаписиXML);
	
КонецФункции

Функция ПреобразоватьЗначенияСвойствВСтрокиXML(ТаблицаСвойств, ПараметрыЗаписиXML) Экспорт

	Перем ОбщегоНазначенияКлиентСервер, ОбращенияКИСКлиентСервер;
	
	ОбщегоНазначенияКлиентСервер = ПараметрыЗаписиXML.ОбщиеМодули.ОбщегоНазначенияКлиентСервер;
	ОбращенияКИСКлиентСервер = ПараметрыЗаписиXML.ОбщиеМодули.ОбращенияКИСКлиентСервер;
	
	//////////////////////////////////////////////////////////////
	СписокОбъектовСоответствие = ПараметрыЗаписиXML.СписокОбъектовСоответствие;
	ЗначенияСвойствXML = Новый Массив;
	Результат = Новый Структура;
	ТипКвазиСсылка = Тип("СправочникСсылка.КвазиСсылки");
	ДанныеТиповОбъектов = ПараметрыЗаписиXML.ДанныеТиповОбъектов;
	ПримитивныеТипы = ПараметрыЗаписиXML.ПримитивныеТипы;
	
	Для Каждого Свойство Из ТаблицаСвойств Цикл
		
		ЗначениеСвойства = Свойство.Значение;
		ВложенныйОбъект = Ложь;
		
		СсылкаОбъекта = СписокОбъектовСоответствие[ЗначениеСвойства];
		
		Если СсылкаОбъекта <> Неопределено Тогда
			
			//ссылка на объект (в памяти)
			ИмяТипаЗначения = "Объект";
			ЗначениеСвойстваXML = СсылкаОбъекта;
			
		Иначе
			
			ТипЗначения = ТипЗнч(ЗначениеСвойства);
			ДанныеТипаЗначения = ДанныеТиповОбъектов[ТипЗначения];
			Если ДанныеТипаЗначения=Неопределено Тогда
				ДанныеТипаЗначения = ОбщегоНазначенияКлиентСервер.ПолучитьДанныеТипаОбъекта(ТипЗначения);
				ДанныеТиповОбъектов[ТипЗначения] = ДанныеТипаЗначения;
			КонецЕсли;
			
			Если ТипЗначения=ТипКвазиСсылка ИЛИ ОбращенияКИСКлиентСервер.ЭтоКвазиСсылка(ЗначениеСвойства) Тогда
				
				ИмяТипаЗначения = ЗначениеСвойства.ИмяТипа;
				Если ИмяТипаЗначения="" Тогда
					ИмяТипаЗначения = "Неопределено";
					ЗначениеСвойстваXML = Неопределено;
				Иначе
					ИмяТипаЗначения = СтрЗаменить(ИмяТипаЗначения, ".", "Ссылка.");
					ЗначениеСвойстваXML = ЗначениеСвойства.GUID;
				КонецЕсли;
				
			ИначеЕсли ДанныеТипаЗначения.ЭтоТипСсылкиОбъектаИБ Тогда
				
				ИмяТипаЗначения = ДанныеТипаЗначения.Имя;
				ЗначениеСвойстваXML = ЗначениеСвойства;
				
			ИначеЕсли ПримитивныеТипы[ТипЗначения]=Истина Тогда
				
				//простой тип
				ИмяТипаЗначения = ДанныеТипаЗначения.Имя;
				Если ИмяТипаЗначения <> Неопределено Тогда
					ЗначениеСвойстваXML = ЗначениеСвойства;
				Иначе
					ИмяТипаЗначения = "Неопределено";
					ЗначениеСвойстваXML = Неопределено;
				КонецЕсли;
				
			Иначе
				
				ИмяТипаЗначения = ДанныеТипаЗначения.Имя;
				Если ПараметрыЗаписиXML.СсылочнаяМодельДанных Тогда
					ЗначениеСвойстваXML = ЗначениеСвойства;
				Иначе
					ВложенныйОбъект = Истина;
					ЗначениеСвойстваXML = Неопределено;
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			СтрокаХML = XMLСтрока(ЗначениеСвойстваXML);
		Исключение
			СтрокаХML = Строка(ЗначениеСвойстваXML); //ну тогда просто строка :)
		КонецПопытки;
		
		Свойство.ИмяТипаЗначения = ИмяТипаЗначения;
		Свойство.ИмяТипаЗначенияЗакодированное = ИмяТипаЗначения;
		Свойство.ВложенныйОбъект = ВложенныйОбъект;
		Свойство.ЗначениеXML = ЗначениеСвойстваXML;
		Свойство.СтрокаXML = СтрокаХML;

	КонецЦикла;
	
КонецФункции

Функция ПодготовитьЗначенияОбъектаИБДляЗаписи(Объект, ТаблицаСвойствОбъекта, ДанныеОбъекта, ПараметрыЗаписиXML)

	СтруктураОбъекта = ПараметрыЗаписиXML.ОбщиеМодули.ОбщегоНазначенияВызовСервера.ПолучитьСтруктуруИзОбъекта(Объект);
	
	ПоляТаблицыСвойств = ПараметрыЗаписиXML.ПоляТаблицыСвойств;
	
	ТаблицаСвойствРеквизитовОбъектов = Новый Массив;
	ТаблицаСвойствТаблицОбъекта = Новый Массив;
	ТаблицаСвойствДополнительныхСтруктурОбъекта = Новый Массив;
	Для Каждого ЭлементРеквизит Из СтруктураОбъекта Цикл
		
		ИмяРеквизита = ЭлементРеквизит.Ключ;
		ЗначениеРеквизита = ЭлементРеквизит.Значение;
		
		Если ТипЗнч(ЗначениеРеквизита)=Тип("ТаблицаЗначений") Тогда
			
			ТаблицаОбъекта = ЗначениеРеквизита;

			ИменаКолонокТаблицы = Новый Массив;
			Для Каждого КолонкаТаблицы Из ТаблицаОбъекта.Колонки Цикл
				ИменаКолонокТаблицы.Добавить(КолонкаТаблицы.Имя);
			КонецЦикла;
			
			ТаблицаСвойствСтрокТаблицы = Новый Массив;
			Для Каждого СтрокаТаблицы Из ТаблицаОбъекта Цикл
				ТаблицаСвойствСтрокиТаблицы = Новый Массив;
				Для Каждого ИмяКолонкиТаблицы Из ИменаКолонокТаблицы Цикл
					СвойствоОбъекта = Новый Структура(ПоляТаблицыСвойств);
					СвойствоОбъекта.Имя = ИмяКолонкиТаблицы;
					СвойствоОбъекта.Значение = СтрокаТаблицы[ИмяКолонкиТаблицы];
					ТаблицаСвойствОбъекта.Добавить(СвойствоОбъекта);
					ТаблицаСвойствСтрокиТаблицы.Добавить(СвойствоОбъекта);
				КонецЦикла;
				ТаблицаСвойствСтрокТаблицы.Добавить(ТаблицаСвойствСтрокиТаблицы);
			КонецЦикла;
			
			ТаблицаСвойствТаблицыОбъекта = Новый Структура;
			ТаблицаСвойствТаблицыОбъекта.Вставить("Имя", ИмяРеквизита);
			ТаблицаСвойствТаблицыОбъекта.Вставить("ТаблицаСвойствСтрокТаблицы", ТаблицаСвойствСтрокТаблицы);
			ТаблицаСвойствТаблицОбъекта.Добавить(ТаблицаСвойствТаблицыОбъекта);
			
		ИначеЕсли ТипЗнч(ЗначениеРеквизита)=Тип("Структура") Тогда
			
			ДополнительнаяСтруктураОбъекта = ЗначениеРеквизита;
			
			ТаблицаСвойствЭлементовДополнительнойСтруктурыОбъекта = Новый Массив;
			Для Каждого ЭлементДополнительнойСтруктурыОбъекта Из ДополнительнаяСтруктураОбъекта Цикл
				СвойствоОбъекта = Новый Структура(ПоляТаблицыСвойств);
				СвойствоОбъекта.Имя = ЭлементДополнительнойСтруктурыОбъекта.Ключ;
				СвойствоОбъекта.Значение = ЭлементДополнительнойСтруктурыОбъекта.Значение;
				ТаблицаСвойствОбъекта.Добавить(СвойствоОбъекта);
				ТаблицаСвойствЭлементовДополнительнойСтруктурыОбъекта.Добавить(СвойствоОбъекта);
			КонецЦикла;
			
			ТаблицаСвойствДополнительнойСтруктурыОбъекта = Новый Структура;
			ТаблицаСвойствДополнительнойСтруктурыОбъекта.Вставить("Имя", ИмяРеквизита);
			ТаблицаСвойствДополнительнойСтруктурыОбъекта.Вставить("ТаблицаСвойствЭлементов", ТаблицаСвойствЭлементовДополнительнойСтруктурыОбъекта);
			
			ТаблицаСвойствДополнительныхСтруктурОбъекта.Добавить(ТаблицаСвойствДополнительнойСтруктурыОбъекта);

		Иначе
			
			СвойствоОбъекта = Новый Структура(ПоляТаблицыСвойств);
			СвойствоОбъекта.Имя = ИмяРеквизита;
			СвойствоОбъекта.Значение = ЗначениеРеквизита;
			ТаблицаСвойствОбъекта.Добавить(СвойствоОбъекта);
			ТаблицаСвойствРеквизитовОбъектов.Добавить(СвойствоОбъекта);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("ТаблицаСвойствРеквизитовОбъектов", ТаблицаСвойствРеквизитовОбъектов);
	ДанныеОбъекта.Вставить("ТаблицаСвойствТаблицОбъекта", ТаблицаСвойствТаблицОбъекта);
	ДанныеОбъекта.Вставить("ТаблицаСвойствДополнительныхСтруктурОбъекта", ТаблицаСвойствДополнительныхСтруктурОбъекта);
	
КонецФункции

Функция ПодготовитьДанныеКвазиСсылокИБДляЗаписи(МассивКвазиСсылок, ПараметрыЗаписиXML)
	
	Перем ОбщегоНазначенияВызовСервера;
	
	ДанныеОбъектов = ПараметрыЗаписиXML.ДанныеОбъектов;
	ОбщегоНазначенияВызовСервера = ПараметрыЗаписиXML.ОбщиеМодули.ОбщегоНазначенияВызовСервера;
	
	Если МассивКвазиСсылок.Количество() > 0 Тогда
		МассивДанныхКвазиСсылок = ОбщегоНазначенияВызовСервера.ПолучитьДанныеКвазиСсылокИБ(МассивКвазиСсылок, 2);
		
		Для Каждого ДанныеКвазиСсылки Из МассивДанныхКвазиСсылок Цикл
			ДанныеОбъектов[ДанныеКвазиСсылки.Ссылка] = ДанныеКвазиСсылки;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьОбъекты(ПараметрыЗаписиXML) Экспорт
	
	Перем Объект;
	
	СписокОбъектов = ПараметрыЗаписиXML.СписокОбъектов;

	Для НомерОбъекта=1 По СписокОбъектов.Количество() Цикл
		
		ПараметрыЗаписиXML.НомерОбъекта = НомерОбъекта;
		Объект = СписокОбъектов[НомерОбъекта-1];
		ЗаписатьОбъект(Объект, ПараметрыЗаписиXML);
		
	КонецЦикла;
	
КонецФункции

Функция ЗаписатьОбъект(Объект, ПараметрыЗаписиXML) Экспорт
	
	ЗаписатьНачалоОбъекта(Объект, ПараметрыЗаписиXML);
	ЗаписатьСодержимоеОбъекта(Объект, ПараметрыЗаписиXML);
	ЗаписатьКонецОбъекта(ПараметрыЗаписиXML);
	
КонецФункции

Функция ЗаписатьСодержимоеОбъекта(Объект, ПараметрыЗаписиXML) Экспорт
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ПараметрыЗаписиXML.ОбщиеМодули.РаботаСКоллекциями;
	
	ТипОбъекта = ТипЗнч(Объект);
	Типы = ПараметрыЗаписиXML.Типы;
	ТипКвазиСсылка = Тип("СправочникСсылка.КвазиСсылки");
	ДанныеТипаОбъекта = ДанныеТипаОбъекта(ТипОбъекта, ПараметрыЗаписиXML);
	
	Если ТипОбъекта = Тип("Структура") Тогда
		
		Если РаботаСКоллекциями.ЭтоКвазиТаблицаЗначений(Объект) Тогда
			ЗаписатьСодержимоеОбъектаТаблицаЗначенийКомпактная(Объект, ПараметрыЗаписиXML);
		Иначе
			ЗаписатьСодержимоеОбъектаСтруктура(Объект, ПараметрыЗаписиXML);
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("Соответствие") Тогда
		
		ЗаписатьСодержимоеОбъектаСоответствие(Объект, ПараметрыЗаписиXML);
		
	ИначеЕсли ТипОбъекта = Тип("Массив") Тогда
		
		ЗаписатьСодержимоеОбъектаМассивКомпактная(Объект, ПараметрыЗаписиXML);
		
	ИначеЕсли ТипОбъекта = Типы["ТаблицаЗначений"] Тогда
		
		ЗаписатьСодержимоеОбъектаТаблицаЗначенийКомпактная(Объект, ПараметрыЗаписиXML);
		
	ИначеЕсли ДанныеТипаОбъекта.ЭтоТипОбъектаИБ Тогда

		ЗаписатьСодержимоеОбъектаИБ(Объект, ПараметрыЗаписиXML);
		
	ИначеЕсли ТипОбъекта = ТипКвазиСсылка Тогда
		
		ЗаписатьСодержимоеОбъектаКвазиСсылкаИБ(Объект, ПараметрыЗаписиXML);
		
	ИначеЕсли ДанныеТипаОбъекта.ЭтоТипСсылкиОбъектаИБ Тогда
		
		ЗаписатьСодержимоеОбъектаСсылкаИБ(Объект, ПараметрыЗаписиXML);
		
	ИначеЕсли ТипОбъекта = Типы["УдалениеОбъекта"] Тогда
		
		ЗаписатьСодержимоеОбъектаУдалениеОбъекта(Объект, ПараметрыЗаписиXML);
		
	ИначеЕсли ТипОбъекта = Типы["ФормаКлиентскогоПриложения"] Тогда
		
		ЗаписатьСодержимоеОбъектаФормаКлиентскогоПриложения(Объект, ПараметрыЗаписиXML);
		
	//ИначеЕсли ТипОбъекта = Типы["ПолеФормы"] Тогда
	//	
	//	ЗаписатьСодержимоеОбъектаПолеФормы(Объект, ПараметрыЗаписиXML);
	//	
	ИначеЕсли ТипОбъекта = Типы["КнопкаФормы"] Тогда
		
		ЗаписатьСодержимоеОбъектаКнопкаФормы(Объект, ПараметрыЗаписиXML);
		
	ИначеЕсли ТипОбъекта = Типы["ОписаниеТипов"] Тогда
		
		ЗаписатьСодержимоеОбъектаОписаниеТипов(Объект, ПараметрыЗаписиXML);
		
	Иначе
		
		ЗаписатьСодержимоеОбъектаПроизвольный(Объект, ПараметрыЗаписиXML);
		
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаИБ(Объект, ПараметрыЗаписиXML)
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		ПараметрыЗаписиXML.ОбщиеМодули.РаботаСXMLСервер.ЗаписатьСодержимоеОбъектаИБ(Объект, ПараметрыЗаписиXML);
	#КонецЕсли
КонецФункции

Функция ЗаписатьСодержимоеОбъектаСсылкаИБ(Объект, ПараметрыЗаписиXML)

	Перем ОбщегоНазначенияКлиентСервер;
	
	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;

	ОбщегоНазначенияКлиентСервер = ПараметрыЗаписиXML.ОбщиеМодули.ОбщегоНазначенияКлиентСервер;
	
	ТипОбъекта = ТипЗнч(Объект);
	ДанныеТипаОбъекта = ПараметрыЗаписиXML.ДанныеТиповОбъектов[ТипОбъекта];
	Если ДанныеТипаОбъекта=Неопределено Тогда
		ДанныеТипаОбъекта = ОбщегоНазначенияКлиентСервер.ПолучитьДанныеТипаОбъекта(ТипОбъекта);
	КонецЕсли;
	ИмяТипа = ДанныеТипаОбъекта.Имя;

	ЗаписьXML.ЗаписатьАтрибут("Представление", Строка(Объект));
	Если Найти(ИмяТипа, "ПеречислениеСсылка.") = 1 Тогда
		ИдентификаторОбъекта = XMLСтрока(Объект);
	Иначе
		ИдентификаторОбъекта = Строка(Объект.УникальныйИдентификатор());
	КонецЕсли;
	ЗаписьXML.ЗаписатьТекст(ИдентификаторОбъекта);
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаКвазиСсылкаИБ(Объект, ПараметрыЗаписиXML)

	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;

	ДанныеКвазиСсылки = ПараметрыЗаписиXML.ДанныеОбъектов[Объект];
	
	Если ДанныеКвазиСсылки <> Неопределено Тогда
		Если ЗначениеЗаполнено(ДанныеКвазиСсылки.Имя) Тогда
			GUIDСтрока = ДанныеКвазиСсылки.Имя;
		Иначе
			GUIDСтрока = Строка(ДанныеКвазиСсылки.GUID);
		КонецЕсли;
		ЗаписьXML.ЗаписатьТекст(GUIDСтрока);
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаОписаниеТипов(ОписаниеТипов, ПараметрыЗаписиXML)

	Перем ОбщегоНазначенияКлиентСервер;
	
	ОбщегоНазначенияКлиентСервер = ПараметрыЗаписиXML.ОбщиеМодули.ОбщегоНазначенияКлиентСервер;
	
	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;

	Типы = ОписаниеТипов.Типы();
	Для Каждого Тип Из Типы Цикл
		ДанныеТипа = ОбщегоНазначенияКлиентСервер.ПолучитьДанныеТипаОбъекта(Тип);
		ИмяТипа = ДанныеТипа.Имя;

		ЗаписьXML.ЗаписатьНачалоЭлемента("Type");
		ЗаписьXML.ЗаписатьТекст(ИмяТипа);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	Если ОписаниеТипов.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.ДатаВремя Тогда
		КвалификаторыДаты = "ДатаВремя";
	ИначеЕсли ОписаниеТипов.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
		КвалификаторыДаты = "Время";
	ИначеЕсли ОписаниеТипов.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
		КвалификаторыДаты = "Дата";
	КонецЕсли;

	ЗаписьXML.ЗаписатьНачалоЭлемента("DateQualifiers");
	ЗаписьXML.ЗаписатьНачалоЭлемента("DateFractions");
	ЗаписьXML.ЗаписатьТекст(КвалификаторыДаты);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаСоответствие(Объект, ПараметрыЗаписиXML)

	ТаблицаСвойств = ПараметрыЗаписиXML.ТаблицаСвойствПоОбъектам[Объект];
	
	ЗаписатьСвойстваОбъекта(ТаблицаСвойств, ПараметрыЗаписиXML);

КонецФункции

Функция ЗаписатьСодержимоеОбъектаСтруктура(Объект, ПараметрыЗаписиXML)

	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ПараметрыЗаписиXML.ОбщиеМодули.РаботаСКоллекциями;
	
	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;
	ПоляТаблицыСвойств = ПараметрыЗаписиXML.ПоляТаблицыСвойств;
	
	ИменаКлючейМассив = Новый Массив;
	Для Каждого ПолеОбъекта Из Объект Цикл
		
		ИменаКлючейМассив.Добавить(ПолеОбъекта.Ключ);
		
	КонецЦикла;
	
	ИменаКлючей = РаботаСКоллекциями.МассивВСтроку(ИменаКлючейМассив);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ключи");
	ЗаписьXML.ЗаписатьТекст(ИменаКлючей);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ТаблицаСвойств = ПараметрыЗаписиXML.ТаблицаСвойствПоОбъектам[Объект];
	ЗаписатьСвойстваОбъекта(ТаблицаСвойств, ПараметрыЗаписиXML);
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаМассив(Объект, ПараметрыЗаписиXML)

	Для Каждого ЗначениеОбъекта Из Объект Цикл

		ЗаписатьСвойствоОбъекта("Элемент", ЗначениеОбъекта, ПараметрыЗаписиXML);
		
	КонецЦикла;
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаМассивКомпактная(Объект, ПараметрыЗаписиXML)

	ТаблицаСвойств = ПараметрыЗаписиXML.ТаблицаСвойствПоОбъектам[Объект];
	ЗаписатьСвойстваОбъекта(ТаблицаСвойств, ПараметрыЗаписиXML);
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаТаблицаЗначений(Объект, ПараметрыЗаписиXML)

	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ПараметрыЗаписиXML.ОбщиеМодули.РаботаСКоллекциями;

	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;

	ПоляКолонки = РаботаСКоллекциями.СтрокуВМассив("Имя, ТипЗначения, Заголовок, Ширина");
	Для Каждого Колонка Из Объект.Колонки Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Колонка");
		Для Каждого ПолеКолонки Из ПоляКолонки Цикл
			ЗаписатьСвойствоОбъекта(ПолеКолонки, Колонка[ПолеКолонки], ПараметрыЗаписиXML);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	ПоляСтроки = РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(Объект.Колонки, "Имя");
	Для Каждого Строки Из Объект Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Строка");
		Для Каждого ПолеСтроки Из ПоляСтроки Цикл
			ЗаписатьСвойствоОбъекта(ПолеСтроки, Строки[ПолеСтроки], ПараметрыЗаписиXML);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаТаблицаЗначенийКомпактная(Объект, ПараметрыЗаписиXML)

	Перем РаботаСКоллекциями;
	
	РК = ПараметрыЗаписиXML.ОбщиеМодули.РаботаСКоллекциями;
	ПоляТаблицыСвойств = ПараметрыЗаписиXML.ПоляТаблицыСвойств;

	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;

	ИменаКолонок = РК.ПолучитьКолонкиКоллекции(Объект);
	Если ПараметрыЗаписиXML.КолонкиТаблицЗначенийВыгружатьСписком Тогда
		СписокКолонок = РК.МассивВСтроку(ИменаКолонок);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Колонки");
		ЗаписьXML.ЗаписатьТекст(СписокКолонок);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	Иначе
		ПоляКолонки = Новый Структура("Имя, ТипЗначения, Заголовок, Ширина", , , "", 0);
		Для Каждого ИмяКолонки Из ИменаКолонок Цикл
			Колонка = Объект.Колонки[ИмяКолонки];
			ЗаполнитьЗначенияСвойств(ПоляКолонки, Колонка);
			ЗаписьXML.ЗаписатьНачалоЭлемента("Колонка");
			Для Каждого ПолеКолонки Из ПоляКолонки Цикл
				ЗаписатьСвойствоОбъекта(ПолеКолонки.Ключ, ПолеКолонки.Значение, ПараметрыЗаписиXML);
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаСвойств = ПараметрыЗаписиXML.ТаблицаСвойствПоОбъектам[Объект];
	ЗаписатьСвойстваОбъекта(ТаблицаСвойств, ПараметрыЗаписиXML);
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаКнопкаФормы(Объект, ПараметрыЗаписиXML)
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаПолеФормы(Объект, ПараметрыЗаписиXML)
	
	ПоляТаблицыСвойств = ПараметрыЗаписиXML.ПоляТаблицыСвойств;
	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;
	РаботаСКоллекциями = ПараметрыЗаписиXML.ОбщиеМодули.РаботаСКоллекциями;
	
	ИменаСвойств = Новый Массив;
	РаботаСКоллекциями.ДобавитьЭлементыКоллекции(ИменаСвойств, "Имя, Вид");
	
	ТаблицаСвойств = Новый Массив;
	Для Каждого ИмяСвойства Из ИменаСвойств Цикл
		СтрокаСвойства = Новый Структура(ПоляТаблицыСвойств);
		СтрокаСвойства.Имя = ИмяСвойства;
		СтрокаСвойства.Значение = Объект[ИмяСвойства];
		ТаблицаСвойств.Добавить(СтрокаСвойства);
	КонецЦикла;
	
	ПреобразоватьЗначенияСвойствВСтрокиXML(ТаблицаСвойств, ПараметрыЗаписиXML);
	
	ЗаписатьСвойстваОбъекта(ТаблицаСвойств, ПараметрыЗаписиXML);
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаФормаКлиентскогоПриложения(Объект, ПараметрыЗаписиXML)
	
	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;
	
	ТаблицаЭлементовФормы = ПараметрыЗаписиXML.ТаблицаСвойствПоОбъектам[Объект];
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Элементы");
	ЗаписатьСвойстваОбъекта(ТаблицаЭлементовФормы, ПараметрыЗаписиXML);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецФункции

Функция ЗаписатьКодировкуЗначений(ИмяКодировки, Кодировка, ПараметрыЗаписиXML)
	
	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяКодировки);
	Для Каждого ЗакодированноеЗначение Из Кодировка Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента(ЗакодированноеЗначение.Значение);
		ЗаписьXML.ЗаписатьТекст(ЗакодированноеЗначение.Ключ);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецФункции

Функция ПолучитьКодировкуЗначений(Значения, ПараметрыЗаписиXML)
	
	Буквы = ПараметрыЗаписиXML.СимволыКодировкиЗначений;
	Разрядность = Буквы.Количество();
	КодировкаЗначений = Новый Соответствие;
	
	Для НомерЗначения=0 По Значения.ВГраница() Цикл
		Остаток = НомерЗначения;
		КодЗначения = "";
		Пока Истина Цикл
			Разряд = Остаток % Разрядность;
			Буква = Буквы[Разряд];
			КодЗначения = Буква + КодЗначения;
			Остаток = Цел(Остаток / Разрядность);
			Если Остаток = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Значение = Значения[НомерЗначения];
		
		КодировкаЗначений[Значение] = КодЗначения;
	КонецЦикла;
	
	Возврат КодировкаЗначений;
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаУдалениеОбъекта(Объект, ПараметрыЗаписиXML)
	
	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;
	
	ИмяТипаОбъекта = ПараметрыЗаписиXML.ОбщиеМодули.ОбщегоНазначенияВызовСервера.ПолучитьИмяТипаЗначения(Объект.Ссылка);
	СсылкаНаОбъектСтрокаXML = Строка(Объект.Ссылка.УникальныйИдентификатор());
	
	ЗаписьXML.ЗаписатьАтрибут("ТипОбъекта", ИмяТипаОбъекта);
	ЗаписьXML.ЗаписатьАтрибут("СсылкаНаОбъект", СсылкаНаОбъектСтрокаXML);
	
КонецФункции

Функция ЗаписатьСодержимоеОбъектаПроизвольный(Объект, ПараметрыЗаписиXML)
	
	ТипОбъекта = ТипЗнч(Объект);
	
	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;
	ТипДанныхXML = СериализаторXDTO.XMLТип(ТипОбъекта);
	Если ТипДанныхXML <> Неопределено Тогда
		
		Если ПараметрыЗаписиXML.ТипыСериализуемыеОднойСтрокой[ТипОбъекта]=Истина Тогда
			ТекстОбъекта = СериализаторXDTO.XMLСтрока(Объект);
			ЗаписьXML.ЗаписатьТекст(ТекстОбъекта);
		Иначе
			Если ПараметрыЗаписиXML.СсылочнаяМодельДанных Тогда
				// ссылочная модель добавляет в тэг объекта дополнительные служебные атрибуты "Номер" и "Тип"
				// обернем дополнительным тэгом без этих служебных атрибутов для корректного последующего чтения
				ЗаписьXML.ЗаписатьНачалоЭлемента("Значение");
				СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Объект, НазначениеТипаXML.Неявное, ФормаXML.Текст);
				ЗаписьXML.ЗаписатьКонецЭлемента();
			Иначе
				СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Объект, НазначениеТипаXML.Неявное, ФормаXML.Текст);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		ЗаписьXML.ЗаписатьТекст(Строка(Объект));
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьНачалоОбъекта(Объект, ПараметрыЗаписиXML, ИмяТипа=Неопределено) Экспорт

	Перем ОбщегоНазначенияКлиентСервер;
	
	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;
	
	Если ИмяТипа = Неопределено Тогда
		ТипОбъекта = ТипЗнч(Объект);
		
		Если ТипОбъекта=Тип("СправочникСсылка.КвазиСсылки") Тогда
			// В качестве типа используем тип реального объекта
			ДанныеКвазиСсылки = ПараметрыЗаписиXML.ДанныеОбъектов[Объект];
			Если ДанныеКвазиСсылки <> Неопределено Тогда
				ИмяТипа = ДанныеКвазиСсылки.ИмяТипа;
				ИмяТипа = СтрЗаменить(ИмяТипа, ".", "Ссылка.");
			Иначе
				ИмяТипа = "Неопределено";
			КонецЕсли;
		Иначе
			ДанныеТипаОбъекта = ПараметрыЗаписиXML.ДанныеТиповОбъектов[ТипОбъекта];
			Если ДанныеТипаОбъекта=Неопределено Тогда
				ДанныеТипаОбъекта = ПараметрыЗаписиXML.ОбщиеМодули.ОбщегоНазначенияКлиентСервер.ПолучитьДанныеТипаОбъекта(ТипОбъекта);
				ПараметрыЗаписиXML.ДанныеТиповОбъектов[ТипОбъекта] = ДанныеТипаОбъекта;
			КонецЕсли;
			ИмяТипа = ДанныеТипаОбъекта.Имя;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыЗаписиXML.СсылочнаяМодельДанных Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
		ЗаписьXML.ЗаписатьАтрибут("Номер", Строка(ПараметрыЗаписиXML.НомерОбъекта));
		ЗаписьXML.ЗаписатьАтрибут("Тип", ИмяТипа);
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяТипа);
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьКонецОбъекта(ПараметрыЗаписиXML) Экспорт
	
	ПараметрыЗаписиXML.ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецФункции

Функция ЗаписатьСвойствоОбъекта(ИмяСвойства, ЗначениеСвойства, ПараметрыЗаписиXML) Экспорт
	
	ТаблицаСвойств = ПараметрыЗаписиXML.Оптимизация_ТаблицаСвойствДляЗаписи;
	СвойствоОбъекта = ТаблицаСвойств[0];
	СвойствоОбъекта.Имя = ИмяСвойства;
	СвойствоОбъекта.Значение = ЗначениеСвойства;
	СвойствоОбъекта.ИмяТипаЗначения = Неопределено;
	ПреобразоватьЗначенияСвойствВСтрокиXML(ТаблицаСвойств, ПараметрыЗаписиXML);
	
	ЗаписатьСвойстваОбъекта(ТаблицаСвойств, ПараметрыЗаписиXML);
	
КонецФункции

Функция ЗаписатьСвойстваОбъекта(ТаблицаСвойств, ПараметрыЗаписиXML) Экспорт
	
	Если ТаблицаСвойств.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗаписьXML = ПараметрыЗаписиXML.ЗаписьXML;
	
	Для Каждого Свойство Из ТаблицаСвойств Цикл
		
		ИмяСвойства = Свойство.Имя;
		ИмяТипаЗначенияЗакодированное = Свойство.ИмяТипаЗначенияЗакодированное;

		Если ИмяСвойства=Неопределено Тогда
			// в качестве имени свойства запишем тип значения
			ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяТипаЗначенияЗакодированное);
		Иначе
			// в качестве имени свойства запишем переданное имя,
			// а тип запишем отдельным атрибутом
			ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяСвойства);
			ЗаписьXML.ЗаписатьАтрибут("Тип", ИмяТипаЗначенияЗакодированное);
		КонецЕслИ;
		
		Если Свойство.ВложенныйОбъект Тогда
			ЗаписатьСодержимоеОбъекта(Свойство.Значение, ПараметрыЗаписиXML);
		Иначе
			ЗаписьXML.ЗаписатьТекст(Свойство.СтрокаXML);
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
КонецФункции

Функция ЗакодироватьСвойства(ТаблицаСвойств, ПараметрыЗаписиXML)
	
	Если ПараметрыЗаписиXML.КодироватьСтроковыеЗначения Тогда
		ЗакодироватьСтроковыеЗначенияСвойств(ТаблицаСвойств, ПараметрыЗаписиXML);
	КонецЕсли;
	
	Если ПараметрыЗаписиXML.КодироватьИменаТипов Тогда
		ЗакодироватьТипыСвойств(ТаблицаСвойств, ПараметрыЗаписиXML);
	КонецЕсли;
	
КонецФункции

Функция ЗакодироватьСтроковыеЗначенияСвойств(ТаблицаСвойств, ПараметрыЗаписиXML)

	РК = ПараметрыЗаписиXML.ОбщиеМодули.РаботаСКоллекциями;

	СтроковыеЗначения = Новый Соответствие;
	СтроковыеСвойства = Новый Массив;
	
	Для Каждого Свойство Из ТаблицаСвойств Цикл
		Если Свойство.ИмяТипаЗначения="Строка" Тогда
			ЗначениеСвойства = Свойство.Значение;
			Если ЗначениеСвойства <> "" Тогда
				КоличествоИспользований = СтроковыеЗначения[ЗначениеСвойства];
				Если КоличествоИспользований=Неопределено Тогда
					СтроковыеЗначения[ЗначениеСвойства] = 1;
				Иначе
					СтроковыеЗначения[ЗначениеСвойства] = КоличествоИспользований + 1;
				КонецЕсли;
				
				СтроковыеСвойства.Добавить(Свойство);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СтроковыеЗначенияЧастые = Новый Массив;
	Для Каждого СтроковоеЗначение Из СтроковыеЗначения Цикл
		Количество = СтроковоеЗначение.Значение;
		Если СтроковоеЗначение.Значение > 2 Тогда
			Значение = СтроковоеЗначение.Ключ;
			СтроковыеЗначенияЧастые.Добавить(Новый Структура("Значение, Количество", Значение, Количество));
		КонецЕсли;
	КонецЦикла;
	РК.СортироватьКоллекцию(СтроковыеЗначенияЧастые, "Количество УБЫВ");
	СтроковыеЗначенияЧастыеМассив = РК.ВыгрузитьЗначенияКолонокКоллекции(СтроковыеЗначенияЧастые, "Значение");
	
	КодировкаСтроковыхЗначений = ПолучитьКодировкуЗначений(СтроковыеЗначенияЧастыеМассив, ПараметрыЗаписиXML);
	
	Для Каждого СтроковоеСвойство Из СтроковыеСвойства Цикл
		КодСтроки = КодировкаСтроковыхЗначений[СтроковоеСвойство.Значение];
		Если КодСтроки <> Неопределено Тогда
			СтроковоеСвойство.ИмяТипаЗначения = "ЗакодированнаяСтрока";
			СтроковоеСвойство.ЗначениеXML = КодСтроки;
			СтроковоеСвойство.СтрокаXML = КодСтроки;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЗаписиXML.КодировкаСтроковыхЗначений = КодировкаСтроковыхЗначений;
		
КонецФункции

Функция ЗакодироватьТипыСвойств(ТаблицаСвойств, ПараметрыЗаписиXML)

	РК = ПараметрыЗаписиXML.ОбщиеМодули.РаботаСКоллекциями;

	ЗарегистрированныеТипы = Новый Массив;
	ЗарегистрированныеТипыСписокПоиска = Новый Соответствие;
	
	Для Каждого Свойство Из ТаблицаСвойств Цикл
		ИмяТипаЗначения = Свойство.ИмяТипаЗначения;
		ЗарегистрированныйТип = ЗарегистрированныеТипыСписокПоиска[ИмяТипаЗначения];
		Если ЗарегистрированныйТип = Неопределено Тогда
			ЗарегистрированныйТип = Новый Структура;
			ЗарегистрированныйТип.Вставить("Имя", ИмяТипаЗначения);
			ЗарегистрированныйТип.Вставить("КоличествоЗначений", 0);
			ЗарегистрированныеТипы.Добавить(ЗарегистрированныйТип);
			ЗарегистрированныеТипыСписокПоиска[ИмяТипаЗначения] = ЗарегистрированныйТип;
		КонецЕсли;

		ЗарегистрированныйТип.КоличествоЗначений = ЗарегистрированныйТип.КоличествоЗначений + 1;
	КонецЦикла;

	РК.СортироватьКоллекцию(ЗарегистрированныеТипы, "КоличествоЗначений УБЫВ");
	ИменаЗарегистрированныхТипов = РК.ВыгрузитьЗначенияКолонокКоллекции(ЗарегистрированныеТипы, "Имя");
	КодировкаИменТипов = ПолучитьКодировкуЗначений(ИменаЗарегистрированныхТипов, ПараметрыЗаписиXML);
	
	Для Каждого Свойство Из ТаблицаСвойств Цикл
		Свойство.ИмяТипаЗначенияЗакодированное = КодировкаИменТипов[Свойство.ИмяТипаЗначения];
	КонецЦикла;
	
	ПараметрыЗаписиXML.КодировкаИменТипов = КодировкаИменТипов;
		
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////
Функция ПрочитатьXMLУлучшенная(ЧтениеXML) Экспорт
	
	ТекстXML = ПрочитатьТекстТекущегоУзлаXML(ЧтениеXML, Ложь);
	Возврат ПрочитатьТекстXMLУлучшенная(ТекстXML);

КонецФункции

Функция ПрочитатьТекстXMLУлучшенная(ТекстXML) Экспорт
	
	Перем ОбщегоНазначенияКлиентСервер;
	
	Заголовок = "<СериализацияОбъекта>";
	Если Не (ТипЗнч(ТекстXML) = Тип("Строка") И Лев(ТекстXML, СтрДлина(Заголовок)) = Заголовок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЧтенияXML = ПолучитьПараметрыЧтенияXML();
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	ОбщиеМодули = ПараметрыЧтенияXML.ОбщиеМодули;
	СписокОбъектов = ПараметрыЧтенияXML.СписокОбъектов;
	
	ОбщегоНазначенияКлиентСервер = ОбщиеМодули.ОбщегоНазначенияКлиентСервер;
	
	РаботаНаКлиенте = ОбщегоНазначенияКлиентСервер.ЭтоКлиент();
	
	//создание объектов без заполнения
	//для возможности ссылок на них другими объектами
	ЧтениеXML.УстановитьСтроку(ТекстXML);
	ЧтениеXML.Прочитать(); //чтение заголовка
	
	ЧтениеXML.Прочитать();

	//чтение кодировки строковых значений
	ПараметрыЧтенияXML.КодировкаСтроковыхЗначений = ПрочитатьКодировкуСтроковыхЗначений(ПараметрыЧтенияXML);

 	//чтение кодировки имен типов
 	ПараметрыЧтенияXML.КодировкаИменТипов = ПрочитатьКодировкуИменТипов(ПараметрыЧтенияXML);
	
	ПрочитатьОбъекты(ПараметрыЧтенияXML);
	ЧтениеXML.Закрыть();
	
	Если ПараметрыЧтенияXML.СсылочнаяМодельДанных Тогда
		//заполнение свойств уже созданных объектов
		ЧтениеXML.УстановитьСтроку(ТекстXML);
		ЧтениеXML.Прочитать(); // чтение заголовка
		ЧтениеXML.Прочитать(); // чтение первого узла
		ПерейтиКСвойствамОбъектов(ПараметрыЧтенияXML);
		ПрочитатьСвойстваОбъектов(ПараметрыЧтенияXML);
		ЧтениеXML.Закрыть();
	КонецЕсли;
	
	Возврат ПараметрыЧтенияXML.Значение;

КонецФункции

Функция ПолучитьПараметрыЧтенияXML() Экспорт

	Перем ОбщегоНазначенияКлиентСервер;
	
	ОбщиеМодули = ПолучитьОбщиеМодули();
	
	ОбщегоНазначенияКлиентСервер = ОбщиеМодули.ОбщегоНазначенияКлиентСервер;
	
	РаботаНаКлиенте = ОбщегоНазначенияКлиентСервер.ЭтоКлиент();
	
	ЧтениеXML = Новый ЧтениеXML;
	СписокОбъектов = Новый Массив;
	Типы = Новый Соответствие;
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		Типы["УдалениеОбъекта"] = Тип("УдалениеОбъекта");
		Типы["СправочникОбъект.КвазиСсылки"] = Тип("СправочникОбъект.КвазиСсылки");
		Типы["ТаблицаЗначений"] = Тип("ТаблицаЗначений");
	#КонецЕсли
	
	ОбщегоНазначенияКлиентСервер.ПолучитьДанныеТипаОбъекта(Тип("Неопределено"));

	ДанныеТиповОбъектов = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПриложения()["ДанныеТиповОбъектов"];
	
	ПараметрыЧтенияXML = Новый Структура;
	ПараметрыЧтенияXML.Вставить("ЧтениеXML", ЧтениеXML);
	ПараметрыЧтенияXML.Вставить("Значение");
	ПараметрыЧтенияXML.Вставить("СписокОбъектов", СписокОбъектов);
	ПараметрыЧтенияXML.Вставить("Типы", Типы);
	ПараметрыЧтенияXML.Вставить("ТипыСериализуемыеОднойСтрокой", ТипыСериализуемыеОднойСтрокой());
	ПараметрыЧтенияXML.Вставить("ОбщиеМодули", ОбщиеМодули);
	ПараметрыЧтенияXML.Вставить("РаботаНаКлиенте", РаботаНаКлиенте);
	ПараметрыЧтенияXML.Вставить("ДанныеТиповОбъектов", ДанныеТиповОбъектов);
	ПараметрыЧтенияXML.Вставить("КодировкаСтроковыхЗначений", Новый Соответствие);
	ПараметрыЧтенияXML.Вставить("КодировкаИменТипов", Новый Соответствие);
	ПараметрыЧтенияXML.Вставить("СсылочнаяМодельДанных", Ложь);
	ПараметрыЧтенияXML.Вставить("ТаблицаДанныхСсылокОбъектовИБ", Новый Массив);
	
	Возврат ПараметрыЧтенияXML;
	
КонецФункции

Функция ПрочитатьОбъекты(ПараметрыЧтенияXML)
	
	Перем ОбщегоНазначенияВызовСервера;
	
	ОбщегоНазначенияВызовСервера = ПараметрыЧтенияXML.ОбщиеМодули.ОбщегоНазначенияВызовСервера;
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;

	Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		
		ПараметрыЧтенияXML.Значение = ПрочитатьОбъект(ПараметрыЧтенияXML);
		
		Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
			
			ПрочитатьОбъект(ПараметрыЧтенияXML);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаДанныхСсылокОбъектовИБ = ПараметрыЧтенияXML.ТаблицаДанныхСсылокОбъектовИБ;
	Если ТаблицаДанныхСсылокОбъектовИБ.Количество() > 0 Тогда
		СписокОбъектов = ПараметрыЧтенияXML.СписокОбъектов;
		МассивСсылок = ОбщегоНазначенияВызовСервера.ПолучитьСсылкиОбъектовИБ(ТаблицаДанныхСсылокОбъектовИБ);
		Для НомерСсылки=0 По МассивСсылок.Количество()-1 Цикл
			СписокОбъектов[ТаблицаДанныхСсылокОбъектовИБ[НомерСсылки].НомерОбъекта] = МассивСсылок[НомерСсылки];
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция ПрочитатьОбъект(ПараметрыЧтенияXML) Экспорт
	
	Перем ОбщегоНазначенияКлиентСервер, ОбщегоНазначенияСервер, ОбщегоНазначенияВызовСервера, РаботаСКоллекциями;
	
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	СписокОбъектов = ПараметрыЧтенияXML.СписокОбъектов;
	
	Если ЧтениеXML.Имя="Объект" Тогда
		НомерОбъектаСтрока = ЧтениеXML.ПолучитьАтрибут("Номер");
		Если НомерОбъектаСтрока <> Неопределено Тогда
			НомерОбъекта = Число(НомерОбъектаСтрока);
			ПараметрыЧтенияXML.СсылочнаяМодельДанных = Истина;
		КонецЕсли;
	КонецЕсли;
	
	КодТипаОбъекта = ЧтениеXML.ПолучитьАтрибут("Тип");
	Если КодТипаОбъекта=Неопределено Тогда
		КодТипаОбъекта = ЧтениеXML.Имя;
	КонецЕсли;
	
	ИмяТипаОбъекта = ПараметрыЧтенияXML.КодировкаИменТипов[КодТипаОбъекта];
	Если ИмяТипаОбъекта=Неопределено Тогда
		ИмяТипаОбъекта = КодТипаОбъекта;
	КонецЕсли;
	
	Если ИмяТипаОбъекта="Объект" И НомерОбъекта=Неопределено Тогда
		
		// это ссылка на объект, номер объекта внутри тэга
		ЧтениеXML.Прочитать(); //перейдем к тексту элемента
		Если ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
			СтрокаXML = ЧтениеXML.Значение;
			ЧтениеXML.Прочитать(); // перейдем к концу элемента
		Иначе
			СтрокаXML = "";
		КонецЕсли;
		ЧтениеXML.Прочитать(); //пройдем конец элемента
		
		НомерОбъектаПоСсылке = Число(СтрокаXML);
		ОбъектПоСсылке = СписокОбъектов[НомерОбъектаПоСсылке-1];
		Возврат ОбъектПоСсылке;
		
	ИначеЕсли ИмяТипаОбъекта = "ЗакодированнаяСтрока" Тогда
		
		ЧтениеXML.Прочитать(); //перейдем к тексту элемента
		Если ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
			СтрокаXML = ЧтениеXML.Значение;
			ЧтениеXML.Прочитать(); // перейдем к концу элемента
		Иначе
			СтрокаXML = "";
		КонецЕсли;
		ЧтениеXML.Прочитать(); //пройдем конец элемента
		
		Строка = ПараметрыЧтенияXML.КодировкаСтроковыхЗначений[СтрокаXML];
		Возврат Строка;
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////
	РаботаНаКлиенте = ПараметрыЧтенияXML.РаботаНаКлиенте;
	ТипыСериализуемыеОднойСтрокой = ПараметрыЧтенияXML.ТипыСериализуемыеОднойСтрокой;
	
	РаботаСКоллекциями = ПараметрыЧтенияXML.ОбщиеМодули.РаботаСКоллекциями;
	ОбщегоНазначенияКлиентСервер = ПараметрыЧтенияXML.ОбщиеМодули.ОбщегоНазначенияКлиентСервер;
	ОбщегоНазначенияСервер = ПараметрыЧтенияXML.ОбщиеМодули.ОбщегоНазначенияСервер;
	ОбщегоНазначенияВызовСервера = ПараметрыЧтенияXML.ОбщиеМодули.ОбщегоНазначенияВызовСервера;

	ДанныеТиповОбъектов = ПараметрыЧтенияXML.ДанныеТиповОбъектов;
	ДанныеТипаОбъекта = ДанныеТиповОбъектов[ИмяТипаОбъекта];
	Если ДанныеТипаОбъекта=Неопределено Тогда
		ДанныеТипаОбъекта = ОбщегоНазначенияКлиентСервер.ПолучитьДанныеТипаОбъекта(ИмяТипаОбъекта);
		ДанныеТиповОбъектов[ИмяТипаОбъекта] = ДанныеТипаОбъекта;
	КонецЕсли;
	ЭтоТипОбъектаИБ = ДанныеТипаОбъекта.ЭтоТипОбъектаИБ;
	ЭтоТипСсылкиОбъектаИБ = ДанныеТипаОбъекта.ЭтоТипСсылкиОбъектаИБ;
	
	ТипыДанныхОбрабатываемыеНеСтандартно = Новый Соответствие;
	ТипыДанныхОбрабатываемыеНеСтандартно["Структура"] = Истина;
	ТипыДанныхОбрабатываемыеНеСтандартно["Массив"] = Истина;
	ТипыДанныхОбрабатываемыеНеСтандартно["Соответствие"] = Истина;
	ТипыДанныхОбрабатываемыеНеСтандартно["ТаблицаЗначений"] = Истина;
	
	ОбъектПрочитан = Ложь;
	Если ЭтоТипОбъектаИБ Тогда
		Если Не РаботаНаКлиенте Тогда
			НовыйОбъект = ОбщегоНазначенияСервер.ПолучитьОбъектИБ(ИмяТипаОбъекта, ЧтениеXML.ПолучитьАтрибут("Ссылка"), ЧтениеXML.ПолучитьАтрибут("ЭтоГруппа"));
		КонецЕсли;
	ИначеЕсли ЭтоТипСсылкиОбъектаИБ Тогда
		Представление = ЧтениеXML.ПолучитьАтрибут("Представление");
		СтрокаXML = ПрочитатьТекстТекущегоУзлаXMLВнутри(ЧтениеXML);
		
		Если НомерОбъекта <> Неопределено Тогда
			ПараметрыЧтенияXML.ТаблицаДанныхСсылокОбъектовИБ.Добавить(Новый Структура("ТипОбъекта, GUID, Представление, НомерОбъекта", ИмяТипаОбъекта, СтрокаXML, Представление, НомерОбъекта-1));
		Иначе
			НовыйОбъект = ОбщегоНазначенияВызовСервера.ПолучитьСсылкуОбъектаИБ(ИмяТипаОбъекта, СтрокаXML, Представление);
		КонецЕсли;
		
		ОбъектПрочитан = Истина;
	Иначе
		Если ИмяТипаОбъекта = "УдалениеОбъекта" Тогда
			
			НовыйОбъект = ПрочитатьУдалениеОбъекта(ПараметрыЧтенияXML);
			ОбъектПрочитан = Истина;
			
		ИначеЕсли ИмяТипаОбъекта = "ТаблицаЗначений" И РаботаНаКлиенте Тогда
			
			//а где таблица значений?! - Я за неё!
			НовыйОбъект = РаботаСКоллекциями.НоваяКвазиТаблицаЗначений();
			
		ИначеЕсли ИмяТипаОбъекта = "ОписаниеТипов" ИЛИ ИмяТипаОбъекта = "TypeDescription" Тогда

			ЧтениеXML.Прочитать();
			НовыйОбъект = ОписаниеТиповИзСтруктурыОписания(ПрочитатьСвойстваОписанияТиповИзXML(ЧтениеXML));
			ЧтениеXML.Прочитать();
			
			ОбъектПрочитан = Истина;
			
		ИначеЕсли ТипыДанныхОбрабатываемыеНеСтандартно[ИмяТипаОбъекта] = Истина Тогда
			
			НовыйОбъект = Новый(ИмяТипаОбъекта);
			
		Иначе
			
			Попытка
				ТипОбъекта = Тип(ИмяТипаОбъекта);
			Исключение
				ТипОбъекта = Неопределено;
			КонецПопытки;
			
			Если ТипОбъекта <> Неопределено Тогда
				
				Если СериализаторXDTO.XMLТип(ТипОбъекта) <> Неопределено Тогда
						
					//обработка стандартным сериализатором
					Если ТипыСериализуемыеОднойСтрокой[ТипОбъекта]=Истина Тогда
						
						ЧтениеXML.Прочитать(); //перейдем к тексту элемента
						Если ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
							СтрокаXML = ЧтениеXML.Значение;
							ЧтениеXML.Прочитать(); // перейдем к концу элемента
						Иначе
							СтрокаXML = "";
						КонецЕсли;
						ЧтениеXML.Прочитать(); //пройдем конец элемента
						ОбъектПрочитан = Истина;

						Попытка
							НовыйОбъект = СериализаторXDTO.XMLЗначение(ТипОбъекта, СтрокаXML);
						Исключение
							ИнформацияОбОшибке = ИнформацияОбОшибке();
						КонецПопытки;
						
					Иначе
						
						Если ПараметрыЧтенияXML.СсылочнаяМодельДанных Тогда
							ЧтениеXML.Прочитать(); // перейдем к дополнительному тэгу
							Если НЕ (ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя="Значение") Тогда
								// чето нето
								ВызватьИсключение "Ошибка чтения XML (" + ИмяТипаОбъекта + ")";
							КонецЕсли;
						КонецЕсли;
						
						Попытка
							НовыйОбъект = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъекта);
							ОбъектПрочитан = Истина;
						Исключение
							ИнформацияОбОшибке = ИнформацияОбОшибке();
						КонецПопытки;
						
						Если ПараметрыЧтенияXML.СсылочнаяМодельДанных Тогда
							Если ОбъектПрочитан Тогда
								ЧтениеXML.Прочитать(); //пройдем конец элемента
							Иначе
								ЧтениеXML.Пропустить(); // пропустим дополнительный тэг
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				ИначеЕсли ДанныеТипаОбъекта.ЭтоПеречисление Тогда
					
					// используется также для перечислений не из конфигурации базы,
					// например, системное перечисление "ВидГруппыФормы" со значениями свойства "Вид" у элемента формы
					ЧтениеXML.Прочитать(); //перейдем к тексту элемента
					Если ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
						СтрокаXML = ЧтениеXML.Значение;
						ЧтениеXML.Прочитать(); // перейдем к концу элемента
					Иначе
						СтрокаXML = "";
					КонецЕсли;
					ЧтениеXML.Прочитать(); //пройдем конец элемента

					ИмяЗначения = ВРЕГ(СтрокаXML);
					НовыйОбъект = ДанныеТипаОбъекта.СоответствиеЗначенийПоИмени[ИмяЗначения];
					ОбъектПрочитан = Истина;
					
				Иначе
					
					ЧтениеXML.Прочитать(); //перейдем к тексту элемента
					Если ЧтениеXML.ТипУзла=ТипУзлаXML.Текст Тогда
						СтрокаXML = ЧтениеXML.Значение;
						ЧтениеXML.Прочитать(); // перейдем к концу элемента
					Иначе
						СтрокаXML = "";
					КонецЕсли;
					ЧтениеXML.Прочитать(); //пройдем конец элемента
					ОбъектПрочитан = Истина;
					
					Попытка
						НовыйОбъект = XMLЗначение(ТипОбъекта, СтрокаXML);
					Исключение
						ИнформацияОбОшибке = ИнформацияОбОшибке();
					КонецПопытки;
					
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

	Если НомерОбъекта <> Неопределено Тогда
		
		// добавим объект в список объектов для возможности ссылаться на них в свойствах других объектов
		Пока СписокОбъектов.Количество() < НомерОбъекта Цикл
			СписокОбъектов.Добавить(Неопределено);
		КонецЦикла;
		
		СписокОбъектов[НомерОбъекта-1] = НовыйОбъект;
		
	Иначе

		Если Не ОбъектПрочитан И НовыйОбъект <> Неопределено Тогда
			// читаем свойства объекта сразу, не дожидаясь создания других объектов так,
			// как ссылочность не используется
			ПрочитатьСвойстваОбъекта(НовыйОбъект, ПараметрыЧтенияXML);
			ОбъектПрочитан = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ОбъектПрочитан Тогда
		ЧтениеXML.Пропустить(); //перейти к концу объекта
		ЧтениеXML.Прочитать(); //перейти к следующему объекту
		//свойства объекта прочитаем отдельно потом
	КонецЕсли;
	
	Возврат НовыйОбъект;
	
КонецФункции

Функция ПрочитатьУдалениеОбъекта(ПараметрыЧтенияXML)
	
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	
	ИмяТипаОбъектаДляУдаления = ЧтениеXML.ПолучитьАтрибут("ТипОбъекта");
	СсылкаОбъектаДляУдаленияСтрокаXML = ЧтениеXML.ПолучитьАтрибут("СсылкаНаОбъект");
	
	СсылкаОбъектаДляУдаления = ПараметрыЧтенияXML.ОбщиеМодули.ОбщегоНазначенияВызовСервера.ПолучитьСсылкуОбъектаИБ(ИмяТипаОбъектаДляУдаления, СсылкаОбъектаДляУдаленияСтрокаXML);
	
	ЧтениеXML.Пропустить();
	ЧтениеXML.Прочитать();
	
	МассивСсылокНаОбъекты = Новый Массив;
	МассивСсылокНаОбъекты.Добавить(СсылкаОбъектаДляУдаления);
	НовыйОбъект = Новый("УдалениеОбъекта", МассивСсылокНаОбъекты);
	
	Возврат НовыйОбъект;
	
КонецФункции

Функция ПерейтиКСвойствамОбъектов(ПараметрыЧтенияXML)
	
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	
	Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.Ничего И НЕ (ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя="Объект") Цикл
		ЧтениеXML.Пропустить();
	КонецЦикла;
		
КонецФункции

Функция ПрочитатьСвойстваОбъектов(ПараметрыЧтенияXML)
	
	Перем Объект;
	
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	СписокОбъектов = ПараметрыЧтенияXML.СписокОбъектов;
	
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Объект" Цикл
		
		НомерОбъектаСтрока = ЧтениеXML.ПолучитьАтрибут("Номер");
		НомерОбъекта = Число(НомерОбъектаСтрока);
		
		Объект = СписокОбъектов[НомерОбъекта-1];
		ПрочитатьСвойстваОбъекта(Объект, ПараметрыЧтенияXML);
		
	КонецЦикла;
	
КонецФункции

Функция ПрочитатьСвойстваОбъекта(Объект, ПараметрыЧтенияXML)

	Перем РаботаСКоллекциями, ОбщегоНазначенияКлиентСервер;
	
	РаботаСКоллекциями = ПараметрыЧтенияXML.ОбщиеМодули.РаботаСКоллекциями;
	ОбщегоНазначенияКлиентСервер = ПараметрыЧтенияXML.ОбщиеМодули.ОбщегоНазначенияКлиентСервер;
	
	ТипОбъекта = ТипЗнч(Объект);
	ДанныеТипаОбъекта = ОбщегоНазначенияКлиентСервер.ПолучитьДанныеТипаОбъекта(ТипОбъекта);
	ЭтоТипОбъектаИБ = ДанныеТипаОбъекта.ЭтоТипОбъектаИБ;
	Типы = ПараметрыЧтенияXML.Типы;
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	
	Если ТипОбъекта = Тип("Структура") Тогда
		
		Если РаботаСКоллекциями.ЭтоКвазиТаблицаЗначений(Объект) Тогда
			ПрочитатьСвойстваОбъектаТаблицаЗначенийКомпактная(Объект, ПараметрыЧтенияXML)
		Иначе
			ПрочитатьСвойстваОбъектаСтруктура(Объект, ПараметрыЧтенияXML)
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("Соответствие") Тогда
		
		ПрочитатьСвойстваОбъектаСоответствие(Объект, ПараметрыЧтенияXML)
		
	ИначеЕсли ТипОбъекта = Тип("Массив") Тогда

		ПрочитатьСвойстваОбъектаМассивКомпактная(Объект, ПараметрыЧтенияXML)

	ИначеЕсли ТипОбъекта = Типы["ТаблицаЗначений"] Тогда

		ПрочитатьСвойстваОбъектаТаблицаЗначенийКомпактная(Объект, ПараметрыЧтенияXML)

	ИначеЕсли ЭтоТипОбъектаИБ Тогда
		
		ПрочитатьСвойстваОбъектаИБ(Объект, ПараметрыЧтенияXML)
		
	Иначе
		
		ЧтениеXML.Пропустить();
		ЧтениеXML.Прочитать();
		
	КонецЕсли;
	
КонецФункции

Функция ПрочитатьСвойстваОбъектаСтруктура(Объект, ПараметрыЧтенияXML)

	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ПараметрыЧтенияXML.ОбщиеМодули.РаботаСКоллекциями;
	
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	
	ЧтениеXML.Прочитать();
	Если Не (ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Ключи") Тогда
		ВызватьИсключение "Ошибка разбора XML структуры";
	КонецЕсли;
	
	ИменаКлючей = ПрочитатьТекстТекущегоУзлаXMLВнутри(ЧтениеXML);
	ИменаКлючейМассив = РаботаСКоллекциями.СтрокуВМассив(ИменаКлючей);
	
	НомерПоля = 0;
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		ИмяПоля = ИменаКлючейМассив[НомерПоля];
		ЗначениеПоля = ПрочитатьОбъект(ПараметрыЧтенияXML);
		Объект.Вставить(ИмяПоля, ЗначениеПоля);
		
		НомерПоля = НомерПоля + 1;
	КонецЦикла;
	
	ЧтениеXML.Прочитать(); //пройти конец объекта
	
КонецФункции

Функция ПрочитатьСвойстваОбъектаСоответствие(Объект, ПараметрыЧтенияXML)

	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	
	ЧтениеXML.Прочитать();
	
	Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
		
		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			ВызватьИсключение "Ошибка чтения ключа объекта Соответствие";
		КонецЕсли;
		
		Ключ = ПрочитатьОбъект(ПараметрыЧтенияXML);

		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			ВызватьИсключение "Ошибка чтения значения объекта Соответствие";
		КонецЕсли;
		
		Значение = ПрочитатьОбъект(ПараметрыЧтенияXML);
		
		Объект.Вставить(Ключ, Значение);
		
	КонецЦикла;
	
	ЧтениеXML.Прочитать(); //пройти конец объекта
	
КонецФункции

Функция ПрочитатьСвойстваОбъектаМассив(Объект, ПараметрыЧтенияXML)

	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;

	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Элемент = ПрочитатьОбъект(ПараметрыЧтенияXML);
			Объект.Добавить(Элемент);
			
		Иначе
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ПрочитатьСвойстваОбъектаМассивКомпактная(Объект, ПараметрыЧтенияXML)
	
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	
	ЧтениеXML.Прочитать();
	
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл

		Значение = ПрочитатьОбъект(ПараметрыЧтенияXML);
		Объект.Добавить(Значение);
		
	КонецЦикла;
	
	ЧтениеXML.Прочитать(); //пройти конец объекта
	
КонецФункции

Функция ПрочитатьСвойстваОбъектаТаблицаЗначений(Объект, ПараметрыЧтенияXML)
	
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	
	ЧтениеXML.Прочитать();
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Колонка" Цикл
		
		ПоляКолонки = Новый Структура;
		Пока ЧтениеXML.Прочитать() И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
			ИмяПоля = ЧтениеXML.Имя;
			ЗначениеПоля = ПрочитатьОбъект(ПараметрыЧтенияXML);
			ПоляКолонки.Вставить(ИмяПоля, ЗначениеПоля);
		КонецЦикла;
		
		Объект.Колонки.Добавить(ПоляКолонки.Имя, ПоляКолонки.ТипЗначения, ПоляКолонки.Заголовок, ПоляКолонки.Ширина);
		ЧтениеXML.Прочитать();
		
	КонецЦикла;
	
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Строка" Цикл
		
		Строка = Объект.Добавить();
		Пока ЧтениеXML.Прочитать() И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
			ИмяПоля = ЧтениеXML.Имя;
			ЗначениеПоля = ПрочитатьОбъект(ПараметрыЧтенияXML);
			Строка[ИмяПоля] = ЗначениеПоля;
		КонецЦикла;
		ЧтениеXML.Прочитать();
		
	КонецЦикла;
	
КонецФункции

Функция ПрочитатьСвойстваОбъектаТаблицаЗначенийКомпактная(Объект, ПараметрыЧтенияXML) Экспорт
	
	Перем РК;
	
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	РК = ПараметрыЧтенияXML.ОбщиеМодули.РаботаСКоллекциями;
	
	ЧтениеXML.Прочитать();
	ИменаКолонок = Новый Массив;
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Колонка" Цикл
		
		ПоляКолонки = Новый Структура;
		ЧтениеXML.Прочитать();
		Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
			ИмяПоля = ЧтениеXML.Имя;
			ЗначениеПоля = ПрочитатьОбъект(ПараметрыЧтенияXML);
			ПоляКолонки.Вставить(ИмяПоля, ЗначениеПоля);
		КонецЦикла;
		
		РК.ДобавитьКолонкуКоллекции(Объект, ПоляКолонки.Имя, ПоляКолонки.ТипЗначения, ПоляКолонки.Заголовок, ПоляКолонки.Ширина);
		
		ИменаКолонок.Добавить(ПоляКолонки.Имя);
		ЧтениеXML.Прочитать();
		
	КонецЦикла;
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Колонки" Тогда
		
		ЧтениеXML.Прочитать();
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			ИменаКолонок = РК.СтрокуВМассив(ЧтениеXML.Значение);
			Для Каждого ИмяКолонки Из ИменаКолонок Цикл
				РК.ДобавитьКолонкуКоллекции(Объект, ИмяКолонки);
			КонецЦикла;
			ЧтениеXML.Прочитать();
		КонецЕсли;
		
		ЧтениеXML.Прочитать();
		
	КонецЕсли;
	
	НомерПоследнейКолонки = ИменаКолонок.ВГраница();
	
	НомерПоля = 0;
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		Если НомерПоля = 0 Тогда
			Строка = РК.ДобавитьЭлементКоллекции(Объект);
		КонецЕсли;
		
		ЗначениеПоля = ПрочитатьОбъект(ПараметрыЧтенияXML);
		ИмяПоля = ИменаКолонок[НомерПоля];
		Строка[ИмяПоля] = ЗначениеПоля;
		
		Если НомерПоля=НомерПоследнейКолонки Тогда
			НомерПоля = 0;
		Иначе
			НомерПоля = НомерПоля + 1;
		КонецЕсли;
	КонецЦикла;
	
	ЧтениеXML.Прочитать(); //пройти конец объекта
	
КонецФункции

Функция ПрочитатьСвойстваОбъектаИБ(Объект, ПараметрыЧтенияXML)
	
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		МетаданныеОбъекта = ПараметрыЧтенияXML.ОбщиеМодули["ОбщегоНазначенияСервер"].ПолучитьМетаданныеОбъекта(Объект);
		СтруктураОбъекта = ПолучитьСтруктуруОбъектаИБИзXML(ПараметрыЧтенияXML, МетаданныеОбъекта);
		Если ТипЗнч(Объект) = Тип("СправочникОбъект.КвазиСсылки") Тогда
			Если СтруктураОбъекта.Реквизиты.Свойство("Представление") Тогда
				Объект.Наименование = СтруктураОбъекта.Реквизиты.Представление;
			КонецЕсли;
		Иначе
			ПараметрыЧтенияXML.ОбщиеМодули.РаботаСXMLСервер.ЗаполнитьСвойстваОбъектаИБИзСтруктуры(Объект, СтруктураОбъекта);
		КонецЕсли;
	#Иначе
		//на клиенте не получиться просто пропустим
	#КонецЕсли
	
КонецФункции

Функция ПолучитьСтруктуруОбъектаИБИзXML(ПараметрыЧтенияXML, МетаданныеОбъекта=Неопределено) Экспорт
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = ПараметрыЧтенияXML.ОбщиеМодули.РаботаСКоллекциями;
	
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	
	КодТипа = ЧтениеXML.ПолучитьАтрибут("Тип");
	ИмяТипа = ПараметрыЧтенияXML.КодировкаИменТипов[КодТипа];
	Если ИмяТипа=Неопределено Тогда
		ИмяТипа = КодТипа;
	КонецЕсли;
	
	ТабличныеЧасти = Новый Структура;
	
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		ЭтоРегистр = МетаданныеОбъекта<>Неопределено И (Метаданные.РегистрыСведений.Содержит(МетаданныеОбъекта) ИЛИ Метаданные.РегистрыНакопления.Содержит(МетаДанныеОбъекта));
	#Иначе
		ЭтоРегистр = Ложь;
	#КонецЕсли
	
	ИменаТабличныхЧастей = Новый Соответствие;
	
	СтруктураОбъекта = Новый Структура;
	Если ЭтоРегистр Тогда
		ИменаТабличныхЧастей["Записи"] = Истина;
		РеквизитыОбъекта = Неопределено;
		Приемник = СтруктураОбъекта;
	Иначе
		Если МетаданныеОбъекта<>Неопределено Тогда
			Для Каждого МетаданныеТабличнойЧасти Из МетаданныеОбъекта.ТабличныеЧасти Цикл
				ИменаТабличныхЧастей[МетаданныеТабличнойЧасти.Имя] = Истина;
			КонецЦикла;
		КонецЕсли;
		
		РеквизитыОбъекта = Новый Структура;
		СтруктураОбъекта.Вставить("Реквизиты", РеквизитыОбъекта);
		Приемник = РеквизитыОбъекта;
	КонецЕсли;
	СтруктураОбъекта.Вставить("ТабличныеЧасти", ТабличныеЧасти);
	СтруктураОбъекта.Вставить("ДополнительныеСвойства", Новый Структура);
	
	СтруктураОбъекта.Вставить("ИмяТипа", ИмяТипа);
	
	СтекПриемниковСвойств = Новый Массив;
	ТекущаяТабличнаяЧасть = Неопределено;
	ДанныеТекущейСтроки = Неопределено;
	ИмяРеквизита = Неопределено;
	ИмяТипаРеквизита = Неопределено;
	
	УровеньЭлемента = 0;

	Если ЧтениеXML.Прочитать() Тогда
		Пока Истина Цикл
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
				УровеньЭлемента = УровеньЭлемента + 1;
				ИмяРеквизита = ЧтениеXML.Имя;
				
				ИмяТипаРеквизита = ЧтениеXML.ПолучитьАтрибут("Тип");
				Если ИмяТипаРеквизита = Неопределено Тогда
					ИмяТипаРеквизита = ЧтениеXML.ПолучитьАтрибут("type");
				КонецЕсли;
				
				Если ИмяТипаРеквизита <> Неопределено Тогда
					
					//дошли до значения
					ЗначениеРеквизита = ПрочитатьОбъект(ПараметрыЧтенияXML);
					Приемник.Вставить(ИмяРеквизита, ЗначениеРеквизита);
					УровеньЭлемента = УровеньЭлемента - 1;
					Продолжить;
					
				ИначеЕсли УровеньЭлемента = 1 И ИменаТабличныхЧастей[ИмяРеквизита]=Истина Тогда
					
					//табличная часть
					ИмяТабличнойЧасти = ИмяРеквизита;
					ТекущаяТабличнаяЧасть = РаботаСКоллекциями.НоваяКвазиТаблицаЗначений();
					ТабличныеЧасти.Вставить(ИмяТабличнойЧасти, ТекущаяТабличнаяЧасть);
					СтекПриемниковСвойств.Добавить(Приемник);
					
				ИначеЕсли УровеньЭлемента = 2 И ИмяРеквизита = "Row" И ТекущаяТабличнаяЧасть <> Неопределено Тогда
					
					//начало строки
					ДанныеТекущейСтроки = Новый Структура;
					СтекПриемниковСвойств.Добавить(Приемник);
					Приемник = ДанныеТекущейСтроки;
					
				Иначе
					
					//дополнительные свойства (допускается произвольная глубина вложенности)
					ДополнительныеСвойства = Новый Структура;
					Если УровеньЭлемента=1 Тогда
						//вставим в объект рядом с реквизитами, а не в сами реквизиты
						СтруктураОбъекта.Вставить(ИмяРеквизита, ДополнительныеСвойства);
					Иначе
						//добавим уровень вложенности в текущий приемник
						Приемник.Вставить(ИмяРеквизита, ДополнительныеСвойства);
					КонецЕсли;
					
					СтекПриемниковСвойств.Добавить(Приемник);
					Приемник = ДополнительныеСвойства;
					
				КонецЕсли;
				
			КонецЕсли;
				
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				
				Если УровеньЭлемента = 0 Тогда
					ЧтениеXML.Прочитать();
					Прервать;
				КонецЕсли;
				
				Если УровеньЭлемента = 2 И ТекущаяТабличнаяЧасть <> Неопределено Тогда
					
					//конец строки
					Для Каждого КолонкаТаблицы Из ДанныеТекущейСтроки Цикл
						ИмяКолонки = КолонкаТаблицы.Ключ;
						Если Не ТекущаяТабличнаяЧасть.Колонки.Свойство(ИмяКолонки) Тогда
							РаботаСКоллекциями.ДобавитьКолонкуКоллекции(ТекущаяТабличнаяЧасть, ИмяКолонки);
						КонецЕсли;
					КонецЦикла;
					
					РаботаСКоллекциями.ДобавитьЭлементКоллекции(ТекущаяТабличнаяЧасть, ДанныеТекущейСтроки);
					
				ИначеЕсли УровеньЭлемента = 1 Тогда 
					
					Если ТекущаяТабличнаяЧасть <> Неопределено Тогда 
						ТекущаяТабличнаяЧасть = Неопределено;
					КонецЕсли;
					
				КонецЕсли;
				
				Приемник = СтекПриемниковСвойств[СтекПриемниковСвойств.ВГраница()];
				СтекПриемниковСвойств.Удалить(СтекПриемниковСвойств.ВГраница());
				
				УровеньЭлемента = УровеньЭлемента - 1;
				
			КонецЕсли;
			
			Если НЕ ЧтениеXML.Прочитать() Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если РеквизитыОбъекта<>Неопределено Тогда
		СтруктураОбъекта.Вставить("Ссылка");
		РеквизитыОбъекта.Свойство("Ссылка", СтруктураОбъекта.Ссылка);
		СтруктураОбъекта.Вставить("Представление");
		РеквизитыОбъекта.Свойство("Представление", СтруктураОбъекта.Представление);
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции

Функция ПрочитатьКодировкуИменТипов(ПараметрыЧтенияXML)
	
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	
	КодировкаТипов = Новый Соответствие;
	
	Если Не (ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Типы") Тогда
		Возврат КодировкаТипов;
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		
		КодТипа = ЧтениеXML.Имя;
		ИмяТипа = ПрочитатьТекстТекущегоУзлаXMLВнутри(ЧтениеXML);
		КодировкаТипов[КодТипа] = ИмяТипа;

	КонецЦикла;
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Типы" Тогда
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	Возврат КодировкаТипов;
	
КонецФункции

Функция ПрочитатьКодировкуСтроковыхЗначений(ПараметрыЧтенияXML)
	
	ЧтениеXML = ПараметрыЧтенияXML.ЧтениеXML;
	
	КодировкаСтроковыхЗначений = Новый Соответствие;
	
	Если Не (ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "СтроковыеЗначения") Тогда
		Возврат КодировкаСтроковыхЗначений;
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		
		КодЗначения = ЧтениеXML.Имя;
		Значение = ПрочитатьТекстТекущегоУзлаXMLВнутри(ЧтениеXML);
		КодировкаСтроковыхЗначений[КодЗначения] = Значение;

	КонецЦикла;
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "СтроковыеЗначения" Тогда
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	Возврат КодировкаСтроковыхЗначений;
	
КонецФункции

Функция ПолучитьОбщиеМодули()
	
	ОбщиеМодули = Новый Структура("РаботаСXMLКлиентСервер, РаботаСКоллекциями, ОбщегоНазначенияВызовСервера, ОбращенияКИСКлиентСервер, РаботаСXMLСервер, ОбщегоНазначенияКлиентСервер, ОбщегоНазначенияСервер");
	
	Для Каждого ОбщийМодуль Из ОбщиеМодули Цикл
		ОбщиеМодули.Вставить(ОбщийМодуль.Ключ, глОбщийМодуль(ОбщийМодуль.Ключ));
	КонецЦикла;
	
	Возврат ОбщиеМодули;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////
Функция ПолучитьСтруктуруТекстаXML(ИсточникXML) Экспорт
	
	Перем РаботаСКоллекциями, ОбщегоНазначенияКлиентСервер;
	
	РаботаСКоллекциями = глОбщийМодуль("РаботаСКоллекциями");
	ОбщегоНазначенияКлиентСервер = глОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	Если ТипЗнч(ИсточникXML) = Тип("ЧтениеXML") Тогда
		ЧтениеXML = ИсточникXML;
		локЧтениеXML = Неопределено;
	ИначеЕсли ТипЗнч(ИсточникXML) = Тип("Строка") Тогда
		ЧтениеXML = Новый ЧтениеXML;
		Если СтрНайти(ИсточникXML, "<") > 0 Тогда
			ЧтениеXML.УстановитьСтроку(ИсточникXML);
		Иначе
			ИмяФайла = ИсточникXML;
			ТекстФайла = ОбщегоНазначенияКлиентСервер.ПолучитьТекстИзФайла(ИмяФайла);
			ЧтениеXML.УстановитьСтроку(ТекстФайла);
		КонецЕсли;
		локЧтениеXML = ЧтениеXML;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураXML = НовыйУзелСтруктурыТекстаXML(Неопределено);
	ТекущийЭлемент = СтруктураXML;
	СтекЭлементов = Новый Массив;
	УровеньЭлемента = 0;
	ПредыдущийТипУзла = Неопределено;
	
	Пока Истина Цикл
		
		Если Не (ЧтениеXML.ТипУзла = ТипУзлаXML.ОбъявлениеXML ИЛИ ЧтениеXML.ТипУзла = ТипУзлаXML.Ничего) Тогда
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
				СтекЭлементов.Добавить(Новый Структура("Элемент, Свойство", ТекущийЭлемент, ЧтениеXML.Имя));
				УровеньЭлемента = УровеньЭлемента + 1;
				
				ТекущийЭлемент = НовыйУзелСтруктурыТекстаXML(ЧтениеXML.Имя);
				
				Для НомерАтрибута=0 По ЧтениеXML.КоличествоАтрибутов()-1 Цикл
					ТекущийЭлемент.Атрибуты[ЧтениеXML.ИмяАтрибута(НомерАтрибута)] = ЧтениеXML.ЗначениеАтрибута(НомерАтрибута);
				КонецЦикла;
				
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
				
				ТекущийЭлемент.Значение = ЧтениеXML.Значение;
				
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				
				НовыйЭлемент = ТекущийЭлемент;
				
				ТекущийЭлемент = СтекЭлементов[СтекЭлементов.ВГраница()].Элемент;
				ТекущееСвойство = СтекЭлементов[СтекЭлементов.ВГраница()].Свойство;
				СтекЭлементов.Удалить(СтекЭлементов.ВГраница());
				УровеньЭлемента = УровеньЭлемента - 1;
				
				ВставитьУзелВСтруктуруТекстаXML(ТекущийЭлемент, НовыйЭлемент);
			
			КонецЕсли;
			
		КонецЕсли;
		
		ПредыдущийТипУзла = ЧтениеXML.ТипУзла;
		
		Если Не ЧтениеXML.Прочитать() Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если локЧтениеXML <> Неопределено Тогда
		локЧтениеXML.Закрыть();
	КонецЕсли;
	
	Возврат СтруктураXML;
	
КонецФункции

Функция ПолучитьУзелСтруктурыТекстаXML(СтруктураТекстаXML, Путь) Экспорт
	
	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = глОбщийМодуль("РаботаСКоллекциями");
	
	МассивЭлементовПути = РаботаСКоллекциями.СтрокуВМассив(Путь, ".");
	
	ТекущийУзел = СтруктураТекстаXML;
	Для Каждого ЭлементПути Из МассивЭлементовПути Цикл
		
		ТекущаяКоллекция = ТекущийУзел.Свойства[ЭлементПути];
		
		Если ТекущаяКоллекция = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ТекущийУзел = ТекущаяКоллекция[0];
		
	КонецЦикла;
	
	Возврат ТекущийУзел;
	
КонецФункции

Функция ВставитьУзелВСтруктуруТекстаXML(СтруктураТекстаXML, Узел) Экспорт

	Имя = Узел.Имя;
	ВложенныеЭлементыПоСвойству = СтруктураТекстаXML.Свойства[Имя];
	Если ВложенныеЭлементыПоСвойству = Неопределено Тогда
		ВложенныеЭлементыПоСвойству = Новый Массив;
		СтруктураТекстаXML.Свойства[Имя] = ВложенныеЭлементыПоСвойству;
	КонецЕсли;
	
	ВложенныеЭлементыПоСвойству.Добавить(Узел);
	
	СтруктураТекстаXML.ВложенныеЭлементы.Добавить(Узел);
	Узел.Номер = СтруктураТекстаXML.ВложенныеЭлементы.Количество();
	
КонецФункции

Функция НовыйУзелСтруктурыТекстаXML(Имя, Значение=Неопределено) Экспорт
	НовыйУзел = Новый Структура;
	НовыйУзел.Вставить("Имя", Имя);
	НовыйУзел.Вставить("Номер", 0);
	НовыйУзел.Вставить("Атрибуты", Новый Соответствие);
	НовыйУзел.Вставить("Свойства", Новый Соответствие);
	НовыйУзел.Вставить("ВложенныеЭлементы", Новый Массив);
	НовыйУзел.Вставить("Значение", Значение);
	Возврат НовыйУзел;
КонецФункции

Функция СкопироватьАтрибутыУзлаСтруктурыТекстаXML(УзелИсточник, УзелПриемник) Экспорт

	Для Каждого Атрибут Из УзелИсточник.Атрибуты Цикл
		УзелПриемник.Атрибуты[Атрибут.Ключ] = Атрибут.Значение;
	КонецЦикла;
	
КонецФункции

Функция УдалитьАтрибутыУзлаСтруктурыТекстаXML(УзелXML, Атрибуты) Экспорт

	Перем РаботаСКоллекциями;
	
	РаботаСКоллекциями = глОбщийМодуль("РаботаСКоллекциями");
	
	МассивАтрибутов = РаботаСКоллекциями.ЗначениеВМассив(Атрибуты);
	
	Для Каждого ИмяАтрибута Из МассивАтрибутов  Цикл
		УзелXML.Атрибуты.Удалить(ИмяАтрибута);
	КонецЦикла;
	
КонецФункции

Функция ЗаписатьУзелСтруктурыТекстаXML(ЗаписьXML, УзелXML) Экспорт

	ЗаписьXML.ЗаписатьНачалоЭлемента(УзелXML.Имя);
	Для Каждого Атрибут Из УзелXML.Атрибуты Цикл
		ЗаписьXML.ЗаписатьАтрибут(Атрибут.Ключ, Атрибут.Значение);
	КонецЦикла;
	
	ВложенныеЭлементы = УзелXML.ВложенныеЭлементы;
	Если ВложенныеЭлементы.Количество() > 0 Тогда
		Для Каждого ВложенныйУзел Из ВложенныеЭлементы Цикл
			ЗаписатьУзелСтруктурыТекстаXML(ЗаписьXML, ВложенныйУзел);
		КонецЦикла;
	ИначеЕсли УзелXML.Значение <> Неопределено Тогда
		ЗаписьXML.ЗаписатьТекст(УзелXML.Значение);
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецФункции

Функция ПолучитьТекстУзлаСтруктурыТекстаXML(УзелXML) Экспорт

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписатьУзелСтруктурыТекстаXML(ЗаписьXML, УзелXML);
	Текст = ЗаписьXML.Закрыть();
	Возврат Текст;
	
КонецФункции

Функция ПолучитьМультиязычнуюСтрокуИзСтруктурыТекстаXML(УзелХML, Язык="ru") Экспорт
	
	Если УзелХML = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивИтемов = УзелХML.Свойства["v8:item"];
	Если МассивИтемов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого Итем Из МассивИтемов Цикл
		Если Итем.Свойства["v8:lang"][0].Значение = Язык Тогда
			Возврат Итем.Свойства["v8:content"][0].Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
