
&НаКлиенте
Процедура КомплектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КомплектыПриАктивизацииСтроки(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Комплекты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Элементы.Комплектующие.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиКомплекта", Элементы.Комплекты.ТекущиеДанные.ИдентификаторСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	НайденныеСтроки = Объект.Комплектующие.НайтиСтроки(Новый Структура("ИдентификаторСтрокиКомплекта", Элемент.ТекущиеДанные.ИдентификаторСтроки));
	вмс_РаботаСКоллекциями.УдалитьЭлементыКоллекции(Объект.Комплектующие, НайденныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПослеУдаления(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Элементы.Комплекты.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ИдентификаторСтрокиКомплекта = Элементы.Комплекты.ТекущиеДанные.ИдентификаторСтроки;
	КонецЕсли;
КонецПроцедуры
