
&НаКлиенте
Процедура Печать(Команда)
	
	ТабличныйДокумент = ПолучитьТабличныйДокументПечати(Запись);
	Если ТабличныйДокумент <> Неопределено Тогда
		ТабличныйДокумент.Показать();	
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьТабличныйДокументПечати(знач ДанныеПечати)
	МенеджерЗаписи = РегистрыСведений.ОчередьПечати.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеПечати); 
	МенеджерЗаписи.Прочитать();
	
	ТабличныйДокумент = МенеджерЗаписи.Хранилище.Получить();
	Возврат ТабличныйДокумент;
КонецФункции


