Функция УдалитьЗаписиРегистраБезРегистратора(ИмяРегистра) Экспорт
	
	Менеджер = вмс_ОбщегоНазначенияСервер.ПолучитьМенеджерОбъектовБазы(ИмяРегистра);
	Если Менеджер = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вмс_ОперацияПоЯчейкам.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам КАК вмс_ОперацияПоЯчейкам
	|ГДЕ
	|	вмс_ОперацияПоЯчейкам.Регистратор.Номер ЕСТЬ NULL";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрНакопления.вмс_ОперацияПоЯчейкам", ИмяРегистра);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	НаборЗаписей = Менеджер.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Записать();
	КонецЦикла;
	
	Возврат Выборка.Количество();

КонецФункции
