
Функция ВставитьЭлементНаФорму(Форма) Экспорт 
	
	ТаблицаДополнительныхЭлементовФормы = тестПолучитьТаблицуРеквизитовДляФормы();
	
	МассивДопЭлементов = ТаблицаДополнительныхЭлементовФормы.НайтиСтроки(Новый Структура("ПолноеИмяФормы",Форма.ИмяФормы  )); 
	
	МассивУжеСозданныхРеквизитов = Форма.ПолучитьРеквизиты();
	УдаляемыеРеквизиты = Новый Массив;
	
	Если МассивДопЭлементов.Количество() > 0 Тогда
		
		Для каждого ДЭ Из МассивДопЭлементов Цикл
			
			Если ДЭ.ДобавитьРеквизит = Истина Тогда
				
				ДобавляемыеРеквизиты = Новый Массив;
				ТипРеквизита = ДЭ.ОписаниеТипов;
				РеквизитФормы = Новый РеквизитФормы(ДЭ.ИмяРеквизита,ТипРеквизита,"",ДЭ.Заголовок);
				
				ЭлементСоздан = Ложь;
				Для каждого ЭлМассива Из МассивУжеСозданныхРеквизитов Цикл
					Если ЭлМассива.Имя = РеквизитФормы.Имя Тогда
						ЭлементСоздан = Истина;
					КонецЕсли;	
				КонецЦикла;
				
				Если НЕ ЭлементСоздан Тогда
					ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
				КонецЕсли;
				
			КонецЕсли;		
			
			Если НЕ ЭлементСоздан Тогда
				// Вывод реквизита на форму (при необходимости)   
				Если ЗначениеЗаполнено(ДЭ.МестоположениеЭлемента) Тогда
					ПолеВвода = Форма.Элементы.Вставить(ДЭ.ИмяРеквизита, Тип("ПолеФормы"),Форма.Элементы[ДЭ.ГруппаДляВыводаНаФорму], Форма.Элементы[ДЭ.МестоположениеЭлемента]);
				Иначе
					ПолеВвода = Форма.Элементы.Добавить(ДЭ.ИмяРеквизита, Тип("ПолеФормы"),Форма.Элементы[ДЭ.ГруппаДляВыводаНаФорму]);
				КонецЕсли;  
				
				ПолеВвода.Вид = ДЭ.ВидПоляФормы;
				ПолеВвода.ПутьКДанным = ДЭ.Путь + ?(ДЭ.Путь = "","",".") + ДЭ.ИмяРеквизита;
				
			КонецЕсли;
			
		КонецЦикла;	
		
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
	КонецЕсли;
	
КонецФункции

Функция ИнициализацияТаблицыДополнительныхЭлементовФормы()

	ТаблицаЭлементов = Новый ТаблицаЗначений; 
	ТаблицаЭлементов.Колонки.Добавить("ДобавитьРеквизит");
	ТаблицаЭлементов.Колонки.Добавить("ПолноеИмяФормы");
	ТаблицаЭлементов.Колонки.Добавить("ИмяРеквизита");
	ТаблицаЭлементов.Колонки.Добавить("ГруппаДляВыводаНаФорму");
	ТаблицаЭлементов.Колонки.Добавить("ОписаниеТипов"); 
	ТаблицаЭлементов.Колонки.Добавить("Путь");
	ТаблицаЭлементов.Колонки.Добавить("Заголовок"); 
	ТаблицаЭлементов.Колонки.Добавить("ВидПоляФормы"); 
	ТаблицаЭлементов.Колонки.Добавить("Дозаполнять"); 
	ТаблицаЭлементов.Колонки.Добавить("МестоположениеЭлемента"); //Вставится перед этим элементом
	
	Возврат ТаблицаЭлементов;

КонецФункции

Функция тестПолучитьТаблицуРеквизитовДляФормы()
	
	ТаблицаЭлементов = ИнициализацияТаблицыДополнительныхЭлементовФормы();
			
	Возврат ТаблицаЭлементов;

КонецФункции 

Функция ДобавитьОтборНаФорму(Форма) Экспорт 

	//ЮМК
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.СписокНоменклатура, "ЮМК_Клиент",
		     Справочники.Партнеры.НашеПредприятие, ВидСравненияКомпоновкиДанных.Равно, Неопределено, , 
			 РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, "ОтборПоКлиентуСпискаНоменклатуры"); 
	//ЮМК

КонецФункции
