
Функция ПолучитьРезультатЗапроса(ОписаниеЗапроса) Экспорт
	
	Запрос = ПолучитьЗапросИзОписанияЗапроса(ОписаниеЗапроса);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ПолучитьЗапросИзОписанияЗапроса(ОписаниеЗапроса) Экспорт
	
	Если ТипЗнч(ОписаниеЗапроса)=Тип("Строка") Тогда
		Запрос = Новый Запрос(ОписаниеЗапроса);
	Иначе
		Запрос = Новый Запрос(ОписаниеЗапроса.Текст);
		ПараметрыЗапроса = Неопределено;
		Если ОписаниеЗапроса.Свойство("Параметры", ПараметрыЗапроса) И ТипЗнч(ПараметрыЗапроса) = Тип("Структура") Тогда
			Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
				Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

///////////////////////////////////////////////////////////////////////
//
//					Обмен объектами+
//

Функция ВыполнитьОбмен(ТекстСообщения) Экспорт

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстСообщения);
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	ЧтениеСообщения.НачатьЧтение(ЧтениеXML);

	Отправитель = ЧтениеСообщения.Отправитель;
	ПланыОбмена.УдалитьРегистрациюИзменений(Отправитель, ЧтениеСообщения.НомерПринятого);
	вмс_РаботаСXMLВызовСервера.ЗагрузитьОбъектыИзXML(ЧтениеXML, ЧтениеСообщения.Отправитель);
	ЧтениеСообщения.ЗакончитьЧтение();
	ЧтениеXML.Закрыть();
	
	/////////////////////////////////////////////////////////////////
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.Отступ = Ложь;
	ЗаписьXML.УстановитьСтроку();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Отправитель);
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Отправитель, ЗаписьСообщения.НомерСообщения, ПолучитьМетаданныеОбъектовДляОбмена());
	МассивОбъектов = Новый Массив;
	Пока ВыборкаИзменений.Следующий() Цикл
		ОбъектОбмена = ВыборкаИзменений.Получить();
		МассивОбъектов.Добавить(ОбъектОбмена);
	КонецЦикла;
	вмс_РаботаСXMLКлиентСервер.ЗаписатьXMLУлучшенная(ЗаписьXML, МассивОбъектов);
	ЗаписьСообщения.ЗакончитьЗапись();
	ТекстОбмена = ЗаписьXML.Закрыть();
	Возврат ТекстОбмена;
	

КонецФункции

Функция ПолучитьМетаданныеОбъектовДляОбмена()
	
	СписокОбъектов = Новый Массив;
	
	Для Каждого Объект Из Метаданные.ПланыОбмена.МобильныйОбмен.Состав Цикл
		СписокОбъектов.Добавить(Объект.Метаданные);
	КонецЦикла;
	
	Возврат СписокОбъектов;
	
КонецФункции

Функция ВыгрузитьОбъектыПоОписаниюЗапроса(ОписаниеЗапроса) Экспорт
	
	Возврат ВыгрузитьОбъектыПоЗапросу(ПолучитьЗапросИзОписанияЗапроса(ОписаниеЗапроса));
	
КонецФункции

Функция ВыгрузитьОбъектыПоЗапросу(Запрос) Экспорт
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	МассивСсылок = вмс_Обмен_с_КИС_ВызовСервера.ПолучитьМассивСсылокИБВДанных(ТаблицаРезультата);
	Возврат ВыгрузитьОбъектыПоСсылкамВXML(МассивСсылок);
	
КонецФункции

Функция ВыгрузитьОбъектыПоСсылкамВXML(Ссылки) Экспорт
	
	МассивСсылок = вмс_РаботаСКоллекциями.ЗначениеВМассив(Ссылки, , Ложь);
	МассивОбъектов = Новый Массив;
	
	ВыгруженныеСсылки = Новый Соответствие;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.Отступ = Ложь;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВыгрузкаОбъектов");
	Для Каждого Ссылка Из МассивСсылок Цикл
		
		Если ВыгруженныеСсылки[Ссылка] = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Если вмс_ОбщегоНазначенияВызовСервера.ЭтоЗначениеПеречисления(Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Объект = Ссылка.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Объект.Прочитать();
		
		МассивОбъектов.Добавить(Объект);
		
		//вмс_РаботаСXMLВызовСервера.ЗаписатьОбъектВXML(ЗаписьXML, Объект);
		ВыгруженныеСсылки[Ссылка] = Истина;
		
	КонецЦикла;
	
	вмс_РаботаСXMLКлиентСервер.ЗаписатьXMLУлучшенная(ЗаписьXML, МассивОбъектов);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции
	
//
//					Обмен объектами-
//
///////////////////////////////////////////////////////////////////////

Функция ПредОбработкаМетодаОбмена(ОписаниеМетода) Экспорт
	
	вмс_Обмен_с_КИС_ВызовСервера.ПреобразоватьДанныеПослеПолучения(ОписаниеМетода.Параметры);
	
КонецФункции

Функция ПостОбработкаМетодаОбмена(ДанныеВыполнения) Экспорт
	
	Если ДанныеВыполнения.Результат <> Неопределено Тогда
		
		вмс_Обмен_с_КИС_ВызовСервера.ПреобразоватьДанныеПередОтправкой(ДанныеВыполнения.Результат);
		
	КонецЕсли;
	
КонецФункции

Функция РаспаковатьВходящиеДанные(ВходящиеДанные) Экспорт
	
	Данные = ВходящиеДанные;
	Сообщение = ПрочитатьЗаголовокДанных(Данные);
	Если Сообщение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Сообщение.ТипДанных = "XML" Тогда
		
		СтрокаXML = вмс_ОбщегоНазначенияСервер.РазкодироватьСтрокуИзBase64(Данные);
		РаспакованныеДанные = вмс_РаботаСXMLКлиентСервер.ПрочитатьТекстXMLУлучшенная(СтрокаXML);
		
	ИначеЕсли Сообщение.ТипДанных = "ValueStorage" Тогда
		
		ХранилищеЗначения = XMLЗначение(Тип("ХранилищеЗначения"), Данные);
		РаспакованныеДанные = ХранилищеЗначения.Получить();
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Сообщение.Вставить("Данные", РаспакованныеДанные);
	
	Возврат Сообщение;
	
КонецФункции

Функция УпаковатьИсходящиеДанные(ИсходящиеДанные, ТипДанных) Экспорт
	
	Если ТипДанных = "XML" Тогда
		
		СтрокаXML = вмс_РаботаСXMLКлиентСервер.XMLСтрокаИзЗначенияУлучшенная(ИсходящиеДанные, Ложь);
		УпакованныеДанные = вмс_ОбщегоНазначенияСервер.ЗакодироватьСтрокуВBase64(СтрокаXML);
		
	ИначеЕсли ТипДанных = "ValueStorage" Тогда
		
		ХранилищеЗначения = Новый ХранилищеЗначения(ИсходящиеДанные, Новый СжатиеДанных(9));
		УпакованныеДанные = XMLСтрока(ХранилищеЗначения);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
	ЗаголовокДанных = "Content-Type: " + ТипДанных;
	УпакованныеДанные = ЗаголовокДанных + Символы.ПС + УпакованныеДанные;
	
	Возврат УпакованныеДанные;
	
КонецФункции

Функция ПрочитатьЗаголовокДанных(Данные)
	
	ПозицияКонцаСтроки = СтрНайти(Данные, Символы.ПС);
	Если ПозицияКонцаСтроки = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаЗаголовка = Лев(Данные, ПозицияКонцаСтроки-1);
	
	ДанныеЗаголовка =  вмс_РаботаСКоллекциями.СтрокуВМассив(СтрокаЗаголовка, ":");
	
	Если ДанныеЗаголовка.Количество() <> 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ДанныеЗаголовка[0] <> "Content-Type" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипДанных = ДанныеЗаголовка[1];

	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ТипДанных", ТипДанных);
	
	Данные = Прав(Данные, СтрДлина(Данные)-ПозицияКонцаСтроки);
	
	Возврат СтруктураЗаголовка;
	
КонецФункции

//////////////////////////////////////////////////////////
//
//			Администрирование сервера+
//

Функция ПолучитьСоединенияРабочегоПроцесса(ПодключениеКПроцессу) Экспорт

	ИнформационнаяБаза = ПодключениеКПроцессу.CreateInfoBaseInfo();
	ИнформационнаяБаза.Name = ПолучитьИмяЭтойБазы();
	СоединенияБазы = ПодключениеКПроцессу.GetInfoBaseConnections(ИнформационнаяБаза);
	
	Возврат СоединенияБазы;
	
КонецФункции
	
Функция ПолучитьПодключенияКРабочииПроцессамСервера() Экспорт
	
	ИмяСервера = "localhost";
	Коннектор = Новый COMОбъект("v83.COMConnector");

	Агент = Коннектор.ConnectAgent(ИмяСервера);
	
	Кластеры = Агент.GetClusters();
	
	Логин = "вмс_Obmen";
	Пароль = "!password";
	
	ПодключенияКПроцессам = Новый Массив;
	Для Каждого Кластер Из Кластеры Цикл
		Агент.Authenticate(Кластер, "", "");
		Процессы = Агент.GetWorkingProcesses(Кластер);
		Для Каждого Процесс Из Процессы Цикл
			ПодключениеКПроцессу = Коннектор.ConnectWorkingProcess(ИмяСервера + ":" + СтрЗаменить(Процесс.MainPort, Символы.НПП, ""));
			ПодключениеКПроцессу.AddAuthentication(Логин, Пароль);
			ПодключенияКПроцессам.Добавить(ПодключениеКПроцессу);
		КонецЦикла;

	КонецЦикла;
	
	Возврат ПодключенияКПроцессам;
	
КонецФункции

Функция ПолучитьИмяЭтойБазы() Экспорт

	ИмяБазы = СтрокаСоединенияИнформационнойБазы();
	Позиция = СтрНайти(ИмяБазы, "Ref=");
	Если Позиция=0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяБазы = Сред(ИмяБазы, Позиция+4);
	ИмяБазы = СтрЗаменить(ИмяБазы, """", "");
	Если Прав(ИмяБазы, 1)=";" Тогда
		ИмяБазы = Лев(ИмяБазы, СтрДлина(ИмяБазы)-1);
	КонецЕсли;

	Возврат ИмяБазы;
	
КонецФункции

//
//			Администрирование сервера-
//
//////////////////////////////////////////////////////////
