&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	вмс_НастройкиПолейЗаданияСервер1.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Справочники.вмс_НастройкиПолейЗадания.ЗаполнитьНастройкуПолейПоУмолчанию1(Объект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	вмс_НастройкиПолейЗаданияКлиент1.ПриОткрытии(ЭтаФорма, Отказ, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	вмс_НастройкиПолейЗаданияКлиент1.ПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	вмс_НастройкиПолейЗаданияКлиент1.ПриЗакрытии(ЭтаФорма, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	ТестНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

#Область КонструкторНастройкиПолей

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_ПриАктивизацииСтроки(Элемент)

	вмс_НастройкиПолейЗаданияКлиент1.СвойстваЭлементов_ПриАктивизацииСтроки(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	вмс_НастройкиПолейЗаданияКлиент1.СвойстваЭлементов_Выбор(ЭтаФорма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_ПередНачаломИзменения(Элемент, Отказ)

	вмс_НастройкиПолейЗаданияКлиент1.СвойстваЭлементов_ПередНачаломИзменения(ЭтаФорма, Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Значение_ПриИзменении(Элемент)

	вмс_НастройкиПолейЗаданияКлиент1.СвойстваЭлементов_Значение_ПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Значение_НачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)

	вмс_НастройкиПолейЗаданияКлиент1.СвойстваЭлементов_Значение_НачалоВыбораИзСписка(ЭтаФорма, Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_СвойстваЭлементов_Значение_ОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)

	вмс_НастройкиПолейЗаданияКлиент1.СвойстваЭлементов_Значение_ОбработкаВыбора(ЭтаФорма, Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Элементы_ПриАктивизацииСтроки(Элемент)
	
	вмс_НастройкиПолейЗаданияКлиент1.Элементы_ПриАктивизацииСтроки(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Элементы_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	вмс_НастройкиПолейЗаданияКлиент1.Элементы_ПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Элементы_Перетаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	вмс_НастройкиПолейЗаданияКлиент1.Элементы_Перетаскивание(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Элементы_ПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	вмс_НастройкиПолейЗаданияКлиент1.Элементы_ПроверкаПеретаскивания(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Элементы_ОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	вмс_НастройкиПолейЗаданияКлиент1.Элементы_ОкончаниеПеретаскивания(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПолей_Элементы_ПередУдалением(Элемент, Отказ)

	вмс_НастройкиПолейЗаданияКлиент1.Элементы_ПередУдалением(ЭтаФорма, Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаНастройкаПолей_Страницы_ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	вмс_НастройкиПолейЗаданияКлиент1.Страницы_ПриСменеСтраницы(ЭтаФорма, Элемент, ТекущаяСтраница);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	вмс_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, ЭтаФорма.Объект);
	
КонецПроцедуры

&НаСервере
Функция СлужебнаяФункцияВызовСервера(ПрограммныйКод, ДополнительныеПараметры=Неопределено) Экспорт
	
	Возврат вмс_ОбщегоНазначенияСервер.СлужебнаяФункцияВызовСервераНаФорме(ЭтаФорма, ПрограммныйКод, ДополнительныеПараметры);
	
КонецФункции 

#КонецОбласти