&НаКлиенте
Процедура ПолучитьМакетЭлементов(Команда)
	Макет = ПолучитьМакетЭлементовНаСервере();
	Макет.Показать(ПолучитьСинонимСправочника());
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМакетВыделенныхЭлементов(Команда)
	
	СписокОбъектов = Новый Массив;
	
	Для Каждого СсылкаНаОбъект Из Элементы.Список.ВыделенныеСтроки Цикл
		СписокОбъектов.Добавить(СсылкаНаОбъект);
	КонецЦикла;
	
	Макет = ПолучитьМакетЭлементовНаСервере(СписокОбъектов);
	Макет.Показать("Выбранные " + ПолучитьСинонимСправочника());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМакетЭлементовНаСервере(СписокОбъектов=Неопределено)
	
	Возврат вмс_ОбновлениеИнформационнойБазы.ПолучитьМакетЭлементов(ПолучитьИмяСправочника(), СписокОбъектов);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьИзМакетаНаСервере()
	
	Если вмс_АдаптацияКонфигураций.ЭтоУТ() Тогда
		вмс_ОбновлениеИнформационнойБазы.ЗагрузитьЭлементыИзМакета("ПредопределенныеЭлементыПравилЗаполненияЗадачиКладовщикуУТ", ПолучитьИмяСправочника());
	Иначе
		ВызватьИсключение "Не найден макет правил заполнения заданий кладовщику под текущую конфигурацию!";
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСинонимСправочника()
	
	Возврат Метаданные.НайтиПоПолномуИмени(ПолучитьИмяСправочника()).Синоним;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяСправочника()
	
	Возврат "Справочник.вмс_ПравилаЗаполненияЗадачиКладовщику";
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзМакета(Команда)
	ЗагрузитьИзМакетаНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры
