Функция МодульАдаптации() Экспорт
	
	Если вмс_АдаптацияКонфигураций.ЭтоУТ103() Тогда
		Возврат вмс_АдаптацияКонфигурацийУТ10;
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоУТ() Тогда 
		Возврат вмс_АдаптацияКонфигурацийУТ;
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		Возврат вмс_АдаптацияКонфигурацийУНФ;
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоБП() Тогда 
		Возврат вмс_АдаптацияКонфигурацийБП;
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоАвтосалон() Тогда 
		Возврат вмс_АдаптацияКонфигурацийАвтосалон;
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоЕРП() Тогда
		Возврат вмс_АдаптацияКонфигурацийЕРП;
	КонецЕсли;
		
КонецФункции
