&НаКлиенте
Функция СформироватьШтрихкодТары()

	СформироватьШтрихкодТарыСервер();	

КонецФункции // СформироватьШтрихкодТары()

&НаСервере
Функция СформироватьШтрихкодТарыСервер()  
	
	Если ЗначениеЗаполнено(Объект.ТипТары) Тогда		
		Объект.Штрихкод = Справочники.вмс_Контейнеры.ПолучитьНовыйНомерТары(Объект.ТипТары); 
	Иначе
		Объект.Штрихкод = "";		
	КонецЕсли;

КонецФункции // СформироватьШтрихкодТары()

&НаКлиенте
Процедура ТипТарыПриИзменении(Элемент)
	СформироватьШтрихкодТары();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	вмс_УправлениеСвойствамиСервер.ПриСозданииНаСервере(ЭтаФорма, ЭтаФорма.Объект);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОстаткиКонтейнера.Параметры.УстановитьЗначениеПараметра("Контейнер", Объект.Ссылка);
	Иначе
		ОстаткиКонтейнера.Параметры.УстановитьЗначениеПараметра("Контейнер", Справочники.вмс_Контейнеры.ПустаяСсылка());
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	вмс_УправлениеСвойствамиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	вмс_УправлениеСвойствамиСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//вмс_РаботаСФормамиКлиент.ПередЗакрытием(ЭтаФорма, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
КонецПроцедуры

#Область Подключаемые_команды 

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	вмс_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, Объект);
КонецПроцедуры

#КонецОбласти

//Для того, чтобы получить серверную форму, например, для добавления новых элементов формы
&НаСервере
Функция СлужебнаяФункцияВызовСервера(ПрограммныйКод, ДополнительныеПараметры=Неопределено) Экспорт
	Возврат вмс_ОбщегоНазначенияСервер.СлужебнаяФункцияВызовСервераНаФорме(ЭтаФорма, ПрограммныйКод, ДополнительныеПараметры);
КонецФункции

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	ОбновитьДополнительныеРеквизитыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДополнительныеРеквизитыНаСервере()
	вмс_УправлениеСвойствамиСервер.ОбновитьДополнительныеРеквизиты(ЭтаФорма);
КонецПроцедуры
