Функция СоздатьНовыйДокумент(ДокументОснование, ВидОперации, Ответственный, ОбработанныеРасхождения, ТоварныеПоляМассив) Экспорт
	
	Если ОбработанныеРасхождения.Количество() > 0 Тогда
		
	Документ = СоздатьДокумент();
	
	Документ.Дата = ТекущаяДата();
	Документ.Основание = ДокументОснование; 
	Документ.Ответственный = Ответственный;
	Документ.ВидОперации = ВидОперации;    
	
	Для Каждого Элемент Из ОбработанныеРасхождения Цикл
		НоваяСтрока = Документ.Расхождения.Добавить(); 
		НоваяСтрока.Причина = Элемент.ПричинаРасхождения.Ссылка;
		НоваяСтрока.Подкатегория = Элемент.КатегорияРасхождения; 
		НоваяСтрока.Разница = Элемент.Разница;
		Для Каждого ТовПоле Из ТоварныеПоляМассив Цикл
        	НоваяСтрока[ТовПоле] = Элемент[ТовПоле];
		КонецЦикла;
	КонецЦикла;	
	
	Документ.Записать(РежимЗаписиДокумента.Проведение); 
	
	КонецЕсли;

	
КонецФункции
