#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПечатьТонкийКлиент(Параметры) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент = СформироватьПечатнуюФормуДляПринтераЭтикеток(ТабличныйДокумент,Параметры);		
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция СформироватьПечатнуюФормуДляПринтераЭтикеток(ТабличныйДокумент,Параметры)
	
	WMS_Печать = вмс_Печать;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.РазмерСтраницы = "Custom";
	ТабличныйДокумент.ВысотаСтраницы = Параметры.ВысотаЭтикетки;
	ТабличныйДокумент.ШиринаСтраницы = Параметры.ШиринаЭтикетки; 
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСнизу = 0;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	
	Попытка
		
		Для каждого Элемент Из Параметры.КодируемыеЗначения Цикл 
			
			
			Макет = ЭтотОбъект.ПолучитьМакет("Макет");
			Шаблон = Макет.ПолучитьОбласть("ОбластьШтрихкода");
			
			
			WMS_Печать.УстановитьБазовыеПараметрыТабличногоДокумента(Шаблон);
			
			Эталон = ЭтотОбъект.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;  //0.26454
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Параметры.ШиринаЭтикетки / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр(Параметры.ВысотаЭтикетки / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        Элемент.Штрихкод);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь); 
			ПараметрыШтрихкода.Вставить("Масштабировать", Ложь);
			ПараметрыШтрихкода.Вставить("ТипКода", Параметры.ТипКода);
			ПараметрыШтрихкода.Вставить("УбратьЛишнийФон", Истина);
			
			Если ЗначениеЗаполнено(ПараметрыШтрихкода.Штрихкод) Тогда
				Шаблон.Рисунки.Штрихкод.Картинка = WMS_Печать.ИзображениеШтрихкода(ПараметрыШтрихкода);
			Иначе
				ОбщегоНазначения.СообщитьПользователю("Номенклатура: " + Элемент.Номенклатура +  " не имеет штрихкода номенклатуры(пачки) и напечатан не будет");
				Продолжить;
			КонецЕсли; 
			
			Шаблон.Рисунки.Штрихкод.Высота = 1; 
			Шаблон.Рисунки.Штрихкод.Ширина = Параметры.ШиринаЭтикетки;    
			
			ПКода = "" + Элемент.Номенклатура;
			Если ЗначениеЗаполнено(Элемент.Характеристика) Тогда
				ПКода = ПКода + ", " + Элемент.Характеристика;				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Элемент.Серия) Тогда			
				ПКода = ПКода + ", " + Элемент.Серия;			
			КонецЕсли;
			
			Шаблон.Параметры.ПредставлениеКода = ПКода;
			Если Параметры.Отладка Тогда 
				Шаблон.Параметры.ПредставлениеКода =  "" + Шаблон.Параметры.ПредставлениеКода + " - " + ПараметрыШтрихкода.Штрихкод;
			КонецЕсли;			
			Шаблон.ТекущаяОбласть.Шрифт = Новый Шрифт(Шаблон.ТекущаяОбласть.Шрифт,,Параметры.РазмерШрифта,Истина);   
			
			ОбластьПредставления = Шаблон.Область(1,1,1,Шаблон.ШиринаТаблицы);
			ОбластьПредставления.Объединить(); 
			ОбластьПредставления.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			
			КартинкаШтрихкода = Шаблон.Рисунки.Штрихкод; 
			// Сохраним размеры штрихкода
			ВысотаКартинки = КартинкаШтрихкода.Высота;
			ШиринаКартинки = КартинкаШтрихкода.Ширина;
			ВерхКартинки = КартинкаШтрихкода.Верх; 
			ЛевоКартинки = КартинкаШтрихкода.Лево;
			КартинкаШтрихкода.Расположить(ОбластьПредставления);
			// Сохраним размеры штрихкода	
			НоваяШирина = КартинкаШтрихкода.Ширина; 
			НоваяВысота = Параметры.ВысотаЭтикетки - КартинкаШтрихкода.Высота;		
			Разница = (НоваяШирина - ШиринаКартинки) / 2; 
			ВеличинаСдвигаКартинкиНаТекст = КартинкаШтрихкода.Высота / 5; // рассчитаем место, куда можно задвинуть картинку, потому что текст центрирован, внизу есть место
			
			КартинкаШтрихкода.Высота = НоваяВысота + (ВеличинаСдвигаКартинкиНаТекст + 0); 
			КартинкаШтрихкода.Верх = ВерхКартинки - ВеличинаСдвигаКартинкиНаТекст; // задвинем картинку на текст
			КартинкаШтрихкода.Ширина = ШиринаКартинки;
			КартинкаШтрихкода.Лево = ЛевоКартинки + Разница;	
			КартинкаШтрихкода.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
			
			
			ТабличныйДокумент.Вывести(Шаблон);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла; 
		
	Исключение 
		
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
		
	КонецПопытки;
	
	WMS_Печать.УстановитьБазовыеПараметрыТабличногоДокумента(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
	
КонецФункции
	
#КонецЕсли


