&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	спрОбъект = РеквизитФормыВЗначение("Объект");   
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		СКДТовары = Параметры.ЗначениеКопирования.ХранилищеСКДТовары.Получить();
		СКДДокументы = Параметры.ЗначениеКопирования.ХранилищеСКДДокументы.Получить();
	Иначе
		СКДТовары = спрОбъект.ХранилищеСКДТовары.Получить();
		СКДДокументы = спрОбъект.ХранилищеСКДДокументы.Получить();
	КонецЕсли;

	ЭтотОбъект.АдресСКДТовары = СохранитьСКД(СКДТовары, АдресСКДТовары); 
	АдресСКДДокументы = СохранитьСКД(СКДДокументы, АдресСКДДокументы);
	
	Элементы.РаспоряжениеКонфигуратор.СписокВыбора.Очистить();
	вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(Элементы.РаспоряжениеКонфигуратор.СписокВыбора, ПолучитьСписокДокументовКонфигурации()); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтотОбъект.Объект.РаспоряжениеКонфигуратор <> "" Тогда
		ИнициализацияСекцииПросмотраРезультатов();
	КонецЕсли;               
	
	Операция = ЭтотОбъект.Объект.ОперацияДляПросмотраРезультата;  
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряжениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаспоряжениеОбработкаВыбораСервер(ВыбранноеЗначение);   
	
	ИнициализацияСекцииПросмотраРезультатов();
КонецПроцедуры 

&НаСервере
Процедура РаспоряжениеОбработкаВыбораСервер(ВыбранноеЗначение)
	ЭтотОбъект.Объект.РаспоряжениеКонфигуратор = ВыбранноеЗначение;	
	ЭтотОбъект.Объект.Наименование = Строка(Метаданные.НайтиПоПолномуИмени(ВыбранноеЗначение));
	
	спрОбъект = РеквизитФормыВЗначение("Объект");
	
	СКДТовары = спрОбъект.ПолучитьСКДСпискаТоваровДокумента(Ложь); 
	АдресСКДТовары = СохранитьСКД(СКДТовары, АдресСКДТовары);                    
	
	СКДДокументы = спрОбъект.ПолучитьСКДДокументы(Ложь); 
	АдресСКДДокументы = СохранитьСКД(СКДДокументы, АдресСКДДокументы);    
КонецПроцедуры 
	
&НаСервере
Функция ПолучитьСписокДокументовКонфигурации()
	
	Перем Строка;
	
	СписокДокументов = Новый СписокЗначений;
	ДопустимыеИменаТабличныхЧастей = Новый Массив;
	
	// ТУ_Мовчан 12.12.23 ++
	ИменаТабличныхЧастей = вмс_АдаптацияКонфигураций.ПолучитьИмяТабличнойЧасти();
	Если Тип("Массив") = ТипЗнч(ИменаТабличныхЧастей) Тогда
		Для Каждого ИмяТабличнойЧасти Из ИменаТабличныхЧастей Цикл
			ДопустимыеИменаТабличныхЧастей.Добавить(ИмяТабличнойЧасти);
		КонецЦикла;
	Иначе
		ДопустимыеИменаТабличныхЧастей.Добавить(ИменаТабличныхЧастей);
	КонецЕсли;
	// ТУ_Мовчан 12.12.23 --
	//ДопустимыеИменаТабличныхЧастей.Добавить(вмс_АдаптацияКонфигураций.ПолучитьИмяТабличнойЧасти()); 
	ДопустимыеИменаТабличныхЧастей.Добавить(вмс_АдаптацияКонфигураций.ПолучитьИмяТабличнойЧастиПродукция());
	ДопустимыеИменаТабличныхЧастей.Добавить("ДокументыОтгрузки"); //Маршрутные листы  
	
	Для каждого Строка Из Метаданные.Документы Цикл
		Если ЗначениеЗаполнено(Строка.ТабличныеЧасти) Тогда
			
			Для каждого ТабличнаяЧасть Из Строка.ТабличныеЧасти Цикл
				Если ДопустимыеИменаТабличныхЧастей.Найти(ТабличнаяЧасть.Имя) <> Неопределено Тогда
					СписокДокументов.Добавить(Строка.ПолноеИмя(), Строка.Синоним);
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокДокументов;
	
КонецФункции
   
&НаКлиенте
Процедура ИнициализацияСекцииПросмотраРезультатов()
	Массив = Новый Массив(); 
	Массив.Добавить(Тип(СтрЗаменить(ЭтотОбъект.Объект.РаспоряжениеКонфигуратор, "Документ", "ДокументСсылка"))); 
	ТипыРаспоряжений = Новый ОписаниеТипов(Массив);
	
	Элементы.Документ.ОграничениеТипа = ТипыРаспоряжений; 
	Документ = ТипыРаспоряжений.ПривестиЗначение(Документ); 	                           
КонецПроцедуры

///////////////////////////СКД ТОВАРЫ + ///////////////////////////////////////     
//
//
//   

&НаКлиенте
Процедура ИзменитьНастройкиСКДТовары(Команда)	
	Распоряжение = Элементы.РаспоряжениеКонфигуратор.ТекстРедактирования;	
	
	Если Распоряжение <> "" Тогда
		ОО = Новый ОписаниеОповещения("СохранитьНастройкиРедактораТовары",ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ФормаРедакторНастроекСКД", Новый Структура("СКД", АдресСКДТовары),ЭтаФорма,,,,ОО);   
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран документ - основание");
	КонецЕсли;
КонецПроцедуры 

// По умолчанию +
&НаКлиенте
Процедура УстановитьНастройкиСКДТоварыПоУмолчанию(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("НастройкиТоварыПоУмолчаниюОтвет", ЭтотОбъект),
					"Установить настройки СКД для товаров по умолчанию?",
					РежимДиалогаВопрос.ДаНет);
КонецПроцедуры  

&НаКлиенте
Процедура НастройкиТоварыПоУмолчаниюОтвет(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда   
		ЭтаФорма.Модифицированность = Истина;
		УстановитьНастройкиСКДТоварыПоУмолчаниюНаСервере();
	КонецЕсли;
КонецПроцедуры
 
&НаСервере
Процедура УстановитьНастройкиСКДТоварыПоУмолчаниюНаСервере()
	спрОбъект = РеквизитФормыВЗначение("Объект");
	СхемыКомпоновкиДанных = спрОбъект.ПолучитьСКДСпискаТоваровДокумента(Ложь);
	АдресСКДТовары = СохранитьСКД(СхемыКомпоновкиДанных, АдресСКДТовары);
КонецПроцедуры
// По умолчанию -

// Пустые +
&НаКлиенте
Процедура ПустыеНастройкиСКДТовары(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ПустыеНастройкиТоварыОтвет", ЭтотОбъект),
					"Установить пустые настройки СКД для товаров?",
					РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПустыеНастройкиТоварыОтвет(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ЭтаФорма.Модифицированность = Истина;
		ПустыеНастройкиСКДТоварыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПустыеНастройкиСКДТоварыНаСервере()
	спрОбъект = РеквизитФормыВЗначение("Объект");
	СхемыКомпоновкиДанных = спрОбъект.ПолучитьСКДСпискаТоваровДокумента(Истина);
	АдресСКДТовары = СохранитьСКД(СхемыКомпоновкиДанных, АдресСКДТовары);	
КонецПроцедуры
// Пустые -

&НаСервере
Функция СохранитьНастройкиРедактораТовары(АдресСхемыРедактора, ДополнительныеПараметры) Экспорт
	Если АдресСхемыРедактора = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СхемыКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыРедактора);
	АдресСКДТовары = СохранитьСКД(СхемыКомпоновкиДанных, АдресСКДТовары);
	ЭтаФорма.Модифицированность = Истина;
	
	Возврат Истина;
КонецФункции  

&НаСервере
Функция ПросмотрРезультатовТоварыНаСервере()     
	ВходящиеПараметры = Новый Структура("ПараметрДокументы, ВидОперации", Документ, Операция);       
	
	ТабДок = Справочники.вмс_РаспоряженияОпераций.ПолучитьСписокТоваровПоРаспоряжениям(ВходящиеПараметры, Истина);   
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПросмотрРезультатовТовары(Команда)   
	Если ЭтотОбъект.Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Есть не записанные изменения. Операция не может быть выполнена");
	ИначеЕсли ЗначениеЗаполнено(Операция) И ЗначениеЗаполнено(Документ) Тогда
		ТабДок = ПросмотрРезультатовТоварыНаСервере();     
		ТабДок.Показать();  
	ИначеЕсли ЗначениеЗаполнено(Операция) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выведены результаты по запросу без документа");
		ТабДок = ПросмотрРезультатовТоварыНаСервере();     
		ТабДок.Показать();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран тип операции");
	КонецЕсли;
КонецПроцедуры

//
//
//
///////////////////////////СКД ТОВАРЫ - ///////////////////////////////////////   

///////////////////////////СКД ДОКУМЕНТЫ + ///////////////////////////////////////     
//
//
// 

&НаКлиенте
Процедура ИзменитьНастройкиСКДДокументы(Команда)	
	Распоряжение = Элементы.РаспоряжениеКонфигуратор.ТекстРедактирования;
	
	Если Распоряжение <> "" Тогда
		ОО = Новый ОписаниеОповещения("СохранитьНастройкиРедактораДокументы",ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ФормаРедакторНастроекСКД", Новый Структура("СКД", АдресСКДДокументы),ЭтаФорма,,,,ОО);   
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран документ - основание");
	КонецЕсли; 
	
КонецПроцедуры

// По умолчанию +
&НаКлиенте
Процедура УстановитьНастройкиСКДДокументыПоУмолчанию(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("НастройкиДокументыПоУмолчаниюОтвет", ЭтотОбъект),
					"Установить настройки СКД для документов по умолчанию?",
					РежимДиалогаВопрос.ДаНет);
КонецПроцедуры  

&НаКлиенте
Процедура НастройкиДокументыПоУмолчаниюОтвет(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ЭтаФорма.Модифицированность = Истина;
		УстановитьНастройкиСКДДокументыПоУмолчаниюНаСервере();
	КонецЕсли;
КонецПроцедуры
 
&НаСервере
Процедура УстановитьНастройкиСКДДокументыПоУмолчаниюНаСервере()
	спрОбъект = РеквизитФормыВЗначение("Объект");
	СхемыКомпоновкиДанных = спрОбъект.ПолучитьСКДДокументы(Ложь);
	АдресСКДДокументы = СохранитьСКД(СхемыКомпоновкиДанных, АдресСКДДокументы);
КонецПроцедуры 
// По умолчанию -

// Пустые +
&НаКлиенте
Процедура ПустыеНастройкиСКДДокументы(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ПустыеНастройкиДокументыОтвет", ЭтотОбъект),
					"Установить пустые настройки СКД для документов?",
					РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПустыеНастройкиДокументыОтвет(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Модифицированность = Истина;
		ПустыеНастройкиСКДДокументыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПустыеНастройкиСКДДокументыНаСервере()
	спрОбъект = РеквизитФормыВЗначение("Объект");
	СхемыКомпоновкиДанных = спрОбъект.ПолучитьСКДДокументы(Истина);
	АдресСКДДокументы = СохранитьСКД(СхемыКомпоновкиДанных, АдресСКДДокументы);	
КонецПроцедуры
// Пустые -

&НаСервере
Функция СохранитьНастройкиРедактораДокументы(АдресСхемыРедактора, ДополнительныеПараметры) Экспорт
	Если АдресСхемыРедактора = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СхемыКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыРедактора);
	АдресСКДДокументы = СохранитьСКД(СхемыКомпоновкиДанных, АдресСКДДокументы);
	ЭтаФорма.Модифицированность = Истина;
	
	Возврат Истина;
КонецФункции 

&НаСервере
Функция ПросмотрРезультатовДокументыНаСервере()
	ВходящиеПараметры = Новый Структура(); 
	Если Оператор <> Справочники.вмс_НастройкиОператора.ПустаяСсылка() Тогда
		ВходящиеПараметры.Вставить("Оператор", Оператор);
	КонецЕсли;
	
	ТабДок = Справочники.вмс_РаспоряженияОпераций.ПолучитьДанныеПоРаспоряжению(Операция, ЭтотОбъект.Объект.Ссылка, ВходящиеПараметры, Истина);   
		
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПросмотрРезультатовДокументы(Команда)    
	Если ЭтотОбъект.Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Есть не записанные изменения. Операция не может быть выполнена");     
	ИначеЕсли ЗначениеЗаполнено(Операция) Тогда
		ТабДок = ПросмотрРезультатовДокументыНаСервере();     
		ТабДок.Показать();         
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран тип операции");
	КонецЕсли;       
КонецПроцедуры

//
//
//
///////////////////////////СКД ДОКУМЕНТЫ - ///////////////////////////////////////

Функция СохранитьСКД(СхемаКомпоновки, АдресСКД)
	Если ЗначениеЗаполнено(АдресСКД) Тогда
		ПоместитьВоВременноеХранилище(СхемаКомпоновки, АдресСКД);
	Иначе
		АдресСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновки, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли; 
	
	Возврат АдресСКД;
КонецФункции

Функция ПолучитьСхемуКомпоновкиДанных(АдресСКД)	
	Если ЗначениеЗаполнено(АдресСКД) Тогда
		СхемаКомпоновки = ПолучитьИзВременногоХранилища(АдресСКД);
		Возврат СхемаКомпоновки;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	// ТУ_Кошелев_07.06.24 - удалил ограничение на одно распоряжение по одному документу
	//Запрос = Новый Запрос;
	//Запрос.Текст = "
	//|ВЫБРАТЬ
	//|	вмс_РаспоряженияОпераций.РаспоряжениеКонфигуратор КАК РаспоряжениеКонфигуратор
	//|ИЗ
	//|	Справочник.вмс_РаспоряженияОпераций КАК вмс_РаспоряженияОпераций
	//|ГДЕ
	//|	вмс_РаспоряженияОпераций.РаспоряжениеКонфигуратор = &РаспоряжениеКонфигуратор
	//|	И вмс_РаспоряженияОпераций.Ссылка <> &ТекущийОбъект";
	//Запрос.УстановитьПараметр("РаспоряжениеКонфигуратор", ТекущийОбъект.РаспоряжениеКонфигуратор);
	//Запрос.УстановитьПараметр("ТекущийОбъект", ТекущийОбъект.Ссылка);
	//Результат = Запрос.Выполнить().Выбрать();                                                     
	//
	//Если Результат.Следующий() Тогда
	//	ОбщегоНазначения.СообщитьПользователю("Распоряжение по " + ТекущийОбъект.РаспоряжениеКонфигуратор + " уже существует");  
	//	Отказ = Истина;
	//Иначе
		ТекущийОбъект.ХранилищеСКДТовары = Новый ХранилищеЗначения(ПолучитьСхемуКомпоновкиДанных(АдресСКДТовары));
		ТекущийОбъект.ХранилищеСКДДокументы = Новый ХранилищеЗначения(ПолучитьСхемуКомпоновкиДанных(АдресСКДДокументы));
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОперацияПриИзменении(Элемент)
	ЭтотОбъект.Объект.ОперацияДляПросмотраРезультата = Операция;
КонецПроцедуры      


