
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Документ = ПараметрыВыполненияКоманды.Источник.Объект.Ссылка;
	Если ЗначениеЗаполнено(Документ) Тогда
		ОткрытьФорму(ЦенообразованиеКлиент.ИмяФормыПечатьЭтикетокИЦенников(), ЗаполнитьДанныеЗаполнения(Документ));
	Иначе	
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Запишите документ перед печатью";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Функция ЗаполнитьДанныеЗаполнения(ПараметрКоманды)
	
	ТаблицаТоваров = ПараметрКоманды.Товары.Выгрузить();
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьТаблицуТоваров", Истина); 
	Действия.Вставить("ЗаполнитьКоличествоЭтикетокПоДокументу", Истина);
	Действия.Вставить("УстановитьРежим", "ПечатьЭтикеток");
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Товары", ТаблицаТоваров);
	ДанныеЗаполнения.Вставить("СтруктураДействий", Действия);
	
	ПараметрыЗаполнения = Новый Структура("АдресВХранилище", ПоместитьВоВременноеХранилище(ДанныеЗаполнения));	   
	
	Возврат ПараметрыЗаполнения; 
	
КонецФункции
