Функция ПолучитьМестоположенияКонтейнеров(Контейнеры, ДополнительныеПараметры=Неопределено) Экспорт
	
	ТаблицаМестоположенийКонтейнеров = вмс_ПартионныйУчетСервер.ПолучитьМестоположенияКонтейнеров(Контейнеры, ДополнительныеПараметры);
	
	КвазиТаблицаМестоположенийКонтейнеров = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений(ТаблицаМестоположенийКонтейнеров);
	
	Возврат КвазиТаблицаМестоположенийКонтейнеров;
	
КонецФункции

Функция ЯчейкаДляНеразмещенныхКонтейнеров() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	НЕ вмс_МестаХранения.ПометкаУдаления
	|	И НЕ вмс_МестаХранения.ЭтоГруппа
	|	И вмс_МестаХранения.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", "Неразмещенные контейнеры");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции